{
  "item_metadata": {
    "item_id": "TSOTR05",
    "num_documents": 1
  },
  "documents": [
    {
      "content": "Thorpe Hazell always looked upon the affair of the Birmingham Bank from a distinctly humorous point of view, declaring that it was really not worth calling a railway mystery or adventure, and that it scarcely called forth any astuteness on his part. And yet there were facts in the case that are, perhaps, worth recording.\nThe banking firm of Crosbie, Penfold, & Co. was an old-established one in Birmingham, numbering many of the leading manufacturers among its customers. At the time of this story the firm suddenly became aware that they had an enemy, and that this enemy was no other than an exceedingly powerful multi-millionaire of Germanic Jewish origin, named Peter Kinch. His reputation was none of the best in the financial world, and it was rumoured that he would stop at nothing to attain an object.\nHe had a personal quarrel with the senior partner of the bank—old Mr. Crosbie. Kinch's son had met the latter's daughter abroad, and proposed to her before the girl was old enough to know her own mind. Her father was furious when he heard about it, for the young man bore about the same reputation as his father; and although there were hundreds who looked upon him as a \"good catch,\" old Crosbie came of a Puritan family, and retained its instincts strongly.\nSamuel Kinch, who was only unbusinesslike when matters concerned his son, whom he foolishly idolised, went to see Mr. Crosbie on the matter, and, it is said, offered to settle half-a-million on his daughter if the old gentleman would consent to the marriage. This only made him more angry than ever, and he retorted that the girl was not to be sold.\nA couple of years had passed since then, and Phyllis Crosbie had forgotten her girlish love, and was engaged to Charlie Penfold, the son of the junior partner—the \"Co.,\" in reality of the firm. But Samuel Kinch had not forgotten. Deep down in that keen, financial brain of his was a strong instinct of revenge for injuries, and he had taken the affair as a personal slight.\nHowever, outwardly he seemed to have made it up. He was occasionally in Birmingham on business and in contact with Mr. Crosbie, and he never referred to the subject. Then, one day, he deposited the sum of two hundred thousand pounds with the bank.\n\"I have so much business in Birmingham,\" he explained, \"that it will be a matter of great convenience if you will hold this money.\"\nOld Crosbie didn't half like it, and proposed keeping it intact in their strong room; but the other partners prevailed upon him to invest it in securities. For some months nothing was heard about it. Then some strange rumours suddenly got about with regard to the bank. People began to ask for their cash, and quite a little \"run\" was taking place. Suddenly Peter Kinch announced that he wanted his two hundred thousand pounds immediately.\nThe partners were met in consultation in their private room at the bank, which was not yet opened to the public.\n\"Yes,\" said Mr. Crosbie, \"he wants every penny of it to-morrow. We must face it.\"\n\"Under ordinary circumstances we could have paid easily,\" said Mr. Penfold senior, \"but it's very awkward just now. I can't understand matters.\"\n\"I can,\" said old Mr. Crosbie; \"I believe we're the victims of a plot, and that Kinch is working it.\"\n\"But his object?\" asked Charles Penfold.\n\"Partly private, perhaps—but there's something else at the bottom of it, and he could well afford to sacrifice his money here altogether if he gained his ends.\"\n\"What is it?\" asked Charles and his lather simultaneously.\n\"Railway contracts,\" replied Mr. Crosbie. \"It's a question of cutting German estimates by Hill & Co. and a couple of other firms here. If we were to stop payment there would be a serious lack of ready money, because those three firms do most of their business with us. If they can't be sure of ready money now, they daren't undertake the contracts at the price they could otherwise have done. And in steps the German firm, and the firm in question, gentlemen, is really Samuel Kinch. It's a smart bit of business.\"\nHe rose from his seat and took a glance out of the window.\n\"Look here,\" he said to the others.\nIt was ten minutes to ten, the hour when the bank opened, and already five or six people were waiting outside, one of them with a cheque fluttering in his hand, tapping the pavement impatiently with his stick. It was obvious that trouble was ahead.\n\"H'm,\" exclaimed Mr. Penfold. \"I suppose we can hold out today.\"\n\"Yes, for to-day,\" replied the senior partner grimly. \"We have a fair supply of cash, and I don't think there's any danger. But we must have some more before we open to-morrow. We had better ask Simpson to bring us the securities at once. Also we will telegraph to the Imperial and City, asking them to get the money ready for us. Then, perhaps you, Mr. Charles, and Simpson could go up by the 11.12 train and bring it down this evening?\"\nThe Imperial and City Bank acted as London agents for Crosbie, Penfold, & Co., and it would be their office to raise the necessary funds on the firm's securities. A busy hour was passed in going over these documents and signing transfers. Meanwhile, a steady stream of customers kept coming into the bank, and the cashiers were hard at work paying out money.\nSimpson, one of the senior cashiers, who had been selected to accompany Charles Penfold to London, was a particularly smart and level-headed fellow.\n\"I should like to tell you of a rumour I heard last night, sir,\" he said to Mr. Crosbie, when the securities had been looked over and packed in a strong leather bag.\n\"Yes—what is it?\"\n\"Well, sir, we have a powerful enemy, and not over scrupulous...am I right, sir?\"\n\"Quite right. What of that?\"\n\"It would be to his interest to prevent us from getting this money in time, sir, and he might not be particular as to what means he took to do it. One of the juniors was asked a lot of questions about us last night by a suspicious-looking stranger he met—er—well, in a bar. He didn't let out anything, but he told me about it, and just now he saw this same man hanging about the bank.\"\n\"Thank you,\" said Mr. Penfold. \"Of course, Charles,\" he went on, \"you will take every precaution. You had better telegraph to Scotland Yard, and ask for a detective to travel back with you this evening.\"\n\"I'll do better than that, father. I'll wire to my friend Thorpe Hazell. What he doesn't know about railways isn't worth knowing, and I'll ask him to meet me at the Imperial and City. He'll probably come back with us, and I'd really rather have him than an ordinary detective. If there's going to be any attempt at robbery on the line, his advice will be the best to act upon, I'm sure.\"\nThus it came to pass that Thorpe Hazell found himself in consultation with Charles Penfold a little after three o'clock that day in a private room at the Imperial and City Bank, which, as everyone knows, is situated in Throgmorton Street.\n\"I'm sure we are being carefully watched,\" said Penfold. \"You noticed it, didn't you, Simpson?\"\n\"Distinctly, sir. Not only on the train, but I'm certain a taxi followed us here.\"\n\"Well,\" replied Hazell, \"the thing is very obvious. You say you have reason to believe that an attempt is going to be made to rob you of this large sum of money. By the way, what does it consist of and how do you propose to carry it?\"\n\"Mostly of Bank of England notes, but a certain amount of gold. We shall pack it in this bag. If we all three travel with it, it ought to be safe.\"\n\"Well, I'm not so sure of that,\" said Hazell; \"from what you tell me, we evidently have a very wily enemy to deal with, and my experience of railway mysteries tells me there is not always safety in numbers. What train did you think of taking?\"\n\"The 4.55 from Paddington. But if you advised it we might travel by another route.\"\n\"Quite so. But the enemy might have thought of that, too, and taken steps accordingly. We must be prepared for all emergencies. Now, suppose you tell me exactly why you think this attempt is likely to be made. Is there any ulterior motive besides robbery?\"\nPenfold explained that there was, telling Hazell the question of the German contracts. The latter's face brightened during the recital.\n\"Tell me,\" he said, \"suppose your hypothesis is correct and the robbery took place, what would happen?\"\n\"Well, Kinch would know at once, I expect, and would wire to Germany without delay, anticipating the fact that we should have to stop payment tomorrow. He has everything ready, we know.\"\n\"Ah, and suppose he wired and put the machinery in motion, and after all you could pay to-morrow, what about that?\"\n\"He wouldn't be such a fool. Why, it would cost him a million. Sure to. Perhaps more. When a man like Kinch once makes a slip it's pretty bad for his reputation.\"\nHazell got up from his chair and slapped Penfold on the shoulder.\n\"Excellent, my dear chap,\" he exclaimed; \"I thought at first you were only bringing me an ordinary case of prevention of robbery in a train. But this is really likely to be interesting. Quite a little comedy, in fact. That is, if you will place yourself in my hands entirely?\"\n\"Very well,\" replied Penfold, \"but I don't quite see your meaning.\"\n\"Ah, you're rather tired and run down, you see. This affair is making you over anxious. Let me recommend a few hours at the seaside. Bournemouth, now, is a capital place. And, by the way, Mr. Simpson,\" he went on, addressing the cashier, \"it's close on half-past three. Not too soon in the afternoon for a cup of tea. There's an A. B. C. fifty yards from the bank. Go and get some tea, my dear sir, and come back in a quarter of an hour's time; and would you mind bringing me a pint of milk in a bottle and a packet of plasmon chocolate? I shall have to dine en route.\"\nPenfold stared at him in amazement, but Hazell insisted. As soon as he was out of the room Hazell exclaimed:\n\"Quick now—see the directors here and get the cash; it ought to be ready now. Have it as much in notes as possible. We must pack that bag before Simpson returns. I'm afraid I'm going to impose on him a little. Ah, and I shall want another bag—mine will do. I brought it with me in case I was out for the night; and we'll ask the people here to lend us some weights, or anything heavy will do.\"\nHe emptied the things out of his bag, two of the directors came in with the money a few minutes afterwards, and then Penfold began to see daylight. Meanwhile Hazell was rapidly turning over the leaves of a Bradshaw and jotting down notes on a bit of paper, which he presently handed to Penfold.\n\"Follow these directions carefully. It's best for you to keep out of the way. Now then, here comes Simpson. Not a word, gentlemen, please!\"\n\"Well, Mr. Simpson,\" he went on, as the cashier came in, \"Mr. Penfold agrees with me that you had better take the money down with me. He's not feeling very well, and he's going for a little holiday. You will have to explain matters to his partners. You and I will start directly, but I'm going to see Mr. Penfold off first. Come along, old fellow, you'll catch the 4.10 to Bournemouth easily.\"\nHe took him outside the bank, holding his bag in his hand, hailed a hansom, and, as Penfold got in, said to him in a loud tone of voice:\n\"Don't you worry, old chap. I'll see this thing through. It's much better for you to keep out of it, because Simpson and I can manage it. I hope you'll find your sister better when you get to Bournemouth; it may not be so bad as the telegram makes out.\"\nHe noticed, to his intense delight, that a man who was lounging past dropped his stick on the pavement close by, and stopped to pick it up.\n\"Good-bye, Penfold—oh, I was nearly forgetting your bag; here you are. Now then, my man,\" he added, addressing the chauffeur, \"Waterloo Station, sharp!\"\nHe had the satisfaction of seeing the man who had dropped the stick hail another hansom, which followed in the wake of Penfold's.\n\"Ah,\" he said, \"they'll see he takes a ticket for Bournemouth, and they won't suspect anything. Now for a little adventure!\"\nA quarter of an hour later he was seated in a taxi-cab with Simpson, en route for Paddington. The leather bag, heavy with the weight of its contents, lay on the floor in front of them. Once or twice Hazell put his head out of the window and looked behind, laughing softly to himself when he drew it back.\n\"Now, Mr. Simpson,\" he said to his companion, presently, \"you and I are about to run the gauntlet. Perhaps you may think my conduct a little strange, later, but I must beg of you not to question it.\"\n\"Very well,\" replied Simpson, who had hardly taken his eyes off the precious bag in front of him, \"I have every confidence in you, Mr. Hazell.\"\n\"That's right. Now, suppose—mind, I only say suppose—you and I are attacked on the train to-night, you would defend that bag of money, eh?\"\nSimpson turned to him in surprise.\n\"Of course—\" he began, but a smile on the other's face stopped him.\n\"It is a considerable sum, I know,\" he said, \"but not so valuable as a human life—if you were threatened, Mr. Simpson, eh?\"\nAgain the smile crept over his face, and puzzled the cashier for a moment.\n\"I should prefer to save my life, I think,\" went on Hazell. \"Let us look at the matter seriously. You are attacked, we'll say, and the odds are too great. The villains get away with the money. Perhaps you are able to stop the train. But the money has disappeared. You would go to Mr. Crosbie when you reached Birmingham, and tell him of this terrible misfortune. You would tell the Police. This fellow, Kinch, if he's at the bottom of it, would, put his little plan in action at once. Dear me! A most `regrettable incident,' as politicians call it. You would throw the whole blame on me. And then—and then—let us suppose that after all the money was at the bank the next morning. What a surprise! Villainy defeated—virtue triumphant. No! Don't ask me any questions. Here we are at Paddington.\"\nA broad grin broke out on Simpson's face as he got out.\n\"Be careful of the precious bag,\" said Hazell. \"That's right.\"\nThe short winter's day was drawing to a close, and darkness had begun to set in. Hazell looked, suspiciously, all round him, and kept close to Simpson, helping him to carry the heavy bag. They took first-class tickets for Birmingham, and tipped the guard to secure them a compartment. On Hazell giving Simpson directions, the latter got in with the bag, and Hazell stood outside on the platform as if on guard.\nPresently an old clergyman came along with shuffling step. He was about to get into the same compartment, when Hazell stopped him, telling him it was engaged. He bowed politely, and got into the next one. The carriage was well up the platform and in front of the train, and the majority of the passengers were getting in behind, as is often the case at terminal stations.\nA few minutes before the train started a couple of men—strong-looking fellows—came marching up the platform and got into the compartment immediately in front of Simpson. They were dressed rather like farmers, and one of them carried a heavy stick.\nThe positions of the travellers in this particular carriage were now as follows:\n1st compartment—the two men.\n2nd compartment—Simpson.\n3rd compartment—the old clergyman.\nHazell still stood outside the door on the platform. The hand of the great clock was almost on the moment of departure when he suddenly exclaimed:\n\"I've forgotten to get a paper. There's just time.\"\nHe ran back to the bookstall. At the same moment the old clergyman put his head out of the window and watched him. He bought his paper and started back.\nAt that exact moment the guard waved his green lamp, the whistle sounded, and the train began very slowly to move.\n\"Look sharp, sir!\"\nThen Hazell did a very clumsy thing. He caught his toe in the platform and fell, sprawling.\nThe next moment he was on his feet, but it was too late to catch his compartment. He made a rush for the next carriage; his keen eyes detected an empty compartment; he opened the door and swung himself into the moving train. Simpson, who had his head out of the window, saw what had happened. At first he felt strangely disconcerted, and then, once more, he broke into a smile.\nThe first stop was at Oxford. Hazell lit a cigar and threw himself back in his seat, laughing softly to himself.\n\"They are really a very clumsy lot,\" he soliloquised, \"my reputation is quite at stake in allowing it. Never mind, though.\"\nFrom time to time he looked out of the window towards the front of the train, but it was not until they had travelled a considerable distance beyond Reading that the comedy he was expecting began to be played.\nThen he saw, in the darkness, the door of the compartment in front of Simpson's open, and a figure on the footboard. Darting to the other side and looking out of that window he could just discern someone on that side of the carriage also.\nSimpson was sitting in his compartment, wondering what was going to happen. Suddenly there was an awful crashing of glass, and the window on the left-hand side was splintered to bits by a violent blow from a stick from outside. Involuntarily Simpson first started back, and then sprang at the window.\nThe ruse succeeded admirably, for at the same moment the opposite door was opened and a man sprang in. Before Simpson knew what had happened, he felt himself seized by the collar from behind and dragged back. Then the door with the splintered window opened, and the second villain threw himself upon him. Resistance was out of the question. In three minutes Simpson lay on the seat, his hands and feet tied, and a handkerchief bound over his mouth.\n\"There,\" said one of the men, \"that little job's done. It's lucky for you my friend, that that clumsy detective isn't in with you, or we might have had to use this,\" and he showed a revolver. \"But we shan't hurt you. We're just going to search you to see if you have any notes on you, in case they're not all in the bag.\"\nThey set to work, coolly enough, but found nothing.\n\"Well,\" went on the man, \"now we'll clear out. Sorry to have troubled you,\" he added, to the cashier, \"but you should have taken more care of your property. By George, it's precious heavy!\"\n\"Ready?\" asked the other.\n\"Yes—where are we?\"\n\"Between Cholsey and Didcot.\"\n\"Right!\"\nHe gave a sharp tug at the chain of the communication-cord with which every Great Western express is provided inside the carriages. A moment or two later there was a shrieking of the engine whistle and a grinding of the brakes.\nAs the train slowed down the two men, taking the heavy bag with them, prepared to get out. The one who held the bag was actually on the footboard before the train stopped, and Hazell, who was watching from his window, distinctly saw what happened.\nThe train came to a standstill on an embankment, and the two robbers jumped and ran for all they were worth, but not before more than one of the passengers had caught a glimpse of them. The guard came running along the train, together with Hazell.\nThe latter made for Simpson's compartment, and was taken a little aback when he found him lying prostrate, but a couple of seconds sufficed to show he was unhurt. He tore the gag off, and the two of them raised a hue-and-cry that was heard all along the train.\n\"What is it?\" asked the guard.\n\"Robbery!\" shouted Simpson, as they cut his bonds, \"thousands of pounds, man.\"\n\"Money for a Birmingham bank,\" explained Hazell. \"I was in charge of it with the cashier here, only I nearly got left behind at Paddington and travelled in another compartment. Quick! They mustn't escape!\"\n\"What was the money in?\" asked the guard, who thought the men a couple of fools to travel with it as they had done.\n\"A leather bag—they must have taken it off—there were two of them.\"\n\"I saw them running down the embankment,\" exclaimed a passenger who had joined them, \"but I'll swear they were carrying nothing. They vaulted over the fence at the bottom, and each of them used both his hands.\"\nHazell was standing beside the train and a frown swept over his face. He glanced up quickly at the elderly clergyman, who was looking out of the window.\n\"Did you see them, sir?\" he asked.\n\"Yes—yes.\"\n\"Could you make out if they carried a bag?\"\n\"Oh, yes—I'm sure they did.\"\n\"And I'll swear they didn't,\" said the dogged passenger.\n\"We'll search the train—sharp, please,\" said the guard, and he mounted into the old clergyman's compartment at once. But there was nothing there. Nor could anything be discovered in or near the train.\n\"Now,\" said the guard, \"I'm very sorry gentlemen, but I can't delay the train longer. You should have carried the money in my van. All I can do is to stop at Didcot to let you get out and send a telegram or see the police. That's your affair. It's evident they've made off. Take your seats, please!\"\nOne or two passengers who had started on a chase on the spur of the moment came panting back. Hazell nudged Simpson, and they climbed up into the compartment occupied by the clergyman.\n\"This is not your carriage,\" he said mildly, as the train started.\n\"Oh—so I see,\" said Hazell. \"Never mind. This is a terrible thing—terrible!\" and he went on to discuss the robbery.\n\"You had better wire from Didcot to Mr. Crosbie,\" he said to Simpson, \"see the police there, and then come on to Birmingham by a later train.\"\n\"What shall you do?\"\n\"Oh, I think I'll go on. Of course you'll also wire back to London to have the notes stopped. That's all we can do, I think.\"\nAn almost imperceptible smile passed over the face of the old clergyman.\n\"Was it all in notes, may I ask?\"\n\"Oh, no. There was a considerable sum in gold,\" replied Hazell, who, even for an amateur detective, was strangely communicative.\nAt Oxford the old clergyman got out for a moment. Hazell saw him hand a paper to an official, and the latter made for the telegraph office. When he came back to the carriage he got into another compartment. Hazell followed him, a sweet smile on his face. The old clergyman grew very grumpy and uneasy.\nBut Hazell stuck to him like a leech—not only to Birmingham, but all the way to Chester. The old gentleman became more and more uneasy as the train went on. He even told Hazell that he wished to be alone. But Hazell only smiled, and offered excuses. Then he introduced the subject of physical culture, explaining the desirability of lentil and plasmon diet, and giving practical explanation of \"nerve training\" by holding a piece of paper in front of his face at arm's length and keeping the edge in line with the hat-rack opposite. When they got to Chester he stood about on the platform till the empty train was backed off into a siding.\nThen the old gentleman, who had been hovering about the train also, lost his temper, and swore under his breath.\nOld Mr. Crosbie and Mr. Penfold, senior, sat in their private room in the bank, with Simpson standing before them. The latter was having a very bad time of it indeed. Questions and rebukes were being hurled at his devoted head by the two partners.\n\"I cannot understand it at all, can you, Penfold?\"\n\"No,\" said the latter, \"and I'm bound to say I think you have acted in a very strange manner, Simpson. You may go to your place—but there is a detective in the bank, and he has orders to see that you don't leave.\"\nAll the papers were full of the robbery that morning. A little crowd had gathered outside the bank waiting for the doors to open. Several Birmingham firms were in consternation. The partners, who had been up all night, looked at each other blankly.\n\"Can we open?\" asked Mr. Crosbie in a hoarse whisper.\nThe other shook his head.\n\"We daren't,\" he groaned.\nA few minutes passed in silence. The clock in the office marked seven minutes to the hour. A cab dashed up outside.\nThe next moment Charles Penfold, fresh and smiling, stood before the partners, opening a bag, and turning out his pockets before their astounded gaze. There was no time for explanation.\nFive minutes later the doors of the bank opened, and the foremost of the crowd outside entered, wondering what was about to happen. By common consent they gave way to a coarse-looking man who was forcing his way to the paying-out counter, a smile of triumph on his evil features. For they recognised him as the Nemesis of the bank, Samuel Kinch himself, who had come to take his revenge in person.\nHe slammed down a cheque upon the counter. The cashier turned it over carelessly to see the indorsement. He did not even ask him to step into the partners' room. He had his instructions.\n\"You will take it in notes, I suppose, sir?\" he asked coolly.\n\"Yes, if you've got enough,\" replied Kinch insolently.\n\"Oh, that's all right, sir.\"",
      "metadata": {
        "original_metadata": {
          "story_code": "TSOTR05",
          "story_title": "How the Bank Was Saved",
          "author_name": "Unknown",
          "author_code": "VW",
          "plot_summary": "When history between the son of a wealthy lawyer and the daughter of a bank manager becomes intertwined, a plot for revenge is devised! Thorpe Hazell is called upon to prevent the Bank from being robbed!",
          "text_length": 27482,
          "is_solvable": true,
          "story_annotations": {
            "Story Code": "TSOTR05",
            "Annotator #1 Code": "CC",
            "Annotator #2 Code": "MS",
            "Story Title": "How the Bank Was Saved",
            "Plot Summary": "When history between the son of a wealthy lawyer and the daughter of a bank manager becomes intertwined, a plot for revenge is devised! Thorpe Hazell is called upon to prevent the Bank from being robbed!",
            "Content warnings": "",
            "Author Code": "VW",
            "Second author code (if applicable)": "",
            "Investigation-reveal order": "Standard",
            "Reveal border sentence": "There was a dead silence, broken only by the rustle and crackling of roll after roll of Bank of England notes as the cashier counted them out and Kinch checked them, with a snarling expression on his face.",
            "Name of Detective #1": "Thorpe Hazell",
            "Detective #1 Gender": "Male",
            "Detective #1 Role": "Independent amateur",
            "Name of Detective #2": "",
            "Detective #2 Gender": "",
            "Detective #2 Role": "",
            "Number of detectives if more than 2": "",
            "Name of Assistant #1": "",
            "Assistant #1 Gender": "",
            "Assistant #1 Role": "",
            "Name of Assistant #2": "",
            "Assistant #2 Gender": "",
            "Assistant #2 Role": "",
            "Number of assistants if more than 2": "",
            "Number of victims of gender Male": "1",
            "Number of victims of gender Female": "0",
            "Number of victims of gender Non-binary": "0",
            "Number of victims of gender Unknown": "0",
            "Number of victims who are corporate entities": "1",
            "Number of culprits of gender Male": "4",
            "Number of culprits of gender Female": "0",
            "Number of culprits of gender Non-binary": "0",
            "Number of culprits of gender Unknown": "0",
            "Culprits introduced during reveal?": "No",
            "Main culprit independence": "Acts mostly alone with some assistance",
            "Initiator of investigation": "A private client",
            "Role of police": "Police are not present",
            "Focus on crime or quasi-crime": "Crime",
            "Crime trajectory": "Qrime → same qrime",
            "Occurrence of crime or mystery": "During the investigation",
            "Types of qrimes": "Theft, Fraud, Assault",
            "Motives": "Greed, Revenge",
            "Means (murder only)": "",
            "Sufficient clues to guess?": "Yes",
            "Sufficient clues to solve?": "Yes",
            "Correct annotator guess?": "Yes",
            "Types of clues": "Usable in real time (usable → usable), Ex post -- new clue (not mentioned → usable)",
            "Essential clue": "The history of Kinch and Mr.Crosbie",
            "Type of essential clue": "Testimonial clue",
            "Most salient clue": "Passenger insisted that the two men were not carrying any bag with them, and the old clergyman said they were.",
            "Type of most salient clue": "Testimonial clue",
            "Red herring description": "",
            "Type of red herring": "",
            "Presence of planted or fabricated evidence": "",
            "Types of evidence made available": "Testimonial evidence, Physical evidence",
            "Is the crime solved?": "Yes",
            "Decision NOT to alert authorities?": "No",
            "Satisfying narrative account?": "Yes",
            "How satisfying as detective fiction?": "3",
            "Recommend to friend?": "No",
            "Date of First Publication (YYYY-MM-DD)": "1912",
            "Format of First Publication (Journal or Book)": "Book",
            "Name of Journal or Title of Book": "Thrilling Stories of the Railway"
          },
          "author_metadata": {
            "Author Code": "VW",
            "Surname(s)": "Whitechurch",
            "Given Name(s)": "Victor",
            "Sex": "M",
            "Date of Birth (YYYY-MM-DD)": "1868-03-12",
            "Country of Birth": "England",
            "City/Town of Birth": "Norham, Northumberland",
            "Date of Death (YYYY-MM-DD)": "1933-05-25",
            "Country of Death": "England",
            "City/Town of Death": "Buxton, Debyshire",
            "Nationality/ies": "British, English",
            "VIAF": "https://viaf.org/viaf/76448216/"
          }
        },
        "culprit(s), human annotated": "",
        "accomplice(s), human annotated": "",
        "detection": {
          "prompt": "System: You are an ingenious and clever detective who will examine all the clues and reason through all the evidence to solve the crime.\n\nUser: Here is a detective story. Please read the story carefully before you decide who the culprit is.\n\n\nThorpe Hazell always looked upon the affair of the Birmingham Bank from a distinctly humorous point of view, declaring that it was really not worth calling a railway mystery or adventure, and that it scarcely called forth any astuteness on his part. And yet there were facts in the case that are, perhaps, worth recording.\nThe banking firm of Crosbie, Penfold, & Co. was an old-established one in Birmingham, numbering many of the leading manufacturers among its customers. At the time of this story the firm suddenly became aware that they had an enemy, and that this enemy was no other than an exceedingly powerful multi-millionaire of Germanic Jewish origin, named Peter Kinch. His reputation was none of the best in the financial world, and it was rumoured that he would stop at nothing to attain an object.\nHe had a personal quarrel with the senior partner of the bank—old Mr. Crosbie. Kinch's son had met the latter's daughter abroad, and proposed to her before the girl was old enough to know her own mind. Her father was furious when he heard about it, for the young man bore about the same reputation as his father; and although there were hundreds who looked upon him as a \"good catch,\" old Crosbie came of a Puritan family, and retained its instincts strongly.\nSamuel Kinch, who was only unbusinesslike when matters concerned his son, whom he foolishly idolised, went to see Mr. Crosbie on the matter, and, it is said, offered to settle half-a-million on his daughter if the old gentleman would consent to the marriage. This only made him more angry than ever, and he retorted that the girl was not to be sold.\nA couple of years had passed since then, and Phyllis Crosbie had forgotten her girlish love, and was engaged to Charlie Penfold, the son of the junior partner—the \"Co.,\" in reality of the firm. But Samuel Kinch had not forgotten. Deep down in that keen, financial brain of his was a strong instinct of revenge for injuries, and he had taken the affair as a personal slight.\nHowever, outwardly he seemed to have made it up. He was occasionally in Birmingham on business and in contact with Mr. Crosbie, and he never referred to the subject. Then, one day, he deposited the sum of two hundred thousand pounds with the bank.\n\"I have so much business in Birmingham,\" he explained, \"that it will be a matter of great convenience if you will hold this money.\"\nOld Crosbie didn't half like it, and proposed keeping it intact in their strong room; but the other partners prevailed upon him to invest it in securities. For some months nothing was heard about it. Then some strange rumours suddenly got about with regard to the bank. People began to ask for their cash, and quite a little \"run\" was taking place. Suddenly Peter Kinch announced that he wanted his two hundred thousand pounds immediately.\nThe partners were met in consultation in their private room at the bank, which was not yet opened to the public.\n\"Yes,\" said Mr. Crosbie, \"he wants every penny of it to-morrow. We must face it.\"\n\"Under ordinary circumstances we could have paid easily,\" said Mr. Penfold senior, \"but it's very awkward just now. I can't understand matters.\"\n\"I can,\" said old Mr. Crosbie; \"I believe we're the victims of a plot, and that Kinch is working it.\"\n\"But his object?\" asked Charles Penfold.\n\"Partly private, perhaps—but there's something else at the bottom of it, and he could well afford to sacrifice his money here altogether if he gained his ends.\"\n\"What is it?\" asked Charles and his lather simultaneously.\n\"Railway contracts,\" replied Mr. Crosbie. \"It's a question of cutting German estimates by Hill & Co. and a couple of other firms here. If we were to stop payment there would be a serious lack of ready money, because those three firms do most of their business with us. If they can't be sure of ready money now, they daren't undertake the contracts at the price they could otherwise have done. And in steps the German firm, and the firm in question, gentlemen, is really Samuel Kinch. It's a smart bit of business.\"\nHe rose from his seat and took a glance out of the window.\n\"Look here,\" he said to the others.\nIt was ten minutes to ten, the hour when the bank opened, and already five or six people were waiting outside, one of them with a cheque fluttering in his hand, tapping the pavement impatiently with his stick. It was obvious that trouble was ahead.\n\"H'm,\" exclaimed Mr. Penfold. \"I suppose we can hold out today.\"\n\"Yes, for to-day,\" replied the senior partner grimly. \"We have a fair supply of cash, and I don't think there's any danger. But we must have some more before we open to-morrow. We had better ask Simpson to bring us the securities at once. Also we will telegraph to the Imperial and City, asking them to get the money ready for us. Then, perhaps you, Mr. Charles, and Simpson could go up by the 11.12 train and bring it down this evening?\"\nThe Imperial and City Bank acted as London agents for Crosbie, Penfold, & Co., and it would be their office to raise the necessary funds on the firm's securities. A busy hour was passed in going over these documents and signing transfers. Meanwhile, a steady stream of customers kept coming into the bank, and the cashiers were hard at work paying out money.\nSimpson, one of the senior cashiers, who had been selected to accompany Charles Penfold to London, was a particularly smart and level-headed fellow.\n\"I should like to tell you of a rumour I heard last night, sir,\" he said to Mr. Crosbie, when the securities had been looked over and packed in a strong leather bag.\n\"Yes—what is it?\"\n\"Well, sir, we have a powerful enemy, and not over scrupulous...am I right, sir?\"\n\"Quite right. What of that?\"\n\"It would be to his interest to prevent us from getting this money in time, sir, and he might not be particular as to what means he took to do it. One of the juniors was asked a lot of questions about us last night by a suspicious-looking stranger he met—er—well, in a bar. He didn't let out anything, but he told me about it, and just now he saw this same man hanging about the bank.\"\n\"Thank you,\" said Mr. Penfold. \"Of course, Charles,\" he went on, \"you will take every precaution. You had better telegraph to Scotland Yard, and ask for a detective to travel back with you this evening.\"\n\"I'll do better than that, father. I'll wire to my friend Thorpe Hazell. What he doesn't know about railways isn't worth knowing, and I'll ask him to meet me at the Imperial and City. He'll probably come back with us, and I'd really rather have him than an ordinary detective. If there's going to be any attempt at robbery on the line, his advice will be the best to act upon, I'm sure.\"\nThus it came to pass that Thorpe Hazell found himself in consultation with Charles Penfold a little after three o'clock that day in a private room at the Imperial and City Bank, which, as everyone knows, is situated in Throgmorton Street.\n\"I'm sure we are being carefully watched,\" said Penfold. \"You noticed it, didn't you, Simpson?\"\n\"Distinctly, sir. Not only on the train, but I'm certain a taxi followed us here.\"\n\"Well,\" replied Hazell, \"the thing is very obvious. You say you have reason to believe that an attempt is going to be made to rob you of this large sum of money. By the way, what does it consist of and how do you propose to carry it?\"\n\"Mostly of Bank of England notes, but a certain amount of gold. We shall pack it in this bag. If we all three travel with it, it ought to be safe.\"\n\"Well, I'm not so sure of that,\" said Hazell; \"from what you tell me, we evidently have a very wily enemy to deal with, and my experience of railway mysteries tells me there is not always safety in numbers. What train did you think of taking?\"\n\"The 4.55 from Paddington. But if you advised it we might travel by another route.\"\n\"Quite so. But the enemy might have thought of that, too, and taken steps accordingly. We must be prepared for all emergencies. Now, suppose you tell me exactly why you think this attempt is likely to be made. Is there any ulterior motive besides robbery?\"\nPenfold explained that there was, telling Hazell the question of the German contracts. The latter's face brightened during the recital.\n\"Tell me,\" he said, \"suppose your hypothesis is correct and the robbery took place, what would happen?\"\n\"Well, Kinch would know at once, I expect, and would wire to Germany without delay, anticipating the fact that we should have to stop payment tomorrow. He has everything ready, we know.\"\n\"Ah, and suppose he wired and put the machinery in motion, and after all you could pay to-morrow, what about that?\"\n\"He wouldn't be such a fool. Why, it would cost him a million. Sure to. Perhaps more. When a man like Kinch once makes a slip it's pretty bad for his reputation.\"\nHazell got up from his chair and slapped Penfold on the shoulder.\n\"Excellent, my dear chap,\" he exclaimed; \"I thought at first you were only bringing me an ordinary case of prevention of robbery in a train. But this is really likely to be interesting. Quite a little comedy, in fact. That is, if you will place yourself in my hands entirely?\"\n\"Very well,\" replied Penfold, \"but I don't quite see your meaning.\"\n\"Ah, you're rather tired and run down, you see. This affair is making you over anxious. Let me recommend a few hours at the seaside. Bournemouth, now, is a capital place. And, by the way, Mr. Simpson,\" he went on, addressing the cashier, \"it's close on half-past three. Not too soon in the afternoon for a cup of tea. There's an A. B. C. fifty yards from the bank. Go and get some tea, my dear sir, and come back in a quarter of an hour's time; and would you mind bringing me a pint of milk in a bottle and a packet of plasmon chocolate? I shall have to dine en route.\"\nPenfold stared at him in amazement, but Hazell insisted. As soon as he was out of the room Hazell exclaimed:\n\"Quick now—see the directors here and get the cash; it ought to be ready now. Have it as much in notes as possible. We must pack that bag before Simpson returns. I'm afraid I'm going to impose on him a little. Ah, and I shall want another bag—mine will do. I brought it with me in case I was out for the night; and we'll ask the people here to lend us some weights, or anything heavy will do.\"\nHe emptied the things out of his bag, two of the directors came in with the money a few minutes afterwards, and then Penfold began to see daylight. Meanwhile Hazell was rapidly turning over the leaves of a Bradshaw and jotting down notes on a bit of paper, which he presently handed to Penfold.\n\"Follow these directions carefully. It's best for you to keep out of the way. Now then, here comes Simpson. Not a word, gentlemen, please!\"\n\"Well, Mr. Simpson,\" he went on, as the cashier came in, \"Mr. Penfold agrees with me that you had better take the money down with me. He's not feeling very well, and he's going for a little holiday. You will have to explain matters to his partners. You and I will start directly, but I'm going to see Mr. Penfold off first. Come along, old fellow, you'll catch the 4.10 to Bournemouth easily.\"\nHe took him outside the bank, holding his bag in his hand, hailed a hansom, and, as Penfold got in, said to him in a loud tone of voice:\n\"Don't you worry, old chap. I'll see this thing through. It's much better for you to keep out of it, because Simpson and I can manage it. I hope you'll find your sister better when you get to Bournemouth; it may not be so bad as the telegram makes out.\"\nHe noticed, to his intense delight, that a man who was lounging past dropped his stick on the pavement close by, and stopped to pick it up.\n\"Good-bye, Penfold—oh, I was nearly forgetting your bag; here you are. Now then, my man,\" he added, addressing the chauffeur, \"Waterloo Station, sharp!\"\nHe had the satisfaction of seeing the man who had dropped the stick hail another hansom, which followed in the wake of Penfold's.\n\"Ah,\" he said, \"they'll see he takes a ticket for Bournemouth, and they won't suspect anything. Now for a little adventure!\"\nA quarter of an hour later he was seated in a taxi-cab with Simpson, en route for Paddington. The leather bag, heavy with the weight of its contents, lay on the floor in front of them. Once or twice Hazell put his head out of the window and looked behind, laughing softly to himself when he drew it back.\n\"Now, Mr. Simpson,\" he said to his companion, presently, \"you and I are about to run the gauntlet. Perhaps you may think my conduct a little strange, later, but I must beg of you not to question it.\"\n\"Very well,\" replied Simpson, who had hardly taken his eyes off the precious bag in front of him, \"I have every confidence in you, Mr. Hazell.\"\n\"That's right. Now, suppose—mind, I only say suppose—you and I are attacked on the train to-night, you would defend that bag of money, eh?\"\nSimpson turned to him in surprise.\n\"Of course—\" he began, but a smile on the other's face stopped him.\n\"It is a considerable sum, I know,\" he said, \"but not so valuable as a human life—if you were threatened, Mr. Simpson, eh?\"\nAgain the smile crept over his face, and puzzled the cashier for a moment.\n\"I should prefer to save my life, I think,\" went on Hazell. \"Let us look at the matter seriously. You are attacked, we'll say, and the odds are too great. The villains get away with the money. Perhaps you are able to stop the train. But the money has disappeared. You would go to Mr. Crosbie when you reached Birmingham, and tell him of this terrible misfortune. You would tell the Police. This fellow, Kinch, if he's at the bottom of it, would, put his little plan in action at once. Dear me! A most `regrettable incident,' as politicians call it. You would throw the whole blame on me. And then—and then—let us suppose that after all the money was at the bank the next morning. What a surprise! Villainy defeated—virtue triumphant. No! Don't ask me any questions. Here we are at Paddington.\"\nA broad grin broke out on Simpson's face as he got out.\n\"Be careful of the precious bag,\" said Hazell. \"That's right.\"\nThe short winter's day was drawing to a close, and darkness had begun to set in. Hazell looked, suspiciously, all round him, and kept close to Simpson, helping him to carry the heavy bag. They took first-class tickets for Birmingham, and tipped the guard to secure them a compartment. On Hazell giving Simpson directions, the latter got in with the bag, and Hazell stood outside on the platform as if on guard.\nPresently an old clergyman came along with shuffling step. He was about to get into the same compartment, when Hazell stopped him, telling him it was engaged. He bowed politely, and got into the next one. The carriage was well up the platform and in front of the train, and the majority of the passengers were getting in behind, as is often the case at terminal stations.\nA few minutes before the train started a couple of men—strong-looking fellows—came marching up the platform and got into the compartment immediately in front of Simpson. They were dressed rather like farmers, and one of them carried a heavy stick.\nThe positions of the travellers in this particular carriage were now as follows:\n1st compartment—the two men.\n2nd compartment—Simpson.\n3rd compartment—the old clergyman.\nHazell still stood outside the door on the platform. The hand of the great clock was almost on the moment of departure when he suddenly exclaimed:\n\"I've forgotten to get a paper. There's just time.\"\nHe ran back to the bookstall. At the same moment the old clergyman put his head out of the window and watched him. He bought his paper and started back.\nAt that exact moment the guard waved his green lamp, the whistle sounded, and the train began very slowly to move.\n\"Look sharp, sir!\"\nThen Hazell did a very clumsy thing. He caught his toe in the platform and fell, sprawling.\nThe next moment he was on his feet, but it was too late to catch his compartment. He made a rush for the next carriage; his keen eyes detected an empty compartment; he opened the door and swung himself into the moving train. Simpson, who had his head out of the window, saw what had happened. At first he felt strangely disconcerted, and then, once more, he broke into a smile.\nThe first stop was at Oxford. Hazell lit a cigar and threw himself back in his seat, laughing softly to himself.\n\"They are really a very clumsy lot,\" he soliloquised, \"my reputation is quite at stake in allowing it. Never mind, though.\"\nFrom time to time he looked out of the window towards the front of the train, but it was not until they had travelled a considerable distance beyond Reading that the comedy he was expecting began to be played.\nThen he saw, in the darkness, the door of the compartment in front of Simpson's open, and a figure on the footboard. Darting to the other side and looking out of that window he could just discern someone on that side of the carriage also.\nSimpson was sitting in his compartment, wondering what was going to happen. Suddenly there was an awful crashing of glass, and the window on the left-hand side was splintered to bits by a violent blow from a stick from outside. Involuntarily Simpson first started back, and then sprang at the window.\nThe ruse succeeded admirably, for at the same moment the opposite door was opened and a man sprang in. Before Simpson knew what had happened, he felt himself seized by the collar from behind and dragged back. Then the door with the splintered window opened, and the second villain threw himself upon him. Resistance was out of the question. In three minutes Simpson lay on the seat, his hands and feet tied, and a handkerchief bound over his mouth.\n\"There,\" said one of the men, \"that little job's done. It's lucky for you my friend, that that clumsy detective isn't in with you, or we might have had to use this,\" and he showed a revolver. \"But we shan't hurt you. We're just going to search you to see if you have any notes on you, in case they're not all in the bag.\"\nThey set to work, coolly enough, but found nothing.\n\"Well,\" went on the man, \"now we'll clear out. Sorry to have troubled you,\" he added, to the cashier, \"but you should have taken more care of your property. By George, it's precious heavy!\"\n\"Ready?\" asked the other.\n\"Yes—where are we?\"\n\"Between Cholsey and Didcot.\"\n\"Right!\"\nHe gave a sharp tug at the chain of the communication-cord with which every Great Western express is provided inside the carriages. A moment or two later there was a shrieking of the engine whistle and a grinding of the brakes.\nAs the train slowed down the two men, taking the heavy bag with them, prepared to get out. The one who held the bag was actually on the footboard before the train stopped, and Hazell, who was watching from his window, distinctly saw what happened.\nThe train came to a standstill on an embankment, and the two robbers jumped and ran for all they were worth, but not before more than one of the passengers had caught a glimpse of them. The guard came running along the train, together with Hazell.\nThe latter made for Simpson's compartment, and was taken a little aback when he found him lying prostrate, but a couple of seconds sufficed to show he was unhurt. He tore the gag off, and the two of them raised a hue-and-cry that was heard all along the train.\n\"What is it?\" asked the guard.\n\"Robbery!\" shouted Simpson, as they cut his bonds, \"thousands of pounds, man.\"\n\"Money for a Birmingham bank,\" explained Hazell. \"I was in charge of it with the cashier here, only I nearly got left behind at Paddington and travelled in another compartment. Quick! They mustn't escape!\"\n\"What was the money in?\" asked the guard, who thought the men a couple of fools to travel with it as they had done.\n\"A leather bag—they must have taken it off—there were two of them.\"\n\"I saw them running down the embankment,\" exclaimed a passenger who had joined them, \"but I'll swear they were carrying nothing. They vaulted over the fence at the bottom, and each of them used both his hands.\"\nHazell was standing beside the train and a frown swept over his face. He glanced up quickly at the elderly clergyman, who was looking out of the window.\n\"Did you see them, sir?\" he asked.\n\"Yes—yes.\"\n\"Could you make out if they carried a bag?\"\n\"Oh, yes—I'm sure they did.\"\n\"And I'll swear they didn't,\" said the dogged passenger.\n\"We'll search the train—sharp, please,\" said the guard, and he mounted into the old clergyman's compartment at once. But there was nothing there. Nor could anything be discovered in or near the train.\n\"Now,\" said the guard, \"I'm very sorry gentlemen, but I can't delay the train longer. You should have carried the money in my van. All I can do is to stop at Didcot to let you get out and send a telegram or see the police. That's your affair. It's evident they've made off. Take your seats, please!\"\nOne or two passengers who had started on a chase on the spur of the moment came panting back. Hazell nudged Simpson, and they climbed up into the compartment occupied by the clergyman.\n\"This is not your carriage,\" he said mildly, as the train started.\n\"Oh—so I see,\" said Hazell. \"Never mind. This is a terrible thing—terrible!\" and he went on to discuss the robbery.\n\"You had better wire from Didcot to Mr. Crosbie,\" he said to Simpson, \"see the police there, and then come on to Birmingham by a later train.\"\n\"What shall you do?\"\n\"Oh, I think I'll go on. Of course you'll also wire back to London to have the notes stopped. That's all we can do, I think.\"\nAn almost imperceptible smile passed over the face of the old clergyman.\n\"Was it all in notes, may I ask?\"\n\"Oh, no. There was a considerable sum in gold,\" replied Hazell, who, even for an amateur detective, was strangely communicative.\nAt Oxford the old clergyman got out for a moment. Hazell saw him hand a paper to an official, and the latter made for the telegraph office. When he came back to the carriage he got into another compartment. Hazell followed him, a sweet smile on his face. The old clergyman grew very grumpy and uneasy.\nBut Hazell stuck to him like a leech—not only to Birmingham, but all the way to Chester. The old gentleman became more and more uneasy as the train went on. He even told Hazell that he wished to be alone. But Hazell only smiled, and offered excuses. Then he introduced the subject of physical culture, explaining the desirability of lentil and plasmon diet, and giving practical explanation of \"nerve training\" by holding a piece of paper in front of his face at arm's length and keeping the edge in line with the hat-rack opposite. When they got to Chester he stood about on the platform till the empty train was backed off into a siding.\nThen the old gentleman, who had been hovering about the train also, lost his temper, and swore under his breath.\nOld Mr. Crosbie and Mr. Penfold, senior, sat in their private room in the bank, with Simpson standing before them. The latter was having a very bad time of it indeed. Questions and rebukes were being hurled at his devoted head by the two partners.\n\"I cannot understand it at all, can you, Penfold?\"\n\"No,\" said the latter, \"and I'm bound to say I think you have acted in a very strange manner, Simpson. You may go to your place—but there is a detective in the bank, and he has orders to see that you don't leave.\"\nAll the papers were full of the robbery that morning. A little crowd had gathered outside the bank waiting for the doors to open. Several Birmingham firms were in consternation. The partners, who had been up all night, looked at each other blankly.\n\"Can we open?\" asked Mr. Crosbie in a hoarse whisper.\nThe other shook his head.\n\"We daren't,\" he groaned.\nA few minutes passed in silence. The clock in the office marked seven minutes to the hour. A cab dashed up outside.\nThe next moment Charles Penfold, fresh and smiling, stood before the partners, opening a bag, and turning out his pockets before their astounded gaze. There was no time for explanation.\nFive minutes later the doors of the bank opened, and the foremost of the crowd outside entered, wondering what was about to happen. By common consent they gave way to a coarse-looking man who was forcing his way to the paying-out counter, a smile of triumph on his evil features. For they recognised him as the Nemesis of the bank, Samuel Kinch himself, who had come to take his revenge in person.\nHe slammed down a cheque upon the counter. The cashier turned it over carelessly to see the indorsement. He did not even ask him to step into the partners' room. He had his instructions.\n\"You will take it in notes, I suppose, sir?\" he asked coolly.\n\"Yes, if you've got enough,\" replied Kinch insolently.\n\"Oh, that's all right, sir.\"\nThere was a dead silence, broken only by the rustle and crackling of roll after roll of Bank of England notes as the cashier counted them out and Kinch checked them, with a snarling expression on his face.\nThen arose a hum and a buzz. Kinch had been paid. For half-an-hour the paying cashiers were fairly busy, but the tide was beginning to turn, and in an hour's time the receiving cashiers were doing all the work.\nThe credit of Crosbie, Penfold & Co. was saved, and the tenders for the railway contracts could be delivered without fear of lack of cash for preliminary expenses and raw material.\n\"One in the eye for old Kinch!\" was the verdict of the day.\n\"Oh, the thing was childish!\" said Hazell that evening at the snug little dinner to which old Mr. Crosbie had invited him, but at which he only ate his \"plasmon,\" and partook of seven raw apples—the other partner, Charles Penfold, and Simpson were also present—\"I saw that if there was a sham robbery this cunning Samuel Kinch would heap vengeance on himself. So I sent Mr. Charles Penfold here down to Bournemouth, his pockets stuffed with notes, and my own bag stuffed with gold, and slung on the roof of a hansom to avoid suspicion. It would be difficult for them to connect Bournemouth with Birmingham, but we managed to do so by a devious route.\n\"Then I filled the leather bag with weights and things. Simpson, of course, thought we had the money, ha! ha! ha! Oh, don't say you didn't, Simpson—don't spoil it. It was a clumsy method of attack, but it answered.\"\n\"But what became of that bag?\"\n\"That's just the greatest joke of the whole thing. I was looking out of the window, Simpson, as the beggars got off, and I saw them hand the bag to that sweet old clergyman. The train had hardly stopped before he was out of it. He climbed to the roof of the carriage by the steps at the end, put the bag on the top, and was in at the other side of his compartment in a jiffy. I travelled all the way to Chester to prevent him from laying his hands on that bag, and he was furious. It may be going about the country in that fashion still, for all we know.\"\n\"But why prevent him when it was of no value?\" asked Mr. Crosbie.\n\"That was just it. If he had once discovered it was only a sham robbery he would have given the alarm to Kinch—and that would have spoilt all.\"\n\"Well, Mr. Hazell. I'm sure the Bank is deeply indebted to you.\"\n\"Not at all. It has been a very ludicrous little adventure, and I've thoroughly enjoyed it.\"\nHere he suddenly jumped from his seat, threw himself on his back on the floor, stretching his arms over his head as far as they could reach.\n\"Good gracious,\" exclaimed old Mr. Crosbie, \"what's the matter? Are you ill?\"\n\"I should be,\" replied Hazell gravely, \"very probably, if I did not take fifty deep breaths in a recumbent position. It is the secret of digesting fruit!\"\n\n\nNote the reveal happens at the end of the story, specifically revealed here:\n\nThere was a dead silence, broken only by the rustle and crackling of roll after roll of Bank of England notes as the cashier counted them out and Kinch checked them, with a snarling expression on his face. \nThen arose a hum and a buzz. Kinch had been paid. For half-an-hour the paying cashiers were fairly busy, but the tide was beginning to turn, and in an hour's time the receiving cashiers were doing all the work.\nThe credit of Crosbie, Penfold & Co. was saved, and the tenders for the railway contracts could be delivered without fear of lack of cash for preliminary expenses and raw material.\n\"One in the eye for old Kinch!\" was the verdict of the day.\n\"Oh, the thing was childish!\" said Hazell that evening at the snug little dinner to which old Mr. Crosbie had invited him, but at which he only ate his \"plasmon,\" and partook of seven raw apples—the other partner, Charles Penfold, and Simpson were also present—\"I saw that if there was a sham robbery this cunning Samuel Kinch would heap vengeance on himself. So I sent Mr. Charles Penfold here down to Bournemouth, his pockets stuffed with notes, and my own bag stuffed with gold, and slung on the roof of a hansom to avoid suspicion. It would be difficult for them to connect Bournemouth with Birmingham, but we managed to do so by a devious route.\n\"Then I filled the leather bag with weights and things. Simpson, of course, thought we had the money, ha! ha! ha! Oh, don't say you didn't, Simpson—don't spoil it. It was a clumsy method of attack, but it answered.\"\n\"But what became of that bag?\"\n\"That's just the greatest joke of the whole thing. I was looking out of the window, Simpson, as the beggars got off, and I saw them hand the bag to that sweet old clergyman. The train had hardly stopped before he was out of it. He climbed to the roof of the carriage by the steps at the end, put the bag on the top, and was in at the other side of his compartment in a jiffy. I travelled all the way to Chester to prevent him from laying his hands on that bag, and he was furious. It may be going about the country in that fashion still, for all we know.\"\n\"But why prevent him when it was of no value?\" asked Mr. Crosbie.\n\"That was just it. If he had once discovered it was only a sham robbery he would have given the alarm to Kinch—and that would have spoilt all.\"\n\"Well, Mr. Hazell. I'm sure the Bank is deeply indebted to you.\"\n\"Not at all. It has been a very ludicrous little adventure, and I've thoroughly enjoyed it.\"\nHere he suddenly jumped from his seat, threw himself on his back on the floor, stretching his arms over his head as far as they could reach.\n\"Good gracious,\" exclaimed old Mr. Crosbie, \"what's the matter? Are you ill?\"\n\"I should be,\" replied Hazell gravely, \"very probably, if I did not take fifty deep breaths in a recumbent position. It is the secret of digesting fruit!\"\n\n\nPlease analyze all the clues and evidence presented in the story and identify who the culprit is. Explain your reasoning step by step, considering:\n1. The motives of different characters\n2. The opportunities each character had\n3. Any physical evidence or alibis\n4. (Most Important) The reveal information provided in the final segment\n\nWho is the culprit (or culprits, if more than one) and why? Answer in the form:\nCULPRIT: <name(s) here>\n\nSUSPECTS: <names(s) for all suspects here>\n\nREASON: <reasoning>",
          "solution": "CULPRIT: Samuel Kinch (with the help of three paid agents: the two “farm-looking” men who boarded the train at Paddington and the bogus old clergyman who travelled in the next compartment).\n\nSUSPECTS:  \n• Samuel Kinch – revenge-seeking rival financier.  \n• The two burly “farmers” – instruments of the hold-up.  \n• The pseudo-clergyman – organiser/on-the-spot director of the theft.  \n• Charles Penfold – carried real money by devious route (but purposefully kept out of the danger).  \n• Simpson (cashier) – accompanying the sham bag, but completely innocent.  \n• Thorpe Hazell – detective orchestrating the counter-plot.\n\nREASON:\n\n1. Motive  \n   • Kinch had a long-standing grudge against old Mr Crosbie for refusing his son’s marriage proposal and for publicly slighting him.  \n   • By forcing a “run” on the bank and making it fail to meet his sudden demand for £200,000, Kinch could (i) ruin Crosbie financially and socially and (ii) clear the way for his German combine to secure the huge railway contracts that Crosbie’s Birmingham clients would then be unable to take up.  \n   • Simple robbery of the cash would achieve this perfectly; if the money never reached Birmingham, the bank must close its doors next morning.\n\n2. Opportunity  \n   • Kinch deposited the money months earlier, stirred rumours to start a run, and chose the very day he knew the bank would have to fetch large sums from London.  \n   • His agents openly shadowed Penfold and Simpson, followed them to the Imperial & City Bank, and took places in the same train with the seeming clergyman planted directly behind the cashier’s compartment – ideal positions for the planned attack between Reading and Didcot.\n\n3. Physical evidence / actions  \n   • The two “farmers” smashed a window, overpowered Simpson, seized the leather bag and pulled the communication cord exactly where the line runs on an embankment – a place chosen for an easy getaway.  \n   • Hazell saw the bag instantly handed to the bogus clergyman, who scrambled onto the roof of his carriage and hid it there – proving all three were acting together.  \n   • Hazell’s pursuit of the clergyman to Chester and the man’s increasing irritation confirmed the priest was an accomplice who expected to retrieve and forward the loot.  \n   • When the bank nevertheless opened with ample cash and paid Kinch in full, it exposed the plot: only Kinch’s side could possibly have mounted the attack, and only Kinch stood to lose millions when it failed.\n\n4. The Reveal  \n   • Hazell explains he had substituted scrap-iron for the money; the genuine notes and gold travelled secretly (Penfold via Bournemouth, Hazell’s own bag on a hansom-cab roof, etc.).  \n   • He emphasises that “this cunning Samuel Kinch would heap vengeance on himself” if the robbery were a sham – directly naming Kinch as the brain behind the attempt.  \n   • Because the crooks never got real cash, Kinch’s plan collapsed, his cheque was honoured, and the bank’s credit was saved.\n\nTherefore, the mastermind and true culprit is Samuel Kinch, aided by the three hired train-robbers.",
          "length_warning": "",
          "model": "o3",
          "border_sentence": "There was a dead silence, broken only by the rustle and crackling of roll after roll of Bank of England notes as the cashier counted them out and Kinch checked them, with a snarling expression on his face.",
          "reveal_segment": "There was a dead silence, broken only by the rustle and crackling of roll after roll of Bank of England notes as the cashier counted them out and Kinch checked them, with a snarling expression on his face. \nThen arose a hum and a buzz. Kinch had been paid. For half-an-hour the paying cashiers were fairly busy, but the tide was beginning to turn, and in an hour's time the receiving cashiers were doing all the work.\nThe credit of Crosbie, Penfold & Co. was saved, and the tenders for the railway contracts could be delivered without fear of lack of cash for preliminary expenses and raw material.\n\"One in the eye for old Kinch!\" was the verdict of the day.\n\"Oh, the thing was childish!\" said Hazell that evening at the snug little dinner to which old Mr. Crosbie had invited him, but at which he only ate his \"plasmon,\" and partook of seven raw apples—the other partner, Charles Penfold, and Simpson were also present—\"I saw that if there was a sham robbery this cunning Samuel Kinch would heap vengeance on himself. So I sent Mr. Charles Penfold here down to Bournemouth, his pockets stuffed with notes, and my own bag stuffed with gold, and slung on the roof of a hansom to avoid suspicion. It would be difficult for them to connect Bournemouth with Birmingham, but we managed to do so by a devious route.\n\"Then I filled the leather bag with weights and things. Simpson, of course, thought we had the money, ha! ha! ha! Oh, don't say you didn't, Simpson—don't spoil it. It was a clumsy method of attack, but it answered.\"\n\"But what became of that bag?\"\n\"That's just the greatest joke of the whole thing. I was looking out of the window, Simpson, as the beggars got off, and I saw them hand the bag to that sweet old clergyman. The train had hardly stopped before he was out of it. He climbed to the roof of the carriage by the steps at the end, put the bag on the top, and was in at the other side of his compartment in a jiffy. I travelled all the way to Chester to prevent him from laying his hands on that bag, and he was furious. It may be going about the country in that fashion still, for all we know.\"\n\"But why prevent him when it was of no value?\" asked Mr. Crosbie.\n\"That was just it. If he had once discovered it was only a sham robbery he would have given the alarm to Kinch—and that would have spoilt all.\"\n\"Well, Mr. Hazell. I'm sure the Bank is deeply indebted to you.\"\n\"Not at all. It has been a very ludicrous little adventure, and I've thoroughly enjoyed it.\"\nHere he suddenly jumped from his seat, threw himself on his back on the floor, stretching his arms over his head as far as they could reach.\n\"Good gracious,\" exclaimed old Mr. Crosbie, \"what's the matter? Are you ill?\"\n\"I should be,\" replied Hazell gravely, \"very probably, if I did not take fifty deep breaths in a recumbent position. It is the secret of digesting fruit!\""
        }
      }
    }
  ]
}