{
  "item_metadata": {
    "item_id": "UAMM16",
    "num_documents": 1
  },
  "documents": [
    {
      "content": "It was a land of strange varieties of courage. But, even in the great hills, I never saw a man like Cyrus Mansfield. He was old and dying when this ghastly adventure happened; but, even in the extremity of life, with its terrors on him, he met the thing with his pagan notions of the public welfare, and it is for his own gods to judge him.\nIt was a long afternoon of autumn. The dead man lay in the whitewashed cabin staring up at the cobwebbed ceiling. His left cheek below the eye was burned with the brand of a pistol shot. The track of a bullet ran along the eyebrow, plowing into the skull above the ear. His grizzled hair stood up like a brush, and the fanaticism of his face was exaggerated by the strained postures of death.\nA tall, gaunt woman sat by the door in the sun. She had a lapful of honey locust, and she worked at that, putting the pieces together in a sort of wreath. The branches were full of thorns, and the inside of the woman's hand was torn and wounded upon the balls of the fingers and the palm, but she plaited the thorns together, giving no heed to her injured hand.\nShe did not get up when my Uncle Abner and Squire Randolph entered. She sat over her work with imperturbable stoicism.\nThe man and woman were strangers in the land, preëmpting one of Mansfield's cabins. Their mission was a mystery for conjecture. And now the man's death was a mystery beyond it.\nWhen Randolph inquired how the man had met his death, the woman got up, without a word, went to a cupboard in the wall, took out a dueling pistol, and handed it to him. Then, she spoke in a dreary voice:\n\"He was mad. 'The cause,' he said, 'must have a sacrifice of blood.'\"\nShe looked steadily at the dead man.\n\"Ah, yes,\" she added, \"he was mad!\"\nThen she turned about and went back to her chair in the sun before the door.\nRandolph and Abner examined the weapon. It was a handsome dueling pistol, with an inlaid silver stock and a long, octagon barrel of hard, sharp-edged steel. It had been lately fired, for the exploded percussion cap was still on the nipple.\n\"He was a poor shot,\" said Randolph; \"he very nearly missed.\"\nMy uncle looked closely at the dead man's wound and the burned cheek beneath it. He turned the weapon slowly in his hand, but Randolph was impatient.\n\"Well, Abner,\" he said, \"did the pistol kill him, or was it the finger of God?\"\n\"The pistol killed him,\" replied my uncle.\n\"And shall we believe the woman, eh, Abner?\"\n\"I am willing to believe her,\" replied my uncle.\nThey looked about the cabin. There was blood on the floor and flecked against the wall, and stains on the barrel of the pistol, as though the man had staggered about, stunned by the bullet, before he died. And so the wound looked—not mortal on the instant, but one from which, after some time, a man might die.\nRandolph wrote down his memorandum, and the two went out into the road.\nIt was an afternoon of Paradise. The road ran in a long endless ribbon westward toward the Ohio. Negroes in the wide bottom land were harvesting the corn and setting it up in great bulging shocks tied with grapevine. Beyond on a high wooded knoll, stood a mansion-house with white pillars.\nMy uncle took the duelling pistol out of his pocket and handed it to the Justice of the Peace.\n\"Randolph,\" he said, \"these weapons were made in pairs; there should be another. And,\" he added, \"there is a crest on the butt plate.\"\n\"Virginia is full of such folderols,\" replied the Justice, \"and bought and sold, pledged and traded. It would not serve to identify the dead man. And besides, Abner, why do we care? He is dead by his own hand; his rights and his injuries touch no other; let him lie with his secrets.\"\nHe made a little circling gesture upward with his index finger.\n\"'Duncan is dead,'\" he quoted. \"'After life's fitful fever he sleeps well.' Shall we pay our respects to Mansfield before we ride away?\"\nAnd he indicated the house like a white cornice on the high cliff above them.\nThey had been standing with their backs to the cabin door. Now the woman passed them. She wore a calico sunbonnet, and carried a little bundle tied up in a cotton handkerchief. She set out westward along the road toward the Ohio. She walked slowly, like one bound on an interminable journey.\nMoved by some impulse they looked in at the cabin door. The dead man lay as he had been, his face turned toward the ceiling, his hands grotesquely crossed, his body rigid. But now the sprigs of honey locust, at which the woman worked, were pressed down on his unkempt grizzled hair. The sun lay on the floor, and there was silence.\nThey left the cabin with no word and climbed the long path to the mansion on the hill.\nMansfield sat in a great chair on the pillared porch. It was wide and cool, paved with colored tiles carried over from England in a sailing ship.\nHe was the strangest man I have ever seen. He was old and dying then, but he had a spirit in him that no event could bludgeon into servility. He sat with a gray shawl pinned around his shoulders. The lights and shadows of the afternoon fell on his jaw like a plowshare, on his big, crooked, bony nose, on his hard gray eyes, bringing them into relief against the lines and furrows of his face.\n\"Mansfield,\" cried Randolph, \"how do you do?\"\n\"I still live,\" replied the old man, \"but at any hour I may be ejected out of life.\"\n\"We all live, Mansfield,\" said my uncle, \"as long as God wills.\"\n\"Now, Abner,\" cried the old man, \"you repeat the jargon of the churches. The will of man is the only power in the universe, so far as we can find out, that is able to direct the movings of events. Nothing else that exists can make the most trivial thing happen or cease to happen. No imagined god or demon in all the history of the race has ever influenced the order of events as much as the feeblest human creature in an hour of life. Sit down, Abner, and let me tell you the truth before I cease to exist, as the beasts of the field cease.\"\nHe indicated the great carved oak chairs about him, and the two visitors sat down.\nRandolph loved the vanities of argument, and he thrust in:\n\"I am afraid, Mansfield,\" he said, \"you will never enjoy the pleasures of Paradise.\"\nThe old man made a contemptuous gesture.\n\"Pleasure, Randolph,\" he said, \"is the happiness of little men; big men are after something more. They are after the satisfaction that comes from directing events. This is the only happiness: to crush out every other authority—to be the one dominating authority—to make events take the avenue one likes. This is the happiness of the god of the universe, if there is any god of the universe.\"\nHe moved in his chair, his elbows out, his fingers extended, his bony face uplifted.\n\"Abner,\" he cried, \"I am willing for you to endure life as you find it and say it is the will of God, but, as for me, I will not be cowed into submission. I will not be held back from laying hold of the lever of the great engine merely because the rumble of the machinery fills other men with terror.\"\n\"Mansfield,\" replied my uncle, in his deep, level voice, \"the fear of God is the beginning of wisdom.\"\nThe old man moved his extended arms with a powerful threshing motion, like a vulture beating the air with its great wings.\n\"Fear!\" he cried. \"Why, Abner, fear is the last clutch of the animal clinging to the intelligence of man as it emerges from the instinct of the beast. The first man thought the monsters about him were gods. Our fathers thought the elements were gods, and we think the impulse moving the machinery of the world is the will of some divine authority. And always the only thing in the universe that was superior to these things has been afraid to assert itself. The human will that can change things, that can do as it likes, has been afraid of phantasms that never yet met with anything they could turn aside.\"\nHe clenched his hands, contracted his elbows, and brought them down with an abrupt derisive gesture.\n\"I do not understand,\" he said, \"but I am not afraid. I will not be beaten into submission by vague, inherited terrors. I will not be subservient to things that have a lesser power than I have. I will not yield the control of events to elements that are dead, to laws that are unthinking, or to an influence that cannot change.\n\"Not all the gods that man has ever worshiped can make things happen to-morrow, but I can make them happen; therefore, I am a god above them. And how shall a god that is greater than these gods give over the dominion of events into their hands?\"\n\"And so, Mansfield,\" said Abner, \"you have been acting just now upon this belief?\"\nThe old man turned his bony face sharply on my uncle.\n\"Now, Abner,\" he said, \"what do you mean by this Delphic sentence?\"\nFor reply, my uncle extended his arms toward the whitewashed cabin.\n\"Who is the dead man down there?\"\n\"Randolph can tell you that,\" said Mansfield.\n\"I never saw the man until to-day,\" replied the Justice.\n\"Eh, Randolph,\" cried the old man, \"do you administer the law and have a memory like that? In midsummer the justices sat at the county seat. Have you forgot that inquisition?\"\n\"I have not,\" said the Justice. \"It was a fool's inquiry. One of Nixon's negro women reported a slave plot to poison the wells and attack the people with a curious weapon. She got the description of the weapon out of some preacher's sermon—a kind of spear. If she had named some implement of modern warfare, we could have better credited her story.\"\n\"Well, Randolph,\" cried the old man, \"for all the wisdom of your justices, she spoke the truth. They were pikes the woman saw, and not the spears of the horsemen of Israel. Did you notice a stranger who remained in a corner of the courtroom while the justices were sitting? He disappeared after the trial. But did you mark him, Randolph? He lies dead down yonder in my negro cabin.\"\nA light came into the face of the Justice.\n\"By the Eternal,\" he cried, \"an abolitionist!\"\nHe flipped the gold seals on his watch fob; then he added, with that little circling gesture of his finger:\n\"Well, he has taken himself away with his own hands.\"\n\"He is dead,\" said Mansfield, thrusting out his plowshare jaw, \"as all such vermin ought to be. We are too careless in the South of these vicious reptiles. We ought to stamp them out of life whenever we find them. They are a menace to the peace of the land. They incite the slaves to arson and to murder. They are beyond the law, as the panther and the wolf are. We ought to have the courage to destroy the creatures.\n\"The destiny of this republic,\" he added, \"is in our hands.\"\nMy uncle Abner spoke then:\n\"It is in God's hands,\" he said.\n\"God!\" cried Mansfield. \"I would not give house room to such a god! When we dawdle, Abner, the Yankees always beat us. Why, man, if this thing runs on, it will wind up in a lawsuit. We shall be stripped of our property by a court's writ. And instead of imposing our will on this republic, we shall be answering a little New England lawyer with rejoinders and rebuttals.\"\n\"Would the bayonet be a better answer?\" said my uncle.\n\"Now, Abner,\" said Mansfield, \"you amuse me. These Yankees have no stomach for the bayonet. They are traders, Abner; they handle the shears and the steel-yard.\"\nMy uncle looked steadily at the man.\n\"Virginia held that opinion of New England when the King's troops landed,\" he said. \"It was a common belief. Why, sir, even Washington riding north to the command of the Colonial army, when he heard of the battle of Bunker Hill, did not ask who had won; his only inquiry was, 'Did the militia of Massachusetts fight?' It did fight, Mansfield, with immortal courage.\"\nMy uncle Abner lifted his face and looked out over the great valley, mellow with its ripened corn. His voice fell into a reflective note.\n\"The situation in this republic,\" he said, \"is grave, and I am full of fear. In God's hands the thing would finally adjust itself. In God's slow, devious way it would finally come out all right. But neither you, Mansfield, nor the abolitionist, will leave the thing to God. You will rush in and settle it with violence. You will find a short cut of your own through God's deliberate way, and I tremble before the horror of blood that you would plunge us into.\"\nHe paused again, and his big, bronzed features had the serenity of some vast belief.\n\"To be fair,\" he said, \"everywhere in this republic, to enforce the law everywhere, to put down violence, to try every man who takes the law in his own hand, fairly in the courts, and, if he is guilty, punish him without fear or favor, according to the letter of the statute, to keep everywhere a public sentiment of fair dealing, by an administration of justice above all public clamor—in this time of heat, this is our only hope of peace!\"\nHe spoke in his deep, level voice, and the words seemed to be concrete things having dimensions and weight.\n\"Shall a fanatic who stirs up our slaves to murder,\" said Mansfield, \"be tried like a gentleman before a jury?\"\n\"Aye, Mansfield,\" replied my uncle, \"like a gentleman, and before a jury! If the fanatic murders the citizen, I would hang him, and if the citizen murders the fanatic, I would hang him too, without one finger's weight of difference in the method of procedure. I would show New England that the justice of Virginia is even-eyed. And she would emulate that fairness, and all over the land the law would hold against the unrestraint that is gathering.\"\n\"Abner,\" cried Mansfield, \"you are a dawdler like your god. I know a swifter way.\"\n\"I am ready to believe it,\" replied my uncle. \"Who killed the mad abolitionist down yonder?\"\n\"Who cares,\" said the old man, \"since the beast is dead?\"\n\"I care,\" replied Abner.\n\"Then, find it out, Abner, if you care,\" said the old man, snapping his jaws.\n\"I have found it out,\" said my uncle, \"and it has happened in so strange a way, and with so curious an intervention, that I cannot save the State from shame.\"\n\"It happened in the simplest way imaginable,\" said Randolph: \"The fool killed himself.\"\nIt was not an unthinkable conclusion. The whole land was wrought up to the highest tension. Men were beginning to hold their properties and their lives as of little account in this tremendous issue. The country was ready to flare up in a war, and to fire it the life of one man would be nothing. A thousand madmen were ready to make that sacrifice of life. That a fanatic would shoot himself in Virginia with the idea that the slave owners would be charged by the country with his murder and so the war brought on, was not a thing improbable in that day's extremity of passion. To the madman it would be only the slight sacrifice of his life for the immortal gain of a holy war.\nMy uncle looked at the Justice with a curious smile.\n\"I think Mansfield will hardly believe that,\" he said.\nThe old man laughed.\n\"It is a pretty explanation, Randolph,\" he said, \"and I commend it to all men, but I do not believe it.\"\n\"Not believe it!\" cried the Justice, looking first at my uncle and then at the old man. \"Why, Abner, you said the woman spoke the truth!\"\n\"She did speak it,\" replied my uncle.\n\"Damme, man!\" cried the Justice. \"Why do you beat about? If you believe the woman, why do you gentlemen disbelieve my conclusion on her words?\"",
      "metadata": {
        "original_metadata": {
          "story_code": "UAMM16",
          "story_title": "The Edge of the Shadow",
          "author_name": "Unknown",
          "author_code": "MDP",
          "plot_summary": "A Yankee abolitionist is found dead on a slave plantation from his host’s southern hospitality —offering a duel for listening to his \"manic ramblings.\" While the host confesses to the crime, is he really the killer?",
          "text_length": 22143,
          "is_solvable": true,
          "story_annotations": {
            "Story Code": "UAMM16",
            "Annotator #1 Code": "SK",
            "Annotator #2 Code": "SO",
            "Story Title": "The Edge of the Shadow",
            "Plot Summary": "A Yankee abolitionist is found dead on a slave plantation from his host’s southern hospitality —offering a duel for listening to his \"manic ramblings.\" While the host confesses to the crime, is he really the killer?",
            "Content warnings": "slavery, racism",
            "Author Code": "MDP",
            "Second author code (if applicable)": "",
            "Investigation-reveal order": "Standard",
            "Reveal border sentence": "\"I disbelieve it, Randolph,\" replied my uncle, \"for the convincing reason that I know who killed him.\"",
            "Name of Detective #1": "Abner",
            "Detective #1 Gender": "Male",
            "Detective #1 Role": "Independent amateur",
            "Name of Detective #2": "",
            "Detective #2 Gender": "",
            "Detective #2 Role": "",
            "Number of detectives if more than 2": "",
            "Name of Assistant #1": "Randolph",
            "Assistant #1 Gender": "Male",
            "Assistant #1 Role": "Independent amateur",
            "Name of Assistant #2": "",
            "Assistant #2 Gender": "",
            "Assistant #2 Role": "",
            "Number of assistants if more than 2": "",
            "Number of victims of gender Male": "1",
            "Number of victims of gender Female": "0",
            "Number of victims of gender Non-binary": "0",
            "Number of victims of gender Unknown": "0",
            "Number of victims who are corporate entities": "0",
            "Number of culprits of gender Male": "1",
            "Number of culprits of gender Female": "1",
            "Number of culprits of gender Non-binary": "0",
            "Number of culprits of gender Unknown": "0",
            "Culprits introduced during reveal?": "No",
            "Main culprit independence": "Acts alone",
            "Initiator of investigation": "Unclear/not specified",
            "Role of police": "Police are not present",
            "Focus on crime or quasi-crime": "Crime",
            "Crime trajectory": "Qrime → same qrime",
            "Occurrence of crime or mystery": "Before the investigation",
            "Types of qrimes": "Murder, Theft, Fraud, Breaking and entering",
            "Motives": "Ideology, Pride",
            "Means (murder only)": "Firearm, Accident",
            "Sufficient clues to guess?": "Yes",
            "Sufficient clues to solve?": "Yes",
            "Correct annotator guess?": "Yes",
            "Types of clues": "Usable in real time (usable → usable), Usable only in retrospect (legible → usable), Red herring (usable → legible), Ex post -- new clue (not mentioned → usable), Ex post -- newly usable clue (illegible → usable)",
            "Essential clue": "Woman's injured hand",
            "Type of essential clue": "Physical clue",
            "Most salient clue": "Bullet wound on victim",
            "Type of most salient clue": "Physical clue",
            "Red herring description": "Mansfield's confession",
            "Type of red herring": "Testimonial clue",
            "Presence of planted or fabricated evidence": "",
            "Types of evidence made available": "Testimonial evidence, Physical evidence",
            "Is the crime solved?": "Yes",
            "Decision NOT to alert authorities?": "No",
            "Satisfying narrative account?": "Yes",
            "How satisfying as detective fiction?": "4",
            "Recommend to friend?": "No",
            "Date of First Publication (YYYY-MM-DD)": "1918",
            "Format of First Publication (Journal or Book)": "Book",
            "Name of Journal or Title of Book": "Uncle Abner: Master of Mysteries"
          },
          "author_metadata": {
            "Author Code": "MDP",
            "Surname(s)": "Post",
            "Given Name(s)": "Melville Davisson",
            "Sex": "M",
            "Date of Birth (YYYY-MM-DD)": "1869-04-19",
            "Country of Birth": "United States of America",
            "City/Town of Birth": "Harrison County, West Virginia",
            "Date of Death (YYYY-MM-DD)": "1930-06-23",
            "Country of Death": "United States of America",
            "City/Town of Death": "Harrison County, West Virginia",
            "Nationality/ies": "",
            "VIAF": "https://viaf.org/viaf/129012558/"
          }
        },
        "culprit(s), human annotated": "",
        "accomplice(s), human annotated": "",
        "detection": {
          "prompt": "System: You are an ingenious and clever detective who will examine all the clues and reason through all the evidence to solve the crime.\n\nUser: Here is a detective story. Please read the story carefully before you decide who the culprit is.\n\n\nIt was a land of strange varieties of courage. But, even in the great hills, I never saw a man like Cyrus Mansfield. He was old and dying when this ghastly adventure happened; but, even in the extremity of life, with its terrors on him, he met the thing with his pagan notions of the public welfare, and it is for his own gods to judge him.\nIt was a long afternoon of autumn. The dead man lay in the whitewashed cabin staring up at the cobwebbed ceiling. His left cheek below the eye was burned with the brand of a pistol shot. The track of a bullet ran along the eyebrow, plowing into the skull above the ear. His grizzled hair stood up like a brush, and the fanaticism of his face was exaggerated by the strained postures of death.\nA tall, gaunt woman sat by the door in the sun. She had a lapful of honey locust, and she worked at that, putting the pieces together in a sort of wreath. The branches were full of thorns, and the inside of the woman's hand was torn and wounded upon the balls of the fingers and the palm, but she plaited the thorns together, giving no heed to her injured hand.\nShe did not get up when my Uncle Abner and Squire Randolph entered. She sat over her work with imperturbable stoicism.\nThe man and woman were strangers in the land, preëmpting one of Mansfield's cabins. Their mission was a mystery for conjecture. And now the man's death was a mystery beyond it.\nWhen Randolph inquired how the man had met his death, the woman got up, without a word, went to a cupboard in the wall, took out a dueling pistol, and handed it to him. Then, she spoke in a dreary voice:\n\"He was mad. 'The cause,' he said, 'must have a sacrifice of blood.'\"\nShe looked steadily at the dead man.\n\"Ah, yes,\" she added, \"he was mad!\"\nThen she turned about and went back to her chair in the sun before the door.\nRandolph and Abner examined the weapon. It was a handsome dueling pistol, with an inlaid silver stock and a long, octagon barrel of hard, sharp-edged steel. It had been lately fired, for the exploded percussion cap was still on the nipple.\n\"He was a poor shot,\" said Randolph; \"he very nearly missed.\"\nMy uncle looked closely at the dead man's wound and the burned cheek beneath it. He turned the weapon slowly in his hand, but Randolph was impatient.\n\"Well, Abner,\" he said, \"did the pistol kill him, or was it the finger of God?\"\n\"The pistol killed him,\" replied my uncle.\n\"And shall we believe the woman, eh, Abner?\"\n\"I am willing to believe her,\" replied my uncle.\nThey looked about the cabin. There was blood on the floor and flecked against the wall, and stains on the barrel of the pistol, as though the man had staggered about, stunned by the bullet, before he died. And so the wound looked—not mortal on the instant, but one from which, after some time, a man might die.\nRandolph wrote down his memorandum, and the two went out into the road.\nIt was an afternoon of Paradise. The road ran in a long endless ribbon westward toward the Ohio. Negroes in the wide bottom land were harvesting the corn and setting it up in great bulging shocks tied with grapevine. Beyond on a high wooded knoll, stood a mansion-house with white pillars.\nMy uncle took the duelling pistol out of his pocket and handed it to the Justice of the Peace.\n\"Randolph,\" he said, \"these weapons were made in pairs; there should be another. And,\" he added, \"there is a crest on the butt plate.\"\n\"Virginia is full of such folderols,\" replied the Justice, \"and bought and sold, pledged and traded. It would not serve to identify the dead man. And besides, Abner, why do we care? He is dead by his own hand; his rights and his injuries touch no other; let him lie with his secrets.\"\nHe made a little circling gesture upward with his index finger.\n\"'Duncan is dead,'\" he quoted. \"'After life's fitful fever he sleeps well.' Shall we pay our respects to Mansfield before we ride away?\"\nAnd he indicated the house like a white cornice on the high cliff above them.\nThey had been standing with their backs to the cabin door. Now the woman passed them. She wore a calico sunbonnet, and carried a little bundle tied up in a cotton handkerchief. She set out westward along the road toward the Ohio. She walked slowly, like one bound on an interminable journey.\nMoved by some impulse they looked in at the cabin door. The dead man lay as he had been, his face turned toward the ceiling, his hands grotesquely crossed, his body rigid. But now the sprigs of honey locust, at which the woman worked, were pressed down on his unkempt grizzled hair. The sun lay on the floor, and there was silence.\nThey left the cabin with no word and climbed the long path to the mansion on the hill.\nMansfield sat in a great chair on the pillared porch. It was wide and cool, paved with colored tiles carried over from England in a sailing ship.\nHe was the strangest man I have ever seen. He was old and dying then, but he had a spirit in him that no event could bludgeon into servility. He sat with a gray shawl pinned around his shoulders. The lights and shadows of the afternoon fell on his jaw like a plowshare, on his big, crooked, bony nose, on his hard gray eyes, bringing them into relief against the lines and furrows of his face.\n\"Mansfield,\" cried Randolph, \"how do you do?\"\n\"I still live,\" replied the old man, \"but at any hour I may be ejected out of life.\"\n\"We all live, Mansfield,\" said my uncle, \"as long as God wills.\"\n\"Now, Abner,\" cried the old man, \"you repeat the jargon of the churches. The will of man is the only power in the universe, so far as we can find out, that is able to direct the movings of events. Nothing else that exists can make the most trivial thing happen or cease to happen. No imagined god or demon in all the history of the race has ever influenced the order of events as much as the feeblest human creature in an hour of life. Sit down, Abner, and let me tell you the truth before I cease to exist, as the beasts of the field cease.\"\nHe indicated the great carved oak chairs about him, and the two visitors sat down.\nRandolph loved the vanities of argument, and he thrust in:\n\"I am afraid, Mansfield,\" he said, \"you will never enjoy the pleasures of Paradise.\"\nThe old man made a contemptuous gesture.\n\"Pleasure, Randolph,\" he said, \"is the happiness of little men; big men are after something more. They are after the satisfaction that comes from directing events. This is the only happiness: to crush out every other authority—to be the one dominating authority—to make events take the avenue one likes. This is the happiness of the god of the universe, if there is any god of the universe.\"\nHe moved in his chair, his elbows out, his fingers extended, his bony face uplifted.\n\"Abner,\" he cried, \"I am willing for you to endure life as you find it and say it is the will of God, but, as for me, I will not be cowed into submission. I will not be held back from laying hold of the lever of the great engine merely because the rumble of the machinery fills other men with terror.\"\n\"Mansfield,\" replied my uncle, in his deep, level voice, \"the fear of God is the beginning of wisdom.\"\nThe old man moved his extended arms with a powerful threshing motion, like a vulture beating the air with its great wings.\n\"Fear!\" he cried. \"Why, Abner, fear is the last clutch of the animal clinging to the intelligence of man as it emerges from the instinct of the beast. The first man thought the monsters about him were gods. Our fathers thought the elements were gods, and we think the impulse moving the machinery of the world is the will of some divine authority. And always the only thing in the universe that was superior to these things has been afraid to assert itself. The human will that can change things, that can do as it likes, has been afraid of phantasms that never yet met with anything they could turn aside.\"\nHe clenched his hands, contracted his elbows, and brought them down with an abrupt derisive gesture.\n\"I do not understand,\" he said, \"but I am not afraid. I will not be beaten into submission by vague, inherited terrors. I will not be subservient to things that have a lesser power than I have. I will not yield the control of events to elements that are dead, to laws that are unthinking, or to an influence that cannot change.\n\"Not all the gods that man has ever worshiped can make things happen to-morrow, but I can make them happen; therefore, I am a god above them. And how shall a god that is greater than these gods give over the dominion of events into their hands?\"\n\"And so, Mansfield,\" said Abner, \"you have been acting just now upon this belief?\"\nThe old man turned his bony face sharply on my uncle.\n\"Now, Abner,\" he said, \"what do you mean by this Delphic sentence?\"\nFor reply, my uncle extended his arms toward the whitewashed cabin.\n\"Who is the dead man down there?\"\n\"Randolph can tell you that,\" said Mansfield.\n\"I never saw the man until to-day,\" replied the Justice.\n\"Eh, Randolph,\" cried the old man, \"do you administer the law and have a memory like that? In midsummer the justices sat at the county seat. Have you forgot that inquisition?\"\n\"I have not,\" said the Justice. \"It was a fool's inquiry. One of Nixon's negro women reported a slave plot to poison the wells and attack the people with a curious weapon. She got the description of the weapon out of some preacher's sermon—a kind of spear. If she had named some implement of modern warfare, we could have better credited her story.\"\n\"Well, Randolph,\" cried the old man, \"for all the wisdom of your justices, she spoke the truth. They were pikes the woman saw, and not the spears of the horsemen of Israel. Did you notice a stranger who remained in a corner of the courtroom while the justices were sitting? He disappeared after the trial. But did you mark him, Randolph? He lies dead down yonder in my negro cabin.\"\nA light came into the face of the Justice.\n\"By the Eternal,\" he cried, \"an abolitionist!\"\nHe flipped the gold seals on his watch fob; then he added, with that little circling gesture of his finger:\n\"Well, he has taken himself away with his own hands.\"\n\"He is dead,\" said Mansfield, thrusting out his plowshare jaw, \"as all such vermin ought to be. We are too careless in the South of these vicious reptiles. We ought to stamp them out of life whenever we find them. They are a menace to the peace of the land. They incite the slaves to arson and to murder. They are beyond the law, as the panther and the wolf are. We ought to have the courage to destroy the creatures.\n\"The destiny of this republic,\" he added, \"is in our hands.\"\nMy uncle Abner spoke then:\n\"It is in God's hands,\" he said.\n\"God!\" cried Mansfield. \"I would not give house room to such a god! When we dawdle, Abner, the Yankees always beat us. Why, man, if this thing runs on, it will wind up in a lawsuit. We shall be stripped of our property by a court's writ. And instead of imposing our will on this republic, we shall be answering a little New England lawyer with rejoinders and rebuttals.\"\n\"Would the bayonet be a better answer?\" said my uncle.\n\"Now, Abner,\" said Mansfield, \"you amuse me. These Yankees have no stomach for the bayonet. They are traders, Abner; they handle the shears and the steel-yard.\"\nMy uncle looked steadily at the man.\n\"Virginia held that opinion of New England when the King's troops landed,\" he said. \"It was a common belief. Why, sir, even Washington riding north to the command of the Colonial army, when he heard of the battle of Bunker Hill, did not ask who had won; his only inquiry was, 'Did the militia of Massachusetts fight?' It did fight, Mansfield, with immortal courage.\"\nMy uncle Abner lifted his face and looked out over the great valley, mellow with its ripened corn. His voice fell into a reflective note.\n\"The situation in this republic,\" he said, \"is grave, and I am full of fear. In God's hands the thing would finally adjust itself. In God's slow, devious way it would finally come out all right. But neither you, Mansfield, nor the abolitionist, will leave the thing to God. You will rush in and settle it with violence. You will find a short cut of your own through God's deliberate way, and I tremble before the horror of blood that you would plunge us into.\"\nHe paused again, and his big, bronzed features had the serenity of some vast belief.\n\"To be fair,\" he said, \"everywhere in this republic, to enforce the law everywhere, to put down violence, to try every man who takes the law in his own hand, fairly in the courts, and, if he is guilty, punish him without fear or favor, according to the letter of the statute, to keep everywhere a public sentiment of fair dealing, by an administration of justice above all public clamor—in this time of heat, this is our only hope of peace!\"\nHe spoke in his deep, level voice, and the words seemed to be concrete things having dimensions and weight.\n\"Shall a fanatic who stirs up our slaves to murder,\" said Mansfield, \"be tried like a gentleman before a jury?\"\n\"Aye, Mansfield,\" replied my uncle, \"like a gentleman, and before a jury! If the fanatic murders the citizen, I would hang him, and if the citizen murders the fanatic, I would hang him too, without one finger's weight of difference in the method of procedure. I would show New England that the justice of Virginia is even-eyed. And she would emulate that fairness, and all over the land the law would hold against the unrestraint that is gathering.\"\n\"Abner,\" cried Mansfield, \"you are a dawdler like your god. I know a swifter way.\"\n\"I am ready to believe it,\" replied my uncle. \"Who killed the mad abolitionist down yonder?\"\n\"Who cares,\" said the old man, \"since the beast is dead?\"\n\"I care,\" replied Abner.\n\"Then, find it out, Abner, if you care,\" said the old man, snapping his jaws.\n\"I have found it out,\" said my uncle, \"and it has happened in so strange a way, and with so curious an intervention, that I cannot save the State from shame.\"\n\"It happened in the simplest way imaginable,\" said Randolph: \"The fool killed himself.\"\nIt was not an unthinkable conclusion. The whole land was wrought up to the highest tension. Men were beginning to hold their properties and their lives as of little account in this tremendous issue. The country was ready to flare up in a war, and to fire it the life of one man would be nothing. A thousand madmen were ready to make that sacrifice of life. That a fanatic would shoot himself in Virginia with the idea that the slave owners would be charged by the country with his murder and so the war brought on, was not a thing improbable in that day's extremity of passion. To the madman it would be only the slight sacrifice of his life for the immortal gain of a holy war.\nMy uncle looked at the Justice with a curious smile.\n\"I think Mansfield will hardly believe that,\" he said.\nThe old man laughed.\n\"It is a pretty explanation, Randolph,\" he said, \"and I commend it to all men, but I do not believe it.\"\n\"Not believe it!\" cried the Justice, looking first at my uncle and then at the old man. \"Why, Abner, you said the woman spoke the truth!\"\n\"She did speak it,\" replied my uncle.\n\"Damme, man!\" cried the Justice. \"Why do you beat about? If you believe the woman, why do you gentlemen disbelieve my conclusion on her words?\"\n\"I disbelieve it, Randolph,\" replied my uncle, \"for the convincing reason that I know who killed him.\"\n\"And I,\" cried Mansfield, \"disbelieve it for an equally convincing reason—for the most convincing reason in the world, Randolph,\"—and his big voice laughed in among the pillars and rafters of his porch—\"because I killed him myself!\"\nAbner sat unmoving, and Randolph like a man past belief. The Justice fumbled with the pistol in his pocket, got it out, and laid it on the flat arm on his chair, but he did not speak. The confession overwhelmed him.\nThe old man stood up, and the voice in his time-shaken body was Homeric:\n\"Ho! Ho!\" he cried. \"And so you thought I would be afraid, Randolph, and dodge about like your little men, shaken and overcome by fear.\" And he huddled in his shawl with a dramatic gesture.\n\"Fear!\" And his laugh burst out again in a high staccato. \"Even the devils in Abner's Christian hell lack that! I shot the creature, Randolph! Do you hear the awful words? And do you tremble for me, lest I hang and go to Abner's hell?\"\nThe mock terror in the old man's voice and manner was compelling drama. He indicated the pistol on the chair arm.\n\"Yes,\" he said, \"it is mine. Abner should have known it by the Mansfield arms.\"\n\"I did know it,\" replied my uncle.\nThe old man looked at the Justice with a queer ironical smile; then he went into the house.\n\"Await me, Randolph,\" he said. \"I would produce the evidence and make out your case.\"\nAnd prodded by the words, Randolph cursed bitterly.\n\"By the Eternal,\" he cried, \"I am as little afraid as any of God's creatures, but the man confounds me!\"\nAnd he spoke the truth. He was a justice of the peace in Virginia when only gentlemen could hold that office. He lacked the balance and the ability of his pioneer ancestors, and he was given over to the vanity and the extravagance of words, but fear and all the manifestations of fear were alien to him.\nHe turned when the old man came out with a rosewood box in his hand, and faced him calmly.\n\"Mansfield,\" he said, \"I warn you. I represent the law, and if you have done a murder, I will get you hanged.\"\nThe old man paused, and looked at Randolph with his maddening ironical smile.\n\"Fear again, eh, Randolph!\" he said. \"Is it by fear that you would always restrain me? Shall I be plucked back from the gibbet and Abner's hell only by this fear? It is a menace I have too long disregarded. You must give me a better reason.\"\nMansfield opened the rosewood box and took out a pistol like the one on the arm of Randolph's chair. He held the weapon lightly in his hand.\n\"The creature came here to harangue me,\" he said, \"and like the genie in the copper pot, I gave him his choice of deaths.\"\nHe laughed, for the fancy pleased him.\n\"In the swirl of his heroics, Abner, I carried him the pistol yonder, to the steps of my portico where he stood, and with this other and my father's watch, I sat down here. 'After three minutes, sir,' I said, 'I shall shoot you down. It is my price for hearing your oration. Fire before that time is up. I shall call out the minutes for your convenience.'\n\"And so, I sat here, Abner, with my father's watch, while the creature ranted with my pistol in his hand.\n\"I called out the time, and he harangued me: 'The black of the negro shall be washed white with blood!' And I answered him: 'One minute, sir!'\n\"'The Lord will make Virginia a possession for the bittern!' was his second climax, and I replied, 'Two minutes of your time are up!'\n\"'The South is one great brothel,' he shouted, and I answered, 'Three minutes, my fine fellow,' and shot him as I had promised! He leaped off into the darkness with my unfired pistol and fled to the cabin where you found him.\"\nThere was a moment's silence, and my uncle put out his arm and pointed down across the long meadow to a grim outline traveling far off on the road.\n\"Mansfield,\" he said, \"you have lighted the powder train that God, at His leisure, would have dampened. You have broken the faith of the world in our sincerity. Virginia will be credited with this man's death, and we cannot hang you for it!\"\n\"And why not?\" cried Randolph, standing up. He had been prodded into unmanageable anger. \"The Commonwealth has granted no letters of marque; it has proclaimed no outlawry. Neither Mansfield nor any other has a patent to do murder. I shall get him hanged!\"\nMy uncle shook his head.\n\"No, Randolph,\" he said, \"you cannot hang him.\"\n\"And why not?\" cried the Justice of the Peace, aroused now, and defiant. \"Is Mansfield above the law? If he kills this madman, shall he have a writ of exemption for it?\"\n\"But he did not kill him!\" replied my uncle.\nRandolph was amazed. And Mansfield shook his head slowly, his face retaining its ironical smile.\n\"No, Abner,\" he said, \"let Randolph have his case. I shot him.\"\nThen he put out his hand, as though in courtesy, to my uncle. \"Be at peace,\" he said. \"If I were moved by fear, there is a greater near me than Randolph's gibbet. I shall be dead and buried before his grand jury can hold its inquisition.\"\n\"Mansfield,\" replied my uncle, \"be yourself at peace, for you did not kill him.\"\n\"Not kill him!\" cried the man. \"I shot him thus!\"\nHe sat down in his chair and taking the pistol out of the rosewood box, leveled it at an imaginary figure across the portico. The man's hand was steady and the sun glinted on the steel barrel.\n\"And because you shot thus,\" said Abner, \"you did not kill him. Listen, Mansfield: the pistol that killed the Abolitionist was held upside down and close. The brand on the dead man's face is under the bullet hole. If the pistol had been held as usual, the brand would have been above it. It is a law of pistol wounds: as you turn the weapon, so will the brand follow. Held upside down, the brand was below the wound.\"\nA deepening wonder came into the old man's ironical face.\n\"How did the creature die, then, if I missed him?\"\nAbner took up the weapon on the arm of Randolph's chair.\n\"The dead man did not shoot in Mansfield's fantastic duel,\" he said. \"Nevertheless this pistol has been fired. And observe there is a smeared blood-stain on the sharp edges of the barrel. I think I know what happened.\n\"The madman with his pistol, overwrought, struggled in the cabin yonder to make himself a 'sacrifice of blood' and so bring on this war. Someone resisted his mad act—some one who seized the barrel of the pistol and in this struggle also got a wounded hand. Who in that cabin had a wounded hand, Randolph?\"\n\"By the living God!\" cried the Justice of the Peace. \"The woman who plaited thorns! It was a blind to cover her injured hand!\"\nAbner looked out across the great meadows at a tiny figure far off, fading into the twilight of the distant road that led toward the Ohio.\n\"To cover her injured hand,\" he echoed, \"and also, perhaps, who knows, to symbolize the dead man's mission, as she knew he saw it! The heart of a woman is the deepest of all God's riddles!\"\n\n\nNote the reveal happens at the end of the story, specifically revealed here:\n\n\"I disbelieve it, Randolph,\" replied my uncle, \"for the convincing reason that I know who killed him.\"\n\"And I,\" cried Mansfield, \"disbelieve it for an equally convincing reason—for the most convincing reason in the world, Randolph,\"—and his big voice laughed in among the pillars and rafters of his porch—\"because I killed him myself!\"\nAbner sat unmoving, and Randolph like a man past belief. The Justice fumbled with the pistol in his pocket, got it out, and laid it on the flat arm on his chair, but he did not speak. The confession overwhelmed him.\nThe old man stood up, and the voice in his time-shaken body was Homeric:\n\"Ho! Ho!\" he cried. \"And so you thought I would be afraid, Randolph, and dodge about like your little men, shaken and overcome by fear.\" And he huddled in his shawl with a dramatic gesture.\n\"Fear!\" And his laugh burst out again in a high staccato. \"Even the devils in Abner's Christian hell lack that! I shot the creature, Randolph! Do you hear the awful words? And do you tremble for me, lest I hang and go to Abner's hell?\"\nThe mock terror in the old man's voice and manner was compelling drama. He indicated the pistol on the chair arm.\n\"Yes,\" he said, \"it is mine. Abner should have known it by the Mansfield arms.\"\n\"I did know it,\" replied my uncle.\nThe old man looked at the Justice with a queer ironical smile; then he went into the house.\n\"Await me, Randolph,\" he said. \"I would produce the evidence and make out your case.\"\nAnd prodded by the words, Randolph cursed bitterly.\n\"By the Eternal,\" he cried, \"I am as little afraid as any of God's creatures, but the man confounds me!\"\nAnd he spoke the truth. He was a justice of the peace in Virginia when only gentlemen could hold that office. He lacked the balance and the ability of his pioneer ancestors, and he was given over to the vanity and the extravagance of words, but fear and all the manifestations of fear were alien to him.\nHe turned when the old man came out with a rosewood box in his hand, and faced him calmly.\n\"Mansfield,\" he said, \"I warn you. I represent the law, and if you have done a murder, I will get you hanged.\"\nThe old man paused, and looked at Randolph with his maddening ironical smile.\n\"Fear again, eh, Randolph!\" he said. \"Is it by fear that you would always restrain me? Shall I be plucked back from the gibbet and Abner's hell only by this fear? It is a menace I have too long disregarded. You must give me a better reason.\"\nMansfield opened the rosewood box and took out a pistol like the one on the arm of Randolph's chair. He held the weapon lightly in his hand.\n\"The creature came here to harangue me,\" he said, \"and like the genie in the copper pot, I gave him his choice of deaths.\"\nHe laughed, for the fancy pleased him.\n\"In the swirl of his heroics, Abner, I carried him the pistol yonder, to the steps of my portico where he stood, and with this other and my father's watch, I sat down here. 'After three minutes, sir,' I said, 'I shall shoot you down. It is my price for hearing your oration. Fire before that time is up. I shall call out the minutes for your convenience.'\n\"And so, I sat here, Abner, with my father's watch, while the creature ranted with my pistol in his hand.\n\"I called out the time, and he harangued me: 'The black of the negro shall be washed white with blood!' And I answered him: 'One minute, sir!'\n\"'The Lord will make Virginia a possession for the bittern!' was his second climax, and I replied, 'Two minutes of your time are up!'\n\"'The South is one great brothel,' he shouted, and I answered, 'Three minutes, my fine fellow,' and shot him as I had promised! He leaped off into the darkness with my unfired pistol and fled to the cabin where you found him.\"\nThere was a moment's silence, and my uncle put out his arm and pointed down across the long meadow to a grim outline traveling far off on the road.\n\"Mansfield,\" he said, \"you have lighted the powder train that God, at His leisure, would have dampened. You have broken the faith of the world in our sincerity. Virginia will be credited with this man's death, and we cannot hang you for it!\"\n\"And why not?\" cried Randolph, standing up. He had been prodded into unmanageable anger. \"The Commonwealth has granted no letters of marque; it has proclaimed no outlawry. Neither Mansfield nor any other has a patent to do murder. I shall get him hanged!\"\nMy uncle shook his head.\n\"No, Randolph,\" he said, \"you cannot hang him.\"\n\"And why not?\" cried the Justice of the Peace, aroused now, and defiant. \"Is Mansfield above the law? If he kills this madman, shall he have a writ of exemption for it?\"\n\"But he did not kill him!\" replied my uncle.\nRandolph was amazed. And Mansfield shook his head slowly, his face retaining its ironical smile.\n\"No, Abner,\" he said, \"let Randolph have his case. I shot him.\"\nThen he put out his hand, as though in courtesy, to my uncle. \"Be at peace,\" he said. \"If I were moved by fear, there is a greater near me than Randolph's gibbet. I shall be dead and buried before his grand jury can hold its inquisition.\"\n\"Mansfield,\" replied my uncle, \"be yourself at peace, for you did not kill him.\"\n\"Not kill him!\" cried the man. \"I shot him thus!\"\nHe sat down in his chair and taking the pistol out of the rosewood box, leveled it at an imaginary figure across the portico. The man's hand was steady and the sun glinted on the steel barrel.\n\"And because you shot thus,\" said Abner, \"you did not kill him. Listen, Mansfield: the pistol that killed the Abolitionist was held upside down and close. The brand on the dead man's face is under the bullet hole. If the pistol had been held as usual, the brand would have been above it. It is a law of pistol wounds: as you turn the weapon, so will the brand follow. Held upside down, the brand was below the wound.\"\nA deepening wonder came into the old man's ironical face.\n\"How did the creature die, then, if I missed him?\"\nAbner took up the weapon on the arm of Randolph's chair.\n\"The dead man did not shoot in Mansfield's fantastic duel,\" he said. \"Nevertheless this pistol has been fired. And observe there is a smeared blood-stain on the sharp edges of the barrel. I think I know what happened.\n\"The madman with his pistol, overwrought, struggled in the cabin yonder to make himself a 'sacrifice of blood' and so bring on this war. Someone resisted his mad act—some one who seized the barrel of the pistol and in this struggle also got a wounded hand. Who in that cabin had a wounded hand, Randolph?\"\n\"By the living God!\" cried the Justice of the Peace. \"The woman who plaited thorns! It was a blind to cover her injured hand!\"\nAbner looked out across the great meadows at a tiny figure far off, fading into the twilight of the distant road that led toward the Ohio.\n\"To cover her injured hand,\" he echoed, \"and also, perhaps, who knows, to symbolize the dead man's mission, as she knew he saw it! The heart of a woman is the deepest of all God's riddles!\"\n\n\nPlease analyze all the clues and evidence presented in the story and identify who the culprit is. Explain your reasoning step by step, considering:\n1. The motives of different characters\n2. The opportunities each character had\n3. Any physical evidence or alibis\n4. (Most Important) The reveal information provided in the final segment\n\nWho is the culprit (or culprits, if more than one) and why? Answer in the form:\nCULPRIT: <name(s) here>\n\nSUSPECTS: <names(s) for all suspects here>\n\nREASON: <reasoning>",
          "solution": "CULPRIT: The unnamed abolitionist stranger – he died by his own hand (suicide).  \n\nSUSPECTS: Cyrus Mansfield; the gaunt, tall woman who travelled with the stranger; the stranger himself.  \n\nREASON:   \n1. Motive  \n   • The woman says the stranger was “mad,” crying that “the cause must have a sacrifice of blood.”  \n   • Such self-martyrdom fits the political fanaticism of the time and explains why he would be willing to die.  \n\n2. Opportunity  \n   • After Mansfield’s “duel,” the stranger kept Mansfield’s mate-pistol and took it to the cabin.  \n   • Alone with only the woman to restrain him, he had every chance to perform the intended “sacrifice.”  \n\n3. Physical evidence  \n   • Close-range/contact shot: the left cheek is powder-burned and the wall and floor are flecked with blood—conditions impossible had Mansfield struck him from the distant portico.  \n   • Barrel seized: sticky blood is smeared on the sharp octagonal barrel edges—precisely where another hand would clutch to stop a suicide; the woman’s palm is badly burned and cut, hidden while she pretends to be weaving honey-locust thorns.  \n   • Inverted weapon: the scorch mark is under, not above, the bullet hole.  As Abner explains, when a pistol is turned upside-down the flame of the muzzle follows the inversion, putting the brand below the entry.  Mansfield, re-enacting his shot, holds his weapon right-side-up; therefore the fatal shot cannot be his.  In the struggle, the abolitionist still had his finger on the trigger but the woman’s grip on the barrel twisted the pistol over.  \n\n4. Alibis / eliminations  \n   • Mansfield’s proud confession collapses on the ballistics: his distant, level shot could not leave a close-contact burn, nor invert the brand.  \n   • The woman’s wounds and the blood on the barrel show she tried to prevent the act, not accomplish it.  \n\n5. Final deduction (Abner’s “reveal”)  \n   • “The madman … struggled in the cabin to make himself a ‘sacrifice of blood.’ Someone resisted … who seized the barrel of the pistol and in this struggle also got a wounded hand.”  \n   • That “someone” is the gaunt woman; the man nevertheless pulled the trigger and killed himself.  \n\nHence, although Mansfield boasts and the woman handled the weapon, the only hand that actually fired the fatal shot was the abolitionist’s own.  He is, therefore, the sole true culprit in his death.",
          "length_warning": "",
          "model": "o3",
          "border_sentence": "\"I disbelieve it, Randolph,\" replied my uncle, \"for the convincing reason that I know who killed him.\"",
          "reveal_segment": "\"I disbelieve it, Randolph,\" replied my uncle, \"for the convincing reason that I know who killed him.\"\n\"And I,\" cried Mansfield, \"disbelieve it for an equally convincing reason—for the most convincing reason in the world, Randolph,\"—and his big voice laughed in among the pillars and rafters of his porch—\"because I killed him myself!\"\nAbner sat unmoving, and Randolph like a man past belief. The Justice fumbled with the pistol in his pocket, got it out, and laid it on the flat arm on his chair, but he did not speak. The confession overwhelmed him.\nThe old man stood up, and the voice in his time-shaken body was Homeric:\n\"Ho! Ho!\" he cried. \"And so you thought I would be afraid, Randolph, and dodge about like your little men, shaken and overcome by fear.\" And he huddled in his shawl with a dramatic gesture.\n\"Fear!\" And his laugh burst out again in a high staccato. \"Even the devils in Abner's Christian hell lack that! I shot the creature, Randolph! Do you hear the awful words? And do you tremble for me, lest I hang and go to Abner's hell?\"\nThe mock terror in the old man's voice and manner was compelling drama. He indicated the pistol on the chair arm.\n\"Yes,\" he said, \"it is mine. Abner should have known it by the Mansfield arms.\"\n\"I did know it,\" replied my uncle.\nThe old man looked at the Justice with a queer ironical smile; then he went into the house.\n\"Await me, Randolph,\" he said. \"I would produce the evidence and make out your case.\"\nAnd prodded by the words, Randolph cursed bitterly.\n\"By the Eternal,\" he cried, \"I am as little afraid as any of God's creatures, but the man confounds me!\"\nAnd he spoke the truth. He was a justice of the peace in Virginia when only gentlemen could hold that office. He lacked the balance and the ability of his pioneer ancestors, and he was given over to the vanity and the extravagance of words, but fear and all the manifestations of fear were alien to him.\nHe turned when the old man came out with a rosewood box in his hand, and faced him calmly.\n\"Mansfield,\" he said, \"I warn you. I represent the law, and if you have done a murder, I will get you hanged.\"\nThe old man paused, and looked at Randolph with his maddening ironical smile.\n\"Fear again, eh, Randolph!\" he said. \"Is it by fear that you would always restrain me? Shall I be plucked back from the gibbet and Abner's hell only by this fear? It is a menace I have too long disregarded. You must give me a better reason.\"\nMansfield opened the rosewood box and took out a pistol like the one on the arm of Randolph's chair. He held the weapon lightly in his hand.\n\"The creature came here to harangue me,\" he said, \"and like the genie in the copper pot, I gave him his choice of deaths.\"\nHe laughed, for the fancy pleased him.\n\"In the swirl of his heroics, Abner, I carried him the pistol yonder, to the steps of my portico where he stood, and with this other and my father's watch, I sat down here. 'After three minutes, sir,' I said, 'I shall shoot you down. It is my price for hearing your oration. Fire before that time is up. I shall call out the minutes for your convenience.'\n\"And so, I sat here, Abner, with my father's watch, while the creature ranted with my pistol in his hand.\n\"I called out the time, and he harangued me: 'The black of the negro shall be washed white with blood!' And I answered him: 'One minute, sir!'\n\"'The Lord will make Virginia a possession for the bittern!' was his second climax, and I replied, 'Two minutes of your time are up!'\n\"'The South is one great brothel,' he shouted, and I answered, 'Three minutes, my fine fellow,' and shot him as I had promised! He leaped off into the darkness with my unfired pistol and fled to the cabin where you found him.\"\nThere was a moment's silence, and my uncle put out his arm and pointed down across the long meadow to a grim outline traveling far off on the road.\n\"Mansfield,\" he said, \"you have lighted the powder train that God, at His leisure, would have dampened. You have broken the faith of the world in our sincerity. Virginia will be credited with this man's death, and we cannot hang you for it!\"\n\"And why not?\" cried Randolph, standing up. He had been prodded into unmanageable anger. \"The Commonwealth has granted no letters of marque; it has proclaimed no outlawry. Neither Mansfield nor any other has a patent to do murder. I shall get him hanged!\"\nMy uncle shook his head.\n\"No, Randolph,\" he said, \"you cannot hang him.\"\n\"And why not?\" cried the Justice of the Peace, aroused now, and defiant. \"Is Mansfield above the law? If he kills this madman, shall he have a writ of exemption for it?\"\n\"But he did not kill him!\" replied my uncle.\nRandolph was amazed. And Mansfield shook his head slowly, his face retaining its ironical smile.\n\"No, Abner,\" he said, \"let Randolph have his case. I shot him.\"\nThen he put out his hand, as though in courtesy, to my uncle. \"Be at peace,\" he said. \"If I were moved by fear, there is a greater near me than Randolph's gibbet. I shall be dead and buried before his grand jury can hold its inquisition.\"\n\"Mansfield,\" replied my uncle, \"be yourself at peace, for you did not kill him.\"\n\"Not kill him!\" cried the man. \"I shot him thus!\"\nHe sat down in his chair and taking the pistol out of the rosewood box, leveled it at an imaginary figure across the portico. The man's hand was steady and the sun glinted on the steel barrel.\n\"And because you shot thus,\" said Abner, \"you did not kill him. Listen, Mansfield: the pistol that killed the Abolitionist was held upside down and close. The brand on the dead man's face is under the bullet hole. If the pistol had been held as usual, the brand would have been above it. It is a law of pistol wounds: as you turn the weapon, so will the brand follow. Held upside down, the brand was below the wound.\"\nA deepening wonder came into the old man's ironical face.\n\"How did the creature die, then, if I missed him?\"\nAbner took up the weapon on the arm of Randolph's chair.\n\"The dead man did not shoot in Mansfield's fantastic duel,\" he said. \"Nevertheless this pistol has been fired. And observe there is a smeared blood-stain on the sharp edges of the barrel. I think I know what happened.\n\"The madman with his pistol, overwrought, struggled in the cabin yonder to make himself a 'sacrifice of blood' and so bring on this war. Someone resisted his mad act—some one who seized the barrel of the pistol and in this struggle also got a wounded hand. Who in that cabin had a wounded hand, Randolph?\"\n\"By the living God!\" cried the Justice of the Peace. \"The woman who plaited thorns! It was a blind to cover her injured hand!\"\nAbner looked out across the great meadows at a tiny figure far off, fading into the twilight of the distant road that led toward the Ohio.\n\"To cover her injured hand,\" he echoed, \"and also, perhaps, who knows, to symbolize the dead man's mission, as she knew he saw it! The heart of a woman is the deepest of all God's riddles!\""
        }
      }
    }
  ]
}