{
  "item_metadata": {
    "item_id": "24192",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "24192",
      "content": "THE FIRST ONE\n \n\n By HERBERT D. KASTLE\n \n\n Illustrated by von Dongen\n \n \n [Transcriber's Note: This etext was produced from Analog July 1961.\n Extensive research did not uncover any evidence that the U.S. copyright\n on this publication was renewed.]\n  The first man to return from beyond the Great Frontier may be\n welcomed ... but will it be as a curiosity, rather than as a\n hero...?\n \n \n There was the usual welcoming crowd for a celebrity, and the usual\n speeches by the usual politicians who met him at the airport which had\n once been twenty miles outside of Croton, but which the growing city had\n since engulfed and placed well within its boundaries. But everything\n wasn't usual. The crowd was quiet, and the mayor didn't seem quite as\n at-ease as he'd been on his last big welcoming—for Corporal Berringer,\n one of the crew of the spaceship Washington , first to set Americans\n upon Mars. His Honor's handclasp was somewhat moist and cold. His\n Honor's eyes held a trace of remoteness.\n \n Still, he was the honored home-comer, the successful returnee, the\n hometown boy who had made good in a big way, and they took the triumphal\n tour up Main Street to the new square and the grandstand. There he sat\n between the mayor and a nervous young coed chosen as homecoming queen,\n and looked out at the police and fire department bands, the National\n Guard, the boy scouts and girl scouts, the Elks and Masons. Several of\n the churches in town had shown indecision as to how to instruct their\n parishioners to treat him. But they had all come around. The tremendous\n national interest, the fact that he was the First One, had made them\n come around. It was obvious by now that they would have to adjust as\n they'd adjusted to all the other firsts taking place in these—as the\n newspapers had dubbed the start of the Twenty-first Century—the\n Galloping Twenties.\n \n He was glad when the official greeting was over. He was a very tired man\n and he had come farther, traveled longer and over darker country, than\n any man who'd ever lived before. He wanted a meal at his own table, a\n kiss from his wife, a word from his son, and later to see some old\n friends and a relative or two. He didn't want to talk about the journey.\n He wanted to forget the immediacy, the urgency, the terror; then perhaps\n he would talk.\n \n Or would he? For he had very little to tell. He had traveled and he had\n returned and his voyage was very much like the voyages of the great\n mariners, from Columbus onward—long, dull periods of time passing,\n passing, and then the arrival.\n \n The house had changed. He saw that as soon as the official car let him\n off at 45 Roosevelt Street. The change was, he knew, for the better.\n They had put a porch in front. They had rehabilitated, spruced up,\n almost rebuilt the entire outside and grounds. But he was sorry. He had\n wanted it to be as before.\n \n The head of the American Legion and the chief of police, who had\n escorted him on this trip from the square, didn't ask to go in with him.\n He was glad. He'd had enough of strangers. Not that he was through with\n strangers. There were dozens of them up and down the street, standing\n beside parked cars, looking at him. But when he looked back at them,\n their eyes dropped, they turned away, they began moving off. He was\n still too much the First One to have his gaze met.\n \n He walked up what had once been a concrete path and was now an ornate\n flagstone path. He climbed the new porch and raised the ornamental\n knocker on the new door and heard the soft music sound within. He was\n surprised that he'd had to do this. He'd thought Edith would be watching\n at a window.\n \n And perhaps she had been watching ... but she hadn't opened the door.\n \n The door opened; he looked at her. It hadn't been too long and she\n hadn't changed at all. She was still the small, slender girl he'd loved\n in high school, the small, slender woman he'd married twelve years ago.\n Ralphie was with her. They held onto each other as if seeking mutual\n support, the thirty-three-year old woman and ten-year-old boy. They\n looked at him, and then both moved forward, still together. He said,\n\"It's good to be home!\"\n \n Edith nodded and, still holding to Ralphie with one hand, put the other\n arm around him. He kissed her—her neck, her cheek—and all the old\n jokes came to mind, the jokes of travel-weary, battle-weary men, the\n and- then -I'll-put-my-pack-aside jokes that spoke of terrible hunger.\n She was trembling, and even as her lips came up to touch his he felt the\n difference, and because of this difference he turned with urgency to\n Ralphie and picked him up and hugged him and said, because he could\n think of nothing else to say, \"What a big fella, what a big fella.\"\n \n Ralphie stood in his arms as if his feet were still planted on the\n floor, and he didn't look at his father but somewhere beyond him. \"I\n didn't grow much while you were gone, Dad, Mom says I don't eat enough.\"\n \n So he put him down and told himself that it would all change, that\n everything would loosen up just as his commanding officer, General\n Carlisle, had said it would early this morning before he left\n Washington.\n \n \"Give it some time,\" Carlisle had said. \"You need the time; they need\n the time. And for the love of heaven, don't be sensitive.\"\n \n \n \n Edith was leading him into the living room, her hand lying still in his,\n a cool, dead bird lying still in his. He sat down on the couch, she sat\n down beside him—but she had hesitated. He wasn't being sensitive; she\n had hesitated. His wife had hesitated before sitting down beside him.\n \n Carlisle had said his position was analogous to Columbus', to Vasco De\n Gama's, to Preshoff's when the Russian returned from the Moon—but more\n so. Carlisle had said lots of things, but even Carlisle who had worked\n with him all the way, who had engineered the entire fantastic\n journey—even Carlisle the Nobel prize winner, the multi-degreed genius\n in uniform, had not actually spoken to him as one man to another.\n  The eyes. It always showed in their eyes.\n \n \n He looked across the room at Ralphie, standing in the doorway, a boy\n already tall, already widening in the shoulders, already large of\n feature. It was like looking into the mirror and seeing himself\n twenty-five years ago. But Ralphie's face was drawn, was worried in a\n way that few ten-year-old faces are.\n \n \"How's it going in school?\" he asked.\n \n \"Gee, Dad, it's the second month of summer vacation.\"\n \n \"Well, then, before summer vacation?\"\n \n \"Pretty good.\"\n \n Edith said, \"He made top forum the six-month period before vacation, and\n he made top forum the six-month period you went away, Hank.\"\n \n He nodded, remembering that, remembering everything, remembering the\n warmth of her farewell, the warmth of Ralphie's farewell, their tears as\n he left for the experimental flight station in the Aleutians. They had\n feared for him, having read of the many launchings gone wrong even in\n continent-to-continent experimental flight.\n \n They had been right to worry. He had suffered much after that blow-up.\n But now they should be rejoicing, because he had survived and made the\n long journey. Ralphie suddenly said, \"I got to go, Dad. I promised Walt\n and the others I'd pitch. It's Inter-Town Little League, you know. It's\n Harmon, you know. I got to keep my word.\" Without waiting for an answer,\n he waved his hand—it shook; a ten-year-old boy's hand that shook—and\n ran from the room and from the house.\n \n He and Edith sat beside each other, and he wanted badly to take her in\n his arms, and yet he didn't want to oppress her. He stood up. \"I'm very\n tired. I'd like to lie down a while.\" Which wasn't true, because he'd\n been lying down all the months of the way back.\n \n She said, \"Of course. How stupid of me, expecting you to sit around and\n make small talk and pick up just where you left off.\"\n \n He nodded. But that was exactly what he wanted to do—make small talk\n and pick up just where he'd left off. But they didn't expect it of him;\n they wouldn't let him; they felt he had changed too much.\n \n \n \n She led him upstairs and along the foyer past Ralphie's room and past\n the small guest room to their bedroom. This, too, had changed. It was\n newly painted and it had new furniture. He saw twin beds separated by an\n ornate little table with an ornate little lamp, and this looked more\n ominous a barrier to him than the twelve-foot concrete-and-barbed-wire\n fence around the experimental station.\n \n \"Which one is mine,\" he asked, and tried to smile.\n \n She also tried to smile. \"The one near the window. You always liked the\n fresh air, the sunshine in the morning. You always said it helped you\n to get up on time when you were stationed at the base outside of town.\n You always said it reminded you—being able to see the sky—that you\n were going to go up in it, and that you were going to come down from it\n to this bed again.\"\n \n \"Not this bed,\" he murmured, and was a little sorry afterward.\n \n \"No, not this bed,\" she said quickly. \"Your lodge donated the bedroom\n set and I really didn't know—\" She waved her hand, her face white.\n \n He was sure then that she had known, and that the beds and the barrier\n between them were her own choice, if only an unconscious choice. He went\n to the bed near the window, stripped off his Air Force blue jacket,\n began to take off his shirt, but then remembered that some arm scars\n still showed. He waited for her to leave the room.\n \n She said, \"Well then, rest up, dear,\" and went out.\n \n He took off his shirt and saw himself in the mirror on the opposite\n wall; and then took off his under-shirt. The body scars were faint, the\n scars running in long lines, one dissecting his chest, the other slicing\n diagonally across his upper abdomen to disappear under his trousers.\n There were several more on his back, and one on his right thigh. They'd\n been treated properly and would soon disappear. But she had never seen\n them.\n \n Perhaps she never would. Perhaps pajamas and robes and dark rooms would\n keep them from her until they were gone.\n \n Which was not what he'd considered at all important on leaving Walter\n Reed Hospital early this morning; which was something he found\n distasteful, something he felt beneath them both. And, at the same time,\n he began to understand that there would be many things, previously\n beneath them both, which would have to be considered. She had changed;\n Ralphie had changed; all the people he knew had probably\n changed—because they thought he had changed.\n \n He was tired of thinking. He lay down and closed his eyes. He let\n himself taste bitterness, unhappiness, a loneliness he had never known\n before.\n \n But sometime later, as he was dozing off, a sense of reassurance began\n filtering into his mind. After all, he was still Henry Devers, the same\n man who had left home eleven months ago, with a love for family and\n friends which was, if anything, stronger than before. Once he could\n communicate this, the strangeness would disappear and the First One\n would again become good old Hank. It was little enough to ask for—a\n return to old values, old relationships, the normalcies of the backwash\n instead of the freneticisms of the lime-light. It would certainly be\n granted to him.\n \n He slept.\n \n \n \n Dinner was at seven\n p.m.\n His mother came; his Uncle Joe and Aunt Lucille\n came. Together with Edith, Ralphie and himself, they made six, and ate\n in the dining room at the big table.\n \n Before he'd become the First One, it would have been a noisy affair. His\n family had never been noted for a lack of ebullience, a lack of\n talkativeness, and Ralphie had always chosen mealtimes—especially with\n company present—to describe everything and anything that had happened\n to him during the day. And Edith herself had always chatted, especially\n with his mother, though they didn't agree about much. Still, it had been\n good-natured; the general tone of their lives had been good-natured.\n \n This wasn't good-natured. Exactly what it was he wasn't sure. \"Stiff\"\n was perhaps the word.\n \n They began with grapefruit, Edith and Mother serving quickly,\n efficiently from the kitchen, then sitting down at the table. He looked\n at Mother as he raised his first spoonful of chilled fruit, and said,\n\"Younger than ever.\" It was nothing new; he'd said it many many times\n before, but his mother had always reacted with a bright smile and a quip\n something like, \"Young for the Golden Age Center, you mean.\" This time\n she burst into tears. It shocked him. But what shocked him even more was\n the fact that no one looked up, commented, made any attempt to comfort\n her; no one indicated in any way that a woman was sobbing at the table.\n \n He was sitting directly across from Mother, and reached out and touched\n her left hand which lay limply beside the silverware. She didn't move\n it—she hadn't touched him once beyond that first, quick, strangely-cool\n embrace at the door—then a few seconds later she withdrew it and let it\n drop out of sight.\n \n So there he was, Henry Devers, at home with the family. So there he was,\n the hero returned, waiting to be treated as a human being.\n \n The grapefruit shells were cleaned away and the soup served. Uncle Joe\n began to talk. \"The greatest little development of circular uniform\n houses you ever did see,\" he boomed in his powerful salesman's voice.\n\"Still going like sixty. We'll sell out before—\" At that point he\n looked at Hank, and Hank nodded encouragement, desperately interested in\n this normalcy, and Joe's voice died away. He looked down at his plate,\n mumbled, \"Soup's getting cold,\" and began to eat. His hand shook a\n little; his ruddy face was not quite as ruddy as Hank remembered it.\n \n Aunt Lucille made a few quavering statements about the Ladies' Tuesday\n Garden Club, and Hank looked across the table to where she sat between\n Joe and Mother—his wife and son bracketed him, and yet he felt\n alone—and said, \"I've missed fooling around with the lawn and the rose\n bushes. Here it is August and I haven't had my hand to a mower or\n trowel.\"\n \n Aunt Lucille smiled, if you could call it that—a pitiful twitching of\n the lips—and nodded. She threw her eyes in his direction, and past him,\n and then down to her plate. Mother, who was still sniffling, said, \"I\n have a dismal headache. I'm going to lie down in the guest room a\n while.\" She touched his shoulder in passing—his affectionate, effusive\n mother who would kiss stray dogs and strange children, who had often\n irritated him with an excess of physical and verbal caresses—she barely\n touched his shoulder and fled.\n \n So now five of them sat at the table. The meat was served—thin, rare\n slices of beef, the pink blood-juice oozing warmly from the center. He\n cut into it and raised a forkful to his mouth, then glanced at Ralphie\n and said, \"Looks fresh enough to have been killed in the back yard.\"\n Ralphie said, \"Yeah, Dad.\" Aunt Lucille put down her knife and fork and\n murmured something to her husband. Joe cleared his throat and said\n Lucille was rapidly becoming a vegetarian and he guessed she was going\n into the living room for a while. \"She'll be back for dessert, of\n course,\" he said, his laugh sounding forced.\n \n Hank looked at Edith; Edith was busy with her plate. Hank looked at\n Ralphie; Ralphie was busy with his plate. Hank looked at Joe; Joe was\n chewing, gazing out over their heads to the kitchen. Hank looked at\n Lucille; she was disappearing into the living room.\n \n He brought his fist down on the table. The settings jumped; a glass\n overturned, spilling water. He brought it down again and again. They\n were all standing now. He sat there and pounded the table with his big\n right fist—Henry Devers, who would never have thought of making such a\n scene before, but who was now so sick and tired of being treated as the\n First One, of being stood back from, looked at in awe of, felt in fear\n of, that he could have smashed more than a table.\n \n Edith said, \"Hank!\"\n \n He said, voice hoarse, \"Shut up. Go away. Let me eat alone. I'm sick of\n the lot of you.\"\n \n \n \n Mother and Joe returned a few minutes later where he sat forcing food\n down his throat. Mother said, \"Henry dear—\" He didn't answer. She began\n to cry, and he was glad she left the house then. He had never said\n anything really bad to his mother. He was afraid this would have been\n the time. Joe merely cleared his throat and mumbled something about\n getting together again soon and \"drop out and see the new development\"\n and he, too, was gone. Lucille never did manage to speak to him.\n \n He finished his beef and waited. Soon Edith came in with the special\n dessert she'd been preparing half the day—a magnificent English trifle.\n She served him, and spooned out a portion for herself and Ralphie. She\n hesitated near his chair, and when he made no comment she called the\n boy. Then the three of them were sitting, facing the empty side of the\n table. They ate the trifle. Ralphie finished first and got up and said,\n\"Hey, I promised—\"\n \n \"You promised the boys you'd play baseball or football or handball or\n something; anything to get away from your father.\"\n \n Ralphie's head dropped and he muttered, \"Aw, no, Dad.\"\n \n Edith said, \"He'll stay home, Hank. We'll spend an evening\n together—talking, watching TV, playing Monopoly.\"\n \n Ralphie said, \"Gee, sure, Dad, if you want to.\"\n \n Hank stood up. \"The question is not whether I want to. You both know I\n want to. The question is whether you want to.\"\n \n They answered together that of course they wanted to. But their\n eyes—his wife's and son's eyes—could not meet his, and so he said he\n was going to his room because he was, after all, very tired and would in\n all probability continue to be very tired for a long, long time and that\n they shouldn't count on him for normal social life.\n \n He fell asleep quickly, lying there in his clothes.\n \n But he didn't sleep long. Edith shook him and he opened his eyes to a\n lighted room. \"Phil and Rhona are here.\" He blinked at her. She smiled,\n and it seemed her old smile. \"They're so anxious to see you, Hank. I\n could barely keep Phil from coming up and waking you himself. They want\n to go out and do the town. Please, Hank, say you will.\"\n \n He sat up. \"Phil,\" he muttered. \"Phil and Rhona.\" They'd had wonderful\n times together, from grammar school on. Phil and Rhona, their oldest and\n closest friends. Perhaps this would begin his real homecoming.\n \n Do the town? They'd paint it and then tear it down!\n \n \n \n It didn't turn out that way. He was disappointed; but then again, he'd\n also expected it. This entire first day at home had conditioned him to\n expect nothing good. They went to the bowling alleys, and Phil sounded\n very much the way he always had—soft spoken and full of laughter and\n full of jokes. He patted Edith on the head the way he always had, and\n clapped Hank on the shoulder (but not the way he always had—so much\n more gently, almost remotely), and insisted they all drink more than was\n good for them as he always had. And for once, Hank was ready to go along\n on the drinking. For once, he matched Phil shot for shot, beer for beer.\n \n They didn't bowl very long. At ten o'clock they crossed the road to\n Manfred's Tavern, where Phil and the girls ordered sandwiches and coffee\n and Hank went right on drinking. Edith said something to him, but he\n merely smiled and waved his hand and gulped another ounce of nirvana.\n \n There was dancing to a juke box in Manfred's Tavern. He'd been there\n many times before, and he was sure several of the couples recognized\n him. But except for a few abortive glances in his direction, it was as\n if he were a stranger in a city halfway around the world.\n \n At midnight, he was still drinking. The others wanted to leave, but he\n said, \"I haven't danced with my girl Rhona.\" His tongue was thick, his\n mind was blurred, and yet he could read the strange expression on her\n face—pretty Rhona, who'd always flirted with him, who'd made a ritual\n of flirting with him. Pretty Rhona, who now looked as if she were going\n to be sick.\n \n \"So let's rock,\" he said and stood up.\n \n They were on the dance floor. He held her close, and hummed and chatted.\n And through the alcoholic haze saw she was a stiff-smiled, stiff-bodied,\n mechanical dancing doll.\n \n The number finished; they walked back to the booth. Phil said,\n\"Beddy-bye time.\"\n \n Hank said, \"First one dance with my loving wife.\"\n \n He and Edith danced. He didn't hold her close as he had Rhona. He waited\n for her to come close on her own, and she did, and yet she didn't.\n Because while she put herself against him, there was something in her\n face—no, in her eyes; it always showed in the eyes—that made him know\n she was trying to be the old Edith and not succeeding. This time when\n the music ended, he was ready to go home.\n \n They rode back to town along Route Nine, he and Edith in the rear of\n Phil's car, Rhona driving because Phil had drunk just a little too much,\n Phil singing and telling an occasional bad joke, and somehow not his old\n self. No one was his old self. No one would ever be his old self with\n the First One.\n \n They turned left, to take the short cut along Hallowed Hill Road, and\n Phil finished a story about a Martian and a Hollywood sex queen and\n looked at his wife and then past her at the long, cast-iron fence\n paralleling the road. \"Hey,\" he said, pointing, \"do you know why that's\n the most popular place on earth?\"\n \n Rhona glanced to the left, and so did Hank and Edith. Rhona made a\n little sound, and Edith seemed to stop breathing, but Phil went on a\n while longer, not yet aware of his supposed faux pas .\n \n \"You know why?\" he repeated, turning to the back seat, the laughter\n rumbling up from his chest. \"You know why, folks?\"\n \n Rhona said, \"Did you notice Carl Braken and his wife at—\"\n \n Hank said, \"No, Phil, why is it the most popular place on earth?\"\n \n Phil said, \"Because people are—\" And then he caught himself and waved\n his hand and muttered, \"I forgot the punch line.\"\n \n \"Because people are dying to get in,\" Hank said, and looked through the\n window, past the iron fence, into the large cemetery at the fleeting\n tombstones.\n \n The car was filled with horrified silence when there should have been\n nothing but laughter, or irritation at a too-old joke. \"Maybe you should\n let me out right here,\" Hank said. \"I'm home—or that's what everyone\n seems to think. Maybe I should lie down in an open grave. Maybe that\n would satisfy people. Maybe that's the only way to act, like Dracula or\n another monster from the movies.\"\n \n Edith said, \"Oh, Hank, don't, don't!\"\n \n The car raced along the road, crossed a macadam highway, went four\n blocks and pulled to a stop. He didn't bother saying good night. He\n didn't wait for Edith. He just got out and walked up the flagstone path\n and entered the house.\n \n \n \n \"Hank,\" Edith whispered from the guest room doorway, \"I'm so sorry—\"\n \n \"There's nothing to be sorry about. It's just a matter of time. It'll\n all work out in time.\"\n \n \"Yes,\" she said quickly, \"that's it. I need a little time. We all need a\n little time. Because it's so strange, Hank. Because it's so frightening.\n I should have told you that the moment you walked in. I think I've hurt\n you terribly, we've all hurt you terribly, by trying to hide that we're\n frightened.\"\n \n \"I'm going to stay in the guest room,\" he said, \"for as long as\n necessary. For good if need be.\"\n \n \"How could it be for good? How, Hank?\"\n \n That question was perhaps the first firm basis for hope he'd had since\n returning. And there was something else; what Carlisle had told him,\n even as Carlisle himself had reacted as all men did.\n \n \"There are others coming, Edith. Eight that I know of in the tanks right\n now. My superior, Captain Davidson, who died at the same moment I\n did—seven months ago next Wednesday—he's going to be next. He was\n smashed up worse than I was, so it took a little longer, but he's almost\n ready. And there'll be many more, Edith. The government is going to save\n all they possibly can from now on. Every time a young and healthy man\n loses his life by accident, by violence, and his body can be recovered,\n he'll go into the tanks and they'll start the regenerative brain and\n organ process—the process that made it all possible. So people have to\n get used to us. And the old stories, the old terrors, the ugly old\n superstitions have to die, because in time each place will have some of\n us; because in time it'll be an ordinary thing.\"\n \n Edith said, \"Yes, and I'm so grateful that you're here, Hank. Please\n believe that. Please be patient with me and Ralphie and—\" She paused.\n\"There's one question.\"\n \n He knew what the question was. It had been the first asked him by\n everyone from the president of the United States on down.\n \n \"I saw nothing,\" he said. \"It was as if I slept those six and a half\n months—slept without dreaming.\"\n \n She came to him and touched his face with her lips, and he was\n satisfied.\n \n Later, half asleep, he heard a dog howling, and remembered stories of\n how they announced death and the presence of monsters. He shivered and\n pulled the covers closer to him and luxuriated in being safe in his own\n home.\n \n \n THE END",
      "metadata": {
        "title": "The First One",
        "author": "Herbert D. Kastle",
        "passage_id": "24192",
        "uid": "2171c0c2b71446af804251f915ce97aa",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "113",
                "uid": "450fa16d4c944058b51490bd17a280ba",
                "response_text": "The story is about a family man - Henry Devers - returning to his hometown after a unique adventure. He was participating in an experimental flight that ended in an explosion. But he managed to survive thanks to regenerative technologies that helped rebuild his body and make him breathe again. The story starts with a grandiose tour around his town where the mayor, the National Guard, the Fire Department bands, and many other people participate though they all seem a little distant and scared to Devers. The official car lets him off at his house that, as he notices, has changed a little. Edith, his wife, and Ralphie, his ten-year-old son, meet him at the door. Later, in the living room, they have an awkward conversation about Ralphie’s school grades, his son quickly leaves for a baseball game, and soon Devers goes to sleep in his separate twin bed that his wife bought while he was away. He looks at his scars before going to bed, thinking about how people’s behavior changed because they believe Henry has changed.  \nIn the evening, Henry’s mother, uncle Joe, and aunt Lucille come for dinner. Again everyone seems aloof: Henry’s overly affectionate mother now barely touches him and even cries for several minutes, his aunt and uncle cannot talk about casual things - no one looks him in the eyes. After all, Devers gets infuriated and screams at the guests, they leave, and his son once again tries to leave instead of spending time with the parents. Later in the evening, Edith wakes her husband because his good friends Phil and Rhona came - they all go to bowling alleys and then to a tavern. Even Devers’ close friends seem stiff and cautious while talking to him, dancing with him, being around him. On their way back, Phil tries to make a joke about a cemetery but stops himself from finishing it - this upsets Henry even more, completely ruining the evening. When they get home Edith tries to apologize to her husband and admits that she’s frightened. In reply, he says that soon such regenerative technologies and processes will be an ordinary thing, and his captain, for example, who died together with Devers, will soon leave the hospital, too. She asks him to be patient with everybody. \n\n"
              },
              {
                "worker_id": "107",
                "uid": "1d0f7465382746f29d2d4b05a9dc5f69",
                "response_text": "There is a welcoming crowd and politicians giving speeches. However, the mayor and crowd are much quieter than the last welcoming. His Honor’s handclasp is somewhat moist and cold, with eyes holding traces of remoteness. Henry Devers is still honored, and there is a tour up Main street to where the mayor waits alongside a young homecoming queen. Hank looks out to the crowd, and there is a lot of national interest because he is the First One. He is glad that the official greeting is over, and all he wants to do is see his family again. When Hank goes back to 45 Roosevelt Street, the house has changed for the better. He is glad not to have to deal with more strangers and is surprised by having to use the ornamental knocker on the new door. Edith opens the door with their son Ralphie in her arms, and the family shares a sweet moment. Edith hesitates to take a seat next to him. When Hank asks about Ralphie, the boy says that it is now summer vacation. However, Edith says that he has been doing excellent in school. He remembers back to their farewells at the experimental flight station in the Aleutians. Ralphie suddenly says he must go to pitch for the Inter-Town Little League; Hank tells Edith that he is tired. She leads him upstairs, where there are two twin beds in entirely new furniture. Hank assumes that Edith has created this barrier between them because he has changed too much. When she leaves, Hank goes to look at his scars. He hopes Edith does not have to see them, even though he did not consider the scars when he left the Walter Reed Hospital. As Hank dozes off, he thinks about wishing to regain his old relationships. His mother, Uncle Joe, and Aunt Lucille all come when dinner approaches. Hank tries to compliment his mother over grapefruit, and she bursts into tears. Uncle Joe and Aunt Lucille make little to no attempts to talk either, making Hank angry because nobody treats him like a human being. Hank falls asleep, but Phil and Rhona come to take everyone to a bowling alley. Hank agrees to Phil’s request to drink and continues to do so in Manfred’s Tavern. He tries to dance with Rhona, who looks as if she will be sick, and even his wife is reluctant to dance with him. When the entire party drives back, Hank jokes about a cemetery and wonders if he should just lie in an open grave. Edith tries to apologize to him and says that they all need some time to get used to him being back when he should have died. Hank tells her that the government is doing everything they can and that he has not seen anything in the six and half months. However, when he lays in his bed, he thinks back to the monsters and is glad to be in his own house. "
              },
              {
                "worker_id": "112",
                "uid": "8f26a064298c43a09443a91e51681def",
                "response_text": "Eleven months ago, Henry Devers, an Air Force soldier, left his family for an experimental flight station in the Aleutians. His family had seen him off with care and warmth by that time. Seven months ago, he died. And now, he comes back as the first to breathe again from death after receiving the new regenerative technology. He still gets a big welcome from the nation and his family, but it is not the same anymore. He feels the awkward silence in the ceremony and parade when it was once lively and welcoming. His family no longer touches him as they did before because they are now afraid of him. Things have changed after he left, and it is not the same anymore. He feels uneasy and angry. He wants the old normality and urges to be accepted by his family and close friends, but people are too scared to act normally to him. They treat him as some monster. Henry knows that it takes time for people to accept him, but it is also true that people like him will become normal in the future, and there must be a time when his family takes him as an ordinary person again. This story mainly describes the tension between Henry and his loved ones and how he wants to be treated normally after becoming the first one to gain a second life from new technology."
              },
              {
                "worker_id": "111",
                "uid": "c8f1cbeee97f4a649aea7d01a4d64649",
                "response_text": "The story is about a man, named Henry Devers, and his return to his hometown after being the “First One” to complete an important journey. He first is received by the mayor and a few people, but everyone seems cold around him, like they were afraid of him. When he arrived at his house, his cold reception continued, as his wife and his son also seemed nervous and weird around him. His mother even cried when she saw him, and couldn’t spend time with him. This trend continued throughout, as even his mother, aunt and uncle were sad when they saw him. Throughout the story, Henry only wanted everyone to treat him normally, like before he left. He then decides to go out with his wife and best friends. Even his best friend seemed to not act normally around him when they were bowling and drinking alcohol. When the two men got drunk, the 4 of them returned home. When they passed a graveyard, Henry’s best friend made a joke about them and the death of people. Here it is revealed that Henry had actually died, and that the “journey” that he had been on was a journey of reviving. He ends up explaining to his wife that even if he is the first one to return from the dead, more people will come soon, and that in time it will become normal. \n"
              }
            ]
          },
          {
            "question_text": "Who’s Henry Devers and what happens to him throughout the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "113",
                "uid": "450fa16d4c944058b51490bd17a280ba",
                "response_text": "Henry Devers was participating in an experimental flight that ended in an explosion. After that, he became the first person ever saved by regenerative technologies that had helped rebuild his body and make him breathe again. At the beginning of the story, he leaves the hospital after months of medical sleep during which his body was healing. Devers is met by the mayor and curious yet quiet crowds, he goes on a triumphant tour around the town and finally comes home to his wife Edith and his ten-year-old son Ralphie. They also seem aloof and hesitant, having no idea what to say or do around him now. He realizes his wife bought a separate twin bed which looks like an additional barrier between them to him, and his son quickly leaves for a baseball game having no apparent desire to spend time with the father. In the evening, his mother, uncle Joe, and aunt Lucille come for dinner: his mother cries, his uncle and aunt are not talkative - everyone looks stiff and uncomfortable, they are avoiding Henry’s gaze. It infuriates him, and after his angry outburst, the guests soon leave. After another small awkward conversation with his family, he goes to bed only to be soon woken up by Edith who informs him about his friends’ arrival. Phil and Rhona seem happy to see their friend, but after going to bowling alleys and a tavern Devers realizes that they are apprehensive and scared, just like everyone else. After Phil’s unsuccessful joke about a cemetery, Devers understands that everyone treats him as The First One, they cannot act as they used to because they are afraid. Later at home, Edith admits that she’s frightened and they all need time to adapt. In reply, he tells her that soon such regenerative technologies and processes will be an ordinary thing, and his captain, for example, who died together with Henry, will soon leave the hospital, too. Devers won't be the only one. He goes to sleep in the guest room."
              },
              {
                "worker_id": "107",
                "uid": "1d0f7465382746f29d2d4b05a9dc5f69",
                "response_text": "Henry Devers, or Hank, is one of the men who go beyond the Great Frontier and is the first one to return. Before leaving, he had married his high-school love Edith and had a son with her. Hank also worked extensively with General Carlisle, a commanding officer who engineers the entire trip and goes on to win a Nobel Prize. His family sheds tears and embraces him when he leaves the experimental flight station in the Aleutians. There is an explosion, and everybody assumes that he has died. When he returns eleven months later, a homecoming party is held for him. However, no one in the crowd is overly enthusiastic to see him, and they are all nervous about his appearance as the First One. After the official ceremonies, he is excited to go home and see his family again after being away from home for eleven months. However, everyone has changed, and he can no longer fit in with them because they are not used to him being alive. Ralphie does everything he can to stay away from his father, and Edith has rearranged their bedroom so that the both of them sleep separately. When he dines with the rest of his family, Hank’s mother cries at the sight of him and does not take his compliment kindly. His other relatives, Uncle Joe and Aunt Lucille, also try not to talk, even though his family is known for their love of talking. Hank is tired of everybody treating him as some alien and angrily sends everyone away. Even when Phil and Rhona visit, their interactions are not the same as before. Nobody wants to treat Hank usually, and they are all frightened that he is still alive when he is supposed to be dead. Hank hopes that everything will work out in time, and he tells Edith that there will be more men coming back. "
              },
              {
                "worker_id": "112",
                "uid": "8f26a064298c43a09443a91e51681def",
                "response_text": "Henry Devers is an Air Force soldier who left for an experimental flight station in the Aleutians. He has a son and a wife. He died in an incident seven months ago but then retrieved his life by new regenerative technology. He has scars all over his body. He likes the sunshine and the fresh air in the morning. After he regained his life, he returned to his hometown as the first person to rebreathe from death. However, when he comes home, everyone treats him differently than he was before. He notices the differences, but he thinks they need time to adjust to the new changes. However, after being disappointed by several reunions with his family and close friends, he feels isolated and frustrated with the situation. He wants to be treated normally, but everyone surrounding him needs time for the new and terrifying change. When he decides to live in the guest room in his home, he talks to his wife, saying that people like him will become part of normality."
              },
              {
                "worker_id": "111",
                "uid": "c8f1cbeee97f4a649aea7d01a4d64649",
                "response_text": "Henry Devers is the main character of the story. At the beginning it is revealed that he is the “First One” to return from an important expedition. As he returns to his hometown, he is accompanied by some U.S. army members, and meets with the town’s mayor. This makes it seem as if he was an astronaut, military member, or something similar. He gets a very cold reception from everyone in the town, including his own wife and son. This seems to bother him as he hopes everything will be back to normal. It is also revealed that he was in an accident that left his body scarred during his journey. As Henry reconnects with his mother, she also has a very bad reaction to seeing him, as she starts crying and can't seem to be close to him. All of these reactions make Henry very angry. When he gets the chance to go out with his childhood friends, he is very excited as he believes that they will treat him normally. This isn’t the case and after going with them and passing through a graveyard, we realize that what had happened to Henry is that he had died. After he died, Henry was put through a regenerative procedure to revive him, which is where his scars come from, and why everyone was so weird around him. He ends up fighting with his wife, but he realizes that time is needed for everyone to go back to normal and accept this new technology. "
              }
            ]
          },
          {
            "question_text": "What’s the significance of the regenerative technology in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "113",
                "uid": "450fa16d4c944058b51490bd17a280ba",
                "response_text": "The main character - Henry Devers - is the first man to have been saved by regenerative technologies. After leaving the hospital, he goes on a grandiose tour around the town, but he can see that the crowds are quiet. At home, his wife Edith seems overly hesitant and restrained, his son Ralphie quickly leaves them. Later in the evening, during dinner, his mother, aunt, and uncle also seem stiff and anxious, infuriating him. After that, he meets with his close friends hoping for them to treat him as before, but all their actions show that they are not comfortable with Devers either. He realizes that everyone he knows doesn't know how to behave around him, they cannot look him in the eyes and are scared. The First One status makes everyone terrified of him, which his wife later admits. But Devers assures her that soon this kind of technology will be ubiquitous, and the old superstitions will die, people like him will be ordinary citizens. "
              },
              {
                "worker_id": "107",
                "uid": "1d0f7465382746f29d2d4b05a9dc5f69",
                "response_text": "The regenerative technology allows the men who have gone beyond the Great Frontier to return home safely. Without this technology, Hank would not have been able to return to his family. When Hank speaks to Edith, he tells her that he knows of eight men in the regenerative tanks right now. Even the people who died, such as Captain Davidson, will return home as a result of the technology. The regenerative technology can regenerate a brain and organ for any of the young men who lose their lives by accident. This technology is also very significant because it can bring people back to life from the dead. Even though reviving someone from death should be impossible, regenerative technology has made it possible."
              },
              {
                "worker_id": "112",
                "uid": "8f26a064298c43a09443a91e51681def",
                "response_text": "Regenerative technology is a new technology that can bring the dead to life. It uses a tank to regenerate brains and organs for anyone who dies from violence, accident, and who can recover, to save the life of the dead ones. It is a technology that the government plans to use in the future to save as many lives as they can. This technology also brings Henry Devers alive again, which is the one that makes Henry Devers become the First One to regain life from death. However, as Henry returns to his hometown from his death, he is treated by people fearfully because he is reborn. Therefore, as the cause for Henry Devers being treated abnormally by everyone, regenerative technology is the leading cause for the whole story to proceed."
              },
              {
                "worker_id": "111",
                "uid": "c8f1cbeee97f4a649aea7d01a4d64649",
                "response_text": "The regenerative technology is one of the most important aspects of the story because it leads to the main plot. At the beginning of the story, it is revealed that Henry was “The First One” to go through a journey, but his journey is never elaborated further until the end. At the end we realize that Henry and his team had died, but the regenerative technology allowed them to continue living, which is why everyone was acting weirdly around him. Henry says that the procedure took 6 months, which is why he was away for so long. "
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "113",
                "uid": "450fa16d4c944058b51490bd17a280ba",
                "response_text": "At the beginning of the story, Henry Devers - the first man to have been saved by regenerative technologies - goes on a town tour up to Main Street to the new square and the grandstand. He gets off at 45 Roosevelt street - his home. Here he has an awkward interaction with his wife Edith and his son Ralphie who soon leaves for a baseball game. In the evening, Henry, his wife, son, mother, uncle, and aunt eat in the dining room - the guests seem to be stiff and nervous, it infuriates Devers. After an outburst of anger, he goes to his room. After his friends, Rhona and Phil, come to see him, they all go to bowling alleys and then to Manfred’s Tavern where they dance, though his friends seem relatively uncomfortable and scared. On their way back, they drive past a cemetery when Phil makes an inappropriate joke which leads to a moment of dead silence. Later, when they come home, Devers and Edith have a sincere conversation - she admits that everyone, including her, is terrified. After reassuring his wife, Henry goes to sleep in the guest room."
              },
              {
                "worker_id": "107",
                "uid": "1d0f7465382746f29d2d4b05a9dc5f69",
                "response_text": "The story is set in the world of the Great Frontier in the growing city of Croton. The airport used to be twenty miles outside of the city, but it has developed so fast that it has now engulfed the airport within its boundaries. There is also a Main Street and a new town square with a grandstand. The Walter Reed Hospital is also in this city. The experimental flight station is in the Aleutians; a twelve-foot concrete and barbed-wire fence surround the station. Instead of the old concrete path, there is now an ornate flagstone path leading up to Hank’s house. The house also has a new porch and ornamental knocker on a new door that plays soft music. The house also has a window to look through from the inside to the outside. Inside of the house, there is a living room with a couch and a doorway. Upstairs, there is a foyer with an entrance to Ralphie’s room, a small guest room, and the couples’ bedroom. The couples’ bedroom is newly painted and has new furniture. An ornate little table now separates two twin beds with an ornate little lamp. In the dining room, there is a big table and a kitchen. The story later transitions out of the house to a bowling alley and Manfred’s Tavern. The tavern has a dance floor and a jukebox to dance to. Later, they pass a cemetery and race along a macadam highway as they drive back."
              },
              {
                "worker_id": "112",
                "uid": "8f26a064298c43a09443a91e51681def",
                "response_text": "The story happens in the twenty-first century of America. Humans have already set their foot on the planets outside of the Earth. It is called the Galloping Twenties because of new generative technology that can bring people from death to life. However, the technology is so new that only one person, namely Henry Devers, succeeds at the moment. People are frightened of his existence because he returns from an uncharted territory where humans have never been able to step in - death. Nonetheless, the government plans to bring life to more dead people through regenerative technology, guaranteeing that the once-dead people will return and live as ordinary in the future."
              },
              {
                "worker_id": "111",
                "uid": "c8f1cbeee97f4a649aea7d01a4d64649",
                "response_text": "The story is set in a traditional American rural town. It looks to be very quaint, small and quiet. Our character traverses through the airport and reaches his very normal home, with a porch and front yard. The house of Henry seemed like a very normal American home, with two bedrooms and a guest bedroom. Something different was that the master bedroom had two twin beds, instead of a queen or king bed. The story also moves to a bowling alley, where Henry gets to see his best friends. The last important location of the story is a graveyard, because of which we learn that Henry’s journey was actually coming back from the dead. "
              }
            ]
          },
          {
            "question_text": "Who’s Edith and what happens to her throughout the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "113",
                "uid": "450fa16d4c944058b51490bd17a280ba",
                "response_text": "Edith is the wife of Henry Devers - the first man to have been saved by regenerative technologies. While he was healing, she managed to renovate their house and buy a new bed for her husband. Together with their son Ralphie Edith meets Henry at the porch after he leaves the hospital and goes on a tour around their town. She seems nervous and scared around her husband while trying to talk to him about their son’s academic achievements at school. Later she dines with Devers and his relatives, still feeling very hesitant and unsure about how she has to interact with him. Edith tries to placate her husband after he angrily screams at the guests because of how scared they are and the fact that they avoided his gaze during the entire evening. Soon, she goes to wake him up after his close friends come to see him. Four of them go to bowling alleys and then to Manfred’s Tavern, but his friends - Phil and Rhona - behave as strangely as everybody else. Phil makes awkward remarks, Rhona looks sick. After an inappropriate joke made by one of the friends, Edith has to calm her husband again. She finally talks to him when they get back, admitting that everyone, including her, is terrified and they need more time to adapt. After reassuring her, her husband goes to sleep in the guest room. "
              },
              {
                "worker_id": "107",
                "uid": "1d0f7465382746f29d2d4b05a9dc5f69",
                "response_text": "Edith is Hank’s wife and the mother of Ralphie. She is initially very frightened to see her husband after assuming he has died. She and Ralphie hold on to each other tightly when Hank first comes back, and she is very hesitant to respond to his affections. Even when they go to the living room to sit down, she hesitates to sit next to him. Later, when she brings him upstairs, she explains to him that the lodge donated the twin bedroom set when she purposely arranged it to create a barrier between them. During dinner with his relatives, she focuses on serving the food and does not try to make any form of conversation. Both her and Ralphie do not want to spend any time with Hank despite him returning alive. She gives him one of her old smiles when his friends come, but she cannot return to being the old Edith when they dance on the dance floor in Manfred’s Tavern. Only later, when Hank says that he should lay in an open grave, does Edith feel terrible about her behavior. Edith promises that everything will return in time, and she gives him a kiss when he explains to her the situation of the men coming back. "
              },
              {
                "worker_id": "112",
                "uid": "8f26a064298c43a09443a91e51681def",
                "response_text": "Edith is Henry Devers’ wife, the wife of the person who was reborn from death through regenerative technology. She married Henry twelve years ago. She is a thirty-three-year-old. She calls Henry “Hank.” She used to sleep in the same bed with Henry, but she sleeps in different beds with him when Henry returns. She also used to touch Henry lovingly, but she interacted with him carefully after his return. When Henry feels angry during the dinner because other people around the table cannot treat him normally, Edith calls his name with fear, trying to calm him down. She also brings an English trifle to Henry when he is upset about the unnormal treatment during the dinner, and she calls their son to come and eat with them. When their son, Ralphie, tries to escape away again from his dad, she stops him and tells Henry that they will spend the time together, playing games and watching TV. However, Henry refuses her proposal because he can see their fear in their eyes. When Edith and Henry go out for town with their old friends, they dance, but it is so stiff that Henry can feel Edith’s failure to try to be the old her. When they come back home, and Henry states that he will live in the guest room for the moment, she apologizes for the treatment she and the other people give Henry. She asks him whether he feels anything during the death, and he responds that it was just like sleeping with no dreams.\n"
              },
              {
                "worker_id": "111",
                "uid": "c8f1cbeee97f4a649aea7d01a4d64649",
                "response_text": "Edith is Henry’s husband. We learn that for the past year she has been raising their son alone. When her husband returns home, she tries to do her best to treat him normally, but it is hard for her to see him. Throughout the story she tries to help her husband cope with being back home, but her restraint towards him is clear. At the end she has a fight with Henry, and lets Henry know that it is going to take some time for everything to go back to normal. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4448,
        "document_length_chars": 25249
      }
    }
  ]
}