{
  "item_metadata": {
    "item_id": "29159",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "29159",
      "content": "ACID BATH\n \n\n By VASELEOS GARSON\n \n \n  The starways' Lone Watcher had expected some odd developments\n in his singular, nerve-fraught job on the asteroid. But nothing like the\n weird twenty-one-day liquid test devised by the invading Steel-Blues.\n  \n\n\n Jon Karyl\n was bolting in a new baffle\n plate on the stationary rocket engine.\n It was a tedious job and took all his\n concentration. So he wasn't paying too much\n attention to what was going on in other\n parts of the little asteroid.\n \n He didn't see the peculiar blue space\n ship, its rockets throttled down, as it drifted\n to land only a few hundred yards away from\n his plastic igloo.\n \n Nor did he see the half-dozen steel-blue\n creatures slide out of the peculiar vessel's\n airlock.\n \n It was only as he crawled out of the\n depths of the rocket power plant that he\n realized something was wrong.\n \n By then it was almost too late. The six\n blue figures were only fifty feet away, approaching\n him at a lope.\n \n Jon Karyl took one look and went bounding\n over the asteroid's rocky slopes in fifty-foot\n bounds.\n \n When you're a Lone Watcher, and\n strangers catch you unawares, you don't\n stand still. You move fast. It's the Watcher's\n first rule. Stay alive. An Earthship may depend\n upon your life.\n \n As he fled, Jon Karyl cursed softly under\n his breath. The automatic alarm should have\n shrilled out a warning.\n \n Then he saved as much of his breath as\n he could as some sort of power wave tore\n up the rocky sward to his left. He twisted\n and zig-zagged in his flight, trying to get\n out of sight of the strangers.\n \n Once hidden from their eyes, he could cut\n back and head for the underground entrance\n to the service station.\n \n He glanced back finally.\n \n Two of the steel-blue creatures were jack-rabbiting\n after him, and rapidly closing the\n distance.\n \n Jon Karyl unsheathed the stubray pistol\n at his side, turned the oxygen dial up for\n greater exertion, increased the gravity pull\n in his space-suit boots as he neared the\n ravine he'd been racing for.\n \n The oxygen was just taking hold when\n he hit the lip of the ravine and began\n sprinting through its man-high bush-strewn\n course.\n \n The power ray from behind ripped out\n great gobs of the sheltering bushes. But\n running naturally, bent close to the bottom\n of the ravine, Jon Karyl dodged the bare\n spots. The oxygen made the tremendous\n exertion easy for his lungs as he sped down\n the dim trail, hidden from the two steel-blue\n stalkers.\n \n He'd eluded them, temporarily at least,\n Jon Karyl decided when he finally edged off\n the dim trail and watched for movement\n along the route behind him.\n \n He stood up, finally, pushed aside the\n leafy overhang of a bush and looked for\n landmarks along the edge of the ravine.\n \n He found one, a stubby bush, shaped like\n a Maltese cross, clinging to the lip of the\n ravine. The hidden entrance to the service\n station wasn't far off.\n \n His pistol held ready, he moved quietly\n on down the ravine until the old water\n course made an abrupt hairpin turn.\n \n Instead of following around the sharp\n bend, Jon Karyl moved straight ahead\n through the overhanging bushes until he\n came to a dense thicket. Dropping to his\n hands and knees he worked his way under\n the edge of the thicket into a hollowed-out\n space in the center.\n \n \n\n There\n , just ahead of him, was the lock\n leading into the service station. Slipping\n a key out of a leg pouch on the space suit,\n he jabbed it into the center of the lock,\n opening the lever housing.\n \n He pulled strongly on the lever. With a\n hiss of escaping air, the lock swung open.\n Jon Karyl darted inside, the door closing\n softly behind.\n \n At the end of the long tunnel he stepped\n to the televisor which was fixed on the area\n surrounding the station.\n \n Jon Karyl saw none of the steel-blue creatures.\n But he saw their ship. It squatted\n like a smashed-down kid's top, its lock shut\n tight.\n \n He tuned the televisor to its widest range\n and finally spotted one of the Steel-Blues.\n He was looking into the stationary rocket\n engine.\n \n As Karyl watched, a second Steel-Blue\n came crawling out of the ship.\n \n The two Steel-Blues moved toward the\n center of the televisor range. They're coming\n toward the station, Karyl thought grimly.\n \n Karyl examined the two creatures. They\n were of the steel-blue color from the crown\n of their egg-shaped heads to the tips of\n their walking appendages.\n \n They were about the height of Karyl—six\n feet. But where he tapered from broad\n shoulders to flat hips, they were straight up\n and down. They had no legs, just appendages,\n many-jointed that stretched and\n shrank independent of the other, but keeping\n the cylindrical body with its four pairs\n of tentacles on a level balance.\n \n Where their eyes would have been was\n an elliptical-shaped lens, covering half the\n egg-head, with its converging ends curving\n around the sides of the head.\n \n Robots! Jon gauged immediately. But\n where were their masters?\n \n The Steel-Blues moved out of the range\n of the televisor. A minute later Jon heard\n a pounding from the station upstairs.\n \n He chuckled. They were like the wolf of\n pre-atomic days who huffed and puffed to\n blow the house down.\n \n The outer shell of the station was formed\n from stelrylite, the toughest metal in the\n solar system. With the self-sealing lock of\n the same resistant material, a mere pounding\n was nothing.\n \n Jon thought he'd have a look-see anyway.\n He went up the steel ladder leading to the\n station's power plant and the televisor that\n could look into every room within the\n station.\n \n He heaved a slight sigh when he reached\n the power room, for right at his hand were\n weapons to blast the ship from the asteroid.\n \n Jon adjusted one televisor to take in the\n lock to the station. His teeth suddenly\n clamped down on his lower lip.\n \n Those Steel-Blues were pounding holes\n into the stelrylite with round-headed metal\n clubs. But it was impossible. Stelrylite didn't\n break up that easily.\n \n Jon leaped to a row of studs, lining up\n the revolving turret which capped the station\n so that its thin fin pointed at the\n squat ship of the invaders.\n \n Then he went to the atomic cannon's\n firing buttons.\n \n He pressed first the yellow, then the blue\n button. Finally the red one.\n \n The thin fin—the cannon's sight—split in\n half as the turret opened and the coiled nose\n of the cannon protruded. There was a\n soundless flash. Then a sharp crack.\n \n Jon was dumbfounded when he saw the\n bolt ricochet off the ship. This was no ship\n of the solar system. There was nothing that\n could withstand even the slight jolt of power\n given by the station cannon on any of the\n Sun's worlds. But what was this? A piece of\n the ship had changed. A bubble of metal,\n like a huge drop of blue wax, dripped off\n the vessel and struck the rocket of the\n asteroid. It steamed and ran in rivulets.\n \n He pressed the red button again.\n \n Then abruptly he was on the floor of the\n power room, his legs strangely cut out from\n under him. He tried to move them. They lay\n flaccid. His arms seemed all right and tried\n to lever himself to an upright position.\n \n Damn it, he seemed as if he were paralyzed\n from the waist down. But it couldn't\n happen that suddenly.\n \n He turned his head.\n \n A Steel-Blue stood facing him. A forked\n tentacle held a square black box.\n \n Jon could read nothing in that metallic\n face. He said, voice muffled by the confines\n of the plastic helmet, \"Who are you?\"\n \n \"I am\"—there was a rising inflection in\n the answer—\"a Steel-Blue.\"\n \n There were no lips on the Steel-Blue's\n face to move. \"That is what I have named\n you,\" Jon Karyl said. \"But what are you?\"\n \n \"A robot,\" came the immediate answer.\n Jon was quite sure then that the Steel-Blue\n was telepathic. \"Yes,\" the Steel-Blue answered.\n\"We talk in the language of the\n mind. Come!\" he said peremptorily, motioning\n with the square black box.\n \n The paralysis left Karyl's legs. He followed\n the Steel-Blue, aware that the lens\n he'd seen on the creature's face had a\n counterpart on the back of the egg-head.\n \n Eyes in the back of his head, Jon thought.\n That's quite an innovation. \"Thank you,\"\n Steel-Blue said.\n \n There wasn't much fear in Jon Karyl's\n mind. Psychiatrists had proved that when he\n had applied for this high-paying but man-killing\n job as a Lone Watcher on the Solar\n System's starways.\n \n He had little fear now, only curiosity.\n These Steel-Blues didn't seem inimical.\n They could have snuffed out my life very\n simply. Perhaps they and Solarians can be\n friends.\n \n Steel-Blue chuckled.\n \n \n\n Jon\n followed him through the sundered\n lock of the station. Karyl stopped for a\n moment to examine the wreckage of the\n lock. It had been punched full of holes as\n if it had been some soft cheese instead of a\n metal which Earthmen had spent nearly a\n century perfecting.\n \n \"We appreciate your compliment,\" Steel-Blue\n said. \"But that metal also is found on\n our world. It's probably the softest and most\n malleable we have. We were surprised you—earthmen,\n is it?—use it as protective\n metal.\"\n \n \"Why are you in this system?\" Jon asked,\n hardly expecting an answer.\n \n It came anyway. \"For the same reason you\n Earthmen are reaching out farther into your\n system. We need living room. You have\n strategically placed planets for our use. We\n will use them.\"\n \n Jon sighed. For 400 years scientists had\n been preaching preparedness as Earth flung\n her ships into the reaches of the solar system,\n taking the first long step toward the\n conquest of space.\n \n There are other races somewhere, they\n argued. As strong and smart as man, many\n of them so transcending man in mental and\n inventive power that we must be prepared to\n strike the minute danger shows.\n \n Now here was the answer to the scientists'\n warning. Invasion by extra-terrestrials.\n \n \"What did you say?\" asked Steel-Blue.\n\"I couldn't understand.\"\n \n \"Just thinking to myself,\" Jon answered.\n It was a welcome surprise. Apparently his\n thoughts had to be directed outward, rather\n than inward, in order for the Steel-Blues to\n read it.\n \n He followed the Steel-Blue into the gaping\n lock of the invaders' space ship wondering\n how he could warn Earth. The Space\n Patrol cruiser was due in for refueling at\n his service station in 21 days. But by that\n time he probably would be mouldering in\n the rocky dust of the asteroid.\n \n It was pitch dark within the ship but the\n Steel-Blue seemed to have no trouble at all\n maneuvering through the maze of corridors.\n Jon followed him, attached to one tentacle.\n \n Finally Jon and his guide entered a circular\n room, bright with light streaming from\n a glass-like, bulging skylight. They apparently\n were near topside of the vessel.\n \n A Steel-Blue, more massive than his\n guide and with four more pair of tentacles,\n including two short ones that grew from the\n top of its head, spoke out.\n \n \"This is the violator?\" Jon's Steel-Blue\n nodded.\n \n \"You know the penalty? Carry it out.\"\n \n \"He also is an inhabitant of this system,\"\n Jon's guide added.\n \n \"Examine him first, then give him the\n death.\"\n \n Jon Karyl shrugged as he was led from\n the lighted room through more corridors.\n If it got too bad he still had the stubray\n pistol.\n \n Anyway, he was curious. He'd taken on\n the lonely, nerve-wracking job of service\n station attendant just to see what it offered.\n \n Here was a part of it, and it was certainly\n something new.\n \n \"This is the examination room,\" his\n Steel-Blue said, almost contemptuously.\n \n A green effulgence surrounded him.\n \n \n\n There\n was a hiss. Simultaneously, as the\n tiny microphone on the outside of his\n suit picked up the hiss, he felt a chill go\n through his body. Then it seemed as if a\n half dozen hands were inside him, examining\n his internal organs. His stomach contracted.\n He felt a squeeze on his heart. His\n lungs tickled.\n \n There were several more queer motions\n inside his body.\n \n Then another Steel-Blue voice said:\n \n \"He is a soft-metal creature, made up of\n metals that melt at a very low temperature.\n He also contains a liquid whose makeup I\n cannot ascertain by ray-probe. Bring him\n back when the torture is done.\"\n \n Jon Karyl grinned a trifle wryly. What\n kind of torture could this be?\n \n Would it last 21 days? He glanced at the\n chronometer on his wrist.\n \n Jon's Steel-Blue led him out of the alien\n ship and halted expectantly just outside the\n ship's lock.\n \n Jon Karyl waited, too. He thought of the\n stubray pistol holstered at his hip. Shoot my\n way out? It'd be fun while it lasted. But he\n toted up the disadvantages.\n \n He either would have to find a hiding\n place on the asteroid, and if the Steel-Blues\n wanted him bad enough they could tear the\n whole place to pieces, or somehow get\n aboard the little life ship hidden in the\n service station.\n \n In that he would be just a sitting duck.\n \n He shrugged off the slight temptation to\n use the pistol. He was still curious.\n \n And he was interested in staying alive as\n long as possible. There was a remote chance\n he might warn the SP ship. Unconsciously,\n he glanced toward his belt to see the little\n power pack which, if under ideal conditions,\n could finger out fifty thousand miles into\n space.\n \n If he could somehow stay alive the 21\n days he might be able to warn the patrol.\n He couldn't do it by attempting to flee, for\n his life would be snuffed out immediately.\n \n The Steel-Blue said quietly:\n \n \"It might be ironical to let you warn\n that SP ship you keep thinking about. But\n we know your weapon now. Already our\n ship is equipped with a force field designed\n especially to deflect your atomic guns.\"\n \n Jon Karyl covered up his thoughts\n quickly. They can delve deeper than the\n surface of the mind. Or wasn't I keeping a\n leash on my thoughts?\n \n The Steel-Blue chuckled. \"You get—absent-minded,\n is it?—every once in a\n while.\"\n \n Just then four other Steel-Blues appeared\n lugging great sheets of plastic and various\n other equipment.\n \n They dumped their loads and began unbundling\n them.\n \n Working swiftly, they built a plastic\n igloo, smaller than the living room in the\n larger service station igloo. They ranged instruments\n inside—one of them Jon Karyl\n recognized as an air pump from within the\n station—and they laid out a pallet.\n \n When they were done Jon saw a miniature\n reproduction of the service station, lacking\n only the cannon cap and fin, and with clear\n plastic walls instead of the opaqueness of the\n other.\n \n His Steel-Blue said: \"We have reproduced\n the atmosphere of your station so that you\n be watched while you undergo the torture\n under the normal conditions of your life.\"\n \n \"What is this torture?\" Jon Karyl asked.\n \n The answer was almost caressing: \"It is\n a liquid we use to dissolve metals. It causes\n joints to harden if even so much as a drop\n remains on it long. It eats away the metal,\n leaving a scaly residue which crumbles\n eventually into dust.\n \n \"We will dilute it with a harmless liquid\n for you since No. 1 does not wish you to die\n instantly.\n \n \"Enter your\"—the Steel-Blue hesitated—\"mausoleum.\n You die in your own atmosphere.\n However, we took the liberty of purifying\n it. There were dangerous elements in\n it.\"\n \n Jon walked into the little igloo. The\n Steel-Blues sealed the lock, fingered dials\n and switches on the outside. Jon's space suit\n deflated. Pressure was building up in the\n igloo.\n \n He took a sample of the air, found that\n it was good, although quite rich in oxygen\n compared with what he'd been using in the\n service station and in his suit.\n \n With a sigh of relief he took off his helmet\n and gulped huge draughts of the air.\n \n He sat down on the pallet and waited\n for the torture to begin.\n \n The Steel Blues crowded about the igloo,\n staring at him through elliptical eyes.\n \n Apparently, they too, were waiting for the\n torture to begin.\n \n Jon thought the excess of oxygen was\n making him light-headed.\n \n He stared at a cylinder which was beginning\n to sprout tentacles from the circle.\n He rubbed his eyes and looked again. An\n opening, like the adjustable eye-piece of a\n spacescope, was appearing in the center of\n the cylinder.\n \n A square, glass-like tumbler sat in the\n opening disclosed in the four-foot cylinder\n that had sprouted tentacles. It contained a\n yellowish liquid.\n \n One of the tentacles reached into the\n opening and clasped the glass. The opening\n closed and the cylinder, propelled by locomotor\n appendages, moved toward Jon.\n \n He didn't like the looks of the liquid in\n the tumbler. It looked like an acid of some\n sort. He raised to his feet.\n \n He unsheathed the stubray gun and prepared\n to blast the cylinder.\n \n \n\n The\n cylinder moved so fast Jon felt his\n eyes jump in his head. He brought the\n stubray gun up—but he was helpless. The\n pistol kept on going up. With a deft movement,\n one of the tentacles had speared it\n from his hand and was holding it out of\n his reach.\n \n Jon kicked at the glass in the cylinder's\n hand. But he was too slow. Two tentacles\n gripped the kicking leg. Another struck him\n in the chest, knocking him to the pallet. The\n same tentacle, assisted by a new one,\n pinioned his shoulders.\n \n Four tentacles held him supine. The cylinder\n lifted a glass-like cap from the tumbler\n of liquid.\n \n Lying there helplessly, Jon was remembering\n an old fairy tale he'd read as a kid.\n Something about a fellow named Socrates\n who was given a cup of hemlock to drink.\n It was the finis for Socrates. But the old\n hero had been nonchalant and calm about\n the whole thing.\n \n With a sigh, Jon Karyl, who was curious\n unto death, relaxed and said, \"All right,\n bub, you don't have to force-feed me. I'll\n take it like a man.\"\n \n The cylinder apparently understood him,\n for it handed him the tumbler. It even reholstered\n his stubray pistol.\n \n Jon brought the glass of liquid under his\n nose. The fumes of the liquid were pungent.\n It brought tears to his eyes.\n \n He looked at the cylinder, then at the\n Steel-Blues crowding around the plastic\n igloo. He waved the glass at the audience.\n \n \"To Earth, ever triumphant,\" he toasted.\n Then he drained the glass at a gulp.\n \n Its taste was bitter, and he felt hot\n prickles jab at his scalp. It was like eating\n very hot peppers. His eyes filled with tears.\n He coughed as the stuff went down.\n \n But he was still alive, he thought in\n amazement. He'd drunk the hemlock and\n was still alive.\n \n The reaction set in quickly. He hadn't\n known until then how tense he'd been. Now\n with the torture ordeal over, he relaxed. He\n laid down on the pallet and went to sleep.\n \n There was one lone Steel-Blue watching\n him when he rubbed the sleep out of his\n eyes and sat up.\n \n He vanished almost instantly. He, or another\n like him, returned immediately accompanied\n by a half-dozen others, including\n the multi-tentacled creature known as No. 1.\n \n One said,\n \n \"You are alive.\" The thought registered\n amazement. \"When you lost consciousness,\n we thought you had\"—there was a hesitation—\"as\n you say, died.\"\n \n \"No,\" Jon Karyl said. \"I didn't die. I\n was just plain dead-beat so I went to sleep.\"\n The Steel-Blues apparently didn't understand.\n \n \"Good it is that you live. The torture\n will continue,\" spoke No. 1 before loping\n away.\n \n The cylinder business began again. This\n time, Jon drank the bitter liquid slowly, trying\n to figure out what it was. It had a\n familiar, tantalizing taste but he couldn't\n quite put a taste-finger on it.\n \n His belly said he was hungry. He glanced\n at his chronometer. Only 20 days left before\n the SP ship arrived.\n \n Would this torture—he chuckled—last\n until then? But he was growing more and\n more conscious that his belly was screaming\n for hunger. The liquid had taken the edge\n off his thirst.\n \n It was on the fifth day of his torture that\n Jon Karyl decided that he was going to get\n something to eat or perish in the attempt.\n \n The cylinder sat passively in its niche in\n the circle. A dozen Steel-Blues were watching\n as Jon put on his helmet and unsheathed\n his stubray.\n \n They merely watched as he pressed the\n stubray's firing stud. Invisible rays licked\n out of the bulbous muzzle of the pistol.\n The plastic splintered.\n \n Jon was out of his goldfish bowl and\n striding toward his own igloo adjacent to\n the service station when a Steel-Blue\n accosted him.\n \n \"Out of my way,\" grunted Jon, waving\n the stubray. \"I'm hungry.\"\n \n \"I'm the first Steel-Blue you met,\" said\n the creature who barred his way. \"Go back\n to your torture.\"\n \n \"But I'm so hungry I'll chew off one of\n your tentacles and eat it without seasoning.\"\n \n \"Eat?\" The Steel-Blue sounded puzzled.\n \n \"I want to refuel. I've got to have food\n to keep my engine going.\"\n \n Steel-Blue chuckled. \"So the hemlock, as\n you call it, is beginning to affect you at\n last? Back to the torture room.\"\n \n \"Like R-dust,\" Jon growled. He pressed\n the firing stud on the stubray gun. One of\n Steel-Blue's tentacles broke off and fell to\n the rocky sward.\n \n Steel-Blue jerked out the box he'd used\n once before. A tentacle danced over it.\n \n Abruptly Jon found himself standing on\n a pinnacle of rock. Steel-Blue had cut a\n swath around him 15 feet deep and five feet\n wide.\n \n \"Back to the room,\" Steel-Blue commanded.\n \n Jon resheathed the stubray pistol,\n shrugged non-committally and leaped the\n trench. He walked slowly back and reentered\n the torture chamber.\n \n The Steel-Blues rapidly repaired the damage\n he'd done.\n \n As he watched them, Jon was still curious,\n but he was getting mad underneath at\n the cold egoism of the Steel-Blues.\n \n By the shimmering clouds of Earth, by\n her green fields, and dark forests, he'd\n stay alive to warn the SP ship.\n \n Yes, he'd stay alive till then. And send\n the story of the Steel-Blues' corrosive acid\n to it. Then hundreds of Earth's ships could\n equip themselves with spray guns and squirt\n citric acid and watch the Steel-Blues fade\n away.\n \n It sounded almost silly to Jon Karyl. The\n fruit acid of Earth to repel these invaders—it\n doesn't sound possible. That couldn't be\n the answer.\n \n Citric acid wasn't the answer, Jon Karyl\n discovered a week later.\n \n The Steel-Blue who had captured him in\n the power room of the service station came\n in to examine him.\n \n \"You're still holding out, I see,\" he observed\n after poking Jon in every sensitive\n part of his body.\n \n \"I'll suggest to No. 1 that we increase\n the power of the—ah—hemlock. How do\n you feel?\"\n \n Between the rich oxygen and the dizziness\n of hunger, Jon was a bit delirious. But he\n answered honestly enough: \"My guts feel as\n if they're chewing each other up. My bones\n ache. My joints creak. I can't coordinate I'm\n so hungry.\"\n \n \"That is the hemlock,\" Steel-Blue said.\n \n It was when he quaffed the new and\n stronger draught that Jon knew that his\n hope that it was citric acid was squelched.\n \n The acid taste was weaker which meant\n that the citric acid was the diluting liquid.\n It was the liquid he couldn't taste beneath\n the tang of the citric acid that was the corrosive\n acid.\n \n On the fourteenth day, Jon was so weak\n he didn't feel much like moving around. He\n let the cylinder feed him the hemlock.\n \n No. 1 came again to see him, and went\n away chuckling, \"Decrease the dilution.\n This Earthman at last is beginning to\n suffer.\"\n \n \n\n Staying\n alive had now become a fetish\n with Jon.\n \n On the sixteenth day, the Earthman realized\n that the Steel-Blues also were waiting\n for the SP ship.\n \n The extra-terrestrials had repaired the\n blue ship where the service station atomic\n ray had struck. And they were doing a little\n target practice with plastic bubbles only a\n few miles above the asteroid.\n \n When his chronometer clocked off the\n beginning of the twenty-first day, Jon received\n a tumbler of the hemlock from the\n hands of No. 1 himself.\n \n \"It is the hemlock,\" he chuckled, \"undiluted.\n Drink it and your torture is over.\n You will die before your SP ship is destroyed.\n \n \"We have played with you long enough.\n Today we begin to toy with your SP ship.\n Drink up, Earthman, drink to enslavement.\"\n \n Weak though he was Jon lunged to his\n feet, spilling the tumbler of liquid. It ran\n cool along the plastic arm of his space suit.\n He changed his mind about throwing the\n contents on No. 1.\n \n With a smile he set the glass at his lips\n and drank. Then he laughed at No. 1.\n \n \"The SP ship will turn your ship into\n jelly.\"\n \n No. 1 swept out, chuckling. \"Boast if you\n will, Earthman, it's your last chance.\"\n \n There was an exultation in Jon's heart\n that deadened the hunger and washed away\n the nausea.\n \n At last he knew what the hemlock was.\n \n He sat on the pallet adjusting the little\n power-pack radio. The SP ship should now\n be within range of the set. The space patrol\n was notorious for its accuracy in keeping to\n schedule. Seconds counted like years. They\n had to be on the nose, or it meant disaster\n or death.\n \n He sent out the call letters.\n \n \"AX to SP-101 ... AX to SP-101 ... AX\n to SP-101 ...\"\n \n Three times he sent the call, then began\n sending his message, hoping that his signal\n was reaching the ship. He couldn't know if\n they answered. Though the power pack\n could get out a message over a vast distance,\n it could not pick up messages even\n when backed by an SP ship's power unless\n the ship was only a few hundred miles\n away.\n \n The power pack was strictly a distress\n signal.\n \n He didn't know how long he'd been\n sending, nor how many times his weary\n voice had repeated the short but desperate\n message.\n \n He kept watching the heavens and hoping.\n \n Abruptly he knew the SP ship was coming,\n for the blue ship of the Steel-Blues was\n rising silently from the asteroid.\n \n Up and up it rose, then flames flickered\n in a circle about its curious shape. The ship\n disappeared, suddenly accelerating.\n \n Jon Karyl strained his eyes.\n \n Finally he looked away from the heavens\n to the two Steel-Blues who stood negligently\n outside the goldfish bowl.\n \n Once more, Jon used the stubray pistol.\n He marched out of the plastic igloo and ran\n toward the service station.\n \n He didn't know how weak he was until\n he stumbled and fell only a few feet from\n his prison.\n \n The Steel-Blues just watched him.\n \n He crawled on, around the circular pit in\n the sward of the asteroid where one Steel-Blue\n had shown him the power of his\n weapon.\n \n He'd been crawling through a nightmare\n for years when the quiet voice penetrated\n his dulled mind.\n \n \"Take it easy, Karyl. You're among\n friends.\"\n \n He pried open his eyes with his will. He\n saw the blue and gold of a space guard's\n uniform. He sighed and drifted into unconsciousness.\n \n \n\n He was\n still weak days later when\n Capt. Ron Small of SP-101 said,\n \n \"Yes, Karyl, it's ironical. They fed you\n what they thought was sure death, and it's\n the only thing that kept you going long\n enough to warn us.\"\n \n \"I was dumb for a long time,\" Karyl said.\n\"I thought that it was the acid, almost to\n the very last. But when I drank that last\n glass, I knew they didn't have a chance.\n \n \"They were metal monsters. No wonder\n they feared that liquid. It would rust their\n joints, short their wiring, and kill them.\n No wonder they stared when I kept alive\n after drinking enough to completely annihilate\n a half-dozen of them.\n \n \"But what happened when you met the\n ship?\"\n \n The space captain grinned.\n \n \"Not much. Our crew was busy creating\n a hollow shell filled with water to be shot\n out of a rocket tube converted into a projectile\n thrower.\n \n \"These Steel-Blues, as you call them, put\n traction beams on us and started tugging us\n toward the asteroid. We tried a couple of\n atomic shots but when they just glanced off,\n we gave up.\n \n \"They weren't expecting the shell of\n water. When it hit that blue ship, you could\n almost see it oxidize before your eyes.\n \n \"I guess they knew what was wrong right\n away. They let go the traction beams and\n tried to get away. They forgot about the\n force field, so we just poured atomic fire\n into the weakening ship. It just melted\n away.\"\n \n Jon Karyl got up from the divan where\n he'd been lying. \"They thought I was a\n metal creature, too. But where do you suppose\n they came from?\"\n \n The captain shrugged. \"Who knows?\"\n \n Jon set two glasses on the table.\n \n \"Have a drink of the best damn water in\n the solar system?\" He asked Capt. Small.\n \n \"Don't mind if I do.\"\n \n The water twinkled in the two glasses,\n winking as if it knew just what it had\n done.",
      "metadata": {
        "title": "Acid Bath",
        "author": "Vaseleos Garson",
        "passage_id": "29159",
        "uid": "9609fec92fe74398a42f49f7e9189da5",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "107",
                "uid": "b31679a0c6c74350831945f9dd9d43dc",
                "response_text": "Jon Karyl is bolting a new baffle plate on the stationary rocket engine and ignores what happens around other parts of the little asteroid. A peculiar spaceship lands a few hundred yards away from his plastic igloo, and a half-dozen steel-blue creatures slide out of the airlock. When he climbs up again and sees the creatures, Jon runs for the rocky slopes. Jon brings out his stubray pistol and turns up the oxygen dial for greater exertion as two of the creatures continue to chase him. He manages to elude them by going down a dim trail temporarily. Once Jon finds the stubby bush shaped like a Maltese cross, he keeps going until he reaches the hollowed-out space. He observes the steel-blue creatures from the televisor, noting how they head towards the station to try and destroy it. Although the station is not supposed to break because it is made out of stelrylite, the creatures pound holes into the station with round-headed metal clubs. He presses the atomic cannon’s firing buttons and finds that it is impossible to damage the ship. Suddenly, a Steel-Blue paralyzes him from the waist down and tells him to come with them. Once outside, the Steel-Blue explains to Jon that the most protective metal they use is the softest one in their world. He follows the Steel-Blue into the ship, where a more massive one tells Jon’s Steel-Blue to examine him and give him death. The Steel-Blue brings him to the examination room, where Jon is curious about this whole interaction. He thinks about warning the SP patrol and using his weapon, but his Steel-Blue tells him they are already aware of it. The other Steel-Blues begin reproducing the service station, and Jon’s Steel-Blue tells him that his torture will be dissolved in a liquid they have prepared. When he goes inside, he prepares to blast at the cylinder with his gun. However, the tentacles take it away from him and bring him a glass-like cup filled with liquid. Jon toasts to Earth and drinks the liquid, going to sleep shortly after. When he awakes again, the Steel-Blues are amazed that he is still alive. On the fifth day, Jon breaks out of his plastic bowl with his subray because he is hungry. The Steel-Blues try to torture him more with the poison, and Jon has now made it a fetish to stay alive. When Jon takes the drink from No. 1, it tells him that the SP ship will be destroyed. Jon tries to send a distress signal, and he watches as the SP ship begins to come abruptly. The Steel-Blues watch as he tries to escape, only to be greeted by the voice of a space guard. Captain Ron Small of SP-101 tells him later that the Steel-Blues fed him a liquid they feared. The Steel-Blues tried to fight back, but the SP ship just shot a water rocket and set it on atomic fire. Captain Small and Jon then toast to water. "
              },
              {
                "worker_id": "109",
                "uid": "31acfe616f274137b9e0fea11d046695",
                "response_text": "This story follows Jon Karyl, a service station attendant. While fixing something on the rocket engine, a landing peculiar blue ship escapes his attention. When he notices the intruders, he finds them to be steel-blue creatures intent on approaching and capturing him. Escaping away back to the service station, he fires atomic cannons at the creatures' ship only to watch it ricochet off. Suddenly, a Steel-Blue temporarily paralyzes his legs and instructs him to follow. Karyl finds out - through an exchange of mind-reading - that these Steel-Blues are just like Earthmen as they seek out further planets to inhabit. \n\nAnother Steel-Blue instructs Karyl's Steel-Blue to examine him and then torture him, leaving him to his death. Proclaimed to be a soft-metal creature, Karyl is instructed to enter a plastic igloo. This igloo is a reproduction of Earth's atmosphere, so the Steel-Blues can observe the torture. In it, Karyl is given a series of dilutions containing a liquid that dissolves metal, with the last tumbler containing the pure liquid. Though Karyl initially tries to escape using his stubray pistol, he becomes curious about death and drinks the liquid. To the Steel-Blues surprise, he survives the first night and all subsequent days as well, seemingly only suffering from a lack of food and nutrition. Karyl vows to stay alive until the SP ship can rescue him, but his Steel-Blue warns him that they will be ready to attack it when it comes. \n\nOn the sixteenth day, the Steel-Blues await Karyl to die as they give him the final undiluted liquid. Drinking it, Karyl laughs instead and taunts the Steel-Blues. Using a power-pack radio, he sends a warning signal to the SP ship. When it arrives, he stumbles out of the igloo and crawls until he hears a human voice. Later on in his recovery, he finds out that his warning was successful and that the liquid thought to be poison by the Steel-Blues was in fact water. Beneficial to humans, but harmful to robots. In fact, this is what the Captain of the SP ship used to attack the Steel-Blues. "
              },
              {
                "worker_id": "112",
                "uid": "49aa2fc3b2704c7c96d627da5046e08a",
                "response_text": "After he repairs the rocket engine, Jon Karyl, a starways’ Lone Watcher, notices the invasion of Steel-Blues, extraterrestrial robotic creatures. He flees towards the service station while six Steel-Blues chase behind him. During his run, Steel-Blues use power rays to attack him but fail. He flees successfully into the service station, uses the televisors to spot the motion of Steel-Blues, and examines them. He realizes Steel-Blues are robotic. The pounding sound upstairs makes Jon realizes that Steel-Blues is trying to break the entrance door. He thinks Steel-Blues are doing a useless job as the strongest metal forms the service station in the solar system. He goes to the station’s power plant to use the televisor that can see every room, but the Steel-Blue pounds a hole into the door, which seems impossible to him. He attacks the Steel-Blues’ spaceship with an atomic cannon bomb, finding the bomb ricochet off the ship and strike the rocket nearby. Suddenly, he is taken down by the Steel-Blue, who invades the station when he tries to attack the ship the second time. Through the conversation with the invading Steel-Blue, Jon knows that they can read his mind when it is directed outward.\n\nAs Jon is taken to the Steel-Blues’ ship, he learns that the toughest metal in the solar system is considered the most vulnerable one for Steel-Blues. He also knows that Steel-Blues’ purpose in invading the solar system is to conquer more living spaces for themselves. In the Steel-Blues’ ship, Jon sees the leader of the Steel-Blue, who orders Jon’s guide Steel-Blue to examine Jon. After Jon is examined, they classify him as a soft-metal creature by him. Jon is taken to a prison to undergo the torture built by the Steel-Blue, forced to drink a liquid used to dissolve the metal. The Earth space patrol cruiser will come to refuel their ship after 21 days; Jon knows that he has to stay alive until then to alert the SP ship. During the torture, namely drinking the unknown liquid, Jon attempts to escape but fails. The Steel-Blues every day watch him undergo torture. At the beginning of the torture, the liquid is diluted and tastes like some strong acid. As the days pass, the diluted portion decreases, and Jon realizes what the liquid is. Finally, on the last day, when the SP ship is scheduled to come, and Jon is fed with the undiluted liquid, he realizes that it is water and the weakness of the Steel-Blues. He sends the message to the SP ship and then passes out outside the prison. When he wakes up, he is rescued by the SP ship, and the Steel-Blues is destroyed by the powerful water attack of the SP ship.\n"
              },
              {
                "worker_id": "111",
                "uid": "dad2d25829c64a8a8647b1f9a35e09b7",
                "response_text": "The story follows Jon Karyl, a lone watcher that lives in what seems to be an asteroid. He is in charge of watching and protecting the asteroid before other humans come. While doing this, an alien ship arrives on the asteroid. Jon is forced to run from his base while the aliens chase him. He manages to get to his secondary entry to the base without the aliens seeing. When he gets back to the base, he tries to shoot the enemy ship with a cannon, but he doesn’t do any damage. Instead, the aliens manage to break into his base and capture him. Jon is taken to the enemy ship and he realizes that the aliens are in fact robots. The robots take him to their leader, where Jon is told that he will be tortured. Jon knows that there is another ship coming in 21 days, so he only has to survive for those days. The robots give Jon an acid that would slowly kill him, and Jon is forced to drink it. After a few days of this same routine, Jon escapes the ship using his blaster, as he is very hungry. He gets caught again and continues drinking the acid. When the human ship arrives, Jon manages to warn them about the robots. When Jon woke up from passing out, the humans had already destroyed the robots. It is revealed that they had been feeding Jon water and citric acid, thinking that it would kill Jon. "
              }
            ]
          },
          {
            "question_text": "What are the physical features of the Steel-Blue creatures?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "107",
                "uid": "b31679a0c6c74350831945f9dd9d43dc",
                "response_text": "The Steel-Blue creatures are described to be steel-blue in color. They have egg-shaped heads and walking appendages. The Steel-Blues are also around the height of Jon at six feet, and their appendages are many-jointed. These appendages also stretch and shrink independent of each other, but the cylindrical body and tentacles are kept on a level balance. Instead of eyes, the Steel-Blues have elliptical-shaped lenses that cover half of the head and converge around the sides of the head. Jon notes that they are robots without masters. When Jon follows the Steel-Blue later, he notes that it has a lens on the back of its head as well. The massive steel-blue creature that Jon meets has four more tentacles, including two short ones that grow out of its head. "
              },
              {
                "worker_id": "109",
                "uid": "31acfe616f274137b9e0fea11d046695",
                "response_text": "These creatures - robots - are steel-blue in nature with egg shaped heads. They stand at about six feet tall and have a rectangular-like stature with flexible appendages (able to move independently of each other), a cylindrical body, and ellipitcal-shaped lens for eyes that are present both on the front and back of their head. \n\nSome of the creatures, unlike Jon's Steel-Blue, also have more tentacles that also grew atop their heads. These tentacles were able to move like limbs, for example, it was able to grab the glass containing the yellowish liquid. "
              },
              {
                "worker_id": "112",
                "uid": "49aa2fc3b2704c7c96d627da5046e08a",
                "response_text": "Steel-Blue is around six feet high. Their head shape looks like an egg, colored Steel-Blue. Each has four pairs of independently jointed forked tentacles, stretching from their cylindrical body, which let them move. Their body shape is straight without the curve of the shoulder or hip. Elliptical-shaped lenses cover their heads for both the front and the back of their heads, whose ends wind around the side. They look like robots. They communicate with telepathy. The leader of the Steel-Blue, No. 1, is more massive than the normal ones and has four more pairs of tentacles, two of which are shorter and stretch out from its head."
              },
              {
                "worker_id": "111",
                "uid": "dad2d25829c64a8a8647b1f9a35e09b7",
                "response_text": "The creatures are described as being of a steel-blue color. They are six feet tall, and they have egg shaped heads. They don’t have any legs or hands, instead they have appendages that allow them to move. They are cylindrical, and have 4 tentacles that allow them to fight and grab things. Instead of eyes they have elliptical shaped lenses that allow them to see, and they also have lenses on the back of their head, which allows them to see. They also communicate with Jon via telepathy, and they can read his mind. "
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "107",
                "uid": "b31679a0c6c74350831945f9dd9d43dc",
                "response_text": "The story is initially set on an asteroid, where a stationary rocket station is. Jon has a blue plastic igloo to live in. There is also a ravine where he runs to in an attempt to elude the Steel-Blues. There are bushes, water, and dense thicket that he must go through before getting to the hollowed-out space in the center. At the station, there is a lock for his key to go through. The lever then opens to a long tunnel, and there is a televisor that fixes on the area. The station is made out of stelrylite, but it becomes riddled with holes after the Steel-Blues attack. The station also has a row of studs and a revolving turret that fires atomic cannons. There is a yellow, blue, and red button to fire. The Blue Steels’ spaceship can change its part to a bubble-like metal. The spaceship of the invaders is pitch-black and is a maze-like corridor. At the end, there is a circular room with bright light streaming from a glass-like and bulging skylight. In the examination room, the Steel-Blues build a miniature reproduction of the space station with plastic walls. There is a small opening in the four foot cylinder that brings him a strange liquid. Although the Steel-Blues are always present, the tank they keep him in is fairly easy to break out of. "
              },
              {
                "worker_id": "109",
                "uid": "31acfe616f274137b9e0fea11d046695",
                "response_text": "This setting occurs in the same system as Earth, inhabited both by humans and the Steel-Blue creatures. More specifically, this story takes place aboard the Steel-Blues' ship. Karyl encounters many rooms including the examination room, but the majority of the story has him in a clear plastic igloo by which is he observed by the creatures. The igloo is a miniature recreation of the service station with a lock outside. \n\nAt the end of the story, Karyl is saved and the setting changes to be onboard the Space Patrol ship, where he is safe and recovering."
              },
              {
                "worker_id": "112",
                "uid": "49aa2fc3b2704c7c96d627da5046e08a",
                "response_text": "The story happens on an asteroid under the control of the earthman. The surface of the asteroid is rocky and uneven. The service station is underground of a ravine, whose surface is filled with man-high bushes. Its entrance is hidden underneath a dense thicket around the hairpin turn of the old watercourse. In the center of the hollowed-out space lies a self-sealing lock, which is the door of the entrance. Behind the door, there is a long tunnel, the end of which is a room surrounded by the televisors. A steel ladder leads to the station’s power plant room, which is also equipped with televisors that can watch all the rooms in the station. There are weapons stored in the power room. The station is capped with a revolving turret. The outer shell of the service station, including the entrance door, is constituted by stelrylite, the toughest metal in Earthman’s knowledge. The blue spaceship lies near the stationary rocket engine outside the service station.  Inside the blue spaceship, it is dark and mazed with corridors. There is a circular room lighted with a bulging skylight, where the leader of the Steel-Blues is. \n\nThe Steel-Blues build a smaller plastic igloo, similar to the one in the service station, to serve as the prison for Jon to torture him. There are instruments ranged inside, such as an air pump from the station and a pallet laid inside. The wall is made of clear plastic. The atmosphere inside is reproduced as the one in the service station, only with more proportion of the oxygen. There is a cylinder whose center can open, where it usually sits a glass tumbler containing a yellowish liquid that is claimed to be the harmful liquid to torture Jon. The cylinder is equipped with tentacles that can control Jon to drink the liquid and take down his defense.\n"
              },
              {
                "worker_id": "111",
                "uid": "dad2d25829c64a8a8647b1f9a35e09b7",
                "response_text": "The story is located in a small asteroid that is described to be barren and empty, with gray rocks. The asteroid only has a single base, which is where Jon lives alone. There is also a ravine with plants that allow Jon to hide a secondary entry to his base, which is the one that he uses to get away from the steel-blues initially. When Jon gets captured, he is taken to the ship of the steel-blues, and he learns that they made a smaller replica of his base because they want him to die happily. "
              }
            ]
          },
          {
            "question_text": "What are some of the equipment used in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "107",
                "uid": "b31679a0c6c74350831945f9dd9d43dc",
                "response_text": "Jon uses a stubray pistol that he keeps on him at all times. The space station itself is fairly equipped, with a thin turret that can fire atomic cannons. The ship that the Steel Blues arrive in is very advanced as well, and it is capable of recovering from the cannon. The Steel Blue’s build his habitat out of plastic and other material that they have in possession. When the Steel Blue’s begin Jon’s torture, they feed him a drink that he thinks is hemlock. Later, Jon also uses his little power-pack radio to send a distress signal to the SP ship. When the SP ship defeats the Steel Blues, they use a rocket tube to shoot water and then atomic fire. "
              },
              {
                "worker_id": "109",
                "uid": "31acfe616f274137b9e0fea11d046695",
                "response_text": "One equipment is the power-pack radio that Jon has. He uses it at the end of the story to send out call letters to warn the space patrol ship of the awaiting attack from the Steel-Blues. He continually sends the message as a distress signal, unable to receive a message back. \n\nAnother piece of equipment is Jon's stubray gun. Kept on him as a protective weapon, he first attempts to blast the cylinder with it. His attempt was unsuccessful as the Steel-Blue quickly apprehended it, before being returned to him. Later on in the story, Jon uses it to escape his plastic igloo prison. "
              },
              {
                "worker_id": "112",
                "uid": "49aa2fc3b2704c7c96d627da5046e08a",
                "response_text": "Jon Karyl, a starways’ Lone Watcher on an asteroid, is in a rocket when he notices the invasion of the Steel-Blues, non-terrestrial robotic creatures who try to invade the terrestrial territory. Jon Karyl also possesses a stubray pistol, which he often uses to break his way out of the prison, which the Steel-Blues make, or attack the Steel-Blues. When he flees from the Steel-Blues, he also wears a spacesuit, whose boots can control gravity pull. He takes off his spacesuit until he goes into the prison made by the Steel-Blues. Jon Karyl uses the televisors in the service station to spot the motion of Steel-Blues and the revolving turret to attack the Steel-Blues’ ship. Jon wears a chronometer on his wrist to track the time, counting the remaining days of the arrival of the space patrol ship. He uses the power-pack radio to send the message to the space patrol ship on the day of their arrival."
              },
              {
                "worker_id": "111",
                "uid": "dad2d25829c64a8a8647b1f9a35e09b7",
                "response_text": "Both Jon and the Steel-blues use equipment throughout the story. First, Jon uses space boots and an oxygen dial when running from the steel-blues. The space boots allow him to control his gravitational pull, and the oxygen dial allows him to control the amount of oxygen that he is inhaling. Jon also uses a stubray pistol throughout the story to fight off the steel-blues and to escape from them. The steel-blues use black boxes to control different things. They also have smaller robots, which is what gives Jon the acid every day."
              }
            ]
          },
          {
            "question_text": "What is the relationship between Jon Karyl and his Steel-Blue (the one that he initially meets)?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "107",
                "uid": "b31679a0c6c74350831945f9dd9d43dc",
                "response_text": "Jon is initially curious about the Steel-Blue that he first meets in the space station. When he notices that it has eyes on the back of its head, it even says “Thank you” to him. It also tells him that its species can read his mind. The Steel-Blue also explains to him that the metal they use at the station is considered to be the softest one from where the Space Blue’s come from. It is not openly hostile towards him, but it does speak almost contemptuously when they go to the examination room. Although his Steel Blue initially did not show much hostility, it does warn him to not even think about contacting the SP ship or using his weapon. However, it does tease him and say that he gets absent-minded at times. When it tells him about the torture, his Blue Steel speaks in an almost-caressing way as well. When Jon breaks out of his tank to find food, his Steel-Blue tells him that it is the first of the creatures that he has met. It commands him to go back to the tank. Although it seems friendly at first, Jon and the Steel-Blue do not have any sort of positive relationship. The Steel-Blue wishes to see him suffer, while Jon wants to survive and get out of the torture room. "
              },
              {
                "worker_id": "109",
                "uid": "31acfe616f274137b9e0fea11d046695",
                "response_text": "The relationship between Karyl and his Steel-Blue is a tentative friendship, I would say. Both parties are curious about each other and seem more interested in learning about each other, rather than being vindictive like the No.1 Steel-Blue seems to be. For example, his Steel-Blue thanks Karyl when the latter comments on his innovative eyes on the back on his head. \n\nKaryl converses and interacts with his Steel-Blue the most, both in regards to the incoming SP ship as well as Karyl's apparent absent-mindedness. "
              },
              {
                "worker_id": "112",
                "uid": "49aa2fc3b2704c7c96d627da5046e08a",
                "response_text": "Jon Karyl, a starways’ Lone Watcher, is in a controlled relationship with the Steel-Blue, an extra-terrestrial robotic creature that he first meets. He is stricken down by the Steel-Blue and taken by it to its spaceship. Jon is the captive and the watched prisoner of the Steel-Blue. When Jon tries to escape from his prison or the torture because of the unbearable hunger, the Steel-Blue forces him to go back and stay in the newly-built smaller igloo. Jon breaks one tentacle of the Steel-Blue by using his stubray pistol when he tries to resist it. The Steel-Blue suppresses Jon by showing the power of its weapon and forces him back to the prison. The relationship between them is superior and inferior, in the sense of being captive. "
              },
              {
                "worker_id": "111",
                "uid": "dad2d25829c64a8a8647b1f9a35e09b7",
                "response_text": "The relationship between Jon and the first steel-blue is that of capturer-victim. The steel-blue manages to break into Jon’s base and captures Jon. After this, Jon uses the steel-blue to understand what the robots are and how they work. They communicate with each other, and Jon doesn’t seem to be afraid of the steel-blue. Jon was very curious about the species, so he didn’t want the robot in order to learn more about them. When Jon escapes from the torture, the same steel-blue captures him again and takes him back. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4825,
        "document_length_chars": 28442
      }
    }
  ]
}