{
  "item_metadata": {
    "item_id": "30004",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "30004",
      "content": "A grim tale of a future in which everyone is desperate to escape reality, and a hero who wants to have his wine and drink it, too.\n \n\n A BOTTLE OF\n   Old Wine\n \n\n\n By Richard O. Lewis\n \n\n Illustrated by KELLY FREAS\n \n \n Herbert Hyrel\n settled himself more comfortably in his easy chair, extended his short legs further toward the fireplace, and let his eyes travel cautiously in the general direction of his wife.\n \n She was in her chair as usual, her long legs curled up beneath her, the upper half of her face hidden in the bulk of her personalized, three-dimensional telovis. The telovis, of a stereoscopic nature, seemingly brought the performers with all their tinsel and color directly into the room of the watcher.\n \n Hyrel had no way of seeing into the plastic affair she wore, but he guessed from the expression on the lower half of her face that she was watching one of the newer black-market sex-operas. In any event, there would be no sound, movement, or sign of life from her for the next three hours. To break the thread of the play for even a moment would ruin all the previous emotional build-up.\n \n There had been a time when he hated her for those long and silent evenings, lonely hours during which he was completely ignored. It was different now, however, for those hours furnished him with time for an escape of his own.\n \n His lips curled into a tight smile and his right hand fondled the unobtrusive switch beneath his trouser leg. He did not press the switch. He would wait a few minutes longer. But it was comforting to know that it was there, exhilarating to know that he could escape for a few hours by a mere flick of his finger.\n \n He let his eyes stray to the dim light of the artificial flames in the fireplace. His hate for her was not bounded merely by those lonely hours she had forced upon him. No, it was far more encompassing.\n \n He hated her with a deep, burning savagery that was deadly in its passion. He hated her for her money, the money she kept securely from him. He hated her for the paltry allowance she doled out to him, as if he were an irresponsible child. It was as if she were constantly reminding him in every glance and gesture, \"I made a bad bargain when I married you. You wanted me, my money, everything, and had nothing to give in return except your own doltish self. You set a trap for me, baited with lies and a false front. Now you are caught in your own trap and will remain there like a mouse to eat from my hand whatever crumbs I stoop to give you.\"\n \n But some day his hate would be appeased. Yes, some day soon he would kill her!\n \n He shot a sideways glance at her, wondering if by chance she suspected.... She hadn't moved. Her lips were pouted into a half smile; the sex-opera had probably reached one of its more pleasurable moments.\n \n Hyrel let his eyes shift back to the fireplace again. Yes, he would kill her. Then he would claim a rightful share of her money, be rid of her debasing dominance.\n \n \n\n He let the\n thought run around through his head, savoring it with mental taste buds. He would not kill her tonight. No, nor the next night. He would wait, wait until he had sucked the last measure of pleasure from the thought.\n \n It was like having a bottle of rare old wine on a shelf where it could be viewed daily. It was like being able to pause again and again before the bottle, hold it up to the light, and say to it, \"Some day, when my desire for you has reached the ultimate, I shall unstopper you quietly and sip you slowly to the last soul-satisfying drop.\" As long as the bottle remained there upon the shelf it was symbolic of that pleasurable moment....\n \n He snapped out of his reverie and realized he had been wasting precious moments. There would be time enough tomorrow for gloating. Tonight, there were other things to do. Pleasurable things. He remembered the girl he had met the night before, and smiled smugly. Perhaps she would be awaiting him even now. If not, there would be another one....\n \n He settled himself deeper into the chair, glanced once more at his wife, then let his head lean comfortably back against the chair's headrest. His hand upon his thigh felt the thin mesh that cloaked his body beneath his clothing like a sheer stocking. His fingers went again to the tiny switch. Again he hesitated.\n \n Herbert Hyrel knew no more about the telporter suit he wore than he did about the radio in the corner, the TV set against the wall, or the personalized telovis his wife was wearing. You pressed one of the buttons on the radio; music came out. You pressed a button and clicked a dial on the TV; music and pictures came out. You pressed a button and made an adjustment on the telovis; three-dimensional, emotion-colored pictures leaped into the room. You pressed a tiny switch on the telporter suit; you were whisked away to a receiving set you had previously set up in secret.\n \n He knew that the music and the images of the performers on the TV and telovis were brought to his room by some form of electrical impulse or wave while the actual musicians and performers remained in the studio. He knew that when he pressed the switch on his thigh something within him—his ectoplasm, higher self, the thing spirits use for materialization, whatever its real name—streamed out of him along an invisible channel, leaving his body behind in the chair in a conscious but dream-like state. His other self materialized in a small cabin in a hidden nook between a highway and a river where he had installed the receiving set a month ago.\n \n He thought once more of the girl who might be waiting for him, smiled, and pressed the switch.\n \n \n\n The dank air\n of the cabin was chill to Herbert Hyrel's naked flesh. He fumbled through the darkness for the clothing he kept there, found his shorts and trousers, got hurriedly into them, then flicked on a pocket lighter and ignited a stub of candle upon the table. By the wavering light, he finished dressing in the black satin clothing, the white shirt, the flowing necktie and tam. He invoiced the contents of his billfold. Not much. And his monthly pittance was still two weeks away....\n \n He had skimped for six months to salvage enough money from his allowance to make a down payment on the telporter suit. Since then, his expenses—monthly payments for the suit, cabin rent, costly liquor—had forced him to place his nights of escape on strict ration. He could not go on this way, he realized. Not now. Not since he had met the girl. He had to have more money. Perhaps he could not afford the luxury of leaving the wine bottle longer upon the shelf....\n \n Riverside Club, where Hyrel arrived by bus and a hundred yards of walking, was exclusive. It catered to a clientele that had but three things in common: money, a desire for utter self-abandonment, and a sales slip indicating ownership of a telporter suit. The club was of necessity expensive, for self-telportation was strictly illegal, and police protection came high.\n \n Herbert Hyrel adjusted his white, silken mask carefully at the door and shoved his sales slip through a small aperture where it was thoroughly scanned by unseen eyes. A buzzer sounded an instant later, the lock on the door clicked, and Hyrel pushed through into the exhilarating warmth of music and laughter.\n \n The main room was large. Hidden lights along the walls sent slow beams of red, blue, vermillion, green, yellow and pink trailing across the domed ceiling in a heterogeneous pattern. The colored beams mingled, diffused, spread, were caught up by mirrors of various tints which diffused and mingled the lights once more until the whole effect was an ever-changing panorama of softly-melting shades.\n \n The gay and bizarre costumes of the masked revelers on the dance floor and at the tables, unearthly in themselves, were made even more so by the altering light. Music flooded the room from unseen sources. Laughter—hysterical, drunken, filled with utter abandonment—came from the dance floor, the tables, and the private booths and rooms hidden cleverly within the walls.\n \n Hyrel pushed himself to an unoccupied table, sat down and ordered a bottle of cheap whiskey. He would have preferred champagne, but his depleted finances forbade the more discriminate taste.\n \n When his order arrived, he poured a glass tumbler half full and consumed it eagerly while his eyes scanned the room in search of the girl. He couldn't see her in the dim swirl of color. Had she arrived? Perhaps she was wearing a different costume than she had the night before. If so, recognition might prove difficult.\n \n He poured himself another drink, promising himself he would go in search of her when the liquor began to take effect.\n \n A woman clad in the revealing garb of a Persian dancer threw an arm about him from behind and kissed him on the cheek through the veil which covered the lower part of her face.\n \n \"Hi, honey,\" she giggled into his ear. \"Havin' a time?\"\n \n He reached for the white arm to pull her to him, but she eluded his grasp and reeled away into the waiting arms of a tall toreador. Hyrel gulped his whiskey and watched her nestle into the arms of her partner and begin with him a sinuous, suggestive dance. The whiskey had begun its warming effect, and he laughed.\n \n This was the land of the lotus eaters, the sanctuary of the escapists, the haven of all who wished to cast off their shell of inhibition and become the thing they dreamed themselves to be. Here one could be among his own kind, an actor upon a gay stage, a gaudy butterfly metamorphosed from the slug, a knight of old.\n \n The Persian dancing girl was probably the wife of a boorish oaf whose idea of romance was spending an evening telling his wife how he came to be a successful bank president. But she had found her means of escape. Perhaps she had pleaded a sick headache and had retired to her room. And there upon the bed now reposed her shell of reality while her inner self, the shadowy one, completely materialized, became an exotic thing from the East in this never-never land.\n \n The man, the toreador, had probably closeted himself within his library with a set of account books and had left strict orders not to be disturbed until he had finished with them.\n \n Both would have terrific hangovers in the morning. But that, of course, would be fully compensated for by the memories of the evening.\n \n Hyrel chuckled. The situation struck him as being funny: the shadowy self got drunk and had a good time, and the outer husk suffered the hangover in the morning. Strange. Strange how a device such as the telporter suit could cause the shadow of each bodily cell to leave the body, materialize, and become a reality in its own right. And yet ...\n \n \n\n He looked\n at the heel of his left hand. There was a long, irregular scar there. It was the result of a cut he had received nearly three weeks ago when he had fallen over this very table and had rammed his hand into a sliver of broken champagne glass. Later that evening, upon re-telporting back home, the pain of the cut had remained in his hand, but there was no sign of the cut itself on the hand of his outer self. The scar was peculiar to the shadowy body only. There was something about the shadowy body that carried the hurts to the outer body, but not the scars....\n \n Sudden laughter broke out near him, and he turned quickly in that direction. A group of gaily costumed revelers was standing in a semi-circle about a small mound of clothing upon the floor. It was the costume of the toreador.\n \n Hyrel laughed, too. It had happened many times before—a costume suddenly left empty as its owner, due to a threat of discovery at home, had had to press the switch in haste to bring his shadowy self—and complete consciousness—back to his outer self in a hurry.\n \n A waiter picked up the clothing. He would put it safely away so that the owner could claim it upon his next visit to the club. Another waiter placed a fresh bottle of whiskey on the table before Hyrel, and Hyrel paid him for it.\n \n The whiskey, reaching his head now in surges of warm cheerfulness, was filling him with abandonment, courage, and a desire for merriment. He pushed himself up from the table, joined the merry throng, threw his arm about the Persian dancer, drew her close.\n \n They began dancing slowly to the throbbing rhythm, dancing and holding on to each other tightly. Hyrel could feel her hot breath through her veil upon his neck, adding to the headiness of the liquor. His feeling of depression and inferiority flowed suddenly from him. Once again he was the all-conquering male.\n \n His arm trembled as it drew her still closer to him and he began dancing directly and purposefully toward the shadows of a clump of artificial palms near one corner of the room. There was an exit to the garden behind the palms.\n \n Half way there they passed a secluded booth from which protruded a long leg clad in black mesh stocking. Hyrel paused as he recognized that part of the costume. It was she! The girl! The one he had met so briefly the night before!\n \n His arm slid away from the Persian dancer, took hold of the mesh-clad leg, and pulled. A female form followed the leg from the booth and fell into his arms. He held her tightly, kissed her white neck, let her perfume send his thoughts reeling.\n \n \"Been looking for me, honey?\" she whispered, her voice deep and throaty.\n \n \"You know it!\"\n \n He began whisking her away toward the palms. The Persian girl was pulled into the booth.\n \n Yes, she was wearing the same costume she had worn the night before, that of a can-can dancer of the 90's. The mesh hose that encased her shapely legs were held up by flowered supporters in such a manner as to leave four inches of white leg exposed between hose top and lacy panties. Her skirt, frilled to suggest innumerable petticoats, fell away at each hip, leaving the front open to expose the full length of legs. She wore a wig of platinum hair encrusted with jewels that sparkled in the lights. Her jewel-studded mask was as white as her hair and covered the upper half of her face, except for the large almond slits for her eyes. A white purse, jewel crusted, dangled from one arm.\n \n He stopped once before reaching the palms, drew her closer, kissed her long and ardently. Then he began pulling her on again.\n \n She drew back when they reached the shelter of the fronds.\n\"Champagne, first,\" she whispered huskily into his ear.\n \n His heart sank. He had very little money left. Well, it might buy a cheap brand....\n \n \n\n She sipped\n her champagne slowly and provocatively across the table from him. Her eyes sparkled behind the almond slits of her mask, caught the color changes and cast them back. She was wearing contact lenses of a garish green.\n \n He wished she would hurry with her drink. He had horrible visions of his wife at home taking off her telovis and coming to his chair. He would then have to press the switch that would jerk his shadowy self back along its invisible connecting cord, jerk him back and leave but a small mound of clothes upon the chair at the table.\n \n Deep depression laid hold of him. He would not be able to see her after tonight until he received his monthly dole two weeks hence. She wouldn't wait that long. Someone else would have her.\n \n Unless ...\n \n Yes, he knew now that he was going to kill his wife as soon as the opportunity presented itself. It would be a simple matter. With the aid of the telporter suit, he could establish an iron-clad alibi.\n \n He took a long drink of whiskey and looked at the dancers about him. Sight of their gay costumes heightened his depression. He was wearing a cheap suit of satin, all he could afford. But some day soon he would show them! Some time soon he would be dressed as gaily....\n \n \"Something troubling you, honey?\"\n \n His gaze shot back to her and she blurred slightly before his eyes.\n\"No. Nothing at all!\" He summoned a sickly smile and clutched her hand in his. \"Come on. Let's dance.\"\n \n He drew her from the chair and into his arms. She melted toward him as if desiring to become a part of him. A tremor of excitement surged through him and threatened to turn his knees into quivering jelly. He could not make his feet conform to the flooding rhythm of the music. He half stumbled, half pushed her along past the booths.\n \n In the shelter of the palms he drew her savagely to him. \"Let's—let's go outside.\" His voice was little more than a croak.\n \n \"But, honey!\" She pushed herself away, her low voice maddening him. \"Don't you have a private room? A girl doesn't like to be taken outside....\"\n \n Her words bit into his brain like the blade of a hot knife.\n \n No, he didn't have a private room at the club like the others. A private room for his telporter receiver, a private room where he could take a willing guest. No! He couldn't afford it! No! No! NO! His lot was a cheap suit of satin! Cheap whiskey! Cheap champagne! A cheap shack by the river....\n \n An inarticulate cry escaped his twisted lips. He clutched her roughly to him and dragged her through the door and into the moonlight, whiskey and anger lending him brutal strength.\n \n He pulled her through the deserted garden. All the others had private rooms! He pulled her to the far end, behind a clump of squatty firs. His hands clawed at her. He tried to smother her mouth with kisses.\n \n She eluded him deftly. \"But, honey !\" Her voice had gone deeper into her throat. \"I just want to be sure about things. If you can't afford one of the private rooms—if you can't afford to show me a good time—if you can't come here real often ...\"\n \n The whiskey pounded and throbbed at his brain like blows from an unseen club. His ego curled and twisted within him like a headless serpent.\n \n \"I'll have money!\" he shouted, struggling to hold her. \"I'll have plenty of money! After tonight!\"\n \n \"Then we'll wait,\" she said.\n\"We'll wait until tomorrow night.\"\n \n \"No!\" he screamed. \"You don't believe me! You're like the others! You think I'm no good! But I'll show you! I'll show all of you!\"\n \n \n\n She had gone\n coldly rigid in his arms, unyielding.\n \n Madness added to the pounding in his brain. Tears welled into his eyes.\n \n \"I'll show you! I'll kill her! Then I'll have money!\" The hands clutching her shoulders shook her drunkenly. \"You wait here! I'll go home and kill her now! Then I'll be back!\"\n \n \"Silly boy!\" Her low laughter rang hollowly in his ears. \"And just who is it you are going to kill?\"\n \n \"My wife!\" he cried. \"My wife! I'll ...\"\n \n A sudden sobering thought struck him. He was talking too much. And he wasn't making sense. He shouldn't be telling her this. Anyway, he couldn't get the money tonight even if he did kill his wife.\n \n \"And so you are going to kill your wife....\"\n \n He blinked the tears from his eyes. His chest was heaving, his heart pounding. He looked at her shimmering form. \"Y-yes,\" he whispered.\n \n Her eyes glinted strangely in the light of the moon. Her handbag glinted as she opened it, and something she took from it glittered coldly in her hand.\n \n \"Fool!\"\n \n The first shot tore squarely through his heart. And while he stood staring at her, mouth agape, a second shot burned its way through his bewildered brain.\n \n \n\n Mrs. Herbert Hyrel\n removed the telovis from her head and laid it carefully aside. She uncoiled her long legs from beneath her, walked to her husband's chair, and stood for a long moment looking down at him, her lips drawn back in contempt. Then she bent over him and reached down his thigh until her fingers contacted the small switch.\n \n Seconds later, a slight tremor shook Hyrel's body. His eyes snapped open, air escaped his lungs, his lower jaw sagged inanely, and his head lolled to one side.\n \n She stood a moment longer, watching his eyes become glazed and sightless. Then she walked to the telephone.\n \n \"Police?\" she said. \"This is Mrs. Herbert Hyrel. Something horrible has happened to my husband. Please come over immediately. Bring a doctor.\"\n \n She hung up, went to her bathroom, stripped off her clothing, and slid carefully out of her telporter suit. This she folded neatly and tucked away into the false back of the medicine cabinet. She found a fresh pair of blue, plastifur pajamas and got into them.\n \n She was just arriving back into the living room, tying the cord of her dressing gown about her slim waist, when she heard the sound of the police siren out front.\n \n \n THE END\n \n \n  Transcriber's Note:\n \n \n This etext was produced from If Worlds of Science Fiction July 1953. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed. Minor spelling and typographical errors have been corrected without note.",
      "metadata": {
        "title": "A Bottle of Old Wine",
        "author": "Richard O. Lewis",
        "passage_id": "30004",
        "uid": "6d147b53d07b4497af0cc10c3b0d380a",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "3",
                "uid": "8153b4928f5d49bcae292aaec1a7fb05",
                "response_text": "The story begins in a living room where a husband and wife sit in their respective chairs, the wife wearing a headset called a telovis. The husband, Herbert Hyrel, figures she is watching a sex-opera as her escapist entertainment of choice, and waits a few minutes to start his own entertainment. As we waits, he considers his anger towards his wife: he no longer resented the time she spent not talking to him, while utilizing her telovis, but he did hate that she controlled the purse-strings in the household and gave him a small allowance. His anger had been pent up for some time, enough that he wanted to kill his wife, but for now he was satisfied with the idea of killing her. Once enough time had passed, he flicked a switch on the teleporter suit he was wearing and a version of his body appeared in a cabin in the woods that he was renting, where he had left himself a fresh outfit. He headed to the Riverside Club where he hoped to encounter a woman he had met recently, and when he got there he sat down and drank some cheap whiskey. He encountered a costumed woman who teased him, pulled away to dance with someone else, but came back to dance with him once the man she was with disappeared.  This man had flipped the switch on his suit, disappearing and leaving behind a pile of clothes, presumably because he would have been discovered wherever his original body was. As Herbert danced and moved outside, he spotted the woman he had been looking for, wearing a suggestive costume and a platinum wig, her body and her purse all covered in jewels. She asked him for champagne, which he was upset about because he did not have much money, but he obliged and tried to move the night forward after he had had something to drink. Again, though, she requested he spend more money on her--this time, for a private room at the club so they did not have to be outside. She said she was asking him to prove to her that she could be spoiled, but this pressure reminded him how angry he was that he had to spend the little money he had trying to escape from his wife, budgeting in a way that limited his nights out just to have some privacy. He started yelling about how he would have more money soon, and eventually admitted that he would kill his wife to get it. Hearing this, the woman he was with pulled a gun out of her purse and shot him--it was his wife all along. The scene jumps back to the house, where the wife pulls off her telovis set, smugly turns off her husband's teleporter suit, and watches him gasp for air and die. She called the police to call for a doctor, hid her own teleporter suit, and waited for the police to show."
              },
              {
                "worker_id": "6",
                "uid": "4b34365346fa457f9cb8c10219add055",
                "response_text": "Herbert Hyrel finds himself in a loveless and difficult marriage. His wife has withdrawn herself, sticking to her televois or 3-D TV, and only gives him a monthly allowance. Her generational wealth makes him feel emasculated and weak, which only strengthens his hatred for her. Hyrel has recently invested in a teleporter suit, one that took him six months of saving to put the down payment on. This suit allows him to leave his corporeal body and travel to a shadow realm, where his conscious spirit can roam free. He uses this to drink, party, meet women, and escape from his wife and true reality. \nHe’s looking forward to traveling again, because of the woman he met last time in the flapper outfit. He hopes that this night will be the night she gives herself to him. After soaking in the wonderful thoughts of murdering his wife--which he plans to do as soon as the thought no longer brings him joy--Hyrel flicks the switch on his teleporter suit and arrives naked in a small cabin. Quickly, he changes into his cheap satin suit and makes his way to Riverside Club by taking the bus and walking. Once there, he orders a bottle of cheap whiskey, thanks to his depleting funds, and watches the masked dancers around him. A woman in a Persian-themed costume kisses him on the cheek but leaves him for another man. That man suddenly disappears, leaving only his costume behind. Hyrel reveals that those who get hurt in the shadow realm carry the hurt back with them in the real world. For example, he cut his hand in Riverside Club, and the pain traveled with him, but not the scar. \nThe Persian dancer joins him again, and they start to leave the club. He’s drawn to another woman the same from the night before. He swaps ladies and dances with her instead. She asks for champagne, which he reluctantly purchases. \nThey drink, and then he forces her out of the club. Feeling less-than, he forces himself on her, trying to kiss and grope her. She keeps asking him if he has enough money for her, where his private room is, and if he’ll be coming back soon. This only emasculates him more and he soon explodes, telling her that he’s going to kill his wife so he can finally have her money and do what he wants. \nThe flapper pulls out a gun and shoots him in the head and brain. She flicks the switch, and Mrs. Hyrel wakes up in her chair. She flicks the switch on Herbert, and he comes back in a vegetative state since his body brought back the pain, but not the scar. She calls the police, alibi in check, then removes and hides her teleporter suit. She puts on a pair of blue pajamas then meets the police at the door. \n"
              },
              {
                "worker_id": "8",
                "uid": "b222f2f4bec443239378fb29b8e3d73a",
                "response_text": "Herbert Hyrel is a man in an unhappy marriage who plots to murder his wife in order to be rid of her and inherit her money. Herbert despises the way his wife looks at him, and he imagines her denigrating him as a gold-digger with nothing to offer a woman, so he privately purchases a telporter suit--a thin, mesh body cover that can be worn under one's clothes and is used to transport the wearer's \"shadowy self\" to a receiver previously set in secret. While he believes his wife is watching a sex-opera using her telovis (a 3-D imaging device), Herbert engages the telporter and transports himself to a cabin situated between a highway and a river. There, he changes clothes and walks to the Riverside Club (a place where owners of telporter suits can gather to escape their dreary outer lives) where he plans to meet a girl he had met the previous night. Because telporting oneself is illegal, rooms at the club are very expensive in order to cover the costs of police protection and Herbert cannot afford a private room there with the allowance his wife gives him. The club is colorful and full of costumed, masked partyers, dancing together and drinking champagne. Herbert purchases a bottle of whiskey because he cannot afford the expensive champagne. As Herbert drinks, he becomes more relaxed and confident, and he watches a woman dressed in a Persian costume dancing with a man dressed as a bullfighter. Soon after, the bullfighter disappears, and Herbert is reminded that sometimes people at the club vanish suddenly when there is a threat they will be discovered in their outer lives. He also notices a scar on his hand and is reminded that when someone's shadow self is injured, their outer husk retains the feeling of pain but not the scar. Herbert dances with the Persian-costumed woman and becomes steadily more intoxicated by drink and by the atmosphere of revelry. Eventually, he finds the girl he had met the night before, recognizing her by her long, stockinged legs. She wears a platinum wig, a white mask, and green contact lenses, and they dance together and kiss. The drunker Herbert becomes, the more insecure he feels about his ability to satisfy the woman, and he begins lashing out at her, accidentally revealing his plans to kill his wife in order to take her money so he can start a new life with the mysterious woman. The woman laughs at him, and she withdraws a gun from her purse and shoots Herbert twice--once in the heart and then in the head. The woman is actually Mrs. Herbert Hyrel, and she has been using her own telporter suit to expose Herbert and dispose of him herself. Because Herbert’s gunshot wounds do not transfer with his shadowy self back to his outer body, it appears as if Herbert simply died. Mrs. Herbert Hyrel calls the police, hides the telporter suits, and awaits their arrival."
              },
              {
                "worker_id": "2",
                "uid": "ffd0cfd160fc44d39d6b41a124550cdd",
                "response_text": "Herbert Hyrel and his wife have an unhappy marriage. Herbert hates his wife and feels as if she thinks she is better than he is. She has money but only gives him a small allowance, and he resents her for this. She isn’t fond of him either. Every night, she puts on her telovis for about three hours. Herbert thinks she is watching black-market sex-operas. Once she is caught up in the program, he uses his teleporter suit to escape to the Riverside Club. This is an exclusive club for people with teleporter suits, money, and a desire for self-abandonment. People go there to escape their boring, unpleasant lives and wear costumes to hide their identities while they engage in drunken, sexually-abandoned activities. Herbert has met a girl there and wants to see her again. He looks for her when he first arrives but doesn’t see her, so he is interested in a Persian dancing girl who flirts with him. She is with a man dressed as a toreador. Herbert catches a glimpse of the scar on his hand where he had cut it at the club three weeks ago. In his unteleported body, he feels the pain of the cut but has no cut. \n\tLater in the evening, the toreador disappears from the dance floor, leaving behind a pool of his clothes. This means that he had to teleport back to his real life immediately; it is something that has happened many times at the club. Emboldened by his whiskey, Herbert moves in and embraces the Persian dancing girl. He draws her toward the exit to the gardens when he sees a long leg wearing a black mesh stocking protruding from a private booth. That is what the girl from the previous evening was wearing. He pulls the stockinged girl from the booth and dances with her. The stockinged girl is wearing a can-can dancer costume. She insists on having a glass of champagne before Herbert takes her outside. While she drinks, he worries that he won’t be able to see her again until he gets his next allowance in two weeks and that she will find someone else in the meantime. He decides that he is going to kill his wife so he can have her money. When he tries to take the girl outside, she resists. She lets him know she wants him to have the money for a private room, show her a good time, and come see her often. He tells her he’ll have plenty of money after tonight and that he will kill his wife to get it. The dancer pulls a gun from her purse and shoots him. \n\tMrs. Hyrel removes her telovis and pushes Herbert’s teleport button to bring him back. His eyes open, and then he dies. She calls the police, saying something horrible has happened to her husband. Then she changes clothes, removing her teleporter suit, and hiding it behind a hidden door at the back of the medicine cabinet.\n"
              }
            ]
          },
          {
            "question_text": "Who is Herbert's wife and what is her role in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "3",
                "uid": "8153b4928f5d49bcae292aaec1a7fb05",
                "response_text": "Herbert's wife controls the financial affairs in their household. She is a fan of her telovis set, her preferred medium for escapist entertainment, and Herbert is under the impression that she likes to watch sex-operas, which are a longer experience that rely on emotional build-up. She makes most of the money but also controls it all, which Herbert resents her for--he thinks she is keeping it from him, and feels looked down upon when she gives him his allowance. This infantilizing attitude makes him extremely angry. She is devious and cunning, and hatches a plan to catch him in his act. It is her, after all, that drove him to want to escape. Either to confirm suspicions of a murder plot or to disrupt his own escapist time, she has her own teleporter suit that she uses to position herself to seduce her husband in the one place he figured he would be free from her. She dresses up covered in jewels and insists that he spend money on her to pressure him to admitting that he has none, which eventually pushes him to admit his plan. She kills him once she hears this, and calmly puts everything back in order as she reports something being wrong with her husband to the police, clearly not upset that her husband is dead. "
              },
              {
                "worker_id": "6",
                "uid": "4b34365346fa457f9cb8c10219add055",
                "response_text": "Mrs. Herbert Hyrel is the daughter of a wealthy family. Although she and Herbert most likely originally married for love, their relationship quickly spiraled out of control and soon their disparity in wealth became a pressing issue. \nMrs. Hyrel withdrew herself from her husband once she felt that he was only with her for her money. She allotted him a monthly allowance, but that was all. Since Herbert was not the breadwinner, he felt emasculated and out of control in his own home. She is the instigator for his violent fantasies of killing her, and the woman that draws him back to Riverside Club. \nHer jewel-studded flapper dress that reveals her legs reveals her wealth and status at the Riverside Club. She wears green contacts and a platinum wig to further disguise herself from Herbert. Despite being married, he fails to recognize her, and, after tempting him and berating him, he reveals to her his plans to murder his wife. She then murders him in the shadow realm, killing his soul there but leaving his corporeal body intact in the real world. After traveling back to their home, Mrs. Herbert Hyrel supposedly gets away with the murder by pretending to be the doting wife concerned for her husband’s health. She also has a rock-solid alibi with the televois and the fact that Hyrel was in an illegal teleporter suit. \n"
              },
              {
                "worker_id": "8",
                "uid": "b222f2f4bec443239378fb29b8e3d73a",
                "response_text": "Mrs. Herbert Hyrel is a strong, financially independent woman loathed by her husband because he feels she considers him less of a man because of his reliance upon her. At the beginning of the story, she wears a telovis--a device used to render 3-D images of remote performances in one's own living room. Herbert suspects she is using the device to watch a sex-opera, and that explains the slight smile on her face as he watches her. In reality, she is likely smiling because she is confident in her plan to catch Herbert at the Riverside Club and kill him there. Mrs. Hyrel provides Herbert a small allowance, which he saves up to purchase his own telporter suit, not knowing that she also has one. Mrs. Hyrel uses Herbert's tendency toward fantasy as an advantage in her plot against him. She takes on the persona of the mysterious woman, wearing a white mask, green contact lenses, and a platinum blonde wig. She seduces Herbert, and eventually kills him when he admits his plot to her. She knows she will get away with his murder because once his shadowy self transfers back into his body, there will be no visible wounds."
              },
              {
                "worker_id": "2",
                "uid": "ffd0cfd160fc44d39d6b41a124550cdd",
                "response_text": "Herbert’s wife is the can-can girl that he met at the Riverside Club the night before, but he doesn’t recognize her. She detests Herbert and resents having to give him some of her money. She acts as if he tricked her into marrying him and now treats him like an irresponsible child. Every night, she escapes from him when she puts on her telovis and watches shows for three hours. The night in the story, we learn that she actually teleports to the Riverside Club, too. At the club the night before, she met Herbert and flirted with him so much that he couldn’t wait to see her again. When he goes to the club the night that the story takes place, he looks for her, finally finds her, and pulls her out of a booth to him. She wears a can-can dancer outfit that highlights her long legs. Herbert tries to take her outside immediately, but she insists on having champagne first. She drinks her champagne slowly while Herbert is anxious that he might have to teleport back. Herbert decides that he will go ahead and kill his wife, as he has been thinking about doing for quite some time. They dance, and then Herbert tries to pull her outside. Mrs. Hyrel asks if he doesn’t have a private room he can take her to. Frustrated, he drags her outside, but she pushes away from him and says she needs to know he can afford a private room, show her a good time, and come there often to see her. When he says he’ll have money after tomorrow night, she insists they will wait until then. Angry and desperate, Herbert vows he will kill his wife, and then he will have money. Mrs. Hyrel laughs and asks who he will kill, and he repeats it even though he realizes he shouldn’t. She removes a gun from her purse and shoots him in the heart and the head. She teleports back home, presses his teleporter button, and after he dies, she calls the police saying that something horrible has happened to her husband. Before the police arrive, she changes out of her teleporter suit and hides it behind a hidden back in the medicine cabinet.\n"
              }
            ]
          },
          {
            "question_text": "Describe the dynamic between Herbert and his wife",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "3",
                "uid": "8153b4928f5d49bcae292aaec1a7fb05",
                "response_text": "The relationship Herbert and his wife have seems to have an infantilizing or patronizing tone to it. His wife seems to be fairly cold towards him, at least from the way she interacts with his death in the last scene of the story, but Herbert is harboring a large amount of hate and anger. A lot of this dynamic is driven by the control of money in the household, as Herbert's wife is in charge of these decisions, and Herbert does not agree with her on how much money he should have access to. His anger increases as he works on a plan to get away from her, as he spends what little he has to maintain access to the Riverside Club, paying rent on a cabin, buying a teleporter suit, and similar expenses. He is finally pushed to make the choice to finally want to kill her when he finds he does not have the spending money to be able to buy nice drinks or private rooms for himself and the woman he meets at the club, who turns out to be his wife. "
              },
              {
                "worker_id": "6",
                "uid": "4b34365346fa457f9cb8c10219add055",
                "response_text": "Mr. and Mrs. Herbert Hyrel have a constant struggle for power within their domestic relationship. Mrs. Hyrel’s family wealth insults Herbert, seeing as he has none. When she comes to the realization that he may only be with her because of her money, she starts to hide it from him and only gives him a monthly allowance. At that moment, Mrs. Hyrel took control and took most of Herbert’s power away from him. \nIt’s clear that Hyrel wants to be the man of the relationship or the one that wears the pants. So this action made him feel weak and unimportant. This further aggravated their marriage and led to a build-up of long-term resentment. \nMrs. Hyrel practically ignores Herbert, spending her evenings watching the televois. She doesn’t want to be bothered during this time either, since it would ruin the show. It’s later revealed that she also has a teleporter suit, so she may have been in the Riverside Club in other instances, not just watching the televois. This power struggle and wealth inequity led to Herbert’s murderous fantasies and his eventual murder. \n"
              },
              {
                "worker_id": "8",
                "uid": "b222f2f4bec443239378fb29b8e3d73a",
                "response_text": "The story never shows the Hyrels communicating outside of their shadowy selves; this emphasizes their dysfunction as a couple and highlights their mutual disdain. Herbert thinks his wife hates him because she believes he married her for her money, and he lives off the allowances she gives him. In turn, Herbert feels emasculated, and blames this on her, despite the fact that he does nothing but take her money and use it to attempt to seduce women at the Riverside Club. Herbert compares the thought of killing his wife to a bottle of old wine; the longer one marvels at a nice, expensive bottle of wine, the better it tastes when one finally drinks it. In the same way, he relishes his scheme, almost becoming intoxicated by it. When Herbert reunites with the woman at the Riverside Club, he cannot stop worrying that his wife will remove her telovis and discover him, and he continuously obsesses over his plan with increasing urgency. Herbert is so blinded by his rage and insecurities, that he fails to realize the woman is actually Mrs. Hyrel in disguise. "
              },
              {
                "worker_id": "2",
                "uid": "ffd0cfd160fc44d39d6b41a124550cdd",
                "response_text": "The Hyrels have an unhappy marriage. In the evenings, they escape from each other, Mrs. Hyrel to her telovis shows and he to the Riverside Club. Herbert first resented Mrs. Hyrel’s hours-long escape each night that left him lonely in the evenings, but then he gets his teleporter suit and can’t wait for her to get wrapped up in her shows so that he can escape to the club. His resentment of his wife grew into hatred. Herbert does not have money of his own; his wife has money and gives him a “paltry” allowance as if he were a child. She seems to resent him, too, because he thinks she feels like she got a bad deal in marrying him and that she was trapped into marrying him without knowing what he was really like. Herbert has been thinking of killing his wife for some time, but he doesn’t want to do it right away because thinking about it is like the anticipation of enjoying an old bottle of wine. As long as the bottle is there, he can enjoy the hope of drinking it just as he can enjoy the hope of killing his wife. Even in her altered identity as the can-can dancer at the club, Mrs. Hyrel treats Herbert as inferior. She refuses to let him take her outside until he has bought her a glass of champagne; then she makes him wait a long time while she sips it. When he finally does take her outside, she refuses to do what he wants unless he can show her he has the money for a private room and to entertain her properly. Mrs. Hyrel knows that this will frustrate him even more and probably suspected that he wanted to kill her. In any case, she has planned to kill him because she brought her gun with her. When he states that he will kill his wife to have the money to entertain the girl, Mrs. Hyrel promptly shoots him. Her plan is well-thought-out because she has a hidden back to her medicine cabinet where she hides her teleporter suit before the police come. This hidden compartment has allowed her to keep her visits to the Riverside Club from Herbert and will prevent the police from suspecting her role in Herbert’s death.\n\n"
              }
            ]
          },
          {
            "question_text": "What is the significance of teleporter suits in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "3",
                "uid": "8153b4928f5d49bcae292aaec1a7fb05",
                "response_text": "Teleporter suits play an important role in the relationship of Herbert and his wife, but also in the society that they live in more broadly. In terms of broad significance, the teleporter suits are important to the Riverside Club, as only people who own one are allowed to enter. They are illegal to own, so the club had to be careful about who they let in. Even though they are frowned upon, it seems they are a popular purchase for those who can afford them. Both Herbert and his wife own one, though we don't learn that his wife has one until the end of the story. For Herbert, the teleporter suit is his ticket to spend time outside of the house that he feels trapped in, in a relationship that he is not happy in. It allows him to visit this club and meet other people. At the same time, it is these suits that allowed his wife to follow him to the club and convince him to admit his plans, eventually ending in his death. After she shoots him, she hides her own suit but leaves his on his person. Because the body in the suit and the other copy of the body experience things differently, it was a sneaky way to kill her husband. "
              },
              {
                "worker_id": "6",
                "uid": "4b34365346fa457f9cb8c10219add055",
                "response_text": "Teleporter suits are an illegal yet highly sought-after and expensive tech gadget in this society. With this suit, the wearer can be transported to another realm, while their body remains in place. Their souls can have fun, dance the night away, drink as much as they want, and their partners or families will never know. The next morning, however, when they return to their corporeal body, they will carry last night’s hangover with them to the physical realm. \nThe teleporter suit allows Herbert Hyrel to escape his suffocating household and relish in his manly and sexual fantasies. He wants to prove himself to society and to brand himself as something he is not. In this other world, he can pretend to be a much richer, more powerful man. His rich wife makes him feel insignificant, so he takes his troubles to the shadow realm. \nThe teleporter suits allow the wearer to travel between realms, but a connection between the shadow self and body remains. Whatever happens to the shadow self, will also happen to the corporeal self, only the physical or visual element will not be there. So, if someone were to get hurt in the shadow realm, their physical body would feel the pain but would not bear the scars. \nThis allows Mrs. Herbert Hyrel to murder her husband in the shadow realm, and return to the physical world without blood or any incriminating evidence. \n"
              },
              {
                "worker_id": "8",
                "uid": "b222f2f4bec443239378fb29b8e3d73a",
                "response_text": "The telporter suits catalyze the major conflict in the story. In one sense, Herbert's telporter suit represents his ability to escape what he considers to be an emasculating, oppressive marriage. On the other hand, Mrs. Hyrel's secret telporter suit leads to Herbert's eventual demise. The suits are made of a thin mesh that fits the body like a stocking and can be worn underneath one's clothes. The telporter can be engaged by flicking a small switch, and it sends its wearer to a receiver at a previously-set location. Herbert installs his receiver at a small cabin in the woods a short distance away from the Riverside Club since he cannot afford the private rooms there. Herbert does not understand the mechanics behind the suit, but he grasps its basic function--the suits transport a person's \"shadowy self\" from one's body and the body is left in \"a conscious but dream-like state.\" When the shadowy self returns, the body does not retain any scars the shadowy self may have sustained but it does feel the pain of those injuries. Self-telportation is also illegal, although the Riverside Club maintains police protection by charging high prices and paying them off. Mrs. Hyrel uses to her advantage when she foils Herbert's plans to kill her and instead kills him and makes it appear as if he simply died while engaging in illegal activity."
              },
              {
                "worker_id": "2",
                "uid": "ffd0cfd160fc44d39d6b41a124550cdd",
                "response_text": "\n\tThe teleporter suits provide people with a means of escape from their boring or unpleasant lives. Many people have them and use them to go to the Riverside Club where they can abandon their lives and live for the pleasure of the moment without anyone knowing who they are since everyone there wears costumes and masks. In addition, self-teleportation is illegal, so no one wants anyone else to know they have teleportation suits. When people use their teleporter suits, their real bodies stay where they are in reality while their “shadow” bodies travel to another place. People who teleport to the Riverside Club can do anything they want without their spouses or anyone else knowing what they are doing. Meanwhile, since their real bodies remain in “real life,” it looks as if the person is still there, doing nothing out of the ordinary that can draw suspicion or blame from anyone who knows them. \n"
              }
            ]
          },
          {
            "question_text": "Describe the significance of the Riverside Club in the society in general and the story in particular.",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "3",
                "uid": "8153b4928f5d49bcae292aaec1a7fb05",
                "response_text": "The Riverside Club is a place that only the wealthy can escape to: all of the clientele have a lot of money, but they also needed a lot of money to gain access, as they have to prove that they own a teleporter suit to get in. Everyone who goes there is looking to escape themselves, but ironically Herbert escapes his wife to end up right back in front of her. Besides being a point of interest because it offered the clearest path of escape for Herbert, the club is also important because it shows glimpses into how the suits work: when someone has to leave suddenly, their clothes are left behind because it is just the copy of the body that moves. The club also was significant to the story because it provided a place for Herbert's wife to play out her plan to catch Herbert in his own plot."
              },
              {
                "worker_id": "6",
                "uid": "4b34365346fa457f9cb8c10219add055",
                "response_text": "The Riverside Club represents the most hedonistic, wealthy, and illusion-filled group of people. It caters to the wealthy, giving them a place to escape the troubles and rules of the corporeal world and loosen up with ample drinks and scantily-clad people. The Riverside Club creates a fantasy for people to run away to, a dreamworld where cheating isn’t bad, where over-drinking is normal, and where people can be whoever they want to be. \nIn the case of Mr. Herbert Hyrel, he travels to the Riverside Club to make himself feel like more of the man he wants to be. He goes there to pick up women, prove to them that he’s worth something, as well as prove that same sentiment to himself. His rich wife no longer shares her money nor her time with him, which only further emasculates him. He travels to the Riverside Club in search of fantasy and other women. However, he had to use her money in order to buy the teleporter suit that could take him there. The Riverside Club eventually becomes the scene of Hyrel’s reunion with his wife and subsequent murder. \n"
              },
              {
                "worker_id": "8",
                "uid": "b222f2f4bec443239378fb29b8e3d73a",
                "response_text": "The Riverside Club is a social club where revelers can self-telport in order to escape their outer lives and dress in lavish costumes, drink champagne, and dance and sleep together in private rooms. The club has a large main room softly lit by intermingling, colored lights. People dance on the dance floor in this room and dine and drink together at tables surrounding it. There are also private rooms and booths hidden within the walls surrounding the main room. Near the exit stands a clump of artificial palm trees which leads outside to a garden where Herbert attempts to drag the mysterious woman when they are dancing together, presumably for a sexual encounter. Herbert wants to go outside because he cannot afford a private room, and when the mysterious woman insists they wait until he can afford one, Herbert explodes in a rage and reveals his plot to kill his wife. The club is quite expensive for practical purposes--since self-telportation is illegal, they need to charge enough to cover the cost of paying off the police. The Riverside Club represents Herbert's physical and mental retreat from his miserable life and is also the environment that ultimately leads to his death."
              },
              {
                "worker_id": "2",
                "uid": "ffd0cfd160fc44d39d6b41a124550cdd",
                "response_text": "The Riverside Club is an exclusive club for people with money who want to live out their fantasies without other people knowing who they are or what they are doing. The club requires its members to have money, a desire for self-abandonment, and a teleporter suit; it encourages people to act without society’s limitations on its citizens. It offers alcoholic beverages, private booths and rooms, and places outdoors where couples can engage in any activity they want. The club’s atmosphere is happy, fun, and exotic with altering lights, music, drinks, and dancing. It offers people the opportunity to remain physically present in their acceptable roles while escaping those roles in private. Because their real identities are hidden, people can act in ways that are uncharacteristic to them, with unpopular people becoming popular, depressed people becoming cheerful, and inferior-feeling men becoming “all-conquering males.” \n\tIn the story, the Riverside Club is significant because it is the escape that Herbert and his wife both turn to, enabling them to act out their fantasies away from each other. However, it is ironic that the girl Herbert meets and can’t wait to see again is his wife. She, however, knows who Herbert is since she is prepared and has a gun and kills him when he says he is going to murder his wife. Mrs. Hryel seems to have been going to the club to ultimately get rid of Herbert and enjoy herself since she is in a private booth with someone else when he finds her. It also seems that she has had “entertainment” with other men because she tells him, “A girl doesn’t like to be taken outside,” and Herbert interprets this as meaning she has had assignations with other men, but those men all had private rooms. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 3675,
        "document_length_chars": 20696
      }
    }
  ]
}