{
  "item_metadata": {
    "item_id": "30029",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "30029",
      "content": "LOST IN TRANSLATION\n \n\n By\n \n\n LARRY M. HARRIS\n \n In language translation, you may get a literally accurate word-for-word translation ... but miss the meaning entirely. And in space-type translation ... the effect may be the same!\n \n\n Illustrated by Schoenherr\n \n\n \n The cell had been put together more efficiently than any Korvin had ever been in. But that was only natural, he told himself sadly; the Tr'en were an efficient people. All the preliminary reports had agreed on that; their efficiency, as a matter of fact, was what had made Korvin's arrival a necessity. They were well into the atomic era, and were on the verge of developing space travel. Before long they'd be settling the other planets of their system, and then the nearer stars. Faster-than-light travel couldn't be far away, for the magnificently efficient physical scientists of the Tr'en—and that would mean, in the ordinary course of events, an invitation to join the Comity of Planets.\n \n An invitation, the Comity was sure, which the Tr'en would not accept.\n \n Korvin stretched out on the cell's single bunk, a rigid affair which was hardly meant for comfort, and sighed. He'd had three days of isolation, with nothing to do but explore the resources of his own mind. He'd tried some of the ancient Rhine experiments, but that was no good; he still didn't show any particular psi talents. He couldn't unlock the cell door with his unaided mind; he couldn't even alter the probability of a single dust-mote's Brownian path through the somewhat smelly air. Nor could he disappear from his cell and appear, as if by magic, several miles away near the slightly-damaged hulk of his ship, to the wonder and amazement of his Tr'en captors.\n \n He could do, as a matter of fact, precisely nothing. He wished quietly that the Tr'en had seen fit to give him a pack of cards, or a book, or even a folder of tourist pictures. The Wonders of Tr'en, according to all the advance reports, were likely to be pretty boring, but they'd have been better than nothing.\n \n In any decently-run jail, he told himself with indignation, there would at least have been other prisoners to talk to. But on Tr'en Korvin was all alone.\n \n True, every night the guards came in and gave him a concentrated lesson in the local language, but Korvin failed to get much pleasure out of that, being unconscious at the time. But now he was equipped to discuss almost anything from philosophy to plumbing, but there was nobody to discuss it with. He changed position on the bunk and stared at the walls. The Tr'en were efficient; there weren't even any imperfections in the smooth surface to distract him.\n \n He wasn't tired and he wasn't hungry; his captors had left him with a full stock of food concentrates.\n \n But he was almightily bored, and about ready to tell anything to anyone, just for the chance at a little conversation.\n \n As he reached this dismal conclusion, the cell door opened. Korvin got up off the bunk in a hurry and spun around to face his visitor.\n \n The Tr'en was tall, and slightly green.\n \n He looked, as all the Tr'en did, vaguely humanoid—that is, if you don't bother to examine him closely. Life in the universe appeared to be rigidly limited to humanoid types on oxygen planets; Korvin didn't know why, and neither did anybody else. There were a lot of theories, but none that accounted for all the facts satisfactorily. Korvin really didn't care about it; it was none of his business.\n \n The Tr'en regarded him narrowly through catlike pupils. \"You are Korvin,\" he said.\n \n It was a ritual, Korvin had learned. \"You are of the Tr'en,\" he replied. The green being nodded.\n \n \"I am Didyak of the Tr'en,\" he said. Amenities over with, he relaxed slightly—but no more than slightly—and came into the cell, closing the door behind him. Korvin thought of jumping the Tr'en, but decided quickly against it. He was a captive, and it was unwise to assume that his captors had no more resources than the ones he saw: a small translucent pistollike affair in a holster at the Tr'en's side, and a small knife in a sheath at the belt. Those Korvin could deal with; but there might be almost anything else hidden and ready to fire on him.\n \n \"What do you want with me?\" Korvin said. The Tr'en speech—apparently there was only one language on the planet—was stiff and slightly awkward, but easily enough learned under drug hypnosis; it was the most rigorously logical construction of its kind Korvin had ever come across. It reminded him of some of the mathematical metalanguages he'd dealt with back on Earth, in training; but it was more closely and carefully constructed than even those marvels.\n \n \"I want nothing with you,\" Didyak said, leaning against the door-frame. \"You have other questions?\"\n \n Korvin sighed. \"What are you doing here, then?\" he asked. As conversation, it wasn't very choice; but it was, he admitted, better than solitude.\n \n \"I am leaning against the door,\" Didyak said. The Tr'en literalist approach to the smallest problems of everyday living was a little hard to get the hang of, Korvin told himself bitterly. He thought for a second.\n \n \"Why did you come to me?\" he said at last.\n \n Didyak beamed at him. The sight was remarkably unpleasant, involving as it did the disclosure of the Tr'en fifty-eight teeth, mostly pointed. Korvin stared back impassively. \"I have been ordered to come to you,\" Didyak said, \"by the Ruler. The Ruler wishes to talk with you.\"\n \n It wasn't quite \"talk\"; that was a general word in the Tr'en language, and Didyak had used a specific meaning, roughly: \"gain information from, by peaceful and vocal means.\" Korvin filed it away for future reference. \"Why did the Ruler not come to me?\" Korvin asked.\n \n \"The Ruler is the Ruler,\" Didyak said, slightly discomfited. \"You are to go to him. Such is his command.\"\n \n Korvin shrugged, sighed and smoothed back his hair. \"I obey the command of the Ruler,\" he said—another ritual. Everybody obeyed the command of the Ruler. If you didn't, you never had a second chance to try.\n \n But Korvin meant exactly what he'd said. He was going to obey the commands of the Ruler of the Tr'en—and remove the Tr'en threat from the rest of the galaxy forever.\n \n That, after all, was his job.\n \n \n \n The Room of the Ruler was large, square and excessively brown. The walls were dark-brown, the furnishings—a single great chair, several kneeling-benches and a small table near the chair—were light-brown, of some metallic substance, and even the drapes were tan. It was, Korvin decided, much too much of a bad idea, even when the color contrast of the Tr'en themselves were figured in.\n \n The Ruler himself, a Tr'en over seven feet tall and correspondingly broad, sat in the great chair, his four fingers tapping gently on the table near him, staring at Korvin and his guards. The guards stood on either side of their captive, looking as impassive as jade statues, six and a half feet high.\n \n Korvin wasn't attempting to escape. He wasn't pleading with the Ruler. He wasn't defying the Ruler, either. He was just answering questions.\n \n The Tr'en liked to have everything clear. They were a logical race. The Ruler had started with Korvin's race, his name, his sex—if any—and whether or not his appearance were normal for humanity.\n \n Korvin was answering the last question. \"Some men are larger than I am,\" he said, \"and some are smaller.\"\n \n \"Within what limits?\"\n \n Korvin shrugged. \"Some are over eight feet tall,\" he said, \"and others under four feet.\" He used the Tr'en measurement scale, of course; it didn't seem necessary, though, to mention that both extremes of height were at the circus-freak level. \"Then there is a group of humans,\" he went on, \"who are never more than a foot and a half in height, and usually less than that—approximately nine or ten inches. We call these children ,\" he volunteered helpfully.\n \n \"Approximately?\" the Ruler growled. \"We ask for precision here,\" he said. \"We are scientific men. We are exact.\"\n \n Korvin nodded hurriedly. \"Our race is more ... more approximate,\" he said apologetically.\n \n \"Slipshod,\" the Ruler muttered.\n \n \"Undoubtedly,\" Korvin agreed politely. \"I'll try to do the best I can for you.\"\n \n \"You will answer my questions,\" the Ruler said, \"with exactitude.\" He paused, frowning slightly. \"You landed your ship on this planet,\" he went on. \"Why?\"\n \n \"My job required it,\" Korvin said.\n \n \"A clumsy lie,\" the Ruler said. \"The ship crashed; our examinations prove that beyond any doubt.\"\n \n \"True,\" Korvin said.\n \n \"And it is your job to crash your ship?\" the Ruler said. \"Wasteful.\"\n \n Korvin shrugged again. \"What I say is true,\" he announced. \"Do you have tests for such matters?\"\n \n \"We do,\" the Ruler told him. \"We are an exact and a scientific race. A machine for the testing of truth has been adjusted to your physiology. It will be attached to you.\"\n \n Korvin looked around and saw it coming through the door, pushed by two technicians. It was large and squat and metallic, and it had wheels, dials, blinking lights, tubes and wires, and a seat with armrests and straps. It was obviously a form of lie-detector—and Korvin felt himself marveling again at this race. Earth science had nothing to match their enormous command of the physical universe; adapting a hypnopædic language-course to an alien being so quickly had been wonder enough, but adapting the perilously delicate mechanisms that necessarily made up any lie-detector machinery was almost a miracle. The Tr'en, under other circumstances, would have been a valuable addition to the Comity of Nations.\n \n Being what they were, though, they could only be a menace. And Korvin's appreciation of the size of that menace was growing hourly.\n \n He hoped the lie-detector had been adjusted correctly. If it showed him telling an untruth, he wasn't likely to live long, and his job—not to mention the strongest personal inclinations—demanded most strongly that he stay alive.\n \n He swallowed hard. But when the technicians forced him down into the seat, buckled straps around him, attached wires and electrodes and elastic bands to him at appropriate places and tightened some final screws, he made no resistance.\n \n \"We shall test the machine,\" the Ruler said. \"In what room are you?\"\n \n \"In the Room of the Ruler,\" Korvin said equably.\n \n \"Are you standing or sitting?\"\n \n \"I am sitting,\" Korvin said.\n \n \"Are you a chulad ?\" the Ruler asked. A chulad was a small native pet, Korvin knew, something like a greatly magnified deathwatch beetle.\n \n \"I am not,\" he said.\n \n \n \n The Ruler looked to his technicians for a signal, and nodded on receiving it. \"You will tell an untruth now,\" he said. \"Are you standing or sitting?\"\n \n \"I am standing,\" Korvin said.\n \n The technicians gave another signal. The Ruler looked, in his frowning manner, reasonably satisfied. \"The machine,\" he announced, \"has been adjusted satisfactorily to your physiology. The questioning will now continue.\"\n \n Korvin swallowed again. The test hadn't really seemed extensive enough to him. But, after all, the Tr'en knew their business, better than anyone else could know it. They had the technique and the logic and the training.\n \n He hoped they were right.\n \n The Ruler was frowning at him. Korvin did his best to look receptive.\n\"Why did you land your ship on this planet?\" the Ruler said.\n \n \"My job required it,\" Korvin said.\n \n The Ruler nodded. \"Your job is to crash your ship,\" he said. \"It is wasteful but the machines tell me it is true. Very well, then; we shall find out more about your job. Was the crash intentional?\"\n \n Korvin looked sober. \"Yes,\" he said.\n \n The Ruler blinked. \"Very well,\" he said. \"Was your job ended when the ship crashed?\" The Tr'en word, of course, wasn't ended , nor did it mean exactly that. As nearly as Korvin could make out, it meant\n\"disposed of for all time.\"\n \n \"No,\" he said.\n \n \"What else does your job entail?\" the Ruler said.\n \n Korvin decided to throw his first spoke into the wheel. \"Staying alive.\"\n \n The Ruler roared. \"Do not waste time with the obvious!\" he shouted.\n\"Do not try to trick us; we are a logical and scientific race! Answer correctly.\"\n \n \"I have told the truth,\" Korvin said.\n \n \"But it is not—not the truth we want,\" the Ruler said.\n \n Korvin shrugged. \"I replied to your question,\" he said. \"I did not know that there was more than one kind of truth. Surely the truth is the truth, just as the Ruler is the Ruler?\"\n \n \"I—\" The Ruler stopped himself in mid-roar. \"You try to confuse the Ruler,\" he said at last, in an approximation of his usual one. \"But the Ruler will not be confused. We have experts in matters of logic\"—the Tr'en word seemed to mean right-saying —\"who will advise the Ruler. They will be called.\"\n \n Korvin's guards were standing around doing nothing of importance now that their captor was strapped down in the lie-detector. The Ruler gestured and they went out the door in a hurry.\n \n The Ruler looked down at Korvin. \"You will find that you cannot trick us,\" he said. \"You will find that such fiddling\"— chulad-like Korvin translated—\"attempts will get you nowhere.\"\n \n Korvin devoutly hoped so.\n \n \n \n The experts in logic arrived shortly, and in no uncertain terms Korvin was given to understand that logical paradox was not going to confuse anybody on the planet. The barber who did, or didn't, shave himself, the secretary of the club whose members were secretaries, Achilles and the tortoise, and all the other lovely paradox-models scattered around were so much primer material for the Tr'en. \"They can be treated mathematically,\" one of the experts, a small emerald-green being, told Korvin thinly. \"Of course, you would not understand the mathematics. But that is not important. You need only understand that we cannot be confused by such means.\"\n \n \"Good,\" Korvin said.\n \n The experts blinked. \"Good?\" he said.\n \n \"Naturally,\" Korvin said in a friendly tone.\n \n The expert frowned horribly, showing all of his teeth. Korvin did his best not to react. \"Your plan is a failure,\" the expert said, \"and you call this a good thing. You can mean only that your plan is different from the one we are occupied with.\"\n \n \"True,\" Korvin said.\n \n There was a short silence. The expert beamed. He examined the indicators of the lie-detector with great care. \"What is your plan?\" he said at last, in a conspiratorial whisper.\n \n \"To answer your questions, truthfully and logically,\" Korvin said.\n \n The silence this time was even longer.\n \n \"The machine says that you tell the truth,\" the experts said at last, in a awed tone. \"Thus, you must be a traitor to your native planet. You must want us to conquer your planet, and have come here secretly to aid us.\"\n \n Korvin was very glad that wasn't a question. It was, after all, the only logical deduction.\n \n But it happened to be wrong.\n \n \n \n \"The name of your planet is Earth?\" the Ruler asked. A few minutes had passed; the experts were clustered around the single chair. Korvin was still strapped to the machine; a logical race makes use of a traitor, but a logical race does not trust him.\n \n \"Sometimes,\" Korvin said.\n \n \"It has other names?\" the Ruler said.\n \n \"It has no name,\" Korvin said truthfully. The Tr'en idiom was like the Earthly one; and certainly a planet had no name. People attached names to it, that was all. It had none of its own.\n \n \"Yet you call it Earth?\" the Ruler said.\n \n \"I do,\" Korvin said, \"for convenience.\"\n \n \"Do you know its location?\" the Ruler said.\n \n \"Not with exactitude,\" Korvin said.\n \n There was a stir. \"But you can find it again,\" the Ruler said.\n \n \"I can,\" Korvin said.\n \n \"And you will tell us about it?\" the Ruler went on.\n \n \"I will,\" Korvin said, \"so far as I am able.\"\n \n \"We will wish to know about weapons,\" the Ruler said, \"and about plans and fortifications. But we must first know of the manner of decision on this planet. Is your planet joined with others in a government or does it exist alone?\"\n \n Korvin nearly smiled. \"Both,\" he said.\n \n A short silence was broken by one of the attendant experts. \"We have theorized that an underling may be permitted to make some of his own decisions, leaving only the more extensive ones for the master. This seems to us inefficient and liable to error, yet it is a possible system. Is it the system you mean?\"\n \n Very sharp, Korvin told himself grimly. \"It is,\" he said.\n \n \"Then the government which reigns over several planets is supreme,\" the Ruler said.\n \n \"It is,\" Korvin said.\n \n \"Who is it that governs?\" the Ruler said.\n \n The key question had, at last, been asked. Korvin felt grateful that the logical Tr'en had determined to begin from the beginning, instead of going off after details of armament first; it saved a lot of time.\n \n \"The answer to that question,\" Korvin said, \"cannot be given to you.\"\n \n \"Any question of fact has an answer,\" the Ruler snapped. \"A paradox is not involved here; a government exists, and some being is the governor. Perhaps several beings share this task; perhaps machines do the work. But where there is a government, there is a governor. Is this agreed?\"\n \n \"Certainly,\" Korvin said. \"It is completely obvious and true.\"\n \n \"The planet from which you come is part of a system of planets which are governed, you have said,\" the Ruler went on.\n \n \"True,\" Korvin said.\n \n \"Then there is a governor for this system,\" the Ruler said.\n \n \"True,\" Korvin said again.\n \n The ruler sighed gently. \"Explain this governor to us,\" he said.\n \n Korvin shrugged. \"The explanation cannot be given to you.\"\n \n The Ruler turned to a group of his experts and a short muttered conversation took place. At its end the Ruler turned his gaze back to Korvin. \"Is the deficiency in you?\" he said. \"Are you in some way unable to describe this government?\"\n \n \"It can be described,\" Korvin said.\n \n \"Then you will suffer unpleasant consequences if you describe it to us?\" the Ruler went on.\n \n \"I will not,\" Korvin said.\n \n It was the signal for another conference. With some satisfaction, Korvin noticed that the Tr'en were becoming slightly puzzled; they were no longer moving and speaking with calm assurance.\n \n The plan was taking hold.\n \n The Ruler had finished his conference. \"You are attempting again to confuse us,\" he said.\n \n Korvin shook his head earnestly. \"I am attempting,\" he said, \"not to confuse you.\"\n \n \"Then I ask for an answer,\" the Ruler said.\n \n \"I request that I be allowed to ask a question,\" Korvin said.\n \n The Ruler hesitated, then nodded. \"Ask it,\" he said. \"We shall answer it if we see fit to do so.\"\n \n Korvin tried to look grateful. \"Well, then,\" he said, \"what is your government?\"\n \n The Ruler beckoned to a heavy-set green being, who stepped forward from a knot of Tr'en, inclined his head in Korvin's direction, and began. \"Our government is the only logical form of government,\" he said in a high, sweet tenor. \"The Ruler orders all, and his subjects obey. In this way uniformity is gained, and this uniformity aids in the speed of possible action and in the weight of action. All Tr'en act instantly in the same manner. The Ruler is adopted by the previous Ruler; in this way we are assured of a common wisdom and a steady judgment.\"\n \n \"You have heard our government defined,\" the Ruler said. \"Now, you will define yours for us.\"\n \n Korvin shook his head. \"If you insist,\" he said, \"I'll try it. But you won't understand it.\"\n \n The Ruler frowned. \"We shall understand,\" he said. \"Begin. Who governs you?\"\n \n \"None,\" Korvin said.\n \n \"But you are governed?\"\n \n Korvin nodded. \"Yes.\"\n \n \"Then there is a governor,\" the Ruler insisted.\n \n \"True,\" Korvin said. \"But everyone is the governor.\"\n \n \"Then there is no government,\" the Ruler said. \"There is no single decision.\"\n \n \"No,\" Korvin said equably, \"there are many decisions binding on all.\"\n \n \"Who makes them binding?\" the Ruler asked. \"Who forces you to accept these decisions? Some of them must be unfavorable to some beings?\"\n \n \"Many of them are unfavorable,\" Korvin said. \"But we are not forced to accept them.\"\n \n \"Do you act against your own interests?\"\n \n Korvin shrugged. \"Not knowingly,\" he said. The Ruler flashed a look at the technicians handling the lie-detector. Korvin turned to see their expression. They needed no words; the lie-detector was telling them, perfectly obviously, that he was speaking the truth. But the truth wasn't making any sense. \"I told you you wouldn't understand it,\" he said.\n \n \"It is a defect in your explanation,\" the Ruler almost snarled.\n \n \"My explanation is as exact as it can be,\" he said.\n \n The Ruler breathed gustily. \"Let us try something else,\" he said.\n\"Everyone is the governor. Do you share a single mind? A racial mind has been theorized, though we have met with no examples—\"\n \n \"Neither have we,\" Korvin said. \"We are all individuals, like yourselves.\"\n \n \"But with no single ruler to form policy, to make decisions—\"\n \n \"We have no need of one,\" Korvin said calmly.\n \n \"Ah,\" the Ruler said suddenly, as if he saw daylight ahead. \"And why not?\"\n \n \"We call our form of government democracy ,\" Korvin said. \"It means the rule of the people. There is no need for another ruler.\"\n \n One of the experts piped up suddenly. \"The beings themselves rule each other?\" he said. \"This is clearly impossible; for, no one being can have the force to compel acceptance of his commands. Without his force, there can be no effective rule.\"\n \n \"That is our form of government,\" Korvin said.\n \n \"You are lying,\" the expert said.\n \n One of the technicians chimed in: \"The machine tells us—\"\n \n \"Then the machine is faulty,\" the expert said. \"It will be corrected.\"\n \n Korvin wondered, as the technicians argued, how long they'd take studying the machine, before they realized it didn't have any defects to correct. He hoped it wasn't going to be too long; he could foresee another stretch of boredom coming. And, besides, he was getting homesick.\n \n It took three days—but boredom never really had a chance to set in. Korvin found himself the object of more attention than he had hoped for; one by one, the experts came to his cell, each with a different method of resolving the obvious contradictions in his statements.\n \n Some of them went away fuming. Others simply went away, puzzled.\n \n On the third day Korvin escaped.\n \n It wasn't very difficult; he hadn't thought it would be. Even the most logical of thinking beings has a subconscious as well as a conscious mind, and one of the ways of dealing with an insoluble problem is to make the problem disappear. There were only two ways of doing that, and killing the problem's main focus was a little more complicated. That couldn't be done by the subconscious mind; the conscious had to intervene somewhere. And it couldn't.\n \n Because that would mean recognizing, fully and consciously, that the problem was insoluble. And the Tr'en weren't capable of that sort of thinking.\n \n Korvin thanked his lucky stars that their genius had been restricted to the physical and mathematical. Any insight at all into the mental sciences would have given them the key to his existence, and his entire plan, within seconds.\n \n But, then, it was lack of that insight that had called for this particular plan. That, and the political structure of the Tr'en.\n \n The same lack of insight let the Tr'en subconscious work on his escape without any annoying distractions in the way of deep reflection. Someone left a door unlocked and a weapon nearby—all quite intent, Korvin was sure. Getting to the ship was a little more complicated, but presented no new problems; he was airborne, and then space-borne, inside of a few hours after leaving the cell.\n \n He set his course, relaxed, and cleared his mind. He had no psionic talents, but the men at Earth Central did; he couldn't receive messages, but he could send them. He sent one now.\n  Mission accomplished; the Tr'en aren't about to come marauding out into space too soon. They've been given food for thought—nice indigestible food that's going to stick in their craws until they finally manage to digest it. But they can't digest it and stay what they are; you've got to be democratic, to some extent, to understand the idea. What keeps us obeying laws we ourselves make? What keeps us obeying laws that make things inconvenient for us? Sheer self-interest, of course—but try to make a Tr'en see it!\n \n  With one government and one language, they just weren't equipped for translation. They were too efficient physically to try for the mental sciences at all. No mental sciences, no insight into my mind or their own—and that means no translation.\n \n  But—damn it—I wish I were home already.\n \n  I'm bored absolutely stiff!\n \n\n THE END",
      "metadata": {
        "title": "Lost in Translation",
        "author": "Larry M. Harris",
        "passage_id": "30029",
        "uid": "beb60ac6e67048dc9cb458afe7c16166",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "8",
                "uid": "88b4e190c150413cb74b0321488233f5",
                "response_text": "Korvin sits in a cell after crash-landing on the planet of the Tr'en, which is populated by an extremely logical and intelligent humanoid race. Due to the speed of their scientific and technological advancements, the Comity of Planets will soon extend them an invitation, but Korvin believes they will not accept their offer. As a representative of Earth Central, he has been sent to Tr'en in order to find a way to prevent its people from marauding and settling other planets. In the days since Korvin's crash, the prison guards provide him with food and teach him the local language through drug hypnosis. He describes the language as \"stiff and slightly awkward\" but acknowledges its logical, meticulous construction. After several days imprisoned, a Tr'en named Didyak visits Korvin and informs him that he will be brought to The Ruler. When Korvin meets The Ruler--a massive, formidable Tr'en--he answers his questions to the best of his ability with respect to the logical constructions of the language. Korvin describes the physical appearance of adult humans as well as children, and The Ruler appears confused by the variations in height. The Ruler keeps emphasizing the importance of speaking with exactitude when communicating with the Tr'en. When Korvin claims his purpose on the planet was to crash-land his ship, The Ruler scoffs and orders him connected to a lie-detector machine for the duration of the questioning. After adjusting the lie-detector machine to Korvin's physiology, The Ruler continues his interrogation of Korvin, attempting to determine the true purpose of his mission on Tr'en. Adopting the Tr'en mode of providing extremely logical answers, Korvin claims his mission is to \"stay alive\", which frustrates The Ruler; he claims Korvin is trying to confuse him, so he calls upon his experts to help determine if the machine is faulty and analyze Korvin's responses. As the Tr'en broach the subject of Earth, they start to ask questions about its name, location, and finally, governance. Because the Tr'en receive and obey orders from one Ruler, they are completely perplexed by the concept of democracy where conflicting interests may contribute to a system of self-governance. In fact, they are so stumped by Korvin's responses that they continue this line of questioning for three days and are unsatisfied by what they consider to be his illogical, but truthful answers. On the third day, Korvin takes advantage of their lack of mental insight to escape prison and sends a message back to Earth Central informing them that he has accomplished his mission because the Tr'en will never be able to solve the problem of democracy."
              },
              {
                "worker_id": "3",
                "uid": "5ef717459ff047bea884022f8d72eb2f",
                "response_text": "Korvin, a human, had been siting isolated in a jail cell for three days on the Tr'en planet when Didyak, a member of the Tr'en, entered his cell. The Tr'en are somewhat humanoid, greenish beings, and Didyak was tall. Korvin had learned some of the Tr'en language under drug hypnosis but was frustrated with how literally Didyak took everything, so it took some time to determine that The Ruler had summoned Korvin for a conversation. This was what he wanted, though: Korvin had been sent to eliminate the threat the the Tr'en posed to the Comity of Planets and the rest of the galaxy because of how quickly their technology was developing. When he got to the Room of the Ruler, Korvin met The Ruler who was over seven feet tall, which was tall even for the Tr'en. The Ruler started with questions about how typical of a human Korvin was, and Korvin found himself apologizing for his race's inclination towards approximation over precision. They don't believe Korvin when he says that his job required he be on this planet, and the Tr'en brought out a lie detector that they built. Korvin was worried about the calibration of the machine, because he knew one misstep would mean death. After the machine was calibrated, the questioning continued, and the Tr'en had to accept that Korvin crashed his ship on purpose. Korvin's truth was not the truth that the Tr'en wanted, which Korvin used against the logic-led race. Experts in logic were called into the room, and Korvin quickly learned that logical paradoxes would not trick the Tr'en. He gave them just enough information for them to logically conclude, incorrectly, that Korvin was there to get help invading Earth. They discussed their respective forms of government, and when The Ruler asked who is in charge on Earth, Korvin refused to give away that information. This causes frustration, and the seed of confusion had been planted. Korvin asked them about their government, which has one being ruling everyone else. Korvin tried to explain that there is no one governor, and that everyone governs, which made no sense to the Tr'en. They did not understand how there was not a single ruler to make decisions; democracy seemed impossible to them. One of the experts insisted that Korvin was lying and that something must be wrong with the machine; they took a three-day break from questioning to investigate the issue only to conclude that nothing was wrong. On this third day, Korvin escaped. He knew the Tr'en couldn't conclude that it was an impossible problem, so their subconsciouses would prepare Korvin for an escape so that their conscious selves wouldn't have to admit that they did not have the answer. The story ends with Korvin heading back to Earth, sending a report back that the Tr'en would have to change their social structure to get the insight to answer the questions he left them with, meaning they were no longer a threat."
              },
              {
                "worker_id": "12",
                "uid": "a4f8f51169604ba48ae23fdbbdb7815a",
                "response_text": "Korvin, a visitor from Earth, is held captive on a planet run by a race called the Tr'en. The Tr'en rely on logic and exact measurements to design their systems of governance, but Korvin's homeworld does not do quite the same. When the ruler of this world begins to question Korvin, they doubt he is telling the truth when he talks about how he crashed his ship on their planet on purpose. They wheel out a lie detector in order to tell if Korvin is telling the truth. The lie detector affirms his answers, but when Korvin starts to speak about his home world's politics, it is too much for the Tr'en to stand and one of his guards sets him free because they cannot cope with what they perceive as logical fallacies in the governance of Korvin's homeworld."
              },
              {
                "worker_id": "2",
                "uid": "c4f14d952f3748998f686c77e3504231",
                "response_text": "Korvin is a man from Earth who has landed on the planet of the Tr’en. At the beginning of the story, he has been imprisoned in a jail cell and isolated for three days, causing him great boredom. Every night, he is hypnotized so his guards can teach him the Tr’en language. Korvin has learned that the Tr’en are literalists. After three days, a Tr’en named Didyak comes to Korvin’s cell and tells him the Ruler wants to speak with him. Korvin follows the rituals of the Tr’en language and social norms, agreeing to see the Ruler. After all, Korvin’s purpose is to remove the Tr’en threat.\n\tThe Ruler asks Korvin several questions about his race, name, and sex and if his appearance is typical for a human. When Korvin offers a wide range of heights for humans, including “approximately nine or ten inches,” referring to children, the Ruler snaps at him that they ask for precision because the Tr’en are scientific men. \n\tAs the Ruler asks him questions, Korvin answers truthfully but in ways that will not translate literally, thus confusing the Ruler. He has his people bring in a truth detector machine and hook it up to Korvin, testing it with a set of questions to which Korvin answers truthfully and ordering him to answer one untruthfully. These responses lead the Ruler to accept that the machine is calibrated accurately. The Ruler then returns to questioning Korvin, asking if he intentionally crashed his ship on their planet and what else his job entails after landing. Korvin says his job also involves staying alive, and the Ruler retorts that that is not the truth they want. \n\tKorvin has discerned that the Tr’en are brilliant with math and physical science but know nothing about how the mind works. The Ruler calls in his experts for advice who explain to Korvin that they will not be confused by logical paradox. They tell Korvin his plan to confuse them is a failure, and Korvin says that is good. The experts conclude that Korvin must be a traitor to Earth and must want them to conquer it. When the Ruler asks Korvin an either/or question, Korvin answers, “Both,” remaining intentionally ambiguous. When the Ruler asks about the government on Earth, Korvin answers that he cannot give him the explanation, but when he is pressed, Korvin pretends to try to be helpful, all the while, following through with his plan to confuse the Tr’en by describing a democracy with everyone as the governor and no single ruler.\n\tAfter the experts decide their machine must be faulty, they put Korvin back in his cell but continue questioning him. He escapes after someone leaves a door unlocked and a weapon nearby. As he leaves the planet, he sends a message ahead that the Tr’en are worrying over the meaning of democracy and will not be a threat because they will be so focused on the conundrum that they can’t understand. \n"
              }
            ]
          },
          {
            "question_text": "Who is the Ruler and what is his role in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "8",
                "uid": "88b4e190c150413cb74b0321488233f5",
                "response_text": "The Ruler is the sole governor of the Tr'en race. Characterized by their humanoid appearance, Tr'en are tall, greenish, and have four fingers. The Ruler himself is taller than most at seven-feet tall and is quite broad. The Tr'en are very logical and speak in a language almost mathematical in its clarity and precision. The Ruler epitomizes Tr'en commitment to logical inquiry. At first, The Ruler grills Korvin on his name, his race, his sex, and whether or not his appearance is normal for humanity. When Korvin's response regarding the variations in height amongst human adults and children, The Ruler is confounded. He also disbelieves Korvin's response regarding his purpose on Tr'en. Because of this, The Ruler orders Korvin to be hooked up to a lie detector. After adjusting the detector to Korvin's physiology, Korvin launches into a line of questioning regarding planet Earth, specifically the governance of it. When the experts monitoring the lie detector's reactions to Korvin's answers become baffled by his truth-telling in the face of seemingly illogical answers, The Ruler seemingly throws in the towel and lets the experts investigate the idea that Korvin is either lying or the machine is broken. In reality, Korvin has exploited a flaw in their logic--although they are masters of science, they have not mastered mental science. Only a grasp of mental science would allow the Tr'en to fathom humankind's embrace of democracy."
              },
              {
                "worker_id": "3",
                "uid": "5ef717459ff047bea884022f8d72eb2f",
                "response_text": "The Ruler is the head of the Tr'en government, and is a greenish humanoid who stands over seven feet tall. He makes all of the decisions for the race, and was appointed by the prior Ruler, which he feels is an important aspect of the consistency of the Tr'en leadership. The Ruler is the one who leads the interrogation of Korvin three days after his initial capture, and calls in the logic experts and the lie detector machine when he finds he needs assistance to understand what information Korvin is giving them. He is important to Korvin's plan: his goal after being captured is to talk to The Ruler, to plant some confusion in his head along with the logic experts. Korvin thinks that describing democracy to a society that is so single-authority oriented will force them to restructure their government if they want to try to understand the truths that Korvin presents them about Earth and related governments. "
              },
              {
                "worker_id": "12",
                "uid": "a4f8f51169604ba48ae23fdbbdb7815a",
                "response_text": "The Ruler is the ruler of this planet. Anything the Ruler commands is done, without question. The Tr'en people rely on this type of governance as no other form of governance makes much sense to them. Someone must be in charge of shaping and then enforcing the rules. That is the Ruler's role, and in this story, he is taxed with questioning the prisoner Korvin in order to get to the bottom of his purpose for being on their planet. "
              },
              {
                "worker_id": "2",
                "uid": "c4f14d952f3748998f686c77e3504231",
                "response_text": "The Ruler is the autocratic leader of the Tr’en. He is a large creature, more than seven feet tall and with a broad build. He has been trained by the previous Ruler, who was trained by the Ruler before him, and so on for past generations, ensuring that the society and its values do not change. The Ruler questions Korvin, trying to determine Korvin’s ulterior motive for crash-landing his ship on the planet. Captives in his presence are closely guarded. The Ruler demands precision and exactitude in answers from Korvin, and when Korvin’s responses are more figurative than literal, he sends for their truth-detector. As Korvin’s answers remain intriguingly vague, which the Ruler cannot understand, he accuses Korvin of not telling the truth that he wants. He calls his experts for their advice, and they also question Korvin. The Ruler and his experts cannot understand Korvin’s explanation of the government on Earth because his statements contradict their assumptions, especially about government. After a frustrating interrogation, the Ruler sends Korvin away but allows his experts to continue to question him in an attempt to understand what he says."
              }
            ]
          },
          {
            "question_text": "What is the significance of translation in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "8",
                "uid": "88b4e190c150413cb74b0321488233f5",
                "response_text": "After Korvin crash-lands on Tr’en, he is captured and imprisoned for several days before he wakes up. During that time, the prison guards teach him the Tr’en language via hypnopædic language instruction. He learns the language is closer to mathematical metalanguage and is centered in logic and clarity. As a result, Korvin has to adjust the way he speaks in order to make sure to convey what he really means in his conversations with Didyak and when he responds to The Ruler's line of questioning. Because the Tr'en language requires perfect logic, Korvin's answers to The Ruler's questions confuse The Ruler and his group of experts that examine the lie detector and confer to determine if Korvin is telling the truth or beating the system somehow. Translation ultimately saves Korvin since the Tr'en are unable to logically process the concept of democracy, and they will spend an endless amount of time trying to solve that problem instead of advancing to the point where they will maraud and settle others in the Comity of Planets."
              },
              {
                "worker_id": "3",
                "uid": "5ef717459ff047bea884022f8d72eb2f",
                "response_text": "Translation is at the core of the story because Korvin has to rely on the logical nature of the Tr'en language to try to throw the Tr'en people off. Because of the lived experiences of the Tr'en people, with their specific government style, and their literal approach to communication, Korvin is able to give them enough information about why he is there to be telling the truth without giving away his true motives. He hopes that this will spur them to try democracy in an attempt to understand the nature of the government on Earth, which will break their current habits and hopefully slow down their technological progress. It is the way that the groups of people must translate as they communicate that allows Korvin to confuse the masters of logic in the end. "
              },
              {
                "worker_id": "12",
                "uid": "a4f8f51169604ba48ae23fdbbdb7815a",
                "response_text": "The Tr'en language has words that have more exact meanings than words in the English language. As a result, the true intent of the speaker is better conveyed. Korvin learns the Tr'en language while he is their captive, and he picks up on the nuance so well that he can understand the exact meaning and intent of the Tr'en when they speak to them, and thus use this to his advantage. Korvin can mask his own intent since his own language, the language of Earth, is less literal and capable of more complexity."
              },
              {
                "worker_id": "2",
                "uid": "c4f14d952f3748998f686c77e3504231",
                "response_text": "   The Tr’en society is based on straightforward communication and literal interpretation of every spoken word. This is presumably why they teach Korvin their language, enabling him to communicate with them directly without an interpreter. However, the Tr’ens’ exclusive focus on math and the physical sciences creates a significant weakness that Korvin exploits: they have no understanding of their own or others’ mental capacity and nuances of language and, therefore, no ability to interpret anything they consider illogical. When Didyak uses the word “talk” that means to “gain information from, by peaceful and vocal means,” Korvin realizes that he will be able to save himself and his mission by communicating with the Tr’ens in a way that literally answers their questions without giving away his true mission of stopping the Tr’en’s advancement into the galaxy. \n     When the Ruler tries to find out Korvin’s purpose for intentionally crashing his ship and if he has other intentions, Korvin’s responses are forthright in a literal sense: yes, he crashed his ship on purpose, no his job isn’t ended, now his job is to stay alive.       \n     Completely flummoxed, the Ruler calls in his experts in logic to question Korvin further, and based on his answers, they logically conclude that he is a traitor to Earth and is there to help the Tr’ens overthrow Earth. Korvin also confuses the Tr’ens with his explanation of Earth’s democracy. Their frustration ends the hearing before the Ruler, but the experts continue to question Korvin in his cell. \n     It becomes clear to the experts that their lie-detecting machine is not faulty, but they cannot understand Korvin’s explanations. So on the third day after being called to the Ruler, Korvin finds an unlocked door and a weapon, enabling him to escape and thus solving their insolvable problem. Korvin knows that the Tr’en will be obsessed with trying to understand the democratic ideas that he described and that they will never be able to understand them without changing themselves. They are incapable of translating his responses in the context of their very literal society.\n"
              }
            ]
          },
          {
            "question_text": "Who is Didyak and what is his role in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "8",
                "uid": "88b4e190c150413cb74b0321488233f5",
                "response_text": "Didyak is a Tr'en from the planet Tr'en, and he is tall, slightly green, vaguely humanoid, and has cat-like pupils. Didyak is the first Tr'en that Korvin encounters after waking up in the days following his crash. Having been educated in the Tr'en language through hypnosis, Korvin is able to communicate with Didyak, and he does so, making sure to address with the utmost respect according to Tr'en customs. Didyak carries a small weapon that is translucent and looks like a pistol; he also carries a small knife attached to his belt. Didyak's speech is stiff and slightly awkward, much like the rest of the Tr'en, and he speaks with very careful attention paid to the construction of each sentence in order to express perfect logic. Like the other Tr'en, Didyak also has fifty-eight pointy teeth, at which Korvin tries not to stare. The Ruler has sent Didyak to bring Korvin for an audience with him so that he may learn more about Earth."
              },
              {
                "worker_id": "3",
                "uid": "5ef717459ff047bea884022f8d72eb2f",
                "response_text": "Didyak is the member of the Tr'en race who came to retrieve Korvin from his cell when The Ruler summoned Korvin for questioning. Didyak is the first Tr'en who Korvin had a conversation with after having learned the Tr'en language under drug hypnosis, which gave him practice in the customs of conversation and the logical, literal nature of the Tr'en discourse. Didyak is also the first experience the reader has with this language, and learns more about the knowledge Korvin comes into his mission with through this exchange."
              },
              {
                "worker_id": "12",
                "uid": "a4f8f51169604ba48ae23fdbbdb7815a",
                "response_text": "Didyak is the Tr'en who arrives at Korvin's cell in order to take him to the Ruler. Didyak is the first being with which Korvin has had any interaction in a long time, so Korvin is happy to talk with Didyak and to work on using the correct Tr'en words to convey his exact meaning. Didyak answers Korvin's questions in a very literal sense, which is customary among the Tr'en people. Didyak explains that he must take Korvin to the Ruler and that the Ruler is going to question him in a way that is meant to gather information."
              },
              {
                "worker_id": "2",
                "uid": "c4f14d952f3748998f686c77e3504231",
                "response_text": "Didyak is a tall, green Tr’en who, like all Tr’en, looks somewhat humanoid. He comes to Korvin’s cell after Korvin has been held in solitary confinement for three days. His initial conversation with Korvin follows the Tr’en ritual in which Didyak says who Korvin is and Korvin says who Didyak is (“of the Tr’en”). Didyak seems to be a guard because he has access to Korvin and enters his cell; he also carries a small translucent pistol-like weapon along with a knife in a sheath. After introducing each other, Didyak waits for Korvin to speak, and when he does, he asks what Didyak wants with him; Didyak answers that he wants nothing with Korvin. This response reminds Korvin of what he has learned of the Tr’en; they are extremely literal, more inclined to mathematical and scientific thinking. And when Korvin asks what Didyak is doing there, he again answers literally, stating that he is leaning against the door. When Korvin finally asks a specific question that can only be answered literally, Didyak beams at him as if he is pleased that Korvin finally understands what he needs to say. Didyak tells him that he has been ordered to take Korvin to the Ruler, who wants to talk with him. Didyak escorts Korvin to the Ruler, but his interaction with Korvin has proven a stark reminder of how the Tr’ens think and that Korvin needs to be mindful of how he speaks to them. The interaction with Didyak also gives Korvin his plan for how he will thwart the Tr’ens’ anticipated expansion to other planets.\n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "8",
                "uid": "88b4e190c150413cb74b0321488233f5",
                "response_text": "Korvin works for Earth Central and flies to the planet Tr'en on its behalf. Tr'en is a planet populated by the Tr'en race, a tall humanoid people with greenish skin, fifty-eight pointy teeth, and a unique language centered on the idea of logic. They are an extremely advanced race in terms of science and technology and others in the Comity of Planets consider them a possible threat seeing as they are in the atomic era and are on the brink of developing space travel. After Korvin crash-lands on Tr'en he sits in a prison cell noted for its smelly air, and, more importantly, its efficiency of design. Besides the Tr'en, the only known living creature on Tr'en is the chulad, a small creature that looks like a large deathwatch beetle. The Room of the Ruler is large and square, and everything inside the room is brown including the walls, furniture, and drapes. In terms of furniture, Korvin observes a large chair where The Ruler sits, many kneeling benches, and a small table near the chair. When two technicians bring in a lie detector test for Korvin, he notices that it is large, squat, and metallic and has wheels, dials, blinking lights, tubes, wires, and a seat with armrests and straps. The technicians use these straps to tie Korvin into the machine."
              },
              {
                "worker_id": "3",
                "uid": "5ef717459ff047bea884022f8d72eb2f",
                "response_text": "This story takes place on a planet occupied by the Tr'en, a race of tall greenish humanoid-like aliens. This race is known for their extremely efficient technological development, which is attributed at least in part to their government structure. To humans, the air on the planet is a little bit smelly, and they don't expect the Tr'en to have large cultural institutions and interesting works of art because they are led by logic and mathematics alone--they even communicate very literally, talking their way through logic puzzles. There are two rooms that house most of the story: the lone jail cell that Korvin is kept in for six days in total, and the Room of the Ruler where the questioning happens. The jail cell was built very quickly once Korvin was captured, and there are no other prisoners in the jail, so it is a lonely and quiet place for Korvin to sit in, with nothing to occupy him but his own thoughts. There is one bed for him to lie on but nothing else of interest. His only interaction with others is the nightly lessons in the Tr'en language that are done under drug hypnosis. He is escorted out of this solitary confinement to meet The Ruler, whose chambers are a large room with brown and tan everywhere. The walls were dark brown, many of the furnishings were light brown, and the drapes on the windows were tan. Although the brown contrasted nicely with the green skin of the Tr'en, Korvin still found there to be far too much brown in the room. There was a great big chair in the middle for The Ruler to sit in, surrounded by benches for others to kneel at. Eventually, a lie detector chair is brought into the room as well. The story ends with Korvin making it back to his spaceship, but the author does not give us many details about this part of the setting. "
              },
              {
                "worker_id": "12",
                "uid": "a4f8f51169604ba48ae23fdbbdb7815a",
                "response_text": "The story takes place on a planet that is ruled by a people called the Tr'en. The planet is not as far along in its evolution as Korvin's planet, and Korvin makes a point of this several times in his observations about their lack of experience with other races and in their absence from the Comity of Planets, a governing body that oversees many different planets. The Tr'en are efficient, so all the structures built on the planet are built without flaw. There also isn't anything very exciting to do recreationally on the planet. The planet and its people are largely defined by the very logical and literal nature of the Tr'en."
              },
              {
                "worker_id": "2",
                "uid": "c4f14d952f3748998f686c77e3504231",
                "response_text": "\n\tThe story takes place on the planet occupied by the Tr’en, an oxygen-breathing humanoid species whose members tend to be quite tall and various shades of green. The Tr’en are known to be an especially efficient lot who are mathematically and scientifically minded, and therefore literally minded as well. Word has reached Earth that the Tr’en are making progress in their atomic era and are almost capable of space travel, which means they will soon settle other planets and travel to nearby stars. It is also suspected they will soon be capable of traveling faster than light, which will earn them an invitation to join the Comity of Planets and which they are sure to reject. The Tr’en have a justice system in place; they have jail cells and the advanced technology that enabled them to build a truth detector device. The planet is ruled by an autocrat referred to as the Ruler; everyone obeys him because they know there are no second chances. This form of government ensures uniformity, enabling rapid, consistent responses from everyone. Everything is constant, as each successive Ruler is adopted by the current Ruler, guaranteeing the same wisdom and judgment exist under each leader.\n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4168,
        "document_length_chars": 24660
      }
    }
  ]
}