{
  "item_metadata": {
    "item_id": "30062",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "30062",
      "content": "THE PLAGUE\n \n\n By TEDDY KELLER\n \n \n  Suppose a strictly one hundred per cent American plague showed up.... One that attacked only people within the political borders of the United States!\n \n\n Illustrated by Schoenherr\n \n\n \n Sergeant Major Andrew McCloud ignored the jangling telephones and the excited jabber of a room full of brass, and lit a cigarette. Somebody had to keep his head in this mess. Everybody was about to flip.\n \n Like the telephone. Two days ago Corporal Bettijean Baker had been answering the rare call on the single line—in that friendly, husky voice that gave even generals pause—by saying, \"Good morning. Office of the Civil Health and Germ Warfare Protection Co-ordinator.\" Now there was a switchboard out in the hall with a web of lines running to a dozen girls at a half dozen desks wedged into the outer office. And now the harried girls answered with a hasty, \"Germ War Protection.\"\n \n All the brass hats in Washington had suddenly discovered this office deep in the recesses of the Pentagon. And none of them could quite comprehend what had happened. The situation might have been funny, or at least pathetic, if it hadn't been so desperate. Even so, Andy McCloud's nerves and patience had frayed thin.\n \n \"I told you, general,\" he snapped to the flustered brigadier, \"Colonel Patterson was retired ten days ago. I don't know what happened. Maybe this replacement sawbones got strangled in red tape. Anyhow, the brand-new lieutenant hasn't showed up here. As far as I know, I'm in charge.\"\n \n \"But this is incredible,\" a two-star general wailed. \"A mysterious epidemic is sweeping the country, possibly an insidious germ attack timed to precede an all-out invasion, and a noncom is sitting on top of the whole powder keg.\"\n \n Andy's big hands clenched into fists and he had to wait a moment before he could speak safely. Doggone the freckles and the unruly mop of hair that give him such a boyish look. \"May I remind you, general,\" he said, \"that I've been entombed here for two years. My staff and I know what to do. If you'll give us some co-operation and a priority, we'll try to figure this thing out.\"\n \n \"But good heavens,\" a chicken colonel moaned, \"this is all so irregular. A noncom!\" He said it like a dirty word.\n \n \"Irregular, hell,\" the brigadier snorted, the message getting through.\n\"There're ways. Gentlemen, I suggest we clear out of here and let the sergeant get to work.\" He took a step toward the door, and the other officers, protesting and complaining, moved along after him. As they drifted out, he turned and said, \"We'll clear your office for top priority.\" Then dead serious, he added, \"Son, a whole nation could panic at any moment. You've got to come through.\"\n \n Andy didn't waste time standing. He merely nodded to the general, snubbed out his cigarette, and buzzed the intercom. \"Bettijean, will you bring me all the latest reports, please?\" Then he peeled out of his be-ribboned blouse and rolled up his sleeves. He allowed himself one moment to enjoy the sight of the slim, black-headed corporal who entered his office.\n \n \n \n Bettijean crossed briskly to his desk. She gave him a motherly smile as she put down a thick sheaf of papers. \"You look beat,\" she said.\n\"Brass give you much trouble?\"\n \n \"Not much. We're top priority now.\" He ran fingers through the thick, brown hair and massaged his scalp, trying to generate stimulation to his wary and confused brain. \"What's new?\"\n \n \"I've gone though some of these,\" she said. \"Tried to save you a little time.\"\n \n \"Thanks. Sit down.\"\n \n She pulled up a chair and thumbed through the papers. \"So far, no fatalities. That's why there's no panic yet, I guess. But it's spreading like ... well, like a plague.\" Fear flickered deep in her dark eyes.\n \n \"Any water reports?\" Andy asked.\n \n \"Wichita O.K., Indianapolis O.K., Tulsa O.K., Buffalo O.K.,—and a bunch more. No indication there. Except\"—she fished out a one-page report—\"some little town in Tennessee. Yesterday there was a campaign for everybody to write their congressman about some deal and today they were to vote on a new water system. Hardly anybody showed up at the polls. They've all got it.\"\n \n Andy shrugged. \"You can drink water, but don't vote for it. Oh, that's a big help.\" He rummaged through the clutter on his desk and came up with a crude chart. \"Any trends yet?\"\n \n \"It's hitting everybody,\" Bettijean said helplessly. \"Not many kids so far, thank heavens. But housewives, businessmen, office workers, teachers, preachers—rich, poor—from Florida to Alaska. Just when you called me in, one of the girls thought she had a trend. The isolated mountain areas of the West and South. But reports are too fragmentary.\"\n \n \"What is it?\" he cried suddenly, banging the desk. \"People deathly ill, but nobody dying. And doctors can't identify the poison until they have a fatality for an autopsy. People stricken in every part of the country, but the water systems are pure. How does it spread?\"\n \n \"In food?\"\n \n \"How? There must be hundreds of canneries and dairies and packing plants over the country. How could they all goof at the same time—even if it was sabotage?\"\n \n \"On the wind?\"\n \n \"But who could accurately predict every wind over the entire country—even Alaska and Hawaii—without hitting Canada or Mexico? And why wouldn't everybody get it in a given area?\"\n \n Bettijean's smooth brow furrowed and she reached across the desk to grip his icy, sweating hands. \"Andy, do ... do you think it's ... well, an enemy?\"\n \n \"I don't know,\" he said. \"I just don't know.\"\n \n For a long moment he sat there, trying to draw strength from her, punishing his brain for the glimmer of an idea. Finally, shaking his head, he pushed back into his chair and reached for the sheaf of papers.\n \n \"We've got to find a clue—a trend—an inkling of something.\" He nodded toward the outer office. \"Stop all in-coming calls. Get those girls on lines to hospitals in every city and town in the country. Have them contact individual doctors in rural areas. Then line up another relief crew, and get somebody carting in more coffee and sandwiches. And on those calls, be sure we learn the sex, age, and occupation of the victims. You and I'll start with Washington.\"\n \n Bettijean snapped to her feet, grinned her encouragement and strode from the room. Andy could hear her crisp instructions to the girls on the phones. Sucking air through his teeth, he reached for his phone and directory.\n \n He dialed until every finger of his right hand was sore. He spoke to worried doctors and frantic hospital administrators and hysterical nurses. His firm, fine penmanship deteriorated to a barely legible scrawl as writer's cramp knotted his hand and arm. His voice burned down to a rasping whisper. But columns climbed up his rough chart and broken lines pointed vaguely to trends.\n \n \n \n It was hours later when Bettijean came back into the office with another stack of papers. Andy hung up his phone and reached for a cigarette. At that moment the door banged open. Nerves raw, Bettijean cried out. Andy's cigarette tumbled from his trembling fingers.\n \n \"Sergeant,\" the chicken colonel barked, parading into the office.\n \n Andy swore under his breath and eyed the two young officers who trailed after the colonel. Emotionally exhausted, he had to clamp his jaw against a huge laugh that struggled up in his throat. For just an instant there, the colonel had reminded him of a movie version of General Rommel strutting up and down before his tanks. But it wasn't a swagger stick the colonel had tucked under his arm. It was a folded newspaper. Opening it, the colonel flung it down on Andy's desk.\n \n \"RED PLAGUE SWEEPS NATION,\" the scare headline screamed. Andy's first glance caught such phrases as \"alleged Russian plot\" and \"germ warfare\" and \"authorities hopelessly baffled.\"\n \n Snatching the paper, Andy balled it and hurled it from him. \"That'll help a lot,\" he growled hoarsely.\n \n \"Well, then, Sergeant.\" The colonel tried to relax his square face, but tension rode every weathered wrinkle and fear glinted behind the pale gray eyes. \"So you finally recognize the gravity of the situation.\"\n \n Andy's head snapped up, heated words searing towards his lips. Bettijean stepped quickly around the desk and laid a steady hand on his shoulder.\n \n \"Colonel,\" she said levelly, \"you should know better than that.\"\n \n A shocked young captain exploded, \"Corporal. Maybe you'd better report to—\"\n \n \"All right,\" Andy said sharply.\n \n For a long moment he stared at his clenched fists. Then he exhaled slowly and, to the colonel, flatly and without apology, he said,\n\"You'll have to excuse the people in this office if they overlook some of the G.I. niceties. We've been without sleep for two days, we're surviving on sandwiches and coffee, and we're fighting a war here that makes every other one look like a Sunday School picnic.\" He felt Bettijean's hand tighten reassuringly on his shoulder and he gave her a tired smile. Then he hunched forward and picked up a report. \"So say what you came here to say and let us get back to work.\"\n \n \"Sergeant,\" the captain said, as if reading from a manual,\n\"insubordination cannot be tolerated, even under emergency conditions. Your conduct here will be noted and—\"\n \n \"Oh, good heavens!\" Bettijean cried, her fingers biting into Andy's shoulder. \"Do you have to come in here trying to throw your weight around when this man—\"\n \n \"That's enough,\" the colonel snapped. \"I had hoped that you two would co-operate, but....\" He let the sentence trail off as he swelled up a bit with his own importance. \"I have turned Washington upside down to get these two officers from the surgeon general's office. Sergeant. Corporal. You are relieved of your duties as of this moment. You will report to my office at once for suitable disciplinary action.\"\n \n Bettijean sucked in a strained breath and her hand flew to her mouth.\n\"But you can't—\"\n \n \"Let's go,\" Andy said, pushing up from his chair. Ignoring the brass, he turned to her and brushed his lips across hers. \"Let them sweat a while. Let 'em have the whole stinking business. Whatever they do to us, at least we can get some sleep.\"\n \n \"But you can't quit now,\" Bettijean protested. \"These brass hats don't know from—\"\n \n \"Corporal!\" the colonel roared.\n \n \n \n And from the door, an icy voice said, \"Yes, colonel?\"\n \n The colonel and his captains wheeled, stared and saluted. \"Oh, general,\" the colonel said. \"I was just—\"\n \n \"I know,\" the brigadier said, stepping into the room. \"I've been listening to you. And I thought I suggested that everybody leave the sergeant and his staff alone.\"\n \n \"But, general, I—\"\n \n The general showed the colonel his back and motioned Andy into his chair. He glanced to Bettijean and a smile warmed his wedge face.\n\"Corporal, were you speaking just then as a woman or as a soldier?\"\n \n Crimson erupted into Bettijean's face and her tight laugh said many things. She shrugged. \"Both I guess.\"\n \n The general waved her to a chair and, oblivious of the colonel, pulled up a chair for himself. The last trace of humor drained from his face as he leaned elbows on the desk. \"Andy, this is even worse than we had feared.\"\n \n Andy fumbled for a cigarette and Bettijean passed him a match. A captain opened his mouth to speak, but the colonel shushed him.\n \n \"I've just come from Intelligence,\" the general said. \"We haven't had a report—nothing from our agents, from the Diplomatic Corps, from the civilian newspapermen—not a word from any Iron Curtain country for a day and half. Everybody's frantic. The last item we had—it was a coded message the Reds'd tried to censor—was an indication of something big in the works.\"\n \n \"A day and half ago,\" Andy mused. \"Just about the time we knew we had an epidemic. And about the time they knew it.\"\n \n \"It could be just propaganda,\" Bettijean said hopefully, \"proving that they could cripple us from within.\"\n \n The general nodded. \"Or it could be the softening up for an all-out effort. Every American base in the world is alerted and every serviceman is being issued live ammunition. If we're wrong, we've still got an epidemic and panic that could touch it off. If we're right ... well, we've got to know. What can you do?\"\n \n Andy dropped his haggard face into his hands. His voice came through muffled. \"I can sit here and cry.\" For an eternity he sat there, futility piling on helplessness, aware of Bettijean's hand on his arm. He heard the colonel try to speak and sensed the general's movement that silenced him.\n \n Suddenly he sat upright and slapped a palm down on the desk. \"We'll find your answers, sir. All we ask is co-operation.\"\n \n The general gave both Andy and Bettijean a long, sober look, then launched himself from the chair. Pivoting, he said, \"Colonel, you and your captains will be stationed by that switchboard out there. For the duration of this emergency, you will take orders only from the sergeant and the corporal here.\"\n \n \"But, general,\" the colonel wailed, \"a noncom? I'm assigned—\"\n \n The general snorted. \"Insubordination cannot be tolerated—unless you find a two-star general to outrank me. Now, as I said before, let's get out of here and let these people work.\"\n \n \n \n The brass exited wordlessly. Bettijean sighed noisily. Andy found his cigarette dead and lit another. He fancied a tiny lever in his brain and he shifted gears to direct his thinking back into the proper channel. Abruptly his fatigue began to lift. He picked up the new pile of reports Bettijean had brought in.\n \n She move around the desk and sat, noting the phone book he had used, studying the names he had crossed off. \"Did you learn anything?\" she asked.\n \n Andy coughed, trying to clear his raw throat. \"It's crazy,\" he said.\n\"From the Senate and House on down, I haven't found a single government worker sick.\"\n \n \"I found a few,\" she said. \"Over in a Virginia hospital.\"\n \n \"But I did find,\" Andy said, flipping through pages of his own scrawl, \"a society matron and her social secretary, a whole flock of office workers—business, not government—and new parents and newly engaged girls and....\" He shrugged.\n \n \"Did you notice anything significant about those office workers?\"\n \n Andy nodded. \"I was going to ask you the same, since I was just guessing. I hadn't had time to check it out.\"\n \n \"Well, I checked some. Practically none of my victims came from big offices, either business or industry. They were all out of one and two-girl offices or small businesses.\"\n \n \"That was my guess. And do you know that I didn't find a doctor, dentist or attorney?\"\n \n \"Nor a single postal worker.\"\n \n Andy tried to smile. \"One thing we do know. It's not a communicable thing. Thank heaven for—\"\n \n He broke off as a cute blonde entered and put stacks of reports before both Andy and Bettijean. The girl hesitated, fidgeting, fingers to her teeth. Then, without speaking, she hurried out.\n \n Andy stared at the top sheet and groaned. \"This may be something. Half the adult population of Aspen, Colorado, is down.\"\n \n \"What?\" Bettijean frowned over the report in her hands. \"It's the same thing—only not quite as severe—in Taos and Santa Fe, New Mexico.\"\n \n \"Writers?\"\n \n \"Mostly. Some artists, too, and musicians. And poets are among the hard hit.\"\n \n \"This is insane,\" Andy muttered. \"Doctors and dentists are fine—writers and poets are sick. Make sense out of that.\"\n \n Bettijean held up a paper and managed a confused smile. \"Here's a country doctor in Tennessee. He doesn't even know what it's all about. Nobody's sick in his valley.\"\n \n \"Somebody in our outer office is organized,\" Andy said, pulling at his cigarette. \"Here're reports from a dozen military installations all lumped together.\"\n \n \"What does it show?\"\n \n \"Black-out. By order of somebody higher up—no medical releases. Must mean they've got it.\" He scratched the growing stubble on his chin.\n\"If this were a fifth column setup, wouldn't the armed forces be the first hit?\"\n \n \"Sure,\" Bettijean brightened, then sobered. \"Maybe not. The brass could keep it secret if an epidemic hit an army camp. And they could slap a control condition on any military area. But the panic will come from the general public.\"\n \n \"Here's another batch,\" Andy said. \"Small college towns under twenty-five thousand population. All hard hit.\"\n \n \"Well, it's not split intellectually. Small colleges and small offices and writers get it. Doctors don't and dentists don't. But we can't tell who's got it on the military bases.\"\n \n \"And it's not geographical. Look, remember those two reports from Tennessee? That place where they voted on water bonds or something, everybody had it. But the country doctor in another section hadn't even heard of it.\" Andy could only shake his head.\n \n Bettijean heaved herself up from the chair and trudged back to the outer office. She returned momentarily with a tray of food. Putting a paper cup of coffee and a sandwich in front of Andy, she sat down and nibbled at her snack like an exhausted chipmunk.\n \n Andy banged a fist at his desk again. Coffee splashed over the rim of his cup onto the clutter of papers. \"It's here,\" he said angrily.\n\"It's here somewhere, but we can't find it.\"\n \n \"The answer?\"\n \n \"Of course. What is it that girls in small offices do or eat or drink or wear that girls in large offices don't do or eat or drink or wear? What do writers and doctors do differently? Or poets and dentists? What are we missing? What—\"\n \n \n \n In the outer office a girl cried out. A body thumped against a desk, then a chair, then to the floor. Two girls screamed.\n \n Andy bolted up from his chair. Racing to the door, he shouted back to Bettijean, \"Get a staff doctor and a chemist from the lab.\"\n \n It was the girl who had been so nervous in his office earlier. Now she lay in a pathetic little heap between her desk and chair, whimpering, shivering, eyes wide with horror. The other girls clustered at the hall door, plainly ready to stampede.\n \n \"It's not contagious,\" Andy growled. \"Find some blankets or coats to cover her. And get a glass of water.\"\n \n The other girls, glad for the excuse, dashed away. Andy scooped up the fallen girl and put her down gently on the close-jammed desks. He used a chair cushion for a pillow. By then the other girls were back with a blanket and the glass of water. He covered the girl, gave her a sip of water and heard somebody murmur, \"Poor Janis.\"\n \n \"Now,\" Andy said brightly, \"how's that, Janis?\"\n \n She mustered a smile, and breathed, \"Better. I ... I was so scared. Fever and dizzy ... symptoms like the epidemic.\"\n \n \"Now you know there's nothing to be afraid of,\" Andy said, feeling suddenly and ridiculously like a pill roller with a practiced bedside manner. \"You know you may feel pretty miserable, but nobody's conked out with this stuff yet.\"\n \n Janis breathed out and her taut body relaxed.\n \n \"Don't hurry,\" Andy said, \"but I want you to tell me everything that you did—everything you ate or drank—in the last ... oh, twelve hours.\" He felt a pressure behind him and swiveled his head to see Bettijean standing there. He tried to smile.\n \n \"What time is it?\" Janis asked weakly.\n \n Andy glanced to a wall clock, then gave it a double take.\n \n One of the girls said, \"It's three o'clock in the morning.\" She edged nearer Andy, obviously eager to replace Janis as the center of attention. Andy ignored her.\n \n \"I ... I've been here since ... golly, yesterday morning at nine,\" Janis said. \"I came to work as usual and....\"\n \n Slowly, haltingly, she recited the routine of a routine work day, then told about the quick snack that sufficed for supper and about staying on her phone and typewriter for another five hours. \"It was about eleven when the relief crew came in.\"\n \n \"What did you do then?\" Andy asked.\n \n \"I ... I took a break and....\" Her ivory skin reddened, the color spreading into the roots of her fluffy curls, and she turned her face away from Andy. \"And I had a sandwich and some coffee and got a little nap in the ladies' lounge and ... and that's all.\"\n \n \"And that's not all,\" Andy prompted. \"What else?\"\n \n \"Nothing,\" Janis said too quickly.\n \n Andy shook his head. \"Tell it all and maybe it'll help.\"\n \n \"But ... but....\"\n \n \"Was it something against regulations?\"\n \n \"I ... I don't know. I think....\"\n \n \"I'll vouch for your job in this office.\"\n \n \"Well....\" She seemed on the verge of tears and her pleading glance sought out Andy, then Bettijean, then her co-workers. Finally, resigned, she said, \"I ... I wrote a letter to my mother.\"\n \n Andy swallowed against his groan of disappointment. \"And you told her about what we were doing here.\"\n \n Janis nodded, and tears welled into her wide eyes.\n \n \"Did you mail it?\"\n \n \"Y ... yes.\"\n \n \"You didn't use a government envelope to save a stamp?\"\n \n \"Oh, no. I always carry a few stamps with me.\" She choked down a sob.\n\"Did I do wrong?\"\n \n \"No, I don't think so,\" Andy said, patting her shoulder. \"There's certainly nothing secret about this epidemic. Now you just take it easy and—. Oh, here's a doctor now.\"\n \n The doctor, a white-headed Air Force major, bustled into the room. A lab technician in a white smock was close behind. Andy could only shrug and indicate the girl.\n \n Turning away, lighting a cigarette, he tried to focus on the tangle of thoughts that spun through his head. Doctors, writers, society matrons, office workers—Aspen, Taos and college towns—thousands of people sick—but none in that valley in Tennessee—and few government workers—just one girl in his office—and she was sicker and more frightened about a letter—and....\n \n \"Hey, wait!\" Andy yelled.\n \n Everyone in the room froze as Andy spun around, dashed to Bettijean's desk and yanked out the wide, top drawer. He pawed through it, straightened, then leaped across to the desk Janis had used. He snatched open drawer after drawer. In a bottom one he found her purse. Ripping it open, he dumped the contents on the desk and clawed through the pile until he found what he wanted. Handing it to the lab technician, he said, \"Get me a report. Fast.\"\n \n The technician darted out.\n \n Andy wheeled to Bettijean. \"Get the brass in here. And call the general first.\" To the doctor, he said, \"Give that girl the best of everything.\"\n \n Then he ducked back to his own office and to the pile of reports. He was still poring over them when the general arrived. Half a dozen other brass hats, none of whom had been to bed, were close behind. The lab technician arrived a minute later. He shook his head as he handed his hastily scribbled report to Andy.\n \n \n \n It was Bettijean who squeezed into the office and broke the brittle silence. \"Andy, for heaven's sake, what is it?\" Then she moved around the desk to stand behind him as he faced the officers.\n \n \"Have you got something?\" the brigadier asked. \"Some girl outside was babbling about writers and doctors, and dentists and college students, and little secretaries and big secretaries. Have you established a trend?\"\n \n Andy glanced at the lab report and his smile was as relieved as it was weary. \"Our problem,\" he said, \"was in figuring out what a writer does that a doctor doesn't—why girls from small offices were sick—and why senators and postal workers weren't—why college students caught the bug and people in a Tennessee community didn't.\n \n \"The lab report isn't complete. They haven't had time to isolate the poison and prescribe medication. But\"—he held up a four-cent stamp—\"here's the villain, gentlemen.\"\n \n The big brass stood stunned and shocked. Mouths flapped open and eyes bugged at Andy, at the stamp.\n \n Bettijean said, \"Sure. College kids and engaged girls and new parents and especially writers and artists and poets—they'd all lick lots of stamps. Professional men have secretaries. Big offices have postage-meter machines. And government offices have free franking. And\"—she threw her arms around the sergeant's neck—\"Andy, you're wonderful.\"\n \n \"The old American ingenuity,\" the colonel said, reaching for Andy's phone. \"I knew we could lick it. Now all we have to do—\"\n \n \"At ease, colonel,\" the brigadier said sharply. He waited until the colonel had retreated, then addressed Andy. \"It's your show. What do you suggest?\"\n \n \"Get somebody—maybe even the President—on all radio and TV networks. Explain frankly about the four-centers and warn against licking any stamps. Then—\"\n \n He broke off as his phone rang. Answering, he listened for a moment, then hung up and said, \"But before the big announcement, get somebody checking on the security clearances at whatever plant it is where they print stamps. This's a big deal. Somebody may've been planted years ago for this operation. It shouldn't be too hard.\n \n \"But there's no evidence it was a plot yet. Could be pure accident—some chemical in the stickum spoiled. Do they keep the stickum in barrels? Find out who had access. And ... oh, the phone call. That was the lab. The antidote's simple and the cure should be quick. They can phone or broadcast the medical information to doctors. The man on the phone said they could start emptying hospitals in six hours. And maybe we should release some propaganda. \"United States whips mystery virus,\" or something like that. And we could send the Kremlin a stamp collection and.... Aw, you take it, sir. I'm pooped.\"\n \n \n \n The general wheeled to fire a salvo of commands. Officers poured into the corridor. Only the brigadier remained, a puzzled frown crinkling his granite brow.\n \n \"But you said that postal workers weren't getting sick.\"\n \n Andy chucked. \"That's right. Did you ever see a post office clerk lick a stamp? They always use a sponge.\"\n \n The general looked to Bettijean, to Andy, to the stamp. He grinned and the grin became a rumbling laugh. \"How would you two like a thirty-day furlough to rest up—or to get better acquainted?\"\n \n Bettijean squealed. Andy reached for her hand.\n \n \"And while you're gone,\" the general continued, \"I'll see what strings I can pull. If I can't wangle you a couple of battlefield commissions, I'll zip you both through O.C.S. so fast you won't even have time to pin on the bars.\"\n \n But neither Andy nor Bettijean had heard a word after the mention of furlough. Like a pair of puppy-lovers, they were sinking into the depths of each other's eyes.\n \n And the general was still chuckling as he picked up the lone four-cent stamp in his left hand, made a gun of his right hand, and marched the stamp out of the office under guard.\n \n \n THE END",
      "metadata": {
        "title": "The Plague",
        "author": "Teddy Keller",
        "passage_id": "30062",
        "uid": "cdd386b48e764cdd92934c34e7e69488",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "6",
                "uid": "f39544b36fbe436cbfaf23794ebf9a57",
                "response_text": "The Plague takes place in the modern United States of America. The story follows several government workers as they navigate a sudden and mysterious epidemic. Sergeant Major Andrew McCloud, mostly referred to as Andy, works at the Office of the Civil Health and Germ Welfare Protection located in the Pentagon. Corporal Bettijean Baker, his right-hand woman and new lover, picks up the phone one day, and then chaos ensues. \nA switchboard is put in the hallway to help receive the hundreds of calls being made to their office. This sudden influx of calls, attention, people, and disease leave the main characters feeling overwhelmed and desperate. \nSince the new lieutenant had not arrived (post Colonel Patterson’s retirement), Sergeant Andy is effectively in charge as a noncom, though not everyone is happy about that. Andy pushes their worries aside, and continues working. \nDespite the spread, no fatalities have been reported, and infections are random. No trend has been established yet, but they are searching desperately for one. Bettijean goes through reports with Sergeant Andy, revealing all she’s uncovered. It’s affecting workers, artists, and poets, but not necessarily those who work in government, or as doctors or businessmen. The water systems are ruled out, as well as wind and food. Bettijean and Andy are left with nothing, except the possibility of biological terrorism. \nFinally, Andy orders Bettijean to halt all in-coming calls, and redirect their attention to all hospitals. \nDespite their best efforts, no conclusion can be reached. The colonel reappears in Andy’s office, followed by two officers. He throws a newspaper down on his desk, proclaiming that this epidemic was allegedly caused by the Russians, and that all the authorities are baffled. It is hinted that the Colonel commissioned this article to throw doubt on Andy’s authority. Andy defends his employees and the work they’ve been doing. The Colonel forces Andy and Bettijean out of office, and Andy lets him, kissing Bettijean on the way out. Suddenly, the general walks in and gives Andy back his job, while telling him the news from Intelligence. The Iron Curtain’s not sent word for almost two days. Only a coded message that could have been about the epidemic. \nAndy promises to work hard again, and the general assigns the colonel and his two men to the switchboard in the hall. After brainstorming about potential causes, Janis, another employee, enters the room and puts another stack of reports down. Small college towns, newly engaged girls, poets, all these people have been infected. Janis falls to the floor, and everyone rushes to her. She’s been infected with the disease, and they question her about her activities for the past 12 hours. It’s revealed finally that she wrote a letter to her mother, and Andy finally figures it out. The poison was in the stamps. He lets his higher-ups know, and Janis is carted off to safety. Bettijean and Andy are given a 30-day vacation to relax and explore their relationship further. \n"
              },
              {
                "worker_id": "3",
                "uid": "4cf9f0459fc942709e74486fc16b24ee",
                "response_text": "Sergeant Major Andrew McCloud has found himself in charge of the Office of Civil Health and Germ Warfare Protection somewhat by accident. As he waits for a replacement, his superior officers nervously warn him about an epidemic that they don’t understand yet, that Andy will be in charge of the response for. Corporal Bettijean Baker is Andy’s assistant, in this previously under-the-radar department that is all of a sudden the most important aspect of the nation’s response. Andy and Bettijean work through reports together to look for a trend, hoping to find how the epidemic is spreading. It seems to be affecting only the United States of America, without affecting Canada even though it has reached Alaska. The dumbfounded officers decide to learn more about the people who have fallen sick. When Bettijean returned with more reports, two other officers came into Andy’s office to show him the headlines: the public panic had started, two days after the office had stopped sleeping to find the root of the issue. The colonel doesn’t appreciate the lack of military formality in the way that Andy and Bettijean are taking, and he angrily orders them to be disciplined before the general interrupts. The general gestures to Andy and Bettijean to continue their work, and sat down with them to talk solemnly. There’s some suspicion about the Soviet Union’s involvement. Recognizing Andy’s need for manpower, the general assigns the very unhappy colonel to report to Andy and Bettijean for as long as the epidemic is going on. Lighting a new cigarette, Andy gets back to work. The team found evidence of small business workers being sick, but no government workers (outside of some in a hospital), no doctors, and no postal workers. They take this as evidence that it’s not communicable, but they find some cities are more affected than others. Writers, poets, artists, and musicians in cities that are often vacation spots are hit hard, along with small college towns. They are interrupted by screams outside their door when Janis falls sick. When she’s able to talk, Andy asks Janis questions about the past twelve hours. She had written and mailed a letter to her mother about the epidemic, but nothing else seemed out of place. Andy pondered over another cigarette as the doctor saw to Janis. Andy suddenly had an idea, frantically searched for Janis’ purse, and handed one of her postage stamps to a lab technician. His hunch was right: the stamp was the problem, licking the glue was how people got sick. Andy starts on a plan to notify the public of the issue, and to investigate the source of the poison in the stamps. The lab was able to identify the toxin, and it would be simple to treat. The general took over giving orders, and gave Andy and Bettijean a month of furlough before marching the stamp out of the office as Andy and Bettijean looked at each other longingly. "
              },
              {
                "worker_id": "5",
                "uid": "71c4aa38d21f4cdba669561aa2921444",
                "response_text": "The story describes members of the U.S. military Germ Warfare Protection Division as they struggle to understand the cause of a mysterious illness. Sergeant Major Andy McCloud and his Corporal Bettijean Baker slowly learns the details of the pandemic. It is entirely confined to the United States and seems to affect people according to no discernable pattern. The illness is not passed person to person and has affected people regardless of age, location, and behavior while other people are spared.\n\nHigh ranking military officials (the brass) express to Andy the urgency of the situation. As the day wears on, Andymust deal with threats to his operation from officers that believe that, as a noncommissioned officer, He is not qualified to perform his task regardless of his obvious expertise.\n\nVague trends begin to emerge. Large offices see no cases while small ones do; doctors and dentists are mostly unaffected while writers and poets are.\n\nEventually a woman working the phones in the Germ Warfare Protection division falls ill and Andy solves the riddle of the illness. Stamp adhesive is determined to be the vector for the illness. With the mystery solved, a plan to halt the spread of the illness is formulated and the brass gives Andy and Bettijean a vacation furlough and promise of a promotion."
              },
              {
                "worker_id": "1",
                "uid": "90634bb859914fc69c0089be712cfba9",
                "response_text": "Sergeant Andrew McCloud is in charge of the office of Germ War Protection when a mysterious plague breaks out in the United States. His coworker Bettlejean tells him that all kinds of people are coming down with the illness, but no one has died yet. The strangest part about the new disease is that it has only affected Americans. Not even Canadians or Mexicans have become sick. \n\nMcCloud decides to send everyone who works in the office out to do some investigating about where the illness is coming from. He tells Bettlejean that the two of them will work in Washington. They begin to put together clues about the nature of the illness when suddenly a woman in the office, Janis, drops to the ground. She is red and feverish and extremely nervous. After some prodding, she admits that she broke an office rule when she mailed her mother a letter that included information about the outbreak. \n\nAfter a few moments of reflection, McCloud runs to Janis’s office and tears through her drawers to find her stamps. He sends the lab technician to test them, but he is already convinced that the stamps contain poison, and they are behind the mysterious illness. \n\nWhen his superior comes in to ask him what he has discovered, McCloud divulges his beliefs about the problematic stamps. McCloud suggests that the President make an announcement to the public about the poisonous stamps. However, he quickly realizes that the stamps could have been tainted accidentally, and this doesn’t necessarily point to an attack on the country. McCloud is interrupted by a phone call from the lab. The technician informs him that the illness the stamps cause has a quick fix, and the people who are ill are going to be just fine. McCloud allows someone else to take over. He’s too tired and elated to make any more decisions. \n\nThe general offers McCloud and Bettlejean many awards and some time off to get to know each other better. He can tell that they are quite fond of each other. \n\n\n"
              }
            ]
          },
          {
            "question_text": "What happens to Sergeant Andy McCloud throughout the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "6",
                "uid": "f39544b36fbe436cbfaf23794ebf9a57",
                "response_text": "Ten days prior to the epidemic, Colonel Patterson retired. He was Sergeant Andy McCloud’s superior, and his replacement has yet to show up. Andy theorizes that the replacement for the lieutenant got caught up in all the red tape, but, at the end of the day, the newly-coined Germ War Protection needed a leader. And Andy was stepping up to the job. \n\tHe had worked at the Office of the Civil Health and Germ Warfare Protection Coordinator for two years prior to the epidemic. He knew the ins and outs of the place, so, despite being a noncom, he was truly the best for the job. \n\tOne of his colleagues, Corporal Bettijean Baker, had picked up the phone two days prior, and suddenly their whole words changed. An epidemic was sweeping the nation, infecting random people left and right with no underlying cause or trend, and, despite the absence of fatalities, panic was ensuing. Though some of the officers disapprove of Andy’s noncom position, he continues working tirelessly with his colleagues to try and figure out the cause of this terrifying disease. \n\tHe and Corporal Bettijean Baker brainstorm throughout the story, desperately searching for a trend or place of infection. They realize that artists, poets, college students, and workers are the ones being infected; not necessarily doctors, dentists, and government employees. They try to figure out what activities each group does that could possibly have been the cause of their infection. They quickly rule out the disease traveling through water, wind, and food. And, later on, it’s revealed that the disease is not contagious. Bettijean and Andy put their heads together and think. \n\tTheir time spent together brainstorming was also filled with flirtatious moments. Andy, with his freckles and messy hair, and Bettijean with her jet-black hair, share a kiss or two throughout the story. \n\tAfter exhausting themselves, Andy orders all the girls to redirect all calls to go out, not in. They are to focus on hospitals and relief crews, to discover more on who the virus is infecting. He and Bettijean are almost fired by the disgruntled colonel, who came with two replacements. Thankfully, just as Andy kisses Bettijean, the general walks in and dismisses the colonel. He reinstates Andy and Bettijean to their former and rightful positions, before telling them that the Iron Curtain has gone silent, except for one coded message from two days before, possibly hinting at the epidemic. \n\tAfter the brass left, Bettijean and Andy brainstormed some more, looking through new reports brought in by Janis, a colleague. Janis soon collapses, and it is revealed that she’s been infected. Andy questions her and soon discovers the transmitter of the virus. Stamps! He relates the news to his higher-ups, and rejoices with Bettijean. They are given a 30-day furloughed vacation together, leaving the reader with a future of romance and hope. \n"
              },
              {
                "worker_id": "3",
                "uid": "4cf9f0459fc942709e74486fc16b24ee",
                "response_text": "Sergeant Andy McCloud was the highest-ranking officer in the Office of Civil Health and Germ Warfare protection when the retired Co-ordinator’s replacement didn’t show up, so he found himself in charge of the office just as a nationwide epidemic was surging. He is berated by some of his superior officers who couldn’t fathom the idea of an officer not in a combat role being in charge of such a large issue, but pushed through and continued trying to work on a solution. He goes through piles of reports with Corporal Bettijean Baker, his assistant, trying to find something that connects the victims. The two of them work through a variety of emotions, including frustration, exhaustion, confusion, and exasperation. When the colonel comes back into Andy’s office to yell more about the severity of the situation that he doesn’t seem to think Andy is the right person to handle, Andy acknowledges him curtly, which makes the colonel relieve Andy of his duties. This whole time, Bettiejean is standing with him, gripping his shoulder in his defense. The threat doesn’t stick, even though Andy was somewhat relieved to have a chance to sleep, as a captain walks in and tells him to continue working. The captain tells the colonel that he and his captains have to report to Andy for the remainder of the crisis. During each of these interactions with superior officers, Andy relies on smoking a cigarette to find some focus, and tries to listen to the captain’s report about possible influence from the Soviet Union. He is upset, and in his exhaustion, loses hope for a moment as the general asks him what Andy can do about the situation, but then finds the courage to stand up and say that he’ll get the job done as long as people work with him on it. He worked through more reports with Bettijean until they were interrupted by a scream as Janis, one of the office workers, fell sick at her desk. Andy called for a doctor and a chemist, asked Janis everything that had happened to her that day, and pondered over the new evidence over another cigarette. He has an epiphany, frantically looks for Janis’ book of stamps in her purse, and sends a stamp with a lab technician. His hunch was right: the toxin that spreads the disease is on the adhesive side of the stamps. As he works on a response plan with the general, he calls out a few orders and then defers to the general to make the rest of the decisions in his exhaustion. The general then offers Andy and Bettiejean a month of furlough so that they can spend time with one another, and they look into each other’s eyes excited to explore their connection. "
              },
              {
                "worker_id": "5",
                "uid": "71c4aa38d21f4cdba669561aa2921444",
                "response_text": "Andy begins the story as a non-commissioned officer running the Germ Warfare Protection division during a crisis. He was never assigned a commanding officer after his previous colonel's retirement 10 days prior. As a result he continually has to defend his standing and prove that he is the right individual to solve the mystery of the illness.\n\nHe works doggedly to try and establish a pattern or trend for the illness and calls tirelessly every hospital in the country until his hand cramps from writing and his voice verges on giving out.\n\nHe has to navigate an attempted takeover by the chicken colonel and his young officers. Eventually he pieces the mystery together by speaking to Janis, a phone operator who falls ill after licking a stamp. Finally he provides his recommendation on how to stop the illness and is rewarded with a long vacation and promotion.\n\n"
              },
              {
                "worker_id": "1",
                "uid": "90634bb859914fc69c0089be712cfba9",
                "response_text": "Andy has been working at the Office of the Civil Health and Germ Warfare Protection for two years when all hell breaks loose. He is put in charge of finding out how the new American plague is spreading, and he is deeply stressed. Chicken colonel attempts to discipline him for insubordination, but the two star general shoots down that idea and asks McCloud to keep working the case with everything he’s got.\n\nMcCloud and Bettlejean look through reports and gather that the disease is not communicable, and it is not only affecting people of a certain class or geographical area. The only clues that they can piece together are that the illness is affecting people who work in small offices rather than large buildings. They also recognize that artists and poets are becoming sick when doctors and dentists are not. \n\nMcCloud’s subordinate, a woman named Janis, suddenly becomes ill. After he questions her about her day and activities, he realizes that the culprit behind the outbreak must be postage stamps. He locates one of the stamps that Janis had in her work desk and sends it to be tested in the lab. \n\nWhen his boss, the general, comes in to hear about McCloud’s findings, he says with confidence that the postage stamps are behind the epidemic. When the lab confirms his suspicions, he is hailed as the hero. The general gives him time off to relax and recuperate from this entire ordeal, and he suggests that McCloud spend some of that time with Bettlejean. McCloud is so excited to get some alone time with his coworker that he barely hears the general detail the awards and accolades that McCloud will receive for his job well done. \n\n"
              }
            ]
          },
          {
            "question_text": "Describe the relationship between Corporal Bettiejean and Sergeant Andy.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "6",
                "uid": "f39544b36fbe436cbfaf23794ebf9a57",
                "response_text": "Sergeant Andrew McCloud is Corporal Bettijean Baker’s superior, both in rank and position at the Germ War office. They have worked together before, perhaps for the two years that Andy has been stationed there. Their relationship ranges from colleagues to lovers, sharing kisses at work or gentle shoulder touches, while still maintaining a professional atmosphere. \n\tThey begin the story extremely stressed, due to the sudden epidemic, and use their combined brain power to find the root cause of the disease. After hours of working together and defending each other to their higher-ups, they are able to identify different groups of people that have been infected, all of which are random and don’t show a clear trend. After the truth is discovered, that the disease is being spread through licking stamps, Corporal Bettijean and Sergeant Andrew are granted a 30-day vacation together, with the promises of getting to know each other better. They accept gratefully, and stare into each other’s eyes. \n\tThough their relationship may be inappropriate in the modern office, it’s clear through their constant defense of the other and dedication to the cause, that their romance is just as strong as their professional relationship. \n"
              },
              {
                "worker_id": "3",
                "uid": "4cf9f0459fc942709e74486fc16b24ee",
                "response_text": "Corporal Bettiejean and Sergeant Andy are colleagues at the Office of Civil Health and Germ Warfare Protection. When Andy is suddenly in charge as the Co-ordinator of the office, Bettiejean is his assistant. The two of them work together to comb through the reports about various aspects of infrastructure that could be responsible for the transmission of the epidemic. Part of this process involves a lot of brainstorming, and throwing ideas back and forth about what the problem could be. When their superior officers come by, and the colonel starts yelling at Andy, Bettiejean defends him and tries to make the colonel realize his rude behavior is entirely unhelpful, which is eventually escalated into an emotional discussion as her grip on Andy’s shoulder grows tighter. She supports him in other ways, too, including handing Andy a match when he tries to light a cigarette, which he does often. The two of them kept the hope for a solution in mind as they worked through more piles of reports, and when Andy develops his theory about the postage stamps being the culprit, it is Bettijean that he sends to call in their superiors. She comes into his office to check on him, and is there while Andy explains that they have a solution. Apparently their interactions have been visible to the rest of the staff in the office, as the general gives them a month of furlough after the root of the problem has been identified, teasing them a bit about the chance to get to know each other. As the story ends, they are looking into each other’s eyes longingly, ready to take the month off. "
              },
              {
                "worker_id": "5",
                "uid": "71c4aa38d21f4cdba669561aa2921444",
                "response_text": "Bettijean and Andy are in a professional relationship with Andy as Bettijean's superior. They are also on close personal terms with romantic overtones.\n\nAs the crisis intensifies, Andy and Bettijean work together to pour through the details of the illness. They view each other as a team although with Bettijean clearly subordinate to Andy. She follows Andy's orders but is also valued for her contribution and viewed as an equal.\n\nAs the crisis is averted, the pair are rewarded with a vacation furlough and pending promotion. The pair are only excited about the furlough and it is implied that they will spend it together as lovers. "
              },
              {
                "worker_id": "1",
                "uid": "90634bb859914fc69c0089be712cfba9",
                "response_text": "Corporal Bettlejean and Sargeant McCloud have a friendly and important relationship. Bettlejean shows her intense interest in McCloud when she checks in on him about how he’s feeling and how their colleagues are treating him. She tries her best to help Andy in his work and set him up to be successful at his job. When McCloud wants to fire back at colonel chicken for what he sees as mistreatment, Bettlejean gently reminds him to keep his composure with only a small and silent gesture. \n\nMcCloud looks at the various groups of people who have come down with the sickness and compares them to those that are fine, and he realizes that the illness is most likely caused by licking postage stamps. Bettlejean beams with pride as he makes his announcement. She is not jealous of his sharp wit and hard work. She supports his reasoning and immediately congratulates him on his brilliant idea. \n\nThroughout the story, McCloud and Bettlejean work together to solve the mystery, and they are quietly  flirtatious, even in front of their coworkers. It is clear that the general has picked up on their attraction to one another when he suggests that they use their much deserved time off to get to know each other better. The two confirm that they will in fact be seeing more of each other when they hold hands at the news. \n\n"
              }
            ]
          },
          {
            "question_text": "What is the significance of Janis's character on the rest of the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "6",
                "uid": "f39544b36fbe436cbfaf23794ebf9a57",
                "response_text": "In short, without Janis, Sergeant Andrew McCloud would not have discovered the cause of the epidemic as quickly or at all. \n\tNear the end of the story, Janis, an attractive blonde woman, enters Sergeant Andy’s office to deliver another stack of reports before him and Corporal Bettijean. The two of them had been analyzing the reports and statistics for several hours now, desperate to find a trend amongst those infected. So far, they had come up with nothing concrete, except for the types of people who were getting infected. Working people, artists, poets, newly engaged women, and small office workers were all turning up sick. Bigger offices, postal workers, doctors, dentists, and government workers were all fine. So, what’s the connection? \n\tAfter nervously delivering the reports, Janis quickly scurries out of the office and back to her desk elsewhere. Bettijean and Andy notice that the adult population in Aspen, Colorado; Taos; and Santa Fe, New Mexico is rapidly falling ill, all towns with prominent artistic industries. \n\tThey keep pouring over the reports, making new discoveries but still not coming up with any answers. Suddenly, a girl cries out from beyond his office. They hear a body fall to the floor, and they quickly rush out as the sounds of screaming emerge. Andy sends Bettijean to retrieve a doctor and a chemist, while he runs to help. Janis was lying on the floor, in pain and scared. Luckily, the virus is not contagious, so Andy and the others were able to help her. \n\tAndy interrogates her, asking detailed questions about her day and the past 12 hours. He tries to ascertain all the moments of her life, so he can pinpoint where and how she got infected. Her symptoms match up with the epidemic at hand (a fever and feeling dizzy), so Andy knows this is his best shot to find the origin. \n\tSlowly, she recounts her day and tells them all about what she did, where she was, and what she ate. She hides one thing though, which Andy quickly forces out of her. She wrote a letter to her mother, telling her about the epidemic and how scary it was. This is against regulations, as shown through Andy’s grunt of disapproval. She mailed it with her own stamps, not with a government envelope. \n\tAndy puts all the puzzle pieces together in his mind and realizes that all those people, Janis included, had one thing in common: writing letters. The poison was in the stamp. Without Janis, Andy would have struggled far longer to discover the illness and halt the production and sale of all stamps nationwide. \n\t\n"
              },
              {
                "worker_id": "3",
                "uid": "4cf9f0459fc942709e74486fc16b24ee",
                "response_text": "Janis is the first person to fall sick with the mysterious disease in the Office of Civil Health and Germ Warfare Protection. She had been one of the people delivering reports to Andy’s office, and head seemed nervous when she had entered last. She had fallen at her desk, and was shivering and horrified at what had happened. Once she was able to talk with Andy, he was able to ask her questions about her day. This was important because Andy had not yet found a connection that tied the victims of the epidemic together. He insisted that he tell her everything, and the fact that she sent a letter to her mother was the crucial fact that allowed Andy to put the story together. He was able to have Janis’ postage stamps tested for a toxin on the glued side, allowing him to finally find the root of the sickness and start the nationwide response, including giving the lab enough information to find out what was needed for a treatment. "
              },
              {
                "worker_id": "5",
                "uid": "71c4aa38d21f4cdba669561aa2921444",
                "response_text": "Janis is the phone operator who falls ill as they are working to solve the mystery of the pandemic. She becomes the key to unlocking the mystery as she describes her day to Andy. She informs him that she sent a letter to her mother earlier in the day. This, along with the trends that are becoming apparent in the sick populations allows Andy to deduce that licking stamp adhesive is what is making people sick."
              },
              {
                "worker_id": "1",
                "uid": "90634bb859914fc69c0089be712cfba9",
                "response_text": "Janis is the first person in McCloud’s office to become sick. First, she comes in to give him a report, and she fidgets and moves like she is nervous. Only a few minutes later, she collapses in the hallway. She is feverish and dizzy. \n\nWhen McCloud pressures her to tell him everything that she has consumed and done in the last day or so, Janis admits that she broke government regulations when she mailed a letter to her mother that detailed the epidemic. McCloud points out that she hardly let out a secret. The news of the epidemic has spread far and wide at this point. \n\nHe contemplates her story for several minutes and realizes that in order to send the letter, Janis must have licked a stamp. Janis’s illness turned out to be the essential clue. Without her explanation of the steps she took before she became sick, McCloud would not have the information he needed to solve the puzzle. \n"
              }
            ]
          },
          {
            "question_text": "What happens to the \"chicken colonel\" throughout the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "6",
                "uid": "f39544b36fbe436cbfaf23794ebf9a57",
                "response_text": "From the start, the colonel does not approve of Sergeant Andrew McCloud. His gray eyes carry disapproval and irritation in them. As a member of the brass, the colonel strives for everything to be official and approved of, unlike the sergeant’s recent promotion. The replacement for the retired colonel had not yet arrived, and the chicken colonel is not thrilled. To have a noncom, defined as a noncommissioned officer, in charge of this office while in the midst of a national epidemic is ludicrous, in his eyes. \n\tDespite voicing his doubts and grievances, Sergeant Andy is allowed to continue working as the head-of-office, at least for the time being. The colonel steals away and plots his next move. \n\tSeveral hours later, he returns, this time with two officers in tow. He walks into Sergeant Andy’s office where he and Corporal Bettijean were looking through a stack of papers. With a defiant stride, the colonel tosses a newspaper onto the Sergeant’s desk. Andy reads it and quickly throws it across the room. The article tells the tale of a red plague taking over America, a possible plot from Russia, and baffled government officials. The colonel brought in the article--and possibly helped write it--to convey the seriousness of the situation, but Andy takes it as an offense instead. \n\tHis colleague, Corporal Bettijean, defends Andy and reprimands the colonel at the same time. The captain behind him scolds her in return. After Sergeant Andy recites a list of excuses for his office, the colonel tells him that his insubordination will not be allowed. He calls for his removal, as well as Corporal Bettijean's, and promotes the two officers from the surgeon general’s office to take their positions. \n\tAfter some fight, Andy relents and stands up, releasing himself of his duty. He kisses his colleague once, before she tries to fight back again. The general walks in and quickly demotes the colonel and his men to working at the switchboard, where the reader can assume they stay for the rest of the story. \n"
              },
              {
                "worker_id": "3",
                "uid": "4cf9f0459fc942709e74486fc16b24ee",
                "response_text": "Andy’s first impression of the colonel (at least in terms of this story) is of the colonel whining about Andy being in charge, insistent that only officers in combat roles should be in charge of a situation as large as a nationwide epidemic. After Andy is able to work through some reports with Bettiejean, the colonel returns to throw a newspaper on Andy’s desk to show the headlines, proving that the public panic has started. In this very tense encounter, the colonel continued to insist that Andy needed to understand the gravity of the situation, without recognizing that of course Andy knew that the issue was serious. He and a young captain overreacted to Bettiejean trying to calm the situation, citing insubordination, and the colonel tries to relieve Andy and Bettiejean of their duties before he is interrupted by a general. This general then assigns the colonel to report to Andy and Bettiejean for the remainder of the crisis, which makes the colonel even more upset. Near the end of the story, after the lab has a report about the toxin on the stamps, the colonel is already trying to take charge again. He reaches for Andy’s phone to start making calls even though Andy is the one in charge of the office, and is the point-person for the epidemic. The colonel is again put in his place by his general, and is eventually sent out of the building with the rest of the officers."
              },
              {
                "worker_id": "5",
                "uid": "71c4aa38d21f4cdba669561aa2921444",
                "response_text": "The chicken colonel (slang for a full colonel--an officer with an eagle as an insignia) is an individual who is preoccupied with rank and traditional military chain-of-command formality. The fact that Andy is a noncommissioned officer operating without direct commissioned officer oversight is unacceptable to him.\n\nWhile the brigadier general sees Andy's expertise and places him in charge of the investigation, the chicken colonel immediately acts to try to undermine Andy's command. He arrives with two young officers to take over the Germ Protection Division but is stopped by an even higher ranking officer--the brigadier. The chicken colonel and his subordinates are assigned to work the phones in a humiliating defeat."
              },
              {
                "worker_id": "1",
                "uid": "90634bb859914fc69c0089be712cfba9",
                "response_text": "Chicken colonel comes into McCloud’s office and demonstrates his dismay with McCloud’s handling of the crisis thus far by slamming a newspaper on the desk. When McCloud and Bettlejean dismiss his criticisms and explain that they have been awake for days, working around the clock, chicken does not bat an eye. Instead, he excuses them from their work to discipline them. \n\nHowever, he is swiftly interrupted by the general who insists that McCloud be in charge of the entire operation, regardless of his rank. He sends chicken colonel to man the phone lines with the rest of his staff. \n\nWhen McCloud announces that he believes American postage stamps have been poisoned, chicken colonel immediately picks up his phone and tries to take the lead once more. The general tells him to stop because McCloud is in charge of what the next steps are.  \n\n\n\n\n\n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4488,
        "document_length_chars": 26468
      }
    }
  ]
}