{
  "item_metadata": {
    "item_id": "32667",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "32667",
      "content": "He was something out of a nightmare but his music was straight from heaven. He was a ragged little man out of a hole but he was money in the bank to Stanley's four-piece combo. He was —whoops!...\n \n \n \n The Holes and John Smith\n \n\n By Edward W. Ludwig\n \n\n Illustration by Kelly Freas\n \n\n \n \n It all began on a Saturday night at The Space Room . If you've seen any recent Martian travel folders, you know the place:\n\"A picturesque oasis of old Martian charm, situated on the beauteous Grand Canal in the heart of Marsport. Only half a mile from historic Chandler Field, landing site of the first Martian expedition nearly fifty years ago in 1990. A visitor to the hotel, lunch room or cocktail lounge will thrill at the sight of hardy space pioneers mingling side by side with colorful Martian tribesmen. An evening at The Space Room is an amazing, unforgettable experience.\"\n \n Of course, the folders neglect to add that the most amazing aspect is the scent of the Canal's stagnant water—and that the most unforgettable experience is seeing the \"root-of-all-evil\" evaporate from your pocketbook like snow from the Great Red Desert.\n \n We were sitting on the bandstand of the candle-lit cocktail lounge. Me—Jimmie Stanley—and my four-piece combo. Maybe you've seen our motto back on Earth:\n\"The Hottest Music This Side of Mercury.\"\n \n But there weren't four of us tonight. Only three. Ziggy, our bass fiddle man, had nearly sliced off two fingers while opening a can of Saturnian ice-fish, thus decreasing the number of our personnel by a tragic twenty-five per cent.\n \n Which was why Ke-teeli, our boss, was descending upon us with all the grace of an enraged Venusian vinosaur.\n \n \"Where ees museek?\" he shrilled in his nasal tenor. He was almost skeleton thin, like most Martians, and so tall that if he fell down he'd be half way home.\n \n I gulped. \"Our bass man can't be here, but we've called the Marsport local for another. He'll be here any minute.\"\n \n Ke-teeli, sometimes referred to as Goon-Face and The Eye, leered coldly down at me from his eight-foot-three. His eyes were like black needle points set deep in a mask of dry, ancient, reddish leather.\n \n \"Ees no feedle man, ees no job,\" he squeaked.\n \n I sighed. This was the week our contract ended. Goon-Face had displayed little enough enthusiasm for our music as it was. His comments were either, \"Ees too loud, too fast,\" or \"Ees too slow, too soft.\" The real cause of his concern being, I suspected, the infrequency with which his cash register tinkled.\n \n \"But,\" I added, \"even if the new man doesn't come, we're still here. We'll play for you.\" I glanced at the conglomeration of uniformed spacemen, white-suited tourists, and loin-clothed natives who sat at ancient stone tables. \"You wouldn't want to disappoint your customers, would you?\"\n \n Ke-teeli snorted. \"Maybe ees better dey be deesappointed. Ees better no museek den bad museek.\"\n \n Fat Boy, our clarinetist who doubles on Martian horn-harp, made a feeble attempt at optimism. \"Don't worry, Mr. Ke-teeli. That new bass man will be here.\"\n \n \"Sure,\" said Hammer-Head, our red-haired vibro-drummer. \"I think I hear him coming now.\"\n \n Suspiciously, Ke-teeli eyed the entrance. There was only silence. His naked, parchment-like chest swelled as if it were an expanding balloon.\n \n \"Five meenutes!\" he shrieked.\n\"Eef no feedle, den you go!\" And he whirled away.\n \n We waited.\n \n Fat Boy's two hundred and eighty-odd pounds were drooped over his chair like the blubber of an exhausted, beach-stranded whale.\n \n \"Well,\" he muttered, \"there's always the uranium pits of Neptune. Course, you don't live more than five years there—\"\n \n \"Maybe we could make it back to Lunar City,\" suggested Hammer-Head.\n \n \"Using what for fare?\" I asked.\n\"Your brains?\"\n \n Hammer-Head groaned. \"No. I guess it'll have to be the black pits of Neptune. The home of washed-up interplanetary musicians. It's too bad. We're so young, too.\"\n \n The seconds swept by. Ke-teeli was casting his razor-edged glare in our direction. I brushed the chewed finger nails from the keyboard of my electronic piano.\n \n Then it happened.\n \n \n \n From the entrance of The Space Room came a thumping and a grating and a banging. Suddenly, sweeping across the dance floor like a cold wind, was a bass fiddle, an enormous black monstrosity, a refugee from a pawnbroker's attic. It was queerly shaped. It was too tall, too wide. It was more like a monstrous, midnight-black hour-glass than a bass.\n \n The fiddle was not unaccompanied as I'd first imagined. Behind it, streaking over the floor in a waltz of agony, was a little guy, an animated matchstick with a flat, broad face that seemed to have been compressed in a vice. His sandcolored mop of hair reminded me of a field of dry grass, the long strands forming loops that flanked the sides of his face.\n \n His pale blue eyes were watery, like twin pools of fog. His tightfitting suit, as black as the bass, was something off a park bench. It was impossible to guess his age. He could have been anywhere between twenty and forty.\n \n The bass thumped down upon the bandstand.\n \n \"Hello,\" he puffed. \"I'm John Smith, from the Marsport union.\" He spoke shrilly and rapidly, as if anxious to conclude the routine of introductions. \"I'm sorry I'm late, but I was working on my plan.\"\n \n A moment's silence.\n \n \"Your plan?\" I echoed at last.\n \n \"How to get back home,\" he snapped as if I should have known it already.\n \n Hummm, I thought.\n \n My gaze turned to the dance floor. Goon-Face had his eyes on us, and they were as cold as six Indians going South.\n \n \"We'll talk about your plan at intermission,\" I said, shivering.\n\"Now, we'd better start playing. John, do you know On An Asteroid With You ?\"\n \n \"I know everything ,\" said John Smith.\n \n I turned to my piano with a shudder. I didn't dare look at that horrible fiddle again. I didn't dare think what kind of soul-chilling tones might emerge from its ancient depths.\n \n And I didn't dare look again at the second monstrosity, the one named John Smith. I closed my eyes and plunged into a four-bar intro.\n \n Hammer-Head joined in on vibro-drums and Fat Boy on clarinet, and then—\n \n My eyes burst open. A shiver coursed down my spine like gigantic mice feet.\n \n The tones that surged from that monstrous bass were ecstatic. They were out of a jazzman's Heaven. They were great rolling clouds that seemed to envelop the entire universe with their vibrance. They held a depth and a volume and a richness that were astounding, that were like no others I'd ever heard.\n \n First they went Boom-de-boom-de-boom-de-boom , and then, boom-de-de-boom-de-de-boom-de-de-boom , just like the tones of all bass fiddles.\n \n But there was something else, too. There were overtones, so that John wasn't just playing a single note, but a whole chord with each beat. And the fullness, the depth of those incredible chords actually set my blood tingling. I could feel the tingling just as one can feel the vibration of a plucked guitar string.\n \n I glanced at the cash customers. They looked like weary warriors getting their first glimpse of Valhalla. Gap-jawed and wide-eyed, they seemed in a kind of ecstatic hypnosis. Even the silent, bland-faced Martians stopped sipping their wine-syrup and nodded their dark heads in time with the rhythm.\n \n I looked at The Eye. The transformation of his gaunt features was miraculous. Shadows of gloom dissolved and were replaced by a black-toothed, crescent-shaped smile of delight. His eyes shone like those of a kid seeing Santa Claus.\n \n We finished On An Asteroid With You , modulated into Sweet Sally from Saturn and finished with Tighten Your Lips on Titan .\n \n We waited for the applause of the Earth people and the shrilling of the Martians to die down. Then I turned to John and his fiddle.\n \n \"If I didn't hear it,\" I gasped,\n\"I wouldn't believe it!\"\n \n \"And the fiddle's so old, too!\" added Hammer-Head who, although sober, seemed quite drunk.\n \n \"Old?\" said John Smith. \"Of course it's old. It's over five thousand years old. I was lucky to find it in a pawnshop. Only it's not a fiddle but a Zloomph . This is the only one in existence.\" He patted the thing tenderly. \"I tried the hole in it but it isn't the right one.\"\n \n I wondered what the hell he was talking about. I studied the black, mirror-like wood. The aperture in the vesonator was like that of any bass fiddle.\n \n \"Isn't right for what?\" I had to ask.\n \n He turned his sad eyes to me.\n\"For going home,\" he said.\n \n Hummm, I thought.\n \n \n \n We played. Tune after tune. John knew them all, from the latest pop melodies to a swing version of the classic Rhapsody of The Stars . He was a quiet guy during the next couple of hours, and getting more than a few words from him seemed as hard as extracting a tooth. He'd stand by his fiddle—I mean, his Zloomph —with a dreamy expression in those watery eyes, staring at nothing.\n \n But after one number he studied Fat Boy's clarinet for a moment.\n\"Nice clarinet,\" he mused. \"Has an unusual hole in the front.\"\n \n Fat Boy scratched the back of his head. \"You—you mean here? Where the music comes out?\"\n \n John Smith nodded. \"Unusual.\"\n \n Hummm, I thought again.\n \n Awhile later I caught him eyeing my piano keyboard. \"What's the matter, John?\"\n \n He pointed.\n \n \"Oh, there,\" I said. \"A cigarette fell out of my ashtray, burnt a hole in the key. If The Eye sees it, he'll swear at me in seven languages.\"\n \n \"Even there,\" he said softly,\n\"even there....\"\n \n There was no doubt about it. John Smith was peculiar, but he was the best bass man this side of a musician's Nirvana.\n \n It didn't take a genius to figure out our situation. Item one: Goon-Face's countenance had evidenced an excellent imitation of Mephistopheles before John began to play. Item two: Goon-Face had beamed like a kitten with a quart of cream after John began to play.\n \n Conclusion: If we wanted to keep eating, we'd have to persuade John Smith to join our combo.\n \n At intermission I said, \"How about a drink, John? Maybe a shot of wine-syrup?\"\n \n He shook his head.\n \n \"Then maybe a Venusian fizz?\"\n \n His grunt was negative.\n \n \"Then some old-fashioned beer?\"\n \n He smiled. \"Yes, I like beer.\"\n \n I escorted him to the bar and assisted him in his arduous climb onto a stool.\n \n \"John,\" I ventured after he'd taken an experimental sip, \"where have you been hiding? A guy like you should be playing every night.\"\n \n John yawned. \"Just got here. Figured I might need some money so I went to the union. Then I worked on my plan.\"\n \n \"Then you need a job. How about playing with us steady? We like your style a lot.\"\n \n He made a long, low humming sound which I interpreted as an expression of intense concentration.\n\"I don't know,\" he finally drawled.\n \n \"It'd be a steady job, John.\" Inspiration struck me. \"And listen, I have an apartment. It's got everything, solar shower, automatic chef,\n'copter landing—if we ever get a\n'copter. Plenty of room there for two people. You can stay with me and it won't cost you a cent. And we'll even pay you over union wages.\"\n \n His watery gaze wandered lazily to the bar mirror, down to the glittering array of bottles and then out to the dance floor.\n \n He yawned again and spoke slowly, as if each word were a leaden weight cast reluctantly from his tongue:\n \n \"No, I don't ... care much ... about playing.\"\n \n \"What do you like to do, John?\"\n \n His string-bean of a body stiffened.\n\"I like to study ancient history ... and I must work on my plan.\"\n \n Oh Lord, that plan again!\n \n I took a deep breath. \"Tell me about it, John. It must be interesting.\"\n \n He made queer clicking noises with his mouth that reminded me of a mechanical toy being wound into motion. \"The whole foundation of this or any other culture is based on the history of all the time dimensions, each interwoven with the other, throughout the ages. And the holes provide a means of studying all of it first hand.\"\n  Oh, oh , I thought. But you still have to eat. Remember, you still have to eat.\n \n \n \"Trouble is,\" he went on, \"there are so many holes in this universe.\"\n \n \"Holes?\" I kept a straight face.\n \n \"Certainly. Look around you. All you see is holes. These beer bottles are just holes surrounded by glass. The doors and windows—they're holes in walls. The mine tunnels make a network of holes under the desert. Caves are holes, animals live in holes, our faces have holes, clothes have holes—millions and millions of holes!\"\n \n I winced and thought, humor him because you gotta eat, you gotta eat.\n \n His voice trembled with emotion.\n\"Why, they're everywhere. They're in pots and pans, in pipes, in rocket jets, in bumpy roads. There are buttonholes and well holes, and shoelace holes. There are doughnut holes and stocking holes and woodpecker holes and cheese holes. Oceans lie in holes in the earth, and rivers and canals and valleys. The craters of the Moon are holes. Everything is—\"\n \n \"But, John,\" I said as patiently as possible, \"what have these holes got to do with you?\"\n \n He glowered at me as if I were unworthy of such a confidence.\n\"What have they to do with me?\" he shrilled. \"I can't find the right one—that's what!\"\n \n I closed my eyes. \"Which particular hole are you looking for, John?\"\n \n He was speaking rapidly again now.\n \n \"I was hurrying back to the University with the Zloomph to prove a point of ancient history to those fools. They don't believe that instruments which make music actually existed before the tapes! It was dark—and some fool researcher had forgotten to set a force-field over the hole—I fell through.\"\n \n I closed my eyes. \"Now wait a minute. Did you drop something, lose it in the hole—is that why you have to find it?\"\n \n \"Oh I didn't lose anything important,\" he snapped, \" just my own time dimension. And if I don't get back they will think I couldn't prove my theory, that I'm ashamed to come back, and I'll be discredited.\"\n \n His chest sagged for an instant. Then he straightened. \"But there's still time for my plan to work out—with the relative difference taken into account. Only I get so tired just thinking about it.\"\n \n \"Yes, I can see where thinking about it would tire any one.\"\n \n He nodded. \"But it can't be too far away.\"\n \n \"I'd like to hear more about it,\" I said. \"But if you're not going to play with us—\"\n \n \"Oh, I'll play with you,\" he beamed. \"I can talk to you . You understand.\"\n \n Thank heaven!\n \n \n \n Heaven lasted for just three days. During those seventy-two golden hours the melodious tinkling of The Eye's cash register was as constant as that of Santa's sleigh bells.\n \n John became the hero of tourists, spacemen, and Martians, but nevertheless he remained stubbornly aloof. He was quiet, moody, playing his Zloomph automatically. He'd reveal definite indications of belonging to Homo Sapiens only when drinking beer and talking about his holes.\n \n Goon-Face was still cautious.\n \n \"Contract?\" he wheezed. \"Maybe. We see. Eef feedleman stay, we have contract. He stay, yes?\"\n \n \"Oh, sure,\" I said. \"He'll stay—just as long as you want him.\"\n \n \"Den he sign contract, too. No beeg feedle, no contract.\"\n \n \"Sure. We'll get him to sign it.\" I laughed hollowly. \"Don't worry, Mr. Ke-teeli.\"\n \n Just a few minutes later tragedy struck.\n \n A reporter from the Marsport Times ambled into interview the Man of The Hour. The interview, unfortunately, was conducted over the bar and accompanied by a generous guzzling of beer. Fat Boy, Hammer-Head and I watched from a table. Knowing John as we did, a silent prayer was in our eyes.\n \n \"This is the first time he's talked to anybody,\" Fat Boy breathed.\n\"I—I'm scared.\n \n \"Nothing can happen,\" I said, optimistically. \"This'll be good publicity.\"\n \n We watched.\n \n John murmured something. The reporter, a paunchy, balding man, scribbled furiously in his notebook.\n \n John yawned, muttered something else. The reporter continued to scribble.\n \n John sipped beer. His eyes brightened, and he began to talk more rapidly.\n \n The reporter frowned, stopped writing, and studied John curiously.\n \n John finished his first beer, started on his second. His eyes were wild, and he was talking more and more rapidly.\n \n \"He's doing it,\" Hammer-Head groaned. \"He's telling him!\"\n \n I rose swiftly. \"We better get over there. We should have known better—\"\n \n We were too late. The reporter had already slapped on his hat and was striding to the exit. John turned to us, dazed, his enthusiasm vanishing like air from a punctured balloon.\n \n \"He wouldn't listen,\" he said, weakly. \"I tried to tell him, but he said he'd come back when I'm sober. I'm sober now. So I quit. I've got to find my hole.\"\n \n I patted him on the back. \"No, John, we'll help you. Don't quit. We'll—well, we'll help you.\"\n \n \"We're working on a plan, too,\" said Fat Boy in a burst of inspiration.\n\"We're going to make a more scientific approach.\"\n \n \"How?\" John asked.\n \n Fat Boy gulped.\n \n \"Just wait another day,\" I said.\n\"We'll have it worked out. Just be patient another day. You can't leave now, not after all your work.\"\n \n \"No, I guess not,\" he sighed. \"I'll stay—until tomorrow.\"\n \n \n \n All night the thought crept through my brain like a teasing spider: What can we do to make him stay? What can we tell him? What, what, what?\n \n \n Unable to sleep the next morning, I left John to his snoring and went for an aspirin and black coffee. All the possible schemes were drumming through my mind: finding an Earth blonde to capture John's interest, having him electro-hypnotized, breaking his leg, forging a letter from this mythical university telling him his theory was proved valid and for him to take a nice long vacation now. He was a screwball about holes and force fields and dimensional worlds but for that music of his I'd baby him the rest of his life.\n \n It was early afternoon when I trudged back to my apartment.\n \n John was squatting on the living room floor, surrounded by a forest of empty beer bottles. His eyes were bulging, his hair was even wilder than usual, and he was swaying.\n \n \"John!\" I cried. \"You're drunk!\"\n \n His watery eyes squinted at me.\n\"No, not drunk. Just scared. I'm awful scared!\"\n \n \"But you mustn't be scared. That reporter was just stupid. We'll help you with your theory.\"\n \n His body trembled. \"No, it isn't that. It isn't the reporter.\"\n \n \"Then what is it, John?\"\n \n \"It's my body. It's—\"\n \n \"Yes, what about your body? Are you sick?\"\n \n His face was white with terror.\n\"No, my— my body's full of holes . Suppose it's one of those holes! How will I get back if it is?\"\n \n He rose and staggered to his Zloomph , clutching it as though it were somehow a source of strength and consolation.\n \n I patted him gingerly on the arm.\n\"Now John. You've just had too much beer, that's all. Let's go out and get some air and some strong black coffee. C'mon now.\"\n \n We staggered out into the morning darkness, the three of us. John, the Zloomph , and I.\n \n I was hanging on to him trying to see around and over and even under the Zloomph —steering by a sort of radar-like sixth sense. The street lights on Marsport are pretty dim compared to Earthside. I didn't see the open manhole that the workmen had figured would be all right at that time of night. It gets pretty damned cold around 4: A.M. of a Martian morning, and I guess the men were warming up with a little nip at the bar across the street.\n \n Then—he was gone.\n \n John just slipped out of my grasp— Zloomph and all—and was gone—completely and irrevocably gone. I even risked a broken neck and jumped in the manhole after him. Nothing—nothing but the smell of ozone and an echo bouncing crazily off the walls of the conduit.\n \n \"—is it.—is it.—is it.—is it.\"\n \n John Smith was gone, so utterly and completely and tragically gone it was as if he'd never existed....\n \n \n \n Tonight is our last night at The Space Room . Goon-Face is scowling again with the icy fury of a Plutonian monsoon. As Goon-Face has said, \"No beeg feedle, no contract.\"\n \n Without John, we're notes in a lost chord.\n \n We've searched everything, in hospitals, morgues, jails, night clubs, hotels. We've hounded spaceports and 'copter terminals. Nowhere, nowhere is John Smith.\n \n Ziggy, whose two fingers have healed, has already bowed to what seems inevitable. He's signed up for that trip to Neptune's uranium pits. There's plenty of room for more volunteers, he tells us. But I spend my time cussing the guy who forgot to set the force field at the other end of the hole and let John and his Zloomph back into his own time dimension. I cuss harder when I think how we were robbed of the best bass player in the galaxy.\n \n And without a corpus delecti we can't even sue the city.\n \n \n\n  ... THE END",
      "metadata": {
        "title": "The Holes and John Smith",
        "author": "Edward W. Ludwig",
        "passage_id": "32667",
        "uid": "7459af0a4ef54c098ef864dce47f9cfc",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "104",
                "uid": "f22b89983abb4b42bb2c4b7481881656",
                "response_text": "The setting is primarily at an event space called the Space Room. Jimmie Stanley and his band perform there. They are sitting in the cocktail lounge waiting for the replacement for their fiddle player to arrive. Their boss, Ke-teeli, is upset that the fiddle player is not yet there. He is threatening to not let them play at the venue anymore. Eventually, their replacement player arrives at the venue. However, Jimmie has serious doubts that man will be able to play well because his instrument does not look like a fiddle and he appears disheveled. When the band does play with the new member, John Smith, he and his instrument – the Zloomph – sounds amazing. The audience shows a good reception as does the boss. \n\nJimmie wants John to join the band, but John has other concerns. He continuously mentions holes and seems obsessed over finding holes. Eventually, Jimmie learns why John is interested in holes. John claims that he accidentally went through a hole and left his time dimension. He is in search of holes in order to find his original time dimension. Jimmie attempts to play along with John’s claims and even offers to let John stay at his apartment in order to entice him to join the band. John continues to drink beer and talk about holes during the story. \n\nOne night, Jimmie returns back to his apartment and finds John drunk on the floor. He takes John, and the instrument, outside to calm John down. When they go outside, John and his instrument fall through a hole and are not seen again. Jimmie and the rest of the band assume that John managed to find his way back to his own time zone.  \n"
              },
              {
                "worker_id": "103",
                "uid": "b45689a6445347908c3990d7fd3de34b",
                "response_text": "Jimmie Stanley is the piano player in a band, and the story begins at The Space Room where the band is waiting for a temporary bass fiddle man to arrive. This is because the original bass fiddle man, Ziggy, injured his fingers. The boss Ke-teeli does not seem to like their music that much. Now that a member is missing and the replacement player has not yet arrived, the boss starts to doubt that the three members of the band can perform good music. He doesn’t think that the customers will be satisfied. The band’s contract with the boss ends this week, and the boss does not seem to want to continue the contract. Finally, the temporary bass fiddle player arrives with his instrument. He introduces himself as John Smith and tells them that he is late because he was working on his plan. At first, Jimmie doubt that the ancient bass fiddle can make any beautiful sound. But he becomes very surprised once he hears the beautiful music. The audiences are focused and intrigued by the music. Even the boss becomes delight after hearing the music. Later, John begins to notice the holes on the clarinet and the piano, which seems quite odd to the band. Noting his talents in music and the facial expression on the boss’ face, Jimmie asks John to play for the long term. But John rejects stating that he needs to work on his plan. John mentions that there are many holes in the universe, but he cannot find the right one to go back to prove a point to the University. Believing that Jimmie understands him, he decides to play with the band. The boss agrees to give them the contract if John stays. For the next few days, John becomes popular and then a reporter come to interview him. After telling the reporter about the holes, the reporter decides to leave. Then John tells the band that he will stay until tomorrow. The next day, John is gone. The band searched everywhere, but is not able to find him. "
              },
              {
                "worker_id": "105",
                "uid": "cbe6e2ceb2af4324a75b6b3e0bcb9fc4",
                "response_text": "An Earth music band of four is supposed to play at The Space Room on Mars, but the bass man is injured. The band boss, Ke-teeli, is discontented with the group and won't prolong the contract, he wants to cancel the concert. Jimmie Stanley, the leader of the band, is waiting for the bass man's replacement to save the band. If the band loses the job, they have nowhere to go. After a while of waiting, a huge monstrosity enters The Space Room accompanied by a little guy in a suit, a matchstick. The newcomer is John Smith, the bass man from Mars, who is late because he has been working on his plan of getting back home. When the band starts playing, everyone is enchanted with John's playing, which is the best and the most unique sound they've ever heard. During the intermission, John mentions that his fiddle is over five thousand years old but its hole isn't right for going home. Jimmie is confused with this and the band continues playing. John stares at the holes in the instruments of the rest of the band. At intermission Jimmie offers John a drink to urge him to join the band. John is unwilling to accept the offer as he is more interested in history and his plan than in music. Turns out he fell into a hole a while ago and now he can't get back to his time dimension. For three days John plays with the band and talks of holes to Jimmie, whom he sees as an understanding person. Then John is interviewed and the reporter won't listen about his holes, so he decides to quit the band and continue searching for them. Next day Jimmie leaves for a while thinking about how to urge the bass man to stay, and when he returns, John is drunk with beer. The two go out and suddenly John disappears. The band can't find him anywhere and their contract ends. \n"
              },
              {
                "worker_id": "107",
                "uid": "d31d012b3e82492b95534469f4621eb5",
                "response_text": "The story begins on a Saturday night at The Space Room. Jimmie Stanley and two other members of his band are sitting in the bandstand of the cocktail lounge. The bass fiddle man, Ziggy, is not present because he had almost sliced his fingers off while opening a can of Santurnian ice-fish. The boss Ke-teeli, also known as Goon-Face, is furious that no music is being played at the establishment. They explain that a Marsport local has been called a stand-in for the bassist, while Ke-teeli is suspicious. John Smith from the Marsport union comes in shortly after. Jimmie is intimidated by his bass fiddle, and John Smith explains that he knows how to play everything. As they begin playing, John Smith plays a whole chord with each beat on his bass. The customers are in some trance, and even bland-faced Martians begin nodding in time to the rhythm. After their performance, John Smith explains that his instrument is over five thousand years old, and it is not a fiddle but the only Zloomph in existence. He points out the holes on the other band member’s instruments. Jimmie tries to convince him to join the combo, but John explains that he does not care much for playing even when Jimmie offers to share his apartment. He is focused on his plan, which involves studying holes and how they relate to the universe. John further explains that he fell through his time dimension while hurrying back to the University with his Zloomph to prove something in ancient history. Jimmie agrees to listen to him if he plays with them, which makes John extremely happy. John becomes extremely popular with all of the customers, and Goon-Face tells Jimmie that they will continue to have their contract if the bass fiddle man stays. A reporter approaches John for an interview over beer, and he tries to tell him his plan. However, it turns out that the reporter does not understand, and John is down again. Fat Boy exclaims that they are also working on a plan in an attempt to make him stay. As Jimmie thinks about what can make John stay, he comes up with a variety of plans. As he returns to his apartment in the early afternoon, he finds John squatting on the floor and surrounded by beer bottles. John is scared because he is covered in holes, but Jimmie is not convinced and takes him out to get some fresh air. It is four AM in the morning; suddenly, John disappears through the manhole with his Zloomph. Jimmie jumps into it after him, but he has completely disappeared without a trace. Goon-Face does not offer them another contract, and they desperately search everywhere for John. Ziggy, now healed, signs up for a trip to the uranium pits, and Jimmie is furious at whoever let John back to his time dimension. However, he knows that they cannot sue the city without a corpus delecti. "
              }
            ]
          },
          {
            "question_text": "Why is John Smith interested in holes?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "104",
                "uid": "f22b89983abb4b42bb2c4b7481881656",
                "response_text": "John Smith is interested in holes because he wants to go back to his own time dimension. He explains to Jimmie that his colleagues did not believe that before the tapes, instruments that played music existed. He further details that on his way back to the University with his instrument, the Zloomph, he fell through a hole and out of his own time dimension. He states that a researcher is to blame for not securing a force field over the hole to prevent someone from falling through. John Smith is interested in holes because he believes that any hole could potentially bring him back to his own time dimension so that he can prove that this theory was credit. He does not want people to think that he was wrong. "
              },
              {
                "worker_id": "103",
                "uid": "b45689a6445347908c3990d7fd3de34b",
                "response_text": "He is interested in the holes because he needs to find the correct one in order to go home. He mentions that the foundation of their cultures is based on the history of all the time dimensions. The different dimensions are interwoven and the holes can provide insights into the different dimensions. Similar to time or space travel. Back in his time, he was proving a point to the University, but some researcher forgot to set a force-field for the hole, thus, he fell through the hole into Jimmie’s time. He needs to go back immediately. If he doesn’t, the University will think that he cannot prove his theory and ran away. But because everything are made up of holes – even his body has holes – John becomes worried of not able to find the correct one. "
              },
              {
                "worker_id": "105",
                "uid": "cbe6e2ceb2af4324a75b6b3e0bcb9fc4",
                "response_text": "John Smith desperately wants to return home and believes that finding the right hole is the way. There are many time dimensions interwoven through the ages and the holes let people travel between and study them. Such a hole may be anything, so it's almost impossible to find the inter-dimensional one. John fell into one in the dark in his dimension, that way he showed up in this place, but he wants to return, so he studies every hole. The fall prevented John from proving his point about ancient history to some scientists and he doesn't want them to consider him a coward. He needs to return to his dimension and prove the point. "
              },
              {
                "worker_id": "107",
                "uid": "d31d012b3e82492b95534469f4621eb5",
                "response_text": "John Smith is interested in holes because he believes that he can return to his time dimension through the right one. During his conversation with Jimmie, he explains that holes are a first-hand method of studying time dimensions and cultures. All of the objects around them, including the beer bottles, doors, caves, animal holes, mines, faces, and clothes, all have millions of holes. However, even with all of these holes, John is desperate because he cannot find the right one to return home. He blames his initial travel on some fool of a researcher who forgot to set a force-fold over the hole that he fell through in his dimension. "
              }
            ]
          },
          {
            "question_text": "What is the relationship between The Goon and the band?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "104",
                "uid": "f22b89983abb4b42bb2c4b7481881656",
                "response_text": "The Goon has many names and is also referred to as Ke-teeli and The Face. Ke-teeli is the boss of the three current members of the band, one member is out because he is injured. Ke-teeli owns an establishment that the band performs at. However, Ke-teeli repeatedly expresses his frustration and distaste over the band’s music. Jimmie Stanley believes that Ke-teeli is really more unhappy with the lack of money that his establishment, The Space Room, is earning. \n\nWhen John Smith joins the band with his Zloomph instrument, The Goon seems to respond well. More cash is flowing into the business as the audience agrees with the music. However, The Goon will not let the bandmates sign a contract with him for their unemployment unless they can guarantee that John Smith and his Zloomph instrument will join them. \n"
              },
              {
                "worker_id": "103",
                "uid": "b45689a6445347908c3990d7fd3de34b",
                "response_text": "The Goon is the boss of the band. He is upset that the bass fiddle man is missing. Jimmie mentions that The Goon will be angry if he finds out that there’s a cigarette hole burned in it. The band sometimes refers The Goon as Goon-Face and The Eye. This is the last week before the band’s contract with The Goon ends. The band is worried that The Goon will not continue the contract since he has been showing little enthusiasm for their music. He always comment either too fast and loud or too slow and soft. He even states that it is better to have the customers disappointed than have them hear bad music. After he sees The Goon staring at them, Jimmie decides to start playing. Once The Goon hears the beautiful music played by John, he looks very surprised and is enjoying it. In the end, The Goon states that there will be a contract if the fiddle player comes as well. "
              },
              {
                "worker_id": "105",
                "uid": "cbe6e2ceb2af4324a75b6b3e0bcb9fc4",
                "response_text": "Goon-Face is the boss of the band. He is a business man and is looking only for profit, which doesn't satisfy him. The contract is ending soon and he doesn't see the reason in prolonging it. He is very irritable and considers the band's music bad. He liked John, but without him he doesn't need the band. He is cold and direct, his speech is concise. It's impossible to convince him or beg for something, he stays indifferent. "
              },
              {
                "worker_id": "107",
                "uid": "d31d012b3e82492b95534469f4621eb5",
                "response_text": "Goon-Face runs The Space Room and is considered to be the boss of the band. They have a contract with him to play their music at the establishment. However, Goon-Face is initially very displeased by the fact that there are only three members present. He is also unwilling to renew the contract and constantly criticizes the band’s music. Jimmie believes that the real reason is that there is not enough business in the establishment. Even when Jimmie says that the three of them will continue to play, if the fourth does not show up, Goon-Face is not impressed and says that having no music is better than bad music. He even tells them that if no bassist shows up, then they will go home. Once John Smith plays, he is pleased and beams like a kitten who has seen a quart of cream. Business begins to get better, but he is still cautious of the contract. He tells the band that he will only continue their contract if John Smith stays and signs it. After John disappears, he is furious again and refuses to discuss any contract because the bass fiddle man is gone. "
              }
            ]
          },
          {
            "question_text": "Why is it important to Jimmie for John to continue playing with the band?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "104",
                "uid": "f22b89983abb4b42bb2c4b7481881656",
                "response_text": "Jimmie’s friend, Hammer-Head talks about the black puts of Neptune as a place that he and the rest of the band will likely go to if they do not secure a contract with The Goon. The black pits of Neptune is a place for musicians that are past their prime. \n\nThe Goon does not enjoy the band’s music and threatens to not let them play at his establishment anymore. However, The Goon likes the music when John Smith plays with the band and especially the reception of the audience when John Smith is playing with the band. The Goon says that he will give the band a contract as long as John Smith agrees to join with his Zloomph. It is important to Jimmie for John to continue playing with the band so that they can get an employment contract from The Goon. \n"
              },
              {
                "worker_id": "103",
                "uid": "b45689a6445347908c3990d7fd3de34b",
                "response_text": "It is important for Jimmie to continue playing with the band because the boss was not satisfied with their music before his arrival. Their contract ends this week, but it seems the boss is unlikely to continue it. After he plays his music on the bass fiddle, the boss is surprised by it. He enjoys the music. The audiences also like it. Noticing the change in the boss’ attitude towards the music, Jimmie knows that he has to persuade John to join the band in order to get a contract. Later, the boss explicitly states that there will be a contract if the bass fiddle man stays, else there won’t be any. Thus, Jimmie has to make John stay in the band. "
              },
              {
                "worker_id": "105",
                "uid": "cbe6e2ceb2af4324a75b6b3e0bcb9fc4",
                "response_text": "The future of the whole band depends on John. The bass man hurt his fingers and he needs replacement. John is much better that the bass men, his music is extremely unique and even the most indifferent people in the room pay attention to it. Everyone adores him playing, without him the band was never really popular. Their concerts were not payed off well, their music didn't touch people, their boss was discontented. Their contract is ending and to prolong it they need John. Jimmie cares for the future of his band and the contract a lot as they can't do any other job and unsuccessful musicians can only go to the uranium pits of Neptune, where life is short. They don't even have money for fare. "
              },
              {
                "worker_id": "107",
                "uid": "d31d012b3e82492b95534469f4621eb5",
                "response_text": "It is important to Jimmie for John to continue playing because the band will be allowed to continue playing in The Space Room and get their contracts renewed with Goon-Face. He considers John to be the best bass player in the galaxy and wants him to continue so the band can continue to earn a living. Jimmie even offers John a place to stay and doesn’t mind babying him for the rest of his life if it means that the other man will continue to play the bass. His plans include breaking John’s leg, finding an Earth blonde to capture his interest, or even forging a letter from the University to tell him that his theory is valid as a means of getting the man to stay. "
              }
            ]
          },
          {
            "question_text": "Describe John Smith and his instrument.",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "104",
                "uid": "f22b89983abb4b42bb2c4b7481881656",
                "response_text": "John Smith is a human from Earth that is described as a very shot guy with a broad face and light blue eyes. He works with the Marsport union. When he enters the Space Room establishment, he is dressed in a tight black suit and is carrying his instrument, the Zloomph. John states that the Zloomph that he carries is an instrument that is over five thousand years old. He excitedly states that he found it in a pawn shop and that it’s the only one in existence. \n\nThe Zloomph itself is described as being incredibly large, and very black. The tones that emitted from it were jazz-like and received well by the band, the audience, and The Goon. \n"
              },
              {
                "worker_id": "103",
                "uid": "b45689a6445347908c3990d7fd3de34b",
                "response_text": "John’s instrument is large, black, and old. It is taller and wider than a normal bass fiddle. It’s shape is odd, looking like a black hour-glass. It has black, mirror-like wood. The music coming out of this instrument is beautiful. It is heavenly with depth, volume and richness. John calls it a Zloomph and mentions its uniqueness. John Smith is a little man, he is described as a matchstick. His face is flat and broad. He has sandcolored hair that is quite messy, long and dry. His blue eyes are watery. He wears a black color tightfitting suit. He is between twenty and forty. He speaks quickly. He does not like Venusian fizz and wine-syrup, but enjoys beer. He has a dreamy expression when playing music on his instrument. John is always noticing holes that seems common to everyone else. He does not care much about playing music, instead he likes to study ancient history and he needs to finish his plan, which is finding the correct hole. Because he needs to go back to his world to prove a theory. "
              },
              {
                "worker_id": "105",
                "uid": "cbe6e2ceb2af4324a75b6b3e0bcb9fc4",
                "response_text": "John Smith is a bass fiddle, he is huge and looks like a monster, he looks disgusting. His instrument is over five thousand years, it's a Zloomph with a matchstick as old. The man has pale blue eyes and his age is indeterminable. He is silent almost all the time, but he loves beer, and it makes him talk. He mostly talks about the holes, as he is desperately seeking for the trans-dimensional one to get back to his time dimension. All the time he makes plans about it, also he is interested in history and proving theories about it. He is a great player, who makes everyone around listen with admiration and full attention, but music isn't his main passion. "
              },
              {
                "worker_id": "107",
                "uid": "d31d012b3e82492b95534469f4621eb5",
                "response_text": "John Smith is physically described as a little guy similar to an animated matchstick. He has a flat, broad face that seems to have been compressed in a vice. His mop of hair is sand-colored, and Jimmie is reminded of a field of dry grass with strands that form loops to the side of his face. He also has pale, watery blue eyes and wears a tight-fitting black suit. Jimmie says it is impossible to guess his age as he could be anywhere between twenty and forty. When John speaks, it is shrill and rapid. However, when he talks about the holes and his ancient history theories, he becomes much more enthusiastic and lights up. Other than those times, he is quite silent and has sad eyes. The others find him eccentric, but they want to keep him around because of his bass-playing abilities. His instrument is called a Zloomph. It is an enormous black monstrosity, and Jimmie thinks it came from a pawnbroker’s attic. It is a queerly-shaped bass fiddle. It is also too tall and too wide. John says the Zloomph is over five thousand years old and is the only one in existence. It can play any song, and the sound that comes out of it is the whole chord instead of just a single note. When Jimmie listens to it, he feels his blood tingling with each plucked note. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 3561,
        "document_length_chars": 20666
      }
    }
  ]
}