{
  "item_metadata": {
    "item_id": "32890",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "32890",
      "content": "HOME IS WHERE YOU LEFT IT\n \n\n By ADAM CHASE\n \n \n [Transcriber Note: This etext was produced from Amazing Stories February\n1957. Extensive research did not uncover any evidence that the U.S.\n copyright on this publication was renewed.]\n \n \n\n The chance of mass slaughter was their eternal nightmare.\n \n\n\n How black is the blackest treachery? Is the most callous\n traitor entitled to mercy? Steve pondered these questions. His decision?\n That at times the villain should possibly be spoken of as a hero.\n \n \n Only the shells of deserted mud-brick houses greeted Steve Cantwell when\n he reached the village.\n \n He poked around in them for a while. The desert heat was searing,\n parching, and the Sirian sun gleamed balefully off the blades of Steve's\n unicopter, which had brought him from Oasis City, almost five hundred\n miles away. He had remembered heat from his childhood here on Sirius'\n second planet with the Earth colony, but not heat like this. It was like\n a magnet drawing all the moisture out of his body.\n \n He walked among the buildings, surprise and perhaps sadness etched on\n his gaunt, weather-beaten face. Childhood memories flooded back: the\n single well from which all the families drew their water, the mud-brick\n house, hardly different from the others and just four walls and a roof\n now, in which he'd lived with his aunt after his parents had been killed\n in a Kumaji raid, the community center where he'd spent his happiest\n time as a boy.\n \n He went to the well and hoisted up a pailful of water. The winch creaked\n as he remembered. He ladled out the water, suddenly very thirsty, and\n brought the ladle to his lips.\n \n He hurled the ladle away. The water was bitter. Not brackish.\n \n Poisoned.\n \n He spat with fury, then kneeled and stuffed his mouth with sand, almost\n gagging. After a while he spat out the sand too and opened his canteen\n and rinsed his mouth. His lips and mouth were paralyzed by contact with\n the poison. He walked quickly across the well-square to his aunt's\n house. Inside, it was dim but hardly cooler. Steve was sweating, the\n saline sweat making him blink. He scowled, not understanding. The table\n was set in his aunt's house. A coffeepot was on the stove and last\n night's partially-consumed dinner still on the table.\n \n The well had been poisoned, the town had been deserted on the spur of\n the moment, and Steve had returned to his boyhood home from Earth—too\n late for anything.\n \n He went outside into the square. A lizard was sunning itself and staring\n at him with lidless eyes. When he moved across the square, the lizard\n scurried away.\n \n \"Earthman!\" a quavering voice called.\n \n Steve ran toward the sound. In the scant shadow of the community center,\n a Kumaji was resting. He was a withered old man, all skin and bones and\n sweat-stiffened tunic, with enormous red-rimmed eyes. His purple skin,\n which had been blasted by the merciless sun, was almost black.\n \n Steve held the canteen to his lips and watched his throat working almost\n spasmodically to get the water down. After a while Steve withdrew the\n canteen and said:\n \n \"What happened here?\"\n \n \"They're gone. All gone.\"\n \n \"Yes, but what happened?\"\n \n \"The Kumaji—\"\n \n \"You're Kumaji.\"\n \n \"This is my town,\" the old man said. \"I lived with the Earthmen. Now\n they're gone.\"\n \n \"But you stayed here—\"\n \n \"To die,\" the old man said, without self-pity. \"I'm too old to flee, too\n old to fight, too old for anything but death. More water.\"\n \n \n \n Steve gave him another drink. \"You still haven't told me what happened.\"\n Actually, though, Steve could guess. With the twenty-second century\n Earth population hovering at the eleven billion mark, colonies were\n sought everywhere. Even on a parched desert wasteland like this. The\n Kumaji tribesmen had never accepted the colony as a fact of their life\n on the desert, and in a way Steve could not blame them. It meant one\n oasis less for their own nomadic sustenance. When Steve was a boy,\n Kumaji raids were frequent. At school on Earth and Luna he'd read about\n the raids, how they'd increased in violence, how the Earth government,\n so far away and utterly unable to protect its distant colony, had\n suggested withdrawal from the Kumaji desert settlement, especially since\n a colony could exist there under only the most primitive conditions,\n almost like the purple-skinned Kumaji natives themselves.\n \n \"When did it happen?\" Steve demanded.\n \n \"Last night.\" It was now midafternoon. \"Three folks died,\" the Kumaji\n said in his almost perfect English, \"from the poisoning of the well. The\n well was the last straw. The colonists had no choice. They had to go,\n and go fast, taking what little water they had left in the houses.\"\n \n \"Will they try to walk all the way through to Oasis City?\" Oasis City,\n built at the confluence of two underground rivers which came to the\n surface there and flowed the rest of the way to the sea above ground,\n was almost five hundred miles from the colony. Five hundred miles of\n trackless sands and hundred-and-thirty-degree heat....\n \n \"They have to,\" the old man said. \"And they have to hurry. Men, women\n and children. The Kumaji are after them.\"\n \n \n \n Steve felt irrational hatred then. He thought it would help if he could\n find some of the nomadic tribesmen and kill them. It might help the way\n he felt, he knew, but it certainly wouldn't help the fleeing colonists,\n trekking across a parched wilderness—to the safety of Oasis City—or\n death.\n \n \"Come on,\" Steve said, making up his mind. \"The unicopter can hold two\n in a pinch.\"\n \n \"You're going after them?\"\n \n \"I've got to. They're my people. I've been away too long.\"\n \n \"Say, you're young Cantwell, aren't you? Now I remember.\"\n \n \"Yes, I'm Steve Cantwell.\"\n \n \"I'm not going anyplace, young fellow.\"\n \n \"But you can't stay here, without any good water to drink, without—\"\n \n \"I'm staying,\" the old man said, still without self-pity, just\n matter-of-factly. \"The Earth folks have no room for me and I can't blame\n'em. The Kumaji'll kill me for a renegade, I figure. I lived a good,\n long life. I've no regrets. Go after your people, young fellow. They'll\n need every extra strong right arm they can get. You got any weapons?\"\n \n \"No,\" Steve said.\n \n \"Too bad. Well, good-bye and good luck.\"\n \n \"But you can't—\"\n \n \"Oh, I'm staying. I want to stay. This is my home. It's the only home\n I'll ever have. Good luck, young fellow.\"\n \n Slowly, Steve walked to his unicopter. It was nothing more than a small\n metal disk on which to stand, and a shaft with four turbo-blades. It\n could do sixty miles an hour at an elevation of two thousand feet.\n \n \n \n Steve turned the little turbo-jet engine over, then on impulse ran back\n to the old man and gave him his canteen, turning away before it could be\n refused and striding quickly back to the unicopter and getting himself\n airborne without looking at the deserted village or the old man again.\n \n The old man's voice called after him: \"Tell the people ... hurry ...\n Kumaji looking for them to kill ... desert wind ought to wipe out their\n trail ... but hurry....\"\n \n The voice faded into the faint rushing sound of the hot desert wind.\n Steve gazed down on bare sun-blasted rock, on rippled dunes, on\n hate-haze. He circled wider and wider, seeking his people.\n \n Hours later he spotted the caravan in the immensity of sand and\n wasteland. He brought the unicopter down quickly, with a rush of air and\n a whine of turbojets. He alighted in the sand in front of the\n slow-moving column. It was like something out of Earth's Middle\n East—and Middle Ages. They had even imported camels for their life here\n on the Sirian desert, deciding the Earth camel was a better beast of\n burden than anything the Sirius II wastelands had to offer. They walked\n beside the great-humped beasts of burden, the animals piled high with\n the swaying baggage of their belongings. They moved through the sands\n with agonizing slowness. Already, after only one day's travel, Steve\n could see that some of the people were spent and exhausted and had to\n ride on camelback. They had gone perhaps fifteen miles, with almost five\n hundred to go across searing desert, the Kumaji seeking them....\n \n \"Hullo!\" Steve shouted, and a man armed with an atorifle came striding\n clumsily through the sand toward him. \"Cantwell's the name,\" Steve said.\n\"I'm one of you.\"\n \n Bleak hostility in his face, the man approached. \"Cantwell. Yeah, I\n remember you. Colony wasn't good enough for young Steve Cantwell. Oh,\n no. Had to go off to Earth to get himself educated. What are you doing\n here now on that fancy aircraft of yours, coming to crow at our wake?\"\n \n The bitterness surprised Steve. He recognized the man now as Tobias\n Whiting, who had been the Colony's most successful man when Steve was a\n boy. Except for his bitterness and for the bleak self-pity and defeat in\n his eyes, the years had been good to Tobias Whiting. He was probably in\n his mid-forties now, twenty years Steve's senior, but he was\n well-muscled, his flesh was solid, his step bold and strong. He was a\n big muscular man with a craggy, handsome face. In ten years he had\n hardly changed at all, while Steve Cantwell, the boy, had become Steve\n Cantwell the man. He had been the Colony's official trader with the\n Kumajis, and had grown rich—by colony standards—at his business. Now,\n Steve realized, all that was behind him, and he could only flee with the\n others—either back to the terribly crowded Earth or on in search of a\n new colony on some other outworld, if they could get the transportation.\n Perhaps that explained his bitterness.\n \n \"So you've come back, eh? You sure picked a time, Cantwell.\"\n \n The refugees were still about a quarter of a mile off, coming up slowly.\n They hardly seemed to be moving at all. \"Is my aunt all right?\" Steve\n said. She was the only family he remembered.\n \n Tobias Whiting shook his head slowly. \"I hate to be the one to tell you\n this. Brace yourself for a shock. Your aunt was one of those who died\n from the poisoned water last night.\"\n \n For a long moment, Steve said nothing. The only emotion he felt was\n pity—pity for the hard life his aunt had lived, and the hard death.\n Sadness would come later, if there was to be a time for sadness.\n \n \n \n The caravan reached them then. The first person Steve saw was a girl.\n She wore the shroud-like desert garment and her face—it would be a\n pretty face under other circumstances, Steve realized—was etched with\n lines of fatigue. Steve did not recognize her. \"Who is he, Dad?\" the\n girl said.\n \n \"Young Cantwell. Remember?\"\n \n So this was Mary Whiting, Steve thought. Why, she'd been a moppet ten\n years ago! How old? Ten years old maybe. The years crowded him suddenly.\n She was a woman now....\n \n \"Steve Cantwell?\" Mary said. \"Of course I remember. Hello, Steve. I—I'm\n sorry you had to come back at a time like this. I'm sorry about your\n aunt. If there's anything I can do....\"\n \n Steve shook his head, then shook the hand she offered him. She was a\n slim, strong girl with a firm handshake. Her concern for him at a time\n like this was little short of amazing, especially since it was\n completely genuine.\n \n He appreciated it.\n \n Tobias Whiting said: \"Shame of it is, Cantwell, some of us could get\n along with the Kumaji. I had a pretty good business here, you know\n that.\" He looked with bitterness at the dusty file of refugees. \"But I\n never got a credit out of it. Wherever we wind up, my girl and I will be\n poor again. We could have been rich.\"\n \n Steve asked, \"What happened to all your profits?\"\n \n \"Tied up with a Kumaji moneylender, but thanks to what happened I'll\n never see it again.\"\n \n Mary winced, as if her father's words and his self-pity were painful to\n her. Then others came up and a few minutes were spent in back-pounding\n and hand-shaking as some of the men who had been boys with Steve came up\n to recognize and be recognized. Their greeting was warm, as Tobias\n Whiting's had been cool. Despite the knowledge of what lay behind all of\n them, and what still lay ahead, it was a little like homecoming.\n \n But Steve liked Mary Whiting's warm, friendly smile best of all. It was\n comforting and reassuring.\n \n \n \n Three days later, Tobias Whiting disappeared.\n \n The caravan had been making no more than ten or fifteen miles a day.\n Their water supply was almost gone but on the fourth day they hoped to\n reach an oasis in the desert. Two of the older folks had died of\n fatigue. A third was critically ill and there was little that could be\n done for him. The food supply was running short, but they could always\n slaughter their camels for food and make their way to Oasis City, still\n four hundred and some miles away, with nothing but the clothes on their\n backs.\n \n And then, during the fourth night, Tobias Whiting disappeared, taking\n Steve's unicopter. A sentry had heard the low muffled whine of the\n turbojets during the night and had seen the small craft take off, but\n had assumed Steve had taken it up for some reason. Each day Steve had\n done so, reconnoitering for signs of the Kumaji.\n \n \"But why?\" someone asked. \"Why?\"\n \n At first there was no answer. Then a woman whose husband had died the\n day before said: \"It's no secret Whiting has plenty of money—with the\n Kumaji.\"\n \n None of them looked at Mary. She stood there defiantly, not saying\n anything, and Steve squeezed her hand.\n \n \"Now, wait a minute,\" one of Whiting's friends said.\n \n \"Wait, nothing.\" This was Jeremy Gort, who twice had been mayor of the\n colony. \"I know how Whiting's mind works. He slaved all his life for\n that money, that's the way he'll see it. Cantwell, didn't you say the\n Kumaji were looking for us, to kill us?\"\n \n \"That's what I was told,\" Steve said.\n \n \"All right,\" Gort went on relentlessly. \"Then this is what I figure must\n have happened. Whiting got to brooding over his lost fortune and finally\n decided he had to have it. So, he went off at night in Cantwell's\n'copter, determined to get it. Only catch is, folks, if I know the\n Kumaji, they won't just give it to him—not by a long sight.\"\n \n \"No?\" someone asked.\n \n \"No sir. They'll trade. For our location. And if Whiting went off like\n that without even saying good-bye to his girl here, my guess is he'll\n make the trade.\" His voice reflected some bitterness.\n \n \n \n Mary went to Gort and slapped his face. The elderly man did not even\n blink. \"Well,\" he asked her gently, \"did your pa tell you he was going?\"\n \n \"N-no,\" Mary said. There were tears in her eyes, but she did not cry.\n \n Gort turned to Steve. \"Cantwell, can he get far in that 'copter?\"\n \n Steve shook his head. \"Ten or fifteen miles is all. Almost out of fuel,\n Mr. Gort. You saw how I took her up for only a quick mile swing each\n day. He won't get far.\"\n \n \"He'll crash in the desert?\"\n \n \"Crash or crash-land,\" Steve said.\n \n Mary sobbed, and bit her lip, and was silent.\n \n \"We've got to stop him,\" Gort said. \"And fast. If he gets to the Kumaji,\n they'll send down a raiding party and we'll be finished. We could never\n fight them off without the protection of our village. Near as I can\n figure, there's a Kumaji base fifty miles due north of here. Whiting\n knows it too, so that's where he'll be going, I figure. Can't spare more\n than a couple of men to look for him, though, in case the Kumaji find\n us—or are led to us—and attack.\"\n \n Steve said, \"I should have taken something out of the 'copter every\n night, so it couldn't start. I'll go.\"\n \n Mary came forward boldly. \"I have to go. He's my father. If he crashed\n out there, he may be hurt. He may be—dying.\"\n \n Gort looked at her. \"And if he's trying to sell us out to the Kumajis?\"\n \n \"Then—then I'll do whatever Steve asks me to. I promise.\"\n \n \"That's good enough for me,\" Steve said.\n \n A few minutes later, armed with atorifles and their share of the food\n and water that was left, Steve and Mary set out northward across the\n sand while the caravan continued east. Fear of what they might find\n mounted.\n \n \n \n The first night, they camped in the lee of low sandhills. The second\n night they found a small spring with brackish but drinkable water. On\n the third day, having covered half the distance to the Kumaji\n settlement, they began to encounter Kumaji patrols, on foot or thlotback , the six-legged desert animals running so swiftly over the\n sands and so low to the ground that they almost seemed to be gliding.\n Steve and Mary hardly spoke. Talk was unnecessary. But slowly a bond\n grew between them. Steve liked this slim silent girl who had come out\n here with him risking her life although she must have known deep in her\n heart that her father had almost certainly decided to turn traitor in\n order to regain his fortune.\n \n On the fourth day, they spotted the unicopter from a long way off and\n made their way toward it. It had come much further than Steve had\n expected. With sinking heart he realized that Tobias Whiting, if he\n escaped the crash-landing without injury, must surely have reached the\n Kumaji encampment by now.\n \n \"It doesn't seem badly damaged,\" Mary said.\n \n The platform had buckled slightly, the 'copter was tilted over, one of\n the rotors twisted, its end buried in sand. Tobias Whiting wasn't there.\n \n \"No,\" Steve said. \"It's hardly damaged at all. Your father got out of it\n all right.\"\n \n \"To go—to them?\"\n \n \"I think so, Mary. I don't want to pass judgment until we're sure. I'm\n sorry.\"\n \n \"Oh, Steve! Steve! What will we do? What can we do?\"\n \n \"Find him, if it isn't too late. Come on.\"\n \n \"North?\"\n \n \"North.\"\n \n \"And if by some miracle we find him?\"\n \n Steve said nothing. The answer—capture or death—was obvious. But you\n couldn't tell that to a traitor's daughter, could you?\n \n As it turned out, they did not find Tobias Whiting through their own\n efforts. Half an hour after setting out from the unicopter, they were\n spotted by a roving band of Kumajis, who came streaking toward them on\n their thlots . Mary raised her atorifle, but Steve struck the barrel\n aside. \"They'd kill us,\" he said. \"We can only surrender.\"\n \n They were hobbled and led painfully across the sand. They were taken\n that way to a small Kumaji encampment, and thrust within a circular\n tent.\n \n Tobias Whiting was in there.\n \n \n \n \"Mary!\" he cried. \"My God! Mary....\"\n \n \"We came for you, Dad,\" she said coldly. \"To stop you. To ... to kill\n you if necessary.\"\n \n \"Mary....\"\n \n \"Oh, Dad, why did you do it? Why?\"\n \n \"We couldn't start all over again, could we? You have a right to live\n the sort of life I planned for you. You....\"\n \n \"Whiting,\" Steve said, \"did you tell them yet?\"\n \n \"No. No, I haven't. I have information to trade, sure. But I want to\n make sure it's going to the right people. I want to get our....\"\n \n \"Dad! Our money, and all those deaths?\"\n \n \"It doesn't matter now. I—I had changed my mind, Mary. Truly. But now,\n now that you're a prisoner, what if I don't talk? Don't you see, they'll\n torture you. They'll make you talk. And that way—we get nothing. I\n couldn't stand to see them hurt you.\"\n \n \"They can do—what they think they have to do. I'll tell them nothing.\"\n \n \"You won't have to,\" Whiting said. \"I'll tell them when we reach the\n larger settlement. They're taking us there tomorrow, they told me.\"\n \n \"Then we've got to get out of here tonight,\" Steve said.\n \n The low sun cast the shadow of their guard against the thlot skin wall\n of their tent. He was a single man, armed with a long, pike-like weapon.\n When darkness came, if the guard were not increased....\n \n They were brought a pasty gruel for their supper, and ate in silence and\n distaste, ate because they needed the strength. Mary said, \"Dad, I don't\n want you to tell them anything. Dad, please. If you thought you were\n doing it for me....\"\n \n \"I've made up my mind,\" Tobias Whiting said.\n \n Mary turned to Steve, in despair. \"Steve,\" she said. \"Steve.\n Do—whatever you have to do. I—I'll understand.\"\n \n Steve didn't answer her. Wasn't Whiting right now? he thought. If Steve\n silenced him, wouldn't the Kumaji torture them for the information?\n Steve could stand up to it perhaps—but he couldn't stand to see them\n hurt Mary. He'd talk if they did that....\n \n Then silencing Whiting wasn't the answer. But the Kumajis had one\n willing prisoner and two unwilling ones. They knew that. If the willing\n one yelled for help but the yelling was kept to a minimum so only one\n guard, the man outside, came....\n \n \n \n Darkness in the Kumaji encampment.\n \n Far off, a lone tribesman singing a chant old as the desert.\n \n \"Are you asleep?\" Mary asked.\n \n \"No,\" Steve said.\n \n \"Dad is. Listen to the way he's breathing—like a baby. As if—as if he\n wasn't going to betray all our people. Oh, I hate him, I hate him!\"\n \n Steve crawled to where the older man was sleeping. Tobias Whiting's\n voice surprised him. \"I'm not asleep. I was thinking. I—\"\n \n \"I'm going to kill you,\" Steve said very softly, and sprang at Whiting.\n He paused, though. It was a calculated pause, and Whiting cried out as\n Steve had hoped he would. Then his hands found the older man's throat\n and closed there—not to kill him but to keep him from crying out again.\n \n Sand stirred, the tentflap lifted, and a bulky figure rushed inside.\n Steve got up, met him halfway, felt the jarring contact of their bodies.\n The pike came up dimly in the darkness, the point scraping against\n Steve's ribs as the guard lunged awkwardly. Steve's fingers sought the\n thick-muscled neck, clamped there—squeezing.\n \n The guard writhed. His feet drummed the sand. With one hand he stabbed\n out wildly with the unwieldy pike. There was a cry from Mary and the\n guard managed a low squawking noise. Outside, the rest of the camp\n seemed undisturbed. There was death in Steve's strong tightening\n fingers. There had to be death there. Death for the Kumaji guard—or\n death for the fleeing Earthmen, who had lost one colony and must seek\n another.\n \n \n \n They fell together on the sand, the guard still struggling. Steve\n couldn't release his throat to grab the pike. The guard stabbed out\n awkwardly, blindly with it, kicking up sand. Then Tobias Whiting moaned,\n but Steve hardly heard him.\n \n When the guard's legs stopped drumming, Steve released him. The man was\n either dead or so close to death that he would be out for hours. Steve\n had never killed a man before, had never in violence and with intent to\n kill attacked a man....\n \n \"Steve!\"\n \n It was Mary, calling his name and crying.\n \n \"It's Dad. Dad was—hit. The pike, a wild stab. He's hit bad—\"\n \n Steve crawled over to them. It was very dark. He could barely make out\n Tobias Whiting's pain-contorted face.\n \n \"My stomach,\" Whiting said, gasping for breath. \"The pain....\"\n \n Steve probed with his hands, found the wound. Blood was rushing out. He\n couldn't stop it and he knew it and he thought Whiting knew it too. He\n touched Mary's hand, and held it. Mary sobbed against him, crying\n softly.\n \n \"You two ...\" Whiting gasped. \"You two ... Mary, Mary girl. Is—he—what\n you want?\"\n \n \"Yes, Dad. Oh, yes!\"\n \n \"You can get her out of here, Cantwell?\"\n \n \"I think so,\" Steve said.\n \n \"Then go. Go while you can. I'll tell them—due south. The Earthmen are\n heading due south. They'll go—south. They won't find the caravan.\n You'll—all—get away. If it's—what you want, Mary.\"\n \n She leaned away from Steve, kissing her father. She asked Steve: \"Isn't\n there anything we can do for him?\"\n \n Steve shook his head. \"But he's got to live long enough to tell them, to\n deceive them.\"\n \n \"I'll live long enough,\" Whiting said, and Steve knew then that he\n would. \"Luck to—all of you. From a—very foolish—man....\"\n \n \n \n Steve took Mary's hand and pulled her out into the hot, dark, wind-blown\n night. He carried the dead Kumaji's pike and they slipped across the\n sand to where the thlots were hobbled for the night. He hardly\n remembered the rest of it. There was violence and death, but necessary\n death. He killed a man with the pike, and unhobbled one of the thlots .\n The animal screamed and two more Kumajis came sleepily through the night\n to see what was the matter. With the long edge of the pike's blade he\n decapitated one of them. He slammed the shaft of the weapon across the\n other's face, probably breaking his jaw. The camp was in a turmoil. In\n the darkness he flung Mary on the thlot's bare back in front of him,\n and they glided off across the sand.\n \n Pursuit was disorganized—and unsuccessful. It was too dark for\n effective pursuit, as Steve had hoped it would be. They rode swiftly all\n night and continued riding with the dawn. They could have gone in any\n direction. The wind-driven sand would obliterate their trail.\n \n Two days later they reached the caravan. As they rode up, Mary said,\n\"Steve, do you have to tell them?\"\n \n \"We can tell them this,\" Steve said. \"Your father died a hero's death,\n sending the Kumajis off in the wrong direction.\"\n \n \"And not—not what he'd planned to do at first.\"\n \n \"No. We'll tell them that was his intention all the while. A man can\n make a mistake, can't he?\"\n \n \"I love you, Steve. I love you.\"\n \n Then they rode down on the caravan. Somehow Steve knew they would all\n reach Oasis City in safety.\n \n With Mary he would find a new world out in the vastness of space.",
      "metadata": {
        "title": "Home is Where You Left It",
        "author": "Adam Chase",
        "passage_id": "32890",
        "uid": "baff0389878e4ce9acb7d310406b4433",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "113",
                "uid": "0230fdf26e204d7daf8b3f5070cf7a7f",
                "response_text": "Steve Cantwell grew up in a desert village on Sirius' second planet, he lived with his aunt. It is one of the human colonies, and it has never been accepted by the Kumaji tribesmen - the natives who have been raiding the settlements for years. Steve went to Earth to get an education, but now he came back to the planet. He flew from Oasis City to his native village on a unicopter only to find the deserted buildings and poisoned water. A Kumaji, who lived with the earthmen, tells him that the natives poisoned the well - three people died, and everybody else had to leave their home and walk to Oasis City through the desert wasteland. Now the Kumaji are looking for them to kill. The man stayed here to die since he’s too old to flee or fight. Steve gives him his water canteen and flies away to find the other citizens. Hours later, he spots a caravan with camels. He first meets Tobias Whiting, who was the most successful man in the village when Steve was a child. The man greets him coldly and soon informs Steve that his aunt was one of the people who died from the poisoned water. Then he introduces him to his daughter Mary, the young woman who charms Steve. Tobias says he had a profitable business, but all his money is gone now. Three days later, he disappears, taking Steve’s unicopter with him. The other members suppose that Tobias decided to trade the caravan’s location for his profits, thus betraying them. Mary and Steve take some food and head towards the Kumaji base to the north of the caravan since Tobias probably decided to fly there. Four days later, they spot the empty unicopter and realize that Tobias must’ve reached the base by now. They keep walking and soon surrender to the Kumajis, who put them in a circular tent where they meet Tobias. He explains to Mary that he wants to give her the life she deserves. Now he’s determined to tell the Kumaji everything since his daughter got captured, and the Kumaji might torture her for information. Steve devises an escape plan: at night, he makes Tobias scream for a second to make one of the guards come in. Steve kills this one Kumaji, but the guard manages to lethally wound Tobias while fighting with the attacker. Whiting blesses Mary and Steve and orders them to leave, promising that he’ll deceive the Kumaji and not share the true location of the caravan. The couple runs from the tent, and Steve kills several more guards before gliding off on the thlot’s - desert animal - back with Mary. They reach the caravan two days later and decide to tell everyone that Whiting initially went to the Kumaji to save everyone. Mary admits to Steve that she loves him."
              },
              {
                "worker_id": "107",
                "uid": "6ee21913ea18465e982c9e96fd90435b",
                "response_text": "Steve Cantwell reaches a village after coming in his unicopter from Oasis City. He thinks about his childhood memories as he walks around, sadly thinking about living in the mud-house with his aunt after his parents were killed in a Kumaji raid, and the community center. As he tries the water, he realizes it is poisoned and stuffs sand in his mouth. As he goes into his aunt’s house, an old Kumaji appears and tells him that everyone left. Steve thinks about the Kumaji raids from when he was a boy, and the old one talks about how the poisoned well was the last straw for the colonists to leave for Oasis City. Steve offers to take the old man with him in the unicopter, but he refuses and insists that the town is his home. Steve then goes to look for his people in the desert, and he finds them hiking through the desert. Steve goes to introduce himself again, but a man named Tobias Whiting only responds to him bitterly. He tells Steve that his aunt was one of the people who died, and his daughter Mary Whiting meets up with them later. Tobias Whiting complains about never having money because of the Kumaji, but Mary Whiting gives him a smile. Tobias disappears three days later, and he takes Steve’s unicopter on the fourth night to go and retrieve his fortune. Mary slaps Gort, but he asks Steve how far Tobias will get with the unicopter. They get captured by the Kumaji and see that Tobias is waiting for them at the camp. Mary asks her father why he did what he did, and Steve asks if he has told them the information yet. At night, Mary asks if Steve has gone to sleep yet. Tobias is clearly asleep, and Mary is furious about her father betraying their people. Steve threatens to kill Tobias, but he ends up killing a guard instead. Tobias, however, is injured by the pike and lays there in pain. He asks Mary if Steve is the person she wants, and he tells the two of them to go south with the rest of the Earthmen. Tobias reassures them that he will live long enough to deceive the Kumaji. Steve escapes with Mary, killing a few more of the Kumaji before taking off on the thlot. They ride off into the distance, letting the sand obstruct their trail. Steve promises that they will tell the rest of the colony that Mary’s father died as a hero, and she proclaims her love for him. The two of them know that they will reach Oasis City safely, and there is a new world out in space. "
              },
              {
                "worker_id": "109",
                "uid": "73f8f1c5e2154192914dafc0720d4e93",
                "response_text": "This story follows Steve Cantwell, a young Earthmen who has returned from being educated on Earth back to his home in the Sirian desert. Upon arrival, he finds his village hastily abandoned - including his aunt - and the well poisoned. He finds an old Kumaji man in the community center, who informs him of what happened. The Kumaji tribesmen had raided the village as they felt the colony took up an oasis belonging to their own nomadic needs. By poisoning the well, the colonists were forced to travel by foot and camel across the arid desert to try and reach Oasis City, located 500 miles away. \n\nCantwell decides to hop into his unicopter to meet the travelling caravan and warn them of the Kumaji. He insists theres room for the old man, but the old man chooses to stay and die in his home. Reluctantly, Cantwell leaves the old man with the remaining water his in canteen. Later, Cantwell finds the caravan and reunites with familiar faces from his boyhood. This includes Tobias Whiting, previously the Colony's most successful man through his trading and business with the Kumajis, his daughter Mary, and some other childhood friends. Whiting describes how despite his relationship with the Kumajis and supposed riches, he and his daughter are forced to escape as refugees as well. \n\nDays after travelling with the caravan, Whiting disappears with Cantwell's unicopter. After discussing with some of the colony members, it is suggested that Whiting had gone off with the intention of trading with the Kumajis again: the colony's location in return for his money. Steve and Mary decide to follow and stop him. After a couple days travel, they find the unicopter crashed. Though initially reassured by the fact that Whiting was alive, they soon get spotted and captured by a band of Kumajis. Led to the Kumajis' encampment, they are met by Whiting. It seems that even if Whiting has changed his mind, the presence of his daughter and Cantwell could mean that the Kumajis were willing to torture the information of out Whiting regardless. \n\nAt night, Steve enacts a plan. He pretends to choke Whiting and draws the attention of the guard. They enter a scuffle, with the guard dying, but not without Whiting having taken a fatal stabbing from the guard's pike. Whiting vows instead to misinform the Kumajis on the caravan's location, and insists on the Steve getting Mary out safely. The pair manage to escape on a stolen thlotback and as they ride up to the caravan, plan to tell Whiting's demise as a hero.  "
              },
              {
                "worker_id": "111",
                "uid": "4cd0167045d54bf3952907992ef6fd9c",
                "response_text": "The story revolves around Steve Cantwell, a human raised on a desert planet who decides to return home after years away.. When he arrives at his village, he sees the whole village is deserted, and attacked. The water well is poisoned, and the only person that he can find is an old man that tells him what happened. After overpopulation on earth increased dramatically, many humans turned to other planets to colonize. This desert planet was an example of that. The humans who lived in this village had always had trouble with the native tribe, as they weren’t happy that the humans arrived at their home. This led to constant raids by the tribe, and is eventually what led to the humans abandoning the village to live in a city 500 miles away. After the old man told him what happened, Steve leaves in his ship to find the caravan of the surviving humans, as the old man wanted to stay in the village. After Steve finds them, he meets with people from the village, most of which remember him. Together, they continue their journey towards the large city and towards safety from the natives. One day, one of the men of the party takes Steve’s ship. It is assumed that he wanted to negotiate with the natives, as he had a lot of money with them. In return, the man would give them the location of the rest of the humans. Steve and the man’s daughter leave in order to find him and stop when. After getting captured by the natives, they meet with the man again, who wants to go ahead with his plan of betraying the rest of the humans. Steve understands that this can’t happen, so he lures a guard in and kills him. In the process, the man dies, but manages to go back on his plan and sends the natives to a wrong location. Steve and the daughter leave, excited to meet up with the others and start a new life in the city. "
              }
            ]
          },
          {
            "question_text": "Who is Tobias Whiting and what happens to him throughout the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "113",
                "uid": "0230fdf26e204d7daf8b3f5070cf7a7f",
                "response_text": "Tobias is a well-muscled, handsome man in his mid-forties. He is the Colony’s official trader with the Kumajis. Steve believed him to have been the most successful man in the Colony before the events of the story. The water in his village gets poisoned by the Kumaji. He, together with his daughter and other citizens, is forced to abandon his home and walk through the desert to Oasis City, leaving all his treasures and assets behind. The Kumajis are trying to chase them and kill the Colony. At some point in their journey, he meets Steve, who found the caravan on his unicopter. Several days later, Tobias decides to steal the unicopter and fly to the Kumaji’s base fifty miles due north of their stop and trade the caravan’s location for his money. He’s kept in one of the tents, and soon Mary and Steve join him. Now that his daughter is a prisoner, he’s eager to share the location of the caravan and save her from torture. At night Steve whispers that he will kill Tobias, and the man screams. Steve quickly silences him and attacks the coming guard. The Kumaji loses the battle with Steve but stabs Tobias in the stomach. He realizes that he won’t be able to leave the camp alive, so he blesses Mary and Steve and promises to give the Kumaji the wrong direction and save the caravan."
              },
              {
                "worker_id": "107",
                "uid": "6ee21913ea18465e982c9e96fd90435b",
                "response_text": "Tobias Whiting is the father of Mary Whiting. He is described to be the colony’s most successful man when Steve was a boy. However, there is now bitterness, bleak self-pity, and defeat evident in his eyes. Physically, he is in his mid-forties now. He is well-muscled, flesh solid, and walks with bold steps. He also has a craggy and handsome face. Tobias used to be very rich, by the colony standards, because he primarily traded with the Kumajis. Now, he has lost all of his money to them. He deeply cares for his daughter Mary, taking good care of her when they have to flee with the rest of the colony. Tobias, however, decides to steal Steven’s unicopter to go back to the Kumaji under the guise of getting his fortune back. When they meet him at the camp, he tells them that he is discussing a settlement with the Kumaji. Later, Tobias is gravely injured by the pike of the guard after he is attacked by Steve. He still wishes nothing but for Mary’s happiness, so he tells Steve to take her south with the rest of the colony. He says that he will give the Kumaji false information to better help the colony escape. "
              },
              {
                "worker_id": "109",
                "uid": "73f8f1c5e2154192914dafc0720d4e93",
                "response_text": "Tobias Whiting is a mid-fourties Earthman who belonged to the colony in the desert. He is described to be well-muscled with a strong stride and a handsome face. He has a daughter, Mary Whiting. Whiting was the Colony's official trader with the Kumajis and had grown rich because of his business with them. Despite this relationship with the Kumajis, he and his daughter were forced to escape with the rest of their colony. He remains bitter over the fact that wherever the colony escapes to, he and his daughter will be poor even with their supposed riches, which are tied up with a Kumaji moneylender. \n\nIn the middle of the journey, Whiting disappears with Cantwell's unicopter. It is deduced that he took off with the unicopter with the intention of informing the Kumajis, at a base not too far away, of the caravan's location in return for his money. Whiting successfully makes it to the Kumajis' base, and after running into his daughter and Cantwell, he remains steadfast on his decision because they might choose to torture his daughter for information. After a scuffle with the Kumaji guard, Whiting is fatally stabbed on accident by the guard's pike. Knowing he will soon die, Whiting promises to lead the Kumajis astray with the wrong information and wishes his daughter and Cantwell off. "
              },
              {
                "worker_id": "111",
                "uid": "4cd0167045d54bf3952907992ef6fd9c",
                "response_text": "Tobias Whiting is one of the humans who settled on the desert planet, and who was a constant victim of the natives’ violence. Tobias and his daughter Mary are also part of the survivors of the last attack, which forces them to move away towards a large city. Tobias is revealed to have been a very wealthy man, and had a lot of business with the natives. After Steve meets up with them, Tobias decides to steal Steve’s ship and negotiate with the natives who were hunting them. Steve wants to get his money back in return for giving up the location of the other humans. After Steve and Mary find him, he dies while they try to escape, but just before dying he changes his mind and sends the natives to the wrong location. "
              }
            ]
          },
          {
            "question_text": "Describe the Setting of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "113",
                "uid": "0230fdf26e204d7daf8b3f5070cf7a7f",
                "response_text": "The story is set in the twenty-second century: the Earth government is seeking colonies in many places. One of them is on Sirius’ second planet. Steve spent his early childhood here in a human settlement in the middle of a desert, but he went to Earth to get an education. Now he got back to Oasis City, which is built at the confluence of two underground rivers and is 500 miles from his home Colony. At the beginning, Steve flies across the desert to his village: it looks abandoned. He walks from the well with water to his aunt’s house and soon finds the dying Kumaji. Later, Steve flies above the desert dunes and spots the caravan. He lands there and spends the next several days with the people walking east to Oasis City. Then Steve and Mary go to the north - to the Kumaji base. They surrender, and the Kumaji take them both to a small encampment. In a secular tent, they find Mary’s Father. When it’s dark, Mary and Steve sneak out of the tent and soon glide off across the sand on the thlot’s back. "
              },
              {
                "worker_id": "107",
                "uid": "6ee21913ea18465e982c9e96fd90435b",
                "response_text": "The village that Steve first visits is his childhood home. There is a strong desert heat in the area and many deserted mud-houses. All of the families draw their water from a single well, and there is also a community center too. Inside of his aunt’s house, there is a set table, a coffee pot on the stove, and the remains of last night’s partially-consumed dinner. Outside, there is only hot desert sand and haze from the heat. The colonists also have imported camels to help them as well. There are also many sandhills and a small spring with brackish but drinkable water. Many small, six-legged creatures glide across the desert. At the Kumaji encampment, there is a circular tent for the prisoners. "
              },
              {
                "worker_id": "109",
                "uid": "73f8f1c5e2154192914dafc0720d4e93",
                "response_text": "This story is set in a desert on Sirius' second planet, where an Earth colony has taken residence. The colony's village is lined with deserted mud-brick houses, a community center, and a single well, with some of the houses damaged due to the Kumaji's raids. \n\nMost of the story takes place on the road, where the caravan journeys across the desert to reach Oasis City, 500 miles away. The Sirian desert had nothing but vast miles of dry sand and heat and the camels that the colonists brought. Occasionally, the characters in the story will come across a small spring for drinkable water. \n\nThe latter part of the story takes place in a Kumaji encampment, where the characters are imprisoned in a circular tent.  "
              },
              {
                "worker_id": "111",
                "uid": "4cd0167045d54bf3952907992ef6fd9c",
                "response_text": "The story takes place on a desert planet, which is inhabited by a native race. The planet is very arid, and it is described to have different villages and cities. The village in which Steve grew up in, has a large water well in the middle, which gets poisoned by the natives. After this, the humans are trying to reach a large city inhabited by more humans. This city is called Oasis City, and it is located between two rivers. The natives live in large camps, and ride animals called Thlots, which allows them to move quickly in the desert. \n\n"
              }
            ]
          },
          {
            "question_text": "What is the significance of the Kumaji's in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "113",
                "uid": "0230fdf26e204d7daf8b3f5070cf7a7f",
                "response_text": "The Kumaji are the native tribesmen, and they have been raiding the Colony for many years. They also killed Steve’s parents in the past. Now they poison the village’s well, and his aunt dies from this water. They practically force the citizens to leave their homes and walk through the desert. The Kumaji are looking for the caravan to kill everyone else who remains alive. They have Tobias’ money which upsets him and makes him initially betray his people and try to trade their location for his fortune. They take him, Steve, and Mary captive and then end up being unable to stop the last two from running away. "
              },
              {
                "worker_id": "107",
                "uid": "6ee21913ea18465e982c9e96fd90435b",
                "response_text": "The Kumaji’s in the story are the main enemies of the colonists. They are the ones behind the raids, one of which killed Steve’s parents. The Kumajis are also described to be significant because they are the reason why the caravan has to leave as quickly as they can. Even though the poisoned water is the last straw, the Kumaji are also out to hunt the colonists and kill them. They are also the reason why Tobias Whiting decides to go to their camp, in hopes of deceiving them so that the rest of the colony can reach Oasis City safely. Everybody mistakenly believes, however, that Tobias is planning to betray them for money. Even so, the Kumaji are the reason why Tobias can be regarded as a hero and have his moment to make the ultimate sacrifice."
              },
              {
                "worker_id": "109",
                "uid": "73f8f1c5e2154192914dafc0720d4e93",
                "response_text": "In this story, the Kumajis are portrayed as the enemy. They prey on the defenceless villagers by poisoning the only water supply and doggedly chase after them in the arid desert. However, the presence of the Kumajis are significant because it could be interpreted that the Earthmen are the enemy instead, as we are told in the story that this planet was first inhabited by the Kumajis and the desert is actually a part of their land. This is attributed by the Kumajis' natural ability to survive in the desert, as well as their command over the thlotback desert animals. "
              },
              {
                "worker_id": "111",
                "uid": "4cd0167045d54bf3952907992ef6fd9c",
                "response_text": "The Kumaji’s are the native species in the story. They are very violent creatures, and constantly raid the colonies of humans in their country. They are described to be of a purple color, and seem to be very similar to the humans, except for the skin color. The Kumaji’s are a very important part of the plot, as they are who drive the humans out of Steve’s village and into a desert trek. Even after the humans left the village, they still wanted to hunt them down in their path to Oasis City."
              }
            ]
          },
          {
            "question_text": "What is the significance of the old man in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "113",
                "uid": "0230fdf26e204d7daf8b3f5070cf7a7f",
                "response_text": "When Steve arrives at the Colony, he sees deserted buildings and realizes that the well water is poisoned. The old man - the Kumaji who lived with the humans - tells him that the day before, three people died from the poisoned drinking water. The Kumaji are behind this and are trying to locate the others who left the Colony. They want to find the caravan, and even though the desert wind will wipe out the humans' trail, they still need to be informed about this danger. Knowing all of this allows Steve to find the caravan and eventually save them from the Kumaji, who could learn their location from Tobias Whiting. "
              },
              {
                "worker_id": "107",
                "uid": "6ee21913ea18465e982c9e96fd90435b",
                "response_text": "\nThe old man serves as a guide for Steve in the story. Initially, he is the one who tells him about the colonists leaving because of the poisoned water. He also explains that the Kumaji are out to get them and that the colonists are desperate to get to Oasis City. His words also give Steve the motivation to go and help his people, despite being away for so long on Earth. Furthermore, the old man is also proof that Kumaji and humans can live together. Although he is a Kumaji, he has lived with humans and can speak perfect English. He does not hold any malice and even says that this is the only home he has ever had. Therefore, he will not leave this place and wishes Steve good luck to helping his people. "
              },
              {
                "worker_id": "109",
                "uid": "73f8f1c5e2154192914dafc0720d4e93",
                "response_text": "The old man plays the role of the messenger. He has a strong role in the beginning of the story and sets up young Steve Cantwell with the background of what happened to the colony, as well as driving him with the mission of catching up to the travelling colony in order to warn them of the pursuing Kumajis. \n\nHe is significant because the old man, by face, is a Kumaji. Despite this, he has lived with the Earth colony and is insistent on dying in the village, which he proclaims as his town. This hints at the fact that Kumajis and the Earthmen could have actually cohabited peacefully, and even form strong bonds when their communities interacted and lived with each other.  "
              },
              {
                "worker_id": "111",
                "uid": "4cd0167045d54bf3952907992ef6fd9c",
                "response_text": "The old man is a very important figure in the plot. After Steve finds his village abandoned and dead, the old man is the only one who stayed behind. He is also revealed to be of the Kumaji species, but he has lived with the humans in the village for such a long time that he has no ties to them. He helps Steve figure out what happened, and tells him where the people went in order for Steve to find them. He ends up staying in the village, even though Steve offered to take him to the others. He did this because he was already dying, and wanted to die in his village. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4353,
        "document_length_chars": 25241
      }
    }
  ]
}