{
  "item_metadata": {
    "item_id": "41562",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "41562",
      "content": "THE HANGING STRANGER\n \n\n BY PHILIP K. DICK\n \n\n ILLUSTRATED BY SMITH\n \n \n [Transcriber's Note: This etext was produced from Science Fiction Adventures Magazine December 1953. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n Ed had always been a practical man, when he saw something was wrong he tried to correct it. Then one day he saw\n \n it\n \n hanging in the town square.\n \n Five o'clock Ed Loyce washed up, tossed on his hat and coat, got his car out and headed across town toward his TV sales store. He was tired. His back and shoulders ached from digging dirt out of the basement and wheeling it into the back yard. But for a forty-year-old man he had done okay. Janet could get a new vase with the money he had saved; and he liked the idea of repairing the foundations himself!\n \n It was getting dark. The setting sun cast long rays over the scurrying commuters, tired and grim-faced, women loaded down with bundles and packages, students swarming home from the university, mixing with clerks and businessmen and drab secretaries. He stopped his Packard for a red light and then started it up again. The store had been open without him; he'd arrive just in time to spell the help for dinner, go over the records of the day, maybe even close a couple of sales himself. He drove slowly past the small square of green in the center of the street, the town park. There were no parking places in front of LOYCE TV SALES AND SERVICE. He cursed under his breath and swung the car in a U-turn. Again he passed the little square of green with its lonely drinking fountain and bench and single lamppost.\n \n From the lamppost something was hanging. A shapeless dark bundle, swinging a little with the wind. Like a dummy of some sort. Loyce rolled down his window and peered out. What the hell was it? A display of some kind? Sometimes the Chamber of Commerce put up displays in the square.\n \n Again he made a U-turn and brought his car around. He passed the park and concentrated on the dark bundle. It wasn't a dummy. And if it was a display it was a strange kind. The hackles on his neck rose and he swallowed uneasily. Sweat slid out on his face and hands.\n \n It was a body. A human body.\n \n \n \n \"Look at it!\" Loyce snapped. \"Come on out here!\"\n \n Don Fergusson came slowly out of the store, buttoning his pin-stripe coat with dignity. \"This is a big deal, Ed. I can't just leave the guy standing there.\"\n \n \"See it?\" Ed pointed into the gathering gloom. The lamppost jutted up against the sky—the post and the bundle swinging from it. \"There it is. How the hell long has it been there?\" His voice rose excitedly. \"What's wrong with everybody? They just walk on past!\"\n \n Don Fergusson lit a cigarette slowly. \"Take it easy, old man. There must be a good reason, or it wouldn't be there.\"\n \n \"A reason! What kind of a reason?\"\n \n Fergusson shrugged. \"Like the time the Traffic Safety Council put that wrecked Buick there. Some sort of civic thing. How would I know?\"\n \n Jack Potter from the shoe shop joined them. \"What's up, boys?\"\n \n \"There's a body hanging from the lamppost,\" Loyce said. \"I'm going to call the cops.\"\n \n \"They must know about it,\" Potter said. \"Or otherwise it wouldn't be there.\"\n \n \"I got to get back in.\" Fergusson headed back into the store. \"Business before pleasure.\"\n \n Loyce began to get hysterical. \"You see it? You see it hanging there? A man's body! A dead man!\"\n \n \"Sure, Ed. I saw it this afternoon when I went out for coffee.\"\n \n \"You mean it's been there all afternoon?\"\n \n \"Sure. What's the matter?\" Potter glanced at his watch. \"Have to run. See you later, Ed.\"\n \n Potter hurried off, joining the flow of people moving along the sidewalk. Men and women, passing by the park. A few glanced up curiously at the dark bundle—and then went on. Nobody stopped. Nobody paid any attention.\n \n \"I'm going nuts,\" Loyce whispered. He made his way to the curb and crossed out into traffic, among the cars. Horns honked angrily at him. He gained the curb and stepped up onto the little square of green.\n \n The man had been middle-aged. His clothing was ripped and torn, a gray suit, splashed and caked with dried mud. A stranger. Loyce had never seen him before. Not a local man. His face was partly turned, away, and in the evening wind he spun a little, turning gently, silently. His skin was gouged and cut. Red gashes, deep scratches of congealed blood. A pair of steel-rimmed glasses hung from one ear, dangling foolishly. His eyes bulged. His mouth was open, tongue thick and ugly blue.\n \n \"For Heaven's sake,\" Loyce muttered, sickened. He pushed down his nausea and made his way back to the sidewalk. He was shaking all over, with revulsion—and fear.\n  Why? Who was the man? Why was he hanging there? What did it mean?\n \n And—why didn't anybody notice?\n \n He bumped into a small man hurrying along the sidewalk. \"Watch it!\" the man grated, \"Oh, it's you, Ed.\"\n \n Ed nodded dazedly. \"Hello, Jenkins.\"\n \n \"What's the matter?\" The stationery clerk caught Ed's arm. \"You look sick.\"\n \n \"The body. There in the park.\"\n \n \"Sure, Ed.\" Jenkins led him into the alcove of LOYCE TV SALES AND SERVICE. \"Take it easy.\"\n \n Margaret Henderson from the jewelry store joined them. \"Something wrong?\"\n \n \"Ed's not feeling well.\"\n \n Loyce yanked himself free. \"How can you stand here? Don't you see it? For God's sake—\"\n \n \"What's he talking about?\" Margaret asked nervously.\n \n \"The body!\" Ed shouted. \"The body hanging there!\"\n \n More people collected. \"Is he sick? It's Ed Loyce. You okay, Ed?\"\n \n \"The body!\" Loyce screamed, struggling to get past them. Hands caught at him. He tore loose. \"Let me go! The police! Get the police!\"\n \n \"Ed—\"\n \n \"Better get a doctor!\"\n \n \"He must be sick.\"\n \n \"Or drunk.\"\n \n Loyce fought his way through the people. He stumbled and half fell. Through a blur he saw rows of faces, curious, concerned, anxious. Men and women halting to see what the disturbance was. He fought past them toward his store. He could see Fergusson inside talking to a man, showing him an Emerson TV set. Pete Foley in the back at the service counter, setting up a new Philco. Loyce shouted at them frantically. His voice was lost in the roar of traffic and the murmur around him.\n \n \"Do something!\" he screamed. \"Don't stand there! Do something! Something's wrong! Something's happened! Things are going on!\"\n \n The crowd melted respectfully for the two heavy-set cops moving efficiently toward Loyce.\n \n \n \n \"Name?\" the cop with the notebook murmured.\n \n \"Loyce.\" He mopped his forehead wearily. \"Edward C. Loyce. Listen to me. Back there—\"\n \n \"Address?\" the cop demanded. The police car moved swiftly through traffic, shooting among the cars and buses. Loyce sagged against the seat, exhausted and confused. He took a deep shuddering breath.\n \n \"1368 Hurst Road.\"\n \n \"That's here in Pikeville?\"\n \n \"That's right.\" Loyce pulled himself up with a violent effort. \"Listen to me. Back there. In the square. Hanging from the lamppost—\"\n \n \"Where were you today?\" the cop behind the wheel demanded.\n \n \"Where?\" Loyce echoed.\n \n \"You weren't in your shop, were you?\"\n \n \"No.\" He shook his head. \"No, I was home. Down in the basement.\"\n \n \"In the basement ?\"\n \n \"Digging. A new foundation. Getting out the dirt to pour a cement frame. Why? What has that to do with—\"\n \n \"Was anybody else down there with you?\"\n \n \"No. My wife was downtown. My kids were at school.\" Loyce looked from one heavy-set cop to the other. Hope flicked across his face, wild hope.\n\"You mean because I was down there I missed—the explanation? I didn't get in on it? Like everybody else?\"\n \n After a pause the cop with the notebook said: \"That's right. You missed the explanation.\"\n \n \"Then it's official? The body—it's supposed to be hanging there?\"\n \n \"It's supposed to be hanging there. For everybody to see.\"\n \n Ed Loyce grinned weakly. \"Good Lord. I guess I sort of went off the deep end. I thought maybe something had happened. You know, something like the Ku Klux Klan. Some kind of violence. Communists or Fascists taking over.\" He wiped his face with his breast-pocket handkerchief, his hands shaking. \"I'm glad to know it's on the level.\"\n \n \"It's on the level.\" The police car was getting near the Hall of Justice. The sun had set. The streets were gloomy and dark. The lights had not yet come on.\n \n \"I feel better,\" Loyce said. \"I was pretty excited there, for a minute. I guess I got all stirred up. Now that I understand, there's no need to take me in, is there?\"\n \n The two cops said nothing.\n \n \"I should be back at my store. The boys haven't had dinner. I'm all right, now. No more trouble. Is there any need of—\"\n \n \"This won't take long,\" the cop behind the wheel interrupted. \"A short process. Only a few minutes.\"\n \n \"I hope it's short,\" Loyce muttered. The car slowed down for a stoplight. \"I guess I sort of disturbed the peace. Funny, getting excited like that and—\"\n \n Loyce yanked the door open. He sprawled out into the street and rolled to his feet. Cars were moving all around him, gaining speed as the light changed. Loyce leaped onto the curb and raced among the people, burrowing into the swarming crowds. Behind him he heard sounds, shouts, people running.\n \n They weren't cops. He had realized that right away. He knew every cop in Pikeville. A man couldn't own a store, operate a business in a small town for twenty-five years without getting to know all the cops.\n \n They weren't cops—and there hadn't been any explanation. Potter, Fergusson, Jenkins, none of them knew why it was there. They didn't know—and they didn't care. That was the strange part.\n \n Loyce ducked into a hardware store. He raced toward the back, past the startled clerks and customers, into the shipping room and through the back door. He tripped over a garbage can and ran up a flight of concrete steps. He climbed over a fence and jumped down on the other side, gasping and panting.\n \n There was no sound behind him. He had got away.\n \n He was at the entrance of an alley, dark and strewn with boards and ruined boxes and tires. He could see the street at the far end. A street light wavered and came on. Men and women. Stores. Neon signs. Cars.\n \n And to his right—the police station.\n \n He was close, terribly close. Past the loading platform of a grocery store rose the white concrete side of the Hall of Justice. Barred windows. The police antenna. A great concrete wall rising up in the darkness. A bad place for him to be near. He was too close. He had to keep moving, get farther away from them.\n  Them?\n \n \n Loyce moved cautiously down the alley. Beyond the police station was the City Hall, the old-fashioned yellow structure of wood and gilded brass and broad cement steps. He could see the endless rows of offices, dark windows, the cedars and beds of flowers on each side of the entrance.\n \n And—something else.\n \n Above the City Hall was a patch of darkness, a cone of gloom denser than the surrounding night. A prism of black that spread out and was lost into the sky.\n \n He listened. Good God, he could hear something. Something that made him struggle frantically to close his ears, his mind, to shut out the sound. A buzzing. A distant, muted hum like a great swarm of bees.\n \n Loyce gazed up, rigid with horror. The splotch of darkness, hanging over the City Hall. Darkness so thick it seemed almost solid. In the vortex something moved. Flickering shapes. Things, descending from the sky, pausing momentarily above the City Hall, fluttering over it in a dense swarm and then dropping silently onto the roof.\n \n Shapes. Fluttering shapes from the sky. From the crack of darkness that hung above him.\n \n He was seeing—them.\n \n \n \n For a long time Loyce watched, crouched behind a sagging fence in a pool of scummy water.\n \n They were landing. Coming down in groups, landing on the roof of the City Hall and disappearing inside. They had wings. Like giant insects of some kind. They flew and fluttered and came to rest—and then crawled crab-fashion, sideways, across the roof and into the building.\n \n He was sickened. And fascinated. Cold night wind blew around him and he shuddered. He was tired, dazed with shock. On the front steps of the City Hall were men, standing here and there. Groups of men coming out of the building and halting for a moment before going on.\n \n Were there more of them?\n \n It didn't seem possible. What he saw descending from the black chasm weren't men. They were alien—from some other world, some other dimension. Sliding through this slit, this break in the shell of the universe. Entering through this gap, winged insects from another realm of being.\n \n On the steps of the City Hall a group of men broke up. A few moved toward a waiting car. One of the remaining shapes started to re-enter the City Hall. It changed its mind and turned to follow the others.\n \n Loyce closed his eyes in horror. His senses reeled. He hung on tight, clutching at the sagging fence. The shape, the man-shape, had abruptly fluttered up and flapped after the others. It flew to the sidewalk and came to rest among them.\n \n Pseudo-men. Imitation men. Insects with ability to disguise themselves as men. Like other insects familiar to Earth. Protective coloration. Mimicry.\n \n Loyce pulled himself away. He got slowly to his feet. It was night. The alley was totally dark. But maybe they could see in the dark. Maybe darkness made no difference to them.\n \n He left the alley cautiously and moved out onto the street. Men and women flowed past, but not so many, now. At the bus-stops stood waiting groups. A huge bus lumbered along the street, its lights flashing in the evening gloom.\n \n Loyce moved forward. He pushed his way among those waiting and when the bus halted he boarded it and took a seat in the rear, by the door. A moment later the bus moved into life and rumbled down the street.\n \n \n \n Loyce relaxed a little. He studied the people around him. Dulled, tired faces. People going home from work. Quite ordinary faces. None of them paid any attention to him. All sat quietly, sunk down in their seats, jiggling with the motion of the bus.\n \n The man sitting next to him unfolded a newspaper. He began to read the sports section, his lips moving. An ordinary man. Blue suit. Tie. A businessman, or a salesman. On his way home to his wife and family.\n \n Across the aisle a young woman, perhaps twenty. Dark eyes and hair, a package on her lap. Nylons and heels. Red coat and white angora sweater. Gazing absently ahead of her.\n \n A high school boy in jeans and black jacket.\n \n A great triple-chinned woman with an immense shopping bag loaded with packages and parcels. Her thick face dim with weariness.\n \n Ordinary people. The kind that rode the bus every evening. Going home to their families. To dinner.\n \n Going home—with their minds dead. Controlled, filmed over with the mask of an alien being that had appeared and taken possession of them, their town, their lives. Himself, too. Except that he happened to be deep in his cellar instead of in the store. Somehow, he had been overlooked. They had missed him. Their control wasn't perfect, foolproof.\n \n Maybe there were others.\n \n Hope flickered in Loyce. They weren't omnipotent. They had made a mistake, not got control of him. Their net, their field of control, had passed over him. He had emerged from his cellar as he had gone down. Apparently their power-zone was limited.\n \n A few seats down the aisle a man was watching him. Loyce broke off his chain of thought. A slender man, with dark hair and a small mustache. Well-dressed, brown suit and shiny shoes. A book between his small hands. He was watching Loyce, studying him intently. He turned quickly away.\n \n Loyce tensed. One of them ? Or—another they had missed?\n \n The man was watching him again. Small dark eyes, alive and clever. Shrewd. A man too shrewd for them—or one of the things itself, an alien insect from beyond.\n \n The bus halted. An elderly man got on slowly and dropped his token into the box. He moved down the aisle and took a seat opposite Loyce.\n \n The elderly man caught the sharp-eyed man's gaze. For a split second something passed between them.\n \n A look rich with meaning.\n \n Loyce got to his feet. The bus was moving. He ran to the door. One step down into the well. He yanked the emergency door release. The rubber door swung open.\n \n \"Hey!\" the driver shouted, jamming on the brakes. \"What the hell—\"\n \n Loyce squirmed through. The bus was slowing down. Houses on all sides. A residential district, lawns and tall apartment buildings. Behind him, the bright-eyed man had leaped up. The elderly man was also on his feet. They were coming after him.\n \n Loyce leaped. He hit the pavement with terrific force and rolled against the curb. Pain lapped over him. Pain and a vast tide of blackness. Desperately, he fought it off. He struggled to his knees and then slid down again. The bus had stopped. People were getting off.\n \n Loyce groped around. His fingers closed over something. A rock, lying in the gutter. He crawled to his feet, grunting with pain. A shape loomed before him. A man, the bright-eyed man with the book.\n \n Loyce kicked. The man gasped and fell. Loyce brought the rock down. The man screamed and tried to roll away. \" Stop! For God's sake listen—\"\n \n He struck again. A hideous crunching sound. The man's voice cut off and dissolved in a bubbling wail. Loyce scrambled up and back. The others were there, now. All around him. He ran, awkwardly, down the sidewalk, up a driveway. None of them followed him. They had stopped and were bending over the inert body of the man with the book, the bright-eyed man who had come after him.\n \n Had he made a mistake?\n \n But it was too late to worry about that. He had to get out—away from them. Out of Pikeville, beyond the crack of darkness, the rent between their world and his.\n \n \n \n \"Ed!\" Janet Loyce backed away nervously. \"What is it? What—\"\n \n Ed Loyce slammed the door behind him and came into the living room.\n\"Pull down the shades. Quick.\"\n \n Janet moved toward the window. \"But—\"\n \n \"Do as I say. Who else is here besides you?\"\n \n \"Nobody. Just the twins. They're upstairs in their room. What's happened? You look so strange. Why are you home?\"\n \n Ed locked the front door. He prowled around the house, into the kitchen. From the drawer under the sink he slid out the big butcher knife and ran his finger along it. Sharp. Plenty sharp. He returned to the living room.\n \n \"Listen to me,\" he said. \"I don't have much time. They know I escaped and they'll be looking for me.\"\n \n \"Escaped?\" Janet's face twisted with bewilderment and fear. \"Who?\"\n \n \"The town has been taken over. They're in control. I've got it pretty well figured out. They started at the top, at the City Hall and police department. What they did with the real humans they—\"\n \n \"What are you talking about?\"\n \n \"We've been invaded. From some other universe, some other dimension. They're insects. Mimicry. And more. Power to control minds. Your mind.\"\n \n \"My mind?\"\n \n \"Their entrance is here , in Pikeville. They've taken over all of you. The whole town—except me. We're up against an incredibly powerful enemy, but they have their limitations. That's our hope. They're limited! They can make mistakes!\"\n \n Janet shook her head. \"I don't understand, Ed. You must be insane.\"\n \n \"Insane? No. Just lucky. If I hadn't been down in the basement I'd be like all the rest of you.\" Loyce peered out the window. \"But I can't stand here talking. Get your coat.\"\n \n \"My coat?\"\n \n \"We're getting out of here. Out of Pikeville. We've got to get help. Fight this thing. They can be beaten. They're not infallible. It's going to be close—but we may make it if we hurry. Come on!\" He grabbed her arm roughly. \"Get your coat and call the twins. We're all leaving. Don't stop to pack. There's no time for that.\"\n \n White-faced, his wife moved toward the closet and got down her coat.\n\"Where are we going?\"\n \n Ed pulled open the desk drawer and spilled the contents out onto the floor. He grabbed up a road map and spread it open. \"They'll have the highway covered, of course. But there's a back road. To Oak Grove. I got onto it once. It's practically abandoned. Maybe they'll forget about it.\"\n \n \"The old Ranch Road? Good Lord—it's completely closed. Nobody's supposed to drive over it.\"\n \n \"I know.\" Ed thrust the map grimly into his coat. \"That's our best chance. Now call down the twins and let's get going. Your car is full of gas, isn't it?\"\n \n Janet was dazed.\n \n \"The Chevy? I had it filled up yesterday afternoon.\" Janet moved toward the stairs. \"Ed, I—\"\n \n \"Call the twins!\" Ed unlocked the front door and peered out. Nothing stirred. No sign of life. All right so far.\n \n \"Come on downstairs,\" Janet called in a wavering voice. \"We're—going out for awhile.\"\n \n \"Now?\" Tommy's voice came.\n \n \"Hurry up,\" Ed barked. \"Get down here, both of you.\"\n \n Tommy appeared at the top of the stairs. \"I was doing my home work. We're starting fractions. Miss Parker says if we don't get this done—\"\n \n \"You can forget about fractions.\" Ed grabbed his son as he came down the stairs and propelled him toward the door. \"Where's Jim?\"\n \n \"He's coming.\"\n \n Jim started slowly down the stairs. \"What's up, Dad?\"\n \n \"We're going for a ride.\"\n \n \"A ride? Where?\"\n \n Ed turned to Janet. \"We'll leave the lights on. And the TV set. Go turn it on.\" He pushed her toward the set. \"So they'll think we're still—\"\n \n He heard the buzz. And dropped instantly, the long butcher knife out. Sickened, he saw it coming down the stairs at him, wings a blur of motion as it aimed itself. It still bore a vague resemblance to Jimmy. It was small, a baby one. A brief glimpse—the thing hurtling at him, cold, multi-lensed inhuman eyes. Wings, body still clothed in yellow T-shirt and jeans, the mimic outline still stamped on it. A strange half-turn of its body as it reached him. What was it doing?\n \n A stinger.\n \n Loyce stabbed wildly at it. It retreated, buzzing frantically. Loyce rolled and crawled toward the door. Tommy and Janet stood still as statues, faces blank. Watching without expression. Loyce stabbed again. This time the knife connected. The thing shrieked and faltered. It bounced against the wall and fluttered down.\n \n Something lapped through his mind. A wall of force, energy, an alien mind probing into him. He was suddenly paralyzed. The mind entered his own, touched against him briefly, shockingly. An utterly alien presence, settling over him—and then it flickered out as the thing collapsed in a broken heap on the rug.\n \n It was dead. He turned it over with his foot. It was an insect, a fly of some kind. Yellow T-shirt, jeans. His son Jimmy.... He closed his mind tight. It was too late to think about that. Savagely he scooped up his knife and headed toward the door. Janet and Tommy stood stone-still, neither of them moving.\n \n The car was out. He'd never get through. They'd be waiting for him. It was ten miles on foot. Ten long miles over rough ground, gulleys and open fields and hills of uncut forest. He'd have to go alone.\n \n Loyce opened the door. For a brief second he looked back at his wife and son. Then he slammed the door behind him and raced down the porch steps.\n \n A moment later he was on his way, hurrying swiftly through the darkness toward the edge of town.\n \n \n \n The early morning sunlight was blinding. Loyce halted, gasping for breath, swaying back and forth. Sweat ran down in his eyes. His clothing was torn, shredded by the brush and thorns through which he had crawled. Ten miles—on his hands and knees. Crawling, creeping through the night. His shoes were mud-caked. He was scratched and limping, utterly exhausted.\n \n But ahead of him lay Oak Grove.\n \n He took a deep breath and started down the hill. Twice he stumbled and fell, picking himself up and trudging on. His ears rang. Everything receded and wavered. But he was there. He had got out, away from Pikeville.\n \n A farmer in a field gaped at him. From a house a young woman watched in wonder. Loyce reached the road and turned onto it. Ahead of him was a gasoline station and a drive-in. A couple of trucks, some chickens pecking in the dirt, a dog tied with a string.\n \n The white-clad attendant watched suspiciously as he dragged himself up to the station. \"Thank God.\" He caught hold of the wall. \"I didn't think I was going to make it. They followed me most of the way. I could hear them buzzing. Buzzing and flitting around behind me.\"\n \n \"What happened?\" the attendant demanded. \"You in a wreck? A hold-up?\"\n \n Loyce shook his head wearily. \"They have the whole town. The City Hall and the police station. They hung a man from the lamppost. That was the first thing I saw. They've got all the roads blocked. I saw them hovering over the cars coming in. About four this morning I got beyond them. I knew it right away. I could feel them leave. And then the sun came up.\"\n \n The attendant licked his lip nervously. \"You're out of your head. I better get a doctor.\"\n \n \"Get me into Oak Grove,\" Loyce gasped. He sank down on the gravel.\n\"We've got to get started—cleaning them out. Got to get started right away.\"\n \n \n \n They kept a tape recorder going all the time he talked. When he had finished the Commissioner snapped off the recorder and got to his feet. He stood for a moment, deep in thought. Finally he got out his cigarettes and lit up slowly, a frown on his beefy face.\n \n \"You don't believe me,\" Loyce said.\n \n The Commissioner offered him a cigarette. Loyce pushed it impatiently away. \"Suit yourself.\" The Commissioner moved over to the window and stood for a time looking out at the town of Oak Grove. \"I believe you,\" he said abruptly.\n \n Loyce sagged. \"Thank God.\"\n \n \"So you got away.\" The Commissioner shook his head. \"You were down in your cellar instead of at work. A freak chance. One in a million.\"\n \n Loyce sipped some of the black coffee they had brought him. \"I have a theory,\" he murmured.\n \n \"What is it?\"\n \n \"About them. Who they are. They take over one area at a time. Starting at the top—the highest level of authority. Working down from there in a widening circle. When they're firmly in control they go on to the next town. They spread, slowly, very gradually. I think it's been going on for a long time.\"\n \n \"A long time?\"\n \n \"Thousands of years. I don't think it's new.\"\n \n \"Why do you say that?\"\n \n \"When I was a kid.... A picture they showed us in Bible League. A religious picture—an old print. The enemy gods, defeated by Jehovah. Moloch, Beelzebub, Moab, Baalin, Ashtaroth—\"\n \n \"So?\"\n \n \"They were all represented by figures.\" Loyce looked up at the Commissioner. \"Beelzebub was represented as—a giant fly.\"\n \n The Commissioner grunted. \"An old struggle.\"\n \n \"They've been defeated. The Bible is an account of their defeats. They make gains—but finally they're defeated.\"\n \n \"Why defeated?\"\n \n \"They can't get everyone. They didn't get me. And they never got the Hebrews. The Hebrews carried the message to the whole world. The realization of the danger. The two men on the bus. I think they understood. Had escaped, like I did.\" He clenched his fists. \"I killed one of them. I made a mistake. I was afraid to take a chance.\"\n \n The Commissioner nodded. \"Yes, they undoubtedly had escaped, as you did. Freak accidents. But the rest of the town was firmly in control.\" He turned from the window. \"Well, Mr. Loyce. You seem to have figured everything out.\"\n \n \"Not everything. The hanging man. The dead man hanging from the lamppost. I don't understand that. Why? Why did they deliberately hang him there?\"\n \n \"That would seem simple.\" The Commissioner smiled faintly. \" Bait. \"\n \n Loyce stiffened. His heart stopped beating. \"Bait? What do you mean?\"\n \n \"To draw you out. Make you declare yourself. So they'd know who was under control—and who had escaped.\"\n \n Loyce recoiled with horror. \"Then they expected failures! They anticipated—\" He broke off. \"They were ready with a trap.\"\n \n \"And you showed yourself. You reacted. You made yourself known.\" The Commissioner abruptly moved toward the door. \"Come along, Loyce. There's a lot to do. We must get moving. There's no time to waste.\"\n \n Loyce started slowly to his feet, numbed. \"And the man. Who was the man? I never saw him before. He wasn't a local man. He was a stranger. All muddy and dirty, his face cut, slashed—\"\n \n There was a strange look on the Commissioner's face as he answered.\n\"Maybe,\" he said softly, \"you'll understand that, too. Come along with me, Mr. Loyce.\" He held the door open, his eyes gleaming. Loyce caught a glimpse of the street in front of the police station. Policemen, a platform of some sort. A telephone pole—and a rope! \"Right this way,\" the Commissioner said, smiling coldly.\n \n \n \n As the sun set, the vice-president of the Oak Grove Merchants' Bank came up out of the vault, threw the heavy time locks, put on his hat and coat, and hurried outside onto the sidewalk. Only a few people were there, hurrying home to dinner.\n \n \"Good night,\" the guard said, locking the door after him.\n \n \"Good night,\" Clarence Mason murmured. He started along the street toward his car. He was tired. He had been working all day down in the vault, examining the lay-out of the safety deposit boxes to see if there was room for another tier. He was glad to be finished.\n \n At the corner he halted. The street lights had not yet come on. The street was dim. Everything was vague. He looked around—and froze.\n \n From the telephone pole in front of the police station, something large and shapeless hung. It moved a little with the wind.\n \n What the hell was it?\n \n Mason approached it warily. He wanted to get home. He was tired and hungry. He thought of his wife, his kids, a hot meal on the dinner table. But there was something about the dark bundle, something ominous and ugly. The light was bad; he couldn't tell what it was. Yet it drew him on, made him move closer for a better look. The shapeless thing made him uneasy. He was frightened by it. Frightened—and fascinated.\n \n And the strange part was that nobody else seemed to notice it.",
      "metadata": {
        "title": "The Hanging Stranger",
        "author": "Philip K. Dick",
        "passage_id": "41562",
        "uid": "87752231c27b4c398d0d1f1e6621539d",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "112",
                "uid": "5a9630061ba54e72a1fd16211118e22a",
                "response_text": "Edward Loyce spends the whole day repairing the foundation. When he drives past the town park, he sees a thing hanging under the lamppost. He realizes that it’s a hanging human. Ed is frightened because of the hanged body and because everyone seems to not care about it. People walk past and ignore it. Ed tells the owners of other shops, trying to figure out the situation. However, both the owners think it is normal. After realizing he is the only one who feels strange, Ed gets closer to the hanged body, noticing that it’s a stranger. He bumps into Jenkins, a stationary clerk. Through the conversation with Jenkins and the jewelry store owner, he realizes that he is the only normal person in the town. He shouts to get the police, makes his way through the crowd, and finally gets into the police’s car.\n\nWhen he tries to understand the situation from the police, he realizes that the police are fake because he knows every cop in the town. He escapes from the fake police. When he gets closer to the police station, he sees a swarm of alien flies landing on the roof of City Hall and flying inside of the building, disguising themselves as men coming out of the City Hall. Ed realizes that they are aliens from other dimensions trying to control the humans and already control the minds of town people, except for him, as he escapes from it when repairing the foundation. He cautiously leaves and takes the bus. People on the bus are mind-controlled. A man with a book is looking at him, and Ed guesses the identity of the seemingly mind-clear man. When another older man ascends the bus and looks at the man with the book, Ed realizes the strangeness and escapes from the bus. Two men come after Ed, and Ed kills the man with the book and runs away. A doubt about killing the wrong person flashes through his mind, but he has no time to think.\n\nHe tells his wife to get ready to leave when he gets home. He picks up a butcher knife and explains everything to his wife. When the twins come down, he sees a baby alien fly come toward him. Ed kills the alien, abandons his dazed wife and child, and flees. He runs ten miles towards Oak Grove. He explains everything to the Commissioner. The Commissioner records and agrees with his saying. Ed talks about his theory of the alien, but he cannot figure out the purpose of the hanged body. Finally, the Commissioner tells him that it is bait to lure people like him who escape successfully. Ed is frightened and realizes that he will be hanged in Oak Grove, just like the hanged body in Pikeville. That evening, Clarence Mason, the vice president of the Oak Grove Merchant’s Bank, sees a hanging object under the telephone pole in front of the police station.\n"
              },
              {
                "worker_id": "111",
                "uid": "4482a8e00d094ec78fa09429698dce4e",
                "response_text": "The story follows a regular man named Ed. The story follows Ed as he goes from his house to a shop that he owns. On his way there, he sees a dead body hanging from a tree in the town square. When he tells his coworkers, no one seems to understand the true implications of the hanging body, and Ed is the only one that takes it seriously. Ed starts to ask his coworkers why they are taking the hanging body so well, and Ed ends up being arrested by the town’s police. In the police car, Ed tries to explain his reaction to the policemen. He realizes that they aren’t real policemen, as Ed already knew every policeman in the town. Ed manages to escape and tries to head back home. While running, he sees a swarm of large alien-like bugs. He learns that they can control humans and imitate their actions. After seeing this, he gets on a bus and realizes that almost everyone in the bus is being controlled by the bugs. He also sees 2 people that seem different. He escapes the bus and is followed by the 2 same men. He gets into a fight with them and ends up killing one of them with a rock, thinking that they were controlled by bugs. He runs to his house to get his family and escape the town, but when he gets there he realizes that they were already being controlled by the bugs. He kills one of his sons and escapes alone. He gets to another town where he tries to explain everything to a police officer, but the police officer seemed very calm after everything that Ed had said, and the same cycle continues when another man finds a hanging body again."
              },
              {
                "worker_id": "107",
                "uid": "494353cd0c6b400f9848645117ea1ab4",
                "response_text": "Ed Loyce goes to his TV store at five o’clock, and he is tired from digging dirt out of the basement. He stops his Packard at a red light while observing other people; the store has been open without him all day. There is no place to park in front of LOYCE TV SALES AND SERVICE, but he does a shapeless dark bundle swinging a little from the wind. As he brings his car around, he realizes that it is a human body. Loyce tells his co-workers Don Fergusson and Jack Potter about the body, but they seem untroubled about it. Nobody pays attention to the body, and Loyce feels sick. He bumps into Jenkins and Margaret Henderson, both who assume that he is sick because of his reactions. Two cops show up, and they tell him that he missed the announcement earlier today. As he gets into the police car, he realizes that they weren’t cops in Pikeville. Loyce manages to get away, stopping at the entrance of an alley. He heads towards the City Hall and sees fluttering shapes from the sky. The shapes are similar to giant insects with wings, and he wonders if there are more. Loyce realizes that they are aliens with the ability to change into man, and he boards a bus to get out of the area. Everyone seems fairly normal, but he notices a man watching him with shrewd eyes. He rushes out of the bus, and the man follows him. Loyce strikes the man with a rock and runs away as other people begin to gather. Janet asks what is happening when he returns him, and he tells her that the entire town is under control of the aliens now. The twins are called down, as Loyce tells him that they are going on a ride. Suddenly, there is a buzz and one of the aliens that bears a resemblance to Jimmy hurls itself at him. Loyce stabs it, realizing that his wife and other son are also controlled because of how expressionless they are. Eventually, he reaches Oak Grove and talks to the Commissioner. The Commissioner explains that he thinks this has been going on for a long time, and Loyce thinks about the man he accidentally killed. It turns out that the dead man was bait to draw out who had escaped, and the Commissioner tells him to come along as there is no time to waste. The last thing Loyce sees is a telephone pole and a rope on the street in front of the police station. The story then cuts to Clarence Mason preparing to go home after a long day working in the vaults. However, he notices a shapeless thing that looks like an ominous bundle hanging. He finds it strange that nobody else has noticed it. "
              },
              {
                "worker_id": "113",
                "uid": "6f320180ff0746608abfd2f404bb5105",
                "response_text": "Ed Loyce is the owner of a TV sales store. After a day of digging in his basement, he decided to drive to his store in the evening. While searching for a parking spot, he notices some bundle hanging from a lamppost in a town park, not far from his store. Moments later, he realizes it’s a human body. Loyce is shocked and starts asking his salesman Don Fergusson about the body but gets an indefinite answer. Jack Potter, a shoe shop’s employee, also calmly states that there has to be some valid reason behind it. Don goes back to work, surprisingly unbothered. Ed walks to the park to look at the dead man: not a local, his skin is cut gouged. Ed then meets a clerk named Jenkins, who asks why Ed looks sick. Loyce becomes hysterical, and people start gathering around him, wondering why someone is screaming. Two cops detain him and decide to drive Ed to the Hall of Justice. They start asking questions: his name, where he was during the day. Ed knows they are not real policemen - he knows all the cops of Pikeville - and eventually jumps out of the car when it slows down. He runs away and then sees a splotch of darkness above the City Hall and some alien figures coming through this slit. They can disguise themselves as men. He gets on the bus and inspects the other passengers - they seem to be under the influence of the alien creatures. Two men look at Ed with suspicion, and he quickly gets off the bus. He kills one of them with a rock while running away. Ed comes home and orders his wife and kids to get ready to leave the town immediately. His younger son seems to be under the control of a small alien. Ed stabs the creature, killing it. His wife and the other son are not reacting - they are subservient to the aliens, too. Ed runs away alone. He gets to a patrol station after crawling and limping for ten miles. The station’s attendant hears Ed’s story and looks confused. Loyce asks the man to get him to Oak Grove. Later, he tells his story to the Commissioner of Oak Grove, the officer believes him. Ed suggests that these creatures have been inhabiting the planet’s towns for a long time. He thinks the Jewish people defeated them and showed it in the Bible, illustrating Beelzebub as a giant fly, an alien insect. The Commissioner then explains that the dead body probably served as bait for people who were not yet under the aliens’ control. He asks Loyce to come with him somewhere. In the next scene, the vice president of the Oak Grove Merchants’ Bank leaves work after spending the day in the vault, examining deposit boxes. He suddenly sees a dark bundle hanging in front of the police station. \n"
              }
            ]
          },
          {
            "question_text": "Who is Edward C. Loyce, and what are his characteristics?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "112",
                "uid": "5a9630061ba54e72a1fd16211118e22a",
                "response_text": "Edward C. Loyce has been the owner of the TV sales store in the town for twenty-five years, and he is also called Ed by the town people. He is forty years old, living at 1368 Hurst Road, Pikeville. He has a wife, Janet, and twin sons, Jimmy and Tommy. He owns a Packard. He is practical and always tries to correct wrong things. He is friendly because he knows everyone in the town, and everyone seems to have a good relationship with him. Ed is brave because when he realizes that nobody pays attention to the hanged body in the town park, he gets closer and tries to figure out who the corpse is. Ed is also brilliant because he grasps the abnormal situations immediately after noticing the difference between the current situation and the normal one and because he sees the alien’s power flaws right after knowing the situation. He is also practical because he plans what he should do right after grasping the situation in the town. He is cautious as he kills the man with the book on the bus, not letting the aliens' slight chance get him. His will is formidable because he runs with his feet for ten miles along the rough ground to escape from Pikeville and because he makes the decision immediately when he knows that he has to abandon his family."
              },
              {
                "worker_id": "111",
                "uid": "4482a8e00d094ec78fa09429698dce4e",
                "response_text": "Edward C. Loyce is a man who lives in a small town, and is the owner of a TV sales store. He seems to be very intelligent, determined and can handle himself in a fight. Once Ed is put in a situation in which he is in danger, he immediately starts to think about what he can do to survive. He did this in the police car, in the bus and in his house when he had to kill one of his children. He is also described as a practical man. "
              },
              {
                "worker_id": "107",
                "uid": "494353cd0c6b400f9848645117ea1ab4",
                "response_text": "Edward C. Loyce is the owner of LOYCE TV SALES AND SERVICES. He is married to his wife Janet; he also has two twin sons named Jimmy and Tommy. Loyce is described to be a forty year old man. He is also a very brave person, being unafraid to stab the alien that hurled itself at him even when it bore a vague resemblance to his son. He also chose to act quickly after seeing the aliens go to the City Hall. Loyce is also very perceptive as well, realizing that the two cops weren’t actually cops because he knew every cop in Pikeville. Even though he is very perceptive, it can cause him to become overly-paranoid as he accidentally killed one of the other men who escaped the alien control because he suspected that the man was one of the aliens. He is shown to love his family very much, choosing to go back for them in hopes that the whole town is not completely controlled yet"
              },
              {
                "worker_id": "113",
                "uid": "6f320180ff0746608abfd2f404bb5105",
                "response_text": "Edward C. Loyce is a forty-year-old citizen of Pikeville. He owns Loyce TV sales and service store. At the beginning, we learn that he is a practical person. He is friendly and approachable, many people know him and his store, and he’s also met every police officer in the town. He is terrified by death and instantly starts looking for something that could explain a dead body hanging from a lamppost. He’s also quite shrewd and good at pretending. We see that, when he manages to deceive two cops and escape after he realizes that they are not real police officers. He also shows his intellect when sharing his assumption regarding the creatures and referencing the biblical image. He cares for his family and tries to take them with him, to hide them from the alien creatures but is then forced to leave them. \n"
              }
            ]
          },
          {
            "question_text": "What role does the hanged human body play in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "112",
                "uid": "5a9630061ba54e72a1fd16211118e22a",
                "response_text": "The hanged human body is bait to lure people who escape successfully from the mind control of alien flies and draw themselves out. People who are not under mental control would try everything they can to escape from the controlled town to the nearby uncontrolled town, but when they arrive in the uncontrolled town, they will be hanged as another bait in the new town, just like what happens to Ed Loyce in the story. When Ed notices the hanged body in the park and the strangeness that nobody cares about, he tries everything to alert people and escape. Yet, he ends up being suspended by the Commissioner in the town nearby as a new bait to lure people like him. The fact that the uncontrolled person escapes from the controlled town is also why the hanged body looks like a stranger in a town because the person often comes from another town. This fact also constitutes why the body is caked with mud, and its clothes are torn and ripped because it is the consequence of a long journey from another town to where it is hanged."
              },
              {
                "worker_id": "111",
                "uid": "4482a8e00d094ec78fa09429698dce4e",
                "response_text": "The hanging body is an important part of the story because it is what tells Ed that something is wrong with the people around him. When Ed sees the hanging body in the middle of the town square, he tries to tell everyone around that something is wrong, but no one seems to care. At the end, Ed figures out that the body was used by the aliens to lure out the humans that they hadn’t controlled yet, which is exactly what happened to him. Also, it is insinuated that Ed was killed and hanged in another town to repeat the same cycle again. "
              },
              {
                "worker_id": "107",
                "uid": "494353cd0c6b400f9848645117ea1ab4",
                "response_text": "The hanged human body is supposed to be a bait for the aliens to figure out who has escaped their control. As an escaped person would not have received the announcement that there was a body being hanged, it would allow them to better capture the escaped person. The hanged human body is also implied to be another person who escaped, because Clarence Mason also sees a body that is hanging. Since both Ed Loyce and Clarence Mason had a freak chance of not being infected by the aliens, because they were not present for the so-called “announcement” of the hanged body, it also makes them targets. For Loyce, the hanged body is the start of his observation of the aliens and realization that the entire town is under control. \n"
              },
              {
                "worker_id": "113",
                "uid": "6f320180ff0746608abfd2f404bb5105",
                "response_text": "This body serves as bait to help the alien insects find people that are not yet under their control. The body draws Ed’s attention, and eventually, he gets taken by the aliens disguised as police officers. It helps him initially realize that something has changed the town's citizens. He soon finds out that Pikeville has been invaded by some aliens. At the end, we also learn that this hanging man was probably a citizen of some nearby town who, just like Loyce, managed to escape the alien insects and come to Pikeville to get help. These insects have invaded more than one city. They kill survivors to make them serve as baits for future survivors. "
              }
            ]
          },
          {
            "question_text": "What are the alien flies, and what are their characteristics?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "112",
                "uid": "5a9630061ba54e72a1fd16211118e22a",
                "response_text": "The alien flies have multi-lensed inhuman eyes, wings, and a stinger. They are dark, coming from another dimension. They look like giant insects in their original form. When they move, they will produce a buzzing sound. They can mimic the appearance of humans, and they can control human minds. However, their mind control ability has its limit that they can control one area at one time, starting from the highest authority and widening down the control in a circle. When they control the whole town, they move to another area to continue. Their power flaw makes them unable to control everyone that someone may be overlooked. When that is the case, they set up a trap, using people who escape from the controlled town as bait to hang them in public, to lure people who are not under control to come to them by themselves. They anticipate their failures and are smart enough to make up for their flaws."
              },
              {
                "worker_id": "111",
                "uid": "4482a8e00d094ec78fa09429698dce4e",
                "response_text": "The alien flies are the creatures that invaded Ed’s town and started to control everyone. They entered the town above town hall through a portal-like chasm in swarms. They were described as large bugs, with human characteristics. They could easily imitate humans, which is why it was hard at first for Ed to distinguish who was who. They are described as violent and fearless, but they weren’t omnipotent. They made mistakes when controlling people, which is what allowed Ed to initially be free of their control. "
              },
              {
                "worker_id": "107",
                "uid": "494353cd0c6b400f9848645117ea1ab4",
                "response_text": "The alien flies are a strange type of species that have come in hopes of controlling the entire town. The Commissioner says that he has a theory of who they are. Most of the alien flies try to take over one area at a time, starting from the highest level and working down to widen the circle. Eventually, they move to a different town once the one they are currently controlling is firmly in their grasp. This has also been happening for thousands of years. Physically, they are giant insects with wings, capable of blending in as pseudo-men. When the one that resembles Jimmy attacks Loyce, he notes that it has wings and cold in-human eyes. There is also a stinger when it turns its body. The alien flies are dedicated to carrying out their mission of controlling the entire town. They do not have any personal emotions, but they are willing to get rid of any obstacle that stands in their way. The flies are very intelligent too, capable of mimicking humans almost perfectly and using bait to draw out the escaped ones. "
              },
              {
                "worker_id": "113",
                "uid": "6f320180ff0746608abfd2f404bb5105",
                "response_text": "The alien flies are some unknown creatures that came to Pikeville through a slit in the shell of the universe and occupied the town’s citizens’ minds and bodies. They have been doing this for thousands of years - Ed remembered their image was in the Bible. They are smart and can disguise themselves as humans. They also can anticipate their own mistakes and create certain mechanisms to locate people whose minds they haven’t yet invaded. For example, they hang dead bodies in the central part of a town. This image can disturb only ones who are not aware of the aliens. \n\n"
              }
            ]
          },
          {
            "question_text": "What is the setting of the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "112",
                "uid": "5a9630061ba54e72a1fd16211118e22a",
                "response_text": "The story happens in Pikeville town and Oak Grove town. The first scene occurs in the town park where the hanged body is. In the park, there is a lamppost, a drinking fountain, and a bench. Under the lamppost, the body is hanged. The second scene is in the car, where Ed has a conversation with the fake police. When Ed escapes from the fake police, he runs into a hardware store filled with customers and clerks. There is a back door in the shipping room, a garbage can next to the door, and concrete stairs outside the store towards the top of the fence. The other side of the fence is an entrance to an alley, which is filled with boards and ruined boxes and tires. Passing the loading platform of a grocery store stands one wall of the Hall of Justice. The wall is white with barred windows. The City Hall is next to the police station, with yellow wooden walls with brass cement steps. Cedars and flowers are planted on each side of the entrance. \n\nWhen Ed gets on the bus, the people sitting around him are all dull, tired, and quiet. No one pays attention to him. People seem to be normal: one is reading the newspaper, another with business suits sits quietly, and the other gazes absently towards the front. When Ed escapes from the bus, he runs into a residential district, pavement sides with tall apartment buildings and lawns. \n\nWhen Ed comes home, there are windows with shades in the living room. The house is a two-floor building. The twin’s room is upstairs. There is a basement in the house. In the kitchen, a butcher knife lies in the drawer under the sink. On his way to Oak Grove, rough ground, gullies, open fields, and forest are along the way. \n\nIn Oak Grove, there is a gasoline station and drive-in. Several trucks park there—some chickens on the field and a dog tied with the string. In front of the police station in Oak Grove, a telephone pole is suitable to hang a human body.\n"
              },
              {
                "worker_id": "111",
                "uid": "4482a8e00d094ec78fa09429698dce4e",
                "response_text": "The story is set in a small town named Pikeville. The town is described as very small, composed of a town center with a square. The town’s town hall is where the aliens’ portal was, so it was covered by a swarm of them. The town also has different streets and highways, which Ed needs to take in order to leave the town. He ended up crawling out of the town because he didn’t want to be seen, and he ended up hurt and scratched because the town had a lot of shrubbery and plants. "
              },
              {
                "worker_id": "107",
                "uid": "494353cd0c6b400f9848645117ea1ab4",
                "response_text": "The story is first set in Pikeville, where Ed has spent the day digging dirt out of his basement and wheeling it into the backyard. His television store is also located in the town, where there are many other commuters. There is a little square of green in the center of the street that serves as the town park. The park also has a lonely drinking fountain, bench, and single lamppost. The dead body hangs from this lamppost. The town also has a Hall of Justice, City Hall, and police station. The Hall of Justice has barred windows and a police antenna. The City Hall, however, is an old-fashioned yellow structure of good, gilded brass, and cement steps. There are also buses that take commuters back home after the day. Loyce’s home has a living room, upstairs, kitchen, and basement. Later, the scene changes to Oak Grove, where there are farm fields, stations, and even a police station. It is also home to the Oak Grove Merchants’ Bank, where Clarence Mason spends the day working in the vaults."
              },
              {
                "worker_id": "113",
                "uid": "6f320180ff0746608abfd2f404bb5105",
                "response_text": "The majority of the story happens in Pikeville. At five o’clock, Ed drives from his house to his TV store across town. It’s getting dark. He passes a small park where he notices the hanging body. Later, he is taken by two officers, and they are driving towards the City Hall. It’s already gloomy outside - the sun has set. After escaping, he runs through a hardware store, climbs over a fence, and moves down a street alley. He can see the City Hall’s roof. Then, he gets on a bus but soon runs away from the two suspicious passengers. He comes home and realizes that his family is under the influence of the alien flies. He crawls for ten miles, walks by a farm, and reaches a gasoline station, a couple of trucks parked near it. After that, he ends up at the police station of Oak Grove, the town near Pikeville. At the end, we meet another character who is leaving the Oak Grove Merchants’ Bank."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5238,
        "document_length_chars": 30123
      }
    }
  ]
}