{
  "item_metadata": {
    "item_id": "47841",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "47841",
      "content": "The Haunted Fountain\n \n\n\n CHAPTER I\n \n An Unsolved Mystery\n \n “Tell Judy about it,” begged Lois. “Please, Lorraine, it can’t be as bad as it appears. There isn’t anything that Judy can’t solve.”\n \n \n Lorraine tilted her head disdainfully. “We’re sisters now. We’re both Farringdon-Petts and should be loyal to each other. But you always did take Judy’s part. She was the one who nearly spoiled our double wedding trying to solve a mystery. I don’t believe she’d understand—understand any better than I do. Everyone has problems, and I’m sure Judy is no exception.”\n \n \n “You’re right, Lorraine,” announced Judy, coming in to serve dessert to the two friends she had invited for lunch at Peter’s suggestion. “I do have problems, and there are plenty of mysteries I can’t solve.”\n \n \n “Name one,” charged Lois. “Just mention one single spooky thing you couldn’t explain, and I’ll believe you. I’ve seen you in action, Judy Bolton—”\n \n \n “Judy Dobbs, remember?”\n \n \n “Well, you were Judy Bolton when you solved all those mysteries. I met you when the whole valley below the big Roulsville dam was threatened by flood and you solved that—”\n \n \n “That,” declared Judy, “was my brother Horace, not me. He was the hero without even meaning to be. He was the one who rode through town and warned people that the flood was coming. I was off chasing a shadow.”\n \n \n “A vanishing shadow,” Lois said with a sigh.\n“What you did wasn’t easy, Judy.”\n \n \n “It didn’t need to be as hard as it was,” Judy confessed.\n“I know now that keeping that promise not to talk about the dam was a great big mistake and could have cost lives. I should have told Arthur.”\n \n \n “Please,” Lorraine said, a pained expression clouding her pretty face, “let’s not talk about him now.”\n \n \n “Very well,” Judy agreed. “What shall we talk about?”\n \n \n “You,” Lois said, “and all the mysteries you’ve solved. Maybe you were mistaken about a thing or two before the flood, but what about the haunted\n house you moved into? You were the one who tracked down the ghosts in the attic and the cellar and goodness knows where all. You’ve been chasing ghosts ever since I met you, and not one of them did you fail to explain in some sensible, logical fashion.”\n \n \n “Before I met you,” Judy said, thinking back,\n“there were plenty of them I couldn’t explain. There was one I used to call the spirit of the fountain, but what she was or how she spoke to me is more than I know. If my grandparents knew, they weren’t telling. And now they’re both dead and I can’t ask them. They left me a lot of unsolved mysteries along with this house. Maybe I’ll find the answers to some of them when I finish sorting Grandma’s things. They’re stored in one end of the attic.”\n \n \n “Another haunted attic? How thrilling!” exclaimed Lois. “Why don’t you have another ghost party and show up the spooks?”\n \n \n “I didn’t say the attic was haunted.”\n \n \n Judy was almost sorry she had mentioned it. She wasn’t in the mood for digging up old mysteries, but Lois and Lorraine insisted. It all began, she finally told them, the summer before they met. Horace had just started working on the paper. Judy remembered that it was Lorraine’s father, Richard Thornton Lee, who gave him his job with the Farringdon Daily Herald . He had turned in some interesting church news, convincing Mr. Lee that he had in him\n the makings of a good reporter. And so it was that he spent the summer Judy was remembering in Farringdon where the Farringdon-Petts had their turreted mansion, while she had to suffer the heat and loneliness of Dry Brook Hollow.\n \n \n Her thoughts were what had made it so hard, she confessed now as she reviewed everything that had happened. She just couldn’t help resenting the fact that her parents left her every summer while they went off on a vacation by themselves. What did they think she would do?\n \n \n “You’ll have plenty to read,” her father had told her. “I bought you six new books in that mystery series you like. When they’re finished there are plenty of short stories around. Your grandmother never throws anything away. She has magazines she’s saved since your mother was a girl. If you ask for them she’ll let you have the whole stack. I know how you love to read.”\n \n \n “I do, Dad, but if the magazines are that old—”\n \n \n Judy had stopped. She had seen her father’s tired eyes and had realized that a busy doctor needed a vacation much more than a schoolgirl who had too little to do. He and Judy’s mother usually went to the beach hotel where they had honeymooned. It was a precious memory. Every summer Dr. Bolton and his wife relived it. And every summer Judy went to stay with her grandmother Smeed, who scolded and fussed and tried to pretend she wasn’t glad to have her.\n \n \n “You here again?” she had greeted her that summer, and Judy hadn’t noticed her old eyes twinkling behind her glasses. “What do you propose to do with yourself this time?”\n \n \n “Read,” Judy had told her. “Mom and Dad say you have a whole stack of old magazines—”\n \n \n “In the attic. Go up and look them over if you can stand the heat.”\n \n \n Judy went, not to look over the old magazines so much as to escape to a place where she could have a good cry. It was the summer before her fifteenth birthday. In another year she would have outgrown her childish resentment of her parents’ vacation or be grown up enough to ask them to let her have a vacation of her own. In another year she would be summering among the beautiful Thousand Islands and solving a mystery to be known as the Ghost Parade .\n \n \n “A whole parade of ghosts,” Lois would be telling her, “and you solved everything.”\n \n \n But then she didn’t even know Lois. She had no idea so many thrilling adventures awaited her. There seemed to be nothing—nothing—and so the tears came and spilled over on one of the magazines. As Judy wiped it away she noticed that it had fallen on a picture of a fountain.\n \n \n “A fountain with tears for water. How strange!” she remembered saying aloud.\n \n \n Judy had never seen a real fountain. The thrill of walking up to the door of the palatial Farringdon-Pett mansion was still ahead of her. On the lawn a fountain still caught and held rainbows like those she was to see on her honeymoon at Niagara Falls. But all that was in the future. If anyone had told the freckled-faced, pigtailed girl that she would one day marry Peter Dobbs, she would have laughed in their faces.\n \n \n “That tease!”\n \n \n For then she knew Peter only as an older boy who used to tease her and call her carrot-top until one day she yelled back at him, “Carrot-tops are green and so are you!”\n \n \n Peter was to win Judy’s heart when he gave her a kitten and suggested the name Blackberry for him. The kitten was now a dignified family cat. But the summer Judy found the picture of a fountain and spilled tears on it she had no kitten. She had nothing, she confessed, not even a friend. It had helped to pretend the fountain in the picture was filled with all the tears lonely girls like herself had ever cried.\n \n \n “But that would make it enchanted!” she had suddenly exclaimed. “If I could find it I’d wish—”\n \n \n A step had sounded on the stairs. Judy remembered it distinctly. She had turned to see her grandmother\n and to hear her say in her usual abrupt fashion,\n“Enchanted fountain, indeed! If you let people know your wishes instead of muttering them to yourself, most of them aren’t so impossible.”\n \n \n “Were they?” asked Lois.\n \n \n She and Lorraine had listened to this much of what Judy was telling them without interruption.\n \n \n “That’s the unsolved mystery,” Judy replied.\n“There weren’t any of them impossible.”\n \n \n And she went on to tell them how, the very next day, her grandparents had taken her to a fountain exactly like the one in the picture. It was in the center of a deep, circular pool with steps leading up to it. Beside the steps were smaller fountains with the water spurting from the mouths of stone lions. Judy had stared at them a moment and then climbed the steps to the pool.\n \n \n “Am I dreaming?” she remembered saying aloud.\n“Is this beautiful fountain real?”\n \n \n A voice had answered, although she could see no one.\n \n \n “Make your wishes, Judy. Wish wisely. If you shed a tear in the fountain your wishes will surely come true.”\n \n \n “A tear?” Judy had asked. “How can I shed a tear when I’m happy? This is a wonderful place.”\n \n \n “Shed a tear in the fountain and your wishes will surely come true,” the voice had repeated.\n \n \n “But what is there to cry about?”\n \n \n “You found plenty to cry about back at your grandmother’s house,” the mysterious voice had reminded her. “Weren’t you crying on my picture up there in the attic?”\n \n \n “Then you—you are the fountain!” Judy remembered exclaiming. “But a fountain doesn’t speak. It doesn’t have a voice.”\n \n \n “Wish wisely,” the voice from the fountain had said in a mysterious whisper.\n \n \n\n CHAPTER II\n \n If Wishes Came True\n \n “Did you?” Lois interrupted the story to ask excitedly.\n“Oh, Judy! Don’t keep us in suspense any longer. What did you wish?”\n \n \n “Patience,” Judy said with a smile. “I’m coming to that.”\n \n \n First, she told her friends, she had to think of a wise wish. There had been so much she wanted in those early days before the flood. Dora Scott had been her best friend in Roulsville, but she had moved away.\n \n \n “You see,” she explained, “I made the mistake of having just one best friend. There wasn’t anybody in Dry Brook Hollow. I remember thinking of how lonely I was and how I wished for a friend or a sister,\n and suddenly a tear splashed in the water. It made little ripples. I thought I had to wish quickly before they vanished, and so I began naming the things I wanted as fast as I could. I’m not sure they were wise wishes. They seem rather selfish to me, now. I wasn’t thinking of anybody but me, Judy Bolton, and what I wanted. It wasn’t until after I began to think of others that my wishes started to come true.”\n \n \n “But what were they?” Lois insisted.\n \n \n Lorraine seemed unusually quiet and thoughtful. Judy did not notice the fear in her eyes as she replied airily, “Oh, didn’t I tell you? I wished for lots of friends and a sister, and I wished I could marry a G-man and solve a lot of mysteries and that’s as far as I got when the ripples vanished. I thought the spell was broken and so I didn’t wish for anything more.”\n \n \n “Wasn’t there anything more you wanted?” Lois asked.\n \n \n “Of course,” replied Judy. “There were lots more things. I wanted to go places, of course, and keep pets, and have a nice home, and—”\n \n \n “And your wishes all came true!”\n \n \n “Every one of them,” Judy agreed, “even the one about the sister. You see, it wasn’t a baby sister I wanted. It was a sister near my own age. That seemed impossible at the time, but the future did hold a sister for me.”\n \n \n “It held one for me, too,” Lois said, squeezing Lorraine’s hand under the table. “Don’t you think sisters should tell each other their problems, Judy?”\n \n \n “Honey and I always do,” she replied “but then it was different. I didn’t know I would marry Peter or that he would become a G-man, and he didn’t know he had a sister. It is strange, isn’t it? But the strangest thing of all was the fountain itself.”\n \n \n “Why?” asked Lorraine. “Do you still think it was enchanted?”\n \n \n Lois laughed at this, but Judy was serious as she answered, “I was still little girl enough to think so at the time. I wandered around, growing very drowsy. Then I found a hammock and climbed into it. I must have gone to sleep, because I remember waking up and wondering if the voice in the fountain had been a dream.”\n \n \n “A hammock?” Lois questioned. “Are you sure it wasn’t a flying carpet?”\n \n \n “No, it was a hammock all right,” Judy assured her, laughing. “It was hung between two trees in a beautiful garden all enclosed in rose trellises thick with roses. Did I tell you it was June?”\n \n \n “All the year around?”\n \n \n Again Lois laughed. But Lorraine said abruptly,\n“Let’s not talk about rose gardens in June. It’s a long way from June to December.”\n \n \n “Do you mean a garden changes? I know,” Judy said, “but I think this one would be beautiful at any time of the year. There were rhododendrons, too, and I don’t know how many different kinds of evergreens. I explored the garden all around the fountain.”\n \n \n “And then what happened?” Lorraine urged her.\n \n \n “Yes, yes. Go on,” entreated Lois. “I didn’t dream you’d kept anything that exciting a secret. Why didn’t you try to solve the mystery?”\n \n \n “I think I would have tried,” Judy admitted, “if I had been older or more experienced. I really should have investigated it more thoroughly and learned the secret of the fountain. But after the ripples went away it didn’t speak to me any more, and I didn’t really think it had heard my wishes. I was still wishing for a friend when I met you, Lois. It did seem impossible for us to be friends at first, didn’t it? Lorraine was your friend.”\n \n \n “I did make trouble for you,” Lorraine remembered.\n“It was all because of my foolish jealousy.”\n \n \n “It was nothing compared to the trouble caused by the Roulsville flood,” declared Judy. “After that things started happening so fast that I completely forgot about the fountain. Honestly, Lois, I don’t believe I thought about it again until after we moved to Farringdon and I walked up to your door and saw the fountain on your lawn.”\n \n \n “The Farringdon-Pett puddle, I always called it,” Lois said with a giggle. “I’ve seen lots nicer fountains.”\n \n \n “You have?” asked Judy. “Then maybe you’ve seen the one I’ve been telling you about. I think the picture of it is still in the attic. Come on up and I’ll show you.”\n \n \n Lois and Lorraine had finished their dessert while Judy was telling them the story of the fountain. Somehow, she wasn’t hungry for hers. She had tasted it too often while she was making it.\n \n \n “I’ll leave it for Blackberry,” she decided.\n \n \n Lois watched in amusement as the cat lapped up the chocolate pudding after Judy had mixed it generously with cream.\n \n \n “Sometimes,” Judy said fondly, “Blackberry thinks he’s a person. He eats everything we eat, including lettuce. Do you mind if he comes with us, Lorraine? He wants to explore the attic, too.”\n \n \n “He’ll remember he’s a cat fast enough if there are any mice up there,” Lois said with a giggle.\n \n \n Leaving the table, they all started upstairs with the cat bounding ahead of them. In modernizing her grandparents’ house to suit her own and Peter’s tastes, Judy had seen to it that the old stair door was removed. But there was still a door closing off the narrower stairs that led to the attic. Blackberry reached it first and yowled for Judy to open it.\n \n \n “He can read my mind. He always knows where I’m going,” Judy said as the door creaked open and the cat shot through it. A moment later a weird rolling noise came from the floor above.\n \n \n “Come on. There’s nothing up here to be afraid of,” Judy urged her friends.\n \n \n “Maybe not, but I’m beginning to get the shivers,” confessed Lois as she followed Judy to the sewing room at the top of the last flight of stairs.\n \n \n “So am I,” Lorraine admitted. “I’m not superstitious about black cats, but they are creepy. Does Blackberry have to roll spools across the floor?”\n \n \n “Now he thinks he’s a kitten,” laughed Judy. Pausing at still another door that led to the darker part of the attic, she turned and said mysteriously,\n“Up here we can all turn back the clock. Does anybody care to explore the past?”\n \n \n The exploration began enthusiastically with Judy relating still more of what she remembered about the fountain.\n \n \n “When I told Grandma about it she laughed and said I must have dreamed it. She said if wishes came true that easily she’d be living in a castle. But would she?” Judy wondered. “When I first remember this house she was still burning kerosene lamps like those you see on that high shelf by the window. I think she and Grandpa like the way they lived without any modern conveniences or anything.”\n \n \n “I think so, too,” Lois agreed, looking around the old attic with a shiver. “It is strange they both died the same winter, isn’t it?”\n \n \n “Maybe they wanted it that way. Maybe they wished neither of them would outlive the other. If they did wish in the fountain,” Judy went on more thoughtfully, “I’m sure that was one of their wishes. Another could have been to keep the good old days, as Grandma used to call them. That one came true in a way. They did manage to keep a little of the past when they kept all these old things. That’s what I meant about turning back the clock.”\n \n \n “If wishes came true I’d like to turn it back a little myself,” Lorraine began. “It would be nice if things were the way they used to be when I trusted Arthur—”\n \n \n “Don’t you trust him now?” Judy asked.\n \n \n Afterwards she was sorry for the interruption. Lois and Judy both questioned Lorraine, but that was all she would say. Judy wondered, as they searched through the old magazines, what was wrong. Lorraine was of a jealous disposition. Was the green-eyed monster coming between her and her handsome husband, Arthur Farringdon-Pett? Until now they had seemed blissfully happy. But there was no happiness in Lorraine’s face as she gazed at a picture of one of the fountains and then said in a tight little voice, “It is. It’s the very same one.”\n \n \n “But that’s the picture I’ve been searching for!” Judy said eagerly. “Do you know where it is?”\n \n \n “I can’t be sure. But if it ever was enchanted, I’m sure it isn’t now. Let’s go,” Lorraine said suddenly to Lois. Judy knew she was suggesting a fast trip home. But, apparently, Lois did not understand it that way. If she did, she pretended not to.\n \n \n “Where?” she asked. “To the fountain? I’d love to, wouldn’t you, Judy?”\n \n \n “I certainly would,” Judy replied enthusiastically.\n“Do you recognize it, too?”\n \n \n “I think so,” Lois answered after studying a little more closely the picture they had found. “It looks like the fountain on the Brandt estate.”\n \n \n “The department store Brandts?” Judy questioned.\n“Then my grandparents must have driven old Fanny all the way to Farringdon.”\n \n \n “Not quite all the way,” Lorraine objected. “The Brandts own that stretch of woods just before you come into the city. You’ve passed it lots of times.”\n \n \n “Of course,” agreed Judy. She put the magazine back in its place under the eaves and turned eagerly to her friends. “I do remember a road turning off into the woods and going on uphill,” she told them.\n“I never thought it led to a house, though. There isn’t even a gate. Could that be the road my grandparents took?”\n \n \n “Why don’t we take it ourselves and find out?” Lois suggested.\n \n \n\n CHAPTER III\n \n A Strange Encounter\n \n Lorraine was not too enthusiastic about the proposed trip to the Brandt estate. Finally she agreed to it under one condition. They were not to drive all the way to the house which, she said, was just over the hilltop. They were to park the car where no one would see it and follow the path to the fountain.\n \n \n “But suppose we can’t find the path?” asked Judy.\n \n \n “You’ll remember it, won’t you?”\n \n \n Judy thought she would, but she wasn’t too sure. She and Lois both argued that it would be better to inquire at the house. Lois knew Helen Brandt slightly.\n \n \n “She’d be glad to show us around. This way it looks as if we’re planning a crime,” Lois said as they started off in the blue car she was driving.\n \n \n It was a neat little car, not too conspicuous, and easy to park in out-of-the-way places. Judy laughed and said if they did find the fountain she thought she’d wish for one exactly like it.\n \n \n “Well, you know what your grandmother said about wishes, don’t you?” Lorraine asked. “If you let people know about them instead of muttering them to yourself most of them aren’t so impossible.”\n \n \n “Quite true,” Judy agreed. “I’ll let Peter know about this one. He’s my Santa Claus, and it will soon be Christmas. Maybe I should have worn the fur coat he gave me last year.”\n \n \n “Your reversible’s better in case it rains. It’s too warm for snow. We picked a perfect day for this trip,” Lois continued, guiding the car around curves as it climbed the steep hill beyond Dry Brook Hollow.\n \n \n The trip was a short one. In twenty minutes they had covered the distance that had seemed such a long way to Judy when she was riding in her grandfather’s wagon.\n \n \n “I’ve been thinking about it,” she said, “and I’ve just about figured out how it happened. I didn’t think my grandparents knew the Brandts well enough to pay them a visit, though. We must have looked queer driving up to a beautiful estate in Grandpa’s old farm wagon. I do remember that Grandma had\n some hooked rugs to deliver. But that still doesn’t explain what happened afterwards. When I woke up in the hammock I was alone in the garden. Horse, wagon, grandparents—all had disappeared.”\n \n \n “How could they?” asked Lois.\n \n \n “Anyway,” Lorraine began, “you had a chance to see how beautiful everything was before—”\n \n \n Again she broke off as if there were something she wanted to tell but didn’t quite dare.\n \n \n “Before what?” questioned Judy.\n \n \n “Oh, nothing. Forget I said anything about it. You were telling us how you woke up in the hammock, but you never did explain how you got back home,” Lorraine reminded her.\n \n \n “Didn’t I?” asked Judy. “I’d forgotten a lot of it, but it’s beginning to come back now. I do remember driving home along this road. You see, I thought my grandparents had left me in the garden for a surprise and would return for me. I told you I was all alone. There wasn’t a house in sight.”\n \n \n “The Brandt house is just over the top of this next hill,” Lois put in.\n \n \n “I know. You told me that. Now I know why I couldn’t see it. All I could see was a windowless old tower and a path leading in that direction. Naturally, I followed it. There’s something about a path in the woods that always tempts me.”\n \n \n “We know that, Judy. Honey told us all about your latest mystery. You followed a trail or something.”\n \n \n “Well, this trail led out of the rose garden where the hammock was and then through an archway,” Judy continued. “All sorts of little cupids and gnomes peered out at me from unexpected places. I was actually scared by the time I reached the old tower. There wasn’t time to explore it. Just then I heard the rumble of my grandfather’s wagon and knew he was driving off without me.”\n \n \n “He was!” Judy’s friends both chorused in surprise, and Lois asked, “Why would he do a thing like that?”\n \n \n “I think now it was just to tease me. He did stop and wait for me after a while,” Judy remembered.\n“The rugs were gone. Grandma must have delivered them, but I didn’t ask where. If she made them for Mrs. Brandt they may still be there.”\n \n \n “I wouldn’t depend on it,” Lorraine said as they turned up the narrow road to the Brandt estate.\n \n \n “Watch out!” Judy suddenly exclaimed. “There’s another car coming.”\n \n \n As Lois swerved to avoid the oncoming car, Lorraine ducked her head. She kept herself hidden behind Judy until the car had passed. The man driving it was a stranger to Judy, but she would remember his hypnotic, dark eyes and swarthy complexion for a long time. The soft brown hat he was wearing covered most of his hair.\n \n \n “What’s the matter with you two?” asked Lois when the car had passed. “Aren’t you a little old for playing hide and seek?”\n \n \n “I wasn’t—playing. Let’s not go up there,” Lorraine begged. “I don’t think the Brandts live there any more.”\n \n \n “Maybe not, but we can pretend we think they do, can’t we?” Judy replied a little uncertainly.\n \n \n She was beginning to suspect that Lorraine knew more about the Brandt estate than she was telling.\n \n \n Lois kept on driving along the narrow, gravelly road. Soon there were more evergreens and a hedge of rhododendrons to be seen. They looked very green next to the leafless trees in the woods beyond. The sky was gray with white clouds being driven across it by the wind.\n \n \n “There’s the tower!” Lorraine exclaimed. “I can see it over to the left. It looks like something out of Grimm’s Fairy Tales, doesn’t it?”\n \n \n “It looks grim all right,” agreed Judy. “I wonder what it is.”\n \n \n “I suppose it’s nothing but an old water tower. It would be fun to explore it, though,” Lois said. “But if there are new people living here they’ll never give us permission.”\n \n \n “We might explore it without permission,” Judy suggested daringly. “Come on!” she urged her friends as Lois parked the car in a cleared place beside the road. “Who’s going to stop us? And who wants to explore a gloomy old tower, anyway? Let’s look for the fountain.”\n \n \n “Do you think we should?” Lorraine asked. “It won’t be enchanted. I told you—”\n \n \n “You told us very little,” Lois reminded her. “If you know anything about the people who live here now, I think you ought to let us know. Otherwise, I’m afraid we won’t be very welcome.”\n \n \n “I don’t think they’ll welcome us, anyway. I do know who they are,” Lorraine admitted. “You remember Roger Banning from school, don’t you? I’ve seen him around here. His family must have acquired sudden wealth, or else he’s just working on the estate.”\n \n \n “Then you’ve been here lately? Why didn’t you tell me?” asked Lois. “We always used to go places together.”\n \n \n “It wasn’t important,” Lorraine replied evasively.\n“I was just out for a drive.”\n \n \n “You plutocrats!” laughed Judy. “Each with a car of your own. You’re not interested in Roger Banning, are you, Lois? I’m sure you can do better than that. I did know him slightly, but not from school. The boys and girls were separated and went to different high schools by the time we moved to\n Farringdon. I remember his pal, Dick Hartwell, a lot better. He was in our young people’s group at church.”\n \n \n “Sh!” Lois cautioned her. “Nice people no longer mention Dick Hartwell’s name. He’s doing time.”\n \n \n “For what?” asked Judy.\n \n \n Like Peter, her FBI husband, she preferred facts to gossip.\n \n \n “Forgery, I guess. He stole some checkbooks from his father’s desk and forged the names of a lot of important business people. I think he forged some legal documents, too. Anyway, he went to the Federal Penitentiary. It was all in the papers,” Lorraine told her.\n \n \n Now Judy did remember. It was something she would have preferred to forget. She liked to think she was a good judge of character, and she had taken Dick Hartwell for a quiet, refined boy who would never stoop to crime.\n \n \n “I don’t see what all this has to do with the fountain,” Lois said impatiently. “Are we going to look for it, or aren’t we?”\n \n \n “Of course we are. That’s what we came for. I just like to know what a tiger looks like before he springs at me,” Judy explained.\n \n \n “You seem to think there’s danger in this expedition of ours, don’t you?” asked Lorraine.\n \n \n “I don’t know what to think. You’re the one who seems to know the answers, but you’re not telling.\n Hiding your face back there gave you away. You’ve seen that character who drove down this road and, for some reason, you were afraid he would see you. Why, Lorraine? Why didn’t you want to be recognized?”\n \n \n Lorraine hesitated a moment and then replied evasively, “People don’t generally enter private estates without an invitation. That’s all.”\n \n \n “I’d better turn the car around,” Lois decided,\n“in case we have to leave in a hurry. I don’t expect we’ll encounter any tigers, but we may be accused of trespassing.”\n \n \n “I’m sure we will be,” announced Judy as two dark-coated figures strode down the road toward them. “You drove right by a\n NO TRESPASSING\n sign, and this isn’t a welcoming committee coming to meet us!”",
      "metadata": {
        "title": "The Haunted Fountain",
        "author": "Margaret Sutton",
        "passage_id": "47841",
        "uid": "f87190dbea6944969c3d2dd2867a9b1f",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "10",
                "uid": "e893fe3276424d6c87c243d362e6b7ff",
                "response_text": "Lois and Lorraine are having lunch at Judy’s house, speaking about how Judy nearly spoiled their double-wedding where they both became sisters under the name Farringdon-Petts by solving a mystery.  \nJudy starts telling the story of the haunted fountain. She discovered a photo of a spectacular fountain in her grandmother’s hot attic one summer as she was stuck there for two weeks while her parents went on vacation. She shed a tear onto the photo while recalling her sadness about not having friends or a sister, and imagined the fountain was a place for lonely girls to fill with their tears. Her grandmother overhears her speaking aloud her wishes and calls that she shouldn’t keep her wishes to herself, because “most of them aren’t so impossible.”\nJudy’s grandparents take her to the fountain in the photo and it speaks to Judy, directing her to shed a tear into it and make wishes. Judy sheds a tear thinking about how her only friend just moved out of town and then hurries through her wishes before the ripples disappear - to have lots of friends, a sister, to marry a G-man and to solve a lot of mysteries. All things that have come true in her life.\nAbruptly returning to Judy’s modern timeline, she takes Lois and Lorraine to the attic. They are spooked by Judy’s black cat, Blackberry, who makes sudden noises. Judy finds the photo and Lorraine recognizes the fountain is identical to one on her estate - yet it is in a different location. They surmise that it is in the woods on the edge of town that are part of the Brandt estate, and drive to it immediately.\nDuring their adventure, Judy recalls more of her fountain memory. Her grandparents didn’t know the Brandt’s well enough to pay them a visit, but instead stopped by the fountain on their way to drop off her grandmother’s hooked rugs at the estate further up the path. Judy was left behind napping in a hammock - told by her grandparents they were getting her a surprise, but they didn’t return. She followed a path to an old windowless tower, but got distracted by the sound of her grandfather's cart leaving. This is all she recalls, but there is evidently more to discover that will solve the mystery.\nThe trip to the fountain shakes the confidence of Lorraine in the back seat, who knows information about the new owners of the estate - Roger Banning - that she is withholding. Lois and Judy probe her about what she knows and why she ducked down to hide her face from a stranger passing in a car. Although Lorraine tells them about Roger, she does not reveal why she is afraid. Judy mentions knowing Roger’s pal Dick Hartwell, who is apparently in the Federal Penitentiary for forgery now. As they park and exit the car to walk to the fountain, two dark-coated strangers approach them. This is where the story ends.\n"
              },
              {
                "worker_id": "3",
                "uid": "0209b31d71354c9ebf113cf2704ac86d",
                "response_text": "Judy, a woman known for solving mysteries and chasing ghosts, had her friends Lois and Lorraine over for lunch in the haunted house she had inherited from her family. When Judy was growing up, her parents would spend summers on vacation without her, so she did a lot of reading at her Grandmother Smeed's house. These were sad summers for her, but she would soon start to solve mysteries and find her own adventures. She mentioned her tears falling on a magazine with a picture of a fountain; she imagined it was full of tears of many girls and pondered the idea of an enchanted fountain. Her grandparents took her to see a fountain the next day, where she heard a voice that told her to make a wish and to cry into the fountain--the same fountain that was in the picture in the magazine. Judy's friends got more excited about the story, and it continued: she had to think of a wise wish, but reacted too quickly to think carefully. Her wishes did come true; she wanted lots of friends, a sister, to solve mysteries, and to marry a G-man. All of these things came true, and the fountain kept Judy captivated. She patiently explained to her friends that she hadn't tried to learn the secret of the fountain, and it didn't speak to her after the initial encounter. Judy had lost her appetite for her dessert but wanted to retrieve the photo of the fountain to see if Lois recognized it; they all went to the attic, bringing Blackberry the cat with them. Lorraine recognized the photo of the fountain, but it seemed to make her nervous. Lois didn't want to leave yet even though Lorraine was clearly uncomfortable and wanted to go, and thought she might recognize the fountain from the Brandt estate, so Lois and Judy decide it's worth checking out to see if it's the same one. Lorraine only agreed to join after they promised not to drive all the way up to the house, and to walk the last part of the way. After a twenty-minute drive, Judy talked more about what she remembered about the day she visited the garden; she'd fallen asleep in a hammock, and woke up to an empty garden. She headed towards a tower but found her grandfather's car before she encountered anyone. Through all of this, Lorraine hints that she knows more than she's letting on, and doesn't think things will be as Judy expected. This is when Judy picks up on Lorraine's reticence. Judy and Lois want to explore the old tower and look for the fountain, when Lois admits she knows Roger Banning has been around the area. Lucy and Lois push Lorraine to say more about why she isn't talking, and they want to know why she doesn't want to be recognized. The story ends in suspense as two people in dark coats are walking towards the three women."
              },
              {
                "worker_id": "2",
                "uid": "aeb91fd9f187492aa88e98a0a0588895",
                "response_text": "Judy has invited her friends, Lois and Lorraine (who are sisters-in-law), to lunch at her home. She and her husband, Peter, live in a house she inherited from her grandmother. While Judy is out of the room, Lois asks Lorraine to tell Judy about something that is upsetting Lorraine, but Lorraine accuses Lois of always siding with Judy. On top of that, she claims that Judy almost ruined their double wedding. Judy enters at the end of the conversation, admitting that she has problems, too, and hasn’t been able to solve all the mysteries she has attempted. When Judy mentions a promise she made not to discuss the dam and that she should have told Arthur, Lorraine has a pained expression and asks them not to talk about him.\nLois changes the subject, praising Judy’s mystery-solving and ghost tracking abilities that she then explains sensibly; she asks Judy to tell them a story about one of her mysteries. Judy tells them about the haunted fountain that she saw when she was fifteen years old and spending part of the summer with her grandparents while her parents were on vacation. In the attic to look at some of her grandmother’s old magazines, Judy began feeling sorry for being left behind and started crying. Her tear fell onto a picture of a fountain, and she pretended it was filled with the tears of lonely girls. Aloud, she comments that would make the fountain enchanted and starts to say a wish when her grandmother interrupts to tell her that if she let people know her wishes, most of them wouldn’t be impossible to fulfill.\nThe next day, Judy’s grandparents took her to a fountain that looked just like the one in the magazine. Judy walked into it and heard a voice telling her that if she sheds a tear in the fountain and makes a wish, her wish will come true. But the voice admonishes her to wish wisely. So Judy thought about how lonely she had been since her best friend had moved away and wished for lots of friends and a sister, to marry a G-man, and to solve lots of mysteries, all of which have come true.   \nJudy shows her friends magazine with the fountain, and Lois realizes it looks like the fountain on the nearby Brandt estate. On a whim, the three women decide to drive there to look at it. Although Lorraine is less than enthusiastic about the venture, she goes along but insists they not drive all the way to the house. After they turn into the long drive, a car approaches with a memorable-looking man at the wheel. As they near the path to the fountain, Judy recalls that her grandfather started to drive off without her, and she assumed he was teasing her. Lorraine admits she knows the Brandts no longer own the estate and has seen a classmate, Roger Banning, nearby. Suddenly, two dark-coated figures approach them.\n\n"
              },
              {
                "worker_id": "12",
                "uid": "e8bfddf806624827bde18193cf92e805",
                "response_text": "Judy is enjoying dessert with her two friends Lorraine and Lois as she recounts a tale from her childhood in which she came across a magical fountain that granted her all of her wishes. This fountain has given Judy her husband, friends, and renown as a paranormal mystery solver. As they are in the home in which she discovered a picture of the magical fountain, the three ladies decide to go into the attic to dig up that picture. Upon seeing the picture of the fountain, Lorraine and Lois seem to know its location. The three ladies head there but it seems that Lorraine is hiding some secret connection with the fountain, and there are people there that don't seem to want them around the fountain."
              }
            ]
          },
          {
            "question_text": "Describe the setting for the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "10",
                "uid": "e893fe3276424d6c87c243d362e6b7ff",
                "response_text": "The story opens at Judy’s house as she has Lois and Lorraine over for lunch. Judy’s lives in her grandparents' old house that she modernized with her husband, Peter. The house has an attic that is up a narrow set of stairs with a door at the top. They have a black cat named Blackberry that spooks her friends because it is creepy when it makes unexpected noises in the attic.\nWhen Judy is recalling the story of the fountain, the narrative bounces back and forth into their present reality as Lois and Lorraine ask questions.\nIn Judy’s recalled story, she is a young red-haired girl with no friends who spends two weeks in the summer with her grandparents at their home. They have a hot attic filled with keepsakes and old reading materials, most notably a picture of a fountain that Judy’s grandmother later brings her to. The fountain was centered in a deep, circular pool, and had steps leading up to it that were bordered with smaller fountains of lions with water spurting out of the mouths. Judy thinks it could be a beautiful location at any time of the year, surrounded by lush vegetation like rhododendrons and evergreens. From the fountain there was a path leading to a windowless old tower that was populated by cupids and gnomes that peered out at Judy.\nBack in modern day, when Judy, Lois and Lorraine go looking for the fountain, the tower is still visible, and Lorraine describes it as something out of “Grimm’s Fairy Tales.” The friends visit it on a day where the trees are leafless in the woods, making the rhododendrons appear vibrantly green, under a gray sky. They do not actually reach the fountain in the story, but they do pass several posted signs for “NO TRESPASSING” along the wooded road.\n"
              },
              {
                "worker_id": "3",
                "uid": "0209b31d71354c9ebf113cf2704ac86d",
                "response_text": "The house that Judy lives in was inherited from her grandparents, and she now lives there with her husband Peter and their cat Blackberry. She has made some changes to the house, including in the staircases to the attic, but she has not yet gone through all of her grandmother's belongings so they take up a lot of the attic. Judy's friends consider the house haunted, but Judy insists that at least the attic is not. After the three leave the house to investigate where the fountain might be, they head into the woods where there is an uphill road leading to the Brandt estate. In this estate, there was an old water tower that was visible from the path the women were on, but the story ended before the women were able to confirm if the fountain was on this estate or not. "
              },
              {
                "worker_id": "2",
                "uid": "aeb91fd9f187492aa88e98a0a0588895",
                "response_text": "The story takes place around the early 20th century in a town called Farringdon in the USA as Judy’s grandparents still drove a horse-led wagon, but Lois now drives a car, and Judy’s husband is employed by the FBI. The story begins at Judy’s house, which she inherited from her grandparents. While she is in the process of renovating the house, she still has her grandmother’s things in the attic, including the magazine with the picture of the fountain. Lois alludes to the fact that Judy has tracked down the ghosts in the attic and cellar of the house. The attic is where Judy found the magazine with the picture of the fountain on it that she is telling her friends about. When Judy saw the picture, she had never seen a fountain in person, although there is a fountain at the nearby turreted Farringdon-Petts mansion. After Judy shows the picture of the fountain to Lois and Lorraine, the two women recognize it as the fountain on the Brandt estate.\n        The fountain is part of the setting in the flashback in the story. Judy remembers visiting the fountain during June; it was centered in a deep, circular pool with steps leading to the fountain. Smaller fountains in the shapes of lions were beside the steps, and water spurted from their mouths. After leaving the fountain, Judy found a hammock in a beautiful garden encircled by rose trellises. There were also rhododendrons and evergreens in the garden. After waking from her nap in the hammock, Judy saw an old windowless tower and a path leading to it. She followed the trail, and all along it were cupid and gnome figures that seemed to be looking out at her, tucked into surprising places. Just as she reached the tower, she heard her grandfather leaving with the wagon.  \n\tThe rest of the story occurs in the present’s second setting, the Brandt estate. The drive off the main road is a narrow, gravel road uphill through the woods. An oncoming car driven by a swarthy man with hypnotic eyes startles them. Traveling on, they pass more evergreens and a hedge of rhododendron and can see the tower from the car. As Lois turns the car around, two figures in dark coats approach them.\n"
              },
              {
                "worker_id": "12",
                "uid": "e8bfddf806624827bde18193cf92e805",
                "response_text": "Most of the story takes place in Judy's grandparents' house, which Judy currently owns and has modernized. The main focus of the first half of the story is on the house's attic, where Judy's grandmother's things are kept. The story also takes place in a car on the way to the Brandt estate, which is the location of the fountain. The characters wind up on the estate, but it is a private estate and there are people there who do not want them there. The story takes place in a time period that seems older, with a lot of pomp and propriety. "
              }
            ]
          },
          {
            "question_text": "Who is Judy and what is her personality like?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "10",
                "uid": "e893fe3276424d6c87c243d362e6b7ff",
                "response_text": "Judy was a freckled-faced, pigtailed girl that spent two weeks every summer with her grandmother, Smeed, and grandfather while her parents went on vacation to a beach hotel they honeymooned at many years ago. Judy resented being left behind by her parents. However, during one summer with her grandparents, they took her to an enchanted fountain that Judy found a photo of in their attic. The fountain spoke to Judy and asked her to shed a tear into the fountain and make wishes. All of the things that Judy wished for in her life came true - to have a lot of friends, a sister, to marry a G-man and to solve a lot of mysteries. \nIn the telling of the story, Judy is older, married, and has a sister Lois (by way of Judy’s marriage to her brother), and another close friend like a sister, Lorraine (by way of her marrying into the same family as Lois - the Farringdon-Petts). Judy shows modesty by bringing up the mysteries she never solved when Lois and Lorraine shower her with compliments. Judy’s grandparents have since passed, but she lives in their home and keeps their belongings in the attic, showing her connection with family. \nJudy (maiden name Bolten) is married to Peter Dobbs, an FBI agent, and she prefers to discuss facts instead of gossiping about hear-say with Lois and Lorraine. Judy is diligent in asking questions about Lorraine’s behavior when she ducks down in the car to hide her face from a passing stranger, and probes her to tell the truth about knowing who the new owner of the Brandt estate is - Roger Banning. Her wit is sharp, and she comes across as determined and willing to take risks to solve her mysteries (like passing no trespassing signs in broad daylight after they have already been spotted by a stranger).\n"
              },
              {
                "worker_id": "3",
                "uid": "0209b31d71354c9ebf113cf2704ac86d",
                "response_text": "Judy is a woman known for her sharp detective abilities. She is married to Peter Dobbs, and took his last name when they married instead of keeping her maiden name, Bolton. She grew up rather lonely, not having many friends--the one friend she did have moved away. After she made a wish in an enchanted fountain, however, her life changed--she found friends, a sister, a dream husband, and a new ability to solve mysteries which brought her notoriety in the area. She is a very curious person who loves to read, which is why she was with the magazines in the attic at her grandmother's in the first place. She grew up interested in mystery books also, as evidenced by the books her father bought her, which likely led to her interest in solving mysteries of her own. "
              },
              {
                "worker_id": "2",
                "uid": "aeb91fd9f187492aa88e98a0a0588895",
                "response_text": "Judy Dobbs, née Bolton, is friends with Lois and Lorraine and their friend and her sister-in-law Honey. She is married to Peter Dobbs, an employee of the FBI. Growing up an only child, Judy had only one best friend and was very lonely when her friend moved away. She also never got to go on family vacations; her parents would leave her with her grandparents while they went to the beach hotel where they had spent their honeymoon. Judy is a forthright, somewhat self-centered woman. She is very curious and has a habit of pursuing mysterious occurrences to discover what is behind them. When the voice in the fountain urged her to make wise wishes, Judy wished for just the things that have happened in her life, but Judy points out that her wishes didn’t come true until she started thinking of others. She also believes that as she goes through her grandmother’s belongings, she might be able to solve some of the mysteries about her grandparents’ lives. Judy is also analytical; she notices Lorraine’s tendency toward jealousy and Lorraine’s reaction to mentions of Arthur and suspects that Lorraine might be jealous about him. She also notices Lorraine’s reaction to the oncoming car, hiding herself behind Lois, and her reluctance to tell them what she knows about the Brandt estate and confronts her, asking for her reasons."
              },
              {
                "worker_id": "12",
                "uid": "e8bfddf806624827bde18193cf92e805",
                "response_text": "Judy is the main character of the story and she has become famous for solving paranormal mysteries. Judy's drive to see the fountain that brought her all her good fortune is what drives the story forward and gets the characters into trouble. Judy seems like a privileged character who is thankful for that privilege. She's highly inquisitive, never wanting to let a mystery go unsolved. She is a content character, but much of the story's beginning is dedicated to describing how she was before she became content as a lonely, depressed younger girl in need of friends."
              }
            ]
          },
          {
            "question_text": "What is the significance of tears in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "10",
                "uid": "e893fe3276424d6c87c243d362e6b7ff",
                "response_text": "Tears are the inciting event that connect Judy with the photo of the fountain as a tear rolls off her cheek and onto the photo as she thinks of her loneliness in her grandparents attic. Expressing her longing for friendship and a sister aloud sparks her grandmother to take her along to the fountain itself. When visiting the fountain, tears again become important because the fountain asks for a tear to be shed into it before wishes can be made.\nThe physical description of tears rolling onto a photograph or causing small ripples in the fountain that travel and dissipate are important visualizations that draw the reader into Judy’s story, and make her character feel real. \n\n"
              },
              {
                "worker_id": "3",
                "uid": "0209b31d71354c9ebf113cf2704ac86d",
                "response_text": "Tears are first brought up when Judy is thinking about her summers that she spent in the attic at her grandmother's house, where she said she was reading but really needed some space to herself to cry. Her tears fell on a magazine that had a picture of a fountain, and she found it amusing that the fountain had tears as its source of water. She pretended that it was full of tears of many young girls, and her grandmother overheard her pondering this possible enchanted fountain, so they went to see a similar fountain the next day.  She cried into the fountain and her dreams eventually came true, changing the course of her life in many ways. "
              },
              {
                "worker_id": "2",
                "uid": "aeb91fd9f187492aa88e98a0a0588895",
                "response_text": "Judy’s tears over her loneliness of losing her best friend and not going on vacation with her parents provide the catalyst for significant changes in her life. When her tears fall on the picture of the fountain, and her grandmother overhears her comment about the enchanted fountain and her wishes, it marks the beginning of life-changing events. Her grandparents take her to see the fountain on the Brandt estate, and there, she hears the voice telling her if she sheds a tear in the fountain, her wishes will come true. As she watches the ripples in the water caused by her tear, Judy quickly comes up with several wishes that ultimately come true; even the wish for a sister that seemingly would be impossible to fill comes true when she gains a sister-in-law. Her story about the fountain and her tears are the impetus for Lois’s push to visit the Brandt estate to see the fountain and for the women being caught trespassing on the property."
              },
              {
                "worker_id": "12",
                "uid": "e8bfddf806624827bde18193cf92e805",
                "response_text": "Judy spills tears while she is first looking at the photograph of the fountain in a magazine. Judy is crying because her parents have left her with her grandmother Smeed, whom she finds a complete bore. The tears spill onto the magazine and seem to bring the fountain to life with the tears of all the lonely girls like Judy. Seeing the fountain in this way helps Judy make a connection with the fountain and draws her toward finding it the first time. "
              }
            ]
          },
          {
            "question_text": "What is the relationship like between Lois and Lorraine?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "10",
                "uid": "e893fe3276424d6c87c243d362e6b7ff",
                "response_text": "Lois and Lorraine became sisters by marriage as they both married into the Farringdon-Petts family in a double-wedding event. Judy (a sister to Lois by way of her marrying Lois’ brother, Peter Dobbs), nearly ruined the double-wedding trying to solve a mystery.\nLois is perhaps more forgiving to Judy, and Lorraine goes as far as to describe that Lois has always taken Judy’s side. Both Lois and Lorraine acknowledge that Judy is great at solving mysteries and try to lift her up when she is down on herself about the few that she couldn’t solve when they come over for lunch. \nLorraine becomes evasive and hides from view when the three of them go to the fountain together, concealing information about the new owners of the Brandt estate that Lois and Judy eventually get out of her by probing questions. This event shows Lois’ willingness to challenge Lorraine, and perhaps also supporting “Judy’s side” as Lois calls her out on earlier in the story.\n"
              },
              {
                "worker_id": "3",
                "uid": "0209b31d71354c9ebf113cf2704ac86d",
                "response_text": "Lois and Lorraine are sisters-in-law who want to look out for one another. Lois is excitable and very giggly, whereas Lorraine is a bit more mild-tempered and careful, less sure about having Blackberry the cat around. Lorraine is going through an emotional time when this story takes place, only admitting small bits of information at a time about how she doesn't trust Arthur anymore, but won't give up more detail when pushed. Judy found Lorraine to seem somewhat jealous, but both Judy and Lois seem to know that Lorraine is keeping something from them. On the other hand, Lois is very open and encourages the others to speak their minds to work through anything that might be bothering them. "
              },
              {
                "worker_id": "2",
                "uid": "aeb91fd9f187492aa88e98a0a0588895",
                "response_text": "Lois and Lorraine are sisters-in-law who care for each other, although Lorraine can sometimes be difficult to get along with. Lois is the friendlier, perkier of the two, while Lorraine is brooding and distrusting. Lorraine has a jealous streak that interfered with the budding friendship between Lois and Judy, and even now, Lorraine complains that Lois always sides with Judy. She also holds grudges, as she brings up the point that Judy almost ruined their double wedding. Lorraine has a problem that appears to be related to her husband, and Lois thinks Lorraine should tell Judy about it because Judy is so good at solving problems and mysteries. When Judy mentions Arthur, Lorraine looks as though she is in pain and asks the others not to talk about him now. Later, she comments that she wishes she could go back in the past to the time when she trusted Arthur, and when they meet the oncoming car on the way to the Brandt estate, she hides herself from the driver. Lois encourages Lorraine to tell her what her problem is, but Lorraine won’t. All day, Lois engages in eager conversation, asking Judy questions as she tells her story, while Lorraine appears lost, glum, and hurt; Lorraine starts comments that she doesn’t finish and mysteriously seems to know more about the Brandt estate than she will tell the other two women."
              },
              {
                "worker_id": "12",
                "uid": "e8bfddf806624827bde18193cf92e805",
                "response_text": "Lois and Lorraine appear to be sisters. At one point, Judy is recounting how she wished for a sister her age, and Lois squeezes Lorraine's hand, proclaiming that her future held a sister just like Judy's future held a sister. It isn't clear, however, if they are biological sisters or symbolic sisters. Judy is describing more of a symbolic relationship with a woman of her age, but Lois does not clarify if her relationship with Lorraine is by blood or simply by love like how Judy is describing. Either way, the two characters seem very close and care for one another deeply."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4889,
        "document_length_chars": 27744
      }
    }
  ]
}