{
  "item_metadata": {
    "item_id": "48513",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "48513",
      "content": "Transcriber's Note:\n \n This etext was produced from Analog March 1962. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.\n \n ILLUSTRATED BY KRENKEL\n  \n \n HIS MASTER'S VOICE ANALOG SCIENCE FACT · SCIENCE FICTION\n  \n \n\n Spaceship McGuire had lots of knowledge—but no wisdom. He was smart—but incredibly foolish. And, as a natural consequence, tended to ask questions too profound for any philosopher—questions like \"Who are you?\"\n \n \n By RANDALL GARRETT\n \n\n \n I'd been in Ravenhurst's office on the mountain-sized planetoid called Raven's Rest only twice before. The third time was no better; Shalimar Ravenhurst was one of the smartest operators in the Belt, but when it came to personal relationships, he was utterly incompetent. He could make anyone dislike him without trying.\n \n When I entered the office, he was\n [3]\n sitting behind his mahogany desk, his eyes focused on the operation he was going through with a wineglass and a decanter. He didn't look up at me as he said:\n \n \"Sit down, Mr. Oak. Will you have some Madeira?\"\n \n I decided I might as well observe the pleasantries. There was no point in my getting nasty until he did. \"Thank you, Mr. Ravenhurst, I will.\"\n \n He kept his eyes focused on his work: It isn't easy to pour wine on a planetoid where the gee-pull is measured in fractions of a centimeter per second squared. It moves slowly, like ropy molasses, but you have to be careful not to be fooled by that. The viscosity is just as low as ever, and if you pour it from any great height, it will go scooting right out of the glass\n [4]\n again. The momentum it builds up is enough to make it splash right out again in a slow-motion gush which gets it all over the place.\n \n Besides which, even if it didn't splash, it would take it so long to fall a few inches that you'd die of thirst waiting for it.\n \n Ravenhurst had evolved a technique from long years of practice. He tilted the glass and the bottle toward each other, their edges touching, like you do when you're trying to pour beer without putting a head on it. As soon as the wine wet the glass, the adhesive forces at work would pull more wine into the wine glass. To get capillary action on a low-gee asteroid, you don't need a capillary, by any means. The negative meniscus on the wine was something to see; the first time you see it, you get the eerie feeling that the glass is spinning and throwing the wine up against the walls by centrifugal force.\n \n I took the glass he offered me (Careful! Don't slosh!) and sipped at it. Using squirt tubes would have been a hell of a lot easier and neater, but Ravenhurst liked to do things his way.\n \n He put the stopper back in the decanter, picked up his own glass and sipped appreciatively. Not until he put it back down on the desk again did he raise his eyes and look at me for the first time since I'd come in.\n \n \"Mr. Oak, you have caused me considerable trouble.\"\n \n \"I thought we'd hashed all that out, Mr. Ravenhurst,\" I said, keeping my voice level.\n \n [5]\n \n \"So had I. But it appears that there were more ramifications to your action than we had at first supposed.\" His voice had the texture of heavy linseed oil.\n \n He waited, as if he expected me to make some reply to that. When I didn't, he sighed slightly and went on. \"I fear that you have inadvertently sabotaged McGuire. You were commissioned to prevent sabotage, Mr. Oak, and I'm afraid that you abrogated your contract.\"\n \n I just continued to keep my voice calm. \"If you are trying to get back the fee you gave me, we can always take it to court. I don't think you'd win.\"\n \n \"Mr. Oak,\" he said heavily, \"I am not a fool, regardless of what your own impression may be. If I were trying to get back that fee, I would hardly offer to pay you another one.\"\n \n I didn't think he was a fool. You don't get into the managerial business and climb to the top and stay there unless you have brains. Ravenhurst was smart, all right; it was just that, when it came to personal relationships, he wasn't very wise.\n \n \"Then stop all this yak about an abrogated contract and get to the point,\" I told him.\n \n \"I shall. I was merely trying to point out to you that it is through your own actions that I find myself in a very trying position, and that your sense of honor and ethics should induce you to rectify the damage.\"\n \n \"My honor and ethics are in fine shape,\" I said, \"but my interpretation of the concepts might not be quite\n [6]\n the same as yours. Get to the point.\"\n \n He took another sip of Madeira. \"The robotocists at Viking tell me that, in order to prevent any further ... ah ... sabotage by unauthorized persons, the MGYR-7 was constructed so that, after activation, the first man who addressed orders to it would thenceforth be considered its ... ah ... master.\n \n \"As I understand it, the problem of defining the term 'human being' unambiguously to a robot is still unsolved. The robotocists felt that it would be much easier to define a single individual. That would prevent the issuing of conflicting orders to a robot, provided the single individual were careful in giving orders himself.\n \n \"Now, it appears that you , Mr. Oak, were the first man to speak to McGuire after he had been activated. Is that correct?\"\n \n \"Is that question purely rhetorical,\" I asked him, putting on my best expression of innocent interest. \"Or are you losing your memory?\" I had explained all that to him two weeks before, when I'd brought McGuire and the girl here, so that Ravenhurst would have a chance to cover up what had really happened.\n \n \n\n \n My sarcasm didn't faze him in the least. \"Rhetorical. It follows that you are the only man whose orders McGuire will obey.\"\n \n \"Your robotocists can change that,\" I said. This time, I was giving him my version of \"genuine\" innocence.\n [7]\n A man has to be a good actor to be a competent double agent, and I didn't want Ravenhurst to know that I knew a great deal more about the problem than he did.\n \n He shook his head, making his jowls wobble. \"No, they cannot. They realize now that there should be some way of making that change, but they failed to see that it would be necessary. Only by completely draining McGuire's memory banks and refilling them with new data can this bias be eliminated.\"\n \n \"Then why don't they do that?\"\n \n \"There are two very good reasons,\" he said. And there was a shade of anger in his tone. \"In the first place, that sort of operation takes time, and it costs money. If we do that, we might as well go ahead and make the slight changes in structure necessary to incorporate some of the improvements that the robotocists now feel are necessary. In other words, they might as well go ahead and build the MGYR-8, which is precisely the thing I hired you to prevent.\"\n \n \"It seems you have a point there, Mr. Ravenhurst.\" He'd hired me because things were shaky at Viking. If he lost too much more money on the McGuire experiment, he stood a good chance of losing his position as manager. If that happened some of his other managerial contracts might be canceled, too. Things like that can begin to snowball, and Ravenhurst might find himself out of the managerial business entirely.\n \n \"But,\" I went on, \"hasn't the additional wasted time already cost you\n [8]\n money?\"\n \n \"It has. I was reluctant to call you in again—understandably enough, I think.\"\n \n \"Perfectly. It's mutual.\"\n \n He ignored me. \"I even considered going through with the rebuilding work, now that we have traced down the source of failure of the first six models. Unfortunately, that isn't feasible, either.\" He scowled at me.\n \n \"It seems,\" he went on, \"that McGuire refuses to allow his brain to be tampered with. The self-preservation 'instinct' has come to the fore. He has refused to let the technicians and robotocists enter his hull, and he has threatened to take off and leave Ceres if any further attempts are made to ... ah ... disrupt his thinking processes.\"\n \n \"I can't say that I blame him,\" I said. \"What do you want me to do? Go to Ceres and tell him to submit like a good boy?\"\n \n \"It is too late for that, Mr. Oak. Viking cannot stand any more of that kind of drain on its financial resources. I have been banking on the McGuire-type ships to put Viking Spacecraft ahead of every other spacecraft company in the System.\" He looked suddenly very grim and very determined. \"Mr. Oak, I am certain that the robot ship is the answer to the transportation problems in the Solar System. For the sake of every human being in the Solar System, we must get the bugs out of McGuire!\"\n  What's good for General Bull-moose is good for everybody , I quoted to myself. I'd have said it out loud,\n [9]\n but I was fairly certain that Shalimar Ravenhurst was not a student of the classics.\n \n \"Mr. Oak, I would like you to go to Ceres and co-operate with the robotocists at Viking. When the MGYR-8 is finally built, I want it to be the prototype for a fast, safe, functional robot spaceship that can be turned out commercially. You can be of great service, Mr. Oak.\"\n \n \"In other words, I've got you over a barrel.\"\n \n \"I don't deny it.\"\n \n \"You know what my fees are, Mr. Ravenhurst. That's what you'll be charged. I'll expect to be paid weekly; if Viking goes broke, I don't want to lose more than a week's pay. On the other hand, if the MGYR-8 is successful, I will expect a substantial bonus.\"\n \n \"How much?\"\n \n \"Exactly half of the cost of rebuilding. Half what it would take to build a Model 8 right now, and taking a chance on there being no bugs in it.\"\n \n He considered that, looking grimmer than ever. Then he said: \"I will do it on the condition that the bonus be paid off in installments, one each six months for three years after the first successful commercial ship is built by Viking.\"\n \n \"My lawyer will nail you down on that wording,\" I said, \"but it's a deal. Is there anything else?\"\n \n \"No.\"\n \n \"Then I think I'll leave for Ceres before you break a blood vessel.\"\n \n \"You continue to amaze me, Mr. Oak,\" he said. And the soft oiliness\n [10]\n of his voice was the oil of vitriol. \"Your compassion for your fellowman is a facet of your personality that I had not seen before. I shall welcome the opportunity to relax and allow my blood pressure to subside.\"\n \n I could almost see Shalimar Ravenhurst suddenly exploding and adding his own touch of color to the room.\n \n And, on that gladsome thought, I left. I let him have his small verbal triumph; if he'd known that I'd have taken on the job for almost nothing, he'd really have blown up.\n \n \n\n \n Ten minutes later, I was in my vacuum suit, walking across the glaring, rough-polished rectangle of metal that was the landing field of Raven's Rest. The sun was near the zenith in the black, diamond-dusted sky, and the shadow of my flitterboat stood out like an inkblot on a bridal gown. I climbed in, started the engine, and released the magnetic anchor that held the little boat to the surface of the nickel-iron planetoid. I lifted her gently, worked her around until I was stationary in relation to the spinning planetoid, oriented myself against the stellar background, and headed toward the first blinker beacon on my way to Ceres.\n \n For obvious economical reasons, it it impracticable to use full-sized spaceships in the Belt. A flitterboat, with a single gravitoinertial engine and the few necessities of life—air, some water, and a very little food—still costs more than a Rolls-Royce\n [11]\n automobile does on Earth, but there has to be some sort of individual transportation in the Belt.\n \n They can't be used for any great distances because a man can't stay in a vac suit very long without getting uncomfortable. You have to hop from beacon to beacon, which means that your average velocity doesn't amount to much, since you spend too much time accelerating and decelerating. But a flitterboat is enough to get around the neighborhood in, and that's all that's needed.\n \n I got the GM-187 blinker in my sights, eased the acceleration up to one gee, relaxed to watch the radar screen while I thought over my coming ordeal with McGuire.\n \n Testing spaceships, robotic or any other kind, is strictly not my business. The sign on the door of my office in New York says: DANIEL OAK, Confidential Expediter ; I'm hired to help other people Get Things Done. Usually, if someone came to me with the problem of getting a spaceship test-piloted, I'd simply dig up the best test pilot in the business, hire him for my client, and forget about everything but collecting my fee. But I couldn't have refused this case if I'd wanted to. I'd already been assigned to it by someone a lot more important than Shalimar Ravenhurst.\n \n Every schoolchild who has taken a course in Government Organization and Function can tell you that the Political Survey Division is a branch of the System Census Bureau of the UN Government, and that its job is to evaluate the political activities of\n [12]\n various sub-governments all over the System.\n \n And every one of those poor tykes would be dead wrong.\n \n The Political Survey Division does evaluate political activity, all right, but it is the Secret Service of the UN Government. The vast majority of\n [13]\n the System's citizens don't even know the Government has a Secret Service. I happen to know only because I'm an agent of the Political Survey Division.\n \n The PSD was vitally interested in the whole McGuire project. Robots of McGuire's complexity had been built before; the robot that runs the traffic patterns of the American Eastern Seaboard is just as capable as McGuire when it comes to handling a tremendous number of variables and making decisions on them. But that robot didn't have to be given orders except in extreme emergencies. Keeping a few million cars moving and safe at the same time is actually pretty routine stuff for a robot. And a traffic robot isn't given orders verbally; it is given any orders that may be necessary via teletype by a trained programming technician. Those orders are usually in reference to a change of routing due to repair work on the highways or the like. The robot itself can take care of such emergencies as bad weather or even an accident caused by the malfunctioning of an individual automobile.\n \n McGuire was different. In the first place, he was mobile. He was in command of a spacecraft. In a sense, he was the spacecraft, since it served him in a way that was analogous to the way a human body serves the human mind. And he wasn't in charge of millions of objects with a top velocity of a hundred and fifty miles an hour; he was in charge of a single object that moved at velocities of thousands of miles per second. Nor\n [14]\n did he have a set, unmoving highway as his path; his paths were variable and led through the emptiness of space.\n \n Unforeseen emergencies can happen at any time in space, most of them having to do with the lives of passengers. A cargo ship would be somewhat less susceptible to such emergencies if there were no humans aboard; it doesn't matter much to a robot if he has no air in his hull.\n \n But with passengers aboard, there may be times when it would be necessary to give orders— fast ! And that means verbal orders, orders that can be given anywhere in the ship and relayed immediately by microphone to the robot's brain. A man doesn't have time to run to a teletyper and type out orders when there's an emergency in space.\n \n That meant that McGuire had to understand English, and, since there has to be feedback in communication, he had to be able to speak it as well.\n \n And that made McGuire more than somewhat difficult to deal with.\n \n \n\n \n For more than a century, robotocists have been trying to build Asimov's famous Three Laws of Robotics into a robot brain.\n  First Law: A robot shall not, either through action or inaction, allow harm to come to a human being.\n \n  Second Law: A robot shall obey the orders of a human being, except when such orders conflict with the First Law .\n \n [15]\n  Third Law: A robot shall strive to protect its own existence, except when this conflicts with the First or Second Law.\n \n \n Nobody has succeeded yet, because nobody has yet succeeded in defining the term \"human being\" in such a way that the logical mind of a robot can encompass the concept.\n \n A traffic robot is useful only because the definition has been rigidly narrowed down. As far as a traffic robot is concerned, \"human beings\" are the automobiles on its highways. Woe betide any poor sap who tries, illegally, to cross a robot-controlled highway on foot. The robot's only concern would be with the safety of the automobiles, and if the only way to avoid destruction of an automobile were to be by nudging the pedestrian aside with a fender, that's what would happen.\n \n And, since its orders only come from one place, I suppose that a traffic robot thinks that the guy who uses that typer is an automobile.\n \n With the first six models of the McGuire ships, the robotocists attempted to build in the Three Laws exactly as stated. And the first six went insane.\n \n If one human being says \"jump left,\" and another says \"jump right,\" the robot is unable to evaluate which human being has given the more valid order. Feed enough confusing and conflicting data into a robot brain, and it can begin behaving in ways that, in a human being, would be called paranoia or schizophrenia or catatonia or what-have-you, depending\n [16]\n on the symptoms. And an insane robot is fully as dangerous as an insane human being controlling the same mechanical equipment, if not more so.\n \n So the seventh model had been modified. The present McGuire's brain was impressed with slight modifications of the First and Second Laws.\n \n If it is difficult to define a human being, it is much more difficult to define a responsible human being. One, in other words, who can be relied upon to give wise and proper orders to a robot, who can be relied upon not to drive the robot insane.\n \n The robotocists at Viking Spacecraft had decided to take another tack. \"Very well,\" they'd said, \"if we can't define all the members of a group, we can certainly define an individual. We'll pick one responsible person and build McGuire so that he will take orders only from that person.\"\n \n As it turned out, I was that person. Just substitute \"Daniel Oak\" for \"human being\" in the First and Second Laws, and you'll see how important I was to a certain spaceship named McGuire.\n \n \n\n \n When I finally caught the beam from Ceres and set my flitterboat down on the huge landing field that had been carved from the nickel-iron of the asteroid with a focused sun beam, I was itchy with my own perspiration and groggy tired. I don't like riding in flitterboats, sitting on a\n [17]\n bucket seat, astride the drive tube, like a witch on a broomstick, with nothing but a near-invisible transite hull between me and the stars, all cooped up in a vac suit. Unlike driving a car, you can't pull a flitterboat over and take a nap; you have to wait until you hit the next beacon station.\n \n Ceres, the biggest rock in the Belt, is a lot more than just a beacon station. Like Eros and a few others, it's a city in its own right. And except for the Government Reservation, Viking Spacecraft owned Ceres, lock, stock, and mining rights.\n \n Part of the reason for Viking's troubles was envy of that ownership. There were other companies in the Belt that would like to get their hands on that plum, and there were those who were doing everything short of cutting throats to get it. The PSD was afraid it might come to that, too, before very long.\n \n Ceres is fifty-eight million cubic miles of nickel-iron, but nobody would cut her up for that. Nickel-iron is almost exactly as cheap as dirt on Earth, and, considering shipping costs, Earth soil costs a great deal more than nickel-iron in the Belt.\n \n But, as an operations base, Ceres is second to none. Its surface gravity averages .0294 Standard Gee, as compared with Earth's .981, and that's enough to give a slight feeling of weight without unduly hampering the body with too much load. I weigh just under six pounds on Ceres, and after I've been there a while, going back to Earth is a strain that takes a\n [18]\n week to get used to. Kids that are brought up in the Belt are forced to exercise in a room with a one-gee spin on it at least an hour a day. They don't like it at first, but it keeps them from growing up with the strength of mice. And an adult with any sense takes a spin now and then, too. Traveling in a flitterboat will give you a one-gee pull, all right, but you don't get much exercise.\n \n I parked my flitterboat in the space that had been assigned to me by Landing Control, and went over to the nearest air-lock dome.\n \n After I'd cycled through and had shucked my vac suit, I went into the inner room to find Colonel Brock waiting for me.\n \n \"Have a good trip, Oak?\" he asked, trying to put a smile on his scarred, battered face.\n \n \"I got here alive, if that makes it a good flitterboat trip,\" I said, shaking his extended hand.\n \n \"That's the definition of a good trip,\" he told me.\n \n \"Then the question was superfluous. Seriously, what I need is a bath and some sleep.\"\n \n \"You'll get that, but first let's go somewhere where we can talk. Want a drink?\"\n \n \"I could use one, I guess. Your treat?\"\n \n \"My treat,\" he said. \"Come on.\"\n \n I followed him out and down a ladder to a corridor that led north. By definition, any asteroid spins toward the east, and all directions follow from that, regardless of which way the axis may point.\n \n [19]\n \n Colonel Harrington Brock was dressed in the black-and-gold \"union suit\" that was the uniform of Ravenhurst's Security Guard. My own was a tasteful green, but some of the other people in the public corridor seemed to go for more flashiness; besides silver and gold, there were shocking pinks and violent mauves, with stripes and blazes of other colors.\n \n A crowd wearing skin-tight cover-alls might shock the gentle people of Midwich-on-the-Moor, England, but they are normal dress in the Belt. You can't climb into a vac suit with bulky clothing on, and, if you did, you'd hate yourself within an hour, with a curse for every wrinkle that chafed your skin. And, in the Belt, you never know when you might have to get into a vac suit fast. In a \"safe\" area like the tunnels inside Ceres, there isn't much chance of losing air, but there are places where no one but a fool would ever be more than ten seconds away from his vac suit.\n \n I read an article by a psychologist a few months back, in which he claimed that the taste for loud colors in union suits was actually due to modesty. He claimed that the bright patterns drew attention to the colors themselves, and away from the base the colors were laid over. The observer, he said, tends to see the color and pattern of the suit, rather than the body it clings to so closely. Maybe he's right; I wouldn't know, not being a psychologist. I have spent summers in nudist resorts, though, and I never noticed anyone painting themselves with lavender\n [20]\n and chartreuse checks. On the other hand, the people who go to nudist resorts are a self-screened group. So are the people who go to the Belt, for that matter, but the type of screening is different.\n \n I'll just leave that problem in the hands of the psychologists, and go on wearing my immodestly quiet solid-color union suits.\n \n \n\n \n Brock pushed open the inch-thick metal door beneath a sign that said\n\"O'Banion's Bar,\" and I followed him in. We sat down at a table and ordered drinks when the waiter bustled over. A cop in uniform isn't supposed to drink, but Brock figures that the head of the Security Guard ought to be able to get away with a breach of his own rules.\n \n We had our drinks in front of us and our cigarettes lit before Brock opened up with his troubles.\n \n \"Oak,\" he said, \"I wanted to intercept you before you went to the plant because I want you to know that there may be trouble.\"\n \n \"Yeah? What kind?\" Sometimes it's a pain to play ignorant.\n \n \"Thurston's outfit is trying to oust Ravenhurst from the managership of Viking and take over the job. Baedecker Metals & Mining Corporation, which is managed by Baedecker himself, wants to force Viking out of business so that BM&M can take over Ceres for large-scale processing of precious metals.\n \n \"Between the two of 'em, they're raising all sorts of minor hell around\n [21]\n here, and it's liable to become major hell at any time. And we can't stand any hell—or sabotage—around this planetoid just now!\"\n \n \"Now wait a minute,\" I said, still playing ignorant, \"I thought we'd pretty well established that the 'sabotage' of the McGuire series was Jack Ravenhurst's fault. She was the one who was driving them nuts, not Thurston's agents.\"\n \n \"Perfectly true,\" he said agreeably. \"We managed to block any attempts of sabotage by other company agents, even though it looked as though we hadn't for a while.\" He chuckled wryly. \"We went all out to keep the McGuires safe, and all the time the boss' daughter was giving them the works.\" Then he looked sharply at me. \"I covered that, of course. No one in the Security Guard but me knows that Jack was responsible.\"\n \n \"Good. But what about the Thurston and Baedecker agents, then?\"\n \n He took a hefty slug of his drink. \"They're around, all right. We have our eyes on the ones we know, but those outfits are as sharp as we are, and they may have a few agents here on Ceres that we know nothing about.\"\n \n \"So? What does this have to do with me?\"\n \n He put his drink on the table. \"Oak, I want you to help me.\" His onyx-brown eyes, only a shade darker than his skin, looked directly into my own. \"I know it isn't part of your assignment, and you know I can't afford to pay you anything near what you're worth. It will have to come out of my\n [22]\n pocket because I couldn't possibly justify it from operating funds. Ravenhurst specifically told me that he doesn't want you messing around with the espionage and sabotage problem because he doesn't like your methods of operation.\"\n \n \"And you're going to go against his orders?\"\n \n \"I am. Ravenhurst is sore at you personally because you showed him that Jack was responsible for the McGuire sabotage. It's an irrational dislike, and I am not going to let it interfere with my job. I'm going to protect Ravenhurst's interests to the best of my ability, and that means that I'll use the best of other people's abilities if I can.\"\n \n I grinned at him. \"The last I heard, you were sore at me for blatting it all over Ceres that Jaqueline Ravenhurst was missing, when she sneaked aboard McGuire.\"\n \n He nodded perfunctorily. \"I was. I still think you should have told me what you were up to. But you did it, and you got results that I'd been unable to get. I'm not going to let a momentary pique hang on as an irrational dislike. I like to think I have more sense than that.\"\n \n \"Thanks.\" There wasn't much else I could say.\n \n \"Now, I've got a little dough put away; it's not much, but I could offer you—\"\n \n I shook my head, cutting him off. \"Nope. Sorry, Brock. For two reasons. In the first place, there would be a conflict of interest. I'm working for Ravenhurst, and if he doesn't want\n [23]\n me to work for you, then it would be unethical for me to take the job.\n \n \"In the second place, my fees are standardized. Oh, I can allow a certain amount of fluctuation, but I'm not a physician or a lawyer; my services are\n [24]\n not necessary to the survival of the individual, except in very rare cases, and those cases are generally arranged through a lawyer when it's a charity case.\n \n \"No, colonel, I'm afraid I couldn't\n [25]\n possibly work for you.\"\n \n He thought that over for a long time. Finally, he nodded his head very slowly. \"I see. Yeah, I get your point.\" He scowled down at his drink.\n \n \" But ,\" I said, \"it would be a pleasure\n [26]\n to work with you.\"\n \n He looked up quickly. \"How's that?\"\n \n \"Well, let's look at it this way: You can't hire me because I'm already working for Ravenhurst; I can't hire\n [27]\n you because you're working for Ravenhurst. But since we may need each other, and since we're both working for Ravenhurst, there would be no conflict of interest if we co-operate.\n \n \"Or, to put it another way, I can't take money for any service I may render you, but you can pay off in services. Am I coming through?\"\n \n His broad smile made the scars on his face fold in and deepen. \"Loud and clear. It's a deal.\"\n \n I held up a hand, palm toward him. \"Ah, ah, ah! There's no 'deal' involved. We're just old buddies helping each other. This is for friendship, not business. I scratch your back; you scratch mine. Fair?\"\n \n \"Fair. Come on down to my office; I want to give you a headful of facts and figures.\"\n \n \"Will do. Let me finish my guzzle.\"",
      "metadata": {
        "title": "His Master's Voice",
        "author": "Randall Garrett",
        "passage_id": "48513",
        "uid": "3151abb1816042f6af4873d6c2be3d6e",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "104",
                "uid": "8b04d9ebdf95438199bd6a211530d5cd",
                "response_text": "The story begins with Daniel Oak going into Ravenhurst’s office to talk with him about another job. Ravenhurst tells Daniel that there is an issue with the robot McGuire because the robot will only listen to Daniel’s commands. This happened because of the way the robot was programmed and Daniel happened to trigger the programming that attaches the robot to whoever the first person was to speak to it. \n\nRavenhurst does not like Daniel’s methods but hires him anyways to fix the situation. Daniel believes that he is hired because Ravenhurst is afraid of losing his manager position. Ravenhurst hires and sends Daniel to the planet Ceres to work with the roboticists at Viking. Daniel puts on his vacuum suit and boards a flitterboat to Ceres. The reader learns that Daniel is a double agent as he actually works for the UN government’s Secret Service agency, also known as the Political Survey Division.\n\nDaniel is sent to Ceres to help with the robot McGuire. When he arrives at Ceres he is met by Colonel Harrington Brock. He goes to have a drink with Colonel Brock and they create a separate plan from Ravenhurst and team up to implement their own solution to the McGuire problem. \n"
              },
              {
                "worker_id": "102",
                "uid": "8d43ad17ee9948eb8665e2e0eec845d3",
                "response_text": "Daniel Oak enters the office of Shalimar Ravenhurst, the manager of the Viking Spacecraft company whom he describes as an intelligent but unlikeable man, on the planetoid Raven’s Rest. Ravenhurst offers Daniel a glass of wine, and reminds him that he has caused him trouble in the past. He reminds Daniel that the MGYR-7, an advanced robot spaceship operating system capable of understanding and speaking English nicknamed the McGuire, considers only Daniel as its master, rendering it uncooperative. Because of the McGuire self-preservation directive, it doesn’t allow this obedience to be erased. The most efficient path forward, Ravenhurt concludes, is to build the eighth iteration of MGYR, and he hires Daniel to expedite the process. \nDaniel leaves Raven’s Rest and travels in his flitterboat to the planetoid Ceres, a large asteroid with weak a gravitational force conducive to manufacturing mainly owned by Viking, and from which it operates. Daniel is an expediter, a job which involves speeding up projects for companies who hire him. We also learn that Daniel is a member of the Political Survey Division of the UN Government, which is interested in the McGuire project. However, it is not because of its sophistication and complexity, which is similar to that of a traffic pattern control robot, that Daniel has been tasked with gathering information about the McGuire, but rather its language-processing abilities.\nDaniel describes Asimov’s three laws of the robotic brain, which in summary direct the machine to obey human beings. However, because of the difficulty in defining a human being, the first six iterations of the McGuire have failed when conflicting directions are given. Only in the seventh iteration, when the McGuire is directed to regard only the person to first give it instructions as its commander, does the machine achieve any success. \nLanding on Ceres, Daniel is greeted by Colonel Harrington Brock, the head of Ravenhurst’s Security Guard who is dressed in a black-and-gold skin tight suit. Brock invites Daniel for a drink, which he accepts. Brock tells Daniel, who feigns ignorance about the subject, about two competing companies, Thurston and Baedecker Metals & Mining, who aim to sabotage Viking in order to assume control of Ceres. Despite having been asked by Ravenhurst, who disapproves of Daniel’s methods, not to involve Daniel on the project, Brock asks for Daniel’s help on this matter of corporate espionage. Though he refuses being employed by Brock, citing conflicts of interest, he agrees to enter into a cooperative relationship and to help out. \n"
              },
              {
                "worker_id": "101",
                "uid": "8ed73c4775b84a5fab99afd59b1cce28",
                "response_text": "Daniel Oak, a \"Confidential Expediter\" and agent of the Political Survey Division, is called into the office of Shalimar Ravenhurst, owner of Viking Spacecraft. Work is being done to create a new version of a complex robot, called McGuire, who has been sabotaged in its past six attempts. Daniel has been hired to get down to the issue and prevent further sabotage to the seventh model. Upon entering Ravenhurst's office, Daniel is reprimanded as he is told he caused the sabotage of McGuire. McGuire operates to avoid issues by only following the orders of one individual, that person being the first to speak to him; this person ended up being Daniel. Because of this, Ravenhurst tells Daniel that he must go to Ceres, where McGuire is being built, and aid Viking in building a new model. Daniel heads to Ceres in his flitterboat, where he meets Colonel Brock. Brock tells Daniel that a competing business, Baedecker Metals & Mining Corporation, is trying to drive Viking out of business and overtake Ceres and its resources by causing issues and potential sabotages. However, Brock and Daniel are both aware that it was Ravenhurst's daughter, Jack, that has been causing sabotage, which is kept under wraps. Brock then attempts to hire Daniel to help him with the situation, to which Daniel denies, saying that he cannot conflict with Ravenhurst's contract. Daniel then proposes that they instead work alongside each other, and help each other through services and tasks rather than money, and Brock agrees."
              },
              {
                "worker_id": "103",
                "uid": "982a2a3d6b7c48dfa8d6b0272df14c48",
                "response_text": "The story starts with Daniel Oak, a double agent, in Shalimar Raverhurst’s office, and it was the third time that he is on this mountain-sized planetoid. Raverhurst first poured Oak a glass of Madeira. Then he told Oak that he has caused quite a lot of trouble for him. We learn that there is a robot, called McGuire, that has been sabotaged by Oak while he is hired to prevent those kind of things. Because it is kind of difficult to define human being for the robots, thus McGuire is implemented to follow the order of the first person that it speaks to after activation; and apparently, that person is Oak. Then we learn that Oak is a double agent, and he pretends to not know much about this issue at all. So Raverhurst goes on telling Oak why they cannot undo this sabotage: it’s costly thus not worthwhile, and McGuire does not allow others to change his processes. \n\nThen Raverhurst tells Oak that he will be going to Ceres to help build MGYR-8. So then Oak goes into his flitterboat and is going to Ceres. Then we learn from Oak that McGuire is different from other robots such as a traffic robot. Firstly McGuire is mobile in the sense that he is the spacecraft. His spaceship travels very quickly and there is no set paths for the robot to choose from, there is the whole universe. Moreover, he has to deal with unforeseen emergencies as well as with humans. Thus McGuire needs to be able to understand English and can communicate with humans. The most difficult part is defining “human being,” thus McGuire is set to takes order from one individual. \n\nAfter Oak arrives in Ceres, Colonel Harrington Brock, who is the security guard of Ravenhurst, was waiting for him. Instead of going back for a bath and sleep, Brock asks him to have a drink together. At O’Banion’s Bar Brock asks for Oak’s help, while Oak refuses to help, he suggests that they work together in co-operation."
              }
            ]
          },
          {
            "question_text": "What is Daniel Oak’s job?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "104",
                "uid": "8b04d9ebdf95438199bd6a211530d5cd",
                "response_text": "Daniel Oak states that he has an office in New York and describes himself as a Confidential Expediter. He has worked with Ravenhurst before and the story begins with an understanding that Daniel recently completed a job for Ravenhurst. He later mentions that he is a double agent. Daniel works for the Political Survey Division branch of the System Census Bureau for the UN government. Unbeknownst to most of the System’s citizens, the Political Survey Division is the Secret Service arm of the UN government. \n\nA flitterboat is a more economical option than a full spaceship. It is described as having a single gravitoinertial engine. It is meant to have the most basic necessities that are needed for a person to survive their journey, which includes oxygen, water, and the requirement of food necessary. The flitterboat is not necessarily more affordable, but it does provide the purpose of transporting from one Belt to another Belt. Daniel Oak details how a vacuum suit is needed to be worn in a flitterboat.\n"
              },
              {
                "worker_id": "102",
                "uid": "8d43ad17ee9948eb8665e2e0eec845d3",
                "response_text": "Daniel is, officially, a confidential expediter. In this role, he helps to ensure the rapid completion of projects to which his employers have assigned him. Typically, his job involves finding other people who are able to fulfil the request initially assigned to him, and collecting his fee. \nIn the case of the McGuire project, which involves the construction of a sophisticated spaceship operating system capable of understanding and speaking English, Daniel is also operating in his capacity as an agent of the Political survey Division. The PSD is a branch of the System Census Bureau of the UN government, and is often thought to be responsible for surveying the state of political systems throughout the System. However, in reality the PSD more closely resembles a secret service of the UN. \n"
              },
              {
                "worker_id": "101",
                "uid": "8ed73c4775b84a5fab99afd59b1cce28",
                "response_text": "Daniel Oak's official job title is a Confidential Expediter. His job consists of helping others complete tasks, usually hiring a third party and collecting a fee. Daniel Oak is also an agent of the Political Survey Division, a Secret Service organization. In the story, Daniel Oak has been hired by Ravenhurst directly in order to ensure that his company, Viking Spacecraft, succeeds in business with the development of the new McGuire model. He is hired specifically to prevent sabotage to McGuire, as sabotage would lead to the downfall of the Viking business."
              },
              {
                "worker_id": "103",
                "uid": "982a2a3d6b7c48dfa8d6b0272df14c48",
                "response_text": "Daniel Oak is a confidential expediter who helps people to get their things done. So normally he would find someone who is an expert in the area that his customers are looking for, then pair them and then collect the fees. Interestingly, now he is a double agent. He was working for Ravenhurst where he had to prevent sabotage. However, during that job, he was not successful since he did sabotage their robot, McGuire. Because he is the first one that the robot spoke to after it is activated, thus McGuire only listens to the order given by him. Moreover, since costly thus not worthwhile , and McGuire’s build in program does not allow tampering. \n\nCurrently, Ravenhurst is telling Oak to go to Ceres to help with the roboticists build MGYR-8. Because Raverhurst wants it to be not only fast and safe, but also wants it to become something that can be used commercially. And later, when he arrives in Ceres, Brock asks him for help. While he didn’t agree to do so, he did suggest they work together, since they are all working for Ravenhurst, there should not be a conflict of interest. "
              }
            ]
          },
          {
            "question_text": "What is the relationship between Ravenhurst and Daniel Oak?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "104",
                "uid": "8b04d9ebdf95438199bd6a211530d5cd",
                "response_text": "Ravenhurst and Oak do not have a friendly relationship with each other. Occasionally, Ravenhurst occasionally hires Daniel to complete certain jobs for him. Ravenhurst is a high executive at a company that makes robots. He has recently hired Daniel to fix a problem with a robot and has to rehire him to fix a problem that Daniel caused on the previous job. \n\nDaniel is not loyal to Ravenhurst because he has acknowledged that he is a double agent working for the UN government and not just Ravenhurst. In addition, Daniel decides to team up with Colonel Harrington Brock to tackle the problem at hand. The Colonel says that he is doing it in Ravenhurst’s best interests. \n"
              },
              {
                "worker_id": "102",
                "uid": "8d43ad17ee9948eb8665e2e0eec845d3",
                "response_text": "Daniel Oak has previously been hired by Shalimar Ravenhurst, presumably to expedite the completion of the seventh iteration of the McGuire, the MGYR-7, and to resolve the sabotage of the earlier models caused by Ravenhurst’s daughter. Though Daniel regards Ravenhurst as an intelligent man, one at the top of the managerial field, he finds Ravenhurst utterly unlikeable. \n\tIn their interaction on Raven’s Rest, the asteroid occupied by Ravenhurst’s office, Ravenhurst describes his reluctance to hire Daniel to assist in the completion of the MGYR-8 because of his part in making the development of the eighth model necessary. However, Ravenhurst nonetheless acknowledges Daniel’s skill at his job, and hires him. \n"
              },
              {
                "worker_id": "101",
                "uid": "8ed73c4775b84a5fab99afd59b1cce28",
                "response_text": "Ravenhurst is Daniel Oak's employer. Daniel admires Ravenhurst professionally; he sees him as smart, savvy, and practical. However, he believes that Ravenhurst is unpleasant on an interpersonal level. When meeting Ravenhurst in his office, Daniel knows he is being reprimanded and is in an inferior position professionally. Despite this, Daniel's wit gives in and the two have a conversation with snarky remarks and sarcastic comments. Though there is a power dynamic between Ravenhurst and Daniel, Daniel is determined to appear on the same level as Ravenhurst, and throughout conversations with him tries to be one step ahead of his thought process, which irritates Ravenhurst."
              },
              {
                "worker_id": "103",
                "uid": "982a2a3d6b7c48dfa8d6b0272df14c48",
                "response_text": "Ravenhurst hired Daniel Oak to make sure that the robots will not be sabotaged. However, we learn in the beginning of the story that he accidentally sabotaged the robot, McGuire. Ravenhurst tells Oak that because of what he did, now Ravenhurst’s own position is threatened. Oak was hired because Ravenhurst has spent too much money on the McGuire project where things became shaky at Viking, their company. Oak was supposed to fix it, but instead his chance of losing his position as a manger seems to have increased. Then Ravenhurst tells Oak that the MGYR-7 was built with a different meaning on the term “human being” than before. Whoever what the first person that speaks to the robot after activation, that person becomes the only individual that the robot takes order from. And apparently McGuire’s first order came from Oak. So now he is the only individual that can order McGuire. Ravenhurst also tells Oak that they simply cannot change McGuire’s memory. So later, Ravenhurst asks Oak to go to Ceres to help them with building MGYR-8. And after arriving, the readers see that Brock and Oak decide to work with each other. "
              }
            ]
          },
          {
            "question_text": "Describe a flitterboat and when it is used.",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "104",
                "uid": "8b04d9ebdf95438199bd6a211530d5cd",
                "response_text": "A flitterboat is a more economical option than a full spaceship. It is described as having a single gravitoinertial engine. It is meant to have the most basic necessities that are needed for a person to survive their journey, which includes oxygen, water, and the requirement of food necessary. The flitterboat is not necessarily more affordable, but it does provide the purpose of transporting from one Belt to another Belt. Daniel Oak details how a vacuum suit is needed to be worn in a flitterboat. Daniel describes the flitterboat as a tool that does its job, but is not comfortable. "
              },
              {
                "worker_id": "102",
                "uid": "8d43ad17ee9948eb8665e2e0eec845d3",
                "response_text": "A flitterboat is a small, single-person space vehicle capable of navigating from beacon to beacon in the Belt, an area of space in which it is impractical to use full-sized spaceships. It is propelled by a single engine, and contains only a few things necessary for life - water, air, and small amounts of food. \n\tIn order to ride in a flitterboat, the passenger must wear an uncomfortable vac suit and sit straddling a drive tube. The main body of the vessel is composed of a material called transite, which is nearly transparent. The gravitational force inside a flitterboat is one gee. \n"
              },
              {
                "worker_id": "101",
                "uid": "8ed73c4775b84a5fab99afd59b1cce28",
                "response_text": "A flitterboat is a smaller spaceship used for individual transportation on the Belt; to use a full sized spaceship would be inconvenient and impractical, so the flitterboat is used for local travel for one. It has a singular engine and can carry air, and a bit of food and water. It contains an anchor that holds the boat to the ground. Because it is only meant for short travels, one can only last a short amount of time in one, so flitterboats are used to get to and from different beacon points in the neighborhood."
              },
              {
                "worker_id": "103",
                "uid": "982a2a3d6b7c48dfa8d6b0272df14c48",
                "response_text": "The flitterboat has a single gravitoinertial engine and it contains a few necessities of life, air, water and little food. But this flitterboat still costs quite a lot. The flitterboat is used for short distance travelling since it is very hard to stay in a vacuum suit for too long. Thus it is common to hop from beacon to beacon, and this decreases the average speed since most of the time one would spend accelerating and decelerating. The flitterboat has a bucket seat for the driver and it produces a one-gee pull. It sits on the drive tube in a way similar to a witch on a broomstick. Importantly, a flitterboat cannot be stopped whenever it wants to, instead it has to get to a beacon station. Oak uses it when he was told by Raverhurst to travel to Ceres, he wears a vacuum suit when he was going to ride it. First he allowed the boat to get to the top of the planetoid by releasing the magnetic anchor and once the station is reached, the flitterboat has to be parked at the specific space assigned by the Landing Control."
              }
            ]
          },
          {
            "question_text": "How is the current McGuire version different from the previous versions and why is that important?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "104",
                "uid": "8b04d9ebdf95438199bd6a211530d5cd",
                "response_text": "The most recent McGuire is the seventh edition. It is described as being more mobile as it is a spacecraft. It is potentially dangerous because it can move at thousands of miles per second. The most recent version is different from the previous six because it follows Asimov’s famous Three Laws of Robotics more closely than the other versions. The laws emphasize that a robot should define a human being and making sure the robot does not hurt a human. That has previously proven difficult. McGuire version 7 circumnavigated the issue by defining whatever first awoken the robot as a human and its controller."
              },
              {
                "worker_id": "102",
                "uid": "8d43ad17ee9948eb8665e2e0eec845d3",
                "response_text": "The present iteration of the McGuire, the MGYR-7, is different in its interpretation of Asimov’s three laws of robotics. These three laws, as they are told to the reader by Daniel, are the following: firstly, a robot cannot harm a human being; secondly, a robot must obey orders from human, expect when in conflict with the first law, and thirdly, a robot shall be self-preserving, except when in conflict with the first and third laws. In the first six models of the McGuire, the engineers encoded Asimov’s laws into the machine’s directives. However, this led to erratic and insane-like behaviour from the robot when conflicting commands were issued. \n\tThe seventh iteration, however, resolves this issue by instead restricting the individuals from whom the McGuire takes orders to only that person who issues the first order. The roboticists responsible for designing the McGuire, however, have noticed issues in the MGYR-7, which they aim to resolve in the eighth iteration, the construction of which Daniel has been hired to expedite. \n"
              },
              {
                "worker_id": "101",
                "uid": "8ed73c4775b84a5fab99afd59b1cce28",
                "response_text": "The previous models of McGuire struggled because of the difficulty to define what a \"human being\" is to robots. The Three Laws for robot construction state that robots must not allow harm to a human being, as well as obey orders from a human being. However, when receiving contradicting yet equally qualifying orders from two different human beings, the previous McGuire models would malfunction out of confusion. The seventh model, the current McGuire, narrowed down the definition of what a \"human being\" is, down to an individual. McGuire was constructed so that the individual he would obey would be the first individual that spoke to him when he was built. This is important because Daniel Oak, being the first human to interact with McGuire, is at the center of the robot's objectives."
              },
              {
                "worker_id": "103",
                "uid": "982a2a3d6b7c48dfa8d6b0272df14c48",
                "response_text": "Firstly,  McGuire is different because he is mobile, in a way, he is the spaceship. Different from the traffic robot, he is in charge of one single object. But since the object is moving very fast through space where no specified pathway is determined, McGuire has to be able to react fast. Moreover, McGuire needs to understand English in order to communicate with human beings. \n\nMost importantly, the current version of the robot, McGuire, has alteration in the definition of “human being,” instead of trying to define what human being is as the previous versions did, there will be one person who McGuire takes orders from, since defining individuals are way easier. Previously, they tried to allow robots listen to any one identified as human being. However, this easily made the robots go insane. Once two people – human beings – give an opposing order, the robot does not know what to do. The robot does not know who has a higher authority, thus not knowing which order to follow. Taking order from an individual will completely avoid such problems. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5146,
        "document_length_chars": 28828
      }
    }
  ]
}