{
  "item_metadata": {
    "item_id": "49165",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "49165",
      "content": "Brightside Crossing\n \n by Alan E. Nourse\n \n JAMES BARON was not pleased to hear that he had had a visitor when he reached the Red Lion that evening. He had no stomach for mysteries, vast or trifling, and there were pressing things to think about at this time. Yet the doorman had flagged him as he came in from the street: “A thousand pardons, Mr. Baron. The gentleman—he would leave no name. He said you’d want to see him. He will be back by eight.”\n \n \n Now Baron drummed his fingers on the table top, staring about the quiet lounge. Street trade was discouraged at the Red Lion, gently but persuasively; the patrons were few in number. Across to the right was a group that Baron knew vaguely—Andean climbers, or at least two of them were. Over near the door he recognized old Balmer, who had mapped the first passage to the core of Vulcan Crater on Venus. Baron returned his smile with a nod. Then he settled back and waited impatiently for the intruder who demanded his time without justifying it.\n \n \n Presently a small, grizzled man crossed the room and sat down at Baron’s table. He was short and wiry. His face held no key to his age—he might have been thirty or a thousand—but he looked weary and immensely ugly. His cheeks and forehead were twisted and brown, with scars that were still healing.\n \n \n The stranger said, “I’m glad you waited. I’ve heard you’re planning to attempt the Brightside.”\n \n \n Baron stared at the man for a moment. “I see you can read telecasts,” he said coldly. “The news was correct. We are going to make a Brightside Crossing.”\n \n \n “At perihelion?”\n \n \n “Of course. When else?”\n \n \n The grizzled man searched Baron’s face for a moment without expression. Then he said slowly, “No, I’m afraid you’re not going to make the Crossing.”\n \n \n “Say, who are you, if you don’t mind?” Baron demanded.\n \n \n “The name is Claney,” said the stranger.\n \n \n There was a silence. Then: “Claney? Peter Claney?”\n \n \n “That’s right.”\n \n \n Baron’s eyes were wide with excitement, all trace of anger gone. “Great balls of fire, man— where have you been hiding? We’ve been trying to contact you for months!”\n \n \n “I know. I was hoping you’d quit looking and chuck the whole idea.”\n \n \n “Quit looking!” Baron bent forward over the table. “My friend, we’d given up hope, but we’ve never quit looking. Here, have a drink. There’s so much you can tell us.” His fingers were trembling.\n \n \n Peter Claney shook his head. “I can’t tell you anything you want to hear.”\n \n \n “But you’ve got to. You’re the only man on Earth who’s attempted a Brightside Crossing and lived through it! And the story you cleared for the news—it was nothing. We need details . Where did your equipment fall down? Where did you miscalculate? What were the trouble spots?” Baron jabbed a finger at Claney’s face. “That, for instance—epithelioma? Why? What was wrong with your glass? Your filters? We’ve got to know those things. If you can tell us, we can make it across where your attempt failed—”\n \n \n “You want to know why we failed?” asked Claney.\n \n \n “Of course we want to know. We have to know.”\n \n \n “It’s simple. We failed because it can’t be done. We couldn’t do it and neither can you. No human beings will ever cross the Brightside alive, not if they try for centuries.”\n \n \n “Nonsense,” Baron declared. “We will.”\n \n \n Claney shrugged. “I was there. I know what I’m saying. You can blame the equipment or the men—there were flaws in both quarters—but we just didn’t know what we were fighting. It was the planet that whipped us, that and the Sun . They’ll whip you, too, if you try it.”\n \n \n “Never,” said Baron.\n \n \n “Let me tell you,” Peter Claney said.\n \n \n\n I’d been interested in the Brightside for almost as long as I can remember (Claney said). I guess I was about ten when Wyatt and Carpenter made the last attempt—that was in 2082, I think. I followed the news stories like a tri-V serial and then I was heartbroken when they just disappeared.\n \n \n I know now that they were a pair of idiots, starting off without proper equipment, with practically no knowledge of surface conditions, without any charts—they couldn’t have made a hundred miles—but I didn’t know that then and it was a terrible tragedy. After that, I followed Sanderson’s work in the Twilight Lab up there and began to get Brightside into my blood, sure as death.\n \n \n But it was Mikuta’s idea to attempt a Crossing. Did you ever know Tom Mikuta? I don’t suppose you did. No, not Japanese—Polish-American. He was a major in the Interplanetary Service for some years and hung onto the title after he gave up his commission.\n \n \n He was with Armstrong on Mars during his Service days, did a good deal of the original mapping and surveying for the Colony there. I first met him on Venus; we spent five years together up there doing some of the nastiest exploring since the Matto Grasso. Then he made the attempt on Vulcan Crater that paved the way for Balmer a few years later.\n \n \n I’d always liked the Major—he was big and quiet and cool, the sort of guy who always had things figured a little further ahead than anyone else and always knew what to do in a tight place. Too many men in this game are all nerve and luck, with no judgment. The Major had both. He also had the kind of personality that could take a crew of wild men and make them work like a well-oiled machine across a thousand miles of Venus jungle. I liked him and I trusted him.\n \n \n He contacted me in New York and he was very casual at first. We spent an evening here at the Red Lion, talking about old times; he told me about the Vulcan business, and how he’d been out to see Sanderson and the Twilight Lab on Mercury, and how he preferred a hot trek to a cold one any day of the year—and then he wanted to know what I’d been doing since Venus and what my plans were.\n \n \n “No particular plans,” I told him. “Why?”\n \n \n He looked me over. “How much do you weigh, Peter?”\n \n \n I told him one-thirty-five.\n \n \n “That much!” he said. “Well, there can’t be much fat on you, at any rate. How do you take heat?”\n \n \n “You should know,” I said. “Venus was no icebox.”\n \n \n “No, I mean real heat.”\n \n \n Then I began to get it. “You’re planning a trip.”\n \n \n “That’s right. A hot trip.” He grinned at me. “Might be dangerous, too.”\n \n \n “What trip?”\n \n \n “Brightside of Mercury,” the Major said.\n \n \n I whistled cautiously. “At aphelion?”\n \n \n He threw his head back. “Why try a Crossing at aphelion? What have you done then? Four thousand miles of butcherous heat, just to have some joker come along, use your data and drum you out of the glory by crossing at perihelion forty-four days later? No, thanks. I want the Brightside without any nonsense about it.” He leaned across me eagerly. “I want to make a Crossing at perihelion and I want to cross on the surface. If a man can do that, he’s got Mercury. Until then, nobody’s got Mercury. I want Mercury—but I’ll need help getting it.”\n \n \n I’d thought of it a thousand times and never dared consider it. Nobody had, since Wyatt and Carpenter disappeared. Mercury turns on its axis in the same time that it wheels around the Sun, which means that the Brightside is always facing in. That makes the Brightside of Mercury at perihelion the hottest place in the Solar System, with one single exception: the surface of the Sun itself.\n \n \n It would be a hellish trek. Only a few men had ever learned just how hellish and they never came back to tell about it. It was a real hell’s Crossing, but someday, I thought, somebody would cross it.\n \n \n I wanted to be along.\n \n \n\n The Twilight Lab, near the northern pole of Mercury, was the obvious jumping-off place. The setup there wasn’t very extensive—a rocket landing, the labs and quarters for Sanderson’s crew sunk deep into the crust, and the tower that housed the Solar ’scope that Sanderson had built up there ten years before.\n \n \n Twilight Lab wasn’t particularly interested in the Brightside, of course—the Sun was Sanderson’s baby and he’d picked Mercury as the closest chunk of rock to the Sun that could hold his observatory. He’d chosen a good location, too. On Mercury, the Brightside temperature hits 770° F. at perihelion and the Darkside runs pretty constant at -410° F. No permanent installation with a human crew could survive at either extreme. But with Mercury’s wobble, the twilight zone between Brightside and Darkside offers something closer to survival temperatures.\n \n \n Sanderson built the Lab up near the pole, where the zone is about five miles wide, so the temperature only varies 50 to\n60 degrees with the libration. The Solar ’scope could take that much change and they’d get good clear observation of the Sun for about seventy out of the eighty-eight days it takes the planet to wheel around.\n \n \n The Major was counting on Sanderson knowing something about Mercury as well as the Sun when we camped at the Lab to make final preparations.\n \n \n Sanderson did. He thought we’d lost our minds and he said so, but he gave us all the help he could. He spent a week briefing Jack Stone, the third member of our party, who had arrived with the supplies and equipment a few days earlier. Poor Jack met us at the rocket landing almost bawling, Sanderson had given him such a gloomy picture of what Brightside was like.\n \n \n Stone was a youngster—hardly twenty-five, I’d say—but he’d been with the Major at Vulcan and had begged to join this trek. I had a funny feeling that Jack really didn’t care for exploring too much, but he thought Mikuta was God, followed him around like a puppy.\n \n \n It didn’t matter to me as long as he knew what he was getting in for. You don’t go asking people in this game why they do it—they’re liable to get awfully uneasy and none of them can ever give you an answer that makes sense. Anyway, Stone had borrowed three men from the Lab, and had the supplies and equipment all lined up when we got there, ready to check and test.\n \n \n We dug right in. With plenty of funds—tri-V money and some government cash the Major had talked his way around—our equipment was new and good. Mikuta had done the designing and testing himself, with a big assist from Sanderson. We had four Bugs, three of them the light pillow-tire models, with special lead-cooled cut-in engines when the heat set in, and one heavy-duty tractor model for pulling the sledges.\n \n \n The Major went over them like a kid at the circus. Then he said, “Have you heard anything from McIvers?”\n \n \n “Who’s he?” Stone wanted to know.\n \n \n “He’ll be joining us. He’s a good man—got quite a name for climbing, back home.” The Major turned to me. “You’ve probably heard of him.”\n \n \n I’d heard plenty of stories about Ted McIvers and I wasn’t too happy to hear that he was joining us. “Kind of a daredevil, isn’t he?”\n \n \n “Maybe. He’s lucky and skillful. Where do you draw the line? We’ll need plenty of both.”\n \n \n “Have you ever worked with him?” I asked.\n \n \n “No. Are you worried?”\n \n \n “Not exactly. But Brightside is no place to count on luck.”\n \n \n The Major laughed. “I don’t think we need to worry about McIvers. We understood each other when I talked up the trip to him and we’re going to need each other too much to do any fooling around.” He turned back to the supply list.\n“Meanwhile, let’s get this stuff listed and packed. We’ll need to cut weight sharply and our time is short. Sanderson says we should leave in three days.”\n \n \n Two days later, McIvers hadn’t arrived. The Major didn’t say much about it. Stone was getting edgy and so was I. We spent the second day studying charts of the Brightside, such as they were. The best available were pretty poor, taken from so far out that the detail dissolved into blurs on blow-up. They showed the biggest ranges of peaks and craters and faults, and that was all. Still, we could use them to plan a broad outline of our course.\n \n \n “This range here,” the Major said as we crowded around the board, “is largely inactive, according to Sanderson. But these to the south and west could be active. Seismograph tracings suggest a lot of activity in that region, getting worse down toward the equator—not only volcanic, but sub-surface shifting.”\n \n \n Stone nodded. “Sanderson told me there was probably constant surface activity.”\n \n \n The Major shrugged. “Well, it’s treacherous, there’s no doubt of it. But the only way to avoid it is to travel over the Pole, which would lose us days and offer us no guarantee of less activity to the west. Now we might avoid some if we could find a pass through this range and cut sharp east—”\n \n \n It seemed that the more we considered the problem, the further we got from a solution. We knew there were active volcanoes on the Brightside—even on the Darkside, though surface activity there was pretty much slowed down and localized.\n \n \n But there were problems of atmosphere on Brightside, as well. There was an atmosphere and a constant atmospheric flow from Brightside to Darkside. Not much—the lighter gases had reached escape velocity and disappeared from Brightside millennia ago—but there was CO\n 2\n , and nitrogen, and traces of other heavier gases. There was also an abundance of sulfur vapor, as well as carbon disulfide and sulfur dioxide.\n \n \n The atmospheric tide moved toward the Darkside, where it condensed, carrying enough volcanic ash with it for Sanderson to estimate the depth and nature of the surface upheavals on Brightside from his samplings. The trick was to find a passage that avoided those upheavals as far as possible. But in the final analysis, we were barely scraping the surface. The only way we would find out what was happening where was to be there.\n \n \n Finally, on the third day, McIvers blew in on a freight rocket from Venus. He’d missed the ship that the Major and I had taken by a few hours, and had conned his way to Venus in hopes of getting a hop from there. He didn’t seem too upset about it, as though this were his usual way of doing things and he couldn’t see why everyone should get so excited.\n \n \n He was a tall, rangy man with long, wavy hair prematurely gray, and the sort of eyes that looked like a climber’s—half-closed, sleepy, almost indolent, but capable of abrupt alertness. And he never stood still; he was always moving, always doing something with his hands, or talking, or pacing about.\n \n \n Evidently the Major decided not to press the issue of his arrival. There was still work to do, and an hour later we were running the final tests on the pressure suits. That evening, Stone and McIvers were thick as thieves, and everything was set for an early departure after we got some rest.\n \n \n\n “And that,” said Baron, finishing his drink and signaling the waiter for another pair, “was your first big mistake.”\n \n \n Peter Claney raised his eyebrows. “McIvers?”\n \n \n “Of course.”\n \n \n Claney shrugged, glanced at the small quiet tables around them. “There are lots of bizarre personalities around a place like this, and some of the best wouldn’t seem to be the most reliable at first glance. Anyway, personality problems weren’t our big problem right then. Equipment worried us first and route next.”\n \n \n Baron nodded in agreement. “What kind of suits did you have?”\n \n \n “The best insulating suits ever made,” said Claney. “Each one had an inner lining of a fiberglass modification, to avoid the clumsiness of asbestos, and carried the refrigerating unit and oxygen storage which we recharged from the sledges every eight hours. Outer layer carried a monomolecular chrome reflecting surface that made us glitter like Christmas trees. And we had a half-inch dead-air space under positive pressure between the two layers. Warning thermocouples, of course—at\n770 degrees, it wouldn’t take much time to fry us to cinders if the suits failed somewhere.”\n \n \n “How about the Bugs?”\n \n \n “They were insulated, too, but we weren’t counting on them too much for protection.”\n \n \n “You weren’t!” Baron exclaimed. “Why not?”\n \n \n “We’d be in and out of them too much. They gave us mobility and storage, but we knew we’d have to do a lot of forward work on foot.” Claney smiled bitterly. “Which meant that we had an inch of fiberglass and a half-inch of dead air between us and a surface temperature where lead flowed like water and zinc was almost at melting point and the pools of sulfur in the shadows were boiling like oatmeal over a campfire.”\n \n \n Baron licked his lips. His fingers stroked the cool, wet glass as he set it down on the tablecloth.\n \n \n “Go on,” he said tautly. “You started on schedule?”\n \n \n “Oh, yes,” said Claney, “we started on schedule, all right. We just didn’t quite end on schedule, that was all. But I’m getting to that.”\n \n \n He settled back in his chair and continued.\n \n \n\n We jumped off from Twilight on a course due southeast with thirty days to make it to the Center of Brightside. If we could cross an average of seventy miles a day, we could hit Center exactly at perihelion, the point of Mercury’s closest approach to the Sun—which made Center the hottest part of the planet at the hottest it ever gets.\n \n \n The Sun was already huge and yellow over the horizon when we started, twice the size it appears on Earth. Every day that Sun would grow bigger and whiter, and every day the surface would get hotter. But once we reached Center, the job was only half done—we would still have to travel another two thousand miles to the opposite twilight zone. Sanderson was to meet us on the other side in the Laboratory’s scout ship, approximately sixty days from the time we jumped off.\n \n \n That was the plan, in outline. It was up to us to cross those seventy miles a day, no matter how hot it became, no matter what terrain we had to cross. Detours would be dangerous and time-consuming. Delays could cost us our lives. We all knew that.\n \n \n The Major briefed us on details an hour before we left.\n“Peter, you’ll take the lead Bug, the small one we stripped down for you. Stone and I will flank you on either side, giving you a hundred-yard lead. McIvers, you’ll have the job of dragging the sledges, so we’ll have to direct your course pretty closely. Peter’s job is to pick the passage at any given point. If there’s any doubt of safe passage, we’ll all explore ahead on foot before we risk the Bugs. Got that?”\n \n \n McIvers and Stone exchanged glances. McIvers said: “Jack and I were planning to change around. We figured he could take the sledges. That would give me a little more mobility.”\n \n \n The Major looked up sharply at Stone. “Do you buy that, Jack?”\n \n \n Stone shrugged. “I don’t mind. Mac wanted—”\n \n \n McIvers made an impatient gesture with his hands. “It doesn’t matter. I just feel better when I’m on the move. Does it make any difference?”\n \n \n “I guess it doesn’t,” said the Major. “Then you’ll flank Peter along with me. Right?”\n \n \n “Sure, sure.” McIvers pulled at his lower lip. “Who’s going to do the advance scouting?”\n \n \n “It sounds like I am,” I cut in. “We want to keep the lead Bug light as possible.”\n \n \n Mikuta nodded. “That’s right. Peter’s Bug is stripped down to the frame and wheels.”\n \n \n McIvers shook his head. “No, I mean the advance work. You need somebody out ahead—four or five miles, at least—to pick up the big flaws and active surface changes, don’t you?” He stared at the Major. “I mean, how can we tell what sort of a hole we may be moving into, unless we have a scout up ahead?”\n \n \n “That’s what we have the charts for,” the Major said sharply.\n \n \n “Charts! I’m talking about detail work. We don’t need to worry about the major topography. It’s the little faults you can’t see on the pictures that can kill us.” He tossed the charts down excitedly. “Look, let me take a Bug out ahead and work reconnaissance, keep five, maybe ten miles ahead of the column. I can stay on good solid ground, of course, but scan the area closely and radio back to Peter where to avoid the flaws. Then—”\n \n \n “No dice,” the Major broke in.\n \n \n “But why not? We could save ourselves days!”\n \n \n “I don’t care what we could save. We stay together. When we get to the Center, I want live men along with me. That means we stay within easy sight of each other at all times. Any climber knows that everybody is safer in a party than one man alone—any time, any place.”\n \n \n McIvers stared at him, his cheeks an angry red. Finally he gave a sullen nod. “Okay. If you say so.”\n \n \n “Well, I say so and I mean it. I don’t want any fancy stuff. We’re going to hit Center together, and finish the Crossing together. Got that?”\n \n \n McIvers nodded. Mikuta then looked at Stone and me and we nodded, too.\n \n \n “All right,” he said slowly. “Now that we’ve got it straight, let’s go.”\n \n \n It was hot. If I forget everything else about that trek, I’ll never forget that huge yellow Sun glaring down, without a break, hotter and hotter with every mile. We knew that the first few days would be the easiest and we were rested and fresh when we started down the long ragged gorge southeast of the Twilight Lab.\n \n \n I moved out first; back over my shoulder, I could see the Major and McIvers crawling out behind me, their pillow tires taking the rugged floor of the gorge smoothly. Behind them, Stone dragged the sledges.\n \n \n Even at only 30 per cent Earth gravity they were a strain on the big tractor, until the ski-blades bit into the fluffy volcanic ash blanketing the valley. We even had a path to follow for the first twenty miles.\n \n \n I kept my eyes pasted to the big polaroid binocs, picking out the track the early research teams had made out into the edge of Brightside. But in a couple of hours we rumbled past Sanderson’s little outpost observatory and the tracks stopped. We were in virgin territory and already the Sun was beginning to bite.\n \n \n We didn’t feel the heat so much those first days out. We saw it. The refrig units kept our skins at a nice comfortable seventy-five degrees Fahrenheit inside our suits, but our eyes watched that glaring Sun and the baked yellow rocks going past, and some nerve pathways got twisted up, somehow. We poured sweat as if we were in a superheated furnace.\n \n \n We drove eight hours and slept five. When a sleep period came due, we pulled the Bugs together into a square, threw up a light aluminum sun-shield and lay out in the dust and rocks. The sun-shield cut the temperature down sixty or seventy degrees, for whatever help that was. And then we ate from the forward sledge—sucking through tubes—protein, carbohydrates, bulk gelatin, vitamins.\n \n \n The Major measured water out with an iron hand, because we’d have drunk ourselves into nephritis in a week otherwise. We were constantly, unceasingly thirsty. Ask the physiologists and psychiatrists why—they can give you have a dozen interesting reasons—but all we knew, or cared about, was that it happened to be so.\n \n \n We didn’t sleep the first few stops, as a consequence. Our eyes burned in spite of the filters and we had roaring headaches, but we couldn’t sleep them off. We sat around looking at each other. Then McIvers would say how good a beer would taste, and off we’d go. We’d have murdered our grandmothers for one ice-cold bottle of beer.\n \n \n After a few driving periods, I began to get my bearings at the wheel. We were moving down into desolation that made Earth’s old Death Valley look like a Japanese rose garden. Huge sun-baked cracks opened up in the floor of the gorge, with black cliffs jutting up on either side; the air was filled with a barely visible yellowish mist of sulfur and sulfurous gases.\n \n \n It was a hot, barren hole, no place for any man to go, but the challenge was so powerful you could almost feel it. No one had ever crossed this land before and escaped. Those who had tried it had been cruelly punished, but the land was still there, so it had to be crossed. Not the easy way. It had to be crossed the hardest way possible: overland, through anything the land could throw up to us, at the most difficult time possible.\n \n \n Yet we knew that even the land might have been conquered before, except for that Sun. We’d fought absolute cold before and won. We’d never fought heat like this and won. The only worse heat in the Solar System was the surface of the Sun itself.\n \n \n Brightside was worth trying for. We would get it or it would get us. That was the bargain.\n \n \n I learned a lot about Mercury those first few driving periods. The gorge petered out after a hundred miles and we moved onto the slope of a range of ragged craters that ran south and east. This range had shown no activity since the first landing on Mercury forty years before, but beyond it there were active cones. Yellow fumes rose from the craters constantly; their sides were shrouded with heavy ash.\n \n \n We couldn’t detect a wind, but we knew there was a hot, sulfurous breeze sweeping in great continental tides across the face of the planet. Not enough for erosion, though. The craters rose up out of jagged gorges, huge towering spears of rock and rubble. Below were the vast yellow flatlands, smoking and hissing from the gases beneath the crust. Over everything was gray dust—silicates and salts, pumice and limestone and granite ash, filling crevices and declivities—offering a soft, treacherous surface for the Bug’s pillow tires.\n \n \n I learned to read the ground, to tell a covered fault by the sag of the dust; I learned to spot a passable crack, and tell it from an impassable cut. Time after time the Bugs ground to a halt while we explored a passage on foot, tied together with light copper cable, digging, advancing, digging some more until we were sure the surface would carry the machines. It was cruel work; we slept in exhaustion. But it went smoothly, at first.\n \n \n Too smoothly, it seemed to me, and the others seemed to think so, too.\n \n \n McIvers’ restlessness was beginning to grate on our nerves. He talked too much, while we were resting or while we were driving; wisecracks, witticisms, unfunny jokes that wore thin with repetition. He took to making side trips from the route now and then, never far, but a little further each time.\n \n \n Jack Stone reacted quite the opposite; he grew quieter with each stop, more reserved and apprehensive. I didn’t like it, but I figured that it would pass off after a while. I was apprehensive enough myself; I just managed to hide it better.\n \n \n And every mile the Sun got bigger and whiter and higher in the sky and hotter. Without our ultra-violet screens and glare filters we would have been blinded; as it was our eyes ached constantly and the skin on our faces itched and tingled at the end of an eight-hour trek.\n \n \n But it took one of those side trips of McIvers’ to deliver the penultimate blow to our already fraying nerves. He had driven down a side-branch of a long canyon running off west of our route and was almost out of sight in a cloud of ash when we heard a sharp cry through our earphones.\n \n \n I wheeled my Bug around with my heart in my throat and spotted him through the binocs, waving frantically from the top of his machine. The Major and I took off, lumbering down the gulch after him as fast as the Bugs could go, with a thousand horrible pictures racing through our minds....\n \n \n We found him standing stock-still, pointing down the gorge and, for once, he didn’t have anything to say. It was the wreck of a Bug; an old-fashioned half-track model of the sort that hadn’t been in use for years. It was wedged tight in a cut in the rock, an axle broken, its casing split wide open up the middle, half-buried in a rock slide. A dozen feet away were two insulated suits with white bones gleaming through the fiberglass helmets.\n \n \n This was as far as Wyatt and Carpenter had gotten on their Brightside Crossing.\n \n \n\n On the fifth driving period out, the terrain began to change. It looked the same, but every now and then it felt different. On two occasions I felt my wheels spin, with a howl of protest from my engine. Then, quite suddenly, the Bug gave a lurch; I gunned my motor and nothing happened.\n \n \n I could see the dull gray stuff seeping up around the hubs, thick and tenacious, splattering around in steaming gobs as the wheels spun. I knew what had happened the moment the wheels gave and, a few minutes later, they chained me to the tractor and dragged me back out of the mire. It looked for all the world like thick gray mud, but it was a pit of molten lead, steaming under a soft layer of concealing ash.\n \n \n I picked my way more cautiously then. We were getting into an area of recent surface activity; the surface was really treacherous. I caught myself wishing that the Major had okayed McIvers’ scheme for an advanced scout; more dangerous for the individual, maybe, but I was driving blind now and I didn’t like it.\n \n \n One error in judgment could sink us all, but I wasn’t thinking much about the others. I was worried about me , plenty worried. I kept thinking, better McIvers should go than me. It wasn’t healthy thinking and I knew it, but I couldn’t get the thought out of my mind.\n \n \n It was a grueling eight hours and we slept poorly. Back in the Bug again, we moved still more slowly—edging out on a broad flat plateau, dodging a network of gaping surface cracks—winding back and forth in an effort to keep the machines on solid rock. I couldn’t see far ahead, because of the yellow haze rising from the cracks, so I was almost on top of it when I saw a sharp cut ahead where the surface dropped six feet beyond a deep crack.\n \n \n I let out a shout to halt the others; then I edged my Bug forward, peering at the cleft. It was deep and wide. I moved fifty yards to the left, then back to the right.\n \n \n There was only one place that looked like a possible crossing; a long, narrow ledge of gray stuff that lay down across a section of the fault like a ramp. Even as I watched it, I could feel the surface crust under the Bug trembling and saw the ledge shift over a few feet.",
      "metadata": {
        "title": "Brightside Crossing",
        "author": "Alan E. Nourse",
        "passage_id": "49165",
        "uid": "0b5c035a14a84470a4129c9e1fd3f2ec",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "6",
                "uid": "d624859e69234bba96888a00c6e99637",
                "response_text": "James Baron is planning a trek to Brightside Crossing on Mercury, a feat so far unaccomplished. Few had tried, and those that did died. All except for one. He is asked to wait at the Red Baron as someone wanted to see him at 8. He waits patiently and is rewarded with the company of Peter Claney, the man who made it back home. Claney instantly tells him to give up on the journey and stay on Earth. Baron asks for details about their trek and what went wrong, but Claney refuses to give him the details. Claney is an older man now with an epithelioma on his face. Although he came to warn him, he quickly learns that Baron may only listen if he hears the truth. So Claney recounts the story. \nMajor Tom Mikuta recruited Claney, Jack Stone, and Ted McIvers to join him. They were to adventure to the Brightside Crossing at perihelion, a more dangerous journey. Temperatures reached up to 770 degrees Fahrenheit at perihelion, but Mikuta was an all-or-nothing man. Stone arrived on Mercury first, soon followed by Mikuta and Claney. McIvers was the last to arrive and they left soon after with three Bugs and one tractor dragging the sledges. Stone was briefed by Sanderson, the head of the observatory, before they left, and the men pored over all images and maps of the Crossing before beginning. \nDespite their high-tech spacesuits and general gadgets, the giant sun still got to them. They were constantly thirsty and hot, and their skin itched and burned. They drove for eight hours, then slept for five. They needed to travel 70 miles a day. It would take 30 days to reach the Center, and then another 30 to reach the pick-up spot. The journey quickly took a toll on Stone, who was the most apprehensive of the bunch. He retreats into himself, while McIvers chatters nonstop to fill the silence. Tension grew among the crew, especially as McIvers put himself at risk by adventuring away from them. \nClaney lead the gang in his Bug, while McIvers and Mikuta flanked him. Stone was in the very back. If Claney saw something suspicious or unsafe, they would investigate on foot before continuing in their equipment. \nAs they travel, they got closer to the Sun, which appeared to be twice as big as it did on Earth. Several drives into their journey, McIvers discovered something truly terrible on one of his forrays. He screamed into the intercom, alerting the others who quickly rushed after him. He stood there, pointing below. There lay a broken, older Bug and two corpses. Wyatt and Carpenter, the original discoverers. \nThey continued on with disheartened spirits until Claney reached a cleft. There was no way to cross it, except for a very small and dangerous ledge. The cleft slowly began to crumble under their Bugs and they’re left in a very precarious position. "
              },
              {
                "worker_id": "10",
                "uid": "19835953f87c459d973eba846d7d84a0",
                "response_text": "The story is about a man, Baron, who is planning to cross the bright side of the planet Mercury. Right before the trip is about to depart he runs into one of the famous adventurers that attempted it before him, Peter Claney, at a bar called the Red Lion. Peter goes into a long recollection of his experience to Baron, which is interspersed with them snapping back to reality at the bar. \n\nPeter’s attempted Brightside crossing involved a party of four: the Major (a trusted team captain of sorts), himself (who would be in the lead Bug of the expedition), McIver (who would flank one side of Peter along with the Major), and Stone (who would drag the sledges). They began the expedition at a place called the Twilight lab, an observatory for studying the sun run by a person called Sanders located in a 5 mile wide transition between the bright and dark sides of Mercury which had hospitable temperatures for humans to survive.\n\nOver the course of their journey, tensions between them grew tense. McIver started to drive on little side trips during their daily driving in the Bug vehicles. On one of his side trips he discovered the skeletons of the last known explorers that came before them - Wyatt and Carpenter. Peter does not finish recounting his tale before the story closes, but the reader knows he never did successfully make the crossing, although he did survive (because he is presently sitting in the bar with Baron and recalling this tale from the past).\n\nIt is revealed that Peter’s expedition party went beyond the farthest known point explored by humans (due to finding the bodies), and that he thinks a couple of mistakes were made in equipment choices and in not having a person driving several miles ahead to scout the terrain before the entire convoy had to drive through it.\n"
              },
              {
                "worker_id": "9",
                "uid": "dacfa9fae2214c70ac8b0bb8ec400e3f",
                "response_text": "An explorer named James Baron waits irritatedly for a stranger in the Red Lion, a bar in New York. The stranger turns out to be another explorer, Peter Claney, whom Baron has been attempting to contact to get the details of Claney’s previous mission to Mercury’s Brightside, as he is the only man on Earth to have survived and attempt to cross the Brightside, and Baron plans to attempt it soon himself. Claney says it can’t be done, and that he’ll tell Baron his story to prove it to him. The rest of the passage takes place within Claney’s story. \n\nClaney tells of his desire since childhood to attempt the journey, and how he met Major Mikuta, who wants to attempt it. Claney joins Mikuta, along with a young acolyte of the Major’s, Jack Stone, and an impetuous, thrill-seeking climber named Ted McIvers. The addition of McIvers to the team is an unwelcome surprise to Claney, and he proves to be headstrong and restless. \n\nThe team plans and strategizes at Twilight Lab at Mercury’s north pole. They set out on their journey with Claney out front and in charge of finding safe passage routes, Mikuta and McIvers flanking him on either side, and Stone pulling the sledges in the rear. They were state-of-the-art protective equipment and travel in “bug” vehicles, but the terrain and atmosphere are treacherous. They grow more anxious as they go, with McIvers driving the rest of the crew nuts with his constant talking and wandering, and Stone growing more quiet and reserved. Their nerves are further troubled by the discovery of two previous explorers’ corpses (the two explorers Claney had mentioned looking up to as a kid). \n\nAs the passage ends, Claney is in a precarious position at the edge of a chasm with only a thin, ramp-like surface that is already shifting as he watches and ponders how they’ll cross. \n"
              },
              {
                "worker_id": "1",
                "uid": "f9b0380e4e004119bdf2e81a8f3b703a",
                "response_text": "Peter Claney shows up at the Red Lion to convince James Baron not to go on his trip to the Brightside Crossing. Baron has been trying to find Claney for months to learn about his attempt at crossing the Brightside. Claney is the only person on earth who has attempted the ordeal and made it out alive, but Claney says that it simply cannot be done. It’s impossible. \n\nClaney explains that a major named Tom Mikuta recruited him to go on the trip. Major wanted to cross the Brightside of Mercury at perihelion, except he wanted to cross the entire surface of the planet. Claney admits he was afraid because he knew the story of the last two explorers who never returned from their trip. He is also fully aware that the only place hotter than the Brightside of Mercury at perihelion is the actual surface of the sun. Claney believes that it can be done, and he agrees to join Major’s team of men. \n\nMajor and Claney meet up at The Twilight Lab, which is near the north pole of Mercury. Jack Stone, another member of the team, arrives with supplies and equipment. Claney is upset to learn that McIvers will also be joining the team. He thinks he is too much of a risk-taker. The men discuss Mercury’s atmosphere, and Claney realizes that there’s no way to prepare for a voyage this mysterious. There will be active volcanoes, but they have no idea where they will find them. McIvers finally shows up, and although he’s late, Major doesn’t make an issue of it.\n\nThe team leaves the lab with a plan to reach the Center of Brightside in 30 days. They need to travel 70 miles per day. McIvers wants to know who will be out four or five miles ahead of the pack to evaluate the surface. Major sternly tells him that isn’t part of the plan - all team members will stay in sight of one another.\n\nBack at Red Lion, Claney tells Baron that the heat was unbearable, even when their suits kept them cool at 70 degrees. The sight of the sun tricked their minds into believing they were melting. The team drives for eight hours and then stops and sleeps for five. Most of the time, the men are unable to get any rest. The only thing that propels them forward is the fact that no one had ever succeeded before.\nClaney crosses Mercury’s difficult terrain, which includes mounds of dust and impassable cracks. At one point, McIvers drives down a long canyon. Claney sees that McIvers is waving to get his attention, so he follows his lead. McIvers finds wrecked vehicles; this is the spot where the two explorers died. Claney begins to experience difficulties with his Bug. He comes to a six foot drop that his vehicle cannot pass over. He sees a narrow ledge that resembles a ramp. \n"
              }
            ]
          },
          {
            "question_text": "Who is McIvers, and what happens to him throughout the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "6",
                "uid": "d624859e69234bba96888a00c6e99637",
                "response_text": "From the get-go, Claney is clear in his obvious mistrust of McIvers and his preceding reputation. Late to Mercury, he arrives ready to explore. With long, gray hair and paradoxically drowsy yet alert eyes, McIvers’ constant movement and chatter get on his colleague’s nerves. McIvers is a famous climber known for pushing the boundaries and being a daredevil. \nAfter his arrival on Mercury, he and the crew soon set out for their treacherous journey to the Brightside Crossing. He switches spots with Stone, so he would have control of a Bug. He also asks to explore four or five miles ahead of the rest of the crew to see if it’s dangerous footing ahead. Mikuta quickly shuts him down. McIvers talks nonstop through the intercoms or when they’re supposed to be resting. As well, he disobeys Mikuta’s orders and occasionally drifts off from the rest of the group, discovering things as he goes. He never drifts far enough to receive any real punishment, though he does get farther away every time. \nDuring one of his side-explorations, he discovers a wrecked Bug and two corpses belonging to Wyatt and Carpenter, the previous explorers of the Brightside Crossing. With this shocking find, he returns to the crew in silence. "
              },
              {
                "worker_id": "10",
                "uid": "19835953f87c459d973eba846d7d84a0",
                "response_text": "McIvers had a reputation in the climbing world for being both skilled and lucky, and the Major sought him out for the Brightside Crossing he was leading because he thought his skills would be useful. They had never met prior to this trip together, though they had spoken about the intent of the trip and that there would be no fooling around. The Major lets it slide that McIver shows up late, however, he does not approve of McIver’s plan to go ahead of the rest of the party to scout the terrain. This turns out to potentially be one of the big mistakes that foils their attempted crossing.\n\nDuring their crossing, tensions between the crew and McIver become frazzled because they are tired of McIver’s talking and bad jokes. McIver irritates the crew by taking little side trips away from the rest of them as they try to make forward progress through the Brightside. During one of those trips, McIver makes a significant discovery of two skeletons of the last known explorers. It is not known whether he lives or dies at the close of the crossing attempt that Peter is recollecting.\n"
              },
              {
                "worker_id": "9",
                "uid": "dacfa9fae2214c70ac8b0bb8ec400e3f",
                "response_text": "McIvers is a climbing enthusiast who is known as something of a daredevil, and is described by Mikuta as possessing skill and luck. Claney describes him as tall, with long, wavy, prematurely graying hair and “climber’s” eyes that can look drowsy or suddenly very alert. He never stands still and is always speaking, moving, or doing something. He has been invited on the Brightside Crossing mission, unbeknownst to Peter Claney, by Major Mikuta. He casually shows up three days late, having missed the ship that Claney and Mikuta took and conned his way into a different route via Venus. On the eve of the mission, as plans are being doled out, he asserts that he thinks he and Jack Stone should switch roles and he should be given more leeway for movement. He asks if he can go several miles ahead of the rest to scout out the terrain, but Mikuta insists that they will all stay together. McIvers shows his hot temper during this exchange but ultimately agrees. He grows restless during the journey and annoys everyone with his constant talking and wandering. Because of his meandering, he is the first to encounter a chilling sight: the bodies of Wyatt and Carpenter, the first two explorers to attempt the Brightside Crossing. \n"
              },
              {
                "worker_id": "1",
                "uid": "f9b0380e4e004119bdf2e81a8f3b703a",
                "response_text": "McIvers is an excellent climber with long gray hair and sleepy eyes. He is fidgety and difficult to take seriously. \n\nMajor Tom Mikuta invites Ted McIvers to join the team on their mission to cross the Brightside of Mercury, and Peter Claney is immediately disappointed. McIvers has a reputation for being a daredevil, and Claney worries that he’s incapable of taking the danger of the mission seriously. Major argues that McIvers is both lucky and skillful, and the team will need plenty of luck and skill on this difficult trip. He also explains that McIvers knows that fooling around is unacceptable. When Claney tells James Baron the story of his trip, Baron agrees that taking McIvers was a huge mistake. Claney tells him that actually, the equipment and the route were more worrisome than McIvers. \n\nMcIvers arrives late to The Twilight Lab, but Major doesn’t chide him. He actually shows up on a freight rocket from Venus because he missed his original chance to get on the ship that Major and Claney took. Major, the leader of the pack, tells McIvers that he will be dragging the sledges, but McIvers tells his boss that he and Jack Stone have already decided to switch roles. He clearly has no issue with challenging authority, and he gets his way. However, McIvers also wants to know who will be miles ahead of the group scouting the terrain, and Major tells him that no one will take that role. Everyone is to remain in sight of one another. Later, Claney reveals that McIvers was right about this suggestion. It would have been incredibly helpful to have a scout out ahead so the team wasn’t driving blind. \n\nMcIvers’ constant talking really annoys Claney and perhaps the other team members as well. He tells the same stupid jokes over and over and repeatedly wishes he had a cold beer. He also begins to go further and further away from the rest of the group members. On one of these tangents, McIvers spots the bodies of Wyatt and Carpenter, two explorers who failed at their mission to cross The Brightside. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "6",
                "uid": "d624859e69234bba96888a00c6e99637",
                "response_text": "Brightside Crossing by Alan E. Nourse mostly takes place on the surface of Mercury.  The main characters begin in an observatory equipped to support human life as well as do research on the planet itself. However, they quickly move on in their journey to cross the Brightside at perihelion. Full of craters, gorges, and cracked land, the planet’s surface is incredibly dangerous to travel on. Sulfurous, hot winds blow across the planet. Beyond the towering, rocky spears and jagged gorges lay yellow valleys and flatlands. The gas beneath the surface of the planet can cause volcanic-like eruptions. This gas can also imply rise up from the core and poison the atmosphere around it. Gray dust caused by years of erosion rested atop every surface. \nMercury is an incredibly hot planet, being the nearest to the sun, and the surface reflects that. "
              },
              {
                "worker_id": "10",
                "uid": "19835953f87c459d973eba846d7d84a0",
                "response_text": "The only ‘real’ setting is a bar called Red Lion where Baron and Peter are sitting together. All other settings are imagined through Peter’s recalling of past events.\n\nPeter’s story includes settings from the Twilight Lab (an observatory on Mercury in the twilight zone between the bright and dark sides of the planet), in vehicles called Bugs on the surface of Mercury as his expedition party tries to cross the Brightside, and in various inhospitable locations on the surface of the bright side of the planet, including molten lead lakes and volcanoes.\n\nThe surface of the planet Mercury that faces the sun is referred to as the Brightside. Crossing it is extremely difficult due to the environmental conditions. It is described that the bright side of mercury is always facing towards the light as it rotates around the sun, never having darkness over it. It is an extremely hot place (770F), known to have active volcanoes, and an atmosphere that is mostly CO2, nitrogen and heavier gases. Humans must wear specialized suits to keep their body temperature at 75F while on the Brightside. A journey from the twilight zone (the transition between the bright and dark sides of the planet) to the Center of the Brightside would take about 30 days.\n"
              },
              {
                "worker_id": "9",
                "uid": "dacfa9fae2214c70ac8b0bb8ec400e3f",
                "response_text": "The initial setting is on Earth, in New York, outside of and then inside of a bar called the Red Lion. It is a quiet and sparsely populated lounge where some other adventurers (Andean climbers, the person who had mapped a previous voyage for Baron) are in attendance. Peter Claney’s story touches briefly on settings during his childhood (presumably somewhere on Earth), Mikuta’s time on Mars, his time with Mikuta on Venus, and New York again, but the primary setting is Mercury. The first area of Mercury they encounter is the Twilight Lab, located near Mercury’s north pole. This is the jumping off point for the mission, and includes a rocket landing, labs and quarters located deep in Mercury’s crust, and a tower with a solar scope. Mercury’s temperature is around -410 degrees F on the darkside and can reach 770 degrees on the brightside. The lab is located in a twilight zone between the two, which is about five miles wide at the pole and allows the area to be habitable. The brightside has ranges of craters, peaks, and faults; some ranges are inactive while others have volcanic activity and shifting below surface level. The atmosphere is as treacherous as the terrain, with Co2, nitrogen, traces of heavier gases, sulfur vapor, carbon disulfide, and sulfur dioxide flowing in constant atmospheric tides from the brightside to the darkside. The first thirty miles of the trek take them through fluffy volcanic ash and into virgin territory full of desolate gorges and intense heat. They see tall, jagged rocks, as well as the yellow, smoky plains below them. They venture closer and closer to the sun, and have to be increasingly cautious of the tenuous surface of Mercury. Based on Claney saying he was ten in 2082, the events Claney describes as well as his meeting with Baron likely occur in the 2100s (or later). \n"
              },
              {
                "worker_id": "1",
                "uid": "f9b0380e4e004119bdf2e81a8f3b703a",
                "response_text": "The story begins at Red Lion, a place with few patrons. A doorman is in charge of the comings and goings. Several climbers are conversing, including Andean climbers and the first man to cross the Vulcan Crater on Venus. \nClaney then dives into his story about his trip to cross the Brightside of Mercury. The men meet up for their trip at the Twilight Lab near the north pole of the planet. The lab has a rocket landing and a lab, and much of it is deep in the crust of the planet where it is cooler. There is also a tower that houses the Solar ‘scope. Sanderson, the lab’s manager, is a sun researcher, so his lab is located at the closest reasonable spot to the sun. Its position between the Brightside and the Darkside means that the temperatures only fluctuate about 50-60 degrees. \nMercury is situated on an axis, and the part that turns in faces the sun. This area, the perihelion, is the hottest place in the solar system besides the actual surface of the sun. Here, the temperatures soar to 770 degrees fahrenheit. The surface of Mercury is particularly treacherous. There are many active volcanoes, and the ground shifts frequently, creating cracks and craters that are difficult to see and impossible to cross. The gases present are also dangerous, including CO 2, nitrogen, sulfur vapor, and sulfur dioxide. There is liquid lead and boiling pools of sulfur. \nOn Mercury, the sun appears to be twice as big as it does on Earth. The planet only has 30% of the gravity that Earth does, and it is blanketed with gray ash. Huge cracks in the surface appear out of nowhere, and cliffs rise out of the land, and rocks and rubble and molten lead make driving treacherous. Everything is difficult to see because of the sulfur mist and the volcanic ash. Without filters and screens, humans would be instantly blinded by the light from the sun. \nThere is a deep gorge where the bodies of Wyatt and Carpenter, two famous explorers who attempted to cross The Brightside, lie. Their outdated Bugs crashed there, presumably because they misjudged the surface and did not see the crack in the lan\n"
              }
            ]
          },
          {
            "question_text": "What is the significance of the Brightside Crossing?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "6",
                "uid": "d624859e69234bba96888a00c6e99637",
                "response_text": "The Brightside Crossing is an undiscovered portion of Mercury. It is the closest planet to the sun, and the Brightside is the surface that is face-to-face with the surface of the sun most of the time, thanks to Mercury’s quick orbit. It is an incredibly dangerous area of Mercury, with temperatures reaching up to 770 degrees Fahrenheit, possibly more. Because of the difficult atmosphere, the presence of dangerous gases, treacherous landscape, and the heat, the Brightside Crossing remained undiscovered and uninhabitable for hundreds of years. \nMajor Tom Mikuta decided to follow in the footsteps of Wyatt and Carpenter and take on the challenge. The promise of power and discovery draws the main characters forward, as well as the idea of being the first. Mikuta claims that if he were to make the crossing, Mercury would be his. The challenge of the Brightside Crossing is the origin of their desire."
              },
              {
                "worker_id": "10",
                "uid": "19835953f87c459d973eba846d7d84a0",
                "response_text": "It is significant to the explorers because it has never been done before, so being the first would presumably make them very famous. On a greater scale, a successful crossing means conquering Mercury for humanity to the Major. He thinks that if he can successfully cross the bright side of Mercury at perihelion (when the planet is closest to the sun) then man has “got Mercury”. As in, if they have the technologies, knowledge, and skills to make the crossing at the hottest possible time there is nothing that isn’t possible for humans to do on the planet.\n"
              },
              {
                "worker_id": "9",
                "uid": "dacfa9fae2214c70ac8b0bb8ec400e3f",
                "response_text": "The Brightside Crossing is significant because no one has done it successfully, though it has been attempted before. It is also significant because the entire story is about the Brightside Crossing. Baron’s well-publicized upcoming mission to cross it is what brings Claney to speak with him (and try to talk him out of it), and the story Claney tells is about his own experience attempting to cross, as he is the only man on Earth to have survived an attempt (though he did sustain some physical damage). The Brightside gets its name from one of the most dangerous things about it: its proximity to the sun. \n"
              },
              {
                "worker_id": "1",
                "uid": "f9b0380e4e004119bdf2e81a8f3b703a",
                "response_text": "Many climbers and explorers wish to take on the Brightside Crossing, but it seems as though the trip is nearly impossible. Wyatt and Carpenter, two famous explorers, attempted to make the trip across the hottest planetary surface in the solar system in 2082, and they never returned from the trip. \n\nPeter Claney is the only living man who has attempted the trip and made it back alive. He was not successful in his mission to cross the perihelion, so it can be assumed that he turned back towards The Twilight Lab after his teammates perished. \n\nMaps of the terrain are shoddy at best since, and the surface is ever changing. Volcanoes erupt, cracks appear, cliffs crumble, and photography and technology is not yet good enough to create detailed pictures of the surface that would allow explorers to create a definitive and safe route. Since the men must travel at least 70 miles a day, there can be zero detours. It’s a constant game of scanning the terrain and making last minute decisions about which way is safest. \n\nPeter Claney and his teammates are motivated almost entirely by their desire to be the first people to conquer The Brightside Crossing. They believe that The Brightside would get them or they would get The Brightside. There is no other way, and their fame and success makes the dangerous trip worth a try. \n"
              }
            ]
          },
          {
            "question_text": "Who is Jack Stone, and what happens to him throughout the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "6",
                "uid": "d624859e69234bba96888a00c6e99637",
                "response_text": "Jack Stone arrives on the surface of Mercury around a week ahead of his partners. It’s revealed rather early on that Stone is not much of an explorer himself. His wits and genius make him an invaluable resource, but his heart wasn’t necessarily in the right place. Claney claims that Stone only came to follow Major Mikuta around, a man he deeply respected and admired. \nAt barely 25 years old, Stone was the youngest member of the team. His experience with Mikuta at the Vulcan qualified him for the trek, or so he thought, and so he tagged along. \nHis apprehension and anxiety about the trip are evident from the beginning. After Sanderson, the leader of an observatory on Mercury, explained how treacherous their journey was going to be, Stone almost cried. \nOnce they begin their trek, Stone retreats further into himself. Jack’s job was to drag the sledges behind the rest of the crew. Possibly fed up by McIvers’ constant joking or tortured by the fear that he would be lost on this planet forever, Stone became a shell of himself. \nIn the end, after McIvers discovered the corpses of the two discoverers that came before them, Wyatt and Carpenter, we can only assume that Stone’s fear and reservedness increased tremendously. "
              },
              {
                "worker_id": "10",
                "uid": "19835953f87c459d973eba846d7d84a0",
                "response_text": "Jack Stone is one of the explorers the Major recruits for his expedition. He is hardly twenty-five years old and crewed on the Major’s vulcan explorations. Peter’s assessment of Stone is that he follows the Major around like a puppy and begged to come on the Brightside Crossing. \n\nStone has the important role of bringing the supplies and equipment for their crossing. He receives some information about the inhospitable conditions of the Brightside from Sanders (owner of the Twilight Lab) that dejects him and makes him nervous about their trip. Stone has the important role of dragging the sleds of supplies during their crossing. He does not irritate the rest of the team, but instead grows more quiet and apprehensive with each day.\n\nThe reader doesn’t know whether he survived the attempted crossing or what he did afterwards.\n"
              },
              {
                "worker_id": "9",
                "uid": "dacfa9fae2214c70ac8b0bb8ec400e3f",
                "response_text": "Jack Stone is a young man of about twenty-five who is part of the Brightside Crossing team. He had worked with Major Makuta at Vulcan and pleaded with him to be part of the Brightside mission. Claney theorizes that he doesn’t care as much about exploring as he does Mikuta, who he sees as a kind of god and follows around. He arrives to Twilight Lab a few days before Claney and Mikuta to be briefed by Sanderson, and brings the supplies and equipment for the mission with him. By the time the other two arrive, Jack seems somewhat despondent based on what Sanderson has told him about the difficulties and improbability of the mission. Jack is assigned to flank Peter on the mission, along with Mikuta, but agrees to switch positions with McIvers and pull the sledges instead. This seems like something McIvers had pushed for in a previous conversation, but Jack says he doesn’t mind and Mikuta agrees to the switch. As the mission goes on, Claney notices that, unlike McIvers, Jack gets quieter and more reserved as he grows more apprehensive. \n"
              },
              {
                "worker_id": "1",
                "uid": "f9b0380e4e004119bdf2e81a8f3b703a",
                "response_text": "Jack Stone is the youngest member of The Brightside Crossing team. He is about 25 years old, and he looks to Major Tom Mikuta as a mentor. They worked together on Venus, and that’s where he discovered that Major would be making the trip across The Brightside. Stone begged Major to let him go along, even though it appears that he’s very nervous about the trip. When Sanderson, The Twilight Lab manager, tells Stone about what The Brightside is really like, Stone nearly cries from fear. He gets the equipment all ready and helps to prepare the team for the treacherous trip. \nStone has never met McIvers before, but the two become fast friends. McIvers is able to easily manipulate Stone into switching roles with him. He wants to be more mobile, so he tells Stone that he should drag the sledges instead. Stone acquiesces without a fight. \nThroughout the trip, Stone becomes quiet and stoic. He is a young guy and isn’t prepared to die on this trip. He responds to the difficult terrain and uncertainties with silence. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5270,
        "document_length_chars": 29873
      }
    }
  ]
}