{
  "item_metadata": {
    "item_id": "49838",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "49838",
      "content": "Jack of No Trades\n \n \n By EVELYN E. SMITH\n \n Illustrated by CAVAT\n \n [Transcriber's Note: This etext was produced from Galaxy October 1955. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n I was psick of Psi powers, not having any. Or didn't I? Maybe they'd psee otherwise psomeday!\n \n\n \n I walked into the dining room and collided with a floating mass of fabric, which promptly draped itself over me like a sentient shroud.\n \n \"Oh, for God's sake, Kevin!\" my middle brother's voice came muffled through the folds. \"If you can't help, at least don't hinder!\"\n \n I managed to struggle out of the tablecloth, even though it seemed to be trying to wrap itself around me. When Danny got excited, he lost his mental grip.\n \n \"I could help,\" I yelled as soon as I got my head free, \"if anybody would let me and, what's more, I could set the table a damn sight faster by hand than you do with 'kinesis.\"\n \n Just then Father appeared at the head of the table. He could as easily have walked downstairs as teleported, but I belonged to a family of exhibitionists. And Father tended to show off as if he were still a kid. Not that he looked his age—he was big and blond, like Danny and Tim and me, and could have passed for our older brother.\n \n \"Boys, boys!\" he reproved us. \"Danny, you ought to be ashamed of yourself—picking on poor Kev.\"\n \n Even if it hadn't been Danny's fault, he would still have been blamed.\n \n Nobody was ever supposed to raise a voice or a hand or a thought to poor afflicted Kev, because nature had picked on me enough. And the nicer everybody was to me, the nastier I became, since only when they lost their tempers could I get—or so I believed—their true attitude toward me.\n \n How else could I tell?\n \n \"Sorry, fella,\" Dan apologized to me. The tablecloth spread itself out on the table. \"Wrinkles,\" he grumbled to himself. \"Wrinkles. And I had it so nice and smooth before. Mother will be furious.\"\n \n \"If she were going to be furious, she'd be furious already,\" Father reminded him sadly. It must be tough to be married to a deep-probe telepath, I thought, and I felt a sudden wave of sympathy for him. It was so seldom I got the chance to feel sorry for anyone except myself.\n\"But I think you'll find she understands.\"\n \n \"She knows, all right,\" Danny remarked as he went on into the kitchen,\n\"but I'm not sure she always understands.\"\n \n I was surprised to find him so perceptive on the abstract level, because he wasn't what you might call an understanding person, either.\n \n \n\n \n \"There are tensions in this room,\" my sister announced as she slouched in, not quite awake yet, \"and hatred. I could feel them all the way upstairs. And today I'm working on the Sleepsweet Mattress copy, so I must feel absolutely tranquil. Everyone will think beautiful thoughts, please.\"\n \n She sat down just as a glass of orange juice was arriving at her place; Danny apparently didn't know she'd come in already. The glass bumped into the back of her neck, tilted and poured its contents over her shoulder and down her very considerable decolletage. Being a mere primitive, I couldn't help laughing.\n \n \"Danny, you fumbler!\" she screamed.\n \n Danny erupted from the kitchen. \"How many times have I asked all of you not to sit down until I've got everything on the table? Always a lot of interfering busybodies getting in the way.\"\n \n \"I don't see why you have to set the table at all,\" she retorted. \"A robot could do it better and faster than you. Even Kev could.\" She turned quickly toward me. \"Oh, I am sorry, Kevin.\"\n \n I didn't say anything; I was too busy pressing my hands down on the back of the chair to make my knuckles turn white.\n \n Sylvia's face turned even whiter. \"Father, stop him— stop him! He's hating again! I can't stand it!\"\n \n Father looked at me, then at her. \"I don't think he can help it, Sylvia.\"\n \n I grinned. \"That's right—I'm just a poor atavism with no control over myself a-tall.\"\n \n Finally my mother came in from the kitchen; she was an old-fashioned woman and didn't hold with robocooks. One quick glance at me gave her the complete details, even though I quickly protested, \"It's illegal to probe anyone without permission.\"\n \n \"I used to probe you to find out when you needed your diapers changed,\" she said tartly, \"and I'll probe you now. You should watch yourself, Sylvia—poor Kevin isn't responsible.\"\n \n She didn't need to probe to get the blast of naked emotion that spurted out from me. My sister screamed and even Father looked uncomfortable. Danny stomped back into the kitchen, muttering to himself.\n \n Mother's lips tightened. \"Sylvia, go upstairs and change your dress. Kevin, do I have to make an appointment for you at the clinic again?\" A psychiatrist never diagnosed members of his own family—that is, not officially; they couldn't help offering thumbnail diagnoses any more than they could help having thumbnails.\n \n \"No use,\" I said, deciding it was safe to drop into my chair. \"Who can adjust me to an environment to which I'm fundamentally unsuited?\"\n \n \"Maybe there is something physically wrong with him, Amy,\" my father suggested hopefully. \"Maybe you should make an appointment for him at the cure-all?\"\n \n Mother shook her neatly coiffed head. \"He's been to it dozens of times and he always checks out in splendid shape. None of us can spare the time to go with him again, just on an off-chance, and he could hardly be allowed to make such a long trip all by himself. Pity there isn't a machine in every community, but, then, we don't really need them.\"\n \n \n\n \n Now that the virus diseases had been licked, people hardly ever got sick any more and, when they did, it was mostly psychosomatic. Life was so well organized that there weren't even many accidents these days. It was a safe, orderly existence for those who fitted into it—which accounted for more than ninety-five per cent of the population. The only ones who didn't adjust were those who couldn't, like me—psi-deficients, throwbacks to an earlier era. There were no physical cripples, because anybody could have a new arm or a new leg grafted on, but you couldn't graft psi powers onto an atavism or, if you could, the technique hadn't been developed yet.\n \n \"I feel a sense of impending doom brooding over this household,\" my youngest brother remarked cheerfully as he vaulted into his chair.\n \n \"You always do, Timothy,\" my mother said, unfolding her napkin. \"And I must say it's not in good taste, especially at breakfast.\"\n \n He reached for his juice. \"Guess this is a doomed household. And what was all that emotional uproar about?\"\n \n \"The usual,\" Sylvia said from the doorway before anyone else could answer. She slid warily into her chair. \"Hey, Dan, I'm here!\" she called. \"If anything else comes in, it comes in manually, understand?\"\n \n \"Oh, all right.\" Dan emerged from the kitchen with a tray of food floating ahead of him.\n \n \"The usual? Trouble with Kev?\" Tim looked at me narrowly. \"Somehow my sense of ominousness is connected with him.\"\n \n \"Well, that's perfectly natural—\" Sylvia began, then stopped as Mother caught her eye.\n \n \"I didn't mean that,\" Tim said. \"I still say Kev's got something we can't figure out.\"\n \n \"You've been saying that for years,\" Danny protested, \"and he's been tested for every faculty under the Sun. He can't telepath or teleport or telekinesthesize or even teletype. He can't precognize or prefix or prepossess. He can't—\"\n \n \"Strictly a bundle of no-talent, that's me,\" I interrupted, trying to keep my animal feelings from getting the better of me. That was how my family thought of me, I knew—as an animal, and not a very lovable one, either.\n \n \"No,\" Tim said, \"he's just got something we haven't developed a test for. It'll come out some day, you'll see.\" He smiled at me.\n \n \n\n \n I smiled at him gratefully; he was the only member of my family who really seemed to like me in spite of my handicap. \"It won't work, Tim. I know you're trying to be kind, but—\"\n \n \"He's not saying it just to be kind,\" my mother put in. \"He means it. Not that I want to arouse false hopes, Kevin,\" she added with grim scrupulousness. \"Tim's awfully young yet and I wouldn't trust his extracurricular prognostications too far.\"\n \n Nonetheless, I couldn't help feeling a feeble renewal of old hopes. After all, young or not, Tim was a hell of a good prognosticator; he wouldn't have risen so rapidly to the position he held in the Weather Bureau if he hadn't been pretty near tops in foreboding.\n \n Mother smiled sadly at my thoughts, but I didn't let that discourage me. As Danny had said, she knew but she didn't really understand . Nobody, for all of his or her psi power, really understood me.\n \n \n\n \n Breakfast was finally over and the rest of my family dispersed to their various jobs. Father simply took his briefcase and disappeared—he was a traveling salesman and he had a morning appointment clear across the continent. The others, not having his particular gift, had to take the helibus to their different destinations. Mother, as I said, was a psychiatrist. Sylvia wrote advertising copy. Tim was a meteorologist. Dan was a junior executive in a furniture moving company and expected a promotion to senior rank as soon as he achieved a better mental grip on pianos.\n \n Only I had no job, no profession, no place in life. Of course there were certain menial tasks a psi-negative could perform, but my parents would have none of them—partly for my sake, but mostly for the sake of their own community standing.\n \n \"We don't need what little money Kev could bring in,\" my father always said. \"I can afford to support my family. He can stay home and take care of the house.\"\n \n And that's what I did. Not that there was much to do except call a techno whenever one of the servomechanisms missed a beat. True enough, those things had to be watched mighty carefully because, if they broke down, it sometimes took days before the repair and/or replacement robots could come. There never were enough of them because ours was a constructive society. Still, being a machine-sitter isn't very much of a career. And every function that wasn't the prerogative of a machine could be done ten times more quickly and efficiently by some member of my family than I could do it. If I went ahead and did something anyway, they would just do it all over again when they got home.\n \n So I had nothing to do all day. I had a special dispensation to take books out of the local Archives, because I was a deficient and couldn't receive the tellie programs. Almost everybody on Earth was telepathic to some degree and could get the amplified projections even if he couldn't transmit or receive with his natural powers. But I got nothing. I had to derive all my recreation from reading, and you can get awfully tired of books, especially when they're all at least a hundred years old and written by primitives. I could borrow sound tapes, but they also bored me after a while.\n \n I thought maybe I could develop a talent for composing or painting, which would classify me as a telesensitive—artistic ability being considered as the oldest, if least important, psi power—but I couldn't even do anything like that.\n \n About all there was left for me was to take long walks. Athletics were out of the question; I couldn't compete with psi-boys and they didn't want to compete with me. All the people in the neighborhood knew me and were nice to me, but I didn't need to be a 'path to tell what they were saying to one another when I hove into sight. \"There's that oldest Faraday boy. Pity, such a talented family, to have a defective.\"\n \n \n\n \n I didn't have a girl, either. Although some of them were sort of attracted to me—I could see that—they could hardly go out with me without exposing themselves to ridicule. In their sandals, I would have done the same thing, but that didn't stop me from hating them.\n \n \n\n \n I wished I had been born a couple of hundred years ago—before people started playing around with nuclear energy and filling the air with radiations that they were afraid would turn human beings into hideous monsters. Instead, they developed the psi powers that had always been latent in the species until we developed into a race of supermen. I don't know why I say we —in 1960 or so, I might have been considered superior, but in 2102 I was just the Faradays' idiot boy.\n \n Exploring space should have been my hope. If there had been anything useful or interesting on any of the other planets, I might have found a niche for myself there. In totally new surroundings, the psi powers geared to another environment might not be an advantage. But by the time I was ten, it was discovered that the other planets were just barren hunks of rock, with pressures and climates and atmospheres drastically unsuited to human life. A year or so before, the hyperdrive had been developed on Earth and ships had been sent out to explore the stars, but I had no hope left in that direction any more.\n \n I was an atavism in a world of peace and plenty. Peace, because people couldn't indulge in war or even crime with so many telepaths running around—not because, I told myself, the capacity for primitive behavior wasn't just as latent in everybody else as the psi talent seemed latent in me. Tim must be right, I thought—I must have some undreamed-of power that only the right circumstances would bring out. But what was that power?\n \n For years I had speculated on what my potential talent might be, explored every wild possibility I could conceive of and found none productive of even an ambiguous result with which I could fool myself. As I approached adulthood, I began to concede that I was probably nothing more than what I seemed to be—a simple psi-negative. Yet, from time to time, hope surged up again, as it had today, in spite of my knowledge that my hope was an impossibility. Who ever heard of latent psi powers showing themselves in an individual as old as twenty-six?\n \n I was almost alone in the parks where I used to walk, because people liked to commune with one another those days rather than with nature. Even gardening had very little popularity. But I found myself most at home in those woodland—or, rather, pseudo-woodland—surroundings, able to identify more readily with the trees and flowers than I could with my own kind. A fallen tree or a broken blossom would excite more sympathy from me than the minor catastrophes that will beset any household, no matter how gifted, and I would shy away from bloody noses or cut fingers, thus giving myself a reputation for callousness as well as extrasensory imbecility.\n \n However, I was no more callous in steering clear of human breakdowns than I was in not shedding tears over the household machines when they broke down, for I felt no more closely akin to my parents and siblings than I did to the mechanisms that served and, sometimes, failed us.\n \n \n\n \n On that day, I walked farther than I had intended and, by the time I got back home, I found the rest of my family had returned before me. They seemed to be excited about something and were surprised to see me so calm.\n \n \"Aren't you even interested in anything outside your own immediate concerns, Kev?\" Sylvia demanded, despite Father's efforts to shush her.\n \n \"Can't you remember that Kev isn't able to receive the tellies?\" Tim shot back at her. \"He probably doesn't even know what's happened.\"\n \n \"Well, what did happen?\" I asked, trying not to snap.\n \n \"One starship got back from Alpha Centauri,\" Danny said excitedly.\n\"There are two inhabited Earth-type planets there!\"\n \n This was for me; this was it at last! I tried not to show my enthusiasm, though I knew that was futile. My relatives could keep their thoughts and emotions from me; I couldn't keep mine from them.\n\"What kind of life inhabits them? Humanoid?\"\n \n \"Uh-uh.\" Danny shook his head. \"And hostile. The crew of the starship says they were attacked immediately on landing. When they turned and left, they were followed here by one of the alien ships. Must be a pretty advanced race to have spaceships. Anyhow, the extraterrestrial ship headed back as soon as it got a fix on where ours was going.\"\n \n \"But if they're hostile,\" I said thoughtfully, \"it might mean war.\"\n \n \"Of course. That's why everybody's so wrought up. We hope it's peace, but we'll have to prepare for war just in case.\"\n \n There hadn't been a war on Earth for well over a hundred years, but we hadn't been so foolish as to obliterate all knowledge of military techniques and weapons. The alien ship wouldn't be able to come back with reinforcements—if such were its intention—in less than six months. This meant time to get together a stockpile of weapons, though we had no idea of how effective our defenses would be against the aliens' armament.\n \n They might have strange and terrible weapons against which we would be powerless. On the other hand, our side would have the benefits of telekinetically guided missiles, teleported saboteurs, telepaths to pick up the alien strategy, and prognosticators to determine the outcome of each battle and see whether it was worth fighting in the first place.\n \n Everybody on Earth hoped for peace. Everybody, that is, except me. I had been unable to achieve any sense of identity with the world in which I lived, and it was almost worth the loss of personal survival to know that my own smug species could look silly against a still more talented race.\n \n \n\n \n \"It isn't so much our defense that worries me,\" my mother muttered, \"as lack of adequate medical machinery. War is bound to mean casualties and there aren't enough cure-alls on the planet to take care of them. It's useless to expect the government to build more right now; they'll be too busy producing weapons. Sylvia, you'd better take a leave of absence from your job and come down to Psycho Center to learn first-aid techniques. And you too, Kevin,\" she added, obviously a little surprised herself at what she was saying. \"Probably you'd be even better at it than Sylvia since you aren't sensitive to other people's pain.\"\n \n I looked at her.\n \n \"It is an ill wind,\" she agreed, smiling wryly, \"but don't let me catch you thinking that way, Kevin. Can't you see it would be better that there should be no war and you should remain useless?\"\n \n I couldn't see it, of course, and she knew that, with her wretched talent for stripping away my feeble attempts at privacy. Psi-powers usually included some ability to form a mental shield; being without one, I was necessarily devoid of the other.\n \n My attitude didn't matter, though, because it was definitely war. The aliens came back with a fleet clearly bent on our annihilation—even the 'paths couldn't figure out their motives, for the thought pattern was entirely different from ours—and the war was on.\n \n I had enjoyed learning first-aid; it was the first time I had ever worked with people as an equal. And I was good at it because psi-powers aren't much of an advantage there. Telekinesis maybe a little, but I was big enough to lift anybody without needing any superhuman abilities—normal human abilities, rather.\n \n \"Gee, Mr. Faraday,\" one of the other students breathed, \"you're so strong. And without 'kinesis or anything.\"\n \n I looked at her and liked what I saw. She was blonde and pretty. \"My name's not Mr. Faraday,\" I said. \"It's Kevin.\"\n \n \"My name's Lucy,\" she giggled.\n \n No girl had ever giggled at me in that way before. Immediately I started to envision a beautiful future for the two of us, then flushed when I realized that she might be a telepath. But she was winding a tourniquet around the arm of another member of the class with apparent unconcern.\n \n \"Hey, quit that!\" the windee yelled. \"You're making it too tight! I'll be mortified!\"\n \n So Lucy was obviously not a telepath. Later I found out she was only a low-grade telesensitive—just a poetess—so I had nothing to worry about as far as having my thoughts read went. I was a little afraid of Sylvia's kidding me about my first romance, but, as it happened, she got interested in one of the guys who was taking the class with us, and she was not only too busy to be bothered with me, but in too vulnerable a position herself.\n \n However, when the actual bombs—or their alien equivalent—struck near our town, I wasn't nearly so happy, especially after they started carrying the wounded into the Psycho Center, which had been turned into a hospital for the duration. I took one look at the gory scene—I had never seen anybody really injured before; few people had, as a matter of fact—and started for the door. But Mother was already blocking the way. It was easy to see from which side of the family Tim had got his talent for prognostication.\n \n \"If the telepaths who can pick up all the pain can stand this, Kevin,\" she said, \" you certainly can.\" And there was no kindness at all in the you .\n \n She gave me a shove toward the nearest stretcher. \"Go on—now's your chance to show you're of some use in this world.\"\n \n \n\n \n Gritting my teeth, I turned to the man on the stretcher. Something had pretty near torn half his face away. It was all there, but not in the right place, and it wasn't pretty. I turned away, caught my mother's eye, and then I didn't even dare to throw up. I looked at that smashed face again and all the first-aid lessons I'd had flew out of my head as if some super-psi had plucked them from me.\n \n The man was bleeding terribly. I had never seen blood pouring out like that before. The first thing to do, I figured sickly, was mop it up. I wet a sponge and dabbed gingerly at the face, but my hands were shaking so hard that the sponge slipped and my fingers were on the raw gaping wound. I could feel the warm viscosity of the blood and nothing, not even my mother, could keep my meal down this time, I thought.\n \n Mother had uttered a sound of exasperation as I dropped the sponge. I could hear her coming toward me. Then I heard her gasp. I looked at my patient and my mouth dropped open. For suddenly there was no wound, no wound at all—just a little blood and the fellow's face was whole again. Not even a scar.\n \n \"Wha—wha happened?\" he asked. \"It doesn't hurt any more!\"\n \n He touched his cheek and looked up at me with frightened eyes. And I was frightened, too—too frightened to be sick, too frightened to do anything but stare witlessly at him.\n \n \"Touch some of the others, quick!\" my mother commanded, pushing astounded attendants away from stretchers.\n \n I touched broken limbs and torn bodies and shattered heads, and they were whole again right away. Everybody in the room was looking at me in the way I had always dreamed of being looked at. Lucy was opening and shutting her beautiful mouth like a beautiful fish. In fact, the whole thing was just like a dream, except that I was awake. I couldn't have imagined all those horrors.\n \n But the horrors soon weren't horrors any more. I began to find them almost pleasing; the worse a wound was, the more I appreciated it. There was so much more satisfaction, virtually an esthetic thrill, in seeing a horrible jagged tear smooth away, heal, not in days, as it would have done under the cure-all, but in seconds.\n \n \"Timothy was right,\" my mother said, her eyes filled with tears, \"and I was wrong ever to have doubted. You have a gift, son—\" and she said the word son loud and clear so that everybody could hear it—\"the greatest gift of all, that of healing.\" She looked at me proudly. And Lucy and the others looked at me as if I were a god or something.\n \n I felt ... well, good.\n \n \n\n \n \"I wonder why we never thought of healing as a potential psi-power,\" my mother said to me later, when I was catching a snatch of rest and she was lighting cigarettes and offering me cups of coffee in an attempt to make up twenty-six years of indifference, perhaps dislike, all at once.\n\"The ability to heal is recorded in history, only we never paid much attention to it.\"\n \n \"Recorded?\" I asked, a little jealously.\n \n \"Of course,\" she smiled. \"Remember the King's Evil?\"\n \n I should have known without her reminding me, after all the old books I had read. \"Scrofula, wasn't it? They called it that because the touch of certain kings was supposed to cure it ... and other diseases, too, I guess.\"\n \n She nodded. \"Certain people must have had the healing power and that's probably why they originally got to be the rulers.\"\n \n In a very short time, I became a pretty important person. All the other deficients in the world were tested for the healing power and all of them turned out negative. I proved to be the only human healer alive, and not only that, I could work a thousand times more efficiently and effectively than any of the machines. The government built a hospital just for my work! Wounded people were ferried there from all over the world and I cured them. I could do practically everything except raise the dead and sometimes I wondered whether, with a little practice, I wouldn't be able to do even that.\n \n When I came to my new office, whom did I find waiting there for me but Lucy, her trim figure enhanced by a snug blue and white uniform. \"I'm your assistant, Kev,\" she said shyly.\n \n I looked at her. \"You are?\"\n \n \"I—I hope you want me,\" she went on, coyness now mixing with apprehension.\n \n I gave her shoulder a squeeze. \"I do want you, Lucy. More than I can tell you now. After all this is over, there's something more I want to say. But right now—\" I clapped her arm—\"there's a job to be done.\"\n \n \"Yes, Kevin,\" she said, glaring at me for some reason I didn't have time to investigate or interpret at the moment. My patients were waiting for me.\n \n They gave me everything else I could possibly need, except enough sleep, and I myself didn't want that. I wanted to heal. I wanted to show my fellow human beings that, though I couldn't receive or transmit thoughts or foretell the future or move things with my mind, all those powers were useless without life, and that was what I could give.\n \n I took pride in my work. It was good to stop pain and ugliness, to know that, if it weren't for me, these people would be dead or permanently disfigured. In a sense, they were—well, my children; I felt a warm glow of affection toward them.\n \n They felt the same way toward me. I knew because the secret of the hospital soon leaked out—during all those years of peace, the government had lost whatever facility it had for keeping secrets—and people used to come in droves, hoping for a glimpse of me.\n \n \n\n \n The government pointed out that such crowds outside the building might attract the enemy's attention. I was the most important individual on Earth, they told my followers, and my safety couldn't be risked. The human race at this stage was pretty docile. The crowds went away. And it was right that they should; I didn't want to be risked any more than they wanted to risk me.\n \n Plenty of people did come to see me officially—the President, generals, all kinds of big wheels, bringing citations, medals and other obsolete honors they'd revived primarily for me. It was wonderful. I began to love everybody.\n \n \"Don't you think you're putting too much of yourself into this, Kev?\" Lucy asked me one day.\n \n I gave her an incredulous glance. \"You mean I shouldn't help people?\"\n \n \"Of course you should help them. I didn't mean anything like that. Just ... well, you're getting too bound up in your work.\"\n \n \"Why shouldn't I be?\" Then the truth, as I thought, dawned on me. \"Are you jealous, Lucy?\"\n \n She lowered her eyes. \"Not only that, but the war's bound to come to an end, you know, and—\"\n \n It was the first part of her sentence that interested me. \"Why, do you mean—\"\n \n And just then a fresh batch of casualties arrived and I had to tend to them. For the next few days, I was so busy, I didn't get the chance to have the long talk with Lucy I'd wanted....\n \n Then, after only four months, the war suddenly stopped. It seemed that the aliens' weapons, despite their undeniable mysteriousness, were not equal to ours. And they had the added disadvantage of being light-years away from home base. So the remnant of their fleet took off and blew itself up just outside of Mars, which we understood to be the equivalent of unconditional surrender. And it was; we never heard from the Centaurians again.\n \n Peace once more. I had a little mopping up to do at the hospital; then I collected my possessions and went back home after a dignitary—only the Vice President this time—had thanked me on behalf of a grateful country. I wasn't needed any more.",
      "metadata": {
        "title": "Jack of No Trades",
        "author": "Evelyn E. Smith",
        "passage_id": "49838",
        "uid": "a249a51b60a14e40a9eb2de5556d0876",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "3",
                "uid": "8efdd8fb0f384e628d2206a966849888",
                "response_text": "This story takes place in the year 2102 and centers around a family with powers, including telekenisis and teleportation. The narrator is Kevin, one of the sons: he is the only person in the family without powers, a \"psi-deficient\", so he stays at home to take care of the house. The story starts at the breakfast table, where the father teleports in, the mother probes the others' thoughts, and there is grumbling about the goings-on in the household. Timothy, the youngest brother, senses turmoil in the family but is also the most hopeful--he figures that Kevin has a gift they just haven't discovered yet, which is encouraging to Kevin. After everyone else in the family leaves for their jobs, Kevin is left to think about his situation, so he goes for a long walk. Reading is his only other real source of entertainment; he doesn't have many friends because nobody wanted to play sports with someone without telepathic abilities. He couldn't explore space because other planets weren't habitable, so he wondered what would make him stand out. The reader learns that the psi powers were latent in humans and developed with exposure to nuclear energy. When he gets home from his walk, Kevin's entire family is there, processing some news. There are two inhabited planets in Alpha Centauri, and the aliens there might be preparing for war.  Kevin partly hoped there would be war for a change of pace, and his mom figured people should start learning first-aid, including Kevin. He had a benefit over his sister because he couldn't sense others' pain in the same way. He met a girl named Lucy in his first-aid class who he liked, and she was a \"low-grade telesensitive\" so he didn't have to worry about his thoughts being read. Once the aliens attacked, things got hard as Kevin had to face the injured people bought to his care. This was especially shocking because injury was not common in his world. This was where Kevin finally found his power: touching the injured people healed them almost instantly. It turned out he was the only human with this power, which was invaluable -- a hospital was even built just for Kevin to work in, where Lucy became his assistant. All at once, he became the most important human on the planet, but the humans had to hide this from their alien adversaries. Lucy was jealous of Kevin but also worried about what would happen to Kevin when the war ended, which it eventually did four months later. The story ends with Kevin returning home after the Vice President informed him that his services were no longer needed. "
              },
              {
                "worker_id": "8",
                "uid": "9a75f34a6fb94dd5b08ecdbb0850771b",
                "response_text": "Kevin Faraday is psi-deficient in a family of five with special psi powers living in a world largely free of disease and conflict. His father is telepathic and uses this ability to help him get to long-distance appointments as a traveling salesman. His middle brother, Danny, has the power of telekinesis and works as a junior partner in a moving company. Kevin's sister, Sylvia, can sense emotions in people, so she is able to tell when he purposefully intensifies his anger to make her feel uncomfortable. The youngest of the family is Timothy, who works as a weather forecaster thanks to his powerful gift of prognostication. Kevin's mother is a psychiatrist with telepathic powers that she uses to read his mind. In fact, most people in the world have some kind of telepathic powers--they can read the minds of others unprotected by mind shields. While the rest of the family treats him awkwardly and goes off to their respective jobs every day, Kevin stays at home to maintain the house. However, even this task makes him feel largely useless because most of the chores can be completed by household machines. Therefore, Kevin spends much of his time daydreaming about what life would have been like for him had he been living in 1960 instead of 2102. He feels a stronger empathy for dying plants than he does for other humans, and this has given him the reputation of callousness. Although Kevin is largely resigned to his fate as a psi-deficient in a world of people with special powers, his brother Tim insists that he has some ability; it simply hasn't been discovered yet. The rest of the family shrugs off this notion, but Kevin secretly latches onto this hope. Because of his inability to tap into the telepathically-broadcast news transmissions, Kevin's family one day alerts him that a starship has returned to Earth from Alpha Centauri, where its crew had discovered two Earth-type planets. This excites Kevin, but unfortunately, the inhabitants of these planets are hostile, and they eventually make their way to Earth to begin a war. In preparation for the war, Kevin's mother encourages him and Sylvia to learn first-aid techniques at the Psycho Center in order to be ready to help the injured. During his training, Kevin meets a girl named Lucy, who flirts with him and admires his strength. When Kevin gets his first patient, he is shocked to discover that he is able to heal the injured man with a simple touch of his hands. Having discovered his new ability, Kevin sets out to heal as many of the wounded as possible; later, he learns that he is the only psi-negative in the world with this ability. Eventually, he is given his own hospital and hailed as a hero by various dignitaries including the President. When the war ends and the aliens surrender, however, Earth is no longer in need of his services, and he is out of a job again.\n"
              },
              {
                "worker_id": "10",
                "uid": "9bf235108e5840c39e92a79ac069f318",
                "response_text": "In the year 2102, the Faraday family are setting the table and gathering for a meal together in their home. Humans have supernatural powers (psi-powers) that began to show after nuclear energy was developed in the 1960s, and most of the family have special abilities. Father can teleport, Mother (Amy) is a telepathic psychiatrist, Dan (Danny) can move objects via telekinesis, Sylvia is telesensitive, and Tim can predict the future. Kevin (Kev) has no apparent powers, and feels disconnected and isolated from most of his family because without powers he is of little use to society. The exception is his brother Tim, who suggests that there just isn’t a test yet for the powers that Kev has. His father asks if they should send him to a psychiatrist again, and his mother expresses disappointment at the amount of tests that have been run on Kev with no sign of psi-powers. \nKev is crestfallen that he doesn’t really have any life other than going on long walks and watching the house. He is sad he never had the chance to try exploring space, but by the time he was ten years old humans had already concluded that all the other planets were unsuited to human life. \nThere are television-like telepathic projections in the society called “tellies” that those with psi-powers receive. One day, a tellie reports that space explorers from Earth have found two inhabited Earth-type planets in Alpha Centauri. The aliens chased off the humans in their own spaceships and now it is possible that aliens could attack Earth in less than six months. Kev’s mother decides there will be a lot more people in need of medical training to treat casualties if there is an attack, and recruits Sylvia and Kev to train at the Psycho Center. During training, Kev meets a girl named Lucie who is a poet and they develop a fond relationship with each other. When alien weapons begin striking near their town, the casualties start rolling into the Psycho Center and Kev tries to run away at the first sight of the violent wounds. His mother forces him to stay and work. He is so shaky he can’t hold a sponge to clean the blood off a person that is missing half of their face and drops it, accidentally pushing his fingers into the bloody wound. Touching the wound this way cures it completely. Kev quickly grows into a famous sensation who is able to heal any wounds. He is the only person on Earth with this psi-ability, and there is a special clinic built just for him. Lucie becomes his assistant. Presidents and generals visit him and present him with medals and honors. After four months, the war ends and peace returns to Earth. The Vice President thanks Kev on behalf of the country.\n"
              },
              {
                "worker_id": "6",
                "uid": "bf50efb26de24b25933a6d8c1fd98705",
                "response_text": "Kevin is the only member of the Faraday family without psi-powers. His two brothers, sister, mother, and father are all extremely powerful individuals, but he, at the ripe age of 26 years old, had nothing. Because of this, he was considered an outcast and was forced to work in their home instead of in the outside world. People pitied him and looked down on him, which drove him crazy. The story begins at the breakfast table with Danny using his powers to levitate food in and out of the kitchen. Chaos ensues as the orange juice crashes into his sister, Sylvia, who senses Kevin’s displeasure at his brazen use of psi-power. Their father soon appears out of thin air with his briefcase, while his mother strolls down and instantly reads Kevin’s mind, only making him madder. The situation escalates until Tim, the youngest, strolls in and claims that Kevin’s powers have yet to present themselves, which gives Kevin hope. His family leaves for work, and Kevin is left at home alone again. \nKevin watches the servomechanisms as they clean and manage the house. Of course, sometimes they break down and he is needed, but largely he has nothing to do and is bored. In the year 2102, Kevin Faraday was considered useless. He takes a long walk that day, and when he returns home, his family is buzzing with the news. A spaceship returned from Alpha Centauri claiming they ran into inhabitable planets filled with humanoid aliens. One of the aliens followed them back to Earth, then turned around and headed home. They were hostile creatures and attacked them on sight. Earth had six months to prepare for the potential of war, so Kevin and his siblings learned first-aid techniques at the Psycho Center. There, Kevin meets Lucy, a cute blonde poetess who expresses interest in him. \nWhen the first bomb strikes, Kevin is faced with his first injured patient. His face had been blown up in the explosion, and Kevin can’t handle the sight, so he tries to run away. He is stopped by his mother, however, who scolds him and sends him back to his patient. As he is mopping his face with a sponge, his hand slips and he accidentally touches his patient skin-to-skin. Miraculously, his injuries are cured, and Kevin’s powers are finally discovered. He is a healer. \nHe heals the rest of the injured with just a touch and soon becomes the most important man in the world. He gets his own special hospital, where Lucy is his assistant, and visits from Presidents, cabinet members, and other people of power. He heals everyone who is injured in the war and loves the new attention. He is the only healer, and those who had his abilities in the past were kings. \nHowever, four months later, the war ends and the Centaurions blow themselves up in surrender. The story ends with a question: will Kevin still be as needed in a post-war society? \n"
              }
            ]
          },
          {
            "question_text": "Describe Tim's role in the family.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "3",
                "uid": "8efdd8fb0f384e628d2206a966849888",
                "response_text": "Tim is Kevin's youngest brother, and works as a meteorologist for the Weather Bureau. His ability is that of prognostication, meaning he is able to predict certain things about the future. This includes positive and negative things. For instance, at the beginning of the story, he feels a sense of impending doom. At the same time, he is the only one who has a positive outlook on Kevin's situation: he suspects that Kevin has a power that hasn't been discovered or isn't well-understood yet, but the rest of the family (including Kevin himself) figure that he doesn't have any special abilities at all. This is particularly contrasted with Kevin's mother, who doesn't ever speak highly of Kevin. Tim's encouragement gives Kevin hope for his own future regularly, and it helps him to know that someone is nice to him and doesn't think he is useless. "
              },
              {
                "worker_id": "8",
                "uid": "9a75f34a6fb94dd5b08ecdbb0850771b",
                "response_text": "Tim is the youngest brother in the family, and he has the unique gift of prognostication. Because of his ability to see into the future, Tim has gainful employment with the Weather Bureau. Compared to the rest of the family, Tim treats Kevin kindly and tells him that he believes he does have some special power; society simply hasn't developed a test to identify it yet. At breakfast, Tim also feels a sense of ominousness surrounding Kevin, which foreshadows the alien war that happens after the discovery of the Earth-like planets around Alpha Centauri and Kevin's important role in it. Because of his training in first-aid, Kevin works to help those injured in the war, and in the process, he discovers his ability to physically heal people with a simple touch of his hands. Tim's prediction that Kevin would discover his innate power gave Kevin hope and also came true."
              },
              {
                "worker_id": "10",
                "uid": "9bf235108e5840c39e92a79ac069f318",
                "response_text": "Tim has the supernatural power of prognostication, and quickly rose to a high position as a meteorologist at the Weather Bureau. He has the same looks as the other men of the Faraday family - big and blond. \nTim defends Kev in the family when the rest of the siblings are picking on him about not having any supernatural powers (“psi-powers”). Tim says Kev must have a power they haven’t learned to test for yet, giving Kev a little boost of hope. Tim has a nagging sense that Kev has an ability they haven’t discovered yet and senses an ominousness in his future. Because of Tim’s supernatural ability to forecast the future, he foreshadows the discovery of Kev’s ability to heal.\n"
              },
              {
                "worker_id": "6",
                "uid": "bf50efb26de24b25933a6d8c1fd98705",
                "response_text": "Tim is the youngest of the Faraday family, but his power and talent are still remarkable, perhaps even more so due to his age. Like his brothers and his father, Tim is blonde and large and looked older than his siblings. Tim is a prognosticator, meaning he is able to sense things in the future. He works at the Weather Bureau and quickly rose to the top thanks to his supernatural ability. \nTim is the peacekeeper in the family. His foreboding senses told him long ago that Kevin has psi-powers, they just hadn’t been discovered that. Tim’s predictions give Kevin hope and keep him from going crazy. As well, he seems like the least dramatic of all the siblings and knows how to de-escalate any situation. \n"
              }
            ]
          },
          {
            "question_text": "Describe the circumstances that led to Kevin's power not being discovered until he was twenty-six years old.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "3",
                "uid": "8efdd8fb0f384e628d2206a966849888",
                "response_text": "n the year 2102, when this story takes place, 95% of the population has psi-powers. Because of the advancement of technology and medicine, physical ailments are easily and quickly remedied. There is even a cure-all that can heal most things, so it is not often that sickness or injury is relevant to life in the society that Kevin and his family live in. However, everything changes when an alien race from Alpha Centauri wages war on the humans. Unknown weapons mean unknown damage, and injury is out of the humans' control. Because Kevin does not have any psi-powers, he is encouraged to learn first aid so that he can be useful during the war. He is expected to be especially good at first aid because he does not feel the emotions of the injured in the way that telepaths do, and thus he should be able to stay more level-headed. However, he is even more effective in first aid that anyone imagined, because when he touches an injured person they heal almost instantaneously. What usually takes days with cure-all is achieved in mere seconds with a touch of Kevin's hand. It is not only the lack of violence that led to Kevin's power going unnoticed: he is the only person in the world with his powers, which makes it incredibly rare, instead of just being a power that nobody was looking for. "
              },
              {
                "worker_id": "8",
                "uid": "9a75f34a6fb94dd5b08ecdbb0850771b",
                "response_text": "Hundreds of years prior to the action of the story, human experimentation with nuclear energy released radiation into the air that caused people to develop psi powers, turning them \"into a race of supermen.\" By 2102, the year the story takes place, most people have some kind of unique ability, the most common of which is telepathy. This quality, coupled with the fact that viral disease and sickness have largely been eradicated, has led to the creation of a well-ordered society unused to violence and large-scale suffering. There are places called \"cure-alls\", which help people with physical ailments, but since such issues are rare, cure-alls are also limited. There are transplants and grafts for things like missing arms and legs in this new world, but there is no such treatment for psi-deficiencies. As a psi-negative, Kevin feels like an outcast in his family and in society in general. He struggles to understand what his purpose is until war comes to Earth in the form of a hostile group of aliens from two newly-discovered planets near Alpha Centauri. Kevin trains in first-aid in order to offer assistance to the war-wounded, and in the process, he discovers he has the ability to heal people physically by simply touching them with his hands."
              },
              {
                "worker_id": "10",
                "uid": "9bf235108e5840c39e92a79ac069f318",
                "response_text": "In the story, Earth had not had war in well over a hundred years and all viruses had been eradicated. The planet was peaceful because there were so many telepaths that there was no longer any capacity for war or crime. Humans started showing these supernatural powers around the 1960s when nuclear energy was being developed. The powers were present, but latent, in humans until brought to life by nuclear radiation. \nBecause Earth was such a peaceful place, attending medical casualties was rare and it was never a career that Kevin had the opportunity to explore. However, after humans discover two earth-like planets in Alpha Centauri and the aliens retaliate and attack Earth, casualties start rolling into the town the Faraday family lives in. Kevin is prepared since he was rapidly trained in the field of medicine on the insistence of his mother who recognized that there would not be enough people with the relevant medical knowledge to treat war casualties should the aliens attack. However, Kevin tries to run away at the first sight of a gaping wound. His mother forces him to stay, and he reluctantly begins shakily sponging the wound of a victim missing half of their face with water. He accidentally drops the sponge and plunges his fingers into the wound, disgusting him greatly. His mother notices immediately that Kevin has healed the wounds completely without scarring. This is the first discovery of Kevin’s psi-power of healing, and he is the only person on Earth to have this ability. If it weren’t for the aliens attacking Earth and creating many casualties, Kevin would not have discovered his extremely rare psi-power.\n"
              },
              {
                "worker_id": "6",
                "uid": "bf50efb26de24b25933a6d8c1fd98705",
                "response_text": "Kevin’s long-undiscovered power is healing, which was largely useless in their society. The cure-all was invented before his birth and advanced technology meant illness, disease, and injuries were few and far between. If someone were injured or ill, they were taken to the health center in another town that contained a cure-all machine. This machine could cure anything within a few days. Frankly, his powers were not needed until the war came around. Since he did not grow up around physically hurt people, he was unable to discover his power until he placed his hands on an injured soldier. "
              }
            ]
          },
          {
            "question_text": "How are people without psi-powers seen in this society?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "3",
                "uid": "8efdd8fb0f384e628d2206a966849888",
                "response_text": "Kevin thinks he is one of the 5% of the population that does not have psi-powers, and we can learn a lot about how society sees this group of people by his interactions with his peers and his family. Before realizing he had powers, Kevin had to stay at home to take care of the house. His family knew that he would not be able to make much money in any kind of job without powers, and it would shame their family for him to be working one of those jobs. Even when he is at home, he's often referred to as slow or useless. He has never had many friends because his peers hated playing sports with him, since they couldn't communicate with their minds, and so Kevin was always at a disadvantage. Similarly, even though he was likeable, girls never wanted to date him. He was also left out of other aspects of society, because a lot of news was delivered via \"tellies\" which is received through psi-powers, so he often has to learn about the goings-on in the society from his family. Kevin learns firsthand how big of a difference it meant for how he was treated once he realized he did have powers after all."
              },
              {
                "worker_id": "8",
                "uid": "9a75f34a6fb94dd5b08ecdbb0850771b",
                "response_text": "People without psi powers are called psi-deficients or classified as psi-negative. They are unique in a society dominated by individuals who developed superpowers over time because of the proliferation of nuclear radiation in Earth's air. Such superpowers include telekinesis, prognostication, teleportation, and most prominently, telepathy. Almost every psi-powered individual has some amount of telepathic ability, and they can also protect themselves from interference by others with the same ability by using a mind shield. Psi-deficient individuals do not have any kind of superpower, so they are susceptible to the whims of those who do have such powers. For example, Kevin cannot read the minds or emotions of his family members, and he cannot protect his own mind or emotions from being probed by his mother and sister. Because of his lack of psi power, most of his family treats him with condescension. They tip-toe around his feelings and fail to really engage with him. Kevin does not feel loved or even liked by most of them, except his brother Tim, who offers him hope by suggesting he will discover his power sometime in the future. This is true for psi-deficients in general. They are viewed as \"throwbacks to an earlier era\" when disease and sickness crippled people in a disorderly society. Because psi-deficients have a harder time adjusting to this new society, they are seen as a kind of burden."
              },
              {
                "worker_id": "10",
                "uid": "9bf235108e5840c39e92a79ac069f318",
                "response_text": "People without psi-powers are considered imbeciles and generally little use to society. Before Kev discovers his psi-power, he describes staying at home and “watching the house” as his only real contribution to the family. People with psi-powers can do things so much more quickly and efficiently than those without, that people like Kev have little chance of holding jobs in this society.\nKevin describes how most psi-powers come with the ability to put up mental shields to stop the mind from being probed. Without psi-powers, the mind is completely transparent to mental probing by telepathy, meaning their thoughts are never private. \nThere are television-like telepathic projections in the society called “tellies” that can’t be received by people without psi-powers, isolating them from current events like the discovery of the inhabited alien planets in Alpha Centauri. Kevin only learns about the discovery reported on the tellies from his siblings who have psi-powers.\n"
              },
              {
                "worker_id": "6",
                "uid": "bf50efb26de24b25933a6d8c1fd98705",
                "response_text": "Individuals who are born with psi-powers, only five percent of the general population, are truly looked down upon in this society. After radioactive testing and explosions brought out the latent psi-powers in people, society quickly changes to accommodate these superhumans. Therefore, those that don’t fit into this society are outcasts, pitied, and often seen as failures by the rest of their family. Kevin is a perfect example. Before he discovered his powers, he was unable to work a menial job due to the shame it would bring his family. So, instead, he read books the primitive way, took walks around the park since he was unable to play sports thanks to his lack of psi-powers, and managed the machines that did all the housework. He truly served no purpose in society and felt great bitterness because of it. "
              }
            ]
          },
          {
            "question_text": "Describe the relationship between Kevin and his mother",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "3",
                "uid": "8efdd8fb0f384e628d2206a966849888",
                "response_text": "Kevin's mother is a psychiatrist, but she does not want to diagnose her own family member, so she has to entrust Kevin's care to people outside the household. There is a lot of tension between Kevin and his mother at the beginning of the story, and she feels sorry for him whenever he feels hope for the future. It seems that the family knows she can feel the specific thoughts but they don't think she can necessarily where they're coming from, and doesn't have context for these feelings. Even though he is slower at some things than his siblings, his mom encourages him to get trained for first-aid once they know a war is coming; in some sense, he finally has a chance to directly contribute to society, according to his mom, and wouldn't be useless anymore. She also thinks he might have an advantage since he won't feel the others' pain as much. After Kevin finds out that he does have powers, his mom seems to be trying to make up for lost time, trying to bond with him, because she recognizes him as useful now, and is no longer indifferent (or even directly mean) towards him. \n"
              },
              {
                "worker_id": "8",
                "uid": "9a75f34a6fb94dd5b08ecdbb0850771b",
                "response_text": "Kevin's mother is a psychiatrist at the Psycho Center with strong telepathic ability. She can read Kevin's mind from the kitchen when he is sitting in the dining room. Although Kevin's mother clearly harbors a bias against psi-deficient people, she also rejects some of the technological advancements of the new society, including the robocooks. Instead, she prefers to cook her own food. Like Kevin's other family members, Kevin's mother walks on eggshells around Kevin, never really truly engaging with him other than to remind the other children to not insult him for his deficiency. As a psychiatrist, his mother won't officially diagnose Kevin herself, but she wants him to make an appointment at the Psycho Center to help him because better adjusted to society. Kevin becomes emotionally disconnected from other people thanks to his own parents' emotional distance from him, and this lack of communication leads them to not understand each other very well. When Earth begins to anticipate war with the aliens from planets near Alpha Centauri, Kevin's mother orders him to train in first-aid in order to contribute. Since the world lacks hospitals because of the exponential decrease in sickness and disease, they have to turn the Psycho Center into a makeshift hospital. This is where Kevin discovers his power to heal people by touching them with his hands. When his mother witnesses his new ability, she is proud to call him her son and reminds him that the leaders of the old world had a similar ability. This encourages Kevin to use his newly-found power for the good of humanity."
              },
              {
                "worker_id": "10",
                "uid": "9bf235108e5840c39e92a79ac069f318",
                "response_text": "Kevin’s mother (Amy) reluctantly accepts that her son lacks supernatural (psi-power) abilities after he undergoes all possible medical tests and psychological evaluations. Kev feels disconnected and like a disappointment to his mother and the rest of his family. His mother is telepathic, and uses this power to probe Kev’s mind and read his thoughts without permission. She encourages Kev to not get his hopes up when Tim, his prognosticating brother, declares that Kev must have a psi-power they have not discovered a test for yet. When the potential for alien attack becomes apparent and she decides to train as many medics as possible to treat casualties, she surprises herself by choosing to bring Kev along because it is a job even someone without powers can do. \nTheir relationship totally changes when Kevin discovers his psi-power of healing - the greatest gift of all. When his mother witnesses him healing a casualty of the alien attack for the first time at the Psycho Center, she is shocked and apologizes for ever doubting Kevin. She tells him that he has a gift, and looks at him with a pride that he has not before felt from her.\n"
              },
              {
                "worker_id": "6",
                "uid": "bf50efb26de24b25933a6d8c1fd98705",
                "response_text": "Kevin’s mother, Amy, is a psychiatrist and a deep-probe telepath, meaning she only has to glance at Kevin to read exactly what’s passing through his mind at that moment. Since Kevin is psi-deficient and her only child to be that way, their relationship is rather strained. The rest of her children are very talented individuals and hold important jobs, even the youngest Tim. Kevin, on the other hand, works at home watching over the machines that do the housework for them. In some ways, Amy both resents and pities him for his lack of powers. \nKevin feels the tension and acts out because of it. As can be seen at the breakfast table, he feels violated by his mother’s ability and his inability to defend himself against her. As well, she clearly has no sympathy for his cause and tells him to make himself useful when the war comes. He trains in first-aid, but at the sight of his first patient who had half his face ripped off, he tries to run away. His mother stops him and scolds him, claiming that if all the telepaths can handle the pain, he can at least look at him. He heals him with his touch and discovers his psi-power. Soon, Kevin becomes the most important man in the world thanks to his healing ability and is irreplaceable in the war. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5025,
        "document_length_chars": 28585
      }
    }
  ]
}