{
  "item_metadata": {
    "item_id": "49897",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "49897",
      "content": "The Gravity Business\n \n \n By JAMES E. GUNN\n \n Illustrated by ASHMAN\n \n [Transcriber's Note: This etext was produced from Galaxy January 1956. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n This little alien beggar could dictate his own terms, but how could he—and how could anyone find out what those terms might be?\n \n\n \n The flivver descended vertically toward the green planet circling the old, orange sun.\n \n It was a spaceship, but not the kind men had once dreamed about. The flivver was shaped like a crude bullet, blunt at one end of a fat cylinder and tapering abruptly to a point at the other. It had been slapped together out of sheet metal and insulation board, and it sold, fully equipped, for $15,730. It didn't behave like a spaceship, either.\n \n As it hurtled down, its speed increased with dramatic swiftness. Then, at the last instant before impact, it stopped. Just like that.\n \n A moment later, it thumped a last few inches into the ankle-deep grass and knee-high white flowers of the meadow. It was a shock of a jar that made the sheet-metal walls boom like thunder machines. The flivver rocked unsteadily on its flat stern before it decided to stay upright.\n \n Then all was quiet—outside.\n \n Inside the big, central cabin, Grampa waved his pircuit irately in the air. \"Now look what you made me do! Just when I had the blamed thing practically whipped, too!\"\n \n \n\n \n\n \n Grampa was a white-haired 90-year-old who could still go a fast round or two with a man (or woman) half his age, but he had a habit of lapsing into tantrum when he got annoyed.\n \n \"Now, Grampa,\" Fred soothed, but his face was concerned. Fred, once called Young Fred, was Grampa's only son. He was sixty and his hair had begun to gray at the temples. \"That landing was pretty rough, Junior.\"\n \n \n\n \n Junior was Fred's only son. Because he was thirty-five and capable of exercising adult judgment and because he had the youngest adult reflexes, he sat in the pilot's chair, the control stick between his knees, his thumb still over the Off-On button on top. \"I know it, Fred,\" he said, frowning. \"This world fooled me. It has a diameter less than that of Mercury and yet a gravitational pull as great as Earth.\"\n \n Grampa started to say something, but an 8-year-old boy looked up from the navigator's table beside the big computer and said, \"Well, gosh, Junior, that's why we picked this planet. We fed all the orbital data into Abacus, and Abacus said that orbital perturbations indicated that the second planet was unusually heavy for its size. Then Fred said,\n'That looks like heavy metals', and you said, 'Maybe uranium—'\"\n \n \"That's enough, Four,\" Junior interrupted. \"Never mind what I said.\"\n \n Those were the Peppergrass men, four generations of them, looking remarkably alike, although some vital element seemed to have dwindled until Four looked pale and thin-faced and wizened.\n \n \"And, Four,\" Reba said automatically, \"don't call your father 'Junior.' It sounds disrespectful.\"\n \n Reba was Four's mother and Junior's wife. On her own, she was a red-haired beauty with the loveliest figure this side of Antares. That Junior had won her was, to Grampa, the most hopeful thing he had ever noticed about the boy.\n \n \"But everybody calls Junior 'Junior,'\" Four complained. \"Besides, Fred is Junior's father and Junior calls him 'Fred.'\"\n \n \"That's different,\" Reba said.\n \n Grampa was still waving his puzzle circuit indignantly. \"See!\" The pircuit was a flat box equipped with pushbuttons and thirteen slender openings in the top. One of the openings was lighted. \"That landing made me push the wrong button and the dad-blasted thing beat me again.\"\n \n \"Stop picking on Junior,\" Joyce said sharply. She was Junior's mother and Fred's wife, still slim and handsome as she approached sixty, but somehow ice water had replaced the warm blood in her veins. \"I'm sure he did the best he could.\"\n \n \"Anybody talks about gravitational pull,\" Grampa said, snorting,\n\"deserves anything anybody could say about him. There's no such thing, Junior. You ought to know by now that gravitation is the effect of the curving of space-time around matter. Einstein proved that two hundred years ago.\"\n \n \"Go back to your games, Grampa,\" Fred said impatiently. \"We've got work to do.\"\n \n \n\n \n Grampa knitted his bushy, white eyebrows and petulantly pushed the last button on his pircuit. The last light went out. \"You've got work to do, have you? Whose flivver do you think this is, anyhow?\"\n \n \"It belongs to all of us,\" Four said shrilly. \"You gave us all a sixth share.\"\n \n \"That's right, Four,\" Grampa muttered, \"so I did. But whose money bought it?\"\n \n \"You bought it, Grampa,\" Fred said.\n \n \"That's right! And who invented the gravity polarizer and the space flivver? Eh? Who made possible this gallivanting all over space?\"\n \n \"You, Grampa,\" Fred said.\n \n \"You bet! And who made one hundred million dollars out of it that the rest of you vultures are just hanging around to gobble up when I die?\"\n \n \"And who spent it all trying to invent perpetual motion machines and longevity pills,\" Joyce said bitterly, \"and fixed it so we'd have to go searching for uranium and habitable worlds all through this deadly galaxy? You, Grampa!\"\n \n \"Well, now,\" Grampa protested, \"I got a little put away yet. You'll be sorry when I'm dead and gone.\"\n \n \"You're never going to die, Grampa,\" Joyce said harshly. \"Just before we left, you bought a hundred-year contract with that Life-Begins-At-Ninety longevity company.\"\n \n \"Well, now,\" said Grampa, blinking, \"how'd you find out about that? Well, now!\" In confusion, he turned back to the pircuit and jabbed a button. Thirteen slim lights sprang on. \"I'll get you this time!\"\n \n Four stretched and stood up. He looked curiously into the corner by the computer where Grampa's chair stood. \"You brought that pircuit from Earth, didn't you? What's the game?\"\n \n Grampa looked up, obviously relieved to drop his act of intense concentration. \"I'll tell you, boy. You play against the pircuit, taking turns, and you can put out one, two or three lights. The player who makes the other one turn out the last light is the winner.\"\n \n \"That's simple,\" Four said without hesitation. \"The winning strategy is to—\"\n \n \"Don't be a kibitzer!\" Grampa snapped. \"When I need help, I'll ask for it. No dad-blamed machine is gonna outthink Grampa!\" He snorted indignantly.\n \n \n\n \n Four shrugged his narrow shoulders and wandered to the view screen. Within it was the green horizon, curving noticeably. Four angled the picture in toward the ship, sweeping through green, peaceful woodland and plain and blue lake until he stared down into the meadow at the flivver's stern.\n \n \"Look!\" he said suddenly. \"This planet not only has flora—it has fauna.\" He rushed to the air lock.\n \n \"Four!\" Reba called out warningly.\n \n \"It's all right, Reba,\" Four assured her. \"The air is within one per cent of Earth-normal and the bio-analyzer can find no micro-organisms viable within the Terran spectrum.\"\n \n \"What about macro-organisms—\" Reba began, but the boy was gone already. Reba's face was troubled. \"That boy!\" she said to Junior.\n\"Sometimes I think we've made a terrible mistake with him. He should have friends, play-mates. He's more like a little old man than a boy.\"\n \n But Junior nodded meaningfully at Fred and disappeared into the chart room. Fred followed casually. Then, as the door slid shut behind him, he asked impatiently. \"Well, what's all the mystery?\"\n \n \"No use bothering the others yet,\" Junior said, his face puzzled. \"You see, I didn't let the flivver drop those last few inches. The polarizer quit.\"\n \n \"Quit!\"\n \n \"That's not the worst. I tried to take it up again. The flivver—it won't budge!\"\n \n \n\n \n The thing was a featureless blob, a two-foot sphere of raspberry gelatin, but it was alive. It rocked back and forth in front of Four. It opened a raspberry-color pseudo-mouth and said plaintively, \"Fweep? Fweep?\"\n \n Joyce drew her chair farther back toward the wall, revulsion on her face. \"Four! Get that nasty thing out of here!\"\n \n \n\n \n\n \n \"You mean Fweep?\" Four asked in astonishment.\n \n \"I mean that thing, whatever you call it.\" Joyce fluttered her hand impatiently. \"Get it out!\"\n \n Four's eyes widened farther. \"But Fweep's my friend.\"\n \n \"Nonsense!\" Joyce said sharply. \"Earthmen don't make friends with aliens. And that's nothing but a—a blob!\"\n \n \"Fweep?\" queried the raspberry lips. \"Fweep?\"\n \n \"If it's Four's friend,\" Reba said firmly, \"it can stay. If you don't like to be around it, Grammy, you can always go to your own room.\"\n \n Joyce stood up indignantly. \"Well! And don't call me 'Grammy!' It makes me sound as old as that old goat over there!\" She glared malignantly at Grampa. \"If you'd rather have that blob than me—well!\" She swept grandly out of the central cabin and into one of the private rooms that opened out from it.\n \n \"Fweep?\" asked the blob.\n \n \"Sure,\" Four said. \"Go ahead, fweep—I mean sweep.\"\n \n Swiftly the sphere rolled across the floor. Behind it was left a narrow path of sparkling clean tile.\n \n Grampa glanced warily at Joyce's door to make sure it was completely closed and then cocked a white eyebrow at Reba. \"Good for you, Reba!\" he said admiringly. \"For forty years now, I've wanted to do that. Never had the nerve.\"\n \n \"Why, thanks, Grampa,\" Reba said, surprised.\n \n \"I like you, gal. Never forget it.\"\n \n \"I like you, too, Grampa. If you'd been a few years younger, Junior would have had competition!\"\n \n \"You bet he would!\" Grampa leaned back and cackled. Then he leaned over confidentially toward Reba and whispered, \"Beats me why you ever married a jerk like Junior, anyhow.\"\n \n Reba looked thoughtfully toward the airlock door. \"Maybe I saw something in him nobody else saw, the man he might become. He's been submerged in this family too long; he's still a child to all of you and to himself, too.\" Reba smiled at Grampa brilliantly. \"And maybe I thought he might grow into a man like his grandfather.\"\n \n \n\n \n Grampa turned red and looked quickly toward Four. The boy was staring intently at Fweep. \"What you doing, Four?\"\n \n \"Trying to figure out what Fweep does with the sweepings,\" Four said absently. \"The outer inch or two of his body gets cloudy and then slowly clears. I think I'll try him with a bigger particle.\"\n \n \"That's the idea, Four. You'll be a Peppergrass yet. How about building me a pircuit?\"\n \n \"You get the other one figured out?\"\n \n \"It was easy,\" Grampa said breezily, \"once you understood the principle. The player who moved second could always win if he used the right strategy. Dividing the thirteen lights into three sections of four each—\"\n \n \"That's right,\" Four agreed. \"I can make you a new one by cannibalizing the other pircuit, but I'll need a few extra parts.\"\n \n Grampa pushed the wall beside his chair and a drawer slid out of it.\n \n Inside were row after row of nipple-topped, flat-sided, flexible free-fall bottles and a battered cigar box. \"Thought you'd say that,\" he said, picking out the box. \"Help yourself.\" With the other hand, he lifted out one of the bottles and took a long drag on it. \"Ahhh!\" he sighed, wiped his mouth with the back of his hand, and carefully put the bottle away.\n \n \"What is that stuff you drink, Grampa?\" Four asked.\n \n \"Tonic, boy. Keeps me young and frisky. Now about that pircuit—\"\n \n \"Did you ever work on Niccolò Tartaglia's puzzle about the three lovely brides, the three jealous husbands, the river and the two-passenger rowboat?\"\n \n \"Yep,\" Grampa said. \"Too easy.\"\n \n Four thought a moment. \"There's a modern variation with three missionaries and three cannibals. Same river, same rowboat and only one of the cannibals can row. If the cannibals outnumber the missionaries—\"\n \n \"Sounds good, boy,\" Grampa said eagerly. \"Whip it up for me.\"\n \n \"Okay, Grampa.\" Four looked at Fweep again. The translucent sphere had paused at Grampa's feet.\n \n Grampa reached down to pat it. For an instant, his hand disappeared into Fweep, and then the alien creature rolled away. This time its path seemed crooked.\n \n Its gelatinous form jiggled. \"Hic!\" it said.\n \n \n\n \n As if in response, the flivver vibrated. Grampa looked querulously toward the airlock. \"Flivver shouldn't shake like that. Not with the polarizer turned on.\"\n \n The airlock door swung inward. Through the oval doorway walked Fred, followed closely by Junior. They were sweat-stained and weary, scintillation counters dangling heavily from their belts.\n \n \"Any luck?\" Reba asked brightly.\n \n \"Do we look it?\" Junior grumbled.\n \n \"Where's Joyce?\" asked Fred. \"Might as well get everybody in on this at once. Joyce!\"\n \n The door to his wife's room opened instantly. Behind it, Joyce was regal and slim. The pose was spoiled immediately by her avid question:\n\"Any uranium? Radium? Thorium?\"\n \n \"No,\" Fred said slowly, \"and no other heavy metals, either. There's a few low-grade iron deposits and that's it.\"\n \n \"Then what makes this planet so heavy?\" Reba asked.\n \n Junior shrugged helplessly and collapsed into a chair. \"Your guess is as good as anybody's.\"\n \n \"Then we've wasted another week on a worthless rock,\" Joyce complained. She turned savagely on Fred. \"This was going to make us all filthy rich. We were going to find radioactives and retire to Earth like billionaires. And all we've done is spent a year of our lives in this cramped old flivver—and we don't have many of them to spare!\" She glared venomously at Grampa.\n \n \"We've still got Fweepland,\" Four said solemnly.\n \n \"Fweepland?\" Reba repeated.\n \n \"This planet. It's not big, but it's fertile and it's harmless. As real estate, it's worth almost as much as if it were solid uranium.\"\n \n \"A good thing, too,\" Junior said glumly, \"because this looks like the end of our search. Short of a miracle, we'll spend the rest of our lives right here—involuntary colonists.\"\n \n Joyce spun on him. \"You're joking!\" she screeched.\n \n \"I wish I were,\" Junior said. \"But the polarizer won't work. Either it's broken or there's something about the gravity around here that just won't polarize.\"\n \n \"It's these '23 models,\" Grampa put in disgustedly. \"They never were any good.\"\n \n \n\n \n The land of the Fweep turned slowly on its axis. The orange sun set and rose again and stared down once more at the meadow where the improbable spaceship rested on its improbable stern. The sixteen Earth hours that the rotation had taken had changed nothing inside the ship, either.\n \n Grampa looked up from his pircuit and said, \"If I were you, Junior, I would take a good look at the TV repairman when we get back to Earth. If we get back to Earth,\" he amended. \"You can't be Four's father. All over the Universe, gravity is the same, and if it's gravity, the polarizer will polarize it.\"\n \n \"That's just supposition,\" Junior said stubbornly. \"The fact is, it isn't because it doesn't. Q.E.D.\"\n \n \"Maybe the polarizer is broken,\" Fred suggested.\n \n Grampa snorted. \"Broken-shmoken. Nothing to break, Young Fred. Just a few coils of copper wire and they're all right. We checked. We know the power plant is working: the lights are on, the air and water recirculation systems are going, the food resynthesizer is okay. And, anyway, the polarizer could work from the storage battery if it had to.\"\n \n \"Then it goes deeper,\" Junior insisted. \"It goes right to the principle of polarization itself. For some reason, it doesn't work here. Why? Before we can discover the answer to that, we'll have to know more about polarization itself. How does it work, Grampa?\"\n \n Grampa gave him a sarcastic grin. \"Now you're curious, eh? Couldn't be bothered with Grampa's invention before. Oh, no! Too busy. Accept without question the blessings that the Good Lord provideth—\"\n \n \"Let's not get up on any pulpits,\" Fred growled. \"Come on, Grampa, what's the theory behind polarization?\"\n \n Grampa looked at the four faces staring at him hopefully and the jeering grin turned to a smile. \"Well,\" he said, \"at last. You know how light is polarized, eh?\" The smile faded. \"No, I guess you don't.\"\n \n \n\n \n He cleared his throat professorially. \"Well, now, in ordinary light the vibrations are perpendicular to the ray in all directions. When light is polarized by passing through crystals or by reflection or refraction at non-metallic surfaces, the paths of the vibrations are still perpendicular to the ray, but they're in straight lines, circles or ellipses.\"\n \n The faces were still blank and unillumined.\n \n \"Gravity is similar to light,\" he pressed on. \"In the absence of matter, gravity is non-polarized. Matter polarizes gravity in a circle around itself. That's how we've always known it until the invention of spaceships and later the polarizer. The polarizer polarizes gravity into a straight line. That makes the ship take off and continue accelerating until the polarizer is shut off or its angle is shifted.\"\n \n The faces looked at him silently. Finally Joyce could endure it no longer. \"That's just nonsense! You all know it. Grampa's no genius. He's just a tinkerer. One day he happened to tinker out the polarizer. He doesn't know how it works any more than I do.\"\n \n \"Now wait a minute!\" Grampa protested. \"That's not fair. Maybe I didn't figure out the theory myself, but I read everything the scientists ever wrote about it. Wanted to know myself what made the blamed thing work. What I told you is what the scientists said, near as I remember. Now me—I'm like Edison. I do it and let everybody else worry over 'why.'\"\n \n \"The only thing you ever did was the polarizer,\" Joyce snapped.\n\"And then you spent everything you got from it on those fool perpetual-motion machines and those crazy longevity schemes when any moron would know they were impossible.\"\n \n Grampa squinted at her sagely. \"That's what they said about the gravity polarizer before I invented it.\"\n \n \"But you don't really know why it works,\" Junior persisted.\n \n \"Well, no,\" Grampa admitted. \"Actually I was just fiddling around with some coils when one of them took off. Went right through the ceiling, dragging a battery behind it. I guess it's still going. Ought to be out near the Horsehead Nebula by now. Luckily, I remembered how I'd wound it.\"\n \n \"Why won't the ship work then, if you know so much?\" Joyce demanded ironically.\n \n \"Well, now,\" Grampa said in bafflement, \"it rightly should, you know.\"\n \n \n\n \n \"We're stuck,\" Reba said softly. \"We might as well admit it. All we can do is set the transmitter to send out an automatic distress call—\"\n \n \"Which,\" Joyce interrupted, \"might get picked up in a few centuries.\"\n \n \"And make the best of what we've got,\" Reba went on, unheeding. \"If we look at it the right way, it's quite a lot. A beautiful, fertile world. Earth gravity. The flivver—even if the polarizer won't work, there's the resynthesizer; it will keep us in food and clothes for years. By then, we should have a good-sized community built up, because out here we won't have to stop with one child. We can have all the babies we want.\"\n \n \"You know the law: one child per couple,\" Joyce reminded her frigidly.\n\"You can condemn yourself to exile from civilization if you wish. Not me.\"\n \n Junior frowned at his wife. \"I believe you're actually glad it happened.\"\n \n \"I could think of worse things,\" Reba said.\n \n \"I like your spunk, Reb,\" Grampa muttered.\n \n \"Speaking of children,\" Junior said, \"where's Four?\"\n \n \"Here.\" Four came through the airlock and trudged across the room, carrying a curious contraption made of tripod legs supporting a small box from which dangled a plumb bob. Behind Four, like a round, raspberry shadow, rolled Fweep.\n \n \"Fweep?\" it queried hopefully.\n \n \"Not now,\" said Four.\n \n \"Where've you been?\" Reba asked anxiously. \"What've you been doing?\"\n \n \"I've been all over Fweepland,\" Four said wearily, \"trying to locate its center of gravity.\"\n \n \"Well?\" Fred prompted.\n \n \"It shifts.\"\n \n \"That's impossible,\" said Junior.\n \n \"Not for Fweep,\" Four replied.\n \n \"What do you mean by that?\" Joyce suspiciously asked.\n \n \"It shifted,\" Four explained patiently, \"because Fweep kept following me.\"\n \n \"Fweep?\" Junior repeated stupidly.\n \n \"Fweep?\" Fweep said eagerly.\n \n \"He's why the flivver won't work. What Grampa invented was a linear polarizer. Fweep is a circular polarizer. He's what makes this planet so heavy. He's why we can't leave.\"\n \n \n\n \n The land of the Fweep rotated once on its axis, and Grampa lowered the nippled bottle from his lips. He sighed. \"I got it figured out, Four,\" he said, holding out the pircuit proudly. \"A missionary takes over a non-rowing type cannibal, leaves him there, and then the rowing cannibal takes over the other cannibal and leaves him there and—\"\n \n \"Not now, Grampa,\" Four said inattentively as he watched Fweep making the grand tour of the cabin.\n \n The raspberry sphere swept over a scattering of crumbs, engulfed them, absorbed them. Four looked at Joyce. Joyce was watching Fweep, too.\n \n \"Rat poison?\" Four asked.\n \n Joyce started guiltily. \"How did you know?\"\n \n \"There's no use trying to poison Fweep,\" Four said calmly. \"He's got no enzymes to act on, no nervous system to paralyze. He doesn't even use what he 'eats' on a molecular level at all.\"\n \n \"What level does he use?\" Junior wanted to know.\n \n \"Point the scintillation counter at him.\"\n \n Junior dug one of the counters out of the supply cabinet and aimed the pickup at Fweep. The counter began to hum. As Fweep approached, the hum rose in pitch. As it passed, the hum dropped.\n \n Junior looked at the counter's dial. \"He's radioactive, all right. Not much, but enough. But where does he get the radioactive material?\"\n \n \"He uses ordinary matter,\" Four said. \"He must have used up the few deposits of natural radioactives a long time ago.\"\n \n \"He uses ordinary substances on an atomic level?\" Junior said unbelievingly.\n \n Four nodded. \"And that 'skin' of his—whatever it is he uses for skin—is more efficient in stopping particle emissions than several feet of lead.\"\n \n Fred studied Fweep thoughtfully. \"Maybe we could feed him enough enriched uranium from the pile to put him over the critical mass.\"\n \n \"And blow him up? I don't think it's possible, but even if it were, it might be a trifle more than disastrous for us.\" Four giggled at the thought.\n \n \n\n \n Joyce glared at him furiously. \"Four! Act your age! We've got to do something with him. It's preposterous that we should be detained here at the whim of a mere blob!\"\n \n \"I don't figure it's a whim,\" Grampa said. \"Circular gravity is what he's got to have for one reason or another, so he just naturally bends the space-time continuum around him—conscious or subconscious, I don't know. But protoplasm is always more efficient than machines, so the flivver won't move.\"\n \n \"I don't care why that thing does it,\" Joyce said icily. \"I want it stopped, and the sooner the better. If it won't turn the gravity off, we'll just have to do away with it.\"\n \n \"How?\" asked Four. \"Fweep's skin is pretty close to impervious and you can't shoot him, stab him or poison him. He doesn't breathe, so you can't drown or strangle him. You can't imprison him; he 'eats' everything. And violence might be more dangerous to us than to him. Right now, Fweep is friendly, but suppose he got mad! He could lower his radioactive shield or he might increase the gravity by a few times. Either way, you'd feel rather uncomfortable, Grammy.\"\n \n \"Don't call me 'Grammy!' Well, what are we going to do, just sit around and wait for that thing to die?\"\n \n \"We'd have a long wait,\" Four observed. \"Fweep is the only one of his kind on this planet.\"\n \n \"Well?\"\n \n \"Probably he's immortal.\"\n \n \"And he doesn't reproduce?\" Reba asked sympathetically.\n \n \"Probably not. If he doesn't die, there's no point in reproduction. Reproduction is nature's way of providing racial immortality to mortal creatures.\"\n \n \"But he must have some way of reproduction,\" Reba argued. \"An egg or something. He couldn't just have sprung into being as he is now.\"\n \n \"Maybe he developed,\" Four offered. \"It seems to me that he's bigger than when we first landed.\" \"He must have been here a long, long time,\" Fred said. \"Fweepland, as Four calls it, kept its atmosphere and its water, which a planet this size ordinarily would have lost by now.\"\n \n \n\n \n Reba looked at Fweep kindly. \"We can thank the little fellow for that, anyway.\"\n \n \"I thank him for nothing,\" Joyce snapped. \"He lured us down here by making us think the planet had heavy metals and I want him to let us go immediately !\"\n \n Fred turned impatiently on his wife. \"Well, try making him understand! And if you can make him understand what you want him to do, try making him do it!\"\n \n Joyce looked at Fred with startled eyes. \"Fred!\" she said in a high, shocked voice and turned blindly toward her room.\n \n Grampa lowered his bottle and smacked his lips. \"Well, boy,\" he said to Fred, \"I thought you'd never do that. Didn't think you had it in you.\"\n \n Fred stood up apologetically. \"I'd better go calm her down,\" he muttered, and walked quickly after Joyce.\n \n \"Give her one for me!\" Grampa called.\n \n Fred's shoulders twitched as the door closed behind him. From the room came the filtered sound of high-pitched voices rising and falling like some reedy folk music.\n \n \"Makes you think, doesn't it?\" Grampa said, looking at Fweep benignly.\n\"Maybe the whole theory of gravitation is cockeyed. Maybe there's a Fweep for every planet and sun, big and little, polarizing the gravity in circles, and the matter business is not a cause but a result.\"\n \n \"What I can't understand,\" Junior said thoughtfully, \"is why the polarizer worked for a little while when we landed—long enough to keep us from being squashed—and then quit.\"\n \n \"Fweep didn't recognize it immediately, didn't know what it was or where it came from,\" Four explained. \"All he knew was he didn't like linear polarization and he neutralized it as soon as he could. That's when we dropped.\"\n \n \n\n \n \"Linear polarization is uncomfortable for him, is it?\" Grampa said.\n\"Makes you wonder how something like Fweep could ever develop.\"\n \n \"He's no more improbable than people,\" said Four.\n \n \"Less than some I've known,\" Grampa conceded.\n \n \"If he can eat anything,\" Reba said, \"why does he keep sweeping the cabin for dust and lint?\"\n \n \"He wants to be helpful,\" Four replied without hesitation, \"and he's lonely. After all,\" he added wistfully, \"he's never had any friends.\"\n \n \"How do you know all these things?\" Joyce asked from her doorway, excitement in her voice. \"Can you talk to it?\"\n \n Behind her, Fred said, \"Now, Joyce, you promised—\"\n \n \"But this is important,\" Joyce cut him off eagerly. \"Can you? Talk to it, I mean?\"\n \n \"Some,\" Four admitted.\n \n \"Have you asked it to let us go?\"\n \n \"Yes.\"\n \n \"Well? What did it say?\"\n \n \"He said he didn't want his friend to leave him.\"\n \n At the word, Fweep rolled swiftly across the floor and bounced into Four's lap. It nestled against him lovingly and opened raspberry lips.\n\"Fwiend,\" it said.\n \n \"Well, now,\" Grampa said maliciously, his eye on Joyce, \"that's no problem. We can just leave Four here with Fweep.\"\n \n In a voice filled with sanctimonious concern, Joyce said, \"That's quite a sacrifice to ask, but—\"\n \n \"Joyce!\" Reba cried, horrified. \"Grampa was joking, but you actually mean it. Four is only a baby and yet you'd let him—\"\n \n \"Never mind, Reba,\" Four said evenly. \"It was just what I was going to suggest myself. It's the one really logical solution.\"\n \n \"Fwiend,\" said Fweep gently.\n \n \n\n \n The land of the Fweep turned like a fat old man toasting himself in front of an open fire, and Junior sat at the computer's keyboard swearing in a steady monotone.\n \n \"Junior!\" said Joyce, shocked.\n \n Junior swung around impatiently. \"Sorry, Mother, but this damned thing won't work.\"\n \n \"I'm sure that calling it names won't help, and besides, you shouldn't expect a machine to do something that we can't do. And if it did work, it would only say that the logical answer is the one I sug—\"\n \n \"Mother!\" Junior warned. \"We decided not to talk about it any more. Four is strange enough without encouraging him to think like a martyr. It's out of the question. If that's the only way we can leave this planet, we'll stay here until Four has a beard as white as Grampa's!\"\n \n \"Well!\" Joyce said in a stiff, offended tone and sat back in her chair.\n \n Grampa lowered the nippled bottle from his lips and chortled. \"Junior, I apologize for all the mean things I ever said about you. Maybe you got the makings of a Peppergrass yet.\"\n \n Junior turned back to the keyboard and studied it, his chin in his hand. \"It's just a matter of stating the problem in terms the computer can work on.\"\n \n \"I take it all back,\" said Grampa. \"That computer won't help you with this problem, Junior. This ain't a long, complicated calculation; it's a simple problem in logic. It's a pircuit problem, like the one about the cannibals and the missionaries. We can't leave Fweepland because Fweep won't let our polarizer work. He won't let our polarizer work because he doesn't like gravity that's polarized in a straight line, and he don't want Four to leave him.\n \n \"Now Fweep ain't the brightest creature in the Universe, so he can't understand why we're so gosh-fired eager to leave. And as long as he's got Four, he's happy. Why should he make himself unhappy? As a favor to Four, he'd let us leave—if we'd leave Four here with him, which we ain't gonna do.\n \n \"That's the problem. All we got to do is figure out the answer. No use making a pircuit, because a puzzle circuit is just a miniature computer with the solution built in; if you can build the pircuit, you've already solved the problem. And if you can state the problem to Abacus, you've already got the answer. All you want from it then is decimal points.\"\n \n \"That may be,\" Junior said stubbornly, \"but I still want to know why this computer won't work. It won't even do simple arithmetic! Where's Four? He's the only one who understands this thing.\"\n \n \"He's outside, playing in the meadow with Fweep,\" Reba said, her voice soft. \"No, here they come now.\"",
      "metadata": {
        "title": "The Gravity Business",
        "author": "James E. Gunn",
        "passage_id": "49897",
        "uid": "6d26a8f97bf74b2982ef0f8b7c2e7f12",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "2",
                "uid": "c3119d36429d431abfbed55f9d55dc6b",
                "response_text": " Grampa Peppergrass is an inventor, creator of the gravity polarizer and the space flivver, which have earned him one hundred million dollars. But he invested much of his earnings in perpetual motion machines and longevity pills. Now, the Peppergrass family travels to different planets, searching for radioactive metals that they can exploit to make themselves a fortune. The family consists of four generations of men and their spouses. Apparently, Grandpa, who is 90-years-old, is a widower. His son, Fred, is 60 and married to Joyce. Their son Junior, 35, is married to Reba; they are parents of an eight-year-old genius son known as Four.\n\tThe flivver they travel in was purchased by Grampa, who gave ⅙ ownership to each of the family members. The flivver’s landing is unusually bumpy because the gravity polarizer failed. Through the view screen, they see that the planet has meadows, woodlands, plains, and lakes, and Four announces that it also has fauna before he rushes out the air lock to check it out. The ship has already ascertained that the air is almost like that on Earth, and there are no micro-organisms. When Four returns to the flivver accompanied by the native fauna, Fweep, he announces they are friends. The creature looks like a transparent blob and likes to sweep. Four is curious about what Fweep does with the sweepings since the outer inch or so of his body turns cloudy but clears afterward. \n\tAfter Fred and Junior use their scintillation counters to search for heavy metals, they return to the flivver to report there aren’t any, just low-grade iron. The group mulls over what could be making the planet so heavy if it doesn’t have heavy metals, but no one has the answer. \nJunior and Fred tell the rest of the family that the gravity polarizer isn’t working and that without it, they will not be able to lift off. Reba looks on the bright side and says they can have more children instead of stopping at one child, as is currently the dictated number on Earth. In the meantime, Four returns from an excursion searching for the center of gravity for the planet and announces that it changes because of Fweep’s presence. The little guy is a circular polarizer, making the planet heavy and preventing their gravity polarizer from working. Fweep is also radioactive and has impervious skin. Joyce is furious that Fweep is making them stay there, and when Grampa jokingly, or as a test, suggests leaving Four behind with Fweep, she immediately goes along with it. Four offers to stay behind with Fweep, who is lonely and likes having a friend so much it doesn’t want to lose Four. Grampa announces that the problem isn’t one that their computer can solve; instead, it’s a logic problem like the ones Four told him earlier.   \n"
              },
              {
                "worker_id": "3",
                "uid": "15aade80ad164151be0557954a2f30a0",
                "response_text": "A small, weird spaceship crashes into a meadow with four generations of the Peppergrass family inside. The men are Grampa, (Young) Fred, Junior, and Four. There are two women: Four's mom Reba, and Junior's mom Joyce. There is bickering, as Joyce doesn't think Grampa has spent his money well, and they argue about the role of gravity in their crash, which happened on a search for heavy metals to bring back to Earth. \nThe air should be safe to breathe, and they spot both plants and animals, so Four wants to rush outside. Junior pulls Fred into a private conversation explaining that something went wrong and their ship now won’t move. When Four gets back, he brings with him a creature named Fweep: a gelatin-like orb about two feet in diameter that is raspberry in color. When he moves across the tile, he cleans it, picking up what he passes over. Joyce is appalled but Reba insists Four should be able to have a friend, so Four focuses on learning how Fweep's ability works. The ship shook when Grampa patted Fweep, and the family discussed a plan. The polarizer on the ship is broken so they might not be able to go anywhere. Grampa insists it can’t be broken, Junior responds that polarization doesn’t work here, so Fred insists on an explanation from Grampa about how gravity polarization works. Joyce insists Grampa doesn't actually know, and expresses her frustration that they aren't just getting rich from finding uranium. They figure they could build a community on the planet, but having more than one child per family is against their laws. As they argue about options, Four uses another contraption to try to find the planet’s center of gravity. The center of gravity shifts when Fweep leaves - he is a circular polarizer, making the planet heavy, conflicting with the linear polarizer of the spaceship, which is why it can't move. Joyce tries to poison Fweep with rat poison but it can’t hurt him, he doesn’t consume what he picks up but rather uses matter to create radioactive substance: this means he has a lot of mass, and it was him their equipment picked up on, not uranium. They talk about how to turn off his gravity, but they don’t know how, and figure he might be immortal. Fred tries to calm Joyce down but she suggest that they appeal to Fweep to let them go. Four says he’d asked already, but Fweep doesn’t want his only friend to leave. The question arises: what if Four stays behind? Junior is found yelling at a computer and doesn’t want Four to stay behind, he refuses to leave his son on a strange planet. Grampa insists that Junior’s computer work won’t help them because it is not a scientific issue, but rather a moral and logical one. The story ends with Fweep and Four coming back from playing in the meadow with the family ready to discuss options.\n"
              },
              {
                "worker_id": "1",
                "uid": "f6ad4f0147b34ecda50b473c9ced063e",
                "response_text": "Four generations of the Peppergrass family approach a new planet. They are riding a flivver, a spaceship that was poorly constructed for very little money. The flivver descends on the new planet, stops abruptly before impact, and lands and rocks back and forth in a grassy meadow. \n\nGrampa, the patriarch of the family, gets upset because his logic puzzle, a pircuit, is disrupted by the harsh landing. When his family members tell him to work on his game, he reminds them that he’s the one that invented the gravity polarizer and the flivver. He also boasts that he made one hundred million dollars doing it. Joyce points out that he spent most of the money, and now the family is stuck searching various planets for uranium. \n\nFour, an eight-year-old boy, leaves the ship and returns with a creature that looks like a two-foot sphere made of raspberry flavored Jello. Almost simultaneously, Junior, the pilot, discovers that the polarizer stopped working, and now the flivver won’t move at all. Joyce, Four’s grandmother, tells him to get the blob away immediately, but Four has already named it Fweep because that’s the only word it has said thus far, and he likes it. Fweep begins sweeping the floor, and his body picks up all of the particles that he passes through. When Grampa reaches down to pet the alien, the flivver physically shakes. \n\nFred reveals that the tests show that Fweep’s planet has no uranium or other heavy metals that would be valuable to the Peppergrass family. They have a difficult time understanding why the planet is so heavy without those resources, and they are all disappointed that the new land will not bring them wealth. They have spent a year on the flivver and they have very little to show for themselves. Worst of all, they are now stuck on Fweep’s planet. After a short discussion, it becomes clear that although Grampa created the polarizer, he has very little knowledge about how it works and how to fix it.\n\nFour discovers that Fweep’s planet has a shifting center of gravity because Fweep himself is a circular polarizer. He is the force that makes the planet heavy. Joyce tries to feed Fweep poison so that the family can leave, but Fweep has zero enzymes and no nervous system. He’s a radioactive being, but it’s unclear what makes him that way. There is no way to kill Fweep because his skin is thicker than lead, and he doesn’t breathe. Four believes he is the only one of his kind and that he is immortal. He reveals that he has been communicating with Fweep, and Fweep has told him that he will not let his family leave because he wants to be Four’s friend. The family considers leaving Four on the planet alone, but his mother won’t have it. Four leaves to play in the meadow with Fweep, and the other family members are left to come up with a solution to the problem. \n"
              },
              {
                "worker_id": "6",
                "uid": "f85c64672c1748a19632a6901075caf0",
                "response_text": "The Peppergrass family is made up of Grampa, their son Fred and his wife Joyce, their son Junior and his wife Reba, and their son Four. The Peppergrass men all looked alike and were currently onboard their Grampa’s flivver which they each hold a share in. Due to Grampa’s poor spending choices, they are currently broke and searching the universe for rare finds or radioactive materials to sell back on Earth. Their rocket, the flivver, lands on this new planet suddenly, as the polarizer gave out when it neared the surface. The men quickly go to investigate it, while Four decides to explore the new planet after looking out the window and discovering both flora and fauna. After reassuring his mother, Four rushes outside, while Junior and Fred discuss the polarizer issue. \nFour returns soon after with a gelatinous, dark pink blob with a mouth that calls itself Fweep. His family reacts somewhat negatively, but Four claims that Fweep is his friend. Reba allows Fweep to say and dismisses Joyce in the process. Fweep sweeps and absorbs matter and particulates into his body. He starts cleaning the floors of the spaceship leaving nothing behind. \nGrampa and Reba share a quick conversation about her choice to marry Junior. Four attempts to understand Fweep before talking with Grampa about his puzzle circuits. Fweep momentarily absorbed Grampa’s hand before spitting it back out. The flivver shook as it did so. Despite having a similar atmosphere to Earth, this planet was extremely heavy, making it impossible to take off of. They toss around ideas, then come to the conclusion that there’s something different about the gravity here. Four discovers that Fweep is the center of gravity after traipsing all across the planet trying to find it. Fweep is a circular polarizer, not a linear polarizer, so he makes the planet heavy and impossible for the polarizer to work. \nJoyce attempts to poison Fweep sometime later, but it doesn’t work. Four reveals all that he’s learned about Fweep and the way it works. After a quick outburst from Joyce, Four says that he’s able to speak to Fweep. Fweep doesn’t want to let them leave because Four is his friend. Joyce suggests leaving Four behind so the rest can leave, which Reba takes great offense to, though Four agrees with Joyce. Grampa and Junior attempt to solve their issue logically while Four and Fweep play outside. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "2",
                "uid": "c3119d36429d431abfbed55f9d55dc6b",
                "response_text": "The first setting mentioned in the story is the flivver, a bullet-shaped spaceship that lands vertically on the blunt end. It is made of sheet metal and insulation board. Fully equipped, a flivver sells for $15,730. The flivver has a large central cabin with the pilot’s chair; the control stick is situated between the pilot’s knees, and there is an on/off button for the gravity polarizer. It is also equipped with a computer named Abacus that analyzes data that fed into it. Flivvers have their own power plants that operate their lights, air and water recirculation systems, and food and clothing synthesizers. It also has a storage battery. Off of the central cabin, there are several private rooms. The flivver is owned jointly by the Peppergrass family; Grandpa bought it the ‘23 model and gave everyone ⅙ shares. The flivver also carries devices that can analyze the air and detect microorganisms.\nThe other setting where the story takes place is on a planet much like Earth, with a diameter smaller than Mercury’s but a gravitational pull as strong as Earth’s. The Peppergrass family calls the world Fweepland since “Fweep” is the sound/word the one organism there says. Fweepland’s air is within 1% of Earth’s air, and there are no microorganisms present. Fweepland features a beautiful landscape with a peaceful green woodland, grassy plains, a meadow, and a blue lake. The only organism they encounter is Fweep, a friendly blob-shaped creature that sweeps over debris and picks it up. The Peppergrass family hopes to find radioactive or heavy metals on the planet, but their scintillation counters only detect low-grade iron. Four points out that while it doesn’t have the metals they are looking for, the planet is very valuable as real estate. Interestingly, the planet’s center of gravity shifts wherever Fweep goes. A day on Fweepland is 16 Earth hours, as that is the length of time it takes for one rotation of the planet.\nThe story presumably takes place sometime in the 22nd century as Grampa references Einstein’s work “two hundred years ago.” There are some references to life on Earth at this time. Families are only allowed one child; if they have more, they are exiled from civilization. We can also assume that others are traveling into space since Grampa became wealthy from his invention of flivvers and gravity polarizers. People on Earth are trying to lengthen their lives, hence Grampa’s efforts to create longevity pills and his hundred-year contract with the Life-Begins-At-Ninety longevity company.\n"
              },
              {
                "worker_id": "3",
                "uid": "15aade80ad164151be0557954a2f30a0",
                "response_text": "There are two settings directly important to the story: one is the planet which the Peppergrass family calls Fweepland, and the other is the spaceship that took them there. Inside the small spaceship are a number of computers that the family interacts with (ones that run puzzles are called pircuit, and the computer that runs the ship is called Abacus). There are personal rooms for the members of the family, and an area to pilot the ship from. Outside of the airlock is the planet the Peppergrass family finds themselves on after the crash: Four refers to it as Fweepland, after the creature he meets who he calls Fweep because \"fweep\" is the only word the creature seems capable of saying. It has beautiful grassy meadows, one of which was the location of the crash. There are various plants and animals on the planet, but one unique creature named Fweep seems to stand on his own. "
              },
              {
                "worker_id": "1",
                "uid": "f6ad4f0147b34ecda50b473c9ced063e",
                "response_text": "“The Gravity Business” takes place on the flivver, a spaceship which Grampa designed, and Fweep’s planet. The flivver has been the Peppergrass’s home for about a year at this point. Although Grampa had millions of dollars not that long ago, he spent it all on frivolous inventions, and the family is now forced to search uncolonized planets for uranium or other expensive heavy metals. It is clear that the family members are getting on each others’ nerves after spending so much time together cooped up in a crude contraption that was built for only $15,000. \n\nFweep’s planet is very similar to Earth, the original home of the Peppergrass family. It is smaller than Mercury, but it has almost the same level of gravity as Earth. The surface is covered with grass and white flowers. Because the planet is unusually heavy for its size, the family believes they may find heavy metals there. However, their instincts are wrong, and the reason the planet is heavy is because Fweep, an alien creature, is polarizing the gravity. At one point, Reba points out that the land is beautiful and fertile, and it really isn’t the worst place to get stuck. \n"
              },
              {
                "worker_id": "6",
                "uid": "f85c64672c1748a19632a6901075caf0",
                "response_text": "The Gravity Business by James E. Gunn takes place on a deserted planet called by the crew the Land of the Fweep or Fweepland. The planet is beautiful, featuring woodlands, prairies, and a blue lake. This green meadow is untouched by any humanity, meaning no buildings, structures, or paved roads. Four is shocked to discover that this planet has both flora and fauna. Each day lasts only 16 Earth hours, significantly shorter than Earth days. \nThe flivver on which they travel is cramped and bullet-shaped. Its relatively ugly figure is unlike any other rocket ship, but it gets the job done. Built with the polarizer discovered by Grampa, this ship is their last hope in making any money to retire and settle down. \nAs well, the society in which they lived before only allowed one child per couple, suggesting overpopulation. \n"
              }
            ]
          },
          {
            "question_text": "Who is Fweep, and what is his significance in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "2",
                "uid": "c3119d36429d431abfbed55f9d55dc6b",
                "response_text": "Fweep is significant because he is the only creature living on Fweepland. He is a blob-shaped, raspberry-colored, gelatinous, transparent creature who sweeps up the debris that he runs over and engulfs it in his body. After he sweeps up particles, the outer inch or two of his body turns cloudy, then slowly clears. It seems he also absorbs substances from human contact since he follows a crooked path and hiccups after Grampa, who has been imbibing, pats him. He has a pseudo-mouth and makes the sound, or says the word, “Fweep.” His skin is impervious, and he has no enzymes or nervous system, so rat poison has no effect on him. Fweep immediately befriends Four. \n\tWhen Four explores Fweepland to identify its center of gravity, he discovers that it shifts because Fweep is a circular polarizer. Fweep is what makes the planet so heavy and prevents the flivver’s gravity polarizer from working so the family can leave. Fweep is slightly radioactive and likely immortal and incapable of reproduction since there is no need to reproduce. Because he has circular polarization, linear polarization is uncomfortable to him, so Fweep turned of the flivver’s gravity polarizer just before they landed. Fweep wants to be helpful, but he doesn’t want Four to leave since Four is the only friend he has ever had. Fweep was lonely before he met Four. Fweep will let the Peppergrass family leave only if Four stays with him. Fweep is responsible for the family’s landing on Fweepland and their predicament of being unable to leave.\n"
              },
              {
                "worker_id": "3",
                "uid": "15aade80ad164151be0557954a2f30a0",
                "response_text": "Fweep is a creature that Four finds when the Peppergrass family lands on an unknown planet. He is a gelatin-like orb about two feet in diameter that is raspberry in color, and has something resembling a mouth. However, he has an interesting ability in which he picks up particulates on the ground by rolling around. He calls this sweeping, and we find out later in the story that he is able to convert the materials in what he picks up to create radioactive matter. Because of this ability, he has a very high mass which the Peppergrass family misinterpreted as heavy metals as they were scanning the planet, which is what drew them to the planet in the first place. Fweep is also responsible for the ship's crashing: because of his mass, Fweep is a circular polarizer, which conflicted with the linear polarizer of the spaceship. Fweep and Four become instant friends when they meet, which adds another layer of complication to the relationship that the family has with Fweep. He could let the family return home, which they can't do under his gravitational pull, but Fweep does not want to let the family go if that means that Four would leave him, and Four is his only friend. This presents a moral conundrum to the family: they could return if they leave Four on the planet, but they do not want to leave a family member behind. "
              },
              {
                "worker_id": "1",
                "uid": "f6ad4f0147b34ecda50b473c9ced063e",
                "response_text": "Fweep is a pink colored blob, and he’s about two-feet wide. He looks like gelatin, and he picks up dust and particles as he moves across the floor of the flivver. The outer couple of inches of his body become cloudy when he does this, and then they clear again. Fweep gets his name because when Four first meets him and brings him back to the flivver, the only word he says is “Fweep?” He is trying to ask Four if he should sweep the spaceship. He wants to be helpful because he has no other friends or family members on his planet. \n\nThe family has a difficult time figuring out why their ship’s polarizer won’t work, and Fweep ends up being the culprit. Fweep is a circular polarizer, and he is the reason that the planet is so heavy. He is a being entirely different than anything living on Earth. Four believes he is immortal because he appears to be the only one of his kind. As far as they know, he cannot be killed because he has zero enzymes, no nervous system, his skin is impenetrable, and he doesn’t breathe. Junior uses a special tool to test Fweep’s radioactivity levels, and he finds that the creature is radioactive, although it’s unclear how or why. \n\nWhen the family’s flivver lands, Fweep does not like the feeling of linear polarization, so he neutralizes it. This causes the spaceship to abruptly fall to the ground. After he meets Four, the eight-year-old genius of the family, he decides that he wants to be his friend. Four asks Fweep if his family can leave the planet, and Fweep tells him he doesn’t want his friend to leave. He enjoys sitting in Four’s lap and even learns the word “fwend.” Fweep won’t allow the flivver’s polarizer to work, so the family cannot leave. He won’t allow the polarizer to work because he wants to stay friends with Four. When the story abruptly comes to an end, the Peppergrass adults are trying to figure out how to solve this problem. \n"
              },
              {
                "worker_id": "6",
                "uid": "f85c64672c1748a19632a6901075caf0",
                "response_text": "Fweep is a gelatinous life-form, unlike anything the Peppergrass family has ever seen before. Fweep is slightly radioactive after having absorbed much of the radioactive substances found on this planet. He can also convert ordinary matter into a radioactive substance. Fweep is unstable, unshootable, and unable to be poisoned. Fweep does not breathe, so he is unable to be suffocated or drowned. As well, Fweep may be immortal, since there are no other of his kind. Since he’s the only one of his kind, he’s very lonely and latches onto Four as soon as he arrives. Fweep controls the gravity of Fweepland, and uses circular gravity not linear gravity. His powers are extraordinary and completely unknown. "
              }
            ]
          },
          {
            "question_text": "Who is Four, and what is his significance in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "2",
                "uid": "c3119d36429d431abfbed55f9d55dc6b",
                "response_text": "Four is the highly intelligent, eight-year-old youngest member of the Peppergrass family. Although he is the youngest, he is the one who figures out the answers to why Fweepland is so heavy and how Fweep disables the flivver’s gravity polarizer. As a child, he is more impulsive than the adults, for example rushing outside to meet Fweep when the others stay back, but this enables him to solve problems and answer questions faster. On the other hand, his lack of experience prevents him from solving the ultimate problem of how to leave the planet, but his riddles and comment that creating a puzzle means you already know the solution trigger an idea for Grampa that may help solve the family’s dilemma. By befriending Fweep so readily, Four discovers that Fweep is responsible for the planet’s “fake” heaviness and the failure of the flivver’s gravity polarizer. He also studies Fweep and determines his significant characteristics such as his impervious skin, lack of enzymes, and radioactivity. While the adults discuss and bemoan the fact that they cannot leave Fweepland, Four goes out and tries to identify the planet’s center of gravity and therefore discovers that Fweep affects the planet’s gravity and that he is a circular polarizer. At the end of the story, Junior even relies on Four to find out why the computer won’t work. Not only is Four a problem solver and investigator, but he is also logical and selfless. He realizes that Fweep doesn’t want him to leave and is willing to stay behind with Fweep so that the rest of his family can leave. "
              },
              {
                "worker_id": "3",
                "uid": "15aade80ad164151be0557954a2f30a0",
                "response_text": "Four is the youngest of the Peppergrass family, the son of Junior and Reba. He is eight years old, and due to his unusual upbringing living on a ship with his family, does not have many friends of his own. When the family crash-lands on a planet, he discovers a creature who he calls Fweep and the two instantly become friends. Four seems to understand the creatures when he talks, and can interpret his requests. Four is a curious child, and wants to solve the problem of why the ship can't go anywhere after it crash landed, so he took Fweep on an adventure to find the center of gravity of the planet. It is Four who discovers that Fweep is the center of gravity, and it is the fact that this point shifts that makes the gravity (and thus, the polarization) so unpredictable. It is also Four who aims to learn more about the planet outside of the ship, and not just about the problems on the ship itself, and it is this perspective that drives any progress they made. Besides learning about the moving center of gravity, he learns about the way Fweep picks things up as he rolls over them, and investigates how he converts matter and what his outer shell might be contributing to the distribution of energy. After discovering that Fweep is responsible for the gravity of the planet, things get more complicated. Four is at the center of a moral conundrum at the end of the story: if the family wants to return home, they have to appeal to Fweep, who controls the polarization on the planet. However, Fweep's terms are that Four would have to stay behind, because he does not want his only friend to leave. "
              },
              {
                "worker_id": "1",
                "uid": "f6ad4f0147b34ecda50b473c9ced063e",
                "response_text": "Four is an eight-year-old genius and a member of the Peppergrass family. He is pale, has a thin face, and acts much, much older than he is. His mother is Reba and his father is Junior. His parents are concerned about his lack of friends and socialization. He truly acts like an adult, and it seems as though he never got to have a normal childhood. When his Grampa struggles to figure out his logic puzzle, Four solves it for him in mere moments. He then comes up with another puzzle for his Grampa to solve, and he even offers to build him a pircuit board with a few parts that he has laying around the flivver. Four is very excited to meet his new friend Fweep, and it’s clear that he does not want to immediately come clean about Fweep being the reason the family’s spaceship can’t take off. Since he has had so few friends in his life, the pink blob that follows him around means a lot to him, especially since he actually tells Four that he wants to be his friend. If it were up to Four, the family would probably stay on Fweep's planet and colonize the fertile land. However, several of the family members are completely against this idea, and Reba refuses to leave her son behind so that the spaceship can take off again. They are in this conundrum when the story ends. "
              },
              {
                "worker_id": "6",
                "uid": "f85c64672c1748a19632a6901075caf0",
                "response_text": "Four is the youngest of the Peppergrass men and perhaps one of the smartest. Despite his young age, he is very intelligent and understanding of the world of rocketships and interplanetary travel. His mother, Reba, worries after him, especially since he doesn’t have any friends to play with or a school to attend. He creates games for his Grampa to solve and puzzle circuits as well. However, when they land on this new planet, he quickly makes a friend in Fweep. After discovering that the planet’s gravity is attached to Fweep and therefore circular, he effectively discovered the true issue at hand. It was not the polarizer that was keeping them trapped, it was Fweep. Four nobly offers to stay behind with Fweep, so the rest can leave and Fweep won’t be lonely. All Fweep wants is a friend, and Four is happy to be that friend. "
              }
            ]
          },
          {
            "question_text": "Describe Joyce and her role in the story.",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "2",
                "uid": "c3119d36429d431abfbed55f9d55dc6b",
                "response_text": "Joyce is Junior’s mother and Fred’s wife and is nearly sixty years old; she is still in good shape: slender, elegant, and attractive. However, she is described as having ice water instead of blood in her veins because she is such a cold-hearted woman much of the time. Joyce creates most of the tension in the story; she is frequently at odds with Grampa and says whatever she thinks, no matter how rude or hurtful it is. She presents as a spoiled, self-centered woman who only wants lots of money. Grampa’s inventions made him a multimillionaire, but she accuses him of wasting the money on new inventions and making it so that they had to travel the galaxy searching for uranium and other habitable worlds. When Grampa tells her he has set some money aside and she’ll be sorry when he’s dead, she responds that he’ll never die. And she knows he bought a hundred-year contract with the Life-Begins-At-Ninety longevity company. Joyce is eager to get her hands on some of Grampa’s money and resents that he is using some of it to carry out his research. When Four brings Fweep aboard the flivver, she is thoroughly disgusted and insists he take it back out; when Reba stands up for Four and Fweep and calls Joyce Grammy, Joyce is furious and goes into her private room. Later, she even tries to poison Fweep by leaving rat poison on the floor. When the men return from checking Fweepland for heavy metals or radioactive elements, she eagerly comes out of her room and immediately asks if they had found any uranium, radium, or thorium. Their negative answer again draws her ire and shows her greed. She complains to Fred that they are all supposed to get filthy rich finding radioactives and retire on Earth as billionaires. She resents the year they have spent looking for radioactives. When she learns that Fweep is the reason they can’t leave the planet, her first reaction is to kill him, and when she learns that killing him isn’t possible, she readily and seriously agrees to Grampa’s joke that they should leave Four behind so the rest of them can leave. Again, Joyce only wants what is best for her, and she is ready to kill or abandon anyone who stands in her way."
              },
              {
                "worker_id": "3",
                "uid": "15aade80ad164151be0557954a2f30a0",
                "response_text": "Joyce is the mother of Junior, an almost-60-year old woman who is very cold and bitter in most of her interactions with the rest of the family. She constantly berates Grampa for how he spends his money and what he may or may not understand about science, especially the polarizer. She is appalled when she encounters Fweep for the first time, but Reba stands up for Four and Fweep and reminds Joyce that she can always go to her room to stay away from it. Joyce just wanted to gain money by finding radioactive material on their journey, but getting rich seems to be her only goal so she is not entertained by the interesting distractions that the rest of the crew find endearing or curious. She makes fun of Grampa for happening upon the right configuration to build a successful polarizer and says his skill and scientific knowledge had nothing to do with his \"accidental\" success. Joyce is the only one who is potentially serious about leaving Four behind on the planet in return for the ability to leave, and people do not usually stand up to her--when Reba stands up for Four's right to have Fweep as a friend, the rest of the family is surprised, and even in awe. Joyce even tries to poison Fweep by leaving out rat poison before she learns that he cannot be affected by it. In general, she is angry or hysterical and is always antagonistic, and acts as the main source of conflict in the family. "
              },
              {
                "worker_id": "1",
                "uid": "f6ad4f0147b34ecda50b473c9ced063e",
                "response_text": "Joyce is Grampa’s wife and Four’s grandmother, but she refuses to be called by that name. Although she is almost sixty years old, she is still thin and beautiful. However, she is also very difficult to get along with. She openly blames her husband for spending all of their money and essentially ruining their lives, and she tells the rest of the family members his secret about purchasing some type of contract that will extend his life. When Grampa tries to explain how the polarizer works, Joyce immediately pipes up and tells everyone that he is just a tinkerer and has no idea what he’s talking about. Despite the fact that he invented the polarizer and the flivver they are using to travel, she gives him zero credit. Joyce hates living on the flivver and traveling to all sorts of different planets to search for heavy metals. She would much rather be on Earth. When she meets Fweep, she is disgusted and wants him as far away as possible. After she finds out that Fweep is the reason the ship is stuck on the unknown planet, she actually tries to feed the alien rat poison, but it doesn’t work. Joyce would most likely leave Four, a young child, behind to fend for himself on a planet he’s never before visited, but her daughter-in-law Reba will not allow the family to take off without Four. \n"
              },
              {
                "worker_id": "6",
                "uid": "f85c64672c1748a19632a6901075caf0",
                "response_text": "Joyce is Fred’s wife and prone to tantrums. She is often upset when things don’t go her way and more blunt than may be considered socially acceptable. For example, she is the first to suggest that they leave Four behind so the rest can escape, much to Reba’s horror. As well, she’s upset when Fweep is first introduced to the family circle, especially since his presence forces her to retreat. Joyce often causes conflict, tension, and drama throughout the story with her survivalist attitude and unfortunately unpleasant attitude.  "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5035,
        "document_length_chars": 30128
      }
    }
  ]
}