{
  "item_metadata": {
    "item_id": "49901",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "49901",
      "content": "The Snare\n \n \n By RICHARD R. SMITH\n \n Illustrated by WEISS\n \n [Transcriber's Note: This etext was produced from Galaxy January 1956. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n It's easy to find a solution when there is one—the trick is to do it if there is none!\n \n\n \n I glanced at the path we had made across the Mare Serenitatis . The Latin translated as \"the Sea of Serenity.\" It was well named because, as far as the eye could see in every direction, there was a smooth layer of pumice that resembled the surface of a calm sea. Scattered across the quiet sea of virgin Moon dust were occasional islands of rock that jutted abruptly toward the infinity of stars above. Considering everything, our surroundings conveyed a sense of serenity like none I had ever felt.\n \n Our bounding path across the level expanse was clearly marked. Because of the light gravity, we had leaped high into the air with each step and every time we struck the ground, the impact had raised a cloud of dustlike pumice. Now the clouds of dust were slowly settling in the light gravity.\n \n Above us, the stars were cold, motionless and crystal-clear. Indifferently, they sprayed a faint light on our surroundings ... a dim glow that was hardly sufficient for normal vision and was too weak to be reflected toward Earth.\n \n We turned our head-lamps on the strange object before us. Five beams of light illuminated the smooth shape that protruded from the Moon's surface.\n \n The incongruity was so awesome that for several minutes, we remained motionless and quiet. Miller broke the silence with his quavering voice, \"Strange someone didn't notice it before.\"\n \n \n\n \n Strange? The object rose a quarter of a mile above us, a huge, curving hulk of smooth metal. It was featureless and yet conveyed a sense of alienness . It was alien and yet it wasn't a natural formation. Something had made the thing, whatever it was. But was it strange that it hadn't been noticed before? Men had lived on the Moon for over a year, but the Moon was vast and the Mare Serenitatis covered three hundred and forty thousand square miles.\n \n \"What is it?\" Marie asked breathlessly.\n \n Her husband grunted his bafflement. \"Who knows? But see how it curves? If it's a perfect sphere, it must be at least two miles in diameter!\"\n \n \"If it's a perfect sphere,\" Miller suggested, \"most of it must be beneath the Moon's surface.\"\n \n \"Maybe it isn't a sphere,\" my wife said. \"Maybe this is all of it.\"\n \n \"Let's call Lunar City and tell the authorities about it.\" I reached for the radio controls on my suit.\n \n Kane grabbed my arm. \"No. Let's find out whatever we can by ourselves. If we tell the authorities, they'll order us to leave it alone. If we discover something really important, we'll be famous!\"\n \n I lowered my arm. His outburst seemed faintly childish to me. And yet it carried a good measure of common sense. If we discovered proof of an alien race, we would indeed be famous. The more we discovered for ourselves, the more famous we'd be. Fame was practically a synonym for prestige and wealth.\n \n \"All right,\" I conceded.\n \n Miller stepped forward, moving slowly in the bulk of his spacesuit. Deliberately, he removed a small torch from his side and pressed the brilliant flame against the metal.\n \n A few minutes later, the elderly mineralogist gave his opinion: \"It's steel ... made thousands of years ago.\"\n \n Someone gasped over the intercom, \"Thousands of years! But wouldn't it be in worse shape than this if it was that old?\"\n \n Miller pointed at the small cut his torch had made in the metal. The notch was only a quarter of an inch deep. \"I say steel because it's similar to steel. Actually, it's a much stronger alloy. Besides that, on the Moon, there's been no water or atmosphere to rust it. Not even a wind to disturb its surface. It's at least several thousand years old.\"\n \n \n\n \n We slowly circled the alien structure. Several minutes later, Kane shouted, \"Look!\"\n \n A few feet above the ground, the structure's smooth surface was broken by a circular opening that yawned invitingly. Kane ran ahead and flashed his head-lamp into the dark recess.\n \n \"There's a small room inside,\" he told us, and climbed through the opening.\n \n We waited outside and focused our lamps through the five-foot opening to give him as much light as possible.\n \n \"Come on in, Marie,\" he called to his wife. \"This is really something! It must be an alien race. There's all kinds of weird drawings on the walls and gadgets that look like controls for something....\"\n \n Briefly, my lamp flickered over Marie's pale face. Her features struggled with two conflicting emotions: She was frightened by the alienness of the thing and yet she wanted to be with her husband. She hesitated momentarily, then climbed through the passage.\n \n \"You want to go in?\" my wife asked.\n \n \"Do you?\"\n \n \"Let's.\"\n \n I helped Verana through the opening, climbed through myself and turned to help Miller.\n \n Miller was sixty years old. He was an excellent mineralogist, alert mentally, but with a body that was almost feeble. I reached out to help him as he stepped into the passageway.\n \n For a brief second, he was framed in the opening, a dark silhouette against the star-studded sky.\n \n The next second, he was thrown twenty yards into the air. He gasped with pain when he struck the ground. \" Something pushed me!\"\n \n \"Are you all right?\"\n \n \"Yes.\"\n \n He had fallen on a spot beyond our angle of vision. I started through the passage....\n \n ... and struck an invisible solid wall.\n \n \n\n \n My eyes were on the circular opening. A metal panel emerged from a recess on one side and slid across the passage. The room darkened with the absence of starlight.\n \n \" What happened? \"\n \n \"The door to this damned place closed,\" I explained.\n \n \" What? \"\n \n Before we could recover from the shock, the room filled with a brilliant glare. We turned off our lamps.\n \n The room was approximately twelve feet long and nine feet wide. The ceiling was only a few inches above our heads and when I looked at the smooth, hard metal, I felt as if I were trapped in some alien vault.\n \n The walls of the room were covered with strange drawings and instruments. Here and there, kaleidoscopic lights pulsed rhythmically.\n \n Kane brushed past me and beat his gloved fists against the metal door that had imprisoned us.\n \n \"Miller!\"\n \n \"Yes?\"\n \n \"See if you can get this thing open from the outside.\"\n \n I knelt before the door and explored its surface with my fingers. There were no visible recesses or controls.\n \n Over the intercom network, everyone's breath mingled and formed a rough, harsh sound. I could discern the women's quick, frightened breaths that were almost sobs. Kane's breath was deep and strong; Miller's was faltering and weak.\n \n \"Miller, get help!\"\n \n \"I'll—\" The sound of his breathing ceased. We listened intently.\n \n \"What happened to him?\"\n \n \"I'll phone Lunar City.\" My fingers fumbled at the radio controls and trembled beneath the thick gloves.\n \n I turned the dials that would connect my radio with Lunar City....\n \n Static grated against my ear drums.\n  Static!\n \n \n \n\n \n I listened to the harsh, erratic sound and my voice was weak by comparison: \"Calling Lunar City.\"\n \n \"Static!\" Kane echoed my thoughts. His frown made deep clefts between his eyebrows. \"There's no static between inter-lunar radio!\"\n \n Verana's voice was small and frightened. \"That sounds like the static we hear over the bigger radios when we broadcast to Earth.\"\n \n \"It does,\" Marie agreed.\n \n \"But we wouldn't have that kind of static over our radio, unless—\" Verana's eyes widened until the pupils were surrounded by circles of white—\"unless we were in outer space!\"\n \n We stared at the metal door that had imprisoned us, afraid even to speak of our fantastic suspicion.\n \n I deactivated my radio.\n \n Marie screamed as an inner door opened to disclose a long, narrow corridor beyond.\n \n Simultaneous with the opening of the second door, I felt air press against my spacesuit. Before, our suits had been puffed outward by the pressure of air inside. Now our spacesuits were slack and dangling on our bodies.\n \n We looked at each other and then at the inviting corridor beyond the open door.\n \n We went single file, first Kane, then his wife Marie. Verana followed next and I was the last.\n \n We walked slowly, examining the strange construction. The walls were featureless but still seemed alien. At various places on the walls were the outlines of doors without handles or locks.\n \n Kane pressed his shoulder against a door and shoved. The door was unyielding.\n \n I manipulated the air-vent controls of my spacesuit, allowed a small amount of the corridor's air into my helmet and inhaled cautiously. It smelled all right. I waited and nothing happened. Gradually, I increased the intake, turned off the oxygenating machines and removed my helmet.\n \n \"Shut off your oxy,\" I suggested. \"We might as well breathe the air in this place and save our supply. We may need the oxygen in our suits later.\"\n \n They saw that I had removed my helmet and was still alive and one by one removed their own helmets.\n \n \n\n \n At the end of the corridor, Kane stopped before a blank wall. The sweat on his face glistened dully; his chest rose and fell rapidly. Kane was a pilot and one of the prerequisites for the job of guiding tons of metal between Earth and the Moon was a good set of nerves. Kane excited easily, his temper was fiery, but his nerves were like steel.\n \n \"The end of the line,\" he grunted.\n \n As though to disprove the statement, a door on his right side opened soundlessly.\n \n He went through the doorway as if shoved violently by an invisible hand.\n \n The door closed behind him.\n \n Marie threw herself at the door and beat at the metal. \"Harry!\"\n \n Verana rushed to her side. Another door on the opposite side of the corridor opened silently. The door was behind them; they didn't notice.\n \n Before I could warn them, Marie floated across the corridor, through the doorway.\n \n Verana and I stared at the darkness beyond the opening, our muscles frozen by shock.\n \n The door closed behind Marie's screaming, struggling form.\n \n Verana's face was white with fear. Apprehensively, she glanced at the other doors that lined the hall.\n \n I put my arms around her, held her close.\n \n \"Antigravity machines, force rays,\" I suggested worriedly.\n \n For several minutes, we remained motionless and silent. I recalled the preceding events of the day, searched for a sense of normality in them. The Kanes, Miller, Verana and I lived in Lunar City with hundreds of other people. Mankind had inhabited the Moon for over a year. Means of recreation were scarce. Many people explored the place to amuse themselves. After supper, we had decided to take a walk. As simple as that: a walk on the Moon.\n \n We had expected only the familiar craters, chasms and weird rock formations. A twist of fate and here we were: imprisoned in an alien ship.\n \n My legs quivered with fatigue, my heart throbbed heavily, Verana's perfume dizzied me. No, it wasn't a dream. Despite our incredible situation, there was no sensation of unreality.\n \n \n\n \n I took Verana's hand and led her down the long corridor, retracing our steps.\n \n We had walked not more than two yards when the rest of the doors opened soundlessly.\n \n Verana's hand flew to her mouth to stifle a gasp.\n \n Six doors were now open. The only two that remained closed were the ones that the Kanes had unwillingly entered.\n \n This time, no invisible hand thrust us into any of the rooms.\n \n I entered the nearest one. Verana followed hesitantly.\n \n The walls of the large room were lined with shelves containing thousands of variously colored boxes and bottles. A table and four chairs were located in the center of the green, plasticlike floor. Each chair had no back, only a curving platform with a single supporting column.\n \n \"Ed!\" I joined Verana on the other side of the room. She pointed a trembling finger at some crude drawings. \"The things in this room are food!\"\n \n The drawings were so simple that anyone could have understood them. The first drawing portrayed a naked man and woman removing boxes and bottles from the shelves. The second picture showed the couple opening the containers. The third showed the man eating from one of the boxes and the woman drinking from a bottle.\n \n \n\n \n \"Let's see how it tastes,\" I said.\n \n I selected an orange-colored box. The lid dissolved at the touch of my fingers.\n \n The only contents were small cubes of a soft orange substance.\n \n I tasted a small piece.\n \n \"Chocolate! Just like chocolate!\"\n \n Verana chose a nearby bottle and drank some of the bluish liquid.\n \n \"Milk!\" she exclaimed.\n \n \"Perhaps we'd better look at the other rooms,\" I told her.\n \n \n\n \n The next room we examined was obviously for recreation. Containers were filled with dozens of strange games and books of instructions in the form of simple drawings. The games were foreign, but designed in such a fashion that they would be interesting to Earthmen.\n \n Two of the rooms were sleeping quarters. The floors were covered with a spongy substance and the lights were dim and soothing.\n \n Another room contained a small bathing pool, running water, waste-disposal units and yellow cakes of soap.\n \n The last room was an observatory. The ceiling and an entire wall were transparent. Outside, the stars shone clearly for a few seconds, then disappeared for an equal time, only to reappear in a different position.\n \n \"Hyper-space drive,\" Verana whispered softly. She was fascinated by the movement of the stars. For years, our scientists had sought a hyperspatial drive to conquer the stars.\n \n We selected a comfortable chair facing the transparent wall, lit cigarettes and waited.\n \n A few minutes later, Marie entered the room.\n \n I noticed with some surprise that her face was calm. If she was excited, her actions didn't betray it.\n \n She sat next to Verana.\n \n \"What happened?\" my wife asked.\n \n Marie crossed her legs and began in a rambling manner as if discussing a new recipe, \"That was really a surprise, wasn't it? I was scared silly, at first. That room was dark and I didn't know what to expect. Something touched my head and I heard a telepathic voice—\"\n \n \"Telepathic?\" Verana interrupted.\n \n \"Yes. Well, this voice said not to worry and that it wasn't going to hurt me. It said it only wanted to learn something about us. It was the oddest feeling! All the time, this voice kept talking to me in a nice way and made me feel at ease ... and at the same time, I felt something search my mind and gather information. I could actually feel it search my memories!\"\n \n \"What memories?\" I inquired.\n \n She frowned with concentration. \"Memories of high school mostly. It seemed interested in English and history classes. And then it searched for memories of our customs and lives in general....\"\n \n \n\n \n Kane stalked into the room at that moment, his face red with anger.\n\" Do you know where we are? \" he demanded. \"When those damned aliens got me in that room, they explained what this is all about. We're guinea pigs!\"\n \n \"Did they use telepathy to explain?\" Verana asked. I suddenly remembered that she was a member of a club that investigated extra-sensory perception with the hope of learning how it operated. She was probably sorry she hadn't been contacted telepathically.\n \n \"Yeah,\" Kane replied. \"I saw all sorts of mental pictures and they explained what they did to us. Those damned aliens want us for their zoo!\"\n \n \"Start at the beginning,\" I suggested.\n \n He flashed an angry glance at me, but seemed to calm somewhat. \"This ship was made by a race from another galaxy. Thousands of years ago, they came to Earth in their spaceships when men were primitives living in caves. They wanted to know what our civilization would be like when we developed space flight. So they put this ship on the Moon as a sort of booby-trap. They put it there with the idea that when we made spaceships and went to the Moon, sooner or later, we'd find the ship and enter it— like rabbits in a snare! \"\n \n \"And now the booby-trap is on its way home,\" I guessed.\n \n \"Yeah, this ship is taking us to their planet and they're going to keep us there while they study us.\"\n \n \"How long will the trip take?\" I asked.\n \n \"Six months. We'll be bottled up in this crate for six whole damned months! And when we get there, we'll be prisoners!\"\n \n Marie's hypnotic spell was fading and once more her face showed the terror inside her.\n \n \"Don't feel so bad,\" I told Kane. \"It could be worse. It should be interesting to see an alien race. We'll have our wives with us—\"\n \n \"Maybe they'll dissect us!\" Marie gasped.\n \n Verana scoffed. \"A race intelligent enough to build a ship like this? A race that was traveling between the stars when we were living in caves? Dissection is primitive. They won't have to dissect us in order to study us. They'll have more advanced methods.\"\n \n \"Maybe we can reach the ship's controls somehow,\" Kane said excitedly.\n\"We've got to try to change the ship's course and get back to the Moon!\"\n \n \"It's impossible. Don't waste your time.\" The voice had no visible source and seemed to fill the room.\n \n \n\n \n Verana snapped her fingers. \"So that's why the aliens read Marie's mind! They wanted to learn our language so they could talk to us!\"\n \n Kane whirled in a complete circle, glaring at each of the four walls.\n\"Where are you? Who are you?\"\n \n \"I'm located in a part of the ship you can't reach. I'm a machine.\"\n \n \"Is anyone else aboard besides ourselves?\"\n \n \"No. I control the ship.\" Although the voice spoke without stilted phrases, the tone was cold and mechanical.\n \n \"What are your—your masters going to do with us?\" Marie asked anxiously.\n \n \"You won't be harmed. My masters merely wish to question and examine you. Thousands of years ago, they wondered what your race would be like when it developed to the space-flight stage. They left this ship on your Moon only because they were curious. My masters have no animosity toward your race, only compassion and curiosity.\"\n \n I remembered the way antigravity rays had shoved Miller from the ship and asked the machine, \"Why didn't you let our fifth member board the ship?\"\n \n \"The trip to my makers' planet will take six months. There are food, oxygen and living facilities for four only of your race. I had to prevent the fifth from entering the ship.\"\n \n \"Come on,\" Kane ordered. \"We'll search this ship room by room and we'll find some way to make it take us back to Earth.\"\n \n \"It's useless,\" the ship warned us.\n \n For five hours, we minutely examined every room. We had no tools to force our way through solid metal walls to the engine or control rooms. The only things in the ship that could be lifted and carried about were the containers of food and alien games. None were sufficiently heavy or hard enough to put even a scratch in the heavy metal.\n \n \n\n \n Six rooms were open to our use. The two rooms in which the Kanes had been imprisoned were locked and there were no controls or locks to work on.\n \n The rooms that we could enter were without doors, except the ones that opened into the corridor.\n \n After intensive searching, we realized there was no way to damage the ship or reach any section other than our allotted space.\n \n We gave up.\n \n The women went to the sleeping compartments to rest and Kane I went to the \"kitchen.\"\n \n At random, we sampled the variously colored boxes and bottles and discussed our predicament.\n \n \"Trapped,\" Kane said angrily. \"Trapped in a steel prison.\" He slammed his fist against the table top. \"But there must be a way to get out! Every problem has a solution!\"\n \n \"You sure?\" I asked.\n \n \"What?\"\n \n \" Does every problem have a solution? I don't believe it. Some problems are too great. Take the problem of a murderer in our civilization: John Doe has killed someone and his problem is to escape. Primarily, a murderer's problem is the same principle as ours. A murderer has to outwit an entire civilization. We have to outwit an entire civilization that was hundreds of times more advanced than ours is now when we were clubbing animals and eating the meat raw. Damned few criminals get away these days, even though they've got such crowds to lose themselves in. All we have is a ship that we can't control. I don't think we have a chance.\"\n \n My resignation annoyed him. Each of us had reacted differently: Kane's wife was frightened, Verana was calm because of an inner serenity that few people have, I was resigned and Kane was angry.\n \n \n\n \n For several minutes, we sampled the different foods. Every one had a distinctive flavor, comparable to that of a fruit or vegetable on Earth.\n \n Kane lifted a brown bottle to his lips, took a huge gulp and almost choked.\n \n \"Whiskey!\"\n \n \"My masters realized your race would develop intoxicants and tried to create a comparable one,\" the machine explained.\n \n I selected a brown bottle and sampled the liquid. \"A little stronger than our own,\" I informed the machine.\n \n We drank until Kane was staggering about the room, shouting insults at the alien race and the mechanical voice that seemed to be everywhere. He beat his fist against a wall until blood trickled from bruised knuckles.\n \n \"Please don't hurt yourself,\" the machine pleaded.\n \n \" Why? \" Kane screamed at the ceiling. \"Why should you care?\"\n \n \"My masters will be displeased with me if you arrive in a damaged condition.\"\n \n Kane banged his head against a bulkhead; an ugly bruise formed rapidly.\n\"Shtop me, then!\"\n \n \"I can't. My masters created no way for me to restrain or contact you other than use of your language.\"\n \n It took fully fifteen minutes to drag Kane to his sleeping compartment.\n \n After I left Kane in his wife's care, I went to the adjoining room and stretched out on the soft floor beside Verana.\n \n I tried to think of some solution. We were locked in an alien ship at the start of a six months' journey to a strange planet. We had no tools or weapons.\n \n Solution? I doubted if two dozen geniuses working steadily for years could think of one!\n \n I wondered what the alien race was like. Intelligent, surely: They had foreseen our conquest of space flight when we hadn't even invented the wheel. That thought awed me—somehow they had analyzed our brains thousands of years ago and calculated what our future accomplishments would be.\n \n They had been able to predict our scientific development, but they hadn't been able to tell how our civilization would develop. They were curious, so they had left an enormously elaborate piece of bait on the Moon.\n \n The aliens were incredibly more advanced than ourselves. I couldn't help thinking, And to a rabbit in a snare, mankind must seem impossibly clever .\n \n I decided to ask the machine about its makers in the \"morning.\"\n \n \n\n \n When I awoke, my head was throbbing painfully.\n \n I opened my eyes and blinked several times to make sure they were functioning properly. I wasn't in the compartment where I had fallen asleep a few hours before.\n \n I was tied to one of the chairs in the \"kitchen.\" Beside me, Verana was bound to a chair by strips of cloth from her skirt, and across from us, Marie was secured to another chair.\n \n Kane staggered into the room. Although he was visibly drunk, he appeared more sober than the night before. His dark hair was rumpled and his face was flushed, but his eyes gleamed with a growing alertness.\n \n \"Awake, huh?\"\n \n \"What have you done, Harry?\" his wife screamed at him. Her eyes were red with tears and her lips twisted in an expression of shame when she looked at him.\n \n \"Obvious, isn't it? While all of you were asleep, I conked each of you on the head, dragged you in here and tied you up.\" He smiled crookedly.\n\"It's amazing the things a person can do when he's pickled. I'm sorry I had to be so rough, but I have a plan and I knew you wouldn't agree or cooperate with me.\"\n \n \"What's your plan?\" I asked.\n \n He grinned wryly and crinkled bloodshot eyes. \"I don't want to live in a zoo on an alien planet. I want to go home and prove my theory that this problem has a solution.\"\n \n I grunted my disgust.\n \n \"The solution is simple,\" he said. \"We're in a trap so strong that the aliens didn't establish any means to control our actions. When men put a lion in a strong cage, they don't worry about controlling the lion because the lion can't get out. We're in the same basic situation.\"\n \n \"So what?\" Verana queried in a sarcastic tone.\n \n \"The aliens want us transported to their planet so they can examine and question us. Right?\"\n \n \"Right.\"\n \n \"Ed, remember that remark the machine made last night?\"\n \n \"What remark?\"\n \n \"It said, ' My masters will be displeased with me if you arrive in a damaged condition.' What does that indicate to you?\"\n \n \n\n \n I assumed a baffled expression. I didn't have the slightest idea of what he was driving at and I told him so.\n \n \"Ed,\" he said, \"if you could build an electronic brain capable of making decisions, how would you build it?\"\n \n \"Hell, I don't know,\" I confessed.\n \n \"Well, if I could build an electronic brain like the one running this ship, I'd build it with a conscience so it'd do its best at all times.\"\n \n \"Machines always do their best,\" I argued. \"Come on, untie us. I'm getting a crick in my back!\" I didn't like the idea of being slugged while asleep. If Kane had been sober and if his wife hadn't been present, I would have let him know exactly what I thought of him.\n \n \" Our machines always do their best,\" he argued, \"because we punch buttons and they respond in predetermined patterns. But the electronic brain in this ship isn't automatic. It makes decisions and I'll bet it even has to decide how much energy and time to put into each process!\"\n \n \"So what?\"\n \n He shrugged muscular shoulders. \"So this ship is operated by a thinking, conscientious machine. It's the first time I've encountered such a machine, but I think I know what will happen. I spent hours last night figuring—\"\n \n \"What are you talking about?\" I interrupted. \"Are you so drunk that you don't know—\"\n \n \"I'll show you, Ed.\"\n \n He walked around the table and stood behind my chair. I felt his thick fingers around my throat and smelled the alcohol on his breath.\n \n \"Can you see me, machine?\" he asked the empty air.\n \n \"Yes,\" the electronic brain replied.\n \n \"Watch!\"\n \n Kane tightened his fingers around my throat.\n \n Verana and Marie screamed shrilly.\n \n My head seemed to swell like a balloon; my throat gurgled painfully.\n \n \"Please stop,\" the machine pleaded.\n \n \"What will your masters think of you if I kill all of us? You'll return to them with a cargo of dead people!\"\n \n \n\n \n The machine didn't answer. I waited for the electronic brain to interfere and, with a cold knot in my stomach, realized the machine had said it had no way to control our actions!\n \n \"Your purpose won't be fulfilled, will it?\" Kane demanded. \"Not if you return with dead specimens!\"\n \n \"No,\" the machine admitted.\n \n \"If you don't take us back to the Moon,\" Kane threatened, \"I'll kill all of us !\"\n \n The alien electronic brain was silent.\n \n By this time, I couldn't see and Kane's voice was a hollow, faraway thing that rang in my ears. I tugged at my bindings, but they only tightened as I struggled.\n \n \"If you take us back to the Moon, your masters will never know you failed in your mission. They won't know you failed because you won't bring them proof of your failure.\"\n \n My fading consciousness tried to envision the alien mechanical brain as it struggled with the problem.\n \n \"Look at it this way,\" Kane persisted. \"If you carry our corpses to your masters, all your efforts will have been useless. If you return us to the Moon alive, you'll still have a chance to carry out your mission later.\"\n \n A long silence followed. Verana and Marie screamed at Kane to let go. A soft darkness seemed to fill the room, blurring everything, drowning even their shrieks in strangling blackness.\n \n \"You win,\" the machine conceded. \"I'll return the ship to the Moon.\"\n \n Kane released his grip on my throat.\n \n \"See?\" he asked. \"Didn't I tell you every problem has a solution?\"\n \n I didn't answer. I was too busy enjoying breathing again.",
      "metadata": {
        "title": "The Snare",
        "author": "Richard R. Smith",
        "passage_id": "49901",
        "uid": "44ec78124be74f6ea5039623b57d2d77",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "106",
                "uid": "4070fd43fe9c4f17a5ade58f86069d0c",
                "response_text": "Ed, along with his wife Verana, and their friends Kane, Miller and Marie are out for a walk on the surface of the Moon. They live there, working in the lunar city. They come across a spherical object, about 2 miles in diameter. Miller, a mineralogist, declares that the metal must be at least a few thousand years old. A circular door opens, revealing a small room inside. Kane enters the room. The rest of the group decide to join Kane, but as Miller tries to cross the threshold, he is thrown back. The door shuts behind the group and they are trapped inside. The group try to intercom back to Miller, and then radio back to Lunar City, but all they get is static. The group realise that they are flying through outer space. An inner door opens to reveal a passageway. They arrive at a dead end at the end of the passageway. Just then, a door opens to the right of Kane, an invisible force pushing him into a separate room, and locking the entrance behind him. Marie, his wife is lifted up and placed into a separate chamber. Ed and Verana search the corridor, the remaining doors opening for them. The couple wander around the rooms for eating, sleeping, recreation, bathing and an observatory. A few minutes later, they are joined by Marie and Kane. The two relay how they were told that this ship belongs to an Alien race which arrived on Earth thousands of years ago, and wanted to study humans once they gained the ability of space flight. They mean no harm and want to take them to their planet to study them. They are met by the voice of a faceless artificial intelligence controlling the ship. It informs them there is no way to turn it's course around. The group search the rooms for tools for escape, but soon realise that there is nothing. Kane tries to think of a solution to their problem. Kane starts to drink a liquid like whiskey, which makes him intoxicated. Kane begins to beat himself up. The machine tells him to stop, and that if it arrives with a damaged crew, it's masters will be disappointed. The machine informs the crew that it has no way to physically interact with or restrain them. *blank* brings Kane to his bunker and goes back to his wife to go to sleep. They wake up later, all tied to chairs in the \"kitchen\". Kane has knocked them out in their sleep and restrained them. Kane starts to choke Ed, asking the machine what will happen if the ship arrives to the alien world, and all the crew are dead. The machine would have failed its assignment. Kane proposes that if the machine takes them back to the Moon, then the computer will not have failed, and it might have the chance again to pick up a crew. The machine agrees and takes them on a course for the Moon. "
              },
              {
                "worker_id": "101",
                "uid": "2efe2bc15b5c42b98022dd50f84a8e0d",
                "response_text": "Mankind has moved from Earth and lived on the Moon for over a year. One evening, Ed and his wife Verana, along with Miller, Harry Kane and his wife Marie, decide to take a leisurely stroll on the Moon's surface. As they walk along the path, they stumble upon a strange large object, a spherical figure of metal that, according to Kane, an experienced mineralogist, was several thousand years old. As the group examines the object, they notice an opening forming on its surface. Kane climbs through the opening and convinces the rest of the group to follow him. As Miller climbs through the opening, he is suddenly pushed back onto the ground as the opening shuts, locking the four inside the object. They soon lose connection in their intercoms and realize that the static they hear is due to the fact that the object is beginning to move through outer space. Another door opens, revealing a long corridor, and Ed and the group take off their spacesuits, taking in the oxygen. As they reach the end of the corridor, two doors open as Marie and Kane are shoved into separate rooms. Ed and Verana, now alone, walk back down the corridor where six rooms are open, finding strange food, games, and an observatory. Marie returns in a trance, saying that a telepathic voice had reached out to her in the room and searched her memories. Kane walks in shortly after, enraged, explaining that aliens had taken the group captive after planting the object on the Moon as a booby trap; they are to be on the ship for six months and be experimented on as members of the human race. Kane suggests that the group find a way to take control of the ship, when a mysterious voice fills the room, discouraging him. The voice explains that it is a machine located in the ship, and that its masters want to study the group to fulfill their curiosity about humans. After searching the entirety of the rooms open to them, the group gives up, and Ed and Kane meet in the kitchen while their wives are asleep. Kane comes across a bottle of alcohol, and becomes intoxicated, growing increasingly violent. When he punches the wall, the machine asks him not to hurt himself, as its masters do not want the humans to arrive damaged. The next morning, Ed, Verana, and Marie awake tied to chairs in the kitchen, as Kane walks in, still drunk. Kane has a plan to make the machine let the group go; he strangles Ed, causing the machine to plead, and Kane gives the machine an ultimatum: return the group back to the Moon or bring the group to its masters, dead. The machine agrees to return the group to the Moon just before Ed loses consciousness.\n"
              },
              {
                "worker_id": "107",
                "uid": "79ff67302f384d8cb3dfe73d2bd099f8",
                "response_text": "Ed and his crew are traveling across the Mare Serenitatis (Sea of Serenity) on the Moon. They see a smooth metal object protruding from the surface and go closer to investigate. The object looks foreign, and Ed wants to call the Lunar City authorities. However, Kane stops him and says this could be an opportunity to become famous. Ed agrees with Kane’s idea, and Miller explains that the strange object was made thousands of years ago from an even stronger alloy than steel. The crew goes into the steel object through an opening, where Kane tells his wife, Marie, he sees gadgets for controls and weird drawings. Marie climbs through the passage, and Ed helps his wife Verana too. He tries to help Miller through the opening, but an invisible force suddenly pushes Miller out of view. Ed strikes an invisible wall and realizes that the door has closed on them. Suddenly, the lights turn on, and Kane tasks Miller with opening the door from the outside. Miller’s breath disappears soon after, and Ed tries to dial Lunar City but only hears static. They decide to explore the area, and a force suddenly shoves Kane through a door that closes behind him. Only Verana and Ed are left behind. Both of them are scared, and they go through the corridor again to see six open doors. They go into the nearest door and find containers alongside some drawings. Verana recognizes the strange containers as food, and they taste some of it. After exploring, they enter an observatory, where Marie joins them shortly after. She says that something spoke to her telepathically. Kane comes in angrily, and he exclaims that this ship is the booby-trap of a race from another galaxy. The trip is six months long, and a voice suddenly tells them that there is no chance they can bring the ship back to the Moon. The voice is a machine that is part of the ship, and it says that its masters are only curious about humans. The crew does not believe the voice, but they give up after five hours of fruitless searching. Kane gets drunk and has a violent outburst, which causes the machine to plead with him to stop because it will displease its alien masters. The next morning, Ed awakens to him, Marie, and Verana being tied in chairs by Kane. Kane then chokes Ed to show the machine that he is willing to kill everybody on this ship if it does not go back. He bargains with the machine and says that the alien masters will not learn about its failure to deliver live human cargo. The machine agrees to bring them back to the Moon. Kane lets go of Ed’s throat to triumphantly tell him that there is always a solution, while Ed is just happy to breathe again. "
              },
              {
                "worker_id": "105",
                "uid": "b2491cf678924e87a5ff5798ac597229",
                "response_text": "A group of people are walking through a desert on the Moon when they discover a strange object which reminds a part of a sphere. The group decides to explore the object themselves to become wealthy and famous in case it's something important. The party finds a hole and gets inside the sphere. Suddenly, the door closes and leaves Miller, a feeble mineralogist outside. The group tries calling Lunar City but the radio is static as if they were in outer space.Then another door opens revealing a corridor and the party goes there, removing the helmets and breathing normally. Then another door opens and closes after Kane. Marie disappears behind another door in the same way. Ed and Verana are left alone, they are scared, so, when other doors open, Ed walks them both into the nearest one. One room follows another and in the end the couple sits down in an observatory and is soon joined by Marie. The least tells about a telepathic voice searching through her memories and calming her down. When Kane joins, he is angry about being guinea pigs. He explains that they are an experiment for aliens watching Earth develop for thousands of years already. Now the party is trapped and taken to an alien planet for study. While they are discussing the possibility of escape, the ship talks to them and says they can't escape but won't be harmed. It says the aliens are simply curious in examining people. After a full search the group gives up the idea to harm the ship or escape. The women go to sleep and the men are drinking in the kitchen. Ed is calm and curious, while Kane gets even more mad and aggressive than before. Ed drags Kane to the sleeping compartment and leaves with Marie. Ed goes to sleep with his wife. In the night Kane drags all three to the kitchen and ties them to chairs where they wake up. Kane plans to return home by any means and starts tightening his fingers around Ed's throat to make the machine act. After some thinking, the machine decides to return and Kane is proud of his success. "
              }
            ]
          },
          {
            "question_text": "What is the setting of the story",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "106",
                "uid": "4070fd43fe9c4f17a5ade58f86069d0c",
                "response_text": "The story begins on the surface of the Moon. The group revels in its beauty and the clear, star filled sky. They soon enter into the alien spaceship. The opening chamber's walls are filled with drawings and instruments. There are \"Kaleidoscopic\" lights that flash on and off. A small door opens to reveal a narrow passageway. The passageway is lined with eight doors, with no way to open them. Kane and Marie are pulled by some invisible forces into the first two rooms. Ed and Verana first enter into the \"kitchen\". It's a large room with shelves running along its walls, full of multicoloured containers and bottles. There is a table and four backless chairs in the centre, and the floor is a shiny green. There are drawings of a naked man and woman eating from the contents of the boxes. The second room is dedicated to recreation. There are numerous containers filled with alien games and books. There are more simple drawings to use as instructions to go along with them. They enter the sleeping quarters next, where the floors are squishy and the lights are ambient and relaxing. They go into a bathroom, with a large bath, alien toilets and soap. They finally enter an observatory. On one side is floor to ceiling see through, and the room is furnished with comfortable chairs. "
              },
              {
                "worker_id": "101",
                "uid": "2efe2bc15b5c42b98022dd50f84a8e0d",
                "response_text": "The beginning of the story takes place on the Moon's surface, described as a sea of dust and a calm, vast plain. The characters then find a strange object on the Moon, a tall, curved piece of metal. The rest of the story takes place inside this object; first, they find themselves in a strange, small room with walls covered in foreign drawings and lights. Then, they are in a long corridor, where the doors are within the walls without handles. The doors in the corridor open on their own, revealing several different rooms, including a room with colorful boxes of food, a recreational room with games and books, a room with a bathing pool, sleeping quarters, and an observatory with transparent ceilings and walls. The rooms are somewhat recognizable, yet unfamiliar and foreign to the humans."
              },
              {
                "worker_id": "107",
                "uid": "79ff67302f384d8cb3dfe73d2bd099f8",
                "response_text": "The story is initially set on the Moon. The area where Ed and his crew explore consists of a smooth layer of pumice that stretches extremely far. There are also occasional rock islands that go off into the stars above. The Mare Serenitatis also covers three hundred and forty thousand square miles. Lunar City is also on the Moon, and humans have been living there for over a year already. \n\nThe spaceship they board later has a long corridor with multiple rooms. There is a kitchen for food. It is lined with shelves that contain thousands of colored boxes and bottles. The green floor is plastic-like, and at the center, there is a table with four chairs. The chairs have no back and are supported by a single column. As a tutorial, there are drawings on the wall of a man and woman going through the steps of eating. Apart from the food room, there is also a recreation room that has games. All of the instructions are in drawings. The ship also has two sleeping quarters with floors that have a spongy substance and dimly-lit lights. One of the other rooms is similar to a bathroom, with a small bathing pool and running water. Other amenities include yellow soap and a waste-disposal unit. The last room they go to is an observatory. It features transparent walls, a transparent ceiling, and stars that shine outside. There are also comfortable chairs to sit in and observe the stars. \n\n"
              },
              {
                "worker_id": "105",
                "uid": "b2491cf678924e87a5ff5798ac597229",
                "response_text": "The story begins on the surface of the Moon, in a smooth desert made of pumice, under cold and faint stars. In the middle of the desert there is a huge alien sphere. Then the setting moves into the room inside the sphere with weird drawings and gadgets. A narrow corridor opens from there, even there the walls seem alien. The doors in the corridor keep opening and closing by themselves behind people. Ed and Verana find themselves in a large room with a table with chairs and food on the shelves. There are also simple drawings on the walls looking like instructions. The next room is a recreation room with games and books, then there are sleeping quarters, a small pool and the last one is an observatory with a transparent wall. Then the characters move throughout the ship and the rooms described. Eventually, the women go to sleep and the men are talking in the kitchen. Then they go to the dormitories. In the morning everyone is in the kitchen, the rest three bound to chairs by Kane. Some events take place in the kitchen and the ship heads back. "
              }
            ]
          },
          {
            "question_text": "What effect does Kane's violent drinking outburst have on the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "106",
                "uid": "4070fd43fe9c4f17a5ade58f86069d0c",
                "response_text": "Ed and Kane go to the kitchen and start to sample random bottles and foods. Kane finds a brown bottle filled with a strong liquid. The artificial intelligence explains that it is a liquor intended to mimic something like what the alien race presumed would be created on Earth. He starts to drink it and soon becomes intoxicated. He starts to punch himself and then beats his head against the wall. His knuckles become bloody and he gets a bruise on his head. The computer asks him not to hurt himself, as its masters will be disappointed if they arrive in the alien world injured. The computer has no way to physically interfere with the crew. This hatches an idea in Kane's mind. If the computer arrives with a damaged or even dead crew, then the machine will have failed its assignment.  He threatens to kill the entire crew, which would mean that the machine would arrive on the planet empty handed. He offers the machine an alternative. If it drops them back on Mars, then it will not have really failed, because the only way to truly fail would be to arrive with a dead crew. Additionally, if the machine stayed on the Moon's surface, it might have an opportunity to pick up another crew in the future. This plan is all due to a whiskey-like substance. "
              },
              {
                "worker_id": "101",
                "uid": "2efe2bc15b5c42b98022dd50f84a8e0d",
                "response_text": "Kane's violent drinking outburst initially causes him to punch the wall with his fist, causing him to bleed. This causes the machine to respond by pleading with Kane, revealing that its masters ordered it to bring the humans to them unscathed. This revelation about the machine's conditions inspires Kane further, and the next morning, he constructs a plan to get the group off the ship. Still intoxicated, Kane ties up the group, and uses violence against Ed to get the machine to free them. Thus, Kane's outburst, though chaotic and violent, ultimately led to the group's freedom."
              },
              {
                "worker_id": "107",
                "uid": "79ff67302f384d8cb3dfe73d2bd099f8",
                "response_text": "Kane’s violent drinking outburst helps him think of a solution to force the machine to let them go back to the Moon. He initially does not know what to do, but he notices the machine does not want the human passengers getting injured when it desperately tells him to stop beating against the wall. This reaction helps him formulate a plan, and he decides to tie Ed, Verana, and even his wife Marie up. He tries to explain to Ed that the machine is afraid of displeasing its masters, which is why he has found the solution to their problem. His plan, therefore, is to threaten to kill all of them until the machine turns the ship around. He puts it into motion, and it scares the machine enough that it works to convince it to let them go back. "
              },
              {
                "worker_id": "105",
                "uid": "b2491cf678924e87a5ff5798ac597229",
                "response_text": "Due to Kane's drinking outburst the machine agrees to return to the Moon. The situation seems to have no solution, but as promised, Kane finds one. If he wasn't drunk, this wouldn't occur him, he wouldn't have enough determination. But Kane's aggressive nature together with alcohol have made him violent enough to make this scene. The machine is confused and doesn't know what to do, Kane's move is clever and he urges the machine to return. This saves the group from being held on an alien planet but it also scares everyone in the group and puts Ed in danger. This action prevents the group from meeting aliens."
              }
            ]
          },
          {
            "question_text": "What happens to Marie throughout the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "106",
                "uid": "4070fd43fe9c4f17a5ade58f86069d0c",
                "response_text": "Marie is the wife of Kane, the sharp, brash anti-hero of the story. She begins on the walk with the rest of the crew, ending up on the alien spaceship. When Kane is thrown into a separate room from the rest of the crew, Marie throws herself against the door and tries with all her strength to get it to open, until she herself is put in a separate room. The room is dark, and she is touched by a telepathic voice that tells her not to worry. They won't hurt her, and they only want to learn something about her. The voice seems to search through her memories, looking at her high school days. It also looked at human customs and their lives in general. The room must be filled with some sort of happiness gas, because she comes out of it to join the rest of the crew in an airy, relaxed mood that soon wears off. She then searches the ship for a way to break out with the rest of the group but finds nothing. She goes to sleep with Verana. She wakes up to Kane having tied them all up. When Kane is strangling Ed, she screams at him to stop. Eventually though, the computer lets them go home. "
              },
              {
                "worker_id": "101",
                "uid": "2efe2bc15b5c42b98022dd50f84a8e0d",
                "response_text": "Marie is the wife of Harry Kane. She joins Harry, Ed, Miller, and Verana on a walk on the Moon at the beginning of the story. When they encounter the object, she is the second one to enter through its opening, following her husband despite being frightened. Marie and the rest of the group examine the object, walking down its large corridor, when she is suddenly pushed into a room by a mysterious force. Marie is then separated by the group, returning to them later and dizzily explaining how her mind was searched and prodded for memories. Once Marie falls out of her trance and Harry returns, she returns to being frightened and panicking. She rests that night with Verana, and awakes the next morning tied to a chair, where Kane is executing his plan."
              },
              {
                "worker_id": "107",
                "uid": "79ff67302f384d8cb3dfe73d2bd099f8",
                "response_text": "\nMarie is the wife of Harry Kane. She initially follows her husband into the spaceship. Then, after he is pushed into one of the rooms, she floats across the corridor into another room. Marie screams and struggles, but she is taken away regardless. Later, she comes back into the observatory and says a voice spoke to her telepathically when she was in the dark room. She then says that the voice was interested in her memories, especially the high school ones about English and history. However, she could also feel it searching for memories of general life and customs. The voice spoke very nicely to her too, which made her happy and calm. Later, she is frightened again once the machine reveals what is going to happen to them. She cares for Kane after he has his violent outburst but becomes involved in his later plan again. \n\n"
              },
              {
                "worker_id": "105",
                "uid": "b2491cf678924e87a5ff5798ac597229",
                "response_text": "Marie approaches the sphere together with the whole group and follows Kane, her husband, inside. There she is as scared as everyone, passes the corridor, and when a door closes behind her husband she starts beating it violently. Then she floats into another door which shuts behind screaming Marie. In a while she appears in the observatory with a calm face. She tells about a telepathic voice in the dark which calmed her down and searched through her memories. While she listens to her husband's story about the experiment and their future as prisoners on an alien planet, the calm effect disappears and she is filled with terror of dissection, for example. Then she searches the ship together with the rest of the group without effect and goes to sleep. She was frightened all the way. Soon she is joined by her husband in bed. In the morning she finds herself bound to a chair together with Ed and Verana in the kitchen. She is upset and feels shame for her husband, she is also scared of him choking Ed. She asks her husband to let go of Ed. Eventually, she returns to the Moon together with the group. "
              }
            ]
          },
          {
            "question_text": "What are Ed and Verana's relationship to each other?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "106",
                "uid": "4070fd43fe9c4f17a5ade58f86069d0c",
                "response_text": "Ed and Verana are husband and wife. They live together in \"Lunar City, on the Moon, and have for the past year. Together, they're friends with the rest of the group. After Marie climbs into the star ship, Ed asks Verana if she wants to go in. They act as a team, always doing everything together. They are left in the passageway alone after Kane and Marie are taken. Ed holds Verana's hand as they walk down the corridor, a sign of affection. They explore the ship together first, always working together, discovering the meaning of the instructive drawings and the purpose of the different rooms. They sleep together in the same pod. "
              },
              {
                "worker_id": "101",
                "uid": "2efe2bc15b5c42b98022dd50f84a8e0d",
                "response_text": "Ed and Verana are husband and wife; the two have a pleasant dynamic and get along well. Before entering the strange object, the two ask each other if they want to go in, rather than trying to convince the other. When the two are left alone after Marie and Kane are taken into separate rooms, they work together to investigate the rest of the corridor and try to piece together bits of information cooperatively. Ed describes Verana as having an inner calmness and peacefulness, noting that it is a unique aspect of her personality. The two are similar in their rational approaches to the situation. "
              },
              {
                "worker_id": "107",
                "uid": "79ff67302f384d8cb3dfe73d2bd099f8",
                "response_text": "Ed and Verana are married to each other. They get along well, and the two of them often stick together. Verana can stay calm in many situations because of an inner serenity that few people possess. On the other hand, Ed also tries to keep calm in most situations but gets nervous if it is potentially dangerous to him or his wife. When Verana is scared after what happens to Marie in the corridor, he puts his arm around her protectively and holds her close. Ed also knows Verana’s interests very well. He is aware that she is part of a group researching extra-sensory perception, and she most likely would have loved the opportunity to experience what Marie had."
              },
              {
                "worker_id": "105",
                "uid": "b2491cf678924e87a5ff5798ac597229",
                "response_text": "Ed and Verana are married. They go side by side through the sphere, hesitating for a second before entry but making this decision together. When they are left alone in the corridor, Ed sees her fear and holds her close. Ed is also scared but he takes charge of the situation to lead his wife, and when other doors open the couple enters together. They follow each other through the rooms and each one does the same actions as another. Ed remembers about Verana's interest in extra-sensory perception and even wonders sarcastically if she is disappointed about not being contacted. The two are relatively calm and secure, they understand that nothing can be done and agree to it. Verana thinks logically and with inner serenity, Ed appreciates it and feels calm and resigned. They are similar and therefore make up a stable couple. Verana is scared for her husband when Kane is choking it as a normal wife would be, but overall the couple is as calm as possible. Moreover, both are rather interested in the aliens and support each other all the way, their couple is harmonious, especially on the contrast."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4857,
        "document_length_chars": 28268
      }
    }
  ]
}