{
  "item_metadata": {
    "item_id": "50441",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "50441",
      "content": "MASTER of Life and Death\n \n\n \n by ROBERT SILVERBERG\n \n ACE BOOKS A Division of A. A. Wyn, Inc. 23 West 47th Street, New York 36, N. Y.\n \n MASTER OF LIFE AND DEATH\n \n Copyright 1957, by A. A. Wyn, Inc. All Rights Reserved\n \n For Antigone— Who Thinks We're Property\n \n Printed in U.S.A.\n \n [Transcriber's Note: Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n THE MAN WHO RATIONED BABIES\n \n By the 23rd century Earth's population had reached seven billion. Mankind was in danger of perishing for lack of elbow room—unless prompt measures were taken. Roy Walton had the power to enforce those measures. But though his job was in the service of humanity, he soon found himself the most hated man in the world.\n \n For it was his job to tell parents their children were unfit to live; he had to uproot people from their homes and send them to remote areas of the world. Now, threatened by mobs of outraged citizens, denounced and blackened by the press, Roy Walton had to make a decision: resign his post, or use his power to destroy his enemies, become a dictator in the hopes of saving humanity from its own folly. In other words, should he become the MASTER OF LIFE AND DEATH?\n \n \n\n CAST OF CHARACTERS\n \n \n ROY WALTON\n \n \n He had to adopt the motto— the ends justify the means .\n \n \n FITZMAUGHAM\n \n \n His reward for devoted service was—an assassin's bullet.\n \n \n FRED WALTON\n \n \n His ambition was to fill his brother's shoes—but he underestimated their size.\n \n \n LEE PERCY\n \n \n His specialty was sugarcoating bitter pills.\n \n \n PRIOR\n \n \n With the pen as his only weapon, could he save his son?\n \n \n DR. LAMARRE\n \n \n He died for discovering the secret of immortality.\n \n \n\n Contents\n \n \n\n I\n \n \n The offices of the Bureau of Population Equalization, vulgarly known as Popeek, were located on the twentieth through twenty-ninth floors of the Cullen Building, a hundred-story monstrosity typical of twenty-second-century neo-Victorian at its overdecorated worst. Roy Walton, Popeek's assistant administrator, had to apologize to himself each morning as he entered the hideous place.\n \n Since taking the job, he had managed to redecorate his own office—on the twenty-eighth floor, immediately below Director FitzMaugham's—but that had created only one minor oasis in the esthetically repugnant building. It couldn't be helped, though; Popeek was unpopular, though necessary; and, like the public hangman of some centuries earlier, the Bureau did not rate attractive quarters.\n \n So Walton had removed some of the iridescent chrome scalloping that trimmed the walls, replaced the sash windows with opaquers, and changed the massive ceiling fixture to more subtle electroluminescents. But the mark of the last century was stamped irrevocably on both building and office.\n \n Which was as it should be, Walton had finally realized. It was the last century's foolishness that had made Popeek necessary, after all.\n \n His desk was piled high with reports, and more kept arriving via pneumochute every minute. The job of assistant administrator was a thankless one, he thought; as much responsibility as Director FitzMaugham, and half the pay.\n \n He lifted a report from one eyebrow-high stack, smoothed the crinkly paper carefully, and read it.\n \n It was a despatch from Horrocks, the Popeek agent currently on duty in Patagonia. It was dated 4 June 2232 , six days before, and after a long and rambling prologue in the usual Horrocks manner it went on to say, Population density remains low here: 17.3 per square mile, far below optimum. Looks like a prime candidate for equalization.\n \n \n Walton agreed. He reached for his voicewrite and said sharply, \"Memo from Assistant Administrator Walton, re equalization of ...\" He paused, picking a trouble-spot at random, \"... central Belgium. Will the section chief in charge of this area please consider the advisability of transferring population excess to fertile areas in Patagonia? Recommendation: establishment of industries in latter region, to ease transition.\"\n \n He shut his eyes, dug his thumbs into them until bright flares of light shot across his eyeballs, and refused to let himself be bothered by the multiple problems involved in dumping several hundred thousand Belgians into Patagonia. He forced himself to cling to one of Director FitzMaugham's oft-repeated maxims, If you want to stay sane, think of these people as pawns in a chess game—not as human beings.\n \n \n Walton sighed. This was the biggest chess problem in the history of humanity, and the way it looked now, all the solutions led to checkmate in a century or less. They could keep equalizing population only so long, shifting like loggers riding logs in a rushing river, before trouble came.\n \n There was another matter to be attended to now. He picked up the voicewrite again. \"Memo from the assistant administrator, re establishment of new policy on reports from local agents: hire a staff of three clever girls to make a précis of each report, eliminating irrelevant data.\"\n \n It was a basic step, one that should have been taken long ago. Now, with three feet of reports stacked on his desk, it was mandatory. One of the troubles with Popeek was its newness; it had been established so suddenly that most of its procedures were still in the formative stage.\n \n He took another report from the heap. This one was the data sheet of the Zurich Euthanasia Center, and he gave it a cursory scanning. During the past week, eleven substandard children and twenty-three substandard adults had been sent on to Happysleep.\n \n That was the grimmest form of population equalization. Walton initialed the report, earmarked it for files, and dumped it in the pneumochute.\n \n The annunciator chimed.\n \n \"I'm busy,\" Walton said immediately.\n \n \"There's a Mr. Prior to see you,\" the annunciator's calm voice said.\n\"He insists it's an emergency.\"\n \n \"Tell Mr. Prior I can't see anyone for at least three hours.\" Walton stared gloomily at the growing pile of paper on his desk. \"Tell him he can have ten minutes with me at—oh, say, 1300.\"\n \n Walton heard an angry male voice muttering something in the outer office, and then the annunciator said, \"He insists he must see you immediately in reference to a Happysleep commitment.\"\n \n \"Commitments are irrevocable,\" Walton said heavily. The last thing in the world he wanted was to see a man whose child or parent had just been committed. \"Tell Mr. Prior I can't see him at all.\"\n \n Walton found his fingers trembling; he clamped them tight to the edge of his desk to steady himself. It was all right sitting up here in this ugly building and initialing commitment papers, but actually to see one of those people and try to convince him of the need—\n \n The door burst open.\n \n A tall, dark-haired man in an open jacket came rushing through and paused dramatically just over the threshold. Immediately behind him came three unsmiling men in the gray silk-sheen uniforms of security. They carried drawn needlers.\n \n \"Are you Administrator Walton?\" the big man asked, in an astonishingly deep, rich voice. \"I have to see you. I'm Lyle Prior.\"\n \n The three security men caught up and swarmed all over Prior. One of them turned apologetically to Walton. \"We're terribly sorry about this, sir. He just broke away and ran. We can't understand how he got in here, but he did.\"\n \n \"Ah—yes. So I noticed,\" Walton remarked drily. \"See if he's planning to assassinate anybody, will you?\"\n \n \"Administrator Walton!\" Prior protested. \"I'm a man of peace! How can you accuse me of—\"\n \n One of the security men hit him. Walton stiffened and resisted the urge to reprimand the man. He was only doing his job, after all.\n \n \"Search him,\" Walton said.\n \n They gave Prior an efficient going-over. \"He's clean, Mr. Walton. Should we take him to security, or downstairs to health?\"\n \n \"Neither. Leave him here with me.\"\n \n \"Are you sure you—\"\n \n \"Get out of here,\" Walton snapped. As the three security men slinked away, he added, \"And figure out some more efficient system for protecting me. Some day an assassin is going to sneak through here and get me. Not that I give a damn about myself, you understand; it's simply that I'm indispensable. There isn't another lunatic in the world who'd take this job. Now get out !\"\n \n They wasted no time in leaving. Walton waited until the door closed and jammed down hard on the lockstud. His tirade, he knew, was wholly unjustified; if he had remembered to lock his door as regulations prescribed, Prior would never have broken in. But he couldn't admit that to the guards.\n \n \"Take a seat, Mr. Prior.\"\n \n \"I have to thank you for granting me this audience,\" Prior said, without a hint of sarcasm in his booming voice. \"I realize you're a terribly busy man.\"\n \n \"I am.\" Another three inches of paper had deposited itself on Walton's desk since Prior had entered. \"You're very lucky to have hit the psychological moment for your entrance. At any other time I'd have had you brigged for a month, but just now I'm in need of a little diversion. Besides, I very much admire your work, Mr. Prior.\"\n \n \"Thank you.\" Again that humility, startling in so big and commanding a man. \"I hadn't expected to find—I mean that you—\"\n \n \"That a bureaucrat should admire poetry? Is that what you're groping for?\"\n \n Prior reddened. \"Yes,\" he admitted.\n \n Grinning, Walton said, \"I have to do something when I go home at night. I don't really read Popeek reports twenty-four hours a day. No more than twenty; that's my rule. I thought your last book was quite remarkable.\"\n \n \"The critics didn't,\" Prior said diffidently.\n \n \"Critics! What do they know?\" Walton demanded. \"They swing in cycles. Ten years ago it was form and technique, and you got the Melling Prize. Now it's message, political content that counts. That's not poetry, Mr. Prior—and there are still a few of us who recognize what poetry is. Take Yeats, for instance—\"\n \n Walton was ready to launch into a discussion of every poet from Prior back to Surrey and Wyatt; anything to keep from the job at hand, anything to keep his mind from Popeek. But Prior interrupted him.\n \n \"Mr. Walton....\"\n \n \"Yes?\"\n \n \"My son Philip ... he's two weeks old now....\"\n \n Walton understood. \"No, Prior. Please don't ask.\" Walton's skin felt cold; his hands, tightly clenched, were clammy.\n \n \"He was committed to Happysleep this morning—potentially tubercular. The boy's perfectly sound, Mr. Walton. Couldn't you—\"\n \n Walton rose. \" No ,\" he said, half-commanding, half-pleading. \"Don't ask me to do it. I can't make any exceptions, not even for you. You're an intelligent man; you understand our program.\"\n \n \"I voted for Popeek. I know all about Weeding the Garden and the Euthanasia Plan. But I hadn't expected—\"\n \n \"You thought euthanasia was a fine thing for other people. So did everyone else,\" Walton said. \"That's how the act was passed.\" Tenderly he said, \"I can't do it. I can't spare your son. Our doctors give a baby every chance to live.\"\n \n \" I was tubercular. They cured me. What if they had practiced euthanasia a generation ago? Where would my poems be now?\"\n \n It was an unanswerable question; Walton tried to ignore it.\n\"Tuberculosis is an extremely rare disease, Mr. Prior. We can wipe it out completely if we strike at those with TB-susceptible genetic traits.\"\n \n \"Meaning you'll kill any children I have?\" Prior asked.\n \n \"Those who inherit your condition,\" Walton said gently. \"Go home, Mr. Prior. Burn me in effigy. Write a poem about me. But don't ask me to do the impossible. I can't catch any falling stars for you.\"\n \n Prior rose. He was immense, a hulking tragic figure staring broodingly at Walton. For the first time since the poet's abrupt entry, Walton feared violence. His fingers groped for the needle gun he kept in his upper left desk drawer.\n \n But Prior had no violence in him. \"I'll leave you,\" he said somberly.\n\"I'm sorry, sir. Deeply sorry. For both of us.\"\n \n Walton pressed the doorlock to let him out, then locked it again and slipped heavily into his chair. Three more reports slid out of the chute and landed on his desk. He stared at them as if they were three basilisks.\n \n In the six weeks of Popeek's existence, three thousand babies had been ticketed for Happysleep, and three thousand sets of degenerate genes had been wiped from the race. Ten thousand subnormal males had been sterilized. Eight thousand dying oldsters had reached their graves ahead of time.\n \n It was a tough-minded program. But why transmit palsy to unborn generations? Why let an adult idiot litter the world with subnormal progeny? Why force a man hopelessly cancerous to linger on in pain, consuming precious food?\n \n Unpleasant? Sure. But the world had voted for it. Until Lang and his team succeeded in terraforming Venus, or until the faster-than-light outfit opened the stars to mankind, something had to be done about Earth's overpopulation. There were seven billion now and the figure was still growing.\n \n Prior's words haunted him. I was tubercular ... where would my poems be now?\n \n \n The big humble man was one of the great poets. Keats had been tubercular too.\n  What good are poets? he asked himself savagely.\n \n The reply came swiftly: What good is anything, then? Keats, Shakespeare, Eliot, Yeats, Donne, Pound, Matthews ... and Prior. How much duller life would be without them, Walton thought, picturing his bookshelf—his one bookshelf, in his crowded little cubicle of a one-room home.\n \n Sweat poured down his back as he groped toward his decision.\n \n The step he was considering would disqualify him from his job if he admitted it, though he wouldn't do that. Under the Equalization Law, it would be a criminal act.\n \n But just one baby wouldn't matter. Just one.\n \n Prior's baby.\n \n With nervous fingers he switched on the annunciator and said, \"If there are any calls for me, take the message. I'll be out of my office for the next half-hour.\"\n \n \n\n II\n \n \n He stepped out of the office, glancing around furtively. The outer office was busy: half a dozen girls were answering calls, opening letters, coordinating activities. Walton slipped quickly past them into the hallway.\n \n There was a knot of fear in his stomach as he turned toward the lift tube. Six weeks of pressure, six weeks of tension since Popeek was organized and old man FitzMaugham had tapped him for the second-in-command post ... and now, a rebellion. The sparing of a single child was a small rebellion, true, but he knew he was striking as effectively at the base of Popeek this way as if he had brought about repeal of the entire Equalization Law.\n \n Well, just one lapse, he promised himself. I'll spare Prior's child, and after that I'll keep within the law.\n \n He jabbed the lift tube indicator and the tube rose in its shaft. The clinic was on the twentieth floor.\n \n \"Roy.\"\n \n At the sound of the quiet voice behind him, Walton jumped in surprise. He steadied himself, forcing himself to turn slowly. The director stood there.\n \n \"Good morning, Mr. FitzMaugham.\"\n \n The old man was smiling serenely, his unlined face warm and friendly, his mop of white hair bright and full. \"You look preoccupied, boy. Something the matter?\"\n \n Walton shook his head quickly. \"Just a little tired, sir. There's been a lot of work lately.\"\n \n As he said it, he knew how foolish it sounded. If anyone in Popeek worked harder than he did, it was the elderly director. FitzMaugham had striven for equalization legislature for fifty years, and now, at the age of eighty, he put in a sixteen-hour day at the task of saving mankind from itself.\n \n The director smiled. \"You never did learn how to budget your strength, Roy. You'll be a worn-out wreck before you're half my age. I'm glad you're adopting my habit of taking a coffee break in the morning, though. Mind if I join you?\"\n \n \"I'm—not taking a break, sir. I have some work to do downstairs.\"\n \n \"Oh? Can't you take care of it by phone?\"\n \n \"No, Mr. FitzMaugham.\" Walton felt as though he'd already been tried, drawn, and quartered. \"It requires personal attention.\"\n \n \"I see.\" The deep, warm eyes bored into his. \"You ought to slow down a little, I think.\"\n \n \"Yes, sir. As soon as the work eases up a little.\"\n \n FitzMaugham chuckled. \"In another century or two, you mean. I'm afraid you'll never learn how to relax, my boy.\"\n \n The lift tube arrived. Walton stepped to one side, allowed the Director to enter, and got in himself. FitzMaugham pushed Fourteen ; there was a coffee shop down there. Hesitantly, Walton pushed twenty , covering the panel with his arm so the old man would be unable to see his destination.\n \n As the tube began to descend, FitzMaugham said, \"Did Mr. Prior come to see you this morning?\"\n \n \"Yes,\" Walton said.\n \n \"He's the poet, isn't he? The one you say is so good?\"\n \n \"That's right, sir,\" Walton said tightly.\n \n \"He came to see me first, but I had him referred down to you. What was on his mind?\"\n \n Walton hesitated. \"He—he wanted his son spared from Happysleep. Naturally, I had to turn him down.\"\n \n \"Naturally,\" FitzMaugham agreed solemnly. \"Once we make even one exception, the whole framework crumbles.\"\n \n \"Of course, sir.\"\n \n The lift tube halted and rocked on its suspension. The door slid back, revealing a neat, gleaming sign:\n \n  FLOOR 20  Euthanasia Clinic and Files\n \n \n Walton had forgotten the accursed sign. He began to wish he had avoided traveling down with the director. He felt that his purpose must seem nakedly obvious now.\n \n The old man's eyes were twinkling amusedly. \"I guess you get off here,\" he said. \"I hope you catch up with your work soon, Roy. You really should take some time off for relaxation each day.\"\n \n \"I'll try, sir.\"\n \n Walton stepped out of the tube and returned FitzMaugham's smile as the door closed again. Bitter thoughts assailed him as soon as he was alone.\n  Some fine criminal you are. You've given the show away already! And damn that smooth paternal smile. FitzMaugham knows! He must know!\n \n \n Walton wavered, then abruptly made his decision. He sucked in a deep breath and walked briskly toward the big room where the euthanasia files were kept.\n \n \n\n \n The room was large, as rooms went nowadays—thirty by twenty, with deck upon deck of Donnerson micro-memory-tubes racked along one wall and a bank of microfilm records along the other. In six weeks of life Popeek had piled up an impressive collection of data.\n \n While he stood there, the computer chattered, lights flashed. New facts poured into the memory banks. It probably went on day and night.\n \n \"Can I help—oh, it's you, Mr. Walton,\" a white-smocked technician said. Popeek employed a small army of technicians, each one faceless and without personality, but always ready to serve. \"Is there anything I can do?\"\n \n \"I'm simply running a routine checkup. Mind if I use the machine?\"\n \n \"Not at all, sir. Go right ahead.\"\n \n Walton grinned lightly and stepped forward. The technician practically backed out of his presence.\n  No doubt I must radiate charisma , he thought. Within the building he wore a sort of luminous halo, by virtue of being Director FitzMaugham's protégé and second-in-command. Outside, in the colder reality of the crowded metropolis, he kept his identity and Popeek rank quietly to himself.\n \n Frowning, he tried to remember the Prior boy's name. Ah ... Philip, wasn't it? He punched out a request for the card on Philip Prior.\n \n A moment's pause followed, while the millions of tiny cryotronic circuits raced with information pulses, searching the Donnerson tubes for Philip Prior's record. Then, a brief squeaking sound and a yellow-brown card dropped out of the slot:\n  3216847AB1\n \n  PRIOR, Philip Hugh. Born 31 May 2232, New York General Hospital, New York. First son of Prior, Lyle Martin and Prior, Ava Leonard. Wgt. at birth 5lb. 3oz.\n \n \n An elaborate description of the boy in great detail followed, ending with blood type, agglutinating characteristic, and gene-pattern, codified. Walton skipped impatiently through that and came to the notification typed in curt, impersonal green capital letters at the bottom of the card:\n \n  EXAMINED AT N Y EUTH CLINIC 10 JUNE 2332  EUTHANASIA RECOMMENDED\n \n \n He glanced at his watch: the time was 1026. The boy was probably still somewhere in the clinic lab, waiting for the figurative axe to descend.\n \n Walton had set up the schedule himself: the gas chamber delivered Happysleep each day at 1100 and 1500. He had about half an hour to save Philip Prior.\n \n He peered covertly over his shoulder; no one was in sight. He slipped the baby's card into his breast pocket.\n \n That done, he typed out a requisition for explanation of the gene-sorting code the clinic used. Symbols began pouring forth, and Walton puzzledly correlated them with the line of gibberish on Phillip Prior's record card. Finally he found the one he wanted: 3f2, tubercular-prone .\n \n He scrapped the guide sheet he had and typed out a message to the machine. Revision of card number 3216847AB1 follows. Please alter in all circuits.\n \n \n He proceeded to retype the child's card, omitting both the fatal symbol 3f2 and the notation recommending euthanasia from the new version. The machine beeped an acknowledgement. Walton smiled. So far, so good.\n \n Then, he requested the boy's file all over again. After the customary pause, a card numbered 3216847AB1 dropped out of the slot. He read it.\n \n The deletions had been made. As far as the machine was concerned, Philip Prior was a normal, healthy baby.\n \n He glanced at his watch. 1037. Still twenty-three minutes before this morning's haul of unfortunates was put away.\n \n Now came the real test: could he pry the baby away from the doctors without attracting too much attention to himself in the process?\n \n \n\n \n Five doctors were bustling back and forth as Walton entered the main section of the clinic. There must have been a hundred babies there, each in a little pen of its own, and the doctors were humming from one to the next, while anxious parents watched from screens above.\n \n The Equalization Law provided that every child be presented at its local clinic within two weeks of birth, for an examination and a certificate. Perhaps one in ten thousand would be denied a certificate ... and life.\n \n \"Hello, Mr. Walton. What brings you down here?\"\n \n Walton smiled affably. \"Just a routine investigation, Doctor. I try to keep in touch with every department we have, you know.\"\n \n \"Mr. FitzMaugham was down here to look around a little while ago. We're really getting a going-over today, Mr. Walton!\"\n \n \"Umm. Yes.\" Walton didn't like that, but there was nothing he could do about it. He'd have to rely on the old man's abiding faith in his protégé to pull him out of any possible stickiness that arose.\n \n \"Seen my brother around?\" he asked.\n \n \"Fred? He's working in room seven, running analyses. Want me to get him for you, Mr. Walton?\"\n \n \"No—no, don't bother him, thanks. I'll find him later.\" Inwardly, Walton felt relieved. Fred Walton, his younger brother, was a doctor in the employ of Popeek. Little love was lost between the brothers, and Roy did not care to have Fred know he was down there.\n \n Strolling casually through the clinic, he peered at a few plump, squalling babies, and said, \"Find many sour ones today?\"\n \n \"Seven so far. They're scheduled for the 1100 chamber. Three tuberc, two blind, one congenital syph.\"\n \n \"That only makes six,\" Walton said.\n \n \"Oh, and a spastic,\" the doctor said. \"Biggest haul we've had yet. Seven in one morning.\"\n \n \"Have any trouble with the parents?\"\n \n \"What do you think?\" the doctor asked. \"But some of them seemed to understand. One of the tuberculars nearly raised the roof, though.\"\n \n Walton shuddered. \"You remember his name?\" he asked, with feigned calm.\n \n Silence for a moment. \"No. Darned if I can think of it. I can look it up for you if you like.\"\n \n \"Don't bother,\" Walton said hurriedly.\n \n He moved on, down the winding corridor that led to the execution chamber. Falbrough, the executioner, was studying a list of names at his desk when Walton appeared.\n \n Falbrough didn't look like the sort of man who would enjoy his work. He was short and plump, with a high-domed bald head and glittering contact lenses in his weak blue eyes. \"Morning, Mr. Walton.\"\n \n \"Good morning, Doctor Falbrough. You'll be operating soon, won't you?\"\n \n \"Eleven hundred, as usual.\"\n \n \"Good. There's a new regulation in effect from now on,\" Walton said.\n\"To keep public opinion on our side.\"\n \n \"Sir?\"\n \n \"Henceforth, until further notice, you're to check each baby that comes to you against the main file, just to make sure there's been no mistake. Got that?\"\n \n \" Mistake? But how—\"\n \n \"Never mind that, Falbrough. There was quite a tragic slip-up at one of the European centers yesterday. We may all hang for it if news gets out.\" How glibly I reel this stuff off , Walton thought in amazement.\n \n Falbrough looked grave. \"I see, sir. Of course. We'll double-check everything from now on.\"\n \n \"Good. Begin with the 1100 batch.\"\n \n Walton couldn't bear to remain down in the clinic any longer. He left via a side exit, and signaled for a lift tube.\n \n Minutes later he was back in his office, behind the security of a towering stack of work. His pulse was racing; his throat was dry. He remembered what FitzMaugham had said: Once we make even one exception, the whole framework crumbles.\n \n \n Well, the framework had begun crumbling, then. And there was little doubt in Walton's mind that FitzMaugham knew or would soon know what he had done. He would have to cover his traces, somehow.\n \n The annunciator chimed and said, \"Dr. Falbrough of Happysleep calling you, sir.\"\n \n \"Put him on.\"\n \n The screen lit and Falbrough's face appeared; its normal blandness had given way to wild-eyed tenseness.\n \n \"What is it, Doctor?\"\n \n \"It's a good thing you issued that order when you did, sir! You'll never guess what just happened—\"\n \n \"No guessing games, Falbrough. Speak up.\"\n \n \"I—well, sir, I ran checks on the seven babies they sent me this morning. And guess—I mean—well, one of them shouldn't have been sent to me!\"\n \n \"No!\"\n \n \"It's the truth, sir. A cute little baby indeed. I've got his card right here. The boy's name is Philip Prior, and his gene-pattern is fine.\"\n \n \"Any recommendation for euthanasia on the card?\" Walton asked.\n \n \"No, sir.\"\n \n Walton chewed at a ragged cuticle for a moment, counterfeiting great anxiety. \"Falbrough, we're going to have to keep this very quiet. Someone slipped up in the examining room, and if word gets out that there's been as much as one mistake, we'll have a mob swarming over us in half an hour.\"\n \n \"Yes, sir.\" Falbrough looked terribly grave. \"What should I do, sir?\"\n \n \"Don't say a word about this to anyone , not even the men in the examining room. Fill out a certificate for the boy, find his parents, apologize and return him to them. And make sure you keep checking for any future cases of this sort.\"\n \n \"Certainly, sir. Is that all?\"\n \n \"It is,\" Walton said crisply, and broke the contact. He took a deep breath and stared bleakly at the far wall.\n \n The Prior boy was safe. And in the eyes of the law—the Equalization Law—Roy Walton was now a criminal. He was every bit as much a criminal as the man who tried to hide his dying father from the investigators, or the anxious parents who attempted to bribe an examining doctor.\n \n He felt curiously dirty. And, now that he had betrayed FitzMaugham and the Cause, now that it was done, he had little idea why he had done it, why he had jeopardized the Popeek program, his position—his life, even—for the sake of one potentially tubercular baby.\n \n Well, the thing was done.\n \n No. Not quite. Later, when things had quieted down, he would have to finish the job by transferring all the men in the clinic to distant places and by obliterating the computer's memories of this morning's activities.\n \n The annunciator chimed again. \"Your brother is on the wire, sir.\"\n \n Walton trembled imperceptibly as he said, \"Put him on.\" Somehow, Fred never called unless he could say or do something unpleasant. And Walton was very much afraid that his brother meant no good by this call. No good at all.\n \n \n\n III\n \n \n Roy Walton watched his brother's head and shoulders take form out of the swirl of colors on the screen. Fred Walton was more compact, built closer to the ground than his rangy brother; he was a squat five-seven, next to Roy's lean six-two. Fred had always threatened to \"get even\" with his older brother as soon as they were the same size, but to Fred's great dismay he had never managed to catch up with Roy in height.\n \n Even on the screen, Fred's neck and shoulders gave an impression of tremendous solidity and force. Walton waited for his brother's image to take shape, and when the time lag was over he said, \"Well, Fred? What goes?\"\n \n His brother's eyes flickered sleepily. \"They tell me you were down here a little while ago, Roy. How come I didn't rate a visit?\"\n \n \"I wasn't in your section. It was official business, anyway. I didn't have time.\"\n \n Walton fixed his eyes sharply on the caduceus emblem gleaming on Fred's lapel, and refused to look anywhere else.\n \n Fred said slowly, \"You had time to tinker with our computer, though.\"\n \n \"Official business!\"\n \n \"Really, Roy?\" His brother's tone was venomous. \"I happened to be using the computer shortly after you this morning. I was curious—unpardonably so, dear brother. I requested a transcript of your conversation with the machine.\"\n \n Sparks seemed to flow from the screen. Walton sat back, feeling numb. He managed to pull his sagging mouth back into a stiff hard line and say, \"That's a criminal offense, Fred. Any use I make of a Popeek computer outlet is confidential.\"\n \n \"Criminal offence? Maybe so ... but that makes two of us, then. Eh, Roy?\"\n \n \"How much do you know?\"\n \n \"You wouldn't want me to recite it over a public communications system, would you? Your friend FitzMaugham might be listening to every word of this, and I have too much fraternal feeling for that. Ole Doc Walton doesn't want to get his bigwig big brother in trouble—oh, no!\"\n \n \"Thanks for small blessings,\" Roy said acidly.\n \n \"You got me this job. You can take it away. Let's call it even for now, shall we?\"\n \n \"Anything you like,\" Walton said. He was drenched in sweat, though the ingenious executive filter in the sending apparatus of the screen cloaked that fact and presented him as neat and fresh. \"I have some work to do now.\" His voice was barely audible.\n \n \"I won't keep you any longer, then,\" Fred said.\n \n The screen went dead.\n \n Walton killed the contact at his end, got up, walked to the window. He nudged the opaquer control and the frosty white haze over the glass cleared away, revealing the fantastic beehive of the city outside.\n  Idiot! he thought. Fool!\n \n \n He had risked everything to save one baby, one child probably doomed to an early death anyway. And FitzMaugham knew—the old man could see through Walton with ease—and Fred knew, too. His brother, and his father-substitute.\n \n FitzMaugham might well choose to conceal Roy's defection this time, but would surely place less trust in him in the future. And as for Fred....\n \n There was no telling what Fred might do. They had never been particularly close as brothers; they had lived with their parents (now almost totally forgotten) until Roy was nine and Fred seven. Their parents had gone down off Maracaibo in a jet crash; Roy and Fred had been sent to the public crèche.\n \n After that it had been separate paths for the brothers. For Roy, an education in the law, a short spell as Senator FitzMaugham's private secretary, followed last month by his sudden elevation to assistant administrator of the newly-created Popeek Bureau. For Fred, medicine, unsuccessful private practice, finally a job in the Happysleep section of Popeek, thanks to Roy.",
      "metadata": {
        "title": "Master of Life and Death",
        "author": "Robert Silverberg",
        "passage_id": "50441",
        "uid": "d836656050f440b8848a7e8c6451b5ef",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "6",
                "uid": "f91234681ca74562884a1feeafd5278c",
                "response_text": "Roy Walton is the Assistant Administrator of the Bureau of Population Equalization, otherwise known as Popeek. In the six weeks that they have been working, thousands of people have been euthanized, sterilized, and relocated in order to curb population growth and overcrowding. Roy Walton arrives at his desk, filled with papers, and settles into his miserable job. He asks for a relocation of the people of central Belgium to Patagonia before his receptionist alerts him Mr. Prior is here to see him. He refuses, but Mr. Prior sneaks through security and the unlocked door–Walton’s fault–and demands his attention. He is a famous poet, one Walton admires. He asks Walton to save his son who is to be euthanized for being tubercular. Walton turns him down, but after Prior leaves, his words swim in his head. He realizes he wants to save his baby, and so he sets off to do just that. He runs into his boss, Director FitzMaugham in the elevator and tries to lie his way through the encounter. He narrowly succeeds but is left with the feeling that Director FitzMaughan knew more than he was letting on. Walton gets off at the 20th floor and breezes past the receptionist to input Philp Porter into the computer. A series of cards come out, detailing all the baby’s specifics as well as the tubercular diagnosis. He deletes the cause for euthanization and inputs the new data into the system. He comes back clear. \nHoping no one saw him, he walks down past the hall of babies and chats with the doctor, asking where his brother, another doctor, is. Evidently, his brother is running analytics, so Walton is safe for now. He speaks with the executioner, Falbrough, and tells him to double-check every baby before euthanization, due to an unfortunate incident in Europe. Falbrough agrees, and Walton quickly slips back upstairs to his office. Worrying about his actions that day, Walton gets a call from Falbrough informing him that there was a mistake, and they saved a baby’s life that day. Walton tells him to keep it under wraps, and he quickly hangs up. Walton has now committed a felony, and he’s wondering what the long-term effects will be. His brother, Fred, calls him and tells him that he knows what he did. By accessing confidential information (a crime in and of itself), Fred knows that Roy saved that baby’s life illegally. He holds it over his head and asks for a favor in return, as well as silence on Roy’s end. The story ends with Roy’s fate up in the air as well as the fate of the new world order. \n"
              },
              {
                "worker_id": "2",
                "uid": "20fcaec869bb48d89dc5cfbf67625c65",
                "response_text": "In the 23rd century, Earth is overpopulated with 7 billion people. Until Venus terraforming is up and running and travel to stars is feasible, the world’s citizens have approved Weeding the Garden and the Euthanasia plan to remove substandard people from society. The Bureau of Population Equalization is working to distribute the population more evenly, removing people from overpopulated areas and resettling them in sparsely populated areas. Roy Walton is the assistant administrator of the Bureau and makes decisions about moving groups of people.  While these decisions bother him, he tries to follow the director’s maxim: to stay sane, he must think of the people as pawns, not human beings. In his office, facing three-foot mounds of paperwork, Roy can disassociate himself from the humans whose lives he is impacting.\n\tSuddenly, however, he is asked to meet with a Mr. Prior, whose two-week-old son is scheduled for euthanasia (Happysleep). He refuses to see Prior because these decisions are irrevocable, but Prior makes his way into Roy’s office anyway, and Roy recognizes him as a famous poet whose work he admires. Prior informs Roy that his son is committed to Happysleep because he is potentially tubercular; Prior informs Roy that he was tubercular as a child but was cured. And he reminds Roy that if euthanasia had been practiced a generation ago, his poetry wouldn’t exist. Roy tells Prior he cannot help him, but after Prior leaves, Roy is haunted. \n\tRoy decides to save Prior’s baby, convincing himself that saving one child won’t break the system, and makes his way to the euthanasia department. He takes the lift tube where he meets the director, who invites Roy to have a coffee break with him and asks if Mr. Prior met with Roy. The director says Prior tried to see him but that he referred him to Roy. When Roy turns down the coffee break and exits the lift on the euthanasia floor, he is sure the director knows what he is doing. Roy pulls the information on the baby and rewrites it, omitting the 3f2 designation: tubercular-prone. Roy also notifies the euthanasia doctor of a new policy, effective immediately, of checking the computer records for all babies before euthanasia due to a tragic error in Europe yesterday.\n\tRoy returns to his office and receives two significant phone calls. First, the euthanasia doctor for babies contacts him to let him know one baby scheduled for Happysleep that morning was indeed not due for it. The second call is from his brother, who works in the euthanasia department. When he learned that Roy had used the computer earlier and of the “mistake” for one of the babies, he requested a transcript of Roy’s work on the computer, so he knows of Roy’s crime. Roy and his brother have a hostile relationship, so Roy now has to worry about his brother revealing his crime, even though he says he won’t since Roy got him the job with the Bureau.\n"
              },
              {
                "worker_id": "3",
                "uid": "ad5f66dd391544df943e5562dfc85385",
                "response_text": "This story takes place in the 23rd century on a heavily overcrowded Earth. The main character, Roy Walton, is the assistant administrator of the Bureau of Population Equalization. In his own office in this ugly building, at a desk piled high with more reports than he could handle, he starts to look through them and responded to one. Because the Bureau is fairly new, procedures are also still being developed. Walton's staff lets him know someone is here to see him about a Happysleep commitment (meaning someone is going to be euthanized), and Lyle Prior bursts into the office. Walton lets him stay to have a meeting but kicks his guards out: it turns out Prior is a poet who Walton recognizes. They have a hard conversation about Lyle's son, a two-week-old who is genetically susceptible to tuberculosis and is thus sentenced to be euthanized. Lyle points out that he had tuberculosis as a child, and if he had been euthanized instead of cured, his poetry would not exist. Walton has to sit alone with this, as a huge fan of Prior's work, and thinks about the thousands who had been killed or sterilized in the six weeks his office had been open so far. Walton nervously decides he has to do something even though it would be illegal, and heads out of his office, promising himself that Prior's child is the only one he would break the law for. Walton runs into Director FitzMaugham who notices he looks preoccupied; they talk about Prior and FitzMaugham reminds Walton that if they made one exception to their rules, the entire system would fall. When Walton gets off the elevator, he worries that his destination has given away his mission, but heads into the room with the euthanasia files. After looking through Philip's files, he realizes he only has half an hour to act; he re-writes Philip's file to remove the euthanasia recommendation, but still has to retrieve the baby unnoticed. The doctors are surprised to see Walton in the clinic, especially because they'd seen the Director earlier as well. Walton asks if his younger brother, another doctor, is around, so that he can try to avoid him before continuing to the execution chamber to find Philip. Walton runs into Falbrough, the executioner, and tells him to double-check all of the files in case a mistake had been made, hoping that the updated file will take care of the issue for him. Walton returns to his office and gets a call from Falbrough who wasn't sure what to do about Philip, whose record did not have a euthanasia recommendation--Walton tells him to keep it quiet and to get the child back to his parents. As he let it sink in that he had broken the law, Walton's brother calls. Fred had noticed that Roy had messed with the computer system and knows everything that happened; Roy panics after hanging up the phone."
              },
              {
                "worker_id": "8",
                "uid": "b1f1cacd53f2460389065ea3548064ce",
                "response_text": "In the year 2232, the world has voted for the implementation of Equalization Laws and the establishment of the Bureau of Population Equalization, also called Popeek, in order to address the problem of overpopulation. Roy Walton is the second-in-command at Popeek, and his job is to oversee the population equalization process, which redistributes people from overcrowded cities into lower population density areas. In addition, he is responsible for the administration of the global Euthanasia Centers. These clinics carry out the controversial \"Happysleep\" procedure, which is effectively euthanasia, upon children and adults considered substandard. Having been appointed to his position by Director FitzMaugham (whom he had also worked for when FitzMaugham was a senator fighting for Equalization Laws), Roy is a reliable steward of his job, and he barricades himself in his office so he doesn't have to face those opposed to Happysleep. As Roy goes about his busy workday, including ordering a reporting on the feasibility of transferring Belgian citizens to Patagonia, the annunciator notifies him that Lyle Prior, the famous poet, is there to visit him. Lyle's son, Philip, has been scheduled for Happysleep because he had been born tubercular. As a fan of Lyle's poetry, Roy is pleased with his visit, but he does not grant Lyle's request. To do so would risk his career and subvert the work of Popeek and the Equalization Laws in general. After Lyle departs, Roy thinks about his argument that if Lyle had been euthanized for the same reason when he was a child, the world would have been denied his poetry. In spite of Roy's reservations, he decides to spare Philip, but only Philip. He takes an elevator down to the Euthanasia Clinic and is joined by Director FitzMaugham, who acts like he knows what Roy is up to. Roy proceeds to the files room at the clinic and accesses Philip's record on the computer; he removes the euthanasia recommendation from his record and proceeds to the area where Dr. Falbrough administers the fatal procedure. He informs Falbrough that a new policy requires baby's records to be checked again prior to being euthanized to avoid any errors. Upon returning to his office, Roy received a call from his brother Fred, who works as a doctor in the clinic. Fred says he knows Roy edited Philip's record, but he will keep it a secret and call it even since Roy had secured him the job in the clinic in the first place."
              }
            ]
          },
          {
            "question_text": "Describe the new world order and the Equalization Laws.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "6",
                "uid": "f91234681ca74562884a1feeafd5278c",
                "response_text": "In the year 2232, the Earth’s population of humans had maxed out at seven billion. This huge influx of people and steady population growth caused major poverty, starvation, and trade/supply issues. For these reasons and more, the Equalization Law was implemented in order to contain humanity and limit population growth. One such rule under this new world order was the Equalization Law where all newborn babies must be presented before they are two weeks old to be examined. If they do not have any congenital defects or carry any unwanted genes, they will be allowed to live. If not, they will be committed to euthanization, otherwise known as Happysleep. As well, several thousand members of the elderly population were euthanized, as they were already on death’s doorstep. Thousands of men were sterilized in order to prevent any insufficient offspring, and those that were ill or handicapped in some way were also euthanized. \nAs for overcrowding, the Bureau of Population Equalization (Popeek) also relocates certain groups of people to more empty settings. For example, Roy Walton set up a relocation for several thousand people in Belgium to the empty areas of Patagonia. \n"
              },
              {
                "worker_id": "2",
                "uid": "20fcaec869bb48d89dc5cfbf67625c65",
                "response_text": "The Equalization Laws were proposed for legislation by Mr. FitzMaugham fifty years earlier, and when it passed, he was made director of the organization in charge of administering the laws. In the new world order and under the Equalization Laws, the Bureau of Population Equalization is tasked with redistributing the population to make the population density more balanced. It also manages the population numbers by identifying children genetically predisposed to medical conditions deemed unsuited for life and euthanizes them (euphemistically called sending them to Happysleep). The Bureau also identifies other unsuitable (“substandard”) people for euthanasia, such as the very old and terminally ill. And subnormal males are sterilized to prevent them from procreating and passing on their traits. This “cleaning out” of the population is known as “Weeding the Garden” and was voted on by the population. These steps are considered necessary until more space is available for humans, either through terraforming Venus or opening the stars to mankind. Both projects are underway but not fully operational yet. \n"
              },
              {
                "worker_id": "3",
                "uid": "ad5f66dd391544df943e5562dfc85385",
                "response_text": "In this version of Earth in the 23rd century, the population is so large that people are moved from high-density areas to lower-density areas when possible, but more drastic measures are being put in place to control the population. Six weeks before the story starts, in the year 2232, the Bureau of Population Equalization is founded to coordinate a lot of these efforts. Another major effort of theirs is a project called Happysleep, which euthanizes children who are genetically susceptible to certain diseases. In order to get rid of tuberculosis, for instance, they are trying to kill off people with the \"TB-susceptible genetic traits\". The Equalization Law criminalizes saving the life of a potentially-tubercular child, which Walton knows when he leaves his office after his conversation with Lyle Prior. This same group also sterilizes men to the same effect. The main way that the Equalization Laws that govern these decisions work is that children have to go to a local clinic within two weeks of birth, and this is when these decisions are made. The other major way these Laws contribute to the story is that these are the Laws that Roy Walton is breaking when he decides to save Philip Prior's life."
              },
              {
                "worker_id": "8",
                "uid": "b1f1cacd53f2460389065ea3548064ce",
                "response_text": "In order to deal with the world's overpopulation problem, Senator FitzMaugham had fought for the establishment of the Bureau of Population Equalization, or Popeek, in order to oversee the process of balancing out overcrowded areas with parts of the world with smaller populations. For example, when Belgium's population becomes too untenable, Roy requests a report on the viability of sending a number of them to live in Patagonia, where the population density remains low. In addition to the process of equalization, the more controversial measure of euthanasia in the form of \"Happysleep\" takes place at Euthanasia Centers around the world to wipe out adults and children considered \"substandard\" because of genetic diseases, physical disabilities, mental challenges, etc. The Equalization Laws also require every newborn child to be examined at a local clinic to determine if they are suitable for a birth certificate or if they will be scheduled for Happysleep. Roughly one in ten thousand is scheduled for the euthanasia procedure. Saving Philip Prior's life would be considered a criminal act under the Equalization Laws, but Roy Walton does it anyway, swayed by Lyle's argument that if he had been euthanized as a baby because of his tuberculosis, the world would never have his poetry."
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "6",
                "uid": "f91234681ca74562884a1feeafd5278c",
                "response_text": "Master of Life and Death by Robert Silverberg takes place on Earth many years in the future, specifically June 10, 2232, or six weeks after the equalization laws were implemented. The story takes place within the confines of the Cullen building, specifically through the twentieth and twenty-ninth floors. It starts in Roy Walton’s office on the twenty-eighth floor, designed à la 22nd Century neo-Victorian style. Roy redesigned his office, changing the lights, windows, and removing the trim, but the room still felt ugly to him. His office has a desk with a firearm strapped to the bottom, and the door features a lock so as to prevent an assassination. He communicates with people through a holographic video call, and papers and assignments are sent to his desk immediately. Throughout the story, Roy travels down the elevator to the 20th floor, otherwise known as the Euthanization Clinic. There is a receptionist there as well as several computers. Different offices house different doctors, but he makes his to the center for babies where the executioner works. The rooms are very sterile and hospital-like. Each baby had its own pen, and several doctors examined them all while parents watched from screens. "
              },
              {
                "worker_id": "2",
                "uid": "20fcaec869bb48d89dc5cfbf67625c65",
                "response_text": "The story is set in the 23rd century when the Earth’s population has reached seven billion, and people live in extremely crowded conditions. All of the action in the story takes place in the hundred-story Cullen Building, where the Bureau of Population Equalization takes up the 20th through the 29th floors. The building was built in the 22nd century in a neo-Victorian style that is grossly overdecorated and outdated. The overdone nature of the building itself is symbolic of the foolish recklessness of the population of the last century, which led to massive global overpopulation. The structure and Bureau are outfitted with modern technology, including a pneumochute that rapidly delivers paperwork to its destination. Telephones are equipped with video capability so that callers can see each other as they talk, and a lift tube provides transport between floors. Records are stored in memory tubes, microfilm, and computers. Genetic testing is used to identify children with conditions that make them substandard and require their euthanasia. The Bureau has only been up and running for six weeks, but it has already accumulated an impressive quantity of records and data. Workers have become accustomed to their roles; one glibly reports they had identified seven children for Happysleep that morning, the “biggest haul we’ve had yet.”"
              },
              {
                "worker_id": "3",
                "uid": "ad5f66dd391544df943e5562dfc85385",
                "response_text": "The offices of the Bureau of Population Equalization are in a tall office building that is overdecorated and ugly with a lot of chrome and bright lights. Roy Walton had made some changes to his own office to make it more visually tolerable. Besides these offices, the other part of the story takes place in a records room and in the local clinic where Walton runs into a number of doctors and the executioner, Falbrough. In the clinic, there is an execution hall where the children are sent to be euthanized. Beyond just the physical aspects of the setting, this story takes place in June of the year 2232. At this time, Earth is extremely overpopulated, and the story's events take place around the policies that are being put into place in an attempt to control some of this overpopulation."
              },
              {
                "worker_id": "8",
                "uid": "b1f1cacd53f2460389065ea3548064ce",
                "response_text": "The story takes place on June 10, 2232 at the offices of the newly-established Bureau of Population Equalization, commonly known as Popeek, which is located on the 20th - 29th floors of the Cullen Building. The Cullen Building has one hundred stories and is crafted in the 22nd century neo-Victorian style. Roy Walton's office is on the 28th floor directly below Director FitzMaugham's, and he has redecorated it to fit his personal taste: He has replaced the sash windows with opaquers and added electroluminescents in place of the old ceiling fixture. Roy's desk is stacked with papers, which continuously arrive through pneumochutes, and he keeps a needler gun in his drawer for protection. An annunciator alerts Roy when he has visitors. Outside Roy's office is an outer office where six secretaries work. He takes an elevator down to the 20th floor where his brother works at the Euthanasia Clinic and Files. The euthanasia file room is thirty feet by twenty feet and filled with Donnerson micro-memory tubes and microfilm records. Popeek has various local offices and euthanasia centers around the world, where people considered substandard are sent on to \"Happysleep.\""
              }
            ]
          },
          {
            "question_text": "Who is Fred Walton, and what is his significance in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "6",
                "uid": "f91234681ca74562884a1feeafd5278c",
                "response_text": "Fred Walton is the brother of Roy Walton, Assistant Administrator of the Bureau of Population Equalization. Fred Walton is a physician with a vaguely unsuccessful career history: medical school, a failed private practice, and finally becoming a doctor in the euthanizing section of Bureau of Population Equalization (or Popeek) thanks to his brother. Their childhood was tense and difficult. They were orphaned at 7 and 9 respectively when their parents died in a jet crash. Fred Walton and Roy have a very contentious relationship now, shown through Roy’s hindrance to visiting his brother when in his section of the building. \nFred Walton is significant because he discovered what Roy Walton had done after breaking into the office computers and looking up confidential information. He uses his knowledge of Roy’s felony and leverages it over his head. Essentially, he offers an ultimatum: Fred will keep quiet, so long as Roy does too. Plus, Roy now owes Fred. \n"
              },
              {
                "worker_id": "2",
                "uid": "20fcaec869bb48d89dc5cfbf67625c65",
                "response_text": "Fred Walton is the younger brother of Roy Walton, the assistant administrator of the Bureau of Population Equalization (Popeek). The brothers are not close—they have never been. Fred always told Roy he would get even with him when they were the same size, but he never caught up to Roy’s height when they were younger. When they were seven and nine, their parents died in a jet crash, and the boys were placed in public care facilities. Afterward, they went in different directions, Roy to study law and Fred to study medicine. Fred had opened his private medical practice but wasn’t successful, and Roy got him the job in the Happysleep section of Popeek. When Roy visits the Euthanasia Clinic, he asks if Fred is there but learns he is working on analyses, so he doesn’t disturb him. Later, when Fred learns that Roy had been there, he is curious about what his brother was doing and requests a transcript of his work with the computer. Roy reminds Fred that doing so is a criminal offense, and Fred reminds him that makes the two of them criminals. Fred tells Roy he won’t say anything about what Roy did and says they are even now. However, Roy now worries about what Fred will do. It is entirely possible that Fred will hold this knowledge over Roy’s head in the future and use it to blackmail Roy. Fred undermines Roy's hope of getting away with what he had done.\n"
              },
              {
                "worker_id": "3",
                "uid": "ad5f66dd391544df943e5562dfc85385",
                "response_text": "Fred Walton is a doctor who works for the Bureau of Population Equalization, and is the younger brother of Roy Walton, the assistant director of the bureau. He is built bigger than Roy and over half a foot shorter. The two of them lived together with their parents until Roy was nine and Fred was seven years of age, but once their parents died in a plane crash, they led separate lives--eventually, Roy had gotten Fred his job with Happysleep, which reconnected them in some way. Fred noticed that Roy had been poking around the computer system when he visited the clinic, and took a look at what Roy had been doing. Fred confronted Roy about what had happened, which made Roy realize how dangerous of a situation this was, and that it could be escalating quickly now that both of them had committed criminal offenses. "
              },
              {
                "worker_id": "8",
                "uid": "b1f1cacd53f2460389065ea3548064ce",
                "response_text": "Fred Walton is Roy's younger brother, and he works as a doctor in the Euthanasia Clinic at Popeek. They do not like each other very much. When Roy was nine and Fred was seven, their parents died in a plane crash off Maracaibo, and they had been sent to live in a nursery. Roy received a law education and served as FitzMaugham's private secretary back when he was a senator. Fred studied medicine and spent some time in a failed private practice until Roy got him the job at Popeek. Fred is smaller than Roy at 5'7\" and compact. Roy believes that Fred's inability to catch up with Roy's height explains at least some of the resentment he harbors against him. When Fred calls him in his office after Roy returns from editing Philip Prior's record, Roy knows he is in trouble because Fred never calls unless he has something unpleasant to say. Fred reveals he had read through the history of Roy's use of the clinic's computer and suggests he knows exactly what he did to save Philip. However, he decides not to tell FitzMaugham because Roy had secured his position at the clinic for him. He decides to call it even."
              }
            ]
          },
          {
            "question_text": "Who is Philip Prior, and what happens to him throughout the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "6",
                "uid": "f91234681ca74562884a1feeafd5278c",
                "response_text": "Philip Prior is the son of Lyle Prior and Ava Leonard Prior. He was born small, a little over 5 pounds, and carries the gene for tuberculosis. Within this new society, this genetic mutation means that Philip Prior has to be euthanized and sent to Happysleep. At only two weeks old, he has been sentenced to death. His father, Lyle Prior the poet, comes to the office of Roy Walton to try and save his son’s life. Although he is unsuccessful at first, his words about what his son could become stuck with Roy and caused him to save Philip’s life. Philip Prior is incredibly significant because his life and sentencing caused Roy Walton to make the first crack in the framework, commit a felony by saving his life, and potentially sentence himself to a failed career and life. "
              },
              {
                "worker_id": "2",
                "uid": "20fcaec869bb48d89dc5cfbf67625c65",
                "response_text": "Philip Prior is the two-week-old son of the famous poet Lyle Prior and his wife, Ava. With the Equalization Laws, all children have to be examined and tested at a clinic within two weeks of birth to determine whether they are healthy enough and genetically suited to live. If they are, they are given a certificate; if not, the certificate is denied, and the child is euthanized (sent to Happysleep) that day. Philip’s test shows that he is 3f2, tubercular-prone. The child’s father goes to see Mr. Fitzmaugham and then Roy Walton to plead for an exception for his son; Prior explains that he was tubercular when he was a child but that he was subsequently cured. He also reminds Roy to think about what would have happened to his poems if such a law existed when he was born and he had been sent to Happysleep. This thought haunts Roy after Prior leaves his office, and he decides to save Philip Prior, rewriting the child’s medical records card and deleting his condition. The baby is minutes away from death when Roy takes the next step and visits the euthanasia doctor, telling him a fictitious story of a tragic mistake at a European center yesterday and implementing a new policy in effect immediately for checking each baby’s file before operating on it. The doctor calls Roy shortly afterward and exclaims that one of the babies scheduled for Happysleep that morning was, indeed, perfectly healthy and should not be euthanized. Thus, Philip Prior’s life is saved.\n\n\n"
              },
              {
                "worker_id": "3",
                "uid": "ad5f66dd391544df943e5562dfc85385",
                "response_text": "Philip Prioir is a two-week-old boy, the son of Lyle Prior, the poet who bursts into Roy Walton's office at the beginning of the story. The morning Lyle entered the Bureau, Philip had been committed to Happysleep. Lyle seems to think his son is in perfectly good health, but he has been labeled as potentially tubercular. This is especially shocking to Lyle because he had been tubercular when he was young, but was cured and not euthanized (because the euthanasia laws had not yet been passed). Roy Walton decides he needs to help save Philip, and goes on a secretive mission to do so. Walton changes Philip's record and then has the executioner in the clinic double-check all of the files, which prompts the executioner to think Philip is there by mistake. This lets Roy order him to send Philip back to his parents near the end of the story. "
              },
              {
                "worker_id": "8",
                "uid": "b1f1cacd53f2460389065ea3548064ce",
                "response_text": "Philip was born May 31, 2232 at New York General Hospital in New York weighing 5lb. 3oz. He is the two-week-old son of Ava and her husband, Melling Prize-winning poet Lyle Prior. Lyle had voted for the creation of Popeek and understood the concept of Weeding the Garden as well as the Euthansia Plan, but he hadn't expected his son would be selected for Happysleep. Therefore, when his son is selected because of a case of tuberculosis, he visits Roy Walton's office to request an audience with him. Lyle implores Roy to spare his son's life and reminds him that had the euthanasia program been around when he was a child, then his poems never would have been written for Roy to enjoy. Although Roy is empathic to Lyle's situation, he refuses to grant his request, knowing that it would cost him his job and perhaps the entire future of Popeek. However, after Lyle leaves, Roy is tortured by Lyle's argument, and he decides to grant Lyle's request. He makes his way to the Euthanasia Clinic & Files floor and accesses Philip Prior's record. After reading the denotations on the record, Roy removes the fatal symbol as well as the euthanasia recommendation from his record. Next, he visits Dr. Falbrough, whose jobs is to administer the euthanasia procedure. He tells Falbrough there is a new procedure designed to keep public opinion positive--prior to starting each procedure, the baby's file must be checked to make sure there is no mistake. In this way, he ensures baby Philip will not be killed. Roy ultimately risks his own career to save Philip's life."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5346,
        "document_length_chars": 31925
      }
    }
  ]
}