{
  "item_metadata": {
    "item_id": "50802",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "50802",
      "content": "A CITY NEAR CENTAURUS\n \n \n By BILL DOEDE\n \n Illustrated by WEST\n \n [Transcriber's Note: This etext was produced from Galaxy Magazine October 1962. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n The city was sacred, but not to its gods. Michaelson was a god—but far from sacred!\n \n\n \n Crouched in the ancient doorway like an animal peering out from his burrow, Mr. Michaelson saw the native.\n \n At first he was startled, thinking it might be someone else from the Earth settlement who had discovered the old city before him. Then he saw the glint of sun against the metallic skirt, and relaxed.\n \n He chuckled to himself, wondering with amusement what a webfooted man was doing in an old dead city so far from his people. Some facts were known about the people of Alpha Centaurus II. They were not actually natives, he recalled. They were a colony from the fifth planet of the system. They were a curious people. Some were highly intelligent, though uneducated.\n \n He decided to ignore the man for the moment. He was far down the ancient street, a mere speck against the sand. There would be plenty of time to wonder about him.\n \n He gazed out from his position at the complex variety of buildings before him. Some were small, obviously homes. Others were huge with tall, frail spires standing against the pale blue sky. Square buildings, ellipsoid, spheroid. Beautiful, dream-stuff bridges connected tall, conical towers, bridges that still swung in the wind after half a million years. Late afternoon sunlight shone against ebony surfaces. The sands of many centuries had blown down the wide streets and filled the doorways. Desert plants grew from roofs of smaller buildings.\n \n Ignoring the native, Mr. Michaelson poked about among the ruins happily, exclaiming to himself about some particular artifact, marveling at its state of preservation, holding it this way and that to catch the late afternoon sun, smiling, clucking gleefully. He crawled over the rubble through old doorways half filled with the accumulation of ages. He dug experimentally in the sand with his hands, like a dog, under a roof that had weathered half a million years of rain and sun. Then he crawled out again, covered with dust and cobwebs.\n \n \n\n \n The native stood in the street less than a hundred feet away, waving his arms madly. \"Mr. Earthgod,\" he cried. \"It is sacred ground where you are trespassing!\"\n \n The archeologist smiled, watching the man hurry closer. He was short, even for a native. Long gray hair hung to his shoulders, bobbing up and down as he walked. He wore no shoes. The toes of his webbed feet dragged in the sand, making a deep trail behind him. He was an old man.\n \n \"You never told us about this old dead city,\" Michaelson said, chidingly. \"Shame on you. But never mind. I've found it now. Isn't it beautiful?\"\n \n \"Yes, beautiful. You will leave now.\"\n \n \"Leave?\" Michaelson asked, acting surprised as if the man were a child. \"I just got here a few hours ago.\"\n \n \"You must go.\"\n \n \"Why? Who are you?\"\n \n \"I am keeper of the city.\"\n \n \"You?\" Michaelson laughed. Then, seeing how serious the native was, said, \"What makes you think a dead city needs a keeper?\"\n \n \"The spirits may return.\"\n \n Michaelson crawled out of the doorway and stood up. He brushed his trousers. He pointed. \"See that wall? Built of some metal, I'd say, some alloy impervious to rust and wear.\"\n \n \"The spirits are angry.\"\n \n \"Notice the inscriptions? Wind has blown sand against them for eons, and rain and sleet. But their story is there, once we decipher it.\"\n \n \"Leave!\"\n \n The native's lined, weathered old face was working around the mouth in anger. Michaelson was almost sorry he had mocked him. He was deadly serious.\n \n \"Look,\" he said. \"No spirits are ever coming back here. Don't you know that? And even if they did, spirits care nothing for old cities half covered with sand and dirt.\"\n \n He walked away from the old man, heading for another building. The sun had already gone below the horizon, coloring the high clouds. He glanced backward. The webfoot was following.\n \n \"Mr. Earthgod!\" the webfoot cried, so sharply that Michaelson stopped.\n\"You must not touch, not walk upon, not handle. Your step may destroy the home of some ancient spirit. Your breath may cause one iota of change and a spirit may lose his way in the darkness. Go quickly now, or be killed.\"\n \n \n\n \n He turned and walked off, not looking back.\n \n Michaelson stood in the ancient street, tall, gaunt, feet planted wide, hands in pockets, watching the webfoot until he was out of sight beyond a huge circular building. There was a man to watch. There was one of the intelligent ones. One look into the alert old eyes had told him that.\n \n Michaelson shook his head, and went about satisfying his curiosity. He entered buildings without thought of roofs falling in, or decayed floors dropping from under his weight. He began to collect small items, making a pile of them in the street. An ancient bowl, metal untouched by the ages. A statue of a man, one foot high, correct to the minutest detail, showing how identical they had been to Earthmen. He found books still standing on ancient shelves but was afraid to touch them without tools.\n \n Darkness came swiftly and he was forced out into the street.\n \n He stood there alone feeling the age of the place. Even the smell of age was in the air. Silver moonlight from the two moons filtered through clear air down upon the ruins. The city lay now in darkness, dead and still, waiting for morning so it could lie dead and still in the sun.\n \n There was no hurry to be going home, although he was alone, although this was Alpha Centaurus II with many unknowns, many dangers ... although home was a very great distance away. There was no one back there to worry about him.\n \n His wife had died many years ago back on Earth. No children. His friends in the settlement would not look for him for another day at least. Anyway, the tiny cylinder, buried in flesh behind his ear, a thing of mystery and immense power, could take him home instantly, without effort save a flicker of thought.\n \n \"You did not leave, as I asked you.\"\n \n Michaelson whirled around at the sound of the native's voice. Then he relaxed. He said, \"You shouldn't sneak up on a man like that.\"\n \n \"You must leave, or I will be forced to kill you. I do not want to kill you, but if I must....\" He made a clucking sound deep in the throat.\n\"The spirits are angry.\"\n \n \"Nonsense. Superstition! But never mind. You have been here longer than I. Tell me, what are those instruments in the rooms? It looks like a clock but I'm certain it had some other function.\"\n \n \"What rooms?\"\n \n \"Oh, come now. The small rooms back there. Look like they were bedrooms.\"\n \n \"I do not know.\" The webfoot drew closer. Michaelson decided he was sixty or seventy years old, at least.\n \n \"You've been here a long time. You are intelligent, and you must be educated, the way you talk. That gadget looks like a time-piece of some sort. What is it? What does it measure?\"\n \n \"I insist that you go.\" The webfoot held something in his hand.\n \n \"No.\" Michaelson looked off down the street, trying to ignore the native, trying to feel the life of the city as it might have been.\n \n \n\n \n \"You are sensitive,\" the native said in his ear. \"It takes a sensitive god to feel the spirits moving in the houses and walking in these old streets.\"\n \n \"Say it any way you want to. This is the most fascinating thing I've ever seen. The Inca's treasure, the ruins of Pompeii, Egyptian tombs—none can hold a candle to this.\"\n \n \"Mr. Earthgod....\"\n \n \"Don't call me that. I'm not a god, and you know it.\"\n \n The old man shrugged. \"It is not an item worthy of dispute. Those names you mention, are they the names of gods?\"\n \n He chuckled. \"In a way, yes. What is your name?\"\n \n \"Maota.\"\n \n \"You must help me, Maota. These things must be preserved. We'll build a museum, right here in the street. No, over there on the hill just outside the city. We'll collect all the old writings and perhaps we may decipher them. Think of it, Maota! To read pages written so long ago and think their thoughts. We'll put everything under glass. Build and evacuate chambers to stop the decay. Catalogue, itemize....\"\n \n Michaelson was warming up to his subject, but Maota shook his head like a waving palm frond and stamped his feet.\n \n \"You will leave now.\"\n \n \"Can't you see? Look at the decay. These things are priceless. They must be preserved. Future generations will thank us.\"\n \n \"Do you mean,\" the old man asked, aghast, \"that you want others to come here? You know the city abhors the sound of alien voices. Those who lived here may return one day! They must not find their city packaged and preserved and laid out on shelves for the curious to breathe their foul breaths upon. You will leave. Now!\"\n \n \"No.\" Michaelson was adamant. The rock of Gibraltar.\n \n Maota hit him, quickly, passionately, and dropped the weapon beside his body. He turned swiftly, making a swirling mark in the sand with his heel, and walked off toward the hills outside the city.\n \n The weapon he had used was an ancient book. Its paper-thin pages rustled in the wind as if an unseen hand turned them, reading, while Michaelson's blood trickled out from the head wound upon the ancient street.\n \n \n\n \n When he regained consciousness the two moons, bright sentinel orbs in the night sky, had moved to a new position down their sliding path. Old Maota's absence took some of the weirdness and fantasy away. It seemed a more practical place now.\n \n The gash in his head was painful, throbbing with quick, short hammer-blows synchronized with his heart beats. But there was a new determination in him. If it was a fight that the old webfooted fool wanted, a fight he would get. The cylinder flicked him, at his command, across five hundred miles of desert and rocks to a small creek he remembered. Here he bathed his head in cool water until all the caked blood was dissolved from his hair. Feeling better, he went back.\n \n The wind had turned cool. Michaelson shivered, wishing he had brought a coat. The city was absolutely still except for small gusts of wind sighing through the frail spires. The ancient book still lay in the sand beside the dark spot of blood. He stooped over and picked it up.\n \n It was light, much lighter than most Earth books. He ran a hand over the binding. Smooth it was, untouched by time or climate. He squinted at the pages, tilting the book to catch the bright moonlight, but the writing was alien. He touched the page, ran his forefinger over the writing.\n \n Suddenly he sprang back. The book fell from his hands.\n \n \"God in heaven!\" he exclaimed.\n \n He had heard a voice. He looked around at the old buildings, down the length of the ancient street. Something strange about the voice. Not Maota. Not his tones. Not his words. Satisfied that no one was near, he stooped and picked up the book again.\n \n \"Good God!\" he said aloud. It was the book talking. His fingers had touched the writing again. It was not a voice, exactly, but a stirring in his mind, like a strange language heard for the first time.\n \n A talking book. What other surprises were in the city? Tall, fragile buildings laughing at time and weather. A clock measuring God-knows-what. If such wonders remained, what about those already destroyed? One could only guess at the machines, the gadgets, the artistry already decayed and blown away to mix forever with the sand.\n \n I must preserve it, he thought, whether Maota likes it or not. They say these people lived half a million years ago. A long time. Let's see, now. A man lives one hundred years on the average. Five thousand lifetimes.\n \n And all you do is touch a book, and a voice jumps across all those years!\n \n He started off toward the tall building he had examined upon discovery of the city. His left eyelid began to twitch and he laid his forefinger against the eye, pressing until it stopped. Then he stooped and entered the building. He laid the book down and tried to take the \"clock\" off the wall. It was dark in the building and his fingers felt along the wall, looking for it. Then he touched it. His fingers moved over its smooth surface. Then suddenly he jerked his hand back with an exclamation of amazement. Fear ran up his spine.\n  The clock was warm.\n \n \n He felt like running, like flicking back to the settlement where there were people and familiar voices, for here was a thing that should not be. Half a million years—and here was warmth!\n \n He touched it again, curiosity overwhelming his fear. It was warm. No mistake. And there was a faint vibration, a suggestion of power. He stood there in the darkness staring off into the darkness, trembling. Fear built up in him until it was a monstrous thing, drowning reason. He forgot the power of the cylinder behind his ear. He scrambled through the doorway. He got up and ran down the ancient sandy street until he came to the edge of the city. Here he stopped, gasping for air, feeling the pain throb in his head.\n \n Common sense said that he should go home, that nothing worthwhile could be accomplished at night, that he was tired, that he was weak from loss of blood and fright and running. But when Michaelson was on the trail of important discoveries he had no common sense.\n \n He sat down in the darkness, meaning to rest a moment.\n \n \n\n \n When he awoke dawn was red against thin clouds in the east.\n \n Old Maota stood in the street with webbed feet planted far apart in the sand, a weapon in the crook of his arm. It was a long tube affair, familiar to Michaelson.\n \n Michaelson asked, \"Did you sleep well?\"\n \n \"No.\"\n \n \"I'm sorry to hear that.\"\n \n \"How do you feel?\"\n \n \"Fine, but my head aches a little.\"\n \n \"Sorry,\" Maota said.\n \n \"For what?\"\n \n \"For hitting you. Pain is not for gods like you.\"\n \n Michaelson relaxed somewhat. \"What kind of man are you? First you try to break my skull, then you apologize.\"\n \n \"I abhor pain. I should have killed you outright.\"\n \n He thought about that for a moment, eyeing the weapon.\n \n It looked in good working order. Slim and shiny and innocent, it looked like a glorified African blowgun. But he was not deceived by its appearance. It was a deadly weapon.\n \n \n\n \n \"Well,\" he said, \"before you kill me, tell me about the book.\" He held it up for Maota to see.\n \n \"What about the book?\"\n \n \"What kind of book is it?\"\n \n \"What does Mr. Earthgod mean, what kind of book? You have seen it. It is like any other book, except for the material and the fact that it talks.\"\n \n \"No, no. I mean, what's in it?\"\n \n \"Poetry.\"\n \n \"Poetry? For God's sake, why poetry? Why not mathematics or history? Why not tell how to make the metal of the book itself? Now there is a subject worthy of a book.\"\n \n Maota shook his head. \"One does not study a dead culture to learn how they made things, but how they thought. But we are wasting time. I must kill you now, so I can get some rest.\"\n \n The old man raised the gun.\n \n \n\n \n \"Wait! You forget that I also have a weapon.\" He pointed to the spot behind his ear where the cylinder was buried. \"I can move faster than you can fire the gun.\"\n \n Maota nodded. \"I have heard how you travel. It does not matter. I will kill you anyway.\"\n \n \"I suggest we negotiate.\"\n \n \"No.\"\n \n \"Why not?\"\n \n Maota looked off toward the hills, old eyes filmed from years of sand and wind, leather skin lined and pitted. The hills stood immobile, brown-gray, already shimmering with heat, impotent.\n \n \"Why not?\" Michaelson repeated.\n \n \"Why not what?\" Maota dragged his eyes back.\n \n \"Negotiate.\"\n \n \"No.\" Maota's eyes grew hard as steel. They stood there in the sun, not twenty feet apart, hating each other. The two moons, very pale and far away on the western horizon, stared like two bottomless eyes.\n \n \"All right, then. At least it's a quick death. I hear that thing just disintegrates a man. Pfft! And that's that.\"\n \n Michaelson prepared himself to move if the old man's finger slid closer toward the firing stud. The old man raised the gun.\n \n \"Wait!\"\n \n \"Now what?\"\n \n \"At least read some of the book to me before I die, then.\"\n \n The gun wavered. \"I am not an unreasonable man,\" the webfoot said.\n \n Michaelson stepped forward, extending his arm with the book.\n \n \"No, stay where you are. Throw it.\"\n \n \"This book is priceless. You just don't go throwing such valuable items around.\"\n \n \"It won't break. Throw it.\"\n \n Michaelson threw the book. It landed at Maota's feet, spouting sand against his leg. He shifted the weapon, picked up the book and leafed through it, raising his head in a listening attitude, searching for a suitable passage. Michaelson heard the thin, metallic pages rustle softly. He could have jumped and seized the weapon at that moment, but his desire to hear the book was strong.\n \n \n\n \n Old Maota read, Michaelson listened. The cadence was different, the syntax confusing. But the thoughts were there. It might have been a professor back on Earth reading to his students. Keats, Shelley, Browning. These people were human, with human thoughts and aspirations.\n \n The old man stopped reading. He squatted slowly, keeping Michaelson in sight, and laid the book face up in the sand. Wind moved the pages.\n \n \"See?\" he said. \"The spirits read. They must have been great readers, these people. They drink the book, as if it were an elixir. See how gentle! They lap at the pages like a new kitten tasting milk.\"\n \n Michaelson laughed. \"You certainly have an imagination.\"\n \n \"What difference does it make?\" Maota cried, suddenly angry. \"You want to close up all these things in boxes for a posterity who may have no slightest feeling or appreciation. I want to leave the city as it is, for spirits whose existence I cannot prove.\"\n \n The old man's eyes were furious now, deadly. The gun came down directly in line with the Earthman's chest. The gnarled finger moved.\n \n Michaelson, using the power of the cylinder behind his ear, jumped behind the old webfoot. To Maota it seemed that he had flicked out of existence like a match blown out. The next instant Michaelson spun him around and hit him. It was an inexpert fist, belonging to an archeologist, not a fighter. But Maota was an old man.\n \n He dropped in the sand, momentarily stunned. Michaelson bent over to pick up the gun and the old man, feeling it slip from his fingers, hung on and was pulled to his feet.\n \n They struggled for possession of the gun, silently, gasping, kicking sand. Faces grew red. Lips drew back over Michaelson's white teeth, over Maota's pink, toothless gums. The dead city's fragile spires threw impersonal shadows down where they fought.\n \n Then quite suddenly a finger or hand—neither knew whose finger or hand—touched the firing stud.\n \n There was a hollow, whooshing sound. Both stopped still, realizing the total destruction they might have caused.\n \n \"It only hit the ground,\" Michaelson said.\n \n A black, charred hole, two feet in diameter and—they could not see how deep—stared at them.\n \n Maota let go and sprawled in the sand. \"The book!\" he cried. \"The book is gone!\"\n \n \"No! We probably covered it with sand while we fought.\"\n \n \n\n \n Both men began scooping sand in their cupped hands, digging frantically for the book. Saliva dripped from Maota's mouth, but he didn't know or care.\n \n Finally they stopped, exhausted. They had covered a substantial area around the hole. They had covered the complete area where they had been.\n \n \"We killed it,\" the old man moaned.\n \n \"It was just a book. Not alive, you know.\"\n \n \"How do you know?\" The old man's pale eyes were filled with tears. \"It talked and it sang. In a way, it had a soul. Sometimes on long nights I used to imagine it loved me, for taking care of it.\"\n \n \"There are other books. We'll get another.\"\n \n Maota shook his head. \"There are no more.\"\n \n \"But I've seen them. Down there in the square building.\"\n \n \"Not poetry. Books, yes, but not poetry. That was the only book with songs.\"\n \n \"I'm sorry.\"\n \n \" You killed it!\" Maota suddenly sprang for the weapon, lying forgotten in the sand. Michaelson put his foot on it and Maota was too weak to tear it loose. He could only weep out his rage.\n \n When he could talk again, Maota said, \"I am sorry, Mr. Earthgod. I've disgraced myself.\"\n \n \"Don't be sorry.\" Michaelson helped him to his feet. \"We fight for some reasons, cry for others. A priceless book is a good reason for either.\"\n \n \"Not for that. For not winning. I should have killed you last night when I had the chance. The gods give us chances and if we don't take them we lose forever.\"\n \n \"I told you before! We are on the same side. Negotiate. Have you never heard of negotiation?\"\n \n \"You are a god,\" Maota said. \"One does not negotiate with gods. One either loves them, or kills them.\"\n \n \"That's another thing. I am not a god. Can't you understand?\"\n \n \"Of course you are.\" Maota looked up, very sure. \"Mortals cannot step from star to star like crossing a shallow brook.\"\n \n \"No, no. I don't step from one star to another. An invention does that. Just an invention. I carry it with me. It's a tiny thing. No one would ever guess it has such power. So you see, I'm human, just like you. Hit me and I hurt. Cut me and I bleed. I love. I hate. I was born. Some day I'll die. See? I'm human. Just a human with a machine. No more than that.\"\n \n \n\n \n Maota laughed, then sobered quickly. \"You lie.\"\n \n \"No.\"\n \n \"If I had this machine, could I travel as you?\"\n \n \"Yes.\"\n \n \"Then I'll kill you and take yours.\"\n \n \"It would not work for you.\"\n \n \"Why?\"\n \n \"Each machine is tailored for each person.\"\n \n The old man hung his head. He looked down into the black, charred hole. He walked all around the hole. He kicked at the sand, looking half-heartedly again for the book.\n \n \"Look,\" Michaelson said. \"I'm sure I've convinced you that I'm human. Why not have a try at negotiating our differences?\"\n \n He looked up. His expressive eyes, deep, resigned, studied Michaelson's face. Finally he shook his head sadly. \"When we first met I hoped we could think the ancient thoughts together. But our paths diverge. We have finished, you and I.\"\n \n He turned and started off, shoulders slumped dejectedly.\n \n Michaelson caught up to him. \"Are you leaving the city?\"\n \n \"No.\"\n \n \"Where are you going?\"\n \n \"Away. Far away.\" Maota looked off toward the hills, eyes distant.\n \n \"Don't be stupid, old man. How can you go far away and not leave the city?\"\n \n \"There are many directions. You would not understand.\"\n \n \"East. West. North. South. Up. Down.\"\n \n \"No, no. There is another direction. Come, if you must see.\"\n \n Michaelson followed him far down the street. They came to a section of the city he had not seen before. Buildings were smaller, spires dwarfed against larger structures. Here a path was packed in the sand, leading to a particular building.\n \n Michaelson said, \"This is where you live?\"\n \n \"Yes.\"\n \n Maota went inside. Michaelson stood in the entrance and looked around. The room was clean, furnished with hand made chairs and a bed. Who is this old man, he thought, far from his people, living alone, choosing a life of solitude among ancient ruins but not touching them? Above the bed a \"clock\" was fastened to the wall, Michaelson remembered his fright—thinking of the warmth where warmth should not be.\n \n Maota pointed to it.\n \n \"You asked about this machine,\" he said. \"Now I will tell you.\" He laid his hand against it. \"Here is power to follow another direction.\"\n \n \n\n \n Michaelson tested one of the chairs to see if it would hold his weight, then sat down. His curiosity about the instrument was colossal, but he forced a short laugh. \"Maota, you are complex. Why not stop all this mystery nonsense and tell me about it? You know more about it than I.\"\n \n \"Of course.\" Maota smiled a toothless, superior smile. \"What do you suppose happened to this race?\"\n \n \"You tell me.\"\n \n \"They took the unknown direction. The books speak of it. I don't know how the instrument works, but one thing is certain. The race did not die out, as a species becomes extinct.\"\n \n Michaelson was amused, but interested. \"Something like a fourth dimension?\"\n \n \"I don't know. I only know that with this instrument there is no death. I have read the books that speak of this race, this wonderful people who conquered all disease, who explored all the mysteries of science, who devised this machine to cheat death. See this button here on the face of the instrument? Press the button, and....\"\n \n \"And what?\"\n \n \"I don't know, exactly. But I have lived many years. I have walked the streets of this city and wondered, and wanted to press the button. Now I will do so.\"\n \n Quickly the old man, still smiling, pressed the button. A high-pitched whine filled the air, just within audio range. Steady for a moment, it then rose in pitch passing beyond hearing quickly.\n \n The old man's knees buckled. He sank down, fell over the bed, lay still. Michaelson touched him cautiously, then examined him more carefully. No question about it.\n \n The old man was dead.\n \n \n\n \n Feeling depressed and alone, Michaelson found a desert knoll outside the city overlooking the tall spires that shone in the sunlight and gleamed in the moonlight. He made a stretcher, rolled the old man's body on to it and dragged it down the long ancient street and up the knoll.\n \n Here he buried him.\n \n But it seemed a waste of time. Somehow he knew beyond any doubt that the old native and his body were completely disassociated in some sense more complete than death.\n \n In the days that followed he gave much thought to the \"clock.\" He came to the city every day. He spent long hours in the huge square building with the books. He learned the language by sheer bulldog determination. Then he searched the books for information about the instrument.\n \n Finally after many weeks, long after the winds had obliterated all evidence of Maota's grave on the knoll, Michaelson made a decision. He had to know if the machine would work for him.\n \n And so one afternoon when the ancient spires threw long shadows over the sand he walked down the long street and entered the old man's house. He stood before the instrument, trembling, afraid, but determined. He pinched his eyes shut tight like a child and pressed the button.\n \n The high-pitched whine started.\n \n Complete, utter silence. Void. Darkness. Awareness and memory, yes; nothing else. Then Maota's chuckle came. No sound, an impression only like the voice from the ancient book. Where was he? There was no left or right, up or down. Maota was everywhere, nowhere.\n \n \"Look!\" Maota's thought was directed at him in this place of no direction. \"Think of the city and you will see it.\"\n \n Michaelson did, and he saw the city beyond, as if he were looking through a window. And yet he was in the city looking at his own body.\n \n Maota's chuckle again. \"The city will remain as it is. You did not win after all.\"\n \n \"Neither did you.\"\n \n \"But this existence has compensations,\" Maota said. \"You can be anywhere, see anywhere on this planet. Even on your Earth.\"\n \n Michaelson felt a great sadness, seeing his body lying across the old, home made bed. He looked closer. He sensed a vibration or life force—he didn't stop to define it—in his body. Why was his dead body different from Old Maota's? Could it be that there was some thread stretching from the reality of his body to his present state?\n \n \"I don't like your thoughts,\" Maota said. \"No one can go back. I tried. I have discussed it with many who are not presently in communication with you. No one can go back.\"\n \n Michaelson decided he try.\n \n \n\n \n \"No!\" Maota's thought was prickled with fear and anger.\n \n Michaelson did not know how to try, but he remembered the cylinder and gathered all the force of his mind in spite of Maota's protests, and gave his most violent command.\n \n At first he thought it didn't work. He got up and looked around, then it struck him. He was standing up!\n \n \n The cylinder. He knew it was the cylinder. That was the difference between himself and Maota. When he used the cylinder, that was where he went, the place where Maota was now. It was a door of some kind, leading to a path of some kind where distance was non-existent. But the\n\"clock\" was a mechanism to transport only the mind to that place.\n \n To be certain of it, he pressed the button again, with the same result as before. He saw his own body fall down. He felt Maota's presence.\n \n \"You devil!\" Maota's thought-scream was a sword of hate and anger, irrational suddenly, like a person who knows his loss is irrevocable.\n\"I said you were a god. I said you were a god. I said you were a god...! \"",
      "metadata": {
        "title": "A City Near Centaurus",
        "author": "Bill Doede",
        "passage_id": "50802",
        "uid": "e5061227e8ed45539afd1217cbcc4408",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "10",
                "uid": "c1c18cbd52da45c7aace6bbbc422b137",
                "response_text": "Stationed on the Earth base of Alpha Centaurus II, Mr. Michaelson, a tall, gaunt archeologist, explores the planet for historical artifacts. He is human, but has a special cylinder embedded in the flesh behind his ear that teleports him to a different location when touched.\nHe comes across an empty city in the desert, with the old buildings filling with blown sand, though he is not alone. He is approached by a short, gray-haired native with webbed bare feet (aka webfoot or Maota) that he spotted in a doorway, who introduces himself as the keeper of the city and implores him to leave because he angers the gods. Michaelson brushes aside that spirits exist, but notes that he must keep an eye on this intelligent native.\nAs Michaelson continues to explore the city and disobey what he was told, the native again demands he leave, calling him “Mr. Earthgod.” Michaelson learns his name is Maota, and tries to negotiate to preserve the artifacts and build a museum. Maota does not succumb to Michaelson’s tactics, and whacks him unconscious with a metal book.\nMichaelson awakes and teleports to a creek 500 miles away to clean his wound, then returns and opens the book to find voices talking to him. He is mystified that the civilization here said to have disappeared half a million years ago was communicating with him. In his wonder, he picks up another clock-like artifact he has been curious about, and is shocked to feel it is radiating heat.\nThe next day, Michaelson awakes in the dead city to find Maota pointing a gun-like weapon at him - apologizing for causing him pain instead of killing him. Maota reads from the talking poetry book, at Michaelson’s request. It moves them both, Michaelson feeling the humanity of the civilization, and Maota feeling the gentle spirits. Maota becomes furious that Michaelson wants to move things into a museum and begins to fire the weapon. Michaelson teleports behind him and in their struggle to take possession they discharge it - destroying the book. \nMaota has disgraced himself and the gods and becomes inconsolable. He has been wanting to try the “clock” device for some time - now with renewed determination because he doesn’t care if it kills him. He explains that he thinks the race of the dead city entered a fourth dimension. Pushing the button, Maota’s body collapses in death. Michaelson tries to bury him, but has the sense that his soul is elsewhere. Michaelson desperately studies the artifacts to understand the clock, then radically decides to just press the button too. Afterwards, he sees his dead body below him and communicates with Maota’s consciousness in a spiritual dimension. He discovers that he can will his cylinder with his mind to return to his physical body, traversing between the physical and spiritual realms. This infuriates Maota who can never return to his body and feels pushed and tricked by Michaelson. \n"
              },
              {
                "worker_id": "2",
                "uid": "2420fc8cdf2145dfab0ca4800c4e36fd",
                "response_text": "Michaelson is an archeologist from Earth living on Alpha Centaurus II. He discovers an ancient, hidden city that is remarkably well preserved and half a million years old. He notices an older, webfooted man watching him as he explores the ancient city. The older man, named Maota, tells Michaelson that he is trespassing in the city, which is sacred ground where the spirits may one day return. Maota identifies himself as the city's keeper and warns Michaelson that he is angering the gods. Still, Michaelson pays him little attention because he is so wrapped up in his discovery. Maota warns Michaelson to leave or be killed, but Michaelson continues to ignore Maota and collect and inspect artifacts.\n\tMichaelson talks about building a museum there, showcasing the artifacts, and inviting people to come and see everything. Extremely angry and frustrated, Maota throws one of the ancient books at Michaelson, knocking him out. Later, Michaelson studies the book, opening it and running his finger over the writing, which creates the sound of a voice—the book talks! Inside a tall building, Michaelson observes a clock-like object, touching it and discovering it is warm and vibrating. Amazingly, the device is still operating.\n\tMaota returns in the morning, apologizes for hitting Michaelson, saying he should have killed him. He has brought a weapon with him. Michaelson asks Maota to read to him from the book before he kills him, and Maota agrees, telling Michaelson that it is a book of poetry. Michaelson dismisses the book as unimportant, wondering why the ancient ones didn’t leave books about history or mathematics instead, but he wants to hear it read and asks Maota to read some to him. Then, Maota prepares to shoot Michaelson, but Michaelson uses his cylinder to jump behind Maota before he fires. The two wrestle over the weapon, and it fires a shot into the sand near the book. Together they dig through the sand to find the book, but it is gone. Finally, Maota says he is giving up and going away but not leaving the city. Michaelson is perplexed by the paradoxical statement, but Maota says he doesn’t know enough to explain it. However, he tells Michaelson that he has read the ancient race’s books and knows they conquered all diseases, explored all the mysteries of science, and devised the clock-type machine to cheat death. \n\tMaota presses the button on the clock machine, and it makes noises. Then Maota’s knees buckle, and he is dead. Michaelson buries the body and continues his study of the city, learning the language and reading the books. Then he decides to use the clock device to see what it does. His body collapses, but his mind joins Maota’s. Sad to see his body, Michaelson touches it and feels a vibration of life. He suspects that his cylinder is responsible for his journey, and if that’s right, he should be able to use it to return. He tries, and it works.\n"
              },
              {
                "worker_id": "8",
                "uid": "37e404b5be454e8cbe8b235c1ffb82ca",
                "response_text": "Mr. Michaelson is an archeologist from Earth who visits the ruins of an unnamed, 500,000-year-old city on Alpha Centaurus II. He uses an implant behind his ear to transport himself there instantaneously, and he excitedly explores the sand-covered streets and complex varieties of buildings he discovers. Soon after his arrival, he encounters an old man he quickly identifies as one of the webfooted natives. As he continues exploring, the native man approaches him and orders him to leave since Mr. Michaelson is trespassing on sacred ground and making the spirits angry. Mr. Michaelson refuses, and the native man threatens to kill him if he does not leave. As night falls, Michaelson continues to uncover artifacts left behind by the city’s disappeared inhabitants. The native man returns to ask why Michaelson has not left as instructed, and he introduces himself as Maota; Maota believes Michaelson is a god because of his fascination with the city and its artifacts. Michaelson tries to recruit Maota into helping him preserve the city for posterity, but Maota refuses. Instead, he hits Michaelson in the head with an ancient book he is carrying. When Michaelson awakens, he uses his implant to beam to a small creek where he cleans his wound. When he returns, he discovers the book Maota had used to hit him. He believes he hears the book speaking to him in a strange language. Startled, he returns to a clock-like device he had seen earlier. When he touches the clock, he finds it warm, which frightens him. Michaelson leaves the building and falls asleep. When he awakens later, he finds Maota standing over him, who informs him the book is full of ancient poetry and then says he will kill Michaelson for not leaving the city. Michael asks Maota to read to him from the book before he dies, and Maota obliges. When the book's pages begin to blow in the wind, Maota takes this as proof of the existence of spirits. When Michaelson mocks Maota again, Maota rages and points his gun at him. Michaelson uses his implant to appear behind Maota; the two struggle for control of the gun. They accidentally shoot the book into oblivion. Because of Michaelson's implant, Maota once again believes he is a god, but Michaelson explains to him that it is artificial. Convinced that Michaelson is only human, Maota announces that he is going away, and he offers to show Michaelson how. Maota reveals that the ancient race had not died out; instead, they had used the clock-like device to transfer themselves to a kind of fourth dimension, where they could observe and communicate outside the constraints of a physical body. Maota triggers the device, and his body slumps over. Michaelson buries him and later triggers the device too, finding himself reunited with Maota in the fourth dimension. However, unlike Maota, Michaelson discovers he is able to zoom between dimensions thanks to his implant, which convinces Maota that Michaelson is a devil rather than a god."
              },
              {
                "worker_id": "6",
                "uid": "4e5c7e49a76a41579bec7d8ff52cf8ed",
                "response_text": "Mr. Michaelson is a human archaeologist currently exploring Alpha Centaurus II. He comes across the ruins of an ancient city. He walks to it slowly, seeing someone in the distance, but is relieved when he realizes it’s just a webfoot. He explores the city, digging through the sand and rubble to find beautiful artifacts from half a million years ago. He is soon stopped by the webfoot, who explains that Michaelson must leave immediately lest he anger the spirits. He introduces himself as keeper of the city which Michaelson finds amusing. Maota believes that the city must remain untouched so the spirits would not be lost in the darkness. He tells Michaelson to leave quickly or else he will be killed. Michaelson does not leave but continues exploring. His cylinder, a contraption worn above the ear, could transport him back home in a heartbeat, but he decides not to use it yet. Maota approaches Michaelson again, scolding him for not leaving when asked. He calls him “Earthgod,” and says that no human could travel the way he does. They fight about the city and whether or not to leave it alone until Maota strikes Michaelson with a book, knocking him out. \nWhen Michaelson regains consciousness, he travels to a nearby river to wash the blood out of his hair, then pops back into the city. He leafs through the book and discovers that it talks. Entering a building, Michaelson decides to reach out and touch the object that confused him most. It almost looked like a clock, but it was clearly different. It’s warm to the touch. Running back outside, he passes out in the street. He wakes up to Maota standing over him with a gun. Michaelson convinces him to read some of the book aloud, which is the only poetry book in the city. Maota then attempts to kill him, but Michaelson simply travels behind Maota and punches him before he could fire. They fight for Maota’s weapon until it goes off, blasting a hole in the earth. The book was destroyed in the blast. \nMaota grieves the book, and Michaelson explains how he uses the cylinder to travel. Michaelson asks Maota where he’s going to go, and Maota decides to take him along. They travel to his house, and Maota points to the clock on the wall. He explains that he believes it allows people to travel to another dimension, and he has decided to use it. He pushes a button and slumps to the floor.\nMichaelson spends the next few weeks learning the ancient language and exploring the city before his curiosity got the better of him. He decides to press the button and travels through the darkness before hearing Maota’s voice. He sees his body below, and Maota reveals that no one can leave this other place. Michaelson decides to use his cylinder and travels back to Alpha Centaurus II. He pushes the button again, only to hear Maota’s screams. He can travel between dimensions. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "10",
                "uid": "c1c18cbd52da45c7aace6bbbc422b137",
                "response_text": "The story is set on Alpha Centaurus II, a planet with two moons and many unknowns and dangers. There is an Earth settlement on the planet, and the archeologist, Mr. Michaelson traverses around a sandy, desert-like area under a pale blue sky come to be referred to as the dead city which was last populated half a million years ago.\nThe dead city is a complex variety of buildings, including small homes, huge ones with spires, and all varieties of square and spherical shapes. Suspension bridges connected conical towers. Desert plants grew from rooftops and sand had blown down the streets and filled the doorways. Despite not believing in the spiritual, Mr. Michaelson experiences waves of energy communicating with him from the artifacts he finds in the dead city, giving it the feel of not being deserted at all.\nThrough the discovery of an important artifact (the “clock) that is radiating heat. The two characters Maota and Mr. Michaelson also discover that they can travel into a spiritual dimension setting where they look down on the planet, or anywhere in the universe, and communicate with their thoughts.\n"
              },
              {
                "worker_id": "2",
                "uid": "2420fc8cdf2145dfab0ca4800c4e36fd",
                "response_text": "The story takes place on Alpha Centaurus II in the ancient remains of a city heretofore unknown by humans and where there are twin moons. The half a million year old city consists of both small and large buildings, with the smaller ones presumably houses. Some of the tall buildings have spires; some are square, while others are ellipsoid or spheroid. Elegant bridges connect tall towers. The structures are well preserved, although any inscriptions that were made have long since worn away. Piles of sand fill the doorways, and desert plants grow on rooftops. Artifacts are everywhere, some buried in the sand, including bowls, statues, and even books. A clock-like object is particularly fascinating, especially after Michaelson touches it to find it warm and vibrating—meaning that it is still operational. Many of the structures and objects are made of metal which has helped preserve them for such a long time. The book that Maota throws are Michaelson has metal pages and, surprisingly, speaks when Michaelson runs his fingers along the lines of text. \n\tHumans at this time have advanced technology for travel. They have invented personalized devices in the shape of a cylinder implanted behind a person's ear. With this device, the person can think of a place he wants to travel to, and the device instantly whisks him there. \n"
              },
              {
                "worker_id": "8",
                "uid": "37e404b5be454e8cbe8b235c1ffb82ca",
                "response_text": "The story takes place in an old city on Alpha Centaurus II. Not much is revealed about the planet itself except for the fact that it has a small population of webfooted humanoids who are not actually natives but come from a colony from the fifth planet of the system. They are curious and many are quite intelligent, including Maota, whom Michaelson meets when he arrives in the city. White clouds float in a pale blue sky, and at night silver moonlight from the two moons illuminates the ruins. Five hundred miles from the city is a small creek where Michaelson washes his head wound. The city itself is covered in sand and desert plants after hundreds of thousands of years of disuse. However, the buildings remain intact and include a complex variety of small homes, spire-topped, square, ellipsoid, and spheroid buildings. There are also conical towers with beautiful bridges connecting them. The ruins of the city are well-preserved and include a large number of fascinating archeological artifacts including bowls, metal, a small statue of a man, ancient books (including Maota's favorite book of poetry), and a clock-like device that can transport a person to another dimension. Just outside of the city is a sandy hill, where Michaelson eventually buries Maota's body. The final setting of the story is the fourth dimension where Maota and Michaelson transfer their spirits using the clock device. This dimension is characterized by utter silence and darkness. The only presence there is awareness and memory."
              },
              {
                "worker_id": "6",
                "uid": "4e5c7e49a76a41579bec7d8ff52cf8ed",
                "response_text": "A City Near Centaurus by Bill Doede takes place on the planet Alpha Centaurus II sometime in the future. Mr. Michaelson comes across the ruins of an ancient city and walks through the sand-covered streets to discover more. Tall spires cast shadows across the roads, while wild plants grow out of the roofs of small buildings. Two moons shine light down on Alpha Centaurus II partially lighting up the night. Soaring towers are connected by swaying bridges, and smaller buildings clearly used to be houses. Each building has a slightly different shape whether that be spherical or square. The infrastructure is built of dark metal impervious to rust and general wear. The buildings themselves are full of various artifacts: talking books, transporting clocks, and silver bowls. "
              }
            ]
          },
          {
            "question_text": "Who is Mr. Michaelson and what is his personality like?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "10",
                "uid": "c1c18cbd52da45c7aace6bbbc422b137",
                "response_text": "Mr. Michaelson is a determined, tall, gaunt archeologist who enjoys finding artifacts and methodically undergoes the process of discovering and unearthing things, like this dead city on Alpha Centaurus II. His wife died many years ago back on Earth, and he has no children and no friends in the Earth settlement. He has a tiny cylinder in the flesh behind his ear that allows him to teleport instantly to a different location when touched.\nHe does not believe in the spiritual, and rejects that the dead city he stumbles across even needs a keeper, offending Maota greatly who refers to him as “Mr. Earthgod.”\nMr. Michaelson is ignorant and pushy towards Maota, not heeding his warnings or respecting his appeals to leave because it is angering the gods. Instead, Mr. Michaelson can’t understand why Maota won’t negotiate with him, almost as if he is entitled to take possession of the secrets and artifacts of the dead city\n"
              },
              {
                "worker_id": "2",
                "uid": "2420fc8cdf2145dfab0ca4800c4e36fd",
                "response_text": "Michaelson is an Earthman on Alpha Centaurus II and an archeologist. At first, he seems to be a cheerful, pleasant man as he explores the ruins of the dead city because he is smiling to himself, exclaiming about his finds, marveling, and chuckling. He is, indeed, extremely interested in his findings. At the same time, however, he is stubborn, strong headed, and determined and treats Maota with condescension and even rudeness, questioning Maota’s need to protect a dead city, denying Maota’s belief that the spirits will return there, and dismissing his faith as superstition. Michaelson is also convinced that his views are right and that anyone else’s are wrong. For example, he is impressed with the talking book until he learns that it is a book of poetry; then, he considers it a waste. He believes books about mathematics or history are much more valuable. On the other hand, he is eager to hear Maota read the book, and the sounds of the words, even though he cannot understand them, move him and remind him the lost people were human with human sentiments and passions. When Maota decides to leave but indicates he is going in a direction Michaelson doesn’t know, Michaelson calls him stupid outright. Michaelson is curious to decipher the ancient peoples’ language and devotes hours to doing so. He then spent weeks trying to learn more about the clock device. When he can’t find anything out about it, he finally decides to push the button to experience its effects.\n\n"
              },
              {
                "worker_id": "8",
                "uid": "37e404b5be454e8cbe8b235c1ffb82ca",
                "response_text": "Mr. Michaelson is an archeologist from Earth who uses a cylindrical implant placed behind his ear to travel instantly from Earth to Alpha Centaurus II. He wants to explore an old city whose inhabitants had mysteriously vanished. Michaelson's wife had died many years prior to his arrival at Alpha Centaurus II, and he has neither children nor friends in the Earth settlement where he lives. Mr. Michaelson is compelled by his curiosity and his interest in preserving historical artifacts for posterity. When he first arrives in the city, he excitedly explores the unique buildings in spite of the sand and cobwebs; he eagerly investigates the various artifacts he finds, and he makes a small pile of them that he intends to investigate further. Michaelson acknowledges the intelligence of the webfooted natives, but he still treats Maota with a great deal of dismissiveness and condescension when Maota insists on the presence of sacred spirits in the city. Michaelson is a man of science and does not have much patience for the mysticism Maota espouses. He also shrugs off Maota's persistent threats to kill him and tries to convince him to support his preservation efforts. However, Michaelson does have some sense of self-preservation, which he displays in his fight with Maota. By the end of the story, Michaelson's scientific curiosity merges with a newly-discovered spiritual awareness when he realizes he can zoom in and out of dimensions by combining the powers of the clock-like device with his own cylindrical implant."
              },
              {
                "worker_id": "6",
                "uid": "4e5c7e49a76a41579bec7d8ff52cf8ed",
                "response_text": "Mr. Michaelson is an Earthman without any close connections. His wife passed away many years back, and they never had any children together. Without anything truly tying him down, Michaelson is able to fully devote himself to his work without any distractions. As an archaeologist, he wants to discover more about ancient cultures, the way they thought, and the things they created. When he discovers the ancient city that the webfoots kept from the Earthmen, he instantly sorts through the sand and piles artifacts in the street. He plans on building a museum there where all mankind can come and see what life was like in this city half a million years ago. Mr. Michaelson is inherently curious and a little impulsive, shown time and time again when he chose to ignore Maota’s warnings. \nHis cylinder, tailored to Michaelson specifically, makes him a god in the eyes of Maota since he can transport himself between places in the blink of an eye. However, just like Maota, Michaelson is able to grow old and die like any other human. \n"
              }
            ]
          },
          {
            "question_text": "Who is the webfoot and what is his personality like?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "10",
                "uid": "c1c18cbd52da45c7aace6bbbc422b137",
                "response_text": "The webfoot, real name Maota (also referred to as “the native” by Mr. Michaelson), is the self-proclaimed keeper of the dead city on Alpha Centaurus II. He is an older man of at least sixty or seventy years, short in stature with long gray hair to his shoulders. The toes of his webbed, bare feet drag in the sand as he walks making a trail behind him.  \nMaota is sturdy in his beliefs that the dead city needs to be protected, and that the gods are being disrupted by Mr. Michaelson. He feels strongly enough about it that he resorts to physical violence on two occasions - hitting Mr. Michaelson with a book over the head, and firing a gun-like weapon at him. Although he is angry and violent with Mr. Michaelson, he also shows remarkable tolerance for him. \nMaota’s ultimate duty, he believes, is to the gods. This brings him turmoil when he thinks he missed the chance the gods gave him to kill Mr. Michaelson, and even apologized to him directly for instead letting him suffer with a head wound instead of killing him. There is a reference to them perhaps having met before when Michaelson says tauntingly to Maota, “You never told us about this old dead city… Shame on you. But never mind. I've found it now. Isn't it beautiful?” Thus, Maota is also motivated to protect the dead city at all costs, perhaps even concealing its location. \n"
              },
              {
                "worker_id": "2",
                "uid": "2420fc8cdf2145dfab0ca4800c4e36fd",
                "response_text": "The webfoot is named Maota, and he is the guardian of the ancient dead city on Alpha Centaurus II. His people are not natives of the planet but originated from a colony from the system's fifth planet. These people are curious and sometimes highly intelligent, although they are not educated. Maota himself is an older man, perhaps sixty or seventy years old, short with long gray hair. He wears no shoes, and his toes drag in the sand as he walks. Maota is upset when he finds Michaelson trespassing in the dead city and urgently informs him that he is on sacred ground and must leave. Maota tells Michaelson that the spirits are angry that he is there and indicates the spirits might return; that is why he guards the city. When Michaelson pays no heed to the order to leave, Maota grows angry, warning Michaelson that even his steps or breath may be detrimental to the spirits and he must leave now or be killed. When his warning falls on deaf ears, Maota resorts to flattery, saying that it takes a sensitive god to feel the spirits moving in the houses and walking in the old street, thus implying that Michaelson is not only a god but one with the sensitivity required to detect the history and spirits of the place. \nHowever, when Michaelson tells Maota his plan to build a museum and display everything for others to come and see, Maota loses his temper and throws one of the ancient books at Michaelson, hitting him in the back of the head and knocking him unconscious. After Michaelson stays in the city overnight, Maota approaches him with a weapon, intent on killing him. Maota believes he has reasoned logically with Michaelson and given him enough warnings that he should have left; he isn’t interested in negotiating with Michaelson because the only satisfactory outcome is for Michaelson to leave and never come back. He is prepared to kill Michaelson with his tube gun. Maota is willing to entertain Michaelson’s last request, which is for Maota to read to him from the book. He does, but he still insists Michaelson must die. The city must be preserved for the spirits, not a show for people who may not appreciate it or the spirits. Maota’s great sensitivity and reverence for the spirits lead to his great despair when the book of poetry is destroyed. When he is unsuccessful at driving Michaelson away, he chooses the last resort—using the device that kills his human body but allows his mind to live on.\n"
              },
              {
                "worker_id": "8",
                "uid": "37e404b5be454e8cbe8b235c1ffb82ca",
                "response_text": "The webfooted man's name is Maota, and he is part of a group of people who live on Alpha Centaurus II, far away from the old city where Michaelson meets him. Although they make their home on Alpha Centaurus II, the webfooted people are originally from a colony on the fifth planet in the system. Michaelson wonders why Maota is so far from his people when they first meet. Maota stays in the city because he believes strongly in the presence of spirits, and he spends his days roaming the streets feeling their presence and reading an ancient book of poetry. Maota bemoans Michaelson's presence because he believes his interest in preserving the city for posterity disturbs the spirits and would potentially violate the beauty and magic of the city. Because of Michaelson's teleportation implant, Maota believes Michaelson is a god, and so he feels he must kill Michaelson if he will not leave because mortals cannot negotiate wit\nh gods. Once Michaelson convinces Maota he is just a human, Maota feels disappointed because he had hoped Michaelson would join him in his practice of thinking the ancient thoughts. As such, Maota leads Michaelson to a room where he keeps a clock-like device that he triggers. Then, Maota appears to die. In actuality, his spirit has been transferred to another dimension. When Michaelson joins him there and demonstrates how he can zoom in between dimensions using his implant, Maota starts to believe Michaelson is a devil."
              },
              {
                "worker_id": "6",
                "uid": "4e5c7e49a76a41579bec7d8ff52cf8ed",
                "response_text": "Maota is a webfoot that lives on Alpha Centaurus II. He is older, around 60 or 70 years of age, and the lines on his face show it. He is a human with normal human features, aside from his webbed feet. He does not wear shoes but chooses to walk barefoot. With long, gray hair and relatively short stature, Maota is a weathered man. He takes his self-assigned role as keeper of the city very seriously and will act violently if need be. Maota is very spiritual, shown through his belief that tampering with the city will upset the spirits should they choose to return home. Although he is somewhat patient with Michaelson at first, he chooses his duty over Michaelson’s curiosity. He attempts to kill him twice but to no avail, which shows his true dedication to the city. In the end, when he is trapped in the so-called fourth dimension, Maota is incredibly angry when Michaelson, an alleged god with his cylinder, is able to travel between planes while he is stuck there. "
              }
            ]
          },
          {
            "question_text": "What is the cylinder and why is it significant?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "10",
                "uid": "c1c18cbd52da45c7aace6bbbc422b137",
                "response_text": "The cylinder is an implement tailored to Mr. Michaelson that is tucked behind his ear and will allow him to go anywhere that he desires when it is pressed. He uses it several times in the story to travel to physical places, disappearing immediately and reappearing in a new location. Once, to travel to a cold stream to wash his bleeding wounds after being hit on the head with a book by Maota, and a second time to avoid being killed by Maota firing a weapon to kill him.\nAfter Maota presses the button of the “clock” in the dead city and appears to drop dead. Mr. Michaelson desperately attempts to gain the knowledge to understand what the clock device does. Rather radically, he decides that he must press the button to fully understand, not completely knowing that he won’t die when he does. When Mr. Michaelson sees his dead body below him in the city and communicates wordlessly with Maota in this spiritual dimension he begins to panic and search for ways to get back into his body. This is how he discovers that he can will the cylinder with his mind, and return into his physical body by doing so. Through this act he can traverse between the physical and spiritual realms, which ultimately makes him considered a god by Maota (greatly angering him).\n"
              },
              {
                "worker_id": "2",
                "uid": "2420fc8cdf2145dfab0ca4800c4e36fd",
                "response_text": "The cylinder is a small device inserted under the flesh behind Michaelson’s ear and transports him to other locations instantly, operated by his thoughts. Each cylinder is tailored to the person for whom it is intended and will not work for anyone else. It instantly sends him 500 miles across the desert to a creek where he can wash and cool off after his head injury. The cylinder saves his life twice: first in the fight with Maota when Maota points the tube gun at him. Michaelson uses the cylinder to jump out of Maota’s line of sight and land behind him. The second time it saves his life is when he uses the clock device. Michaelson’s lifeless body is left behind as his mind journey’s to where Maota’s is, a place from which there is no return. However, Michaelson remembers the cylinder and tries to use it to return to his body, and it works. The cylinder, not the clock device, actually sent him to where Maota’s mind went.  \n"
              },
              {
                "worker_id": "8",
                "uid": "37e404b5be454e8cbe8b235c1ffb82ca",
                "response_text": "The cylinder is a small, artificial implant that Mr. Michaelson receives behind his ear. The implant allows him to travel any distance, great or small, instantaneously and is triggered by a thought. The implant enables Michaelson to travel from Earth to Alpha Centaurus II, and he uses the implant again to locate the old city that he explores on foot. After Maota injures Michaelson with the poetry book, he uses the implant to transport himself to a small creek where he washes away the caked blood from his hair.  Later, Michaelson again triggers the implant to avoid being shot by Maota when he attempts to kill him. Maota indicates he believes Michaelson is a god because of his ability to travel any distance in the blink of an eye. When Maota demonstrates the power of the clock-like device to transfer a person's spirit to another dimension, Michaelson realizes he maintains a connection to his corporeal body via the cylindrical implant. He uses this realization to his advantage by triggering the implant, which allows him to go back and forth between the fourth dimension and his corporeal form."
              },
              {
                "worker_id": "6",
                "uid": "4e5c7e49a76a41579bec7d8ff52cf8ed",
                "response_text": "The cylinder is an innovative invention shared among Earthmen. It allows the person wearing it to travel between places in the blink of an eye. Michaelson wears his cylinder above the ear, and it is specifically tailored to his being. This device becomes incredibly important in the story as Michaelson uses it several times throughout his time in the ancient ruins. The first instance of significance was when Maota attempted to kill Michaelson with his weapon, but Michaelson simply disappeared in front of his eyes, only to reappear behind him and knock him out with a well-timed blow. The cylinder saved his life then and elevated him to god-like status in Maota’s eyes. \nAfter Maota travels through the mysterious clock and presumably dies, Michaelson spends several weeks deciding what to do. When he finally hits the button, his body also falls, just like Maota’s, and he regains consciousness in a spirit world where he can see everything on any planet he wants. Maota tells him that no one is able to leave, no matter how hard they try, and that they are stuck in this plane of existence. Michaelson, however, is able to use his cylinder to travel out of that dimension and back onto the planet. He does it again to prove that it truly works, leaving Maota crying out in anger. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5007,
        "document_length_chars": 28701
      }
    }
  ]
}