{
  "item_metadata": {
    "item_id": "50818",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "50818",
      "content": "HOW TO MAKE FRIENDS\n \n \n By JIM HARMON\n \n Illustrated by WEST\n \n [Transcriber's Note: This etext was produced from Galaxy Magazine October 1962. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n\n Every lonely man tries to make friends. Manet just didn't know when to stop!\n \n \n \n William Manet was alone.\n \n In the beginning, he had seen many advantages to being alone. It would give him an unprecedented opportunity to once and for all correlate loneliness to the point of madness, to see how long it would take him to start slavering and clawing the pin-ups from the magazines, to begin teaching himself classes in philosophy consisting of interminable lectures to a bored and captive audience of one.\n \n He would be able to measure the qualities of peace and decide whether it was really better than war, he would be able to get as fat and as dirty as he liked, he would be able to live more like an animal and think more like a god than any man for generations.\n \n But after a shorter time than he expected, it all got to be a tearing bore. Even the waiting to go crazy part of it.\n \n Not that he was going to have any great long wait of it. He was already talking to himself, making verbal notes for his lectures, and he had cut out a picture of Annie Oakley from an old book. He tacked it up and winked at it whenever he passed that way.\n \n Lately she was winking back at him.\n \n Loneliness was a physical weight on his skull. It peeled the flesh from his arms and legs and sandpapered his self-pity to a fine sensitivity.\n \n No one on Earth was as lonely as William Manet, and even William Manet could only be this lonely on Mars.\n \n Manet was Atmosphere Seeder Station 131-47's own human.\n \n All Manet had to do was sit in the beating aluminum heart in the middle of the chalk desert and stare out, chin cupped in hands, at the flat, flat pavement of dirty talcum, at the stars gleaming as hard in the black sky as a starlet's capped teeth ... stars two of which were moons and one of which was Earth. He had to do nothing else. The whole gimcrack was cybernetically controlled, entirely automatic. No one was needed here—no human being, at least.\n \n The Workers' Union was a pretty small pressure group, but it didn't take much to pressure the Assembly. Featherbedding had been carefully specified, including an Overseer for each of the Seeders to honeycomb Mars, to prepare its atmosphere for colonization.\n \n They didn't give tests to find well-balanced, well-integrated people for the job. Well-balanced, well-integrated men weren't going to isolate themselves in a useless job. They got, instead, William Manet and his fellows.\n \n The Overseers were to stay as long as the job required. Passenger fare to Mars was about one billion dollars. They weren't providing commuter service for night shifts. They weren't providing accommodations for couples when the law specified only one occupant. They weren't providing fuel (at fifty million dollars a gallon) for visits between the various Overseers. They weren't very providential.\n \n But it was two hundred thousand a year in salary, and it offered wonderful opportunities.\n \n It gave William Manet an opportunity to think he saw a spaceship making a tailfirst landing on the table of the desert, its tail burning as bright as envy.\n \n \n\n \n Manet suspected hallucination, but in an existence with all the pallid dispassion of a requited love he was happy to welcome dementia. Sometimes he even manufactured it. Sometimes he would run through the arteries of the factory and play that it had suddenly gone mad hating human beings, and was about to close down its bulkheads on him as sure as the Engineers' Thumb and bale up the pressure-dehydrated digest, making so much stall flooring of him. He ran until he dropped with a kind of climaxing release of terror.\n \n So Manet put on the pressure suit he had been given because he would never need it, and marched out to meet the visiting spaceship.\n \n He wasn't quite clear how he came from walking effortlessly across the Martian plain that had all the distance-perpetuating qualities of a kid's crank movie machine to the comfortable interior of a strange cabin. Not a ship's cabin but a Northwoods cabin.\n \n The black and orange Hallowe'en log charring in the slate stone fireplace seemed real. So did the lean man with the smiling mustache painted with the random designs of the fire, standing before the horizontal pattern of chinked wall.\n \n \"Need a fresher?\" the host inquired.\n \n Manet's eyes wondered down to heavy water tumbler full of rich, amber whiskey full of sparks from the hearth. He stirred himself in the comfortingly warm leather chair. \"No, no, I'm fine .\" He let the word hang there for examination. \"Pardon me, but could you tell me just what place this is?\"\n \n The host shrugged. It was the only word for it. \"Whatever place you choose it to be, so long as you're with Trader Tom. 'Service,' that's my motto. It is a way of life with me.\"\n \n \"Trader Tom? Service?\"\n \n \"Yes! That's it exactly. It's me exactly. Trader Tom Service—Serving the Wants of the Spaceman Between the Stars. Of course, 'stars' is poetic. Any point of light in the sky in a star. We service the planets.\"\n \n Manet took the tumbler in both hands and drank. It was good whiskey, immensely powerful. \"The government wouldn't pay for somebody serving the wants of spacemen,\" he exploded.\n \n \"Ah,\" Trader Tom said, cautionary. He moved nearer the fire and warmed his hands and buttocks. \"Ah, but I am not a government service. I represent free enterprise.\"\n \n \n\n \n \"Nonsense,\" Manet said. \"No group of private individuals can build a spaceship. It takes a combine of nations.\"\n \n \"But remember only that businessmen are reactionary. It's well-known. Ask anyone on the street. Businessmen are reactionary even beyond the capitalistic system. Money is a fiction that exists mostly on paper. They play along on paper to get paper things, but to get real things they can forego the papers. Comprehend, mon ami ? My businessmen have gone back to the barter system. Between them, they have the raw materials, the trained men, the man-hours to make a spaceship. So they make it. Damned reactionaries, all of my principals.\"\n \n \"I don't believe you,\" Manet stated flatly. His conversation had grown blunt with disuse. \"What possible profit could your principals turn from running a trading ship among scattered exploration posts on the planets? What could you give us that a benevolent government doesn't already supply us with? And if there was anything, how could we pay for it? My year's salary wouldn't cover the transportation costs of this glass of whiskey.\"\n \n \"Do you find it good whiskey?\"\n \n \"Very good.\"\n \n \"Excellent?\"\n \n \"Excellent, if you prefer.\"\n \n \"I only meant—but never mind. We give you what you want. As for paying for it—why, forget about the payment. You may apply for a Trader Tom Credit Card.\"\n \n \"And I could buy anything that I wanted with it?\" Manet demanded.\n\"That's absurd. I'd never be able to pay for it.\"\n \n \"That's it precisely!\" Trader Tom said with enthusiasm. \"You never pay for it. Charges are merely deducted from your estate .\"\n \n \"But I may leave no estate!\"\n \n Trader Tom demonstrated his peculiar shrug. \"All businesses operate on a certain margin of risk. That is our worry.\"\n \n \n\n \n Manet finished the mellow whiskey and looked into the glass. It seemed to have been polished clean. \"What do you have to offer?\"\n \n \"Whatever you want?\"\n \n Irritably, \"How do I know what I want until I know what you have?\"\n \n \"You know.\"\n \n \"I know? All right, I know. You don't have it for sale.\"\n \n \"Old chap, understand if you please that I do not only sell . I am a trader—Trader Tom. I trade with many parties. There are, for example ... extraterrestrials.\"\n \n \"Folk legend!\"\n \n \"On the contrary, mon cher , the only reality it lacks is political reality. The Assembly could no longer justify their disposition of the cosmos if it were known they were dealing confiscation without representation. Come, tell me what you want.\"\n \n Manet gave in to it. \"I want to be not alone,\" he said.\n \n \"Of course,\" Trader Tom replied, \"I suspected. It is not so unusual, you know. Sign here. And here. Two copies. This is yours. Thank you so much.\"\n \n Manet handed back the pen and stared at the laminated card in his hand.\n \n \n\n \n When he looked up from the card, Manet saw the box. Trader Tom was pushing it across the floor towards him.\n \n The box had the general dimensions of a coffin, but it wasn't wood—only brightly illustrated cardboard. There was a large four-color picture on the lid showing men, women and children moving through a busy city street. The red and blue letters said:\n \n \n LIFO\n   The Socialization Kit\n \n \n \"It is commercialized,\" Trader Tom admitted with no little chagrin.\n\"It is presented to appeal to a twelve-year-old child, an erotic, aggressive twelve-year-old, the typical sensie goer—but that is reality. It offends men of good taste like ourselves, yet sometimes it approaches being art. We must accept it.\"\n \n \"What's the cost?\" Manet asked. \"Before I accept it, I have to know the charges.\"\n \n \"You never know the cost. Only your executor knows that. It's the Trader Tom plan.\"\n \n \"Well, is it guaranteed?\"\n \n \"There are no guarantees,\" Trader Tom admitted. \"But I've never had any complaints yet.\"\n \n \"Suppose I'm the first?\" Manet suggested reasonably.\n \n \"You won't be,\" Trader Tom said. \"I won't pass this way again.\"\n \n \n\n \n Manet didn't open the box. He let it fade quietly in the filtered but still brilliant sunlight near a transparent wall.\n \n Manet puttered around the spawning monster, trying to brush the copper taste of the station out of his mouth in the mornings, talking to himself, winking at Annie Oakley, and waiting to go mad.\n \n Finally, Manet woke up one morning. He lay in the sheets of his bunk, suppressing the urge to go wash his hands, and came at last to the conclusion that, after all the delay, he was mad.\n \n So he went to open the box.\n \n The cardboard lid seemed to have become both brittle and rotten. It crumbled as easily as ideals. But Manet was old enough to remember the boxes Japanese toys came in when he was a boy, and was not alarmed.\n \n The contents were such a glorious pile of junk, of bottles from old chemistry sets, of pieces from old Erector sets, of nameless things and unremembered antiques from neglected places, that it seemed too good to have been assembled commercially. It was the collection of lifetime.\n \n On top of everything was a paperbound book, the size of the Reader's Digest , covered in rippled gray flexiboard. The title was stamped in black on the spine and cover: The Making of Friends .\n \n Manet opened the book and, turning one blank page, found the title in larger print and slightly amplified: The Making of Friends and Others . There was no author listed. A further line of information stated: \"A Manual for Lifo, The Socialization Kit.\" At the bottom of the title page, the publisher was identified as: LIFO KIT CO., LTD., SYRACUSE.\n \n The unnumbered first chapter was headed Your First Friend .\n \n Before you go further, first find the Modifier in your kit. This is vital .\n \n He quickly riffled through the pages. Other Friends, Authority, A Companion .... Then The Final Model . Manet tried to flip past this section, but the pages after the sheet labeled The Final Model were stuck together. More than stuck. There was a thick slab of plastic in the back of the book. The edges were ridged as if there were pages to this section, but they could only be the tracks of lame ants.\n \n Manet flipped back to page one.\n \n First find the Modifier in your kit. This is vital to your entire experiment in socialization. The Modifier is Part #A-1 on the Master Chart.\n \n He prowled through the box looking for some kind of a chart. There was nothing that looked like a chart inside. He retrieved the lid and looked at its inside. Nothing. He tipped the box and looked at its outside. Not a thing. There was always something missing from kits. Maybe even the Modifier itself.\n \n He read on, and probed and scattered the parts in the long box. He studied the manual intently and groped out with his free hand.\n \n The toe bone was connected to the foot bone....\n \n \n\n \n The Red King sat smugly in his diagonal corner.\n \n The Black King stood two places away, his top half tipsy in frustration.\n \n The Red King crabbed sideways one square.\n \n The Black King pounced forward one space.\n \n The Red King advanced backwards to face the enemy.\n \n The Black King shuffled sideways.\n \n The Red King followed....\n \n Uselessly.\n \n \"Tie game,\" Ronald said.\n \n \"Tie game,\" Manet said.\n \n \"Let's talk,\" Ronald said cheerfully. He was always cheerful.\n \n Cheerfulness was a personality trait Manet had thumbed out for him. Cheerful. Submissive. Co-operative. Manet had selected these factors in order to make Ronald as different a person from himself as possible.\n \n \"The Korean-American War was the greatest of all wars,\" Ronald said pontifically.\n \n \"Only in the air,\" Manet corrected him.\n \n Intelligence was one of the factors Manet had punched to suppress. Intelligence. Aggressiveness. Sense of perfection. Ronald couldn't know any more than Manet, but he could (and did) know less. He had seen to that when his own encephalograph matrix had programmed Ronald's feeder.\n \n \"There were no dogfights in Korea,\" Ronald said.\n \n \"I know.\"\n \n \"The dogfight was a combat of hundreds of planes in a tight area, the last of which took place near the end of the First World War. The aerial duel, sometimes inaccurately referred to as a 'dogfight' was not seen in Korea either. The pilots at supersonic speeds only had time for single passes at the enemy. Still, I believe, contrary to all experts, that this took greater skill, man more wedded to machine, than the leisurely combats of World War One.\"\n \n \"I know.\"\n \n \"Daniel Boone was still a crack shot at eight-five. He was said to be warm, sincere, modest, truthful, respected and rheumatic.\"\n \n \"I know.\"\n \n \n\n \n Manet knew it all. He had heard it all before.\n \n He was so damned sick of hearing about Korean air battles, Daniel Boone, the literary qualities of ancient sports fiction magazines, the painting of Norman Rockwell, New York swing, ad nauseum . What a narrow band of interests! With the whole universe to explore in thought and concept, why did he have to be trapped with such an unoriginal human being?\n \n Of course, Ronald wasn't an original human being. He was a copy.\n \n Manet had been interested in the Fabulous Forties—Lt. \"Hoot\" Gibson, Sam Merwin tennis stories, Saturday Evening Post covers—when he had first learned of them, and he had learned all about them. He had firm opinions on all these.\n \n He yearned for someone to challenge him—to say that Dime Sports had been nothing but a cheap yellow rag and, why, Sewanee Review , there had been a magazine for you.\n \n Manet's only consolidation was that Ronald's tastes were lower than his own. He patriotically insisted that the American Sabre Jet was superior to the Mig. He maintained with a straight face that Tommy Dorsey was a better band man than Benny Goodman. Ronald was a terrific jerk.\n \n \"Ronald,\" Manet said, \"you are a terrific jerk.\"\n \n Ronald leaped up immediately and led with his right.\n \n Manet blocked it deftly and threw a right cross.\n \n Ronald blocked it deftly, and drove in a right to the navel.\n \n The two men separated and, puffing like steam locomotives passing the diesel works, closed again.\n \n Ronald leaped forward and led with his right.\n \n Manet stepped inside the swing and lifted an uppercut to the ledge of Ronald's jaw.\n \n Ronald pinwheeled to the floor.\n \n He lifted his bruised head from the deck and worked his reddened mouth.\n\"Had enough?\" he asked Manet.\n \n Manet dropped his fists to his sides and turned away. \"Yes.\"\n \n Ronald hopped up lightly. \"Another checkers, Billy Boy?\"\n \n \"No.\"\n \n \"Okay. Anything you want, William, old conquerer.\"\n \n Manet scrunched up inside himself in impotent fury.\n \n Ronald was maddeningly co-operative and peaceful. He would even get in a fist fight to avoid trouble between them. He would do anything Manet wanted him to do. He was so utterly damned stupid.\n \n Manet's eyes orbitted towards the checkerboard.\n \n But if he were so much more stupid than he, Manet, why was it that their checker games always ended in a tie?\n \n \n\n \n The calendar said it was Spring on Earth when the radio was activated for a high-speed information and entertainment transmission.\n \n The buzzer-flasher activated in the solarium at the same time.\n \n Manet lay stretched out on his back, naked, in front of the transparent wall.\n \n By rolling his eyes back in his head, Manet could see over a hedge of eyebrows for several hundred flat miles of white sand.\n \n And several hundred miles of desert could see him.\n \n For a moment he gloried in the blatant display of his flabby muscles and patchy sunburn.\n \n Then he sighed, rolled over to his feet and started trudging toward Communication.\n \n He padded down the rib-ridged matted corridor, taking his usual small pleasure in the kaleidoscopic effect of the spiraling reflections on the walls of the tubeway.\n \n As he passed the File Room, he caught the sound of the pounding vibrations against the stoppered plug of the hatch.\n \n \"Come on, Billy Buddy, let me out of this place!\"\n \n Manet padded on down the hall. He had, he recalled, shoved Ronald in there on Lincoln's Birthday, a minor ironic twist he appreciated quietly. He had been waiting in vain for Ronald to run down ever since.\n \n In Communication, he took a seat and punched the slowed down playback of the transmission.\n \n \"Hello, Overseers,\" the Voice said. It was the Voice of the B.B.C. It irritated Manet. He never understood how the British had got the space transmissions assignment for the English language. He would have preferred an American disk-jockey himself, one who appreciated New York swing.\n \n \"We imagine that you are most interested in how long you shall be required to stay at your present stations,\" said the Voice of God's paternal uncle. \"As you on Mars may know, there has been much discussion as to how long it will require to complete the present schedule—\" there was of course no \"K\" sound in the word—\"for atmosphere seeding.\n \n \"The original, non-binding estimate at the time of your departure was\n18.2 years. However, determining how long it will take our stations properly to remake the air of Mars is a problem comparable to finding the age of the Earth. Estimates change as new factors are learned. You may recall that three years ago the official estimate was changed to thirty-one years. The recent estimate by certain reactionary sources of two hundred and seventy-four years is not an official government estimate. The news for you is good, if you are becoming nostalgic for home, or not particularly bad if you are counting on drawing your handsome salary for the time spent on Mars. We have every reason to believe our original estimate was substantially correct. The total time is, within limits of error, a flat 18 years.\"\n \n A very flat 18 years, Manet thought as he palmed off the recorder.\n \n He sat there thinking about eighteen years.\n \n He did not switch to video for some freshly taped westerns.\n \n Finally, Manet went back to the solarium and dragged the big box out. There was a lot left inside.\n \n One of those parts, one of those bones or struts of flesh sprayers, one of them, he now knew, was the Modifier.\n \n The Modifier was what he needed to change Ronald. Or to shut him off.\n \n If only the Master Chart hadn't been lost, so he would know what the Modifier looked like! He hoped the Modifier itself wasn't lost. He hated to think of Ronald locked in the Usher tomb of the File Room for 18 flat years. Long before that, he would have worn his fists away hammering at the hatch. Then he might start pounding with his head. Perhaps before the time was up he would have worn himself down to nothing whatsoever.\n \n Manet selected the ripple-finished gray-covered manual from the hodgepodge, and thought: eighteen years.\n \n Perhaps I should have begun here, he told himself. But I really don't have as much interest in that sort of thing as the earthier types. Simple companionship was all I wanted. And, he thought on, even an insipid personality like Ronald's would be bearable with certain compensations.\n \n Manet opened the book to the chapter headed: The Making of a Girl .\n \n \n\n \n Veronica crept up behind Manet and slithered her hands up his back and over his shoulders. She leaned forward and breathed a moist warmth into his ear, and worried the lobe with her even white teeth.\n \n \"Daniel Boone,\" she sighed huskily, \"only killed three Indians in his life.\"\n \n \"I know.\"\n \n Manet folded his arms stoically and added: \"Please don't talk.\"\n \n She sighed her instant agreement and moved her expressive hands over his chest and up to the hollows of his throat.\n \n \"I need a shave,\" he observed.\n \n Her hands instantly caressed his face to prove that she liked a rather bristly, masculine countenance.\n \n Manet elbowed Veronica away in a gentlemanly fashion.\n \n She made her return.\n \n \"Not now,\" he instructed her.\n \n \"Whenever you say.\"\n \n He stood up and began pacing off the dimensions of the compartment. There was no doubt about it: he had been missing his regular exercise.\n \n \"Now?\" she asked.\n \n \"I'll tell you.\"\n \n \"If you were a jet pilot,\" Veronica said wistfully, \"you would be romantic. You would grab love when you could. You would never know which moment would be last. You would make the most of each one.\"\n \n \"I'm not a jet pilot,\" Manet said. \"There are no jet pilots. There haven't been any for generations.\"\n \n \"Don't be silly,\" Veronica said. \"Who else would stop those vile North Koreans and Red China 'volunteers'?\"\n \n \"Veronica,\" he said carefully, \"the Korean War is over. It was finished even before the last of the jet pilots.\"\n \n \"Don't be silly,\" she snapped. \"If it were over, I'd know about it, wouldn't I?\"\n \n She would, except that somehow she had turned out even less bright, less equipped with Manet's own store of information, than Ronald. Whoever had built the Lifo kit must have had ancient ideas about what constituted appropriate \"feminine\" characteristics.\n \n \"I suppose,\" he said heavily, \"that you would like me to take you back to Earth and introduce you to Daniel Boone?\"\n \n \"Oh, yes.\"\n \n \"Veronica, your stupidity is hideous.\"\n \n She lowered her long blonde lashes on her pink cheeks. \"That is a mean thing to say to me. But I forgive you.\"\n \n An invisible hand began pressing down steadily on the top of his head until it forced a sound out of him. \"Aaaawrraagggh! Must you be so cloyingly sweet? Do you have to keep taking that? Isn't there any fight in you at all?\"\n \n He stepped forward and back-handed her across the jaw.\n \n It was the first time he had ever struck a woman, he realized regretfully. He now knew he should have been doing it long ago.\n \n Veronica sprang forward and led with a right.\n \n \n\n \n Ronald's cries grew louder as Manet marched Veronica through the corridor.\n \n \"Hear that?\" he inquired, smiling with clenched teeth.\n \n \"No, darling.\"\n \n Well, that was all right. He remembered he had once told her to ignore the noise. She was still following orders.\n \n \"Come on, Bill, open up the hatch for old Ronald,\" the voice carried through sepulchrally.\n \n \"Shut up!\" Manet yelled.\n \n The voice dwindled stubbornly, then cut off.\n \n A silence with a whisper of metallic ring to it.\n \n Why hadn't he thought of that before? Maybe because he secretly took comfort in the sound of an almost human voice echoing through the station.\n \n Manet threw back the bolt and wheeled back the hatch.\n \n Ronald looked just the same as had when Manet had seen him last. His hands didn't seem to have been worn away in the least. Ronald's lips seemed a trifle chapped. But that probably came not from all the shouting but from having nothing to drink for some months.\n \n Ronald didn't say anything to Manet.\n \n But he looked offended.\n \n \"You,\" Manet said to Veronica with a shove in the small of the back,\n\"inside, inside.\"\n \n Ronald sidestepped the lurching girl.\n \n \"Do you know what I'm going to do with you?\" Manet demanded. \"I'm going to lock you up in here, and leave you for a day, a month, a year, forever! Now what do you think about that?\"\n \n \"If you think it's the right thing, dear,\" Veronica said hesitantly.\n \n \"You know best, Willy,\" Ronald said uncertainly.\n \n Manet slammed the hatch in disgust.\n \n Manet walked carefully down the corridor, watching streamers of his reflection corkscrewing into the curved walls. He had to walk carefully, else the artery would roll up tight and squash him. But he walked too carefully for this to happen.\n \n As he passed the File Room, Ronald's voice said: \"In my opinion, William, you should let us out.\"\n \n \"I,\" Veronica said, \"honestly feel that you should let me out, Bill, dearest.\"\n \n Manet giggled. \"What? What was that? Do you suggest that I take you back after you've been behind a locked door with my best friend?\"\n \n He went down the corridor, giggling.\n \n He giggled and thought: This will never do.\n \n \n\n \n Pouring and tumbling through the Lifo kit, consulting the manual diligently, Manet concluded that there weren't enough parts left in the box to go around.\n \n The book gave instructions for The Model Mother, The Model Father, The Model Sibling and others. Yet there weren't parts enough in the kit.\n \n He would have to take parts from Ronald or Veronica in order to make any one of the others. And he could not do that without the Modifier.\n \n He wished Trader Tom would return and extract some higher price from him for the Modifier, which was clearly missing from the kit.\n \n Or to get even more for simply repossessing the kit.\n \n But Trader Tom would not be back. He came this way only once.\n \n Manet thumbed through the manual in mechanical frustration. As he did so, the solid piece of the last section parted sheet by sheet.\n \n He glanced forward and found the headings: The Final Model .\n \n There seemed something ominous about that finality. But he had paid a price for the kit, hadn't he? Who knew what price, when it came to that? He had every right to get everything out of the kit that he could.\n \n He read the unfolding page critically. The odd assortment of ill-matched parts left in the box took a new shape in his mind and under his fingers....\n \n Manet gave one final spurt from the flesh-sprayer and stood back.\n \n Victor was finished. Perfect.\n \n Manet stepped forward, lifted the model's left eyelid, tweaked his nose.\n \n \"Move!\"\n \n Victor leaped back into the Lifo kit and did a jig on one of the flesh-sprayers.\n \n As the device twisted as handily as good intentions, Manet realized that it was not a flesh-sprayer but the Modifier.\n \n \"It's finished!\" were Victor's first words. \"It's done!\"\n \n Manet stared at the tiny wreck. \"To say the least.\"\n \n Victor stepped out of the oblong box. \"There is something you should understand. I am different from the others.\"\n \n \"They all say that.\"\n \n \"I am not your friend.\"\n \n \"No?\"\n \n \"No. You have made yourself an enemy.\"\n \n Manet felt nothing more at this information than an esthetic pleasure at the symmetry of the situation.\n \n \"It completes the final course in socialization,\" Victor continued. \"I am your adversary. I will do everything I can to defeat you. I have all your knowledge. You do not have all your knowledge. If you let yourself know some of the things, it could be used against you. It is my function to use everything I possibly can against you.\"\n \n \"When do you start?\"\n \n \"I've finished. I've done my worst. I have destroyed the Modifier.\"\n \n \"What's so bad about that?\" Manet asked with some interest.\n \n \"You'll have Veronica and Ronald and me forever now. We'll never change. You'll get older, and we'll never change. You'll lose your interest in New York swing and jet combat and Daniel Boone, and we'll never change. We don't change and you can't change us for others. I've made the worst thing happen to you that can happen to any man. I've seen that you will always keep your friends. \"\n \n \n\n \n The prospect was frightful.\n \n Victor smiled. \"Aren't you going to denounce me for a fiend?\"\n \n \"Yes, it is time for the denouncement. Tell me, you feel that now you are through? You have fulfilled your function?\"\n \n \"Yes. Yes.\"\n \n \"Now you will have but to lean back, as it were, so to speak, and see me suffer?\"\n \n \" Yes. \"\n \n \"No. Can't do it, old man. Can't. I know. You're too human, too like me. The one thing a man can't accept is a passive state, a state of uselessness. Not if he can possibly avoid it. Something has to be happening to him. He has to be happening to something. You didn't kill me because then you would have nothing left to do. You'll never kill me.\"\n \n \"Of course not!\" Victor stormed. \"Fundamental safety cut-off!\"\n \n \"Rationalization. You don't want to kill me. And you can't stop challenging me at every turn. That's your function.\"\n \n \"Stop talking and just think about your miserable life,\" Victor said meanly. \"Your friends won't grow and mature with you. You won't make any new friends. You'll have me to constantly remind you of your uselessness, your constant unrelenting sterility of purpose. How's that for boredom, for passiveness?\"\n \n \"That's what I'm trying to tell you,\" Manet said irritably, his social manners rusty. \"I won't be bored. You will see to that. It's your purpose. You'll be a challenge, an obstacle, a source of triumph every foot of the way. Don't you see? With you for an enemy, I don't need a friend!\"",
      "metadata": {
        "title": "How to Make Friends",
        "author": "Jim Harmon",
        "passage_id": "50818",
        "uid": "2c180e6c50c149d59b91363514cab52a",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "106",
                "uid": "d7ec6df50f564a1e8393d2a36a795f7d",
                "response_text": "William Manet is working in atmosphere seeder station 131-47 on Mars. He is completely alone, but doesn't fear loneliness, he welcomes it, and the idea that it might drive him mad one day. His job is to wait, looking out at the expanse of nothingness around him. He is an overseer, to prepare the atmosphere for colonization. One day, Manet thinks he sees a spaceship land near his station. He puts on his pressure suit and heads out to see what it is. As he walks towards it, he finds himself in a rustic log cabin, where a lean, tall man stands, waiting for him. The man calls himself \"Trader Tom\", and offers him a very interesting service. He tells Manet that he will give him a special credit card that will allow him to purchase anything he can think of. Manet's estate would cover the cost, and when Manet asks the man what would happen if he had no estate, Trader Tom simply says that this is a risk that he, and his business, take. Trader Tom asks what would Manet like, to which he replies: to not be alone. Manet signs some paperwork and is given the credit card. \nManet is given a box, it is called \"LIFO, the socialisation kit\". The box contains various items from a person's lifetime. On top is a book entitled \"The Making Of Friends and Others''. It orders the user to find the modifier, which Manet cannot locate. He goes to work anyway, on making his first friend with the tools inside the kit. \nHis first friend he creates is named Ronald. He seems sweet at first but his incessant optimism and lack of intelligence finally becomes too much for Manet. Manet decides to lock Ronald in a room away from him. He is stuck on this planet for the next eighteen years, and will need some kind of company. He goes to work on creating his second companion, a girl. \nVeronica is sweet, she talks kindly to Manet, and throws herself at him, which he swerves. Manet thinks her to be even more stupid than Ronald, and ends up striking her, which he finds he enjoys. He locks her in the same room as Ronald. \nManet once again goes back to the box, and goes to the last page of the handbook, entitled, \"The Final Model\". He creates this new being, whom he calls Victor. Victor jumps to life, and into the kit, destroying the item that Manet now realises was the modifier. Vitor explains to Manet that he is his enemy. He is just as intelligent as Manet, and is his designated adversary. Now that the modifier is destroyed, Manet will have no way to ever alter Veronica or Ronald, and will be stuck with the same silly, innocent people as he grows old. Manet will be bored for eighteen years. Manet replies to Victor, explaining, now that he has an enemy, he will never be bored. "
              },
              {
                "worker_id": "107",
                "uid": "1b8effce49aa462e8134845444fdb52a",
                "response_text": "William Manet is an extremely lonely man and is the only human who works at his station. He is part of a small pressure group called the Workers’ Union and works as an Overseer that focuses on the colonization of Mars. He cannot leave his job, but it has a high salary and good future opportunities. Manet sees a spaceship land nearby, and he begins to think he is hallucinating. He goes out to meet the spaceship, and the other man introduces himself as Trader Tom. He says that he serves the wants of spacemen and represents free enterprise. When Manet is suspicious, Tom explains that his businessmen have gone back to the barter system. Furthermore, Manet can also apply for the Trader Tom’s Credit Card and have charges deducted from his estate as payment. He tells Tom that he wants to be alone, and Tom lets him sign a card. He is then given a socialization kit, to which Tom tells him that there have been no complaints about it so far. Manet ignores the box for as long as possible, but he eventually gives in and opens it. There is a collection of junk inside the box and a book titled The Making of Friends and Others. The book gives him instructions on how to create his friend. He then begins to play games with his new friend Ronald. He makes Ronald as somebody with opposite traits as him and enjoys knowing more than his new friend. After a while, however, Manet gets annoyed by Ronald, and the two of them fight. The time then skips to Spring, and Manet has locked Ronald away hoping that he will shut down by himself. He then gets a transmission from the B.B.C, explaining that the estimated time of departure for the Overseers was now eighteen years. Manet then goes back to the box, where he tries to find the Modifier amongst the many parts to shut down or change Ronald. Instead, he creates a girl named Veronica to keep him company. Veronica’s personality is very shallow, and she constantly speaks of things that Manet considers stupid. He locks her up in the same place where he keeps Ronald, and both try to persuade him to let them out. Manet tries to find the Modifier again but instead finds the steps to create one final model. He does so and names it Victor. Suddenly, Victor destroys the Modifier and proclaims himself as Manet’s enemy. He tells Manet that he will do everything he can to defeat him and. Victor says that his biggest accomplishment is destroying the Modifier, so Veronica, Ronald, and himself will continue to exist in the same way forever. Manet, however, is not afraid or concerned about Victor at all. He sees the “enemy” as an obstacle who must be triumphed and exclaims that he does not need friends if he has Victor as an enemy. "
              },
              {
                "worker_id": "101",
                "uid": "87a5e0c782644e58b42aefeb90501b1f",
                "response_text": "William Manet is a man stranded alone on Mars. He has taken a job as an Overseer, hired to monitor several Seeders scattered on the planet in order to prepare Earth for colonization of the planet. Though the job is well-paying, Manet is to be at his station indefinitely, alone. Initially, Manet liked the idea of being alone, but he quickly became bored and lonely, and anticipated his madness. One day, Manet sees a ship landing on the surface of Mars outside; he is wary of his own mind and wonders if it is a hallucination, but he approaches the ship anyway, where he enters a cabin and meets a strange man, who refers to himself as Trader Tom. Trader Tom introduces himself and his business, which aims to serve spacemen through a bartering system. Manet is skeptical as to how such a business could exist, and how he would be able to afford whatever services are provided. Trader Tom asks Manet what it is that he wants, to which Manet expresses his loneliness. He gives Manet a Socialization Kit, which is meant to replicate human interaction. Manet makes the deal, but waits a while to open the box. When he finally decides to, he comes across a manual, which advises Manet to find the Modifier inside the kit, which is critical. However, Manet is unable to find the Modifier, as he does not know what it looks like. He ends up creating Ronald, meant to be a companion who is cheerful, pleasant, yet not as smart as Manet. Manet soon becomes tired and irritated with Ronald's repetitive nature, wearing out the same dialogue and topics of conversation. Eventually, Manet locks Ronald in his file room. He later gets a message from the B.B.C, explaining that though his estimated stay time had previously been longer, it has lowered to 18 years. Still unable to locate the Modifier, Manet creates a woman, Veronica, who also ends up being too submissive and repetitive for his taste, and he locks her in with Ronald. Manet comes across instructions for creating \"The Final Model\", which spawns Victor, who immediately destroys what must have been the Modifier. Victor explains that he is not a friend for Manet, but an enemy, meant to challenge and defeat him. Manet realizes that Victor will cure his boredom by presenting obstacles for him to work around every day."
              },
              {
                "worker_id": "105",
                "uid": "ef1fa18eb99d41d19c8872ffae5a0f91",
                "response_text": "William Manet is all alone and is going crazy step by step. He has wanted this experiment for a while but he becomes bored much faster than expected. He has accepted a useless position of an overseer of a station on Mars, all alone in the desert. The salary is high but nothing is provided regarding the overseer having some human interactions or commodities. One day Manet sees a spaceship and is unsure whether it is a hallucination. Nevertheless, he enters a strange cabin and a man offers him a good whiskey. To Manet's astonishment, it turns out the spaceship is created by a free enterprise to serve the spacemen. Manet says to the service that he wants not to be alone and gets a box, the cost is unknown. He doesn't open the box until he decides he is mad. In the box there is a socialization kit with instructions. Then a game follows between Manet and someone called Ronald and a dialogue about war takes place. Very soon, Manet gets bored and tired of his companion, turns out Ronald was a copy of a human with features Manet himself picked. One day Manet listens to BBC and hears that his time left on Mars is 18 years for now. He tries to find the modifier and change Ronald, in the next scene a girl called Veronica appears. She is a submissive and seductive human copy who took the place of Ronald. She is even more stupid and backward in knowledge than her predecessor, Ronald, who has been locked this whole time which was months. Now Veronica joins Ronald in the locked room. In a while the final model pages open up in the instructions and Manet creates Victor. Victor possesses all the knowledge Manet has and is created to defeat Manet, Victor destroys the modifier and wants to make the overseer upset by that. But Manet needed an enemy all this time not to be bored and he is more than happy to have this constant obstacle always in his way. \n"
              }
            ]
          },
          {
            "question_text": "Where is the story set?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "106",
                "uid": "d7ec6df50f564a1e8393d2a36a795f7d",
                "response_text": "The story takes place on Mars. Manet is the sole occupant of the Atmosphere Seeder Station 131-47. There is nothing to be seen in any direction far beyond the horizon. Mars is described like a blank canvas. It is a boring, desolate place, which only adds to Manet's feelings of loneliness and boredom. Manet crosses from his station to Trader Tom's starship at the beginning of the story. The inner compartment of the ship is like that of a log cabin. There is a slate fireplace with black and orange log charring. The fireplace holds a crackling fire. Manet moves through different rooms in his station throughout the story. When Manet first gets the box, he puts it by a transparent wall in one of the rooms of the station. He moves from his bedroom, the file room, the tube way, to communication, to an area where he plays chess with Ronald, to the solarium,  to another room where he eventually locks both Ronald and Veronica."
              },
              {
                "worker_id": "107",
                "uid": "1b8effce49aa462e8134845444fdb52a",
                "response_text": "The story is primarily set on Mars. Manet works at the Atmosphere Seeder Station 131-47. The station itself is all cybernetically controlled, and all Manet has to do is sit there to monitor everything as the Overseer. The station itself is located in the middle of a chalk desert, and it is always completely barren with miles of white sand. There are many amenities at the station, including a File Room and a radio to receive transmissions from. Apart from the File Room, there is also a solarium where Manet keeps the box from Trader Tom. Additionally, he also has a place with a hatch where he keeps Ronald and Veronica locked up. "
              },
              {
                "worker_id": "101",
                "uid": "87a5e0c782644e58b42aefeb90501b1f",
                "response_text": "The story is set on Mars, where Manet resides in the Atmosphere Seeder Station 131-47. The station is located in the middle of a vast Mars desert, where Earth is visible in the distance as a tiny star. The interior of the station isn't the most comfortable, made of aluminum and resembling an industrial factory, though he has a transparent wall to provide him with an outside view. Manet gets a change of scene when another ship lands on Mars, where the interior is cozy and comfortable, with a fireplace. The rest of the story, however, continues in Manet's station, limited to a few rooms, including a File Room, where he keeps Ronald and Veronica."
              },
              {
                "worker_id": "105",
                "uid": "ef1fa18eb99d41d19c8872ffae5a0f91",
                "response_text": "The story is set on a station on Mars. The station is standing all alone in the middle of a huge desert and it needs an overseer. The station is small and can accommodate only one human - Manet. There is a starry sky over the station, a couple rooms inside, including a bedroom with a transparent wall, a file room, a corridor, a hall and a place to sit down and watch a transmission or listen to the radio. Once a spaceship with Trader Tom Service arrives, accommodating anything the guest wants inside. In Manet's case it's a cabin with a fireplace.  Then the story returns to his station which stays the same with human copies adding to its housemates one by one. "
              }
            ]
          },
          {
            "question_text": "What is the relationship between Ronald and Manet?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "106",
                "uid": "d7ec6df50f564a1e8393d2a36a795f7d",
                "response_text": "Ronald is Manet's first self-made friend. He constructs him using the parts he finds in the LIFO kit, and follows the manual to put him together properly. Their relationship seems jovial enough at first. They play chess together. Ronald eliminates the loneliness that Manet feels for a short time. Manet had purposely made Ronald to be cheerful, submissive and co-operative. Manet wanted Ronald to be as different to himself as he could be. Manet enjoys the fact that Ronald is not as intelligent as him. They talk about various wars, and Daniel Boone. After a while though, Manet becomes incensed by Ronalds endless, mindless droning about these same topics. Manet begins to fight Ronald, to which Ronald participates, only to please his creator. He is so fed up with Ronald eventually that he locks him in a room, and doesn't let him out. "
              },
              {
                "worker_id": "107",
                "uid": "1b8effce49aa462e8134845444fdb52a",
                "response_text": "Ronald and Manet have a relationship that is initially friendly but later becomes very one-sided. Since Manet created Ronald from The Making of Friends and Others manual, all of his traits were chosen by his creator. He is cheerful, cooperative, and submissive. All of these traits make him the polar opposite of Manet. He is also suppressed in terms of intelligence, aggressiveness, and a sense of perfection. Manet and he start off playing games together, most of which almost always end in a tie. They also talk about topics such as the Korean War, Daniel Boone, New York swing, and the painting of Norman Rockwell, amongst a few other topics. Manet initially enjoys being smarter, but he is later sick of Ronald constantly talking about the same subjects. Although he knows that Ronald is only a copy of a human, he still cannot help but want to beat up his self-made friend after calling him a jerk. Manet is furious at the fact that Ronald would stupidly do anything to avoid any trouble with him. This eventually escalates to the point where Ronald is locked away and practically discarded by Manet despite being able to exist forever. "
              },
              {
                "worker_id": "101",
                "uid": "87a5e0c782644e58b42aefeb90501b1f",
                "response_text": "Ronald is originally a companion for Manet. He is friendly, obedient, and peaceful, though purposefully not as intelligent as Manet. The two initially get along, their quality time mainly consisting of chess games and conversations about the Korean War and Daniel Boone. Manet eventually becomes irritated with Ronald, but Ronald still attempts to cater to his needs, even getting into a fistfight with Manet. Even when Manet locks Ronald into the file cabinet, Ronald remains cheerful through his pleading. He is oblivious to Manet's hatred and aims to please him no matter what, which enrages Manet even more."
              },
              {
                "worker_id": "105",
                "uid": "ef1fa18eb99d41d19c8872ffae5a0f91",
                "response_text": "Manet felt extremely lonely and desired communication, he created Ronald, a copy of a human from the socialization kit, as totally opposed to himself. Ronald's features were to be cheerful, submissive, cooperative, peaceful, not as intelligent and aggressive as Manet. The two play, talk and fight, but Manet gets bored and intimidated by Ronald very soon. Ronald's narrow interests make Manet angry and he wants to change Ronald all the way but can not find the modifier. Eventually, Manet is so tired of Ronald constantly talking about the same stupid things that he locks the creation in a room for months. "
              }
            ]
          },
          {
            "question_text": "What is the purpose of the modifier?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "106",
                "uid": "d7ec6df50f564a1e8393d2a36a795f7d",
                "response_text": "When Manet first looks into the LIFO kit, there are a number of strange objects inside. On the top of the box is a manual on how to create these new beings, designed for companionship. In the manual, it clearly states that it is of the utmost importance to first find the modifier in the kit. It could be seen in the first part of the master chart. The only problem was, the master chart is missing. Without the master chart, Manet has no way of knowing what the modifier looked like. He decides to create these companions without it regardless. It only becomes clear what the modifier is used for towards the end of the story. When Victor is created, he immediately leaps inside the box, smashing up something Manet thinks to be a flesh sprayer. When it is destroyed, Manet finally realises that it is in fact, the Modifier. Victor explains the modifier's purpose. The modifier is used to change the artificial beings. They are created based on the creator's likes and dislikes. But, as Manet matures, and he grows out of his initial preferences, he would have the modifier to change his companions to fit his new preferences. With this gone, he is stuck with the same Ronald, Veronica and Victor for the next eighteen years. "
              },
              {
                "worker_id": "107",
                "uid": "1b8effce49aa462e8134845444fdb52a",
                "response_text": "The purpose of the Modifier is for the user to remove or change whatever type of companion they create. It is an essential part of the socialization experiment, and the manual recommends that finding it is a vital step. Since Manet’s Master Chart is lost, he has no idea what the Modifier looks like and cannot locate it until the very end when Victor destroys it. The Modifier is what Manet needs to disable or change the companions he created, which would undo his dissatisfaction with them. To Victor, the purpose of the Modifier is an object that he must destroy as Manet’s enemy. Since the Modifier is essentially the solution, Victor destroys it in an attempt to defeat Manet. "
              },
              {
                "worker_id": "101",
                "uid": "87a5e0c782644e58b42aefeb90501b1f",
                "response_text": "The Modifier is a part of the Socialization Kit that is described as its most vital element. However, it is indistinguishable from the rest of the kit, causing it to be unrecognizable. The Modifier is used to make amends to the people Manet creates from the kit, or to shut the people off altogether. In Manet's case, the Modifier would be helpful in solving his issues with both Manet and Veronica, and allow him to create new people that would appeal to him more. Without the Modifier, which Victor destroys at the end of the story, Manet is stuck with Ronald and Veronica indefinitely, unable to change them."
              },
              {
                "worker_id": "105",
                "uid": "ef1fa18eb99d41d19c8872ffae5a0f91",
                "response_text": "Modifier is vital for the socialization experiment and it is in the kit. It is needed to change or to turn off the created human copy, Ronald in this case. In the very end, it turns out to be one of the flesh-sprayers. With the modifier, Manet is the creator, he is in charge, he can do whatever he pleases with all those he has created. Without it he is powerless to change something or destroy the human copies. The modifier is vital because it is the key to the whole kit, the remote controller. "
              }
            ]
          },
          {
            "question_text": "How is Manet's madness portrayed in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "106",
                "uid": "d7ec6df50f564a1e8393d2a36a795f7d",
                "response_text": "When we first meet William Manet, he thinks it is inevitable that he will go insane, and even welcomes it. He would get \"fat and dirty\" and he would become animalistic and create a god complex for himself. He quickly slips into madness in his isolation, making notes for lectures to give to no one in particular, a picture of Annie Oakley, winking at him on more than one occasion. The idea of madness is also brought up in the illusive character of \"Trader Tom\". It is not clear whether he or his spaceship are real at all, when it is said that Manet \"Thinks\" he sees the ship one day. There is no definitive answer as to how he gets onto the ship, or who or what Trader Tom works for. When Manet finishes the glass of whiskey, it becomes instantly clean, like he had never drank from it. His ship is also very strange, with a fireplace in it. We can later see Manet's madness in his violent outbursts. We first see him beat up Ronald, and then Veronica. His madness is truly shown when he exclaims that he should have started beating women much sooner. It is unclear throughout the whole story whether any of this took place in the real world, or whether it was all in Manet's head. "
              },
              {
                "worker_id": "107",
                "uid": "1b8effce49aa462e8134845444fdb52a",
                "response_text": "Manet’s madness is portrayed in the story as his continuous creations of friends and treatment towards Victor. Instead of being satisfied with his ideal friend, he ends up creating three companions, all of whom he immensely dislikes after some time. Furthermore, when Victor tells him that he has trapped Manet with the three copies forever, the other man does not seem to be frightened or fazed. Manet only says that Victor is too human-like and that a man cannot accept being in a passive state. He also says that Victor will never kill him because it means that there will be nothing for him to do after. Even though Victor tries to insult his life, Manet’s madness has prevented him from caring and only finds his presence as entertainment that will never make him bored. Manet’s madness grows throughout the socialization experiment, and it becomes extremely apparent when the confrontation with Victor happens. "
              },
              {
                "worker_id": "101",
                "uid": "87a5e0c782644e58b42aefeb90501b1f",
                "response_text": "Manet's madness starts out as an inevitable concept, which he is aware of himself when he takes the job as an Overseer. He anticipates going mad from loneliness and boredom, but the madness comes sooner than expected. He begins to talk to himself and interact with inanimate objects, such as the photo of Annie Oakley he keeps on his wall. Eventually, his madness progresses, which he embraces, such as how he pretends that the machine will destroy him from the inside. Manet then begins to question his own madness and its abilities to make him hallucinate, specifically when Trader Tom's ship lands in front of him. Later on in the story, Manet's madness is not from loneliness, but from rage and irritation, which is then manifested through violence taken out on Ronald and Veronica."
              },
              {
                "worker_id": "105",
                "uid": "ef1fa18eb99d41d19c8872ffae5a0f91",
                "response_text": "The story starts with Manet's curiosity as some sort of an experiment regarding how fast will he go crazy. He even desires this madness to come because he is bored and lonely, and this thoughts about madness keep him interested at least. He talks to himself and to a portrait, sometimes believing it talks back. When a ship arrives neither he nor the readers can be sure whether it is a hallucination or not. He starts believing in aliens and even when he thinks of the spaceship as a hallucination, he likes the thought of dementia in this loneliness, which is not a healthy thought, but rather a sign of madness. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5067,
        "document_length_chars": 29790
      }
    }
  ]
}