{
  "item_metadata": {
    "item_id": "50827",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "50827",
      "content": "Orphans of the Void\n \n \n By MICHAEL SHAARA\n \n Illustrated by EMSH\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction June 1952. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n Finding a cause worth dying for is no great trick—the Universe is full of them. Finding one worth living for is the genuine problem!\n \n\n \n In the region of the Coal Sack Nebula, on the dead fourth planet of a star called Tyban, Captain Steffens of the Mapping Command stood counting buildings. Eleven. No, twelve. He wondered if there was any significance in the number. He had no idea.\n \n \"What do you make of it?\" he asked.\n \n Lieutenant Ball, the executive officer of the ship, almost tried to scratch his head before he remembered that he was wearing a spacesuit.\n \n \"Looks like a temporary camp,\" Ball said. \"Very few buildings, and all built out of native materials, the only stuff available. Castaways, maybe?\"\n \n Steffens was silent as he walked up onto the rise. The flat weathered stone jutted out of the sand before him.\n \n \"No inscriptions,\" he pointed out.\n \n \"They would have been worn away. See the wind grooves? Anyway, there's not another building on the whole damn planet. You wouldn't call it much of a civilization.\"\n \n \"You don't think these are native?\"\n \n Ball said he didn't. Steffens nodded.\n \n Standing there and gazing at the stone, Steffens felt the awe of great age. He had a hunch, deep and intuitive, that this was old— too old. He reached out a gloved hand, ran it gently over the smooth stone ridges of the wall. Although the atmosphere was very thin, he noticed that the buildings had no airlocks.\n \n Ball's voice sounded in his helmet: \"Want to set up shop, Skipper?\"\n \n Steffens paused. \"All right, if you think it will do any good.\"\n \n \"You never can tell. Excavation probably won't be much use. These things are on a raised rock foundation, swept clean by the wind. And you can see that the rock itself is native—\" he indicated the ledge beneath their feet—\"and was cut out a long while back.\"\n \n \"How long?\"\n \n Ball toed the sand uncomfortably. \"I wouldn't like to say off-hand.\"\n \n \"Make a rough estimate.\"\n \n Ball looked at the captain, knowing what was in his mind. He smiled wryly and said: \"Five thousand years? Ten thousand? I don't know.\"\n \n Steffens whistled.\n \n Ball pointed again at the wall. \"Look at the striations. You can tell from that alone. It would take even a brisk Earth wind at least several thousand years to cut that deep, and the wind here has only a fraction of that force.\"\n \n The two men stood for a long moment in silence. Man had been in interstellar space for three hundred years and this was the first uncovered evidence of an advanced, space-crossing, alien race. It was an historic moment, but neither of them was thinking about history.\n \n Man had been in space for only three hundred years. Whatever had built these had been in space for thousands of years.\n \n Which ought to give them , thought Steffens uncomfortably, one hell of a good head-start.\n \n \n\n \n While the excav crew worked steadily, turning up nothing, Steffens remained alone among the buildings. Ball came out to him, looked dryly at the walls.\n \n \"Well,\" he said, \"whoever they were, we haven't heard from them since.\"\n \n \"No? How can you be sure?\" Steffens grunted. \"A space-borne race was roaming this part of the Galaxy while men were still pitching spears at each other, that long ago. And this planet is only a parsec from Varius II, a civilization as old as Earth's. Did whoever built these get to Varius? Or did they get to Earth? How can you know?\"\n \n He kicked at the sand distractedly. \"And most important, where are they now? A race with several thousand years....\"\n \n \"Fifteen thousand,\" Ball said. When Steffens looked up, he added:\n\"That's what the geology boys say. Fifteen thousand, at the least.\"\n \n Steffens turned to stare unhappily at the buildings. When he realized now how really old they were, a sudden thought struck him.\n \n \"But why buildings? Why did they have to build in stone, to last? There's something wrong with that. They shouldn't have had a need to build, unless they were castaways. And castaways would have left something behind. The only reason they would need a camp would be—\"\n \n \"If the ship left and some of them stayed.\"\n \n Steffens nodded. \"But then the ship must have come back. Where did it go?\" He ceased kicking at the sand and looked up into the blue-black midday sky. \"We'll never know.\"\n \n \"How about the other planets?\" Ball asked.\n \n \"The report was negative. Inner too hot, outer too heavy and cold. The third planet is the only one with a decent temperature range, but it has a CO\n 2\n atmosphere.\"\n \n \"How about moons?\"\n \n Steffens shrugged. \"We could try them and find out.\"\n \n \n\n \n The third planet was a blank, gleaming ball until they were in close, and then the blankness resolved into folds and piling clouds and dimly, in places, the surface showed through. The ship went down through the clouds, falling the last few miles on her brakers. They came into the misty gas below, leveled off and moved along the edge of the twilight zone.\n \n The moons of this solar system had yielded nothing. The third planet, a hot, heavy world which had no free oxygen and from which the monitors had detected nothing, was all that was left. Steffens expected nothing, but he had to try.\n \n At a height of several miles, the ship moved up the zone, scanning, moving in the familiar slow spiral of the Mapping Command. Faint dark outlines of bare rocks and hills moved by below.\n \n Steffens turned the screen to full magnification and watched silently.\n \n After a while he saw a city.\n \n The main screen being on, the whole crew saw it. Someone shouted and they stopped to stare, and Steffens was about to call for altitude when he saw that the city was dead.\n \n He looked down on splintered walls that were like cloudy glass pieces rising above a plain, rising in a shattered circle. Near the center of the city, there was a huge, charred hole at least three miles in diameter and very deep. In all the piled rubble, nothing moved.\n \n Steffens went down low to make sure, then brought the ship around and headed out across the main continent into the bright area of the sun. The rocks rolled by below, there was no vegetation at all, and then there were more cities—all with the black depression, the circular stamp that blotted away and fused the buildings into nothing.\n \n No one on the ship had anything to say. None had ever seen a war, for there had not been war on Earth or near it for more than three hundred years.\n \n The ship circled around to the dark side of the planet. When they were down below a mile, the radiation counters began to react. It became apparent, from the dials, that there could be nothing alive.\n \n After a while Ball said: \"Well, which do you figure? Did our friends from the fourth planet do this, or were they the same people as these?\"\n \n Steffens did not take his eyes from the screen. They were coming around to the daylight side.\n \n \"We'll go down and look for the answer,\" he said. \"Break out the radiation suits.\"\n \n He paused, thinking. If the ones on the fourth planet were alien to this world, they were from outer space, could not have come from one of the other planets here. They had starships and were warlike. Then, thousands of years ago. He began to realize how important it really was that Ball's question be answered.\n \n When the ship had gone very low, looking for a landing site, Steffens was still by the screen. It was Steffens, then, who saw the thing move.\n \n Down far below, it had been a still black shadow, and then it moved. Steffens froze. And he knew, even at that distance, that it was a robot.\n \n \n\n \n Tiny and black, a mass of hanging arms and legs, the thing went gliding down the slope of a hill. Steffens saw it clearly for a full second, saw the dull ball of its head tilt upward as the ship came over, and then the hill was past.\n \n \n\n \n Quickly Steffens called for height. The ship bucked beneath him and blasted straight up; some of the crew went crashing to the deck. Steffens remained by the screen, increasing the magnification as the ship drew away. And he saw another, then two, then a black gliding group, all matched with bunches of hanging arms.\n \n Nothing alive but robots, he thought, robots . He adjusted to full close up as quickly as he could and the picture focused on the screen. Behind him he heard a crewman grunt in amazement.\n \n A band of clear, plasticlike stuff ran round the head—it would be the eye, a band of eye that saw all ways. On the top of the head was a single round spot of the plastic, and the rest was black metal, joined, he realized, with fantastic perfection. The angle of sight was now almost perpendicular. He could see very little of the branching arms of the trunk, but what had been on the screen was enough. They were the most perfect robots he had ever seen.\n \n The ship leveled off. Steffens had no idea what to do; the sudden sight of the moving things had unnerved him. He had already sounded the alert, flicked out the defense screens. Now he had nothing to do. He tried to concentrate on what the League Law would have him do.\n \n The Law was no help. Contact with planet-bound races was forbidden under any circumstances. But could a bunch of robots be called a race? The Law said nothing about robots because Earthmen had none. The building of imaginative robots was expressly forbidden. But at any rate, Steffens thought, he had made contact already.\n \n While Steffens stood by the screen, completely bewildered for the first time in his space career, Lieutenant Ball came up, hobbling slightly. From the bright new bruise on his cheek, Steffens guessed that the sudden climb had caught him unaware. The exec was pale with surprise.\n \n \"What were they?\" he said blankly. \"Lord, they looked like robots!\"\n \n \"They were.\"\n \n Ball stared confoundedly at the screen. The things were now a confusion of dots in the mist.\n \n \"Almost humanoid,\" Steffens said, \"but not quite.\"\n \n Ball was slowly absorbing the situation. He turned to gaze inquiringly at Steffens.\n \n \"Well, what do we do now?\"\n \n Steffens shrugged. \"They saw us. We could leave now and let them quite possibly make a ... a legend out of our visit, or we could go down and see if they tie in with the buildings on Tyban IV.\"\n \n \" Can we go down?\"\n \n \"Legally? I don't know. If they are robots, yes, since robots cannot constitute a race. But there's another possibility.\" He tapped his fingers on the screen confusedly. \"They don't have to be robots at all. They could be the natives.\"\n \n Ball gulped. \"I don't follow you.\"\n \n \"They could be the original inhabitants of this planet—the brains of them, at least, protected in radiation-proof metal. Anyway,\" he added,\n\"they're the most perfect mechanicals I've ever seen.\"\n \n Ball shook his head, sat down abruptly. Steffens turned from the screen, strode nervously across the Main Deck, thinking.\n \n The Mapping Command, they called it. Theoretically, all he was supposed to do was make a closeup examination of unexplored systems, checking for the presence of life-forms as well as for the possibilities of human colonization. Make a check and nothing else. But he knew very clearly that if he returned to Sirius base without investigating this robot situation, he could very well be court-martialed one way or the other, either for breaking the Law of Contact or for dereliction of duty.\n \n And there was also the possibility, which abruptly occurred to him, that the robots might well be prepared to blow his ship to hell and gone.\n \n He stopped in the center of the deck. A whole new line of thought opened up. If the robots were armed and ready ... could this be an outpost?\n  An outpost!\n \n \n He turned and raced for the bridge. If he went in and landed and was lost, then the League might never know in time. If he went in and stirred up trouble....\n \n The thought in his mind was scattered suddenly, like a mist blown away. A voice was speaking in his mind, a deep calm voice that seemed to say:\n \n \" Greetings. Do not be alarmed. We do not wish you to be alarmed. Our desire is only to serve.... \"\n \n \n\n \n \"Greetings, it said! Greetings!\" Ball was mumbling incredulously through shocked lips.\n \n Everyone on the ship had heard the voice. When it spoke again, Steffens was not sure whether it was just one voice or many voices.\n \n \"We await your coming,\" it said gravely, and repeated: \"Our desire is only to serve.\"\n \n And then the robots sent a picture .\n \n As perfect and as clear as a tridim movie, a rectangular plate took shape in Steffens' mind. On the face of the plate, standing alone against a background of red-brown, bare rocks, was one of the robots. With slow, perfect movement, the robot carefully lifted one of the hanging arms of its side, of its right side, and extended it toward Steffens, a graciously offered hand.\n \n Steffens felt a peculiar, compelling urge to take the hand, realized right away that the urge to take the hand was not entirely his. The robot mind had helped.\n \n When the picture vanished, he knew that the others had seen it. He waited for a while; there was no further contact, but the feeling of the robot's urging was still strong within him. He had an idea that, if they wanted to, the robots could control his mind. So when nothing more happened, he began to lose his fear.\n \n While the crew watched in fascination, Steffens tried to talk back. He concentrated hard on what he was saying, said it aloud for good measure, then held his own hand extended in the robot manner of shaking hands.\n \n \"Greetings,\" he said, because it was what they had said, and explained: \"We have come from the stars.\"\n \n It was overly dramatic, but so was the whole situation. He wondered baffledly if he should have let the Alien Contact crew handle it. Order someone to stand there, feeling like a fool, and think a message?\n \n No, it was his responsibility; he had to go on:\n \n \"We request—we respectfully request permission to land upon your planet.\"\n \n \n\n \n Steffens had not realized that there were so many.\n \n They had been gathering since his ship was first seen, and now there were hundreds of them clustered upon the hill. Others were arriving even as the skiff landed; they glided in over the rocky hills with fantastic ease and power, so that Steffens felt a momentary anxiety. Most of the robots were standing with the silent immobility of metal. Others threaded their way to the fore and came near the skiff, but none touched it, and a circle was cleared for Steffens when he came out.\n \n \n\n \n One of the near robots came forward alone, moving, as Steffens now saw, on a number of short, incredibly strong and agile legs. The black thing paused before him, extended a hand as it had done in the picture. Steffens took it, he hoped, warmly; felt the power of the metal through the glove of his suit.\n \n \"Welcome,\" the robot said, speaking again to his mind, and now Steffens detected a peculiar alteration in the robot's tone. It was less friendly now, less—Steffens could not understand—somehow less interested , as if the robot had been—expecting someone else.\n \n \"Thank you,\" Steffens said. \"We are deeply grateful for your permission to land.\"\n \n \"Our desire,\" the robot repeated mechanically, \"is only to serve.\"\n \n Suddenly, Steffens began to feel alone, surrounded by machines. He tried to push the thought out of his mind, because he knew that they should seem inhuman. But....\n \n \"Will the others come down?\" asked the robot, still mechanically.\n \n Steffens felt his embarrassment. The ship lay high in the mist above, jets throbbing gently.\n \n \"They must remain with the ship,\" Steffens said aloud, trusting to the robot's formality not to ask him why. Although, if they could read his mind, there was no need to ask.\n \n For a long while, neither spoke, long enough for Steffens to grow tense and uncomfortable. He could not think of a thing to say, the robot was obviously waiting, and so, in desperation, he signaled the Aliencon men to come on out of the skiff.\n \n They came, wonderingly, and the ring of robots widened. Steffens heard the one robot speak again. The voice was now much more friendly.\n \n \"We hope you will forgive us for intruding upon your thought. It is our—custom—not to communicate unless we are called upon. But when we observed that you were in ignorance of our real—nature—and were about to leave our planet, we decided to put aside our custom, so that you might base your decision upon sufficient data.\"\n \n Steffens replied haltingly that he appreciated their action.\n \n \"We perceive,\" the robot went on, \"that you are unaware of our complete access to your mind, and would perhaps be—dismayed—to learn that we have been gathering information from you. We must—apologize. Our only purpose was so that we could communicate with you. Only that information was taken which is necessary for communication and—understanding. We will enter your minds henceforth only at your request.\"\n \n Steffens did not react to the news that his mind was being probed as violently as he might have. Nevertheless it was a shock, and he retreated into observant silence as the Aliencon men went to work.\n \n The robot which seemed to have been doing the speaking was in no way different from any of the others in the group. Since each of the robots was immediately aware of all that was being said or thought, Steffens guessed that they had sent one forward just for appearance's sake, because they perceived that the Earthmen would feel more at home. The picture of the extended hand, the characteristic handshake of Earthmen, had probably been borrowed, too, for the same purpose of making him and the others feel at ease. The one jarring note was the robot's momentary lapse, those unexplainable few seconds when the things had seemed almost disappointed. Steffens gave up wondering about that and began to examine the first robot in detail.\n \n It was not very tall, being at least a foot shorter than the Earthmen. The most peculiar thing about it, except for the circling eye-band of the head, was a mass of symbols which were apparently engraved upon the metal chest. Symbols in row upon row—numbers, perhaps—were upon the chest, and repeated again below the level of the arms, and continued in orderly rows across the front of the robot, all the way down to the base of the trunk. If they were numbers, Steffens thought, then it was a remarkably complicated system. But he noticed the same pattern on the nearer robots, all apparently identical. He was forced to conclude that the symbols were merely decoration and let it go tentatively at that, although the answer seemed illogical.\n \n It wasn't until he was on his way home that Steffens remembered the symbols again. And only then did he realized what they were.\n \n \n\n \n After a while, convinced that there was no danger, Steffens had the ship brought down. When the crew came out of the airlock, they were met by the robots, and each man found himself with a robot at his side, humbly requesting to be of service. There were literally thousands of the robots now, come from all over the barren horizon. The mass of them stood apart, immobile on a plain near the ship, glinting in the sun like a vast, metallic field of black wheat.\n \n The robots had obviously been built to serve. Steffens began to feel their pleasure, to sense it in spite of the blank, expressionless faces. They were almost like children in their eagerness, yet they were still reserved. Whoever had built them, Steffens thought in wonder, had built them well.\n \n Ball came to join Steffens, staring at the robots through the clear plastic of his helmet with baffledly widened eyes. A robot moved out from the mass in the field, allied itself to him. The first to speak had remained with Steffens.\n \n Realizing that the robot could hear every word he was saying, Ball was for a while apprehensive. But the sheer unreality of standing and talking with a multi-limbed, intelligent hunk of dead metal upon the bare rock of a dead, ancient world, the unreality of it slowly died. It was impossible not to like the things. There was something in their very lines which was pleasant and relaxing.\n \n Their builders, Steffens thought, had probably thought of that, too.\n \n \"There's no harm in them,\" said Ball at last, openly, not minding if the robots heard. \"They seem actually glad we're here. My God, whoever heard of a robot being glad?\"\n \n Steffens, embarrassed, spoke quickly to the nearest mechanical: \"I hope you will forgive us our curiosity, but—yours is a remarkable race. We have never before made contact with a race like yours.\" It was said haltingly, but it was the best he could do.\n \n The robot made a singularly human nodding motion of its head.\n \n \"I perceive that the nature of our construction is unfamiliar to you. Your question is whether or not we are entirely 'mechanical.' I am not exactly certain as to what the word 'mechanical' is intended to convey—I would have to examine your thought more fully—but I believe that there is fundamental similarity between our structures.\"\n \n The robot paused. Steffens had a distinct impression that it was disconcerted.\n \n \"I must tell you,\" the thing went on, \"that we ourselves are—curious.\" It stopped suddenly, struggling with a word it could not comprehend. Steffens waited, listening with absolute interest. It said at length:\n \n \"We know of only two types of living structure. Ours, which is largely metallic, and that of the Makers , which would appear to be somewhat more like yours. I am not a—doctor—and therefore cannot acquaint you with the specific details of the Makers' composition, but if you are interested I will have a doctor brought forward. It will be glad to be of assistance.\"\n \n It was Steffens' turn to struggle, and the robot waited patiently while Ball and the second robot looked on in silence. The Makers, obviously, were whoever or whatever had built the robots, and the \"doctors,\" Steffens decided, were probably just that—doctor-robots, designed specifically to care for the apparently flesh-bodies of the Makers.\n \n The efficiency of the things continued to amaze him, but the question he had been waiting to ask came out now with a rush:\n \n \"Can you tell us where the Makers are?\"\n \n Both robots stood motionless. It occurred to Steffens that he couldn't really be sure which was speaking. The voice that came to him spoke with difficulty.\n \n \"The Makers—are not here.\"\n \n Steffens stared in puzzlement. The robot detected his confusion and went on:\n \n \"The Makers have gone away. They have been gone for a very long time.\"\n \n Could that be pain in its voice, Steffens wondered, and then the spectre of the ruined cities rose harsh in his mind.\n \n War. The Makers had all been killed in that war. And these had not been killed.\n \n He tried to grasp it, but he couldn't. There were robots here in the midst of a radiation so lethal that nothing , nothing could live; robots on a dead planet, living in an atmosphere of carbon dioxide.\n \n The carbon dioxide brought him up sharp.\n \n If there had been life here once, there would have been plant life as well, and therefore oxygen. If the war had been so long ago that the free oxygen had since gone out of the atmosphere—good God, how old were the robots? Steffens looked at Ball, then at the silent robots, then out across the field to where the rest of them stood. The black wheat. Steffens felt a deep chill.\n \n Were they immortal?\n \n \n\n \n \"Would you like to see a doctor?\"\n \n Steffens jumped at the familiar words, then realized to what the robot was referring.\n \n \"No, not yet,\" he said, \"thank you.\" He swallowed hard as the robots continued waiting patiently.\n \n \"Could you tell me,\" he said at last, \"how old you are? Individually?\"\n \n \"By your reckoning,\" said his robot, and paused to make the calculation, \"I am forty-four years, seven months, and eighteen days of age, with ten years and approximately nine months yet to be alive.\"\n \n Steffens tried to understand that.\n \n \"It would perhaps simplify our conversations,\" said the robot, \"if you were to refer to me by a name, as is your custom. Using the first—letters—of my designation, my name would translate as Elb.\"\n \n \"Glad to meet you,\" Steffens mumbled.\n \n \"You are called 'Stef,'\" said the robot obligingly. Then it added, pointing an arm at the robot near Ball: \"The age of—Peb—is seventeen years, one month and four days. Peb has therefore remaining some thirty-eight years.\"\n \n Steffens was trying to keep up. Then the life span was obviously about fifty-five years. But the cities, and the carbon dioxide? The robot, Elb, had said that the Makers were similar to him, and therefore oxygen and plant life would have been needed. Unless—\n \n He remembered the buildings on Tyban IV.\n \n Unless the Makers had not come from this planet at all.\n \n His mind helplessly began to revolve. It was Ball who restored order.\n \n \"Do you build yourselves?\" the exec asked.\n \n Peb answered quickly, that faint note of happiness again apparent, as if the robot was glad for the opportunity of answering.\n \n \"No, we do not build ourselves. We are made by the—\" another pause for a word—\"by the Factory .\"\n \n \"The Factory?\"\n \n \"Yes. It was built by the Makers. Would you care to see it?\"\n \n Both of the Earthmen nodded dumbly.\n \n \"Would you prefer to use your—skiff? It is quite a long way from here.\"\n \n It was indeed a long way, even by skiff. Some of the Aliencon crew went along with them. And near the edge of the twilight zone, on the other side of the world, they saw the Factory outlined in the dim light of dusk. A huge, fantastic block, wrought of gray and cloudy metal, lay in a valley between two worn mountains. Steffens went down low, circling in the skiff, stared in awe at the size of the building. Robots moved outside the thing, little black bugs in the distance—moving around their birthplace.\n \n \n\n \n The Earthmen remained for several weeks. During that time, Steffens was usually with Elb, talking now as often as he listened, and the Aliencon team roamed the planet freely, investigating what was certainly the strangest culture in history. There was still the mystery of those buildings on Tyban IV; that, as well as the robots' origin, would have to be cleared up before they could leave.\n \n Surprisingly, Steffens did not think about the future. Whenever he came near a robot, he sensed such a general, comfortable air of good feeling that it warmed him, and he was so preoccupied with watching the robots that he did little thinking.\n \n Something he had not realized at the beginning was that he was as unusual to the robots as they were to him. It came to him with a great shock that not one of the robots had ever seen a living thing. Not a bug, a worm, a leaf. They did not know what flesh was. Only the doctors knew that, and none of them could readily understand what was meant by the words \"organic matter.\" It had taken them some time to recognize that the Earthmen wore suits which were not parts of their bodies, and it was even more difficult for them to understand why the suits were needed.\n \n But when they did understand, the robots did a surprising thing.\n \n At first, because of the excessive radiation, none of the Earthmen could remain outside the ship for long, even in radiation suits. And one morning, when Steffens came out of the ship, it was to discover that hundreds of the robots, working through the night, had effectively decontaminated the entire area.\n \n It was at this point that Steffens asked how many robots there were. He learned to his amazement that there were more than nine million. The great mass of them had politely remained a great distance from the ship, spread out over the planet, since they were highly radioactive.\n \n Steffens, meanwhile, courteously allowed Elb to probe into his mind. The robot extracted all the knowledge of matter that Steffens held, pondered over the knowledge and tried to digest it, and passed it on to the other robots. Steffens, in turn, had a difficult time picturing the mind of a thing that had never known life.\n \n He had a vague idea of the robot's history—more, perhaps, then they knew themselves—but he refrained from forming an opinion until Aliencon made its report. What fascinated him was Elb's amazing philosophy, the only outlook, really, that the robot could have had.\n \n \n\n \n \"What do you do ?\" Steffens asked.\n \n Elb replied quickly, with characteristic simplicity: \"We can do very little. A certain amount of physical knowledge was imparted to us at birth by the Makers. We spend the main part of our time expanding that knowledge wherever possible. We have made some progress in the natural sciences, and some in mathematics. Our purpose in being, you see, is to serve the Makers. Any ability we can acquire will make us that much more fit to serve when the Makers return.\"\n \n \"When they return?\" It had not occurred to Steffens until now that the robots expected the Makers to do so.\n \n Elb regarded him out of the band of the circling eye. \"I see you had surmised that the Makers were not coming back.\"\n \n If the robot could have laughed, Steffens thought it would have, then. But it just stood there, motionless, its tone politely emphatic.\n \n \"It has always been our belief that the Makers would return. Why else would we have been built?\"\n \n Steffens thought the robot would go on, but it didn't. The question, to Elb, was no question at all.\n \n Although Steffens knew already what the robot could not possibly have known—that the Makers were gone and would never come back—he was a long time understanding. What he did was push this speculation into the back of his mind, to keep it from Elb. He had no desire to destroy a faith.\n \n But it created a problem in him. He had begun to picture for Elb the structure of human society, and the robot—a machine which did not eat or sleep—listened gravely and tried to understand. One day Steffens mentioned God.\n \n \"God?\" the robot repeated without comprehension. \"What is God?\"\n \n Steffens explained briefly, and the robot answered:\n \n \"It is a matter which has troubled us. We thought at first that you were the Makers returning—\" Steffens remembered the brief lapse, the seeming disappointment he had sensed—\"but then we probed your minds and found that you were not, that you were another kind of being, unlike either the Makers or ourselves. You were not even—\" Elb caught himself—\"you did not happen to be telepaths. Therefore we troubled over who made you. We did detect the word 'Maker' in your theology, but it seemed to have a peculiar—\" Elb paused for a long while—\"an untouchable, intangible meaning which varies among you.\"\n \n Steffens understood. He nodded.\n \n The Makers were the robots' God, were all the God they needed. The Makers had built them, the planet, the universe. If he were to ask them who made the Makers, it would be like their asking him who made God.\n \n It was an ironic parallel, and he smiled to himself.\n \n But on that planet, it was the last time he smiled.",
      "metadata": {
        "title": "Orphans of the Void",
        "author": "Michael Shaara",
        "passage_id": "50827",
        "uid": "9e78b038055c4dd8bb74f1c919ae6113",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "10",
                "uid": "a17f0b3f37684f009d2335d827d7951e",
                "response_text": "Captain Steffens and his crew, including Lieutenant Ball, are exploring the dead (uninhabited) fourth planet of the star called Tybanon in the Coal Sack Nebula. They are on a Mapping Command sent from Earth to explore new planets, assess them for life-forms and evaluate the ability of human colonization.\nThis planet is peculiar because it contains stone building structures that are over 15,000 years old. Steffens and Ball discuss the profound realization that to be that old, the alien race that erected them must be quite advanced, with interstellar travel while humans were still throwing spears around. They conclude there were castaways stranded on the planet that were then evacuated since they could find no other traces of civilization besides the structures.\nThey begin mystery-solving, wondering if the race evacuated to a different planet. The readings from the system indicate that there are moons, and the Third planet has a suitable temperature range for life, but has a CO2 atmosphere. They take their ship down to cruising altitude on the Third planet and find cities that have all been obliterated into black craters at least three miles in diameter and very deep. They are shaken, and then Steffens spots the most perfect robots he has ever seen. They are black plastic, expertly crafted, have hanging arms and legs and move with a gliding motion. \nHe is forbidden by League Law from contacting planet-bound races. He is not clear if robots are a race (sentient robots are banned on Earth) and thinks that he could be in trouble whether he contacts them or not. Contacting them if they are a race would be bad, and also he would be dismissed for not fulfilling his mapping duties if they aren’t a race. As he wonders, the robots contact the humans telepathically, urging them to land since their only desire is to serve and sending a visual of a robot extending a handshake.\nSteffens decides not to reach out to the Alien Contact branch, and makes contact and lands on the planet. The robots are disappointed when the humans land, but show examples of caring for them like cleaning up the radiation so that the humans can feel more comfortable, and spreading their robot bodies out across the planet because they themselves are radioactive.\nThe humans spend three weeks gathering knowledge of the planet. Steffens begins to inquire about their origins and finds they were constructed by “Makers” who are no longer on the planet, but that the robots believe will return. They were disappointed when the humans landed because they did not communicate telepathically and so could not be the makers. The robots also have Factories on the planet where they are constructed. The story ends with Steffens feeling an irony that he wishes to discover who made the robots, but asking them who their Makers are would be like asking a human who created their god - an impossible question.\n"
              },
              {
                "worker_id": "6",
                "uid": "15efaa4e6bae4a8fbdebc298cad84c97",
                "response_text": "Captain Steffens, leader of the Mapping Command, led his crew to the Coal Sack Nebula and landed on Tyban IV. There, they discover the buildings left behind by an ancient civilization. Made out of native stone, the buildings were worn away by winds and times and were built on a raised rock. Lieutenant Ball and his geologists estimate that the rock was cut at least 15,000 years ago, 14,700 years before humans took to space. Ball and Steffens discuss the other planets in the Nebula, but none are fit to host human life. Still, they check each one out until they reach the hot one. This planet was radioactive and absolutely incapable of hosting life, however, as they got closer, Steffens could see a giant hole in the center. The site of an explosion, and all that remained was rubble. The image is up on the main screen for the whole crew to see, and they watch in amazement. Steffens sees movement in the rubble, and orders his crew to move the ship closer. He sees a black robot, and then two, as does the rest of his crew. Ball, who fell in the sudden movement, comes to Steffens, and they throw around ideas as to what these robots could be. Suddenly, a calm voice speaks to them telepathically, welcoming them to their planet and claiming they only wish to serve. A picture appeared then of a robot extending one of its hands. \nSteffens asks for permission to land, and so they do. He leaves the ship first, wearing his radiation suit, and is greeted by a large amount of slightly disappointed robots. He waves it off and soon the other members of his crew join them. Elb, the first robot to speak, explains their telepathic abilities and apologizes for violating their minds. They talk for a little while until Steffens asks where the Makers are. The robots answer sadly, saying that the Makers left a long time ago but would return. Steffens believes the Makers are dead, caught in the crossfire of the explosion, but he doesn’t say so. The robots then showed his crew the Factory, which they reached by skiff. It was a large, gray building that pumped out robots left and right. \nThe Mapping Command stayed on this planet for several weeks, discovering more about this alien culture. However, the radioactive nature of the planet made it impossible for any man to stay outside the ship for long. However, one day, Steffens emerges to realize the robots effectivelyd econtaminated the area overnight. \nElb and Steffens discuss their meaning of life and what they were built to do. He realizes the Makers are like God to these robots, and he smiles at the irony. The story ends on a cliffhanger, however, claiming that that was the last time Steffens would smile on this planet. \n"
              },
              {
                "worker_id": "3",
                "uid": "a81f892d81cb40769b4b1805a436c4b7",
                "response_text": "Captain Steffens and Lieutenant Ball find themselves in a very old city on a planet far from Earth, which was the first piece of proof humans had found of another advanced race in the three hundred years humans had been in space. There is something curious about the ruins of the old city built from stone, because the humans wouldn't have expected a colony to establish a presence there. They find another city on a nearby planet with a three-mile-wide scorch mark that looked like it had decimated the city. The men detect high levels of radiation, and know nothing alive is left. They decide to explore here as well, when Steffens spots a small black robot on the surface, which makes him jump the ship back up, opening up sight to a whole field of robots, which baffled the crew. They don't know if they are entirely mechanical, how long they'd been there, or where they came from. All of a sudden, the members of the crew hear the robots talking to them in a greeting, and then plant a moving picture in everyone's mind, which startles the crew. Steffens requests permission to land, and everyone realizes how many robots there really are. Steffens is surprised that the robots seem less interested in the humans once Steffans has gotten off of their ship, which makes everyone uncomfortable. The robots explain that the humans do not understand their real nature and wanted to inform them, and they promise not to intrude on thoughts anymore without consent. Steffens notices some symbols on the robot he had met, which look identical to the markings on the other robots, though he is unsure of their importance. The more he interacts with the robots, the more Steffans finds their presence likeable and comforting. Nobody is able to determine if the robots are entirely mechanical, or if there are organic components. The robots explain that they only other living structures they are familiar with are \"the Makers\" who created the robots. The Makers have not been present for a long time, making Steffens suspect that the robots had been involved in the war he had just seen evidence of. Steffens learns that the lifespan of the robots is about 55 years, but the robots are of various ages; they are built by \"the Factory\", which was built by the Makers. The humans stay for a few weeks, learning what they can, trading knowledge. Once the robots understand the point of the radiation suits, they decontaminate the area to make it safe for the humans, though they themselves remain radioactive. Elb, the lead robot, explains that the robots' main goal is to expand knowledge which will serve the Makers. The conversation gets tense as Elb recognizes that Steffens doesn't think the Makers are coming back, so they talk about society and faith.  Steffens explains the concept of God, which the robots find varies far more for humans than the idea of the Makers does for them."
              },
              {
                "worker_id": "2",
                "uid": "ade8f4e61f64447888734c9dd7854253",
                "response_text": "Captain Steffens and his crew work for Mapping Command; their mission is to closely examine unexplored areas, check for life-forms, and determine whether sites are suitable for human habitation. They are currently exploring and recording information about the four planets of the star named Tyban in the Coal Sack Nebula. They find stone buildings still standing on the fourth planet but no signs of previous life. The smoothness of the stones leads them to conclude the buildings are approximately 15,000 years old. The men are amazed that space-borne beings were in this part of the Galaxy at the time when men on Earth were throwing spears at each other. They have numerous questions about the race, why there is no sign of them, and what happened to them. Lacking any way to answer these questions, they decide to move on.\n\tFlying over the fourth planet, the crew sees the remains of several cities, each destroyed by a blast that ruined the buildings. They see movement and realize it is a robot looking up at the ship; then they see more robots. At first, Steffens is undecided about what to do. League Law prohibits contact with planet-bound species, but these are robots, not living beings. Steffens decides they can legally interact with the robots, and then one of them communicates a message to him, greeting him and assuring him they do not mean any harm. It also sent a picture of one of the robots with its right arm extended for a handshake. Steffens senses the robot could control his mind if it wanted to and decides to communicate back, asking for permission to land.\n\tSteffens takes a skiff to the planet and is greeted by a robot holding out its hand for a handshake and welcoming him. Steffens signals the Aliencon men on the skiff to deplane and join him, and the robots reveal that they can read the humans’ minds but are limiting their access to what is needed to communicate with them. Steffens signals his ship to land, and more robots come into view. The robots are friendly and pleasant, even relaxing to be around. They explain they had never encountered humans before, just themselves and their Makers who had lived there and created the factory that builds the robots. The robots were built to serve the Makers, and the factory is still producing them so that now there are nine million of them. \n\tElb, the robot who stays with Steffen, asks and answers questions and explains that the robots spend their time building their knowledge to be better able to serve their Makers when they return. Elb detects that Steffens thinks the Makers will not return and says they believe they will; otherwise, why were they built? Steffens compares their Makers to God because the robots believe the Makers created them, their planet, and the universe.\n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "10",
                "uid": "a17f0b3f37684f009d2335d827d7951e",
                "response_text": "The story opens in the Coal Sack Nebula, on the uninhabited fourth planet of a star called Tyban. There are twelve 15,000 year old stone buildings on the dusty uninhabitable planet, the first evidence of another advanced space-crossing alien race.\nSteffens and his crew travel to the Third planet in the Tyban solar system which seems uninhabited as well, with the cities obliterated into black holes in the ground that are at least three miles wide. The Third planet is Earth-like, with continents, hills and deserts, and of a suitable temperature for life, but with absolutely no vegetation, deathly radiation for humans, and a CO2 atmosphere. They see splintered walls and wreckage, but no life - until their discovery of the robots. There are nine million black, plastic robots slightly shorter than humans on the planet, and they have a huge, grey block building Factory near the edge of the twilight zone in a valley between two mountains where they are produced. Their desire for their human-like Makers to return to them, and their use of telepathic communication and mind-probing sets an eerie vibe over the humans’ exploration of the planet.\n"
              },
              {
                "worker_id": "6",
                "uid": "15efaa4e6bae4a8fbdebc298cad84c97",
                "response_text": "Orphans of the World by Michael Shaara takes place on two different planets in the Coal Sack Nebula. The first is Tyban IV. There, Steffens and his crew discover the remnants of an ancient, alien civilization from at least over 15,000 years ago. They built stone buildings, worn away with time, out of the native materials sourced on the planet. The next planet they visited was hot and radioactive, absolutely unable to support any humanoid life form. However, when they got closer to the surface, Steffens and his crew noticed a giant hole in the center, charred and burnt. All the buildings within had perished in the explosion and nothing remained but a pile of rubble. The planet itself was hot and dry without any plants or wildlife. There is also a Factory on it, a large, gray building, where the robots are created. "
              },
              {
                "worker_id": "3",
                "uid": "a81f892d81cb40769b4b1805a436c4b7",
                "response_text": "This story takes place in space, where a group of humans is traveling on a ship in the Coal Sack Nebula. The star Tyban is the \"sun\", so to speak, of the relevant planets, and the humans start their journey on the fourth planet of this system, standing in the ruins of a destroyed city that did not leave them many details to learn from. The third planet of the system, one in from the first one they were on, had more information for them. There was a city abandoned much like the one they had found on the fourth planet, but the huge scorch mark that covered the city made it look like its destruction had been very violent. On this third planet, there was no oxygen, a lot of heat, and it didn't seem like it would be able to support any kind of life, especially since it had high levels of radiation. There was a valley with the factory in it, far away from the city. Much to the surprise of the human crew, there is a large swarm of black robots that seem to be the only connection to the planet. "
              },
              {
                "worker_id": "2",
                "uid": "ade8f4e61f64447888734c9dd7854253",
                "response_text": "\n\tThe story is set in the Coal Sack Nebula on the dead fourth and third planets of a star named Tyban. The fourth planet, Tyban IV, is only one parsec from Varius II and has 12 stone buildings with no airlocks, despite the thin atmosphere, or inscriptions—any that were made would have presumably been removed by the winds blowing across the planet. The stones themselves have worn smooth, so based on the timeframe for wind erosion on Earth, Captain Steffens estimates the buildings might be 10 to 15 thousand years old. This discovery is significant because humans have been exploring space for 300 years, and this is the first sighting of an advanced, space-crossing, alien race. The planet has a sandy surface and a blue-black mid-day sky. Of the other three planets, the inner is too hot for habitation and the outer too heavy and cold. \nThe third planet has a decent temperature range but a carbon dioxide atmosphere. The planet is surrounded by a layer of clouds and a misty gas; it is a heavy planet with no free oxygen, but there are several dead cities, each destroyed by a blast in the center, leaving a deep hole three miles wide and shattered, splintered walls. There is no vegetation, and the planet has lethal radiation levels that would prevent any life. The surface features rocky hills. This planet, however, has millions of active robots produced in a factory that is still operational. The robots have telepathic abilities and communicate with the people on the ship, inviting them to land. The robot factory was built by what the robots refer to as Makers, who have since left the planet and not returned. The robots have the ability to decontaminate the radiation and are slightly radioactive themselves.\n"
              }
            ]
          },
          {
            "question_text": "What is the irony of the “Makers” in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "10",
                "uid": "a17f0b3f37684f009d2335d827d7951e",
                "response_text": "The “Makers” are to the robots as gods of creation are to humans. The robots believe that the Makers wouldn’t have created them if they wouldn’t return for them one day, and so steadfastly believe that the Makers will visit. They tell Steffens that the Makers were similar to his human form. This is evidenced by the disappointment the robots display when the humans land and the robots realize they do not communicate telepathically, thus cannot be the Makers they were expecting.\nSteffens states the “ironic parallel” of the Makers at the end of the story because the humans wish to understand who created the robots, but they can’t possibly answer that question because it would be like asking a human who created their god.\n"
              },
              {
                "worker_id": "6",
                "uid": "15efaa4e6bae4a8fbdebc298cad84c97",
                "response_text": "The “Makers” are humanoid aliens from over 15,000 years ago. They built the robots currently living on the radioactive wasteland to serve their every need. However, when their civilization was destroyed in the war, nothing remained of them aside from their robots. The robots idolize their Makers since they quite literally created them as well as the universe they exist in. Steffens draws the parallel between the robots’ Makers and humans’ God. He considers asking them who made the Makers, but then realizes that would be like asking who made God. "
              },
              {
                "worker_id": "3",
                "uid": "a81f892d81cb40769b4b1805a436c4b7",
                "response_text": "The Makers were the race of people who had built the robots that the humans discover in the story. When the humans visit the planet, the robots are the only moving things on the surface: it seems that the Makers were likely destroyed in whatever radioactive explosion destroyed their city. The robots, when probing the minds of the humans, found the idea of the Maker to be the God of Earth, and tried to make connections between the two ideas. Much in the same way, the Maker of any sort had been responsible for building the creatures that lived to serve it. Unfortunately, given the evidence of some kind of war, the humans don't think the Makers are going to return to the planet they are visiting, which means that the robots will be working forever to serve the Makers who they will not see again; that is, they will never meet their makers. Even though their goals are based on self-improvement, they have no way of knowing if the main source of their motivation is even real anymore. It could also easily be confusing, if the humans asked where the Makers came from, because Steffens did not want to confuse the robots by asking them who the God of their own God was, so to speak. "
              },
              {
                "worker_id": "2",
                "uid": "ade8f4e61f64447888734c9dd7854253",
                "response_text": "\n\tThe irony of the Makers is that they are the robots’ God and parallel to the human concept of God. Just as human theology holds that God created the universe and humans, in the robots’ understanding, the Makers created them, the planet, and the universe. There are other parallels as well; Christianity teaches that God dwelled among humans in his human form as Jesus. The Makers lived among the robots. Jesus was crucified and dead for three days until he returned to life and the people who knew him. Likewise, the Makers are gone, yet the robots fully expect them to return. Human theology teaches that God created humans to worship him and serve him; the Makers created the robots to serve them. In the absence of their Makers, the robots expectantly await their return just as Christians await the second coming of Jesus.\n\tFurthermore, the robots want to please their Makers and serve them the best they can. For this reason, in the Makers’ absence, the robots have worked to improve themselves, learning what they can about natural science and mathematics. When Elb probes Steffens’s mind to learn more about matter, his purpose is to enhance their knowledge. Likewise, humans seek to gain more knowledge about God and his teachings to serve God better.\n\tIt is also ironic that Steffens concludes that the Makers died in a war due to the ruined cities they discovered, but he doesn’t want to harm the robots’ faith in the return of their Makers. \n\t\n"
              }
            ]
          },
          {
            "question_text": "Describe what the robots are.",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "10",
                "uid": "a17f0b3f37684f009d2335d827d7951e",
                "response_text": "The robots are the first evidence of an advanced alien race that man has discovered in 300 years of interstellar travel. They are at least a foot shorter than the humans, with an eye-band circling their entire head, bunches of hanging arms, and a gliding type of locomotion. Steffens remarks that they are some of the most well-built machinery he has ever seen. The robots are made of black plastic, and have rows of dense symbols engraved all over their torsos. Their communication comes to the humans telepathically, and they are fully sentient - aware of their life spans of ~55 years, and their time until death. They also have the ability to probe the minds of the humans and even urge them to make certain decisions, but they reveal they only use this to get the humans to land and will not use it further except when given permission.\nThey claim to have been made by the Makers, and exhibit the Factory where they are built to Steffens and his crew while they are on the Third planet. There are more than nine million of them in total on the planet, which astonishes the humans, and they spend their time trying to expand their knowledge to better serve their Makers when they eventually return to the planet. \n"
              },
              {
                "worker_id": "6",
                "uid": "15efaa4e6bae4a8fbdebc298cad84c97",
                "response_text": "The robots are short, black hunks of metal with several arms and legs each. They have a plastic band that circles their head, allowing them to see in every direction. They have a series of symbols that decorate the fronts of their bodies. They are telepathic robots, able to both see into the minds of others as well as communicate with them both in their language and through visual elements. They are, as is often said, built to serve, and they live in a sort of purgatory waiting for their Makers to return home. There are approximately nine million robots currently living on that planet, each with a life span of around 55 years. They are made in the Factory, which was, of course, built by the Makers. There are two types of robots: the normal ones met by Steffens and Ball, as well as the Doctors who are able to heal flesh. "
              },
              {
                "worker_id": "3",
                "uid": "a81f892d81cb40769b4b1805a436c4b7",
                "response_text": "The robots that Steffens spots on the third planet of the star Tyban are small and black with a vision band wrapping around the top, the rest created from black metal, with a number of sturdy legs that put them about a foot shorter than the humans. They have the ability to make the humans on the ship hear thoughts that they relay to them, and can even send images this way, which makes Steffens worry that they have mind-control abilities. They do have the ability to intrude on thoughts. It is clear to Steffens that they were built to serve those around them, and at the initial encounter they do insist that their \"only desire is to serve\". Those that they want to serve are \"the Makers\", presumably the race of people who were on the planet before the city was scorched and destroyed in some kind of radioactive explosion. It is not clear what the robots' role in this part of the history is, just that the chances of their makers coming back to them was probably very low. "
              },
              {
                "worker_id": "2",
                "uid": "ade8f4e61f64447888734c9dd7854253",
                "response_text": "The robots were designed by their Makers and produced in their factories which are still operational as there are over nine million of them of various ages and remaining lifespans. They are small, black structures with several hanging arms and legs. They have a band of transparent plastic-like material that runs around their heads; this is presumably their eye, enabling them to see in all directions. A similar round dot of the plastic on top of their heads suggests they can see directly over them. The robots are all identical and have rows of symbols on their torsos. Surprisingly, the robots appear to demonstrate emotion as they seem disappointed when they first meet Steffens, pleased when the ship lands and the crew joins them on the planet, pained when they refer to their Makers who have been gone a long time, and curious about the similarities and differences between themselves and the humans.\nCommunicating telepathically, the robots let Steffens and his crew know that they are designed to serve. It is possible that the robots can control human minds, but they choose not to do so. They let Steffens know that they only reached out to the humans’ minds because they detected that the humans were going to leave, so they decided to communicate some information about themselves so that the humans would stay for a visit. They also indicate that they explored the humans’ minds only enough to be able to contact and communicate with them. The robots understand human thinking: they know how to present themselves as nonthreatening, sending an image of one with an outstretched arm for a handshake and reducing the number of robots that first engage with the humans, so they won’t be overwhelmed or intimidated. They also understand that their silence will draw the humans in after their initial communication and the picture, due to their curiosity. \nLeft to their own devices after their Makers left and didn’t return, the robots engaged in building their knowledge of the natural sciences and mathematics. Their goal is to make themselves even more useful to their Makers when they return. The robots fully expect their Makers to return; otherwise, what would be their purpose?\n"
              }
            ]
          },
          {
            "question_text": "Why does Steffens decide to engage with the robots?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "10",
                "uid": "a17f0b3f37684f009d2335d827d7951e",
                "response_text": "Steffens was stumped as to what to do when they visually discovered robots on the Third planet. He proactively sounded an alert and put defense screens on the ship, but wondered about what his governing League Law would have him do.\nContact with races on foreign planets was forbidden, but he was unsure if robots could be called a race. Earth didn’t have robots because imaginative robots were expressly forbidden to build. Steffens thought it was possible the robots were the brains of natives encased in metal.\nSince Steffens is under “The Mapping Command”, he is supposed to go no further than examining unexplored systems, checking for life-forms and the possibilities of human colonization. His conundrum was that,  “if he returned to Sirius base without investigating this robot situation, he could very well be court-martialed one way or the other, either for breaking the Law of Contact or for dereliction of duty.”\nThe robots reach out telepathically, saying in words that they are only here to serve, and communicating a photo to the minds of the crew of a robot extending a hand for a handshake. Although Steffens wonders about letting the Alien Contact crew handle the situation, he ultimately decides it is his responsibility - and he goes on to initiate contact by requesting to land. He is encouraged to stay and explore by the kind nature of the robots.\n"
              },
              {
                "worker_id": "6",
                "uid": "15efaa4e6bae4a8fbdebc298cad84c97",
                "response_text": "When Steffens and his crew flew from Tyban IV to check out this other planet, they had no idea that they would find life or even robotic humanoids on this planet. The Mapping Command is simply meant to check off boxes (was there life on this planet? Is it inhabitable for humans?), not to interact with the potential life forms below. However, Steffens is faced with a serious dilemma when he encounters the robots. He has already technically made contact by accident since he flew so close to the surface to investigate the burnt city. Whether or not he interacted with them more or flew away, he would be in trouble with the Commissioner. Contact with races is expressly forbidden, however, he wonders if robots could really be defined as a race since they were more of an invention. So, he decided to learn more about the robots by staying. "
              },
              {
                "worker_id": "3",
                "uid": "a81f892d81cb40769b4b1805a436c4b7",
                "response_text": "At first, Steffens isn't sure if he should engage with the robots because the League Law forbids contact with planet-bound races, but the robots were not necessarily a race. Because Earthmen did not have robots, they were a new type of encounter for him, and he decided that it would be okay since they had effectively already made contact. He isn't even sure if they are native beings with some kind of casing to protect their organs or even just brains from the elements, or if they are entirely robots. In the end, though, it was a Catch-22: if he made contact, he could be breaking the Law of Contact, but if he went back to base without making contact, it could be said that he did not complete his duty. "
              },
              {
                "worker_id": "2",
                "uid": "ade8f4e61f64447888734c9dd7854253",
                "response_text": "Steffens decides to engage with the robots because they seem to be openly and graciously inviting the spaceship and its men to visit them. The robots send a friendly greeting, explaining that they do not wish the humans harm and that their only desire is to serve. They also send an image of one of the robots lifting its arm and graciously offering its hand. In addition, since the robots communicate with the humans telepathically, their messages are persuasive, and Steffens feels a strong urge to take the robot’s proffered hand. Another reason he decides to engage with the robots is that while the Law of Contact forbids making contact with life-forms, the robots are not life-forms, and Steffens could very well face a court-martial for dereliction of duty if he does not make contact with them. On top of that, Steffens is immensely curious about the robots and their makers."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5401,
        "document_length_chars": 31231
      }
    }
  ]
}