{
  "item_metadata": {
    "item_id": "50848",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "50848",
      "content": "SOLDIER BOY\n \n \n By MICHAEL SHAARA\n \n Illustrated by EMSH\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction July 1953. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n It's one thing to laugh at a man because his job is useless and outdated—another to depend on him when it suddenly isn't.\n \n\n In the northland, deep, and in a great cave, by an everburning fire the Warrior sleeps. For this is the resting time, the time of peace, and so shall it be for a thousand years. And yet we shall summon him again, my children, when we are sore in need, and out of the north he will come, and again and again, each time we call, out of the dark and the cold, with the fire in his hands, he will come.\n \n\n — Scandinavian legend\n \n\n \n Throughout the night, thick clouds had been piling in the north; in the morning, it was misty and cold. By eight o'clock a wet, heavy, snow-smelling breeze had begun to set in, and because the crops were all down and the winter planting done, the colonists brewed hot coffee and remained inside. The wind blew steadily, icily from the north. It was well below freezing when, some time after nine, an army ship landed in a field near the settlement.\n \n There was still time. There were some last brief moments in which the colonists could act and feel as they had always done. They therefore grumbled in annoyance. They wanted no soldiers here. The few who had convenient windows stared out with distaste and a mild curiosity, but no one went out to greet them.\n \n After a while a rather tall, frail-looking man came out of the ship and stood upon the hard ground looking toward the village. He remained there, waiting stiffly, his face turned from the wind. It was a silly thing to do. He was obviously not coming in, either out of pride or just plain orneriness.\n \n \"Well, I never,\" a nice lady said.\n \n \"What's he just standing there for?\" another lady said.\n \n And all of them thought: well, God knows what's in the mind of a soldier, and right away many people concluded that he must be drunk. The seed of peace was deeply planted in these people, in the children and the women, very, very deep. And because they had been taught, oh so carefully, to hate war they had also been taught, quite incidentally, to despise soldiers.\n \n The lone man kept standing in the freezing wind.\n \n \n\n \n Eventually, because even a soldier can look small and cold and pathetic, Bob Rossel had to get up out of a nice, warm bed and go out in that miserable cold to meet him.\n \n The soldier saluted. Like most soldiers, he was not too neat and not too clean and the salute was sloppy. Although he was bigger than Rossel he did not seem bigger. And, because of the cold, there were tears gathering in the ends of his eyes.\n \n \"Captain Dylan, sir.\" His voice was low and did not carry. \"I have a message from Fleet Headquarters. Are you in charge here?\"\n \n Rossel, a small sober man, grunted. \"Nobody's in charge here. If you want a spokesman I guess I'll do. What's up?\"\n \n The captain regarded him briefly out of pale blue, expressionless eyes. Then he pulled an envelope from an inside pocket, handed it to Rossel. It was a thick, official-looking thing and Rossel hefted it idly. He was about to ask again what was it all about when the airlock of the hovering ship swung open creakily. A beefy, black-haired young man appeared unsteadily in the doorway, called to Dylan.\n \n \"C'n I go now, Jim?\"\n \n Dylan turned and nodded.\n \n \"Be back for you tonight,\" the young man called, and then, grinning, he yelled \"Catch\" and tossed down a bottle. The captain caught it and put it unconcernedly into his pocket while Rossel stared in disgust. A moment later the airlock closed and the ship prepared to lift.\n \n \"Was he drunk ?\" Rossel began angrily. \"Was that a bottle of liquor ?\"\n \n The soldier was looking at him calmly, coldly. He indicated the envelope in Rossel's hand. \"You'd better read that and get moving. We haven't much time.\"\n \n He turned and walked toward the buildings and Rossel had to follow. As Rossel drew near the walls the watchers could see his lips moving but could not hear him. Just then the ship lifted and they turned to watch that, and followed it upward, red spark-tailed, into the gray spongy clouds and the cold.\n \n \n\n \n After a while the ship went out of sight, and nobody ever saw it again.\n \n \n\n \n The first contact Man had ever had with an intelligent alien race occurred out on the perimeter in a small quiet place a long way from home. Late in the year 2360—the exact date remains unknown—an alien force attacked and destroyed the colony at Lupus V. The wreckage and the dead were found by a mailship which flashed off screaming for the army.\n \n When the army came it found this: Of the seventy registered colonists, thirty-one were dead. The rest, including some women and children, were missing. All technical equipment, all radios, guns, machines, even books, were also missing. The buildings had been burned, so were the bodies. Apparently the aliens had a heat ray. What else they had, nobody knew. After a few days of walking around in the ash, one soldier finally stumbled on something.\n \n For security reasons, there was a detonator in one of the main buildings. In case of enemy attack, Security had provided a bomb to be buried in the center of each colony, because it was important to blow a whole village to hell and gone rather than let a hostile alien learn vital facts about human technology and body chemistry. There was a bomb at Lupus V too, and though it had been detonated it had not blown. The detonating wire had been cut.\n \n In the heart of the camp, hidden from view under twelve inches of earth, the wire had been dug up and cut.\n \n The army could not understand it and had no time to try. After five hundred years of peace and anti-war conditioning the army was small, weak and without respect. Therefore, the army did nothing but spread the news, and Man began to fall back.\n \n In a thickening, hastening stream he came back from the hard-won stars, blowing up his homes behind him, stunned and cursing. Most of the colonists got out in time. A few, the farthest and loneliest, died in fire before the army ships could reach them. And the men in those ships, drinkers and gamblers and veterans of nothing, the dregs of a society which had grown beyond them, were for a long while the only defense Earth had.\n \n This was the message Captain Dylan had brought, come out from Earth with a bottle on his hip.\n \n \n\n \n An obscenely cheerful expression upon his gaunt, not too well shaven face, Captain Dylan perched himself upon the edge of a table and listened, one long booted leg swinging idly. One by one the colonists were beginning to understand. War is huge and comes with great suddenness and always without reason, and there is inevitably a wait, between acts, between the news and the motion, the fear and the rage.\n \n Dylan waited. These people were taking it well, much better than those in the cities had taken it. But then, these were pioneers. Dylan grinned. Pioneers. Before you settle a planet you boil it and bake it and purge it of all possible disease. Then you step down gingerly and inflate your plastic houses, which harden and become warm and impregnable; and send your machines out to plant and harvest; and set up automatic factories to transmute dirt into coffee; and, without ever having lifted a finger, you have braved the wilderness, hewed a home out of the living rock and become a pioneer. Dylan grinned again. But at least this was better than the wailing of the cities.\n \n This Dylan thought, although he was himself no fighter, no man at all by any standards. This he thought because he was a soldier and an outcast; to every drunken man the fall of the sober is a happy thing. He stirred restlessly.\n \n By this time the colonists had begun to realize that there wasn't much to say, and a tall, handsome woman was murmuring distractedly: \"Lupus, Lupus—doesn't that mean wolves or something?\"\n \n Dylan began to wish they would get moving, these pioneers. It was very possible that the aliens would be here soon, and there was no need for discussion. There was only one thing to do and that was to clear the hell out, quickly and without argument. They began to see it.\n \n But, when the fear had died down, the resentment came. A number of women began to cluster around Dylan and complain, working up their anger. Dylan said nothing. Then the man Rossel pushed forward and confronted him, speaking with a vast annoyance.\n \n \"See here, soldier, this is our planet. I mean to say, this is our home . We demand some protection from the fleet. By God, we've been paying the freight for you boys all these years and it's high time you earned your keep. We demand....\"\n \n It went on and on while Dylan looked at the clock and waited. He hoped that he could end this quickly. A big gloomy man was in front of him now and giving him that name of ancient contempt, \"soldier boy.\" The gloomy man wanted to know where the fleet was.\n \n \"There is no fleet. There are a few hundred half-shot old tubs that were obsolete before you were born. There are four or five new jobs for the brass and the government. That's all the fleet there is.\"\n \n \n\n \n Dylan wanted to go on about that, to remind them that nobody had wanted the army, that the fleet had grown smaller and smaller ... but this was not the time. It was ten-thirty already and the damned aliens might be coming in right now for all he knew, and all they did was talk. He had realized a long time ago that no peace-loving nation in the history of Earth had ever kept itself strong, and although peace was a noble dream, it was ended now and it was time to move.\n \n \"We'd better get going,\" he finally said, and there was quiet.\n\"Lieutenant Bossio has gone on to your sister colony at Planet Three of this system. He'll return to pick me up by nightfall and I'm instructed to have you gone by then.\"\n \n For a long moment they waited, and then one man abruptly walked off and the rest followed quickly; in a moment they were all gone. One or two stopped long enough to complain about the fleet, and the big gloomy man said he wanted guns, that's all, and there wouldn't nobody get him off his planet. When he left, Dylan breathed with relief and went out to check the bomb, grateful for the action.\n \n Most of it had to be done in the open. He found a metal bar in the radio shack and began chopping at the frozen ground, following the wire. It was the first thing he had done with his hands in weeks, and it felt fine.\n \n Dylan had been called up out of a bar—he and Bossio—and told what had happened, and in three weeks now they had cleared four colonies. This would be the last, and the tension here was beginning to get to him. After thirty years of hanging around and playing like the town drunk, a man could not be expected to rush out and plug the breach, just like that. It would take time.\n \n He rested, sweating, took a pull from the bottle on his hip.\n \n Before they sent him out on this trip they had made him a captain. Well, that was nice. After thirty years he was a captain. For thirty years he had bummed all over the west end of space, had scraped his way along the outer edges of Mankind, had waited and dozed and patrolled and got drunk, waiting always for something to happen. There were a lot of ways to pass the time while you waited for something to happen, and he had done them all.\n \n Once he had even studied military tactics.\n \n He could not help smiling at that, even now. Damn it, he'd been green. But he'd been only nineteen when his father died—of a hernia, of a crazy fool thing like a hernia that killed him just because he'd worked too long on a heavy planet—and in those days the anti-war conditioning out on the Rim was not very strong. They talked a lot about guardians of the frontier, and they got him and some other kids and a broken-down doctor. And ... now he was a captain.\n \n He bent his back savagely, digging at the ground. You wait and you wait and the edge goes off. This thing he had waited for all those damn days was upon him now and there was nothing he could do but say the hell with it and go home. Somewhere along the line, in some dark corner of the bars or the jails, in one of the million soul-murdering insults which are reserved especially for peacetime soldiers, he had lost the core of himself, and it didn't particularly matter. That was the point: it made no particular difference if he never got it back. He owed nobody. He was tugging at the wire and trying to think of something pleasant from the old days, when the wire came loose in his hands.\n \n Although he had been, in his cynical way, expecting it, for a moment it threw him and he just stared. The end was clean and bright. The wire had just been cut.\n \n \n\n \n Dylan sat for a long while by the radio shack, holding the ends in his hands. He reached almost automatically for the bottle on his hip and then, for the first time he could remember, let it go. This was real, there was no time for that.\n \n When Rossel came up, Dylan was still sitting. Rossel was so excited he did not notice the wire.\n \n \"Listen, soldier, how many people can your ship take?\"\n \n Dylan looked at him vaguely. \"She sleeps two and won't take off with more'n ten. Why?\"\n \n His eyes bright and worried, Rossel leaned heavily against the shack.\n\"We're overloaded. There are sixty of us and our ship will only take forty. We came out in groups, we never thought....\"\n \n Dylan dropped his eyes, swearing silently. \"You're sure? No baggage, no iron rations; you couldn't get ten more on?\"\n \n \"Not a chance. She's only a little ship with one deck—she's all we could afford.\"\n \n Dylan whistled. He had begun to feel light-headed. \"It 'pears that somebody's gonna find out first hand what them aliens look like.\"\n \n It was the wrong thing to say and he knew it. \"All right,\" he said quickly, still staring at the clear-sliced wire, \"we'll do what we can. Maybe the colony on Three has room. I'll call Bossio and ask.\"\n \n The colonist had begun to look quite pitifully at the buildings around him and the scurrying people.\n \n \"Aren't there any fleet ships within radio distance?\"\n \n Dylan shook his head. \"The fleet's spread out kind of thin nowadays.\" Because the other was leaning on him he felt a great irritation, but he said, as kindly as he could, \"We'll get 'em all out. One way or another, we won't leave anybody.\"\n \n It was then that Rossel saw the wire. Thickly, he asked what had happened.\n \n Dylan showed him the two clean ends. \"Somebody dug it up, cut it, then buried it again and packed it down real nice.\"\n \n \"The damn fool!\" Rossel exploded.\n \n \"Who?\"\n \n \"Why, one of ... of us, of course. I know nobody ever liked sitting on a live bomb like this, but I never....\"\n \n \"You think one of your people did it?\"\n \n Rossel stared at him. \"Isn't that obvious?\"\n \n \"Why?\"\n \n \"Well, they probably thought it was too dangerous, and silly too, like most government rules. Or maybe one of the kids....\"\n \n \n\n \n It was then that Dylan told him about the wire on Lupus V. Rossel was silent. Involuntarily, he glanced at the sky, then he said shakily,\n\"Maybe an animal?\"\n \n Dylan shook his head. \"No animal did that. Wouldn't have buried it, or found it in the first place. Heck of a coincidence, don't you think? The wire at Lupus was cut just before an alien attack, and now this one is cut too—newly cut.\"\n \n The colonist put one hand to his mouth, his eyes wide and white.\n \n \"So something,\" said Dylan, \"knew enough about this camp to know that a bomb was buried here and also to know why it was here. And that something didn't want the camp destroyed and so came right into the center of the camp, traced the wire, dug it up and cut it. And then walked right out again.\"\n \n \"Listen,\" said Rossel, \"I'd better go ask.\"\n \n He started away but Dylan caught his arm.\n \n \"Tell them to arm,\" he said, \"and try not to scare hell out of them. I'll be with you as soon as I've spliced this wire.\"\n \n Rossel nodded and went off, running. Dylan knelt with the metal in his hands.\n \n He began to feel that, by God, he was getting cold. He realized that he'd better go inside soon, but the wire had to be spliced. That was perhaps the most important thing he could do now, splice the wire.\n \n All right, he asked himself for the thousandth time, who cut it? How? Telepathy? Could they somehow control one of us?\n \n No. If they controlled one, then they could control all, and then there would be no need for an attack. But you don't know, you don't really know.\n \n Were they small? Little animals?\n \n Unlikely. Biology said that really intelligent life required a sizable brain and you would have to expect an alien to be at least as large as a dog. And every form of life on this planet had been screened long before a colony had been allowed in. If any new animals had suddenly shown up, Rossel would certainly know about it.\n \n He would ask Rossel. He would damn sure have to ask Rossel.\n \n He finished splicing the wire and tucked it into the ground. Then he straightened up and, before he went into the radio shack, he pulled out his pistol. He checked it, primed it, and tried to remember the last time he had fired it. He never had—he never had fired a gun.\n \n \n\n \n The snow began falling near noon. There was nothing anybody could do but stand in the silence and watch it come down in a white rushing wall, and watch the trees and the hills drown in the whiteness, until there was nothing on the planet but the buildings and a few warm lights and the snow.\n \n By one o'clock the visibility was down to zero and Dylan decided to try to contact Bossio again and tell him to hurry. But Bossio still didn't answer. Dylan stared long and thoughtfully out the window through the snow at the gray shrouded shapes of bushes and trees which were beginning to become horrifying. It must be that Bossio was still drunk—maybe sleeping it off before making planetfall on Three. Dylan held no grudge. Bossio was a kid and alone. It took a special kind of guts to take a ship out into space alone, when Things could be waiting....\n \n A young girl, pink and lovely in a thick fur jacket, came into the shack and told him breathlessly that her father, Mr. Rush, would like to know if he wanted sentries posted. Dylan hadn't thought about it but he said yes right away, beginning to feel both pleased and irritated at the same time, because now they were coming to him.\n \n He pushed out into the cold and went to find Rossel. With the snow it was bad enough, but if they were still here when the sun went down they wouldn't have a chance. Most of the men were out stripping down their ship and that would take a while. He wondered why Rossel hadn't yet put a call through to Three, asking about room on the ship there. The only answer he could find was that Rossel knew that there was no room, and he wanted to put off the answer as long as possible. And, in a way, you could not blame him.\n \n Rossel was in his cabin with the big, gloomy man—who turned out to be Rush, the one who had asked about sentries. Rush was methodically cleaning an old hunting rifle. Rossel was surprisingly full of hope.\n \n \"Listen, there's a mail ship due in, been due since yesterday. We might get the rest of the folks out on that.\"\n \n Dylan shrugged. \"Don't count on it.\"\n \n \"But they have a contract!\"\n \n The soldier grinned.\n \n The big man, Rush, was paying no attention. Quite suddenly he said:\n\"Who cut that wire, Cap?\"\n \n \n\n \n Dylan swung slowly to look at him. \"As far as I can figure, an alien cut it.\"\n \n Rush shook his head. \"No. Ain't been no aliens near this camp, and no peculiar animals either. We got a planet-wide radar, and ain't no unidentified ships come near, not since we first landed more'n a year ago.\" He lifted the rifle and peered through the bore. \"Uh-uh. One of us did it.\"\n \n The man had been thinking. And he knew the planet.\n \n \"Telepathy?\" asked Dylan.\n \n \"Might be.\"\n \n \"Can't see it. You people live too close, you'd notice right away if one of you wasn't ... himself. And, if they've got one, why not all?\"\n \n Rush calmly—at least outwardly calmly—lit his pipe. There was a strength in this man that Dylan had missed before.\n \n \"Don't know,\" he said gruffly. \"But these are aliens, mister. And until I know different I'm keepin' an eye on my neighbor.\"\n \n He gave Rossel a sour look and Rossel stared back, uncomprehending.\n \n Then Rossel jumped. \"My God!\"\n \n Dylan moved to quiet him. \"Look, is there any animal at all that ever comes near here that's as large as a dog?\"\n \n After a pause, Rush answered. \"Yep, there's one. The viggle. It's like a reg'lar monkey but with four legs. Biology cleared 'em before we landed. We shoot one now and then when they get pesky.\" He rose slowly, the rifle held under his arm. \"I b'lieve we might just as well go post them sentries.\"\n \n Dylan wanted to go on with this but there was nothing much else to say. Rossel went with them as far as the radio shack, with a strained expression on his face, to put through that call to Three.\n \n When he was gone Rush asked Dylan, \"Where you want them sentries? I got Walt Halloran and Web Eggers and six others lined up.\"\n \n Dylan stopped and looked around grimly at the circling wall of snow.\n\"You know the site better than I do. Post 'em in a ring, on rises, within calling distance. Have 'em check with each other every five minutes. I'll go help your people at the ship.\"\n \n The gloomy man nodded and fluffed up his collar. \"Nice day for huntin',\" he said, and then he was gone with the snow quickly covering his footprints.\n \n \n\n \n The Alien lay wrapped in a thick electric cocoon, buried in a wide warm room beneath the base of a tree. The tree served him as antennae; curiously he gazed into a small view-screen and watched the humans come. He saw them fan out, eight of them, and sink down in the snow. He saw that they were armed.\n \n \n\n \n He pulsed thoughtfully, extending a part of himself to absorb a spiced lizard. Since the morning, when the new ship had come, he had been watching steadily, and now it was apparent that the humans were aware of their danger. Undoubtedly they were preparing to leave.\n \n That was unfortunate. The attack was not scheduled until late that night and he could not, of course, press the assault by day. But flexibility , he reminded himself sternly, is the first principle of absorption , and therefore he moved to alter his plans. A projection reached out to dial several knobs on a large box before him, and the hour of assault was moved forward to dusk. A glance at the chronometer told him that it was already well into the night on Planet Three, and that the attack there had probably begun.\n \n The Alien felt the first tenuous pulsing of anticipation. He lay quietly, watching the small square lights of windows against the snow, thanking the Unexplainable that matters had been so devised that he would not have to venture out into that miserable cold.\n \n Presently an alarming thought struck him. These humans moved with uncommon speed for intelligent creatures. Even without devices, it was distinctly possible that they could be gone before nightfall. He could take no chance, of course. He spun more dials and pressed a single button, and lay back again comfortably, warmly, to watch the disabling of the colonists' ship.\n \n \n\n \n When Three did not answer, Rossel was nervously gazing at the snow, thinking of other things, and he called again. Several moments later the realization of what was happening struck him like a blow. Three had never once failed to answer. All they had to do when they heard the signal buzz was go into the radio shack and say hello. That was all they had to do. He called again and again, but nobody answered. There was no static and no interference and he didn't hear a thing. He checked frenziedly through his own apparatus and tried again, but the air was as dead as deep space. He raced out to tell Dylan.\n \n Dylan accepted it. He had known none of the people on Three and what he felt now was a much greater urgency to be out of here. He said hopeful things to Rossel, and then went out to the ship and joined the men in lightening her. About the ship at least, he knew something and he was able to tell them what partitions and frames could go and what would have to stay or the ship would never get off the planet. But even stripped down, it couldn't take them all. When he knew that, he realized that he himself would have to stay here, for it was only then that he thought of Bossio.\n \n Three was dead. Bossio had gone down there some time ago and, if Three was dead and Bossio had not called, then the fact was that Bossio was gone too. For a long, long moment Dylan stood rooted in the snow. More than the fact that he would have to stay here was the unspoken, unalterable, heart-numbing knowledge that Bossio was dead—the one thing that Dylan could not accept. Bossio was the only friend he had. In all this dog-eared, aimless, ape-run Universe Bossio was all his friendship and his trust.\n \n He left the ship blindly and went back to the settlement. Now the people were quiet and really frightened, and some of the women were beginning to cry. He noticed now that they had begun to look at him with hope as he passed, and in his own grief, humanly, he swore.\n \n Bossio—a big-grinning kid with no parents, no enemies, no grudges—Bossio was already dead because he had come out here and tried to help these people. People who had kicked or ignored him all the days of his life. And, in a short while, Dylan would also stay behind and die to save the life of somebody he never knew and who, twenty-four hours earlier, would have been ashamed to be found in his company. Now, when it was far, far too late, they were coming to the army for help.\n \n \n\n \n But in the end, damn it, he could not hate these people. All they had ever wanted was peace, and even though they had never understood that the Universe is unknowable and that you must always have big shoulders, still they had always sought only for peace. If peace leads to no conflict at all and then decay, well, that was something that had to be learned. So he could not hate these people.\n \n But he could not help them either. He turned from their eyes and went into the radio shack. It had begun to dawn on the women that they might be leaving without their husbands or sons, and he did not want to see the fierce struggle that he was sure would take place. He sat alone and tried, for the last time, to call Bossio.\n \n After a while, an old woman found him and offered him coffee. It was a very decent thing to do, to think of him at a time like this, and he was so suddenly grateful he could only nod. The woman said that he must be cold in that thin army thing and that she had brought along a mackinaw for him. She poured the coffee and left him alone.\n \n They were thinking of him now, he knew, because they were thinking of everyone who had to stay. Throw the dog a bone. Dammit, don't be like that, he told himself. He had not had anything to eat all day and the coffee was warm and strong. He decided he might be of some help at the ship.\n \n It was stripped down now and they were loading. He was startled to see a great group of them standing in the snow, removing their clothes. Then he understood. The clothes of forty people would change the weight by enough to get a few more aboard. There was no fighting. Some of the women were almost hysterical and a few had refused to go and were still in their cabins, but the process was orderly. Children went automatically, as did the youngest husbands and all the women. The elders were shuffling around in the snow, waving their arms to keep themselves warm. Some of them were laughing to keep their spirits up.\n \n In the end, the ship took forty-six people.\n \n Rossel was one of the ones that would not be going. Dylan saw him standing by the airlock holding his wife in his arms, his face buried in her soft brown hair. A sense of great sympathy, totally unexpected, rose up in Dylan, and a little of the lostness of thirty years went slipping away. These were his people. It was a thing he had never understood before, because he had never once been among men in great trouble. He waited and watched, learning, trying to digest this while there was still time. Then the semi-naked colonists were inside and the airlock closed. But when the ship tried to lift, there was a sharp burning smell—she couldn't get off the ground.",
      "metadata": {
        "title": "Soldier Boy",
        "author": "Michael Shaara",
        "passage_id": "50848",
        "uid": "9e6b7aaf090149168bee224dba7c3b46",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "2",
                "uid": "65c001ad2bd242a586879ed7718cff4f",
                "response_text": "An army ship lands near a settlement, and people look out their windows, grumbling about its presence because they want no contact with the army. A soldier disembarks and stands at attention facing the settlement, and the people assume he must be proud, ornery, or drunk. Eventually, a resident named Bob Rossel goes out to see what the soldier wants. The soldier identifies himself as Captain Dylan, explaining that he has a message from Fleet Headquarters for the person in charge. Rossel takes the envelope since they don’t have anyone in charge. A young man inside the ship tosses Dylan a bottle, asks if he can leave, and tells him he’ll be back that night. Rossel is appalled that the younger soldier appears drunk and throws Dylan a bottle of liquor. Dylan tells Rossel to read the message because they don’t have much time and starts walking toward the settlement as the ship takes off.\n\tMan’s first contact with aliens had occurred at the Lupus V Colony in 2360, which aliens destroyed. When the army came to investigate, it found 31 of the 70 colonists dead, with the rest, including women and children, missing. Buildings had burned, and all technical equipment was missing. The security bomb, one of which was planted in each colony to be detonated in such an emergency, had failed to go off—the detonating wire had been dug up where it was buried 12 inches deep and cut. Because there had been 500 years of peace and people were conditioned to be anti-war, the army was small and lacked respect. So the army couldn’t take the time to find out exactly what had happened but just spread the news to other colonies, most of which evacuated before they were attacked.\n\tThe message Dylan delivers is that the aliens are attacking again; this settlement needs to evacuate. A big gloomy man named Rush demands help from the army fleet, but Dylan informs him that the army is too weak to help. Dylan tells them that Lt. Bossio is warning Planet Three and returning that night to pick him up. Everyone must be gone by then. Dylan digs up the detonator wire and finds it has been cut. Rossel tells him their ship will only hold 60 of their 40 colonists and asks Dylan to take the rest on the army ship. Dylan offers to ask Bossio and then shows Rossel the cut wire. They discuss whether a colonist or an animal could have cut it. Dylan splices the wire as Rossel leaves.\n\tMeanwhile, an alien is hiding nearby, watching the humans prepare to leave. He presses a button that disables their ship. Rossel has been trying to reach Planet Three and can’t get an answer; Dylan realizes the colony there is dead, so Bossio is, too. People strip their clothes to reduce their weight and take on more people. Forty-six are able to board. When the ship tries to lift off, it can’t get off the ground.\n\t\n"
              },
              {
                "worker_id": "6",
                "uid": "2a5ef2905270401d9f786810114431cd",
                "response_text": "Captain Dylan arrives on this newly pioneered planet--only 100 years at that point--to tell the colonists there that they were in grave danger. After hundreds of years of peace and a practically obsolete army, an alien life form was attacking. He emerges from his small ship, flown by his best friend Lieutenant Bossio, and waits in the cold. Finally, Bob Rossel meets him and hears his message. Fleet Headquarters sent Captain Dylan to hand off the letter informing them that Lupus V had been massacred. In 2360, 31 of the 70 colonists died, while the rest were captured. All of their belongings were taken too, and that which remained was burned. After the army arrived, one soldier discovered that the detonator wire was cut. On each planet, there is a bomb placed in the center. So if any aliens were to attack, the colonists could detonate to prevent human secrets from escaping. Only this time, they couldn’t, because the wire was cut. \nSince then, Captain Dylan had evacuated several cities and colonies. With his bottle of booze, Dylan informs the whole colony about the situation at hand and the need to evacuate. They protest at first and call him “soldier boy,” but after he tells them their sister colony, Planet Three, is also being evacuated, they run to pack their things. They are to leave by nightfall. Dylan digs into the ground in search of the detonator but finds the wire cleanly cut. Rossel returns to ask how many his ship can take, since their ship can only take 40, leaving 20 behind. Dylan knows that his ship can only take 10, so they decide to call Planet Three and ask if they have room. \nThey discuss the cut wire and who or what could have done it. Rossel leaves to ask if any of the colonists cut it and ask them to arm themselves in case of battle. After considering telepathy, Dylan leaves and walks out into the snowfall to try and contact Bossio who had yet to reply. A young woman asks him if he wants sentries posted on behalf of her father, and he follows her back to the group. Mr. Rush, her father, is a strong, wise man, and he tries to uncover who cut the wire. Although there is an animal on this planet, the viggle, it was already cleared. Eight sentries rushed out, and the Alien watched them from inside of the tree. Realizing that the humans knew they were in danger, the Alien changed his plans and disabled their ship. Planet Three was already under attack, so the Alien only had to wait till dusk to absorb.\nPlanet Three did not respond to Rossel’s calls, he knew something was off. Dylan realizes he’ll have to stay behind since Bossio was not coming back. The colonists strip and manage to squeeze an extra six people on the ship, thanks to the lessened weight. Rossel stays behind as well. However, the ship doesn’t take off. \n"
              },
              {
                "worker_id": "10",
                "uid": "440a268299bc48daafc6b5e12d95048e",
                "response_text": "On a distant planet from Earth, Bob Rossel gets out of his warm bed on a cold night to greet a soldier (Captain Dylan) standing in a nearby field after landing his spaceship there. Captain Dylan was there to deliver a message from Fleet Headquarters to the person in charge of the colony of about 60 people, of which Bob claimed there was no one in charge so it might as well be him. The general consensus of the colonists is that peace must be achieved at all costs, and the Fleet army was counterproductive to achieving peace. So, it was quite a stir that a Fleet soldier would show up unexpectedly to deliver a message. The spaceship left with Lieutenant Bossio at the helm, promising to pick the Captain up later.\nThe Captain’s message was that aliens had attacked another colony on Lupus V, killing about half of seventy colonists with the rest missing. All colonies were required to have bombs installed in a central building that would obliterate all the people there should aliens attack them to prevent aliens from gaining any knowledge of human technology or biology. At this colony, the wire from the detonator to the bomb was cut, inexplicably.\nThe Captain quickly hustles the colony on Bob’s planet to evacuate, and they ready a ship that is capable of holding 40 people. It is somber for the 60 people there because not everyone will escape. Only the children, women, and youngest men are going to be loaded. Others in the colony begin pitching in and asking the Captain how to help, like Mr. Rush, who inquires about organizing sentries to post at their perimeter. During all of this, the Captain digs up the underground wire from the detonator to the bomb of this colony and finds it has also been cut very recently and reburied.\nThere is speculation as to who cut this wire, with the Captain thinking it must have been an alien and Bob thinking it must have been a colonist. There is an aside in the story, describing the culprit which is an alien hiding underground amongst the roots of a nearby tree and commanding the alien attack remotely. The alien moves up the attack from nightfall to dusk after seeing how quickly the colonists are mobilizing to escape. \nThe Captain is unable to check in with Lieutenant Bossio, who had gone to planet Three to evacuate the colonists there. It is already nightfall on planet Three, and the alien attack has most likely already killed Bossio. At the close of the story, the colonists have a tear-filled departure loading their ship. The Captain feels kinship with Bob, who is saying goodbye to his wife for the last time as she boards. The people aboard the ship leave their clothes behind to reduce weight - fitting 46 people on a ship that should have only held 40. As the ship doors close and it goes to take off, it is unable to move off the ground.\n"
              },
              {
                "worker_id": "8",
                "uid": "f338403cb8b34e958783b0ab490ff69a",
                "response_text": "Captain Jim Dylan arrives in an army ship at an unnamed colony in the midst of winter to warn the colonists of an impending attack by an alien species. Due to hundreds of years of anti-war conditioning, the army has had little to do and their resources have dwindled, so Dylan has spent the last thirty years of his life doing little else other than drinking, getting into trouble, and studying a little bit about military tactics. The colonists are not pleased with his arrival, and Dylan sends his fellow armyman Lieutenant Bossio to nearby Planet Three to begin the process of clearing their colony as well. A man named Rossel leads Dylan into town, where he relays the story of Lupus V and its decimation by alien attackers to a group of colonists. The aliens had killed half the population of Lupus V with a heat ray and the rest of the colonists had gone missing. Prior to the attack, a wire meant to detonate a bomb buried at the center of the colony in case of alien attack had been dug up and cut inexplicably. As a result, the army had been deployed to travel to each remaining colony to warn them. The colonists demand army protection, but Dylan informs them that the army fleet is too under-resourced and short-staffed to do anything other than warn of the attacks. As Dylan goes to investigate the state of the wire buried in this colony, he recalls joining the army back when people admired soldiers and how over time that admiration morphed into disgust because of anti-war conditioning. When he discovers the wire has also been cut, Dylan goes back to the radio shack. Rossel finds him there and they discuss how many people they can fit between the colonists' ship and the army ship. Because of insufficient space, they have to come up with a plan to fit the rest of the colonists. Meanwhile, Rossel asks about the cut wire, and he wonders if one of his people might have cut it out of spite for the government rules. Dylan wonders if it might be animals, or perhaps the aliens using telepathy. With Bossio still not answering his calls, Dylan meets with Rossel and a colonist named Rush, who provides Dylan with sentries and agrees with his theory that aliens are responsible for the cut wires. Meanwhile, an alien observes the action from a control center located underground; this is where he uses a box to schedule the attack on the village and disable the colonists' ship. When Planet Three doesn’t answer, Dylan realizes Bossio must be dead. He returns to the radio shack alone, but an old woman brings him coffee and a mackinaw to keep him warm. This encourages him to go outside to help with the evacuation. When Dylan sees Rossel saying goodbye to his wife, he feels human connection again. Then he sees that the colonists' ship cannot fly."
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "2",
                "uid": "65c001ad2bd242a586879ed7718cff4f",
                "response_text": "The story takes place on an unnamed planet some time after an alien attack in the year 2360. Colonists settled the planet and have built a village consisting of several houses and a radio shack. Presumably, this is where the colonists contact other colonies. It is also where the detonator for the security bomb is located, with the wire buried under 12 inches of dirt. The atmosphere is Earth-like. There are thick clouds overnight, and the morning is misty and cold. The breeze carries the smell of snow, and later in the day, the snow arrives. The planet is suitable for agriculture because the colonists have already harvested their warmer weather crops and planted their winter crops. The colonists have advanced technology because they have machines that plant and harvest and automatically run their factories. The temperature is below freezing, so people are staying in their houses and drinking coffee. A sister planet colony on Planet Three is much like this colony. The two colonies maintain contact via radios, and mailships make regular runs between the settlements on the different planets. Every settlement is equipped with a security bomb to be detonated in the event of an alien attack. The purpose of discharging the bomb is to prevent hostile aliens from learning important information about humans, including their technology and body chemistry.\n\nAnother setting mentioned in the story is the Lupus V colony attacked by aliens late in the year 2360. Lupus V had 70 registered colonists, including men, women, and children. It also had technical equipment, radios, guns, machines, and books. When the army arrived after the alien attack, everything had been taken, along with 39 women and children; 31 people died in the attack or the subsequent fire that the aliens set with their heat ray. The security bomb had not been detonated because the wire to it had been cut, even though it was buried 12 inches under the soil.\n"
              },
              {
                "worker_id": "6",
                "uid": "2a5ef2905270401d9f786810114431cd",
                "response_text": "Soldier Boy by Michael Straaha takes place on a very cold and icy planet. Captain Dylan waited in the cold for a long time before Rossel arrived, forcing tears to his eyes. The colonists of this planet are reluctant to leave their beds and have especially thick and warm clothing designed for the cold. The planet was colonized less than a century ago by these pioneers. This process involves setting up plastic houses, sending machines out to the fields to plant crops and fertilize the soil, and factories to transform dirt into coffee. \nAs far as we know, there is only one other alien on this planet: the viggle. This creature is fairly similar to an Earth monkey. With four legs and a slightly mischievous personality, they mostly stay out of the way of the colonists. There are also lizards and trees, showcased by the fact that the Alien is living in the hollow of one. \n"
              },
              {
                "worker_id": "10",
                "uid": "440a268299bc48daafc6b5e12d95048e",
                "response_text": "Late in the year 2360, humans have expanded from Earth to colonizing other planets. The colonists are considered pioneers that inflate plastic houses on arrival that harden up. Then they release machines to plant and harvest, and use technology to transmute dirt into coffee (coffee being an important motif in the story for the comfort of home). \nThe unnamed planet that Captain Dylan lands on is in wintertime, bitterly cold, with snow falling often in the story and piling up high enough to cover footprints. The colonists stay inside for the winter, and so his arrival is startling as he stands in a cold field. Captain Dylan is invited into the homes of the colonists as they prepare to evacuate and also digs near the central bomb in the colony to find the cut wire that disabled the security system that would obliterate the colony upon alien attack to preserve human secrets. There is a small ridge around the colony that sentinels can be posted on.\nThe colonists have a “seed of peace” deeply planted in them and have been taught to hate war and despise soldiers. Because of this, there is little support for the army and their numbers have dwindled to the point where they can’t fight off alien attacks. Ironically, the people in this colony are desperate for the Fleet to intervene to save them, but the Captain delivers the news that there is no Fleet to do so.\n"
              },
              {
                "worker_id": "8",
                "uid": "f338403cb8b34e958783b0ab490ff69a",
                "response_text": "The story begins at the start of winter following the planting of the winter crops as an icy breeze blows in, smelling of snow. There is a village where the colonists live and a nearby field where the army ship lands. Bushes, trees, and hills can be seen through the snow. Thick clouds gather in the north at night, and in the morning, it is misty and cold. The colony is home to sixty colonists, and they have a sister colony called Planet Three. They have one ship with one deck that can fit forty people and a radio shack used to communicate with other colonies, specifically Planet Three. The colonists sometimes kill a local animal called a viggle for being pesky; a viggle looks like a monkey with four legs. Every colony has been equipped with a bomb buried at the city center that can be triggered by detonation device with a wire attached to it. The alien that has cut this wire makes its control center in a wide, warm room under the base of a tree, where he lies wrapped in a thick, electric cocoon. He has a large box with several knobs with which he controls the timing of the assault on the village and disables the colonists' ship. He also has a chronometer he uses to check the time."
              }
            ]
          },
          {
            "question_text": "Who is Captain Dylan, and what happens to him?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "2",
                "uid": "65c001ad2bd242a586879ed7718cff4f",
                "response_text": "Captain Dylan is in the Fleet army and travels with Lieutenant Bossio to colonies on different planets with the message that an alien attack is imminent and the colonists must evacuate. He has become a drunk, which is not uncommon in the army because soldiers were outcasts. For the past three weeks, he and Bossio have been evacuating colonies—the current one is their fifth and last. Prior to this mission, he has spent the last 30 years hanging around, getting drunk, and waiting for something to happen. He was made a captain just before this mission. Looking back, he finds it humorous that he used to study military tactics as if he would need to know them. After his father died of a hernia that he developed from working too long on a heavy planet, he joined the army. Dylan was lured by the army’s recruiting advertisements calling itself guardians of the frontier. When he enlisted, anti-war conditioning wasn’t as strong as it is now, so people weren’t as resentful and disrespectful of soldiers then. Dylan feels that along the way, after all the time he spent in bars and jails, he lost his core. He also believes it doesn’t matter whether he makes it back home: he has no connections and doesn’t owe anybody anything. Drinking has become a way of life, and while he digs for the wire to the bomb, he takes a drink, but after he finds the wire has been cut, he reaches for his bottle but for the first time in a long time, stops before taking a drink. \nWhen the colonists start looking to him for help and answers, Dylan is somewhat pleased because now they are showing him respect, but he is annoyed, too, since it is only because they are scared and need help. When Dylan learns that Planet Three hasn’t answered any radio calls, he connects that to the fact he hasn’t been able to reach Bossio and concludes that the colonists and Bossio are dead. He knows this means he will have to stay behind on the planet when the colonists leave, but that doesn’t bother him. What does bother him is that Bossio is dead only because they had come to help these people—people who wanted nothing to do with them until their lives were threatened. Bossio was his best friend, and Dylan mourns his loss. Even though Dylan resents the people for their disregard for him and the army, he has sympathy for them. He doesn’t want to watch their pain when the women have to leave their men behind, and he is touched when an old woman offers him coffee and a mackinaw to help him stay warm. As he watches Rossel and other men saying goodbye to their wives and children, Dylan begins losing the shell the last 30 years had created around him and begins to feel that these people are his people.\n"
              },
              {
                "worker_id": "6",
                "uid": "2a5ef2905270401d9f786810114431cd",
                "response_text": "Captain Dylan is a member of the Earth’s army, presumably reporting back to Fleet Headquarters. His father died of a hernia when he was only 19 years old after years of hard work and grueling labor. This sudden absence left Dylan feeling alone in the world, so he happily signed on when the army came to town, speaking of frontiers to discover and great adventures to be had. However, with an anti-war sentiment spreading across the colonies, there was no real army to join. Their fleets were small and fairly untrained or, at least ill-prepared for war. When Captain Dylan finally got word of an alien attack, he feared that the anti-war thinking would hinder their ability to fight back. \nHe arrives on this cold planet to inform the colonists that they need to evacuate. Since Lupus V, he’s been to several cities and colonies over a few weeks and evacuated them all. Lietenant Bossio, his best friend, dropped him off before flying to Planet Three to evacuate the colony there too. He is dependent on alcohol both for warmth and to get him through. He is met with contempt and hostility, but he perseveres and convinces them of the danger. \nHe drinks to fight off the cold and digs beneath the ground to check the bomb. He discovers that the wire has been cut, like on Lupus V. He ponders telepathy, but is interrupted by Rossel who reveals that they don’t have enough room on their ship for all 60 inhabitants. \nDylan is a little cranky, but tries his best to problemsolve. Slowly they reach a compromise and Dylan buzzes Bossio to see when he’s coming back from Planet Three. He doesn’t hear back. Dylan eventually realizes that Bossio is not coming back, so he will be stuck on this planet while the aliens attack. \nThe story ends with Dylan watching as 46 members of the colony squeeze onto the spaceship, while he resigns himself to his doom. The rocket doesn’t start, and all are left behind. \n"
              },
              {
                "worker_id": "10",
                "uid": "440a268299bc48daafc6b5e12d95048e",
                "response_text": "Captain Dylan spent 30 years in the West end of space on the “outer edges of Mankind” doing patrols as a peacetime officer before finally being made a Captain. He has never fired a gun. He developed a habit of drinking alcohol, and often in the story drinks from a bottle on his hip to cope with hard news.\nHe and his Lieutenant, Bossio, were summoned out of a bar with the news of the alien attack on Lupus V and charged with clearing the colonies in danger. They cleared four colonies in three weeks, and this planet was due to be the last. \nAfter landing on the planet, he is initially met with some skepticism by the colonists, who then quickly shift into high gear to follow his instructions to evacuate. He goes about digging up the wire to the safety detonation system in the colony to check it is functioning, but it has recently been cut. He thinks it was an alien, and he turns out to be right. There is a nearby alien hiding under a tree orchestrating the attack that is never discovered by the humans.\nThe Captain sees through helping the colonists to load their ship with 46 people to escape, but on take off it is not able to lift off the ground.\n"
              },
              {
                "worker_id": "8",
                "uid": "f338403cb8b34e958783b0ab490ff69a",
                "response_text": "Captain Jim Dylan is a tall, frail-looking army man with pale blue eyes whose appearance is not too neat. He salutes Rossel sloppily when they first meet and delivers an envelope with a message from Fleet Headquarters. After delivering the message, his ship leaves, and Rossel accompanies Dylan back to the village. When Dylan was 19, his father died of a hernia, and he joined the army; those were the days prior to the anti-war conditioning, and people viewed soldiers as \"guardians of the frontier.\" In the ensuing years of boozing, being imprisoned, receiving anti-army insults, and endlessly waiting for something to happen, Dylan had lost the thrill of action and had lost touch with himself. Prior to his deployment with Bossio to clear the colonies, the army had finally made him a captain; even that achievement feels empty to him. Dylan has mostly been drinking for the past thirty years thanks to the army's inaction and the fact that they were universally disrespected and hated by most colonists. However, he had also spent some of that time studying military tactics. Still, he realizes he has never fired a gun. Dylan halfheartedly engages with the colonists when he first arrives to warn them of the impending alien attack. But he slowly warms up to them as he realizes that they actually need his help, and he can offer them that help. He theorizes that the cut wire is the result of telepathic interference by the aliens as they preempt their attack. He works with Rossel to devise an evacuation plan, and Rush provides Dylan with sentries. Dylan is devastated when he learns of Bossio's death. Bossio had been his only friend. In spite of the fact that Bossio had died for people who hated him, Dylan finds he cannot hate the colonists. They simply don't understand that no conflict leads to decay. At the same time, he realizes he cannot truly help them either, so he retreats back to the radio shack.  After an old woman brings him a mackinaw and coffee, Dylan realizes he should help after all. When he sees people removing their clothes to allow more people on board, and he witnesses Rossel tearily saying goodbye to his wife, Dylan feels a human connection he had lost in those thirty years of aimlessness."
              }
            ]
          },
          {
            "question_text": "What is the significance of the army in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "2",
                "uid": "65c001ad2bd242a586879ed7718cff4f",
                "response_text": "The army has no respect from the colonists; they don’t want anything to do with it because they associate it with war. The people at this time have been conditioned to despise war and anything to do with it. When they see Captain Dylan standing by his ship and facing the village, they think he is ridiculous or possibly drunk. Rossel noticed that Dylan appeared like a typical soldier: not very neat and not very clean, and his salute lacked proper military precision. And when Lt. Bossio tosses Dylan a bottle of liquor, Rossel isn’t surprised because of the reputation soldiers have for being drunks; in fact, Rossel is disgusted by the liquor and Bossio’s drunkenness. When aliens attacked Lupus V in 2360, the army found the destruction and dead and discovered why their security bomb hadn’t detonated. There was little the army could do about the alien attack because the army had become so small and weak. There had been peace for 500 years when people didn’t need the army, so its equipment was old, and many of the soldiers were from the bottom of society: drinkers and gamblers. So the army is just notifying other colonies of the attack and warning them to evacuate. When the colonists learn that they have to evacuate due to the threat of an alien attack, Rossel demands that the fleet defend them, and another man named Rush asks where the army fleet is, expecting it to come to their defense. When Dylan explains there is no fleet, just a few hundred obsolete ships, he is tempted to tell them that no one wants an army until it is needed. Dylan himself has been in the army for 30 years and has never seen any action. And when Rossel realizes the colony’s ship won’t hold all of the colonists, he asks if any fleet ships are within radio distance that they could summon to help with their evacuation, hoping that the army is near enough to be of help. Ironically, the army that they despise now offers their only hope.  "
              },
              {
                "worker_id": "6",
                "uid": "2a5ef2905270401d9f786810114431cd",
                "response_text": "After 500 years of peace, few saw the reason for maintaing or keeping an army intact. With anti-war and peace sentiments running abound, those that served were looked down upon, since they were paying for their seemingly worthless service. However, when the aliens attack, suddenly the long-forgotten fleets were called into action, and the drunken soldiers were called to arms. After the years of inactivity and depleted funding, the army is not what it once was and is having trouble containing the alien threat. \nThe army is both the saviour and ultimate enemy in this story, as they could offer protection, but simply don’t have the means to do so. \n"
              },
              {
                "worker_id": "10",
                "uid": "440a268299bc48daafc6b5e12d95048e",
                "response_text": "The army is significantly smaller than it once was due to humans having a loathing of war and thus, reducing the size of the Fleet over time. Humans have had 500 years of peace and anti-war conditioning, that have led to the army becoming “small, weak and without respect.” The army could do nothing but warn colonists of attack.\nIronically, the colonists question Captain Dylan why the Fleet isn’t coming to their rescue, to which he describes the Fleet barely exists and now only has a “few hundred half-shot old tubs that were obsolete before you were born.” In this way, the army is significant in the story because it is not wanted by many, but it comes to be called on for help anyways in their time of need.\nCaptain Dylan has worked for thirty years as a peacetime soldier and thinks to himself that peace-loving nations in the history of Earth never stay strong, but does not go on to labor the point to the colonists. He feels deeply sad that his only friend, Bossio, was already dead from trying to help these people that didn’t support the army, and that he too would soon have the same fate. Captain Dylan shakes off this mentality and in the end feels that he can’t hate the colonists for wanting peace because it is a noble thing for trying to achieve.\n"
              },
              {
                "worker_id": "8",
                "uid": "f338403cb8b34e958783b0ab490ff69a",
                "response_text": "The people of the village have been taught over the years to hate war, and as a result, they also hate soldiers. They suspect every soldier they meet is a drunk, which Captain Dylan appears to confirm when he catches a bottle tossed to him by an associate upon first arriving at the village. Later, Dylan recalls the thirty years of his army career, which has largely been spent drinking and getting into trouble. Due to hundreds of years of anti-war conditioning, the army is under-resourced, understaffed, and underfunded. In fact, there are only a few hundred ships left that are mostly obsolete and a handful of army leadership and government jobs available. However, when the aliens attack, the army deploys Dylan and Bossio to help warn and evacuate as many colonies as possible, which they do to little fanfare. In fact, Bossio dies in the effort, and it appears that Dylan might as well."
              }
            ]
          },
          {
            "question_text": "What is the significance of the cut wire?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "2",
                "uid": "65c001ad2bd242a586879ed7718cff4f",
                "response_text": "When the army investigates the destruction of Lupus V, it discovers that the wire to the bomb that would blow up the community had been cut. The wire was hidden 12 inches under the ground, so it would not have been easy to find. Since the wire was cut, the bomb didn’t explode, enabling the aliens to take the women and children, along with all the technology, from the planet. The purpose of the bomb was to prevent the aliens from gaining knowledge of human technology and body chemistry; presumably, aliens would be able to use this information against humans in the future. Because Dylan knows of the cut wire on Lupus V, he checks the wire for the bomb on the planet he has come to evacuate. When he discovers the wire is cut here, too, he notes that the ends are clean, so someone made the cut recently. The ground over the wire was packed down, so whoever cut it also wanted to hide that it had been tampered with. Rossel assumes one of the colonists must have cut the wire, possibly thinking it was dangerous for the colonists and just a silly government rule. After Dylan tells him about the wire being cut on Lupus V, Rossel plans to question everyone. Dylan wonders if the aliens could have cut it by telepathy of one of the colonists but rules that out because if they could control one human, they could control all of them. Dylan then wonders if an alien has done it. No one knows what the aliens look like, but for them to have intelligence, they would need a large brain, making the alien about the size of a large dog. Dylan knows all the animals on the planet had been vetted before the colony was settled. When he tells the others his suspicion, Rush says the only animal they’ve seen nearby is a viggle, which is something like a monkey with four legs. The viggle passed Biology’s screening, so the viggle is ruled out. Although Dylan doesn’t discover the alien hidden in its electric cocoon, he is convinced that aliens cut the wire. He is also convinced that the alien attack is imminent.\n"
              },
              {
                "worker_id": "6",
                "uid": "2a5ef2905270401d9f786810114431cd",
                "response_text": "After the 70 colonists on Lupus V were either captured or killed, the soldiers discovered a cut wire leading to the detonator. The bombs were placed to protect human secrets, chemistry, and biology from prying alien hands. The fact that someone or something knew about the bomb and knew how to preven it from detonating suggests that the aliens are more intelligent about human life than everyone previously thought. \nWhen Captain Dylan finds the cut wire on the ice-cold colony, he realizes that they need to evacuate as quickly as possible, since this is the sign that the aliens are already here. \n"
              },
              {
                "worker_id": "10",
                "uid": "440a268299bc48daafc6b5e12d95048e",
                "response_text": "The wire being discussed is one which connects a detonator to a bomb mandated to be a the center of each human colony for security purposes. The bomb is intended to destroy the entire colony and all the people in it upon alien attach so that the aliens don’t learn about human technology and body chemistry.\nThe bomb on Lupus V, the first colony to be attacked, did not blow because the wire had been cut. Thus, the alien attack captured many of the humans there, potentially giving them access to their technology and biology that humans had been trying to keep secure. Similarly, the wire had been cut on the planet that Captain Dylan landed on to evacuate in the story, which he discovered by digging down to it almost a foot underground. The reader learns there is an alien hiding underground nearby controlling the attack that may have been capable of cutting the wire through something like telepathy. The significance that two wires were cut in the same way suggests that the aliens are mounting a concerted attack on many human colonies and disabling their detonators in order to gain advantages over humans by learning their secrets.\n"
              },
              {
                "worker_id": "8",
                "uid": "f338403cb8b34e958783b0ab490ff69a",
                "response_text": "Each colony had a bomb buried in the center, which would be detonated in the event of an alien attack in order to prevent them from learning important facts about human technology and body chemistry. When the aliens attacked and destroyed Lupus V in 2360, the army investigated the remnants of the colony there; they discovered the wire that was hidden under a foot of earth and was intended to trigger the detonation had been dug up and cut, thereby preventing detonation. Dylan discovers a similar situation when he arrives at the unnamed colony of the story. When he finds the cut wire, Rossel believes it is one of the colonists lashing out against a government they do not respect. When Rush sees the wire, he agrees with Dylan that it must be some kind of telepathic alien intervention. In fact, an alien had cut the wire, presumably by deploying a box that allowed it to perform actions remotely from a subterranean control center. The cut wire provides the warning the colonists need in order to have time to evacuate before the alien attack."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5224,
        "document_length_chars": 28635
      }
    }
  ]
}