{
  "item_metadata": {
    "item_id": "50847",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "50847",
      "content": "Tea Tray in the Sky\n \n \n By EVELYN E. SMITH\n \n Illustrated by ASHMAN\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction September 1952. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n Visiting a society is tougher than being born into it. A 40 credit tour is no substitute!\n \n\n \n The picture changed on the illuminated panel that filled the forward end of the shelf on which Michael lay. A haggard blonde woman sprawled apathetically in a chair.\n \n \"Rundown, nervous, hypertensive?\" inquired a mellifluous voice. \"In need of mental therapy? Buy Grugis juice; it's not expensive. And they swear by it on Meropé.\"\n \n A disembodied pair of hands administered a spoonful of Grugis juice to the woman, whereupon her hair turned bright yellow, makeup bloomed on her face, her clothes grew briefer, and she burst into a fast Callistan clog.\n \n \"I see from your hair that you have been a member of one of the Brotherhoods,\" the passenger lying next to Michael on the shelf remarked inquisitively. He was a middle-aged man, his dust-brown hair thinning on top, his small blue eyes glittering preternaturally from the lenses fitted over his eyeballs.\n \n Michael rubbed his fingers ruefully over the blond stubble on his scalp and wished he had waited until his tonsure were fully grown before he had ventured out into the world. But he had been so impatient to leave the Lodge, so impatient to exchange the flowing robes of the Brotherhood for the close-fitting breeches and tunic of the outer world that had seemed so glamorous and now proved so itchy.\n \n \"Yes,\" he replied courteously, for he knew the first rule of universal behavior, \"I have been a Brother.\"\n \n \"Now why would a good-looking young fellow like you want to join a Brotherhood?\" his shelf companion wanted to know. \"Trouble over a female?\"\n \n Michael shook his head, smiling. \"No, I have been a member of the Angeleno Brotherhood since I was an infant. My father brought me when he entered.\"\n \n The other man clucked sympathetically. \"No doubt he was grieved over the death of your mother.\"\n \n Michael closed his eyes to shut out the sight of a baby protruding its fat face at him three-dimensionally, but he could not shut out its lisping voice: \"Does your child refuse its food, grow wizened like a monkey? It will grow plump with oh-so-good Mealy Mush from Nunki.\"\n \n \"No, sir,\" Michael replied. \"Father said that was one of the few blessings that brightened an otherwise benighted life.\"\n \n Horror contorted his fellow traveller's plump features. \"Be careful, young man!\" he warned. \"Lucky for you that you are talking to someone as broad-minded as I, but others aren't. You might be reported for violating a tabu. An Earth tabu, moreover.\"\n \n \"An Earth tabu?\"\n \n \"Certainly. Motherhood is sacred here on Earth and so, of course, in the entire United Universe. You should have known that.\"\n \n \n\n \n Michael blushed. He should indeed. For a year prior to his leaving the Lodge, he had carefully studied the customs and tabus of the Universe so that he should be able to enter the new life he planned for himself, with confidence and ease. Under the system of universal kinship, all the customs and all the tabus of all the planets were the law on all the other planets. For the Wise Ones had decided many years before that wars arose from not understanding one's fellows, not sympathizing with them. If every nation, every planet, every solar system had the same laws, customs, and habits, they reasoned, there would be no differences, and hence no wars.\n \n Future events had proved them to be correct. For five hundred years there had been no war in the United Universe, and there was peace and plenty for all. Only one crime was recognized throughout the solar systems—injuring a fellow-creature by word or deed (and the telepaths of Aldebaran were still trying to add thought to the statute).\n \n Why, then, Michael had questioned the Father Superior, was there any reason for the Lodge's existence, any reason for a group of humans to retire from the world and live in the simple ways of their primitive forefathers? When there had been war, injustice, tyranny, there had, perhaps, been an understandable emotional reason for fleeing the world. But now why refuse to face a desirable reality? Why turn one's face upon the present and deliberately go back to the life of the past—the high collars, vests and trousers, the inefficient coal furnaces, the rude gasoline tractors of medieval days?\n \n The Father Superior had smiled. \"You are not yet a fully fledged Brother, Michael. You cannot enter your novitiate until you've achieved your majority, and you won't be thirty for another five years. Why don't you spend some time outside and see how you like it?\"\n \n Michael had agreed, but before leaving he had spent months studying the ways of the United Universe. He had skimmed over Earth, because he had been so sure he'd know its ways instinctively. Remembering his preparations, he was astonished by his smug self-confidence.\n \n \n\n \n A large scarlet pencil jumped merrily across the advideo screen. The face on the eraser opened its mouth and sang: \"Our pencils are finest from point up to rubber, for the lead is from Yed, while the wood comes from Dschubba.\"\n \n \n\n \n \"Is there any way of turning that thing off?\" Michael wanted to know.\n \n The other man smiled. \"If there were, my boy, do you think anybody would watch it? Furthermore, turning it off would violate the spirit of free enterprise. We wouldn't want that, would we?\"\n \n \"Oh, no!\" Michael agreed hastily. \"Certainly not.\"\n \n \"And it might hurt the advertiser's feelings, cause him ego injury.\"\n \n \"How could I ever have had such a ridiculous idea?\" Michael murmured, abashed.\n \n \"Allow me to introduce myself,\" said his companion. \"My name is Pierce B. Carpenter. Aphrodisiacs are my line. Here's my card.\" He handed Michael a transparent tab with the photograph of Mr. Carpenter suspended inside, together with his registration number, his name, his address, and the Universal seal of approval. Clearly he was a character of the utmost respectability.\n \n \"My name's Michael Frey,\" the young man responded, smiling awkwardly.\n\"I'm afraid I don't have any cards.\"\n \n \"Well, you wouldn't have had any use for them where you were. Now, look here, son,\" Carpenter went on in a lowered voice, \"I know you've just come from the Lodge and the mistakes you'll make will be through ignorance rather than deliberate malice. But the police wouldn't understand. You know what the sacred writings say: 'Ignorance of The Law is no excuse.' I'd be glad to give you any little tips I can. For instance, your hands....\"\n \n Michael spread his hands out in front of him. They were perfectly good hands, he thought. \"Is there something wrong with them?\"\n \n Carpenter blushed and looked away. \"Didn't you know that on Electra it is forbidden for anyone to appear in public with his hands bare?\"\n \n \"Of course I know that,\" Michael said impatiently. \"But what's that got to do with me?\"\n \n The salesman was wide-eyed. \"But if it is forbidden on Electra, it becomes automatically prohibited here.\"\n \n \"But Electrans have eight fingers on each hand,\" Michael protested,\n\"with two fingernails on each—all covered with green scales.\"\n \n Carpenter drew himself up as far as it was possible to do so while lying down. \"Do eight fingers make one a lesser Universal?\"\n \n \"Of course not, but—\"\n \n \"Is he inferior to you then because he has sixteen fingernails?\"\n \n \"Certainly not, but—\"\n \n \"Would you like to be called guilty of—\" Carpenter paused before the dreaded word—\" intolerance ?\"\n \n \"No, no, no !\" Michael almost shrieked. It would be horrible for him to be arrested before he even had time to view Portyork. \"I have lots of gloves in my pack,\" he babbled. \"Lots and lots. I'll put some on right away.\"\n \n \n\n \n With nervous haste, he pressed the lever which dropped his pack down from the storage compartment. It landed on his stomach. The device had been invented by one of the Dschubbans who are, as everyone knows, hoop-shaped.\n \n Michael pushed the button marked Gloves A , and a pair of yellow gauntlets slid out.\n \n Carpenter pressed his hands to his eyes. \"Yellow is the color of death on Saturn, and you know how morbid the Saturnians are about passing away! No one ever wears yellow!\"\n \n \"Sorry,\" Michael said humbly. The button marked Gloves B yielded a pair of rose-colored gloves which harmonized ill with his scarlet tunic and turquoise breeches, but he was past caring for esthetic effects.\n \n \"The quality's high,\" sang a quartet of beautiful female humanoids,\n\"but the price is meager. You know when you buy Plummy Fruitcake from Vega.\"\n \n The salesman patted Michael's shoulder. \"You staying a while in Portyork?\" Michael nodded. \"Then you'd better stick close to me for a while until you learn our ways. You can't run around loose by yourself until you've acquired civilized behavior patterns, or you'll get into trouble.\"\n \n \"Thank you, sir,\" Michael said gratefully. \"It's very kind of you.\"\n \n He twisted himself around—it was boiling hot inside the jet bus and his damp clothes were clinging uncomfortably—and struck his head against the bottom of the shelf above. \"Awfully inconvenient arrangement here,\" he commented. \"Wonder why they don't have seats.\"\n \n \"Because this arrangement,\" Carpenter said stiffly, \"is the one that has proved suitable for the greatest number of intelligent life-forms.\"\n \n \"Oh, I see,\" Michael murmured. \"I didn't get a look at the other passengers. Are there many extraterrestrials on the bus?\"\n \n \"Dozens of them. Haven't you heard the Sirians singing?\"\n \n A low moaning noise had been pervading the bus, but Michael had thought it arose from defective jets.\n \n \"Oh, yes!\" he agreed. \"And very beautiful it is, too! But so sad.\"\n \n \"Sirians are always sad,\" the salesman told him. \"Listen.\"\n \n \n\n \n Michael strained his ears past the racket of the advideo. Sure enough, he could make out words: \"Our wings were unfurled in a far distant world, our bodies are pain-racked, delirious. And never, it seems, will we see, save in dreams, the bright purple swamps of our Sirius....\"\n \n Carpenter brushed away a tear. \"Poignant, isn't it?\"\n \n \"Very, very touching,\" Michael agreed. \"Are they sick or something?\"\n \n \"Oh, no; they wouldn't have been permitted on the bus if they were. They're just homesick. Sirians love being homesick. That's why they leave Sirius in such great numbers.\"\n \n \"Fasten your suction disks, please,\" the stewardess, a pretty two-headed Denebian, ordered as she walked up and down the gangway.\n\"We're coming into Portyork. I have an announcement to make to all passengers on behalf of the United Universe. Zosma was admitted into the Union early this morning.\"\n \n All the passengers cheered.\n \n \"Since it is considered immodest on Zosma,\" she continued, \"ever to appear with the heads bare, henceforward it will be tabu to be seen in public without some sort of head-covering.\"\n \n Wild scrabbling sounds indicated that all the passengers were searching their packs for headgear. Michael unearthed a violet cap.\n \n The salesmen unfolded what looked like a medieval opera hat in piercingly bright green.\n \n \n\n \n \"Always got to keep on your toes,\" he whispered to the younger man.\n\"The Universe is expanding every minute.\"\n \n The bus settled softly on the landing field and the passengers flew, floated, crawled, undulated, or walked out. Michael looked around him curiously. The Lodge had contained no extraterrestrials, for such of those as sought seclusion had Brotherhoods on their own planets.\n \n Of course, even in Angeles he had seen other-worlders—humanoids from Vega, scaly Electrans, the wispy ubiquitous Sirians—but nothing to compare with the crowds that surged here. Scarlet Meropians rubbed tentacles with bulging-eyed Talithans; lumpish gray Jovians plodded alongside graceful, spidery Nunkians. And there were countless others whom he had seen pictured in books, but never before in reality.\n \n The gaily colored costumes and bodies of these beings rendered kaleidoscopic a field already brilliant with red-and-green lights and banners. The effect was enhanced by Mr. Carpenter, whose emerald-green cloak was drawn back to reveal a chartreuse tunic and olive-green breeches which had apparently been designed for a taller and somewhat less pudgy man.\n \n \n\n \n Carpenter rubbed modestly gloved hands together. \"I have no immediate business, so supposing I start showing you the sights. What would you like to see first, Mr. Frey? Or would you prefer a nice, restful movid?\"\n \n \"Frankly,\" Michael admitted, \"the first thing I'd like to do is get myself something to eat. I didn't have any breakfast and I'm famished.\" Two small creatures standing close to him giggled nervously and scuttled off on six legs apiece.\n \n \"Shh, not so loud! There are females present.\" Carpenter drew the youth to a secluded corner. \"Don't you know that on Theemim it's frightfully vulgar to as much as speak of eating in public?\"\n \n \"But why?\" Michael demanded in too loud a voice. \"What's wrong with eating in public here on Earth?\"\n \n Carpenter clapped a hand over the young man's mouth. \"Hush,\" he cautioned. \"After all, on Earth there are things we don't do or even mention in public, aren't there?\"\n \n \"Well, yes. But those are different.\"\n \n \"Not at all. Those rules might seem just as ridiculous to a Theemimian. But the Theemimians have accepted our customs just as we have accepted the Theemimians'. How would you like it if a Theemimian violated one of our tabus in public? You must consider the feelings of the Theemimians as equal to your own. Observe the golden rule: 'Do unto extraterrestrials as you would be done by.'\"\n \n \"But I'm still hungry,\" Michael persisted, modulating his voice, however, to a decent whisper. \"Do the proprieties demand that I starve to death, or can I get something to eat somewhere?\"\n \n \"Naturally,\" the salesman whispered back. \"Portyork provides for all bodily needs. Numerous feeding stations are conveniently located throughout the port, and there must be some on the field.\"\n \n After gazing furtively over his shoulder to see that no females were watching, Carpenter approached a large map of the landing field and pressed a button. A tiny red light winked demurely for an instant.\n \n \"That's the nearest one,\" Carpenter explained.\n \n \n\n \n Inside a small, white, functional-looking building unobtrusively marked \"Feeding Station,\" Carpenter showed Michael where to insert a two-credit piece in a slot. A door slid back and admitted Michael into a tiny, austere room, furnished only with a table, a chair, a food compartment, and an advideo. The food consisted of tabloid synthetics and was tasteless. Michael knew that only primitive creatures waste time and energy in growing and preparing natural foods. It was all a matter of getting used to this stuff, he thought glumly, as he tried to chew food that was meant to be gulped.\n \n A ferret-eyed Yeddan appeared on the advideo. \"Do you suffer from gastric disorders? Does your viscera get in your hair? A horrid condition, but swift abolition is yours with Al-Brom from Altair.\"\n \n Michael finished his meal in fifteen minutes and left the compartment to find Carpenter awaiting him in the lobby, impatiently glancing at the luminous time dial embedded in his wrist.\n \n \"Let's go to the Old Town,\" he suggested to Michael. \"It will be of great interest to a student and a newcomer like yourself.\"\n \n A few yards away from the feeding station, the travel agents were lined up in rows, each outside his spaceship, each shouting the advantages of the tour he offered:\n \n \"Better than a mustard plaster is a weekend spent on Castor.\"\n \n \"If you want to show you like her, take her for a week to Spica.\"\n \n \"Movid stars go to Mars.\"\n \n Carpenter smiled politely at them. \"No space trips for us today, gentlemen. We're staying on Terra.\" He guided the bewildered young man through the crowds and to the gates of the field. Outside, a number of surface vehicles were lined up, with the drivers loudly competing for business.\n \n \"Come, take a ride in my rocket car, suited to both gent and lady, lined with luxury hukka fur brought from afar, and perfumed with rare scents from Algedi.\"\n \n \"Whichever movid film you choose to view will be yours in my fine cab from Mizar. Just press a button—it won't cost you nuttin'—see a passionate drama of long-vanished Mu or the bloodhounds pursuing Eliza.\"\n \n \"All honor be laid at the feet of free trade, but, whatever your race or your birth, each passenger curls up with two dancing girls who rides in the taxi from Earth.\"\n \n \"Couldn't we—couldn't we walk? At least part of the way?\" Michael faltered.\n \n Carpenter stared. \"Walk! Don't you know it's forbidden to walk more than two hundred yards in any one direction? Fomalhautians never walk.\"\n \n \"But they have no feet.\"\n \n \"That has nothing whatsoever to do with it.\"\n \n \n\n \n Carpenter gently urged the young man into the Algedian cab ... which reeked. Michael held his nose, but his mentor shook his head. \"No, no! Tpiu Number Five is the most esteemed aroma on Algedi. It would break the driver's heart if he thought you didn't like it. You wouldn't want to be had up for ego injury, would you?\"\n \n \"Of course not,\" Michael whispered weakly.\n \n \"Brunettes are darker and blondes are fairer,\" the advideo informed him, \"when they wash out their hair with shampoos made on Chara.\"\n \n After a time, Michael got more or less used to Tpiu Number Five and was able to take some interest in the passing landscape. Portyork, the biggest spaceport in the United Universe, was, of course, the most cosmopolitan city—cosmopolitan in its architecture as well as its inhabitants. Silver domes of Earth were crowded next to the tall helical edifices of the Venusians.\n \n \"You'll notice that the current medieval revival has even reached architecture,\" Carpenter pointed out. \"See those period houses in the Frank Lloyd Wright and Inigo Jones manner?\"\n \n \"Very quaint,\" Michael commented.\n \n Great floating red and green balls lit the streets, even though it was still daylight, and long scarlet-and-emerald streamers whipped out from the most unlikely places. As Michael opened his mouth to inquire about this, \"We now interrupt the commercials,\" the advideo said, \"to bring you a brand new version of one of the medieval ballads that are becoming so popular....\"\n \n \n\n \n \"I shall scream,\" stated Carpenter, \"if they play Beautiful Blue Deneb just once more.... No, thank the Wise Ones, I've never heard this before.\"\n \n \"Thuban, Thuban, I've been thinking,\" sang a buxom Betelgeusian, \"what a Cosmos this could be, if land masses were transported to replace the wasteful sea.\"\n \n \"I guess the first thing for me to do,\" Michael began in a businesslike manner, \"is to get myself a room at a hotel.... What have I said now?\"\n \n \"The word hotel ,\" Carpenter explained through pursed lips, \"is not used in polite society any more. It has come to have unpleasant connotations. It means—a place of dancing girls. I hardly think....\"\n \n \"Certainly not,\" Michael agreed austerely. \"I merely want a lodging.\"\n \n \"That word is also—well, you see,\" Carpenter told him, \"on Zaniah it is unthinkable to go anywhere without one's family.\"\n \n \"They're a sort of ant, aren't they? The Zaniahans, I mean.\"\n \n \"More like bees. So those creatures who travel—\" Carpenter lowered his voice modestly \"— alone hire a family for the duration of their stay. There are a number of families available, but the better types come rather high. There has been talk of reviving the old-fashioned price controls, but the Wise Ones say this would limit free enterprise as much as—if you'll excuse my use of the expression—tariffs would.\"\n \n \n\n \n The taxi let them off at a square meadow which was filled with transparent plastic domes housing clocks of all varieties, most of the antique type based on the old twenty-four hour day instead of the standard thirty hours. There were few extraterrestrial clocks because most non-humans had time sense, Michael knew, and needed no mechanical devices.\n \n \"This,\" said Carpenter, \"is Times Square. Once it wasn't really square, but it is contrary to Nekkarian custom to do, say, imply, or permit the existence of anything that isn't true, so when Nekkar entered the Union, we had to square off the place. And, of course, install the clocks. Finest clock museum in the Union, I understand.\"\n \n \"The pictures in my history books—\" Michael began.\n \n \"Did I hear you correctly, sir?\" The capes of a bright blue cloak trembled with the indignation of a scarlet, many-tentacled being. \"Did you use the word history ?\" He pronounced it in terms of loathing. \"I have been grossly insulted and I shall be forced to report you to the police, sir.\"\n \n \"Please don't!\" Carpenter begged. \"This youth has just come from one of the Brotherhoods and is not yet accustomed to the ways of our universe. I know that, because of the great sophistication for which your race is noted, you will overlook this little gaucherie on his part.\"\n \n \"Well,\" the red one conceded, \"let it not be said that Meropians are not tolerant. But, be careful, young man,\" he warned Michael. \"There are other beings less sophisticated than we. Guard your tongue, or you might find yourself in trouble.\"\n \n He indicated the stalwart constable who, splendid in gold helmet and gold-spangled pink tights, surveyed the terrain haughtily from his floating platform in the air.\n \n \"I should have told you,\" Carpenter reproached himself as the Meropian swirled off. \"Never mention the word 'history' in front of a Meropian. They rose from barbarism in one generation, and so they haven't any history at all. Naturally, they're sensitive in the extreme about it.\"\n \n \"Naturally,\" Michael said. \"Tell me, Mr. Carpenter, is there some special reason for everything being decorated in red and green? I noticed it along the way and it's all over here, too.\"\n \n \"Why, Christmas is coming, my boy,\" Carpenter answered, surprised.\n\"It's July already—about time they got started fixing things up. Some places are so slack, they haven't even got their Mother's Week shrines cleared away.\"\n \n \n\n \n A bevy of tiny golden-haired, winged creatures circled slowly over Times Square.\n \n \"Izarians,\" Carpenter explained \"They're much in demand for Christmas displays.\"\n \n The small mouths opened and clear soprano voices filled the air: \"It came upon the midnight clear, that glorious song of old, from angels bending near the Earth to tune their harps of gold. Peace on Earth, good will to men, from Heaven's All-Celestial. Peace to the Universe as well and every extraterrestrial.... Beat the drum and clash the cymbals; buy your Christmas gifts at Nimble's.\"\n \n \"This beautiful walk you see before you,\" Carpenter said, waving an expository arm, \"shaded by boogil trees from Dschubba, is called Broadway. To your left you will be delighted to see—\"\n \n \"Listen, could we—\" Michael began.\n \n \"—Forty-second Street, which is now actually the forty-second—\"\n \n \"By the way—\"\n \n \"It is extremely rude and hence illegal,\" Carpenter glared, \"to interrupt anyone who is speaking.\"\n \n \"But I would like,\" Michael whispered very earnestly, \"to get washed. If I might.\"\n \n The other man frowned. \"Let me see. I believe one of the old landmarks was converted into a lavatory. Only thing of suitable dimensions. Anyhow, it was absolutely useless for any other purpose. We have to take a taxi there; it's more than two hundred yards. Custom, you know.\"\n \n \"A taxi? Isn't there one closer?\"\n \n \"Ah, impatient youth! There aren't too many altogether. The installations are extremely expensive.\"\n \n They hailed the nearest taxi, which happened to be one of the variety equipped with dancing girls. Fortunately the ride was brief.\n \n Michael gazed at the Empire State Building with interest. It was in a remarkable state of preservation and looked just like the pictures in his history—in his books, except that none of them showed the huge golden sign \"Public-Washport\" riding on its spire.\n \n \n\n \n Attendants directed traffic from a large circular desk in the lobby.\n\"Mercurians, seventy-eighth floor. A group Vegans, fourteenth floor right. B group, fourteenth floor left. C group, fifteenth floor right. D group, fifteenth floor left. Sirians, forty-ninth floor. Female humans fiftieth floor right, males, fiftieth floor left. Uranians, basement....\"\n \n Carpenter and Michael shared an elevator with a group of sad-eyed, translucent Sirians, who were singing as usual and accompanying themselves on wemps , a cross between a harp and a flute. \"Foreign planets are strange and we're subject to mange. Foreign atmospheres prove deleterious. Only with our mind's eye can we sail through the sky to the bright purple swamps of our Sirius.\"\n \n The cost of the compartment was half that of the feeding station; one credit in the slot unlocked the door. There was an advideo here, too:\n \n \"Friend, do you clean yourself each day? Now, let's not be evasive, for each one has his favored way. Some use an abrasive and some use oil. Some shed their skins, in a brand-new hide emerging. Some rub with grease put up in tins. For others there's deterging. Some lick themselves to take off grime. Some beat it off with rope. Some cook it away in boiling lime. Old-fashioned ones use soap. More ways there are than I recall, and each of these will differ, but the only one that works for all is Omniclene from Kiffa.\"\n \n \n\n \n \"And now,\" smiled Carpenter as the two humans left the building, \"we must see you registered for a nice family. Nothing too ostentatious, but, on the other hand, you mustn't count credits and ally yourself beneath your station.\"\n \n Michael gazed pensively at two slender, snakelike Difdans writhing\n\"Only 99 Shopping Days Till Christmas\" across an aquamarine sky.\n \n \"They won't be permanent?\" he asked. \"The family, I mean?\"\n \n \"Certainly not. You merely hire them for whatever length of time you choose. But why are you so anxious?\"\n \n The young man blushed. \"Well, I'm thinking of having a family of my own some day. Pretty soon, as a matter of fact.\"\n \n Carpenter beamed. \"That's nice; you're being adopted! I do hope it's an Earth family that's chosen you—it's so awkward being adopted by extraterrestrials.\"\n \n \"Oh, no! I'm planning to have my own. That is, I've got a—a girl, you see, and I thought after I had secured employment of some kind in Portyork, I'd send for her and we'd get married and....\"\n \n \" Married! \" Carpenter was now completely shocked. \"You mustn't use that word! Don't you know marriage was outlawed years ago? Exclusive possession of a member of the opposite sex is slavery on Talitha. Furthermore, supposing somebody else saw your—er—friend and wanted her also; you wouldn't wish him to endure the frustration of not having her, would you?\"\n \n Michael squared his jaw. \"You bet I would.\"\n \n Carpenter drew himself away slightly, as if to avoid contamination.\n\"This is un-Universal. Young man, if I didn't have a kind heart, I would report you.\"\n \n Michael was too preoccupied to be disturbed by this threat. \"You mean if I bring my girl here, I'd have to share her?\"\n \n \"Certainly. And she'd have to share you. If somebody wanted you, that is.\"\n \n \"Then I'm not staying here,\" Michael declared firmly, ashamed to admit even to himself how much relief his decision was bringing him. \"I don't think I like it, anyhow. I'm going back to the Brotherhood.\"\n \n There was a short cold silence.\n \n \"You know, son,\" Carpenter finally said, \"I think you might be right. I don't want to hurt your feelings—you promise I won't hurt your feelings?\" he asked anxiously, afraid, Michael realized, that he might call a policeman for ego injury.\n \n \"You won't hurt my feelings, Mr. Carpenter.\"\n \n \"Well, I believe that there are certain individuals who just cannot adapt themselves to civilized behavior patterns. It's much better for them to belong to a Brotherhood such as yours than to be placed in one of the government incarceratoriums, comfortable and commodious though they are.\"\n \n \"Much better,\" Michael agreed.\n \n \"By the way,\" Carpenter went on, \"I realize this is just vulgar curiosity on my part and you have a right to refuse an answer without fear of hurting my feelings, but how do you happen to have a—er—girl when you belong to a Brotherhood?\"\n \n Michael laughed. \"Oh, 'Brotherhood' is merely a generic term. Both sexes are represented in our society.\"\n \n \"On Talitha—\" Carpenter began.\n \n \"I know,\" Michael interrupted him, like the crude primitive he was and always would be. \"But our females don't mind being generic.\"\n \n \n\n \n A group of Sirians was traveling on the shelf above him on the slow, very slow jet bus that was flying Michael back to Angeles, back to the Lodge, back to the Brotherhood, back to her. Their melancholy howling was getting on his nerves, but in a little while, he told himself, it would be all over. He would be back home, safe with his own kind.\n \n \"When our minds have grown tired, when our lives have expired, when our sorrows no longer can weary us, let our ashes return, neatly packed in an urn, to the bright purple swamps of our Sirius.\"\n \n The advideo crackled: \"The gown her fairy godmother once gave to Cinderella was created by the haute couture of fashion-wise Capella.\"\n \n The ancient taxi was there, the one that Michael had taken from the Lodge, early that morning, to the little Angeleno landing field, as if it had been waiting for his return.\n \n \"I see you're back, son,\" the driver said without surprise. He set the noisy old rockets blasting. \"I been to Portyork once. It's not a bad place to live in, but I hate to visit it.\"\n \n \"I'm back!\" Michael sank into the motheaten sable cushions and gazed with pleasure at the familiar landmarks half seen in the darkness. \"I'm back! And a loud sneer to civilization!\"\n \n \"Better be careful, son,\" the driver warned. \"I know this is a rural area, but civilization is spreading. There are secret police all over. How do you know I ain't a government spy? I could pull you in for insulting civilization.\"\n \n The elderly black and white advideo flickered, broke into purring sound: \"Do you find life continues to daze you? Do you find for a quick death you hanker? Why not try the new style euthanasia, performed by skilled workmen from Ancha?\"\n \n Not any more, Michael thought contentedly. He was going home.",
      "metadata": {
        "title": "Tea Tray in the Sky",
        "author": "Evelyn E. Smith",
        "passage_id": "50847",
        "uid": "d1a4bc7de0ae4d7d9251f0af37b447f1",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "105",
                "uid": "ae97fe8dca7445af9b5c3d51bdb370e5",
                "response_text": "From his shelf Michael watches a juice advertisement. Then a nearby passenger starts a conversation regarding Michael's belonging to a Brotherhood. Michael remembers how the Father Superior proposed the idea for him to live in the outside world to answer the question about reasons for the Brotherhood's resignation from it. The young man makes one mistake after another, violating the laws of the Universe during the short conversation with his respectable companion. The least warns the youth against those mistakes and lets him stick close for a while, then the two listen to the Sirians singing. Suddenly, it turns out that Zosma has joined the United Universe and its rule to always cover the head becomes Universal starting that second. Upon the arrival to Portyork, Michael and his companion cautiously head to eat, and the man keeps enlightening the newcomer. Then they take a ride through the city with Carpenter constantly explaining Michael his new mistakes. During a short following walk, Michael says \"history\" and unintentionally deeply offends a man, who is urged by Carpenter not to report. Then Michael asks for a shower, and they take a taxi to a public lavatory. Advideos keep appearing and annoying the two everywhere. Then Carpenter wants to find a temporary family for Michael to make his stay legal, but the least mentions the desire to create his own permanent family and marry the girl he likes. This statement is the turning point, Carpenter is shocked with the youth's ignorance about marriage being outlawed. Michael in turn is frustrated with the idea of having to share his girl and decides to return to the Brotherhood. Carpenter is even more shocked by the news of both sexes living there together and belonging to one another, so he considers Michael simply unfit for the civilized and comfortable life. Michael, on the contrary, already dreams of coming back home. He takes the same bus and then the same taxi to his Brotherhood. "
              },
              {
                "worker_id": "107",
                "uid": "7adc923b570e42deb99e9a85a45dcc93",
                "response_text": "Michael Frey is a member of one of the Brotherhoods, and he leaves his home to explore the outside world. The stranger he talks to asks him why he would join one, and he explains that his father brought him to the Angeleno Brotherhood when he was an infant. The United Universe lives in peace and never engages in wars with one another because every citizen must adapt to the customs of another one. Michael questions Father Superior about the ways of the Brotherhood before coming, and the Father suggests him coming to experience the life of civilization. He meets Pierce B. Carpenter, who hands him a business card and explains that aphrodisiacs are his line of business. He and Michael begin discussing the rules by the United Universe, and Carpenter warns him of the various rules, such as appearing in public with bare hands and that he must be careful. Michael retrieves a pair of yellow gloves from his pack, but Carpenter tells him that wearing yellow is the color of death on Saturn. He settles for rose-colored gloves instead. Carpenter offers to guide him through his stay in Portyork so that Michael will not run into any problems with the law. A stewardess goes around and announces that everybody must now wear some form of head-wearing because of Zosma’s admittance into the Union. Carpenter tells Michael that the universe is constantly expanding, which means that there must be constant updates. He then takes Michael to a “Feeding Station” for some food and offers to take him to the Old Town after. Michael mentions wanting to go to a hotel, but Carpenter explains he should not say these words because of the laws. The two go to Times Square, where the aliens are currently preparing for Christmas. Carpenter continues his tour to a few more locations, such as the Empire State building and Broadway. After, Michael gets himself washed, and Carpenter tells him that they must register him for a family now. Michael mentions getting married to his girlfriend soon, to which Carpenter shockingly tells him not to use that word because it is banned on Earth. He explains that Michael would have to share his girlfriend if he chooses to bring her here. Michael declares that he wants to go back to the Brotherhood, and Carpenter agrees, telling him that he does not adapt well to civilized behavior. Michael goes back to the ancient taxi again, where the driver is not surprised to see him back. He gives one last insult to civilization, which the taxi driver warns him about, and feels content to go home. "
              },
              {
                "worker_id": "103",
                "uid": "b2502baf383049538a6fd970425a2a88",
                "response_text": "Michael Frey is a member of the Angeleno Brotherhood, a rural city in comparison to largest spaceport in the United Universe, Portyork. The United Universe consists of many different worlds and is expanding at all times. The story begins with Michael on a jet bus heading towards Portyork looking for a job. He imagines bringing his girl over to get married once he settles down.\n\nMichael was so eager to leave the Brotherhood and to go explore the world that after a year of learning the tabus and customs, he boards the bus heading to Portyork. On the jet bus, Michael meets Pierce B. Carpenter, a board-minded, middle-aged man with brown hair and blue eyes. Carpenter works in the aphrodisiacs industry, and his first thought Michael joined the Brotherhood because he was troubled over a female, then Michael reveals that he has been in the Brother since he was an infant. After accused of breaking a series of laws, which includes talking about fatherhood, wondering about turning the advideo off, not covering his hands, being intolerant, and having yellow colored gloves, Carpenter offers to guide Michael around the city so that he can learn about the civilized behaviors.\n\nPrior to landing, the stewardess announces that Zosma is now a part of the Union. Since they have a custom of not showing their head in public, everyone in the United Universe has to cover their head, thus, the passengers all leave the jet bus after wearing some sort of headgear. Then, Michael states loudly that he is hungry and need to find something to eat. He is immediately rebuked by Carpenter. Everyone in the Union is not allowed to speak of eating, or use any other vulgar language in public since it is a custom for the Theemimians. After checking the map of the landing field, Michael is able to get to a “Feeding Station,” where he chewed on pieces of food that were meant to be swallowed. Afterwards, Michael attempts to break more customs when trying to get to the Old Town. Getting off the taxi, Michael finally offends a being who threatens to report him to the police because he has mentioned the word “history,” something that the Meropians lack. Carpenter begs the being and blames himself for not warning Michael. Later, Michael interrupts Carpenter, asking for the lavatory. Thus, they get to the Empire State Building, which has been transformed into a lavatory, since, apparently, it has no other use. \n\nOn their way out, Michael mentions his desire for marriage and family with the girl he got. Carpenter is shocked since there’s no marriage in the Union, and family is never permanent. Thus, Michael is determined to leave. Finally, Michael is back to the Brotherhood. He tells the taxi driver about his dislike for civilization. The driver reminds him that civilization is spreading, even to rural areas. However, Michael is happy that he is heading home. "
              },
              {
                "worker_id": "106",
                "uid": "b2b8a566aae848eea6baf7b74b0dce9f",
                "response_text": "While on his way to Earth from the \"Brotherhood\" Michael meets a salesman named Mr. Carpenter. Micheal is moving to Earth in search of a new life, after his father passed away. The Brotherhood is a community that focuses on living in the ways of the past, which would be the present now, in this future society. Micheal and Carpenter begin to chat, but Carpenter soon makes Micheal aware of the social intricacies at play in this new Terran society. Earth is part of what's known as the \"United Universe\" which is a leaf of planets that was created over five hundred years ago. Each planet has different rules and customs, and to avoid conflict in this league, each planet must abide by one another's customs to avoid the chance of war breaking out. A person not abiding by those rules would face charges. Carpenter notices that Micheal keeps breaking these societal rules on their journey, and offers to take him under his wing, and show him around Earth, so he can avoid running into trouble. They arrive in Portyork, noticing all the Aliens that depart from the bus. Carpenter takes Michel to show him around, Micheal repeatedly unintentionally breaking rules. Micheal strats to get frustrated with all of these rules, not understanding the reasons behind them. The final straw comes when Micheal mentions to Carpenter that he has a girl back in the brotherhood whom he intends to marry. Carpenter tells him that marriage was outlawed a long time ago. Micheal decides that life in this civilisation is not worth it. He returns to the brotherhood and to his girlfriend. "
              }
            ]
          },
          {
            "question_text": "What kinds of rules were introduced to the United Universe by different planets and for what reasons?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "105",
                "uid": "ae97fe8dca7445af9b5c3d51bdb370e5",
                "response_text": "The United Universe's laws are a combination of laws of every planet involved. Earth has introduced the tabu regarding offending motherhood as it is sacred. Electra has prohibited appearing in public bare handed, because its people have eight fingers on each hand and feel different from others. Yellow is forbidden to wear as it represents death on Saturn. Zosma has just joined the United Universe and introduced the necessity to cover the heads in public, which is immodest on that planet. Theemimians do not eat in public, and so do all other beings in the United Universe. Fomalhautians do not have feet and, therefore, do not walk. So, it's prohibited to walk more than two hundred yards. Zaniahansn are like bees and go everywhere with their families, therefore, one can not travel alone in the universe. Nekkarians say and imply only what is true. Meropians do not have history and this word is offending for them, and forbidden, therefore. On Talitha marriage is slavery, and so is it on other planets. "
              },
              {
                "worker_id": "107",
                "uid": "7adc923b570e42deb99e9a85a45dcc93",
                "response_text": "There are many rules introduced to the United Universe by different planets that affect what citizens can wear, say, or even do with their lives. One of the rules introduced by the United Universe is an Earth tabu. The story says that Motherhood is sacred on Earth and the entire universe, so talking about anything that contradicts it is the same as violating the law. Another rule is that one must not violate the spirit of free enterprise and cause ego injury. This rule allows advertisers to continue creating their constant advideos. In terms of what one can wear, it is illegal on Electra to appear in public with bare hands and immodest to appear without a head covering on Zosma. Even talking about eating is considered vulgar to Theemimian, while the disgusting aroma of the Algedian cab is a scent that must be enjoyed. Meropians are also extremely sensitive to word history, making it illegal to say around them. On Earth, it is also considered unthinkable to go anywhere without a family because of the Zaniahans. Despite needing a family, marriage is illegal because it is considered slavery on Talitha. These rules are all introduced and accepted as a means of keeping the universe together. The Wise Ones believe that keeping every custom, rule, and habit the same will foster universal peace. "
              },
              {
                "worker_id": "103",
                "uid": "b2502baf383049538a6fd970425a2a88",
                "response_text": "It is considered a crime to injure another through word or action, thus customs and laws of each planet are considered laws of all other planets. Firstly, courteous is an important rule of the United Universe. Secondly, motherhood is sacred on Earth, thus it was introduced to the United Universe and all planets have to consider it sacred. Moreover, the advideos cannot be turned off since it would hurt the spirit of free enterprise; hands are forbidden to be bare in public since Electrans have eight fingers on each hand and two nails on each finger, which are covered in green scales; and yellow cannot be wore since it is the color of death on Saturn. On the jet bus, they are told that Zosma has been just admitted to the Union and the people there do not appear with bare head in public, thus from now on, everyone has to wear some sort of headgear in public. Furthermore, Theemimians are afraid of vulgar, thus any vulgar words such as eating cannot be stated in public; Fomalhautians do not walk, thus it is forbidden for everyone in the Union to walk more than two hundred yards in one direction. Ego injury is also considered a crime. Surprisingly, the word “hotel” cannot be mentioned since it means a place of dancing girls in the current society; “lodging” is offensive to the Zaniahans since they almost always travel with a family; “married” was outlawed years ago because Talithas consider the exclusive possession of a opposite sex as slavery; “history” pisses the Meropians off since they do not have any history, they went from barbaric to civilized in one generation, and historical buildings such as the Empire State was considered useless. Finally, Times Square is actually a square because the Nekkars do not allow anything that is not true to exist; and it is illegal to interrupt someone when they are speaking. "
              },
              {
                "worker_id": "106",
                "uid": "b2b8a566aae848eea6baf7b74b0dce9f",
                "response_text": "There were many rules introduced by the united universe for various reasons. It is forbidden to appear in public with your hands held by Electra because they have eight fingers, two of them being very ugly. You aren't allowed to wear yellow on Saturn, as it is the color of death. On Zosma it is illegal to appear with you head bare. On Them It is vulgar to speak about eating in public. The Fomalhaut Incas have made it illegal to walk more than two hundred feet in any direction. Because of the Zaniahan's it is forbidden to stay anywhere without one's family. On Nekkar, it is illegal to do, say or imply anything that isn;t true. The word history is not allowed because the Meropians deem it to be insulting. MArriage in earth was outlawed. \n"
              }
            ]
          },
          {
            "question_text": "What is the setting of the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "105",
                "uid": "ae97fe8dca7445af9b5c3d51bdb370e5",
                "response_text": "The narration begins on a bus shelf where the main character lies. Then he arrives at Portyork, a huge spaceport on Earth, where Michael and Mr. Carpenter head to the nearest feeding station following the map. There Michael alone is admitted into a tiny room to eat. When he finishes, the two take a trip to the Old Town by taxi. In the cab they crossed Portyork, looking at the cosmopolitan architecture and people. They exit the taxi at Times Square which is indeed in the shape of a square and is decorated for the New Year in green and red though it's July. The two walk a little to Broadway and then. take another can to a public lavatory. There, in the elevator, Michael sees many foreigners again. When they leave the lavatory, the two have an argument and go different ways. In the next scene Michaels appears on a shelf on his way back to Angeles, to the Lodge and the Brotherhood. Upon arrival, he takes the same taxi back home. \n"
              },
              {
                "worker_id": "107",
                "uid": "7adc923b570e42deb99e9a85a45dcc93",
                "response_text": "The story is set on Earth. Michael and Carpenter initially travel to Portyork via a jet bus. There is a level on the bus that drops his pack from the storage compartment. There are also no seats on the jet bus to accommodate the numerous types of life forms. Portyork is a cosmopolitan city filled with many different forms of architecture. There are silver dome buildings belonging to Earth origins and tall, helical Venusian buildings. Many different extraterrestrials inhabit the city too. The feeding station room Carpenter brings Michael has a slot for a two-credit piece. The tiny room itself has only a chair, table, food compartment, and advideo. Times Square is a square meadow with transparent domes, housing many antique clocks that run by twenty-four hours instead of the standard thirty. There are also many green and red decorations put out to prepare for Christmas. Broadway has boogil trees from Dschubba, and the Empire State Building still looks the same as in the pictures, except there is a huge “Public Washport” sign. There is a circular desk to direct traffic from and many different floors for each extraterrestrial species. "
              },
              {
                "worker_id": "103",
                "uid": "b2502baf383049538a6fd970425a2a88",
                "response_text": "The story takes place when Christmas is almost here, it’s July. It begins with the jet bus heading towards Portyork. The jet bus don’t have any seats since it was proven to be the most suitable way for different life-forms. The bus has an illuminated panel on a shelf, where Michael and Carpenter lie; and there is a storage compartment on the bus, and it can drop the bags that is stored within it using a lever. \n\nThe landing field has a large map that shows the location of the “Feeding Station” to Carpenter. Walking into the small and austere room that has a sliding door at the station, Michael sees that there is only a table, a chair, a food compartment and an advideo, and nothing else. \nPortyork is the largest spaceport in the United Universe and the city with the most cosmopolitan architectures and diverse group of inhabitants. Eventually, Michael gets a better view of the city of Portyork on the taxi, after he gets used to the Tpiu Number Five aroma. He sees the Silver domes of Earth as well as the tall helical buildings of the Venusians, standing right next to the domes. There are houses in Frank Lloyd Wright and Inigo Jones style due to the medieval architecture revival that is taking place there. Michael also notes the streamers and red and green balls on the street, which are lit even when there’s daylight. Getting off of the taxi, Michael and Carpenter arrive at the Time Square, which is actually a square now. It is filled with clocks inside transparent plastic domes, where most of those clocks are 24-hr clock; a few have 30-hr, which is the standard nowadays. Broadway is filled with shades from the boogil trees. The Empire State Building looks just like the pictures in his history book, but a “Public-Washport” sign was there. There is a large circular desk in the lobby, where the attendants directed the guests to the elevators. "
              },
              {
                "worker_id": "106",
                "uid": "b2b8a566aae848eea6baf7b74b0dce9f",
                "response_text": "The setting of the story is earth. When we first meet Micheal, he is on a bus, travelling to Portyork. It is a city that has clearly evolved from New York. The bus is uncomfortable to Micheal, as everyone on it has to lie down. The bus finally stops on the landing field. They depart from the bus into the outer edges of the city. Micheal goes into a small, white plain building which is marked as a feeding station to nourish himself. In the building is a table and chair, a food compartment and an advideo. The heart of the city is described as \"Old Town\". Portyork is the biggest spaceport in the United Universe. There are silver domes of earth, clustered by towing edifices of the Venusians. There are red and green balls that glow, lighting the streets. There are long red and green streamers lining the streets. They are transported to a square meadow, with plastic domes containing different types of clocks dotted throughout. It is Times square. There is a lovely walkway that is lined by \"boogil trees\". It is broadway. The empire state building has been converted into a washing station and lavatory, with different floors for different species. "
              }
            ]
          },
          {
            "question_text": "What is the meaning of the trip back for the whole story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "105",
                "uid": "ae97fe8dca7445af9b5c3d51bdb370e5",
                "response_text": "The final passages reflect how Michael's attitude towards the outside world has changed. The Sirians' song, which sparked curiosity in him in the beginning of the story, annoys him now and makes him miss home even more. The advideo is annoying as well, as those are all over the universe and can't be turned off. Those are the annoying features of the world about which nothing can be done, and for Michael one day was enough to get tired of them. Michael has fulfilled the purpose of his visit to Earth, he understands now why the Brotherhood is so isolated from the world and he likes it. He starts missing home and his girl in one day on Earth and gladly decides to return. The Earth experience makes him sure in how he wants to live in the future - in the Brotherhood, without the constant fear of mistakes and restrictions on every step, married to his girl. The civilization seems awful to the youth, but it is spreading, as the taxi driver says. Nevertheless, Michael doesn't care about it, he feels safe in Brotherhood, and it is definitely the right place for him."
              },
              {
                "worker_id": "107",
                "uid": "7adc923b570e42deb99e9a85a45dcc93",
                "response_text": "The meaning of the trip back is to show Michael’s development throughout the story and how he has matured into realizing that he is much more suited for life at the Brotherhood than under the rules of the United Universe. This directly contrasts his initial plan too. He, at first, wants to move to Earth and away from the Brotherhood, thinking of how it would let him start a much more exciting new life. However, the trip back shows just how unadaptable he is to the strict customs that exist and constantly expand. When he realizes this, the trip back symbolizes his maturity and realization that life back home is what is much more suited for anyways. "
              },
              {
                "worker_id": "103",
                "uid": "b2502baf383049538a6fd970425a2a88",
                "response_text": "The meaning of the trip back to the Brotherhood means that Michael does not like the way that the civilized live. He specifically mentions that he is not staying in Portyork after hearing that if he brings his girl, they cannot permanently get married, since following the custom of Talitha, one cannot have exclusive possession over one from the other sex. Simply stated, he have to share her and she have to share him if anyone wishes to have either of them. Moreover, stating that the females at the Brotherhood don’t mind being generic shows that Michael does not praise the numerous tabus and customs that they have to follow simply because another planet is following it. "
              },
              {
                "worker_id": "106",
                "uid": "b2b8a566aae848eea6baf7b74b0dce9f",
                "response_text": "The trip back means that the civilisation of the United Universe is spreading. Soon, the brotherhood will be taken over. There will be no trace of the old world. there will be nowhere to escape from this constant fear of saying the wrong thing by mistake, and ending up breaking the law. There will be no more love, or monogamous relationships. Micheal and his girlfriend might never get married. They might never be able to have a family. So many planets will eventually join that no one will be able to do or say anything at all, and the things that make different cultures special will be lost, as they offend another. \n"
              }
            ]
          },
          {
            "question_text": "What is the relationship between Michael and Mr. Carpenter?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "105",
                "uid": "ae97fe8dca7445af9b5c3d51bdb370e5",
                "response_text": "Mr. Carpenter is the first acquaintance Michael makes on his trip into the world. They are companions on the bus to Portyork. At first, Michael is unwilling to talk and Carpenter is curious to know about the reasons for the former to join a Brotherhood. Soon, Carpenter realizes that Michael is unfamiliar with the ways of this world and decides to take charge and show the youth around. Carpenter forgives Michael's every mistake and explains it, warning the youth to become silent in case of danger. Carpenter is more forgiving and kind than many other citizens, which is the reason for him taking charge of Michael. The man shows the newcomer around the city and prevents him from getting in trouble. Carpenter even defends Michael before an offended Meropian, who wants to report to the police. Things change when Michael begins an argument with Carpenter regarding marriage, which has been outlawed. Michael's desire to possess his girl alone contradicts the norms of the world and the youth's obstinance in this desire shock Carpenter completely. When he learns that in the Brotherhood both sexes are represented and marriage, which equals slavery to him, exists, Carpenter becomes sure that Michael can't adapt to the civilized world. After that, each goes his way.\n"
              },
              {
                "worker_id": "107",
                "uid": "7adc923b570e42deb99e9a85a45dcc93",
                "response_text": "Michael and Mr. Carpenter are travel companions for the duration of his stay in Portyork. Mr. Carpenter first befriends Michael on the jet bus, and he decides to take the latter around after seeing that Michael does not know his way around Earth. He is quick to inform Michael of the rules of the United Universe and always corrects him immediately whenever there is a problem. Mr. Carpenter is very knowledgeable about Portyork, the rules of the United Universe, and even the extraterrestrials. Although he does get fearful of Michael’s illegal outbursts, he is kind enough not to report him to the police and teach him instead. While Mr. Carpenter concludes that Michael is unsuited for life on Earth and the United Universe, there is no bad blood between them, and Michael learns a lot from him. \n"
              },
              {
                "worker_id": "103",
                "uid": "b2502baf383049538a6fd970425a2a88",
                "response_text": "Michael first met Mr. Carpenter on the jet bus heading towards Portyork. Carpenter notices that Michael comes from the Brotherhood and assumed that he was there because of trouble over women. Then Michael reveals that he has been in the Brotherhood for almost his whole life. After being reminded of a few tabus and customs that Michael is not even aware off, Carpenter asks Michael to stick around him for a while since he is unfamiliar with the civilized behaviors and can easily get in trouble. After exiting the jet bus, Carpenter mentions to Michael that he does not have anything to do this moment, thus he can show him around. Carpenter helps Michael to find the position of a “Feeding Station” so that he can get some food. Afterwards, Michael attempts to break more customs when trying to get to the Old Town. However, they were all stopped by Carpenter before anyone notices it. However, getting off the taxi, a being notices Carpenter stating the word “history” and threatens to report him to the police because history is something that the Meropians lack. Carpenter begs the being and blames himself for not warning Michael. Later, Michael interrupts Carpenter, asking for the lavatory. Thus, they get to the Empire State Building, which has been transformed into a lavatory, since, apparently, it has no other use. On their way out, Carpenter is shocked at Michael desiring for a permanent family, since there’s no marriage in the Union, and family is never permanent. Carpenter is very openminded, and agrees that there are individuals that do not apapt themselves to the civilization, the Brotherhood is a much better option for them. Later, Michael heads home to his Brotherhood.  "
              },
              {
                "worker_id": "106",
                "uid": "b2b8a566aae848eea6baf7b74b0dce9f",
                "response_text": "Mr.Carpenter acts as a kind of companion and advisor to Micheal. They first meet on the space bus on the way to Port York. Carpenter notices that Micheal is hopelessly lost in the social intricacies of the United Universe. Carpenter decides to take Micheal under his wing to make sure that he doesn't get in any trouble with the law as he tries to maneuver his way through this new society. They exit the bus together and make their way to a nourishing station, and then into the old town, where Carpenter points out various landmarks to Micheal. Carpenter keeps having to correct Micheal on his language, and eventually has to defend and apologize for him when he offends a Meropian. Carpenter often is shocked by Micheal's language and thoughts, but chalks it up to him not being experienced. Carpenter eventually agrees that it's better for Micheal to go home to the Brotherhood. They part amicably. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5032,
        "document_length_chars": 30512
      }
    }
  ]
}