{
  "item_metadata": {
    "item_id": "50868",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "50868",
      "content": "THE HIGHEST MOUNTAIN\n \n \n By BRYCE WALTON\n \n Illustrated by BOB HAYES\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction June 1952. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n First one up this tallest summit in the Solar System was a rotten egg ... a very rotten egg!\n \n\n \n Bruce heard their feet on the gravel outside and got up reluctantly to open the door for them. He'd been reading some of Byron's poems he'd sneaked aboard the ship; after that he had been on the point of dozing off, and now one of those strangely realistic dreams would have to be postponed for a while. Funny, those dreams. There were faces in them of human beings, or of ghosts, and other forms that weren't human at all, but seemed real and alive—except that they were also just parts of a last unconscious desire to escape death. Maybe that was it.\n \n \"'Oh that my young life were a lasting dream, my spirit not awakening till the beam of an eternity should bring the 'morrow,\" Bruce said. He smiled without feeling much of anything and added, \"Thanks, Mr. Poe.\"\n \n Jacobs and Anhauser stood outside. The icy wind cut through and into Bruce, but he didn't seem to notice. Anhauser's bulk loomed even larger in the special cold-resisting suiting. Jacobs' thin face frowned slyly at Bruce.\n \n \"Come on in, boys, and get warm,\" Bruce invited.\n \n \"Hey, poet, you're still here!\" Anhauser said, looking astonished.\n \n \"We thought you'd be running off somewhere,\" Jacobs said.\n \n Bruce reached for the suit on its hook, started climbing into it.\n\"Where?\" he asked. \"Mars looks alike wherever you go. Where did you think I'd be running to?\"\n \n \"Any place just so it was away from here and us,\" Anhauser said.\n \n \"I don't have to do that. You are going away from me. That takes care of that, doesn't it?\"\n \n \"Ah, come on, get the hell out of there,\" Jacobs said. He pulled the revolver from its holster and pointed it at Bruce. \"We got to get some sleep. We're starting up that mountain at five in the morning.\"\n \n \"I know,\" Bruce said. \"I'll be glad to see you climb the mountain.\"\n \n Outside, in the weird light of the double moons, Bruce looked up at the gigantic overhang of the mountain. It was unbelievable. The mountain didn't seem to belong here. He'd thought so when they'd first hit Mars eight months back and discovered the other four rockets that had never got back to Earth—all lying side by side under the mountain's shadow, like little white chalk marks on a tallyboard.\n \n They'd estimated its height at over 45,000 feet, which was a lot higher than any mountain on Earth. Yet Mars was much older, geologically. The entire face of the planet was smoothed into soft, undulating red hills by erosion. And there in the middle of barren nothingness rose that one incredible mountain. On certain nights when the stars were right, it had seemed to Bruce as though it were pointing an accusing finger at Earth—or a warning one.\n \n \n\n \n With Jacobs and Anhauser and the remainder of the crew of the ship, Mars V , seven judges sat in a semi-circle and Bruce stood there in front of them for the inquest.\n \n In the middle of the half-moon of inquisition, with his long legs stretched out and his hands folded on his belly, sat Captain Terrence. His uniform was black. On his arm was the silver fist insignia of the Conqueror Corps. Marsha Rennels sat on the extreme right and now there was no emotion at all on her trim, neat face.\n \n He remembered her as she had been years ago, but at the moment he wasn't looking very hard to see anything on her face. It was too late. They had gotten her young and it was too late.\n \n Terrence's big, square face frowned a little. Bruce was aware suddenly of the sound of the bleak, never-ending wind against the plastilene shelter. He remembered the strange misty shapes that had come to him in his dreams, the voices that had called to him, and how disappointed he had been when he woke from them.\n \n \"This is a mere formality,\" Terrence finally said, \"since we all know you killed Lieutenant Doran a few hours ago. Marsha saw you kill him. Whatever you say goes on the record, of course.\"\n \n \"For whom?\" Bruce asked.\n \n \"What kind of question is that? For the authorities on Earth when we get back.\"\n \n \"When you get back? Like the crews of those other four ships out there?\" Bruce laughed without much humor.\n \n Terrence rubbed a palm across his lips, dropped the hand quickly again to his belly. \"You want to make a statement or not? You shot Doran in the head with a rifle. No provocation for the attack. You've wasted enough of my time with your damn arguments and anti-social behavior. This is a democratic group. Everyone has his say. But you've said too much, and done too much. Freedom doesn't allow you to go around killing fellow crew-members!\"\n \n \"Any idea that there was any democracy or freedom left died on Venus,\" Bruce said.\n \n \"Now we get another lecture!\" Terrence exploded. He leaned forward.\n\"You're sick, Bruce. They did a bad psych job on you. They should never have sent you on this trip. We need strength, all the strength we can find. You don't belong here.\"\n \n \"I know,\" Bruce agreed indifferently. \"I was drafted for this trip. I told them I shouldn't be brought along. I said I didn't want any part of it.\"\n \n \"Because you're afraid. You're not Conqueror material. That's why you backed down when we all voted to climb the mountain. And what the devil does Venus—?\"\n \n Max Drexel's freckles slipped into the creases across his high forehead. \"Haven't you heard him expounding on the injustice done to the Venusian aborigines, Captain? If you haven't, you aren't thoroughly educated to the crackpot idealism still infecting certain people.\"\n \n \"I haven't heard it,\" Terrence admitted. \"What injustice?\"\n \n Bruce said, \"I guess it couldn't really be considered an injustice any longer. Values have changed too much. Doran and I were part of the crew of that first ship to hit Venus, five years ago. Remember? One of the New Era's more infamous dates. Drexel says the Venusians were aborigines. No one ever got a chance to find out. We ran into this village. No one knows how old it was. There were intelligent beings there. One community left on the whole planet, maybe a few thousand inhabitants. They made their last mistake when they came out to greet us. Without even an attempt at communication, they were wiped out. The village was burned and everything alive in it was destroyed.\"\n \n Bruce felt the old weakness coming into his knees, the sweat beginning to run down his face. He took a deep breath and stood there before the cold nihilistic stares of fourteen eyes.\n \n \"No,\" Bruce said. \"I apologize. None of you know what I'm talking about.\"\n \n Terrence nodded. \"You're psycho. It's as simple as that. They pick the most capable for these conquests. Even the flights are processes of elimination. Eventually we get the very best, the most resilient, the real conquering blood. You just don't pass, Bruce. Listen, what do you think gives you the right to stand here in judgment against the laws of the whole Solar System?\"\n \n \"There are plenty on Earth who agree with me,\" Bruce said. \"I can say what I think now because you can't do more than kill me and you'll do that regardless....\"\n \n He stopped. This was ridiculous, a waste of his time. And theirs. They had established a kind of final totalitarianism since the New Era. The psychologists, the Pavlovian Reflex boys, had done that. If you didn't want to be reconditioned to fit into the social machine like a human vacuum tube, you kept your mouth shut. And for many, when the mouth was kept shut long enough, the mind pretty well forgot what it had wanted to open the mouth for in the first place.\n \n A minority in both segments of a world split into two factions. Both had been warring diplomatically and sometimes physically, for centuries, clung to old ideas of freedom, democracy, self-determinism, individualism. To most, the words had no meaning now. It was a question of which set of conquering heroes could conquer the most space first. So far, only Venus had fallen. They had done a good, thorough job there. Four ships had come to Mars and their crews had disappeared. This was the fifth attempt—\n \n \n\n \n Terrence said, \"why did you shoot Doran?\"\n \n \"I didn't like him enough to take the nonsense he was handing me, and when he shot the—\" Bruce hesitated.\n \n \"What? When he shot what?\"\n \n Bruce felt an odd tingling in his stomach. The wind's voice seemed to sharpen and rise to a kind of wail.\n \n \"All right, I'll tell you. I was sleeping, having a dream. Doran woke me up. Marsha was with him. I'd forgotten about that geological job we were supposed to be working on. I've had these dreams ever since we got here.\"\n \n \"What kind of dreams?\"\n \n Someone laughed.\n \n \"Just fantastic stuff. Ask your Pavlovian there,\" Bruce said. \"People talk to me, and there are other things in the dreams. Voices and some kind of shapes that aren't what you would call human at all.\"\n \n Someone coughed. There was obvious embarrassment in the room.\n \n \"It's peculiar, but many faces and voices are those of crew members of some of the ships out there, the ones that never got back to Earth.\"\n \n Terrence grinned. \"Ghosts, Bruce?\"\n \n \"Maybe. This planet may not be a dead ball of clay. I've had a feeling there's something real in the dreams, but I can't figure it out. You're still interested?\"\n \n Terrence nodded and glanced to either side.\n \n \"We've seen no indication of any kind of life whatsoever,\" Bruce pointed out. \"Not even an insect, or any kind of plant life except some fungi and lichen down in the crevices. That never seemed logical to me from the start. We've covered the planet everywhere except one place—\"\n \n \"The mountain,\" Terrence said. \"You've been afraid even to talk about scaling it.\"\n \n \"Not afraid,\" Bruce objected. \"I don't see any need to climb it. Coming to Mars, conquering space, isn't that enough? It happens that the crew of the first ship here decided to climb the mountain, and that set a precedent. Every ship that has come here has had to climb it. Why? Because they had to accept the challenge. And what's happened to them? Like you, they all had the necessary equipment to make a successful climb, but no one's ever come back down. No contact with anything up there.\n \n \"Captain, I'm not accepting a ridiculous challenge like that. Why should I? I didn't come here to conquer anything, even a mountain. The challenge of coming to Mars, of going on to where ever you guys intend going before something bigger than you are stops you—it doesn't interest me.\"\n \n \"Nothing's bigger than the destiny of Earth!\" Terrence said, sitting up straight and rigid.\n \n \"I know,\" Bruce said. \"Anyway, I got off the track. As I was saying, I woke up from this dream and Marsha and Doran were there. Doran was shaking me. But I didn't seem to have gotten entirely awake; either that or some part of the dream was real, because I looked out the window—something was out there, looking at me. It was late, and at first I thought it might be a shadow. But it wasn't. It was misty, almost translucent, but I think it was something alive. I had a feeling it was intelligent, maybe very intelligent. I could feel something in my mind. A kind of beauty and softness and warmth. I kept looking—\"\n \n His throat was getting tight. He had difficulty talking. \"Doran asked me what I was looking at, and I told him. He laughed. But he looked. Then I realized that maybe I wasn't still dreaming. Doran saw it, too, or thought he did. He kept looking and finally he jumped and grabbed up his rifle and ran outside. I yelled at him. I kept on yelling and ran after him. 'It's intelligent, whatever it is!' I kept saying. 'How do you know it means any harm?' But I heard Doran's rifle go off before I could get to him. And whatever it was we saw, I didn't see it any more. Neither did Doran. Maybe he killed it. I don't know. He had to kill it. That's the way you think.\"\n \n \"What? Explain that remark.\"\n \n \"That's the philosophy of conquest—don't take any chances with aliens. They might hinder our advance across the Universe. So we kill everything. Doran acted without thinking at all. Conditioned to kill everything that doesn't look like us. So I hit Doran and took the gun away from him and killed him. I felt sick, crazy with rage. Maybe that's part of it. All I know is that I thought he deserved to die and that I had to kill him, so I did.\"\n \n \"Is that all, Bruce?\"\n \n \"That's about all. Except that I'd like to kill all of you. And I would if I had the chance.\"\n \n \"That's what I figured.\" Terrence turned to the psychologist, a small wiry man who sat there constantly fingering his ear. \"Stromberg, what do you think of this gobbledegook? We know he's crazy. But what hit him? You said his record was good up until a year ago.\"\n \n Stromberg's voice was monotonous, like a voice off of a tape.\n\"Schizophrenia with mingled delusions of persecution. The schizophrenia is caused by inner conflict—indecision between the older values and our present ones which he hasn't been able to accept. A complete case history would tell why he can't accept our present attitudes. I would say that he has an incipient fear of personal inadequacy, which is why he fears our desire for conquest. He's rationalized, built up a defense which he's structured with his idealism, foundationed with Old Era values. Retreat into the past, an escape from his own present feelings of inadequacy. Also, he escapes into these dream fantasies.\"\n \n \"Yes,\" Terrence said. \"But how does that account for Doran's action? Doran must have seen something—\"\n \n \"Doran's charts show high suggestibility under stress. Another weak personality eliminated. Let's regard it that way. He imagined he saw something.\" He glanced at Marsha. \"Did you see anything?\"\n \n She hesitated, avoiding Bruce's eyes. \"Nothing at all. There wasn't anything out there to see, except the dust and rocks. That's all there is to see here. We could stay a million years and never see anything else. A shadow maybe—\"\n \n \"All right,\" Terrence interrupted. \"Now, Bruce, you know the law regulating the treatment of serious psycho cases in space?\"\n \n \"Yes. Execution.\"\n \n \"No facilities for handling such cases en route back to Earth.\"\n \n \"I understand. No apologies necessary, Captain.\"\n \n Terrence shifted his position. \"However, we've voted to grant you a kind of leniency. In exchange for a little further service from you, you can remain here on Mars after we leave. You'll be left food-concentrates to last a long time.\"\n \n \"What kind of service?\"\n \n \"Stay by the radio and take down what we report as we go up the mountain.\"\n \n \"Why not?\" Bruce said. \"You aren't certain you're coming back, then?\"\n \n \"We might not,\" Terrence admitted calmly. \"Something's happened to the others. We're going to find out what and we want it recorded. None of us want to back down and stay here. You can take our reports as they come in.\"\n \n \"I'll do that,\" Bruce said. \"It should be interesting.\"\n \n \n\n \n Bruce watched them go, away and up and around the immediate face of the mountain in the bleak cold of the Martian morning. He watched them disappear behind a high ledge, tied together with plastic rope like convicts.\n \n He stayed by the radio. He lost track of time and didn't care much if he did. Sometimes he took a heavy sedative and slept. The sedative prevented the dreams. He had an idea that the dreams might be so pleasant that he wouldn't wake up. He wanted to listen to Terrence as long as the captain had anything to say. It was nothing but curiosity.\n \n At fifteen thousand feet, Terrence reported only that they were climbing.\n \n At twenty thousand feet, Terrence said, \"We're still climbing, and that's all I can report, Bruce. It's worth coming to Mars for—to accept a challenge like this!\"\n \n At twenty-five thousand feet, Terrence reported, \"We've put on oxygen masks. Jacobs and Drexel have developed some kind of altitude sickness and we're taking a little time out. It's a magnificent sight up here. I can imagine plenty of tourists coming to Mars one of these days, just to climb this mountain! Mt. Everest is a pimple compared with this! What a feeling of power, Bruce!\"\n \n From forty thousand feet, Terrence said, \"We gauged this mountain at forty-five thousand. But here we are at forty and there doesn't seem to be any top. We can see up and up and the mountain keeps on going. I don't understand how we could have made such an error in our computations. I talked with Burton. He doesn't see how a mountain this high could still be here when the rest of the planet has been worn so smooth.\"\n \n And then from fifty-three thousand feet, Terrence said with a voice that seemed slightly strained: \"No sign of any of the crew of the other four ships yet. Ten in each crew, that makes fifty. Not a sign of any of them so far, but then we seem to have a long way left to climb—\"\n \n Bruce listened and noted and took sedatives and opened cans of food concentrates. He smoked and ate and slept. He had plenty of time. He had only time and the dreams which he knew he could utilize later to take care of the time.\n \n From sixty thousand feet, Terrence reported, \"I had to shoot Anhauser a few minutes ago! He was dissenting. Hear that, Bruce? One of my most dependable men. We took a vote. A mere formality, of course, whether we should continue climbing or not. We knew we'd all vote to keep on climbing. And then Anhauser dissented. He was hysterical. He refused to accept the majority decision. 'I'm going back down!' he yelled. So I had to shoot him. Imagine a man of his apparent caliber turning anti-democratic like that! This mountain will be a great tester for us in the future. We'll test everybody, find out quickly who the weaklings are.\"\n \n Bruce listened to the wind. It seemed to rise higher and higher. Terrence, who had climbed still higher, was calling. \"Think of it! What a conquest! No man's ever done a thing like this. Like Stromberg says, it's symbolic! We can build spaceships and reach other planets, but that's not actual physical conquest. We feel like gods up here. We can see what we are now. We can see how it's going to be—\"\n \n Once in a while Terrence demanded that Bruce say something to prove he was still there taking down what Terrence said. Bruce obliged. A long time passed, the way time does when no one cares. Bruce stopped taking the sedatives finally. The dreams came back and became, somehow, more real each time. He needed the companionship of the dreams.\n \n It was very lonely sitting there without the dreams, with nothing but Terrence's voice ranting excitedly on and on. Terrence didn't seem real any more; certainly not as real as the dreams.\n \n \n\n \n The problem of where to put the line between dream and reality began to worry Bruce. He would wake up and listen and take down what Terrence was saying, and then go to sleep again with increasing expectancy. His dream took on continuity. He could return to the point where he had left it, and it was the same—allowing even for the time difference necessitated by his periods of sleep.\n \n He met people in the dreams, two girls and a man. They had names: Pietro, Marlene, Helene.\n \n Helene he had seen from the beginning, but she became more real to him all the time, until he could talk with her. After that, he could also talk with Marlene and Pietro, and the conversations made sense. Consistently, they made sense.\n \n The Martian landscape was entirely different in the dreams. Green valleys and rivers, or actually wide canals, with odd trees trailing their branches on the slow, peacefully gliding currents. Here and there were pastel-colored cities and there were things drifting through them that were alive and intelligent and soft and warm and wonderful to know.\n \n ' ... dreams, in their vivid coloring of life, as in that fleeting, shadowy, misty strife of semblance with reality which brings to the delirious eye more lovely things of paradise and love—and all our own!—than young Hope in his sunniest hour hath known.... '\n \n So sometimes he read poetry, but even that was hardly equal to the dreams.\n \n And then he would wake up and listen to Terrence's voice. He would look out the window over the barren frigid land where there was nothing but seams of worn land, like scabs under the brazen sky.\n \n \"If I had a choice,\" he thought, \"I wouldn't ever wake up at all again. The dreams may not be more real, but they're preferable.\"\n \n Dreams were supposed to be wishful thinking, primarily, but he couldn't live in them very long. His body would dry up and he would die. He had to stay awake enough to put a little energy back into himself. Of course, if he died and lost the dreams, there would be one compensation—he would also be free of Terrence and the rest of them who had learned that the only value in life lay in killing one's way across the Cosmos.\n \n But then he had a feeling Terrence's voice wouldn't be annoying him much more anyway. The voice was unreal, coming out of some void. He could switch off Terrence any time now, but he was still curious.\n \n \"Bruce—Bruce, you still there? Listen, we're up here at what we figure to be five hundred thousand feet! It is impossible. We keep climbing and now we look up and we can see up and up and there the mountain is going up and up—\"\n \n And some time later: \"Bruce, Marsha's dying! We don't know what's the matter. We can't find any reason for it. She's lying here and she keeps laughing and calling your name. She's a woman, so that's probably it. Women don't have real guts.\"\n \n Bruce bent toward the radio. Outside the shelter, the wind whistled softly at the door.\n \n \"Marsha,\" he said.\n \n \"Bruce—\"\n \n She hadn't said his name that way for a long time.\n \n \"Marsha, remember how we used to talk about human values? I remember how you seemed to have something maybe different from the others. I never thought you'd really buy this will to conquer, and now it doesn't matter....\"\n \n He listened to her voice, first the crazy laughter, and then a whisper.\n\"Bruce, hello down there.\" Her voice was all mixed up with fear and hysteria and mockery. \"Bruce darling, are you lonely down there? I wish I were with you, safe ... free ... warm. I love you. Do you hear that? I really love you, after all. After all....\"\n \n \n\n \n Her voice drifted away, came back to him. \"We're climbing the highest mountain. What are you doing there, relaxing where it's peaceful and warm and sane? You always were such a calm guy. I remember now. What are you doing—reading poetry while we climb the mountain? What was that, Bruce—that one about the mountain you tried to quote to me last night before you ... I can't remember it now. Darling, what...?\"\n \n \n\n \n He stared at the radio. He hesitated, reached out and switched on the mike. He got through to her.\n \n \"Hello, hello, darling,\" he whispered. \"Marsha, can you hear me?\"\n \n \"Yes, yes. You down there, all warm and cozy, reading poetry, darling. Where you can see both ways instead of just up and down, up and down.\"\n \n He tried to imagine where she was now as he spoke to her, how she looked. He thought of Earth and how it had been there, years ago, with Marsha. Things had seemed so different then. There was something of that hope in his voice now as he spoke to her, yet not directly to her, as he looked out the window at the naked frigid sky and the barren rocks.\n \n \"'... and there is nowhere to go from the top of a mountain,\n But down, my dear;\n And the springs that flow on the floor of the valley\n Will never seem fresh or clear\n For thinking of the glitter of the mountain water\n In the feathery green of the year....'\"\n \n The wind stormed over the shelter in a burst of power, buried the sound of his own voice.\n \n \"Marsha, are you still there?\"\n \n \"What the devil's the idea, poetry at a time like this, or any time?\" Terrence demanded. \"Listen, you taking this down? We haven't run into any signs of the others. Six hundred thousand feet, Bruce! We feel our destiny. We conquer the Solar System. And we'll go out and out, and we'll climb the highest mountain, the highest mountain anywhere. We're going up and up. We've voted on it. Unanimous. We go on. On to the top, Bruce! Nothing can stop us. If it takes ten years, a hundred, a thousand years, we'll find it. We'll find the top! Not the top of this world—the top of everything . The top of the\n UNIVERSE\n !\"\n \n Later, Terrence's voice broke off in the middle of something or other—Bruce couldn't make any sense out of it at all—and turned into crazy yells that faded out and never came back.\n \n Bruce figured the others might still be climbing somewhere, or maybe they were dead. Either way it wouldn't make any difference to him. He knew they would never come back down.\n \n He was switching off the radio for good when he saw the coloration break over the window. It was the same as the dream, but for an instant, dream and reality seemed fused like two superimposed film negatives.\n \n He went to the window and looked out. The comfortable little city was out there, and the canal flowing past through a pleasantly cool yet sunny afternoon. Purple mist blanketed the knees of low hills and there was a valley, green and rich with the trees high and full beside the softly flowing canal water.\n \n The filmy shapes that seemed alive, that were partly translucent, drifted along the water's edge, and birds as delicate as colored glass wavered down the wind.\n \n He opened the shelter door and went out. The shelter looked the same, but useless now. How did the shelter of that bleak world get into this one, where the air was warm and fragrant, where there was no cold, from that world into this one of his dreams?\n \n The girl—Helene—was standing there leaning against a tree, smoking a cigarette.\n \n He walked toward her, and stopped. In the dream it had been easy, but now he was embarrassed, in spite of the intimacy that had grown between them. She wore the same casual slacks and sandals. Her hair was brown. She was not particularly beautiful, but she was comfortable to look at because she seemed so peaceful. Content, happy with what was and only what was.\n \n He turned quickly. The shelter was still there, and behind it the row of spaceships—not like chalk marks on a tallyboard now, but like odd relics that didn't belong there in the thick green grass. Five ships instead of four.\n \n There was his own individual shelter beyond the headquarters building, and the other buildings. He looked up.\n \n There was no mountain.\n \n \n\n \n For one shivery moment he knew fear. And then the fear went away, and he was ashamed of what he had felt. What he had feared was gone now, and he knew it was gone for good and he would never have to fear it again.\n \n \"Look here, Bruce. I wondered how long it would take to get it through that thick poetic head of yours!\"\n \n \"Get what?\" He began to suspect what it was all about now, but he wasn't quite sure yet.\n \n \"Smoke?\" she said.\n \n He took one of the cigarettes and she lighted it for him and put the lighter back into her pocket.\n \n \"It's real nice here,\" she said. \"Isn't it?\"\n \n \"I guess it's about perfect.\"\n \n \"It'll be easy. Staying here, I mean. We won't be going to Earth ever again, you know.\"\n \n \"I didn't know that, but I didn't think we ever would again.\"\n \n \"We wouldn't want to anyway, would we, Bruce?\"\n \n \"No.\"\n \n He kept on looking at the place where the mountain had been. Or maybe it still was; he couldn't make up his mind yet. Which was and which was not? That barren icy world without life, or this?\n \n \"' Is all that we see or seem ,'\" he whispered, half to himself, \"' but a dream within a dream? '\"\n \n She laughed softly. \"Poe was ahead of his time,\" she said. \"You still don't get it, do you? You don't know what's been happening?\"\n \n \"Maybe I don't.\"\n \n She shrugged, and looked in the direction of the ships. \"Poor guys. I can't feel much hatred toward them now. The Martians give you a lot of understanding of the human mind—after they've accepted you, and after you've lived with them awhile. But the mountain climbers—we can see now—it's just luck, chance, we weren't like them. A deviant is a child of chance.\"\n \n \"Yes,\" Bruce said. \"There's a lot of people like us on Earth, but they'll never get the chance—the chance we seem to have here, to live decently....\"\n \n \"You're beginning to see now which was the dream,\" she said and smiled. \"But don't be pessimistic. Those people on Earth will get their chance, too, one of these fine days. The Conquerors aren't getting far. Venus, and then Mars, and Mars is where they stop. They'll keep coming here and climbing the mountain and finally there won't be any more. It won't take so long.\"\n \n She rose to her toes and waved and yelled. Bruce saw Pietro and Marlene walking hand in hand up the other side of the canal. They waved back and called and then pushed off into the water in a small boat, and drifted away and out of sight around a gentle turn.\n \n She took his arm and they walked along the canal toward where the mountain had been, or still was—he didn't know.\n \n A quarter of a mile beyond the canal, he saw the high mound of red, naked hill, corroded and ugly, rising up like a scar of the surrounding green.\n \n She wasn't smiling now. There were shadows on her face as the pressure on his arm stopped him.\n \n \"I was on the first ship and Marlene on the second. None like us on the third, and on the fourth ship was Pietro. All the others had to climb the mountain—\" She stopped talking for a moment, and then he felt the pressure of her fingers on his arm. \"I'm very glad you came on the fifth,\" she whispered. \"Are you glad now?\"\n \n \"I'm very glad,\" he said.\n \n \"The Martians tested us,\" she explained. \"They're masters of the mind. I guess they've been grinding along through the evolutionary mill a darn long time, longer than we could estimate now. They learned the horror we're capable of from the first ship—the Conquerors, the climbers. The Martians knew more like them would come and go on into space, killing, destroying for no other reason than their own sickness. Being masters of the mind, the Martians are also capable of hypnosis—no, that's not really the word, only the closest our language comes to naming it. Suggestion so deep and strong that it seems real to one human or a million or a billion; there's no limit to the number that can be influenced. What the people who came off those ships saw wasn't real. It was partly what the Martians wanted them to see and feel—but most of it, like the desire to climb the mountain, was as much a part of the Conquerors' own psychic drive as it was the suggestion of the Martians.\"\n \n She waved her arm slowly to describe a peak. \"The Martians made the mountain real. So real that it could be seen from space, measured by instruments ... even photographed and chipped for rock samples. But you'll see how that was done, Bruce, and realize that this and not the mountain of the Conquerors is the reality of Mars. This is the Mars no Conqueror will ever see.\"\n \n \n\n \n They walked toward the ugly red mound that jutted above the green. When they came close enough, he saw the bodies lying there ... the remains, actually, of what had once been bodies. He felt too sickened to go on walking.\n \n \"It may seem cruel now,\" she said, \"but the Martians realized that there is no cure for the will to conquer. There is no safety from it, either, as the people of Earth and Venus discovered, unless it is given an impossible obstacle to overcome. So the Martians provided the Conquerors with a mountain. They themselves wanted to climb. They had to.\"\n \n He was hardly listening as he walked away from Helene toward the eroded hills. The crew members of the first four ships were skeletons tied together with imperishably strong rope about their waists. Far beyond them were those from Mars V , too freshly dead to have decayed much ... Anhauser with his rope cut, a bullet in his head; Jacobs and Marsha and the others ... Terrence much past them all. He had managed to climb higher than anyone else and he lay with his arms stretched out, his fingers still clutching at rock outcroppings.\n \n The trail they left wound over the ground, chipped in places for holds, red elsewhere with blood from torn hands. Terrence was more than twelve miles from the ship—horizontally.\n \n Bruce lifted Marsha and carried her back over the rocky dust, into the fresh fragrance of the high grass, and across it to the shade and peace beside the canal.\n \n He put her down. She looked peaceful enough, more peaceful than that other time, years ago, when the two of them seemed to have shared so much, when the future had not yet destroyed her. He saw the shadow of Helene bend across Marsha's face against the background of the silently flowing water of the cool, green canal.\n \n \"You loved her?\"\n \n \"Once,\" Bruce said. \"She might have been sane. They got her when she was young. Too young to fight. But she would have, I think, if she'd been older when they got her.\"\n \n He sat looking down at Marsha's face, and then at the water with the leaves floating down it.\n \n \"'... And the springs that flow on the floor of the valley will never seem fresh or clear for thinking of the glitter of the mountain water in the feathery green of the year....'\"\n \n He stood up, walked back with Helene along the canal toward the calm city. He didn't look back.\n \n \"They've all been dead quite a while,\" Bruce said wonderingly. \"Yet I seemed to be hearing from Terrence until only a short time ago. Are—are the climbers still climbing—somewhere, Helene?\"\n \n \"Who knows?\" Helene answered softly. \"Maybe. I doubt if even the Martians have the answer to that.\"\n \n They entered the city.",
      "metadata": {
        "title": "The Highest Mountain",
        "author": "Bryce Walton",
        "passage_id": "50868",
        "uid": "ffa5b8aad83241538d4d28358a1c1584",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "113",
                "uid": "9c9f3681b8cf4da9982d6b420c1cd264",
                "response_text": "The story is set on Mars. A group of conquerors from Earth arrived here after the last four crews never returned after deciding to climb a very high Martian mountain. The fifth team with Bruce, Marsha - his past love interest, Anhauser, Jacobs, Doran, Max Drexel, Stromberg - the psychologist, and its captain Terrence arrived here on their ship Mars V eight months ago. A day before the ascent Bruce is reading Byron and thinking about his bizarre dreams. Then we see an inquest. With all the crew members listening, Terrence interrogates Bruce and asks why he shot Doran. Bruce reminds the crew about the genocide of the Venusian aborigines: five years ago, he and Doran were part of the crew of the first ship that landed on Venus; these explorers wiped out the entire Venusian community. Terrence claims that Bruce is mentally ill and doesn’t have the real conquering blood. The captain understands the young man doesn’t believe in the philosophy of conquering and remains faithful to the old ideas of democracy and freedom. Bruce then explains that Marsha and Doran woke him up after a bizarre dream, and he immediately saw something or someone in the window. When Doran saw the creature, he left the room, and Bruce heard his rifle go off. Infuriated, Bruce killed the man. \n\nStromberg deems Bruce a delusional schizophrenic and says that Doran probably imagined the creature, too. Instead of punishing the man by executing him, Terrence orders Bruce to write down everything they report via radio while they are climbing. He stays by the radio, eats what they left for him, and sometimes sleeps. Eventually, Terrence reports that the mountain is way higher than they anticipated - 45 00 feet. Later, he screams that he just killed Anhauser for dissent. The captain speaks of their great conquest, and Bruce sometimes replies to prove he's still writing down everything. His dreams become more realistic and he seems to see some crew members of the previous expeditions: Pietro, Marlene, and Helene. Terrence reports that they are at an altitude of five hundred thousand feet and later adds that Marsha is dying. She says she loves Bruce, and he recites a poem for her. Terrence later crazily speaks about toppling the Solar system but soon stops reporting. Bruce turns off the radio. The exterior of the ship changes - now he sees a small town and the grandiose mountain vanished. Not sure if it’s a dream or not, he approaches Helene, who eventually explains that the Martians wanted to stop the human conquerors. They decided to create an illusion of an infinitely high mountain, and the colonists felt an uncontrollable urge to climb it. They both walk to a red mound, where Bruce notices the bodies of the crew members of all five ships. Only people like him remained alive. Bruce looks at them and, together with Helene, leaves the mound, entering the city."
              },
              {
                "worker_id": "107",
                "uid": "2df6e35778204336b32227c31cc7484d",
                "response_text": "Bruce is reading some poetry he had sneaked upon the ship; he then dozes off but wakes himself to postpone one of his strangely realistic dreams. Jacob and Anhauser stand outside, surprised he did not run off somewhere. They have been on Mars for eight months, discovering other rockets that did not make it back. Everybody meets with Captain Terrence and Marsha Rennels, where they discuss Bruce killing Lieutenant Doran. Bruce tries to argue his way, but Terrence believes that he should never have been sent because of his bad mental state. Max Drexel considers him a crackpot idealist, but Bruce says that the first thing that the original travelers did to the Venusian village was destroy it completely. Bruce stops himself from arguing more because the New Era had only ushered final totalitarianism. Terrence asks him again why he shot Doran, and Bruce begins talking about the realistic dreams he has of the other crew members who never made it back to Earth. He continues to speak about the mountain, mentioning how everybody who has gone up has never come back down. Since their goal is not to conquer anything, Bruce feels no need to do it even if the destiny of Earth is absolute. When he is woken, he feels something looking at him; Doran also sees this too and grabs his rifle to go outside. Bruce is so overcome with rage about them killing aliens that he shoots him too. Stromberg, the psychologist, says that Bruce has schizophrenia, while Marsha also agrees that she did not see anything. Although the verdict should be execution for Bruce, they let him stay and take down radio reports when they go up the mountain. When the crew goes to climb, they begin documenting the experience for Bruce to list down. Bruce begins having more strange dreams, seeing a different martian landscape and meeting others. Terrence tells him that Marsha is dying, and he hears her call his name while telling him how much she loves him. Terrence continues his crazy yelling, and Bruce switches off the radio to see Helene smoking a cigarette. She explains how the Martians are masters of the mind and that the only people who survive are the ones who do not climb the mountain. The mountain is not real at all, as it is a product of the Martian’s psychic powers. They go to check on the corpses after, and Helene asks if he loved Marsha. He responds that he had once, but it is too late now. As they walk towards the calm city, he asks if the crew is still climbing somewhere. Helene responds that not even the Martians know about that. "
              },
              {
                "worker_id": "109",
                "uid": "30561bbb778a4130b8fcab79f1fc6c4f",
                "response_text": "This story follows Bruce and his fellow cremates of the ship Mars V, as they explore Mars for potential life. Bruce is sat in front of his crew members, with Captain Terrence taking the lead, for an inquest. He has shot a fellow crew member, Lieutenant Doran, supposedly without provocation. He is set on trial for a mere formality - his fate of execution already decided - to determine his motivations behind the killing. Bruce proclaims that there are injustices aboard the crew. In particular, he disagrees with the crew and Earth's dogged desire to conquest, which Doran embodied wholeheartedly. \nBruce describes he saw a figure or a shadow out the window of their shelter that could've blurred between dream and reality. Doran had turned and saw it too, only to rush out and shoot at it, after which Bruce then killed him. It was then decided that because the rest of the crew were going to climb the mountain, instead of execution being Bruce's fate, he would remain back to record their notes over the radio. \n\nAs the crew went on their climb, Bruce sat back and drifted between sedative sleeping and dreams. The crew began to climb beyond the mountain's estimated peak of 45,000 feet. At 60,000 feet, Terrence reported that he killed Anhauser as he was dissenting, wanting to go back down the mountain. At 500,000 feet, Terrence comes back on the radio to report that Marsha is dying. Bruce and Marsha profess their love for each other as they reflect upon the past, before being interrupted by Terrence's proclamations of conquering the mountain and the universe. \n\nThroughout the story, Bruce has been having dreams of two girls and a man, set in a Mars landscape completely different to the one in reality. As Terrence's voice breaks off into undistinguishable yells, he looked out the shelter's window to find that the previously red and barren landscape had changed into the lush landscape of his dreams. He sees Helene - one of the girls - and she tells him what's been going on. It turns out that the Martians had purposefully imaged Mars to appear red and barren and set up the mountain as a test for the humans. They had found that humans had an undeterred desire for conquest that incorporated no values of morality or humane-ness. As a result, only those who didn't follow this blind conquest like Bruce, Helene, and the other girl and boy are rewarded by the true landscape of Mars which is plentiful, lush, and inhabitable. While listening to Helene, they reach the mountain. There lies the bodies of the previous crew members who climbed the mountain, including that of Marsha's. Respectfully carrying her body to place beside the canal, Helene asked if he loved her to which Bruce replied that he did once, and that she was young enough where her mind was influenced by the other's will to conquest."
              },
              {
                "worker_id": "112",
                "uid": "8b34e84754554858a57b90a6fc0af015",
                "response_text": "The fifth rocket, Mars V, hits Mars, and its crewmembers see the four rockets lying under the shadow of the highest mountain they have ever seen. Bruce is reading poems while waiting for the trial. Jacob and Anhauser, Bruce’s crewmates, are surprised that Bruce did not run away from the execution, which is the night before all the crew members, except for Bruce, start to climb the mountain. In the trial, Bruce tries to explain the injustice done on Venus five years ago, when he and Doran went on the same mission, witnessing the brutality of Earthmen’s conquest of wiping out the Venusian village without communication. But he soon realizes that it is futile as Terrence, the captain, and other crewmembers insist on the importance of the conquered strength and the twisted democracy. Asked for the reason for killing Doram, Bruce explains his dream, which seems to indicate there are lives on Mars, to them. In the dream, Bruce describes how Doran runs out to shoot the shadowy things in the mist as the Earthmen always do based on the philosophy of conquest. Bruce killed Doran, wanting to kill all of his crew members, and they think he is a psycho. They finally decide to leave Bruce with food concentrates and the work of recording while they climb the mountain. They start to climb the mountain while Bruce reads poems, sleeps, and dreams of a magnificent place. Along with the climbing, Terrence keeps reporting his feeling of conquest and power. He also kills Anhauser because he refuses to keep climbing. Meanwhile, as Bruce stops using sedatives and continues dreaming, the boundary between dream and reality becomes blurred. Three people seem to come from the previous rockets in Bruce's dream. Scenes in a dream are warm and wonderful. Marsha dies along with the climbing after confessing to Bruce. Terrence dies. When Bruce switches off the radio, the scenery outside the window changes; it fuses with his dream. A woman comes to him, explaining that the dream is reality while the reality with the mountain is fake. Martians created the phenomenon of barren land and the mountain as they wanted to stop Earth’s conquest of the universe. With the mountain, Earthmen with the will to conquer will climb the mountain and die, and Earthmen who do not climb the mountain will live on Mars. The people in the dream he saw are all the crewmember of previous rockets who refuse to climb the mountain. Therefore, Earthmen will stop their conquest of Mars. After knowing the truth and seeing the corpses of other crew members, Bruce moves Marsha’s corpse along the canals and leaves with the woman."
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "113",
                "uid": "9c9f3681b8cf4da9982d6b420c1cd264",
                "response_text": "At the beginning, Jacobs, Bruce, and Anhauser talk aboard their ship Mars V which recently landed on the windy surface of Mars. Bruce then looks at the even Martian landscape with an incredible mountain right near the ship and the double moons illuminating the surface. When everybody else leaves to climb the mountain, he spends his time on the spaceship, eating, sleeping, and sitting by the radio. Bruce dreams of a green valley and canals inside a town. And later, when the crew stops reporting anything, he finally can see the real landscape of Mars. He looks at numerous low hills with purple mist, a canal, and valleys with green trees. The mountain disappeared. A quarter of a mile beyond the canal, there is an ugly red mound with the bodies of the conquerors lying there. After looking at Marsha and Terrence, together with Helene, he walks along the canal back to the city.  \n"
              },
              {
                "worker_id": "107",
                "uid": "2df6e35778204336b32227c31cc7484d",
                "response_text": "The story is set on Mars; it is originally shown as a dead planet with nothing but smooth, red hills caused by erosion. However, there is a mountain too that is around 45,000 feet. Mars also has double moons and is extremely cold. On Mars, there are also five ships from the Conquerors in their attempts to try and take total control of Mars. When Bruce has his dreams, the martian landscape changes to one of green valleys and rivers. There are wide canals, odd trees trailing their branches on the gliding rivers. There is also a pastel–colored city that seems completely different from the Mars that the crew arrived to conquer. Later, it is revealed that this landscape is actually real because the fake Mars was just an illusion that the Martians set up using their powers to mess with the mind. The mountain does not exist either, having served its purpose of eliminating each group of Conquerors. "
              },
              {
                "worker_id": "109",
                "uid": "30561bbb778a4130b8fcab79f1fc6c4f",
                "response_text": "This story is set on Mars. However, the Mars that the Conquerers see and the real Mars is different. \n\nThe Mars that the crew initially see lifeless, barren and has a flat landscape with only a mountain estimated at 45,000 feet standing out. There are four rockets - prior attempts at conquering Mars - lay side by side the mountain. \n\nThe real Mars that is revealed to Bruce is vastly different. It had lush green valleys and rivers and wide canals with slow currents. There were inhabited cities that are pastel-colored and overall, the atmosphere was soft, vibrant and lovely. Beyond the canal, the red mountain still stands. By the red mountain, the remains of the bodies of the crew of the first four ships lie as skeletons. The dead bodies of Bruce's crewmates also lie there - all still tied together by the rope.  "
              },
              {
                "worker_id": "112",
                "uid": "8b34e84754554858a57b90a6fc0af015",
                "response_text": "The story happens on Mars. There are two moons on Mars. There is a tremendously high mountain where the top seems nowhere to be seen, and the four rockets sent before the fifth rock lie in its shadow. The landscape on Mars is smoothed with red eroded hills, except for the mountain, which is unexpected in height and points toward Earth. In Bruce’s dream, which turns out to be the real Mars, the landscape on Mars is totally different. There are green valleys, wide canals, trees, and cities decorated with flowers. Behind the shelter, five rockets lie beside it. There is no mountain in the dream, only a high mound of the red hill with corpses lying on it."
              }
            ]
          },
          {
            "question_text": "What is the relationship between Bruce and Marsha?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "113",
                "uid": "9c9f3681b8cf4da9982d6b420c1cd264",
                "response_text": "Bruce and Marsha were close years ago when they lived on Earth. They shared similar values and loved each other, but eventually, Marsha became one of the conquerors, ready to expand the human territories. Now she’s almost emotionless. Bruce is disappointed and reckons that the other conquerors had gotten her young, and there was nothing he could do about it. When he’s interrogated, the psychologist asks if she saw any creature before Bruce shot Doran. She seems hesitant and doesn’t look at Bruce when denying seeing anything. When she is dying, she crazily laughs and admits that she is in love with him, asking Bruce to read her a poem. At the end, he finds Marsha’s body among the eroded hills and puts it beside the city canal. He says that he loved her once, and she could’ve been sane, different if the conquerors hadn’t got her when she was so young. \n"
              },
              {
                "worker_id": "107",
                "uid": "2df6e35778204336b32227c31cc7484d",
                "response_text": "Bruce and Marsha do not interact much initially. Marsha is a witness of when Bruce shot Doran, but she makes no move to oppose the other members of the crew. She also hesitates to meet his eyes when she speaks, only following orders. Bruce mentions that they had gotten her when she was too young. Later, when Marsha is dying, she calls him darling and mentions how much she loves him. Even though she is hysterical, Bruce remembers the time when they used to talk about human values. He recites poetry to her and tries to think about the good times on Earth. Later, it is revealed that Bruce loved her before on Earth. However, it eventually meant nothing because she had been converted by the Conquerors too early and could not fight back. "
              },
              {
                "worker_id": "109",
                "uid": "30561bbb778a4130b8fcab79f1fc6c4f",
                "response_text": "Bruce and Marsha appear to once have been romantic partners, with both proclaiming their love for each other. They used to share poetry and talk about human values and had a clear and affectionate connection back on Earth.  \n\nHowever, Marsha and Bruce begin to distance as Marsha bought into the will to conquer, whereas Bruce leaned further away from this thought. This dissonance is apparent as she refuses to look at him during his inquest and at the fact that Marsha goes onto the climb. \n\nDespite this, when Marsha dies over the radio, they share a last moment of spoken affection. When Bruce sees her dead body, he takes care to rest her by the canal as he expresses his melancholy  over \"they\" getting to her young. "
              },
              {
                "worker_id": "112",
                "uid": "8b34e84754554858a57b90a6fc0af015",
                "response_text": "Bruce and Marsha used to be lovers years ago. Marsha is indifferent to Bruce when Bruce accepts his inquisition from other crewmembers for his murder. When Marsha is asked whether she saw anything when Bruce killed Doran, she says no, even though she might see it. According to Bruce, Marsha was reconditioned to accept the new values in New Era, where strength and conquest are prioritized as the most important thing, compared to Old Era, where mercy and compassion seem to exist. Marsha keeps calling Bruce’s name on the edge of death while climbing the mountain. She misses the warmth she used to have with Bruce, realizing that conquest is not everything. After she dies, Bruce places her corpse along the canals. Bruce and Marsha used to be in a romantic relationship, but after Marsha accepts the will to conquer, they become distant from each other. When Marsha is dying, Marsha finally regains herself and confesses to Bruce. Their relationship becomes tolerant and beloved."
              }
            ]
          },
          {
            "question_text": "What is the significance of the mountain?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "113",
                "uid": "9c9f3681b8cf4da9982d6b420c1cd264",
                "response_text": "The mountain is a sign of an impossible obstacle that the conquerors from Earth want to overcome, topple. Their urge to expand their territories and own the entire Solar System forces the Martians to come up with an illusion of something that can stop the destruction humans are spreading. The Martian mountain is a part of the hypnotic vision the conquered had access to, but they never saw the Martian city. They all ultimately died trying to climb it, from their drive to conquer everything they could find. The mountain is a perfect symbol of humans’ greed for territories and power, and it is also what stops them all from expanding their so-called empire. "
              },
              {
                "worker_id": "107",
                "uid": "2df6e35778204336b32227c31cc7484d",
                "response_text": "The mountain is significant because it is the ultimate challenge that the Martians laid out for the humans. Since they are aware of the Conquerors and horrors on Venus, the mountain is an illusion that was made to stop the humans and let only the good ones live. Helene explains that the people on Earth will get the opportunity to live on Mars too, but the terrible ones must be destroyed so that civilization can be preserved on Mars. Even though everybody wants to scale the mountain in hopes of finding some sort of new discovery or territory for the totalitarian Earth, the mountain serves as a trap that kills all of the ones who try to conquer it. The mountain is what also hides the Martian world away, only fading away when there is only one sane human from each crew left. "
              },
              {
                "worker_id": "109",
                "uid": "30561bbb778a4130b8fcab79f1fc6c4f",
                "response_text": "The mountain, placed there intentionally by the Martians, acted as a test for the Conquerers. Most of the people coming from Earth had a will to conquer, and the Mountain served as a physical manifestation of this desire. It becomes evident throughout the climb that the Mountain continuously rises above the initial estimate, and yet humans overtaken by their desire to conquer this will continue to stride on. By doing so, they have failed the test. \n\nIt is significant because it demonstrates the supposedly innate and greedy determination of humans to be the Conquerer and be at the top - figuratively and literally. Even when a task seems improbable, a human's ego will feed this determination. This will to conquer that is fuelled without reason or morality. And it's only through this test that the Martians are able to identify which humans do not have this senseless will, that they are rewarded with the supposed oasis that the Conquers themselves desired to take over. "
              },
              {
                "worker_id": "112",
                "uid": "8b34e84754554858a57b90a6fc0af015",
                "response_text": "The mountain symbolizes a challenge to be conquered. It plays a significant role in the story as every Earthmen coming from Earth with the will of conquest would climb the mountain. The mountain is very high that Earthmen can see it from the space and that Earthmen with the will of domination would want to climb to the top, which they will never succeed. Everyone who climbs the mountain will eventually die as it is a hypnotic-like phenomenon, which cannot be described in human language, created by Martians. Martians make this mountain because they know that Earthmen with the will of conquest cannot bear not to climb it since they enjoy the feeling of belittling others and the power of conquering, which is shown through their actions of killing anything or anyone in their ways even though those killed species may not have any intention to harm them. The story also plays a crucial role in distinguishing between people with the will to conquest and people who has no desire to conquer. Those who have no will to dominate will not climb the mountain, and they will be sent to the reality of Mars, where everything is adorable and peaceful. In the story, only four people out of five flights can get to the Martian reality, which again shows the significance of the mountain. Using the mountain phenomenon, Martian will be able to stop the Earthmen’s interplanetary conquest that Mars will be the furthest they can reach as they will keep climbing the mountain until they die."
              }
            ]
          },
          {
            "question_text": "What happens to Terrence throughout the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "113",
                "uid": "9c9f3681b8cf4da9982d6b420c1cd264",
                "response_text": "Terrence is the ship’s captain. At the beginning, he serves as a judge when he interrogates Bruce, who killed the other crew member Doran. Terrence listens to the story about Venus and claims that Bruce is not a true conqueror and is simply a psycho. He then asks a question about Bruce’s dreams and later hears the story of Doran's death. Stromberg then concludes that Bruce has schizophrenia caused by inner conflict. He also supposes that Doran imagined the strange creature after Terrence asks him to explain the actions of the killed crew member. Finally, instead of killing Bruce, Terrence orders him to sit by the radio and write down everything they report while climbing. He reports that they are at fifteen and then twenty-five thousand feet and are to take a little time out. At forty thousand feet, he tells Bruce that the mountain is way higher than they thought - their computations are wrong. At sixty thousand feet, he shoots Anhauser after the latter starts dissenting and becomes hysterical and claims the mountain to be a tester for the real conquerors. Eventually, they reach the mark of five hundred thousand feet, and the captain is shocked. Later, Marsha unexpectedly starts dying, and Terrence concludes that women don’t have real guts for such undertakings. At six hundred thousand feet, he starts declaring that they will soon find the top of the universe. Terrence made it farther than any other crew member of the five ships. He dies with his fingers still clutching the rock outcroppings. In reality, he’s just over twelve miles away from the spaceship horizontally. \n"
              },
              {
                "worker_id": "107",
                "uid": "2df6e35778204336b32227c31cc7484d",
                "response_text": "Captain Terrence is initially present for Bruce’s trial. He does not understand how the other man thinks, believing that nothing is more important than the destiny of Earth. He is a great believer of the totalitarian thought, finding no problem killing whatever stands in their way of ultimate conquest. He decides to scale the mountain with the other members of the crew, leaving Bruce behind to take care of the radio. On the mountain, Terrence excitedly documents his journey, talking about how far they have gotten. However, he does have to shoot Anhauser because the other man does not want to climb anymore. He shouts a few more reports to Bruce before disappearing completely, having died. Terrence is the one who tries to climb the furthest after everybody else dies, wanting to be the one who conquers the mountain and brings the glory back to Earth. In reality, he had completely been trapped in the illusion and lays dead at the end with his arms stretched out."
              },
              {
                "worker_id": "109",
                "uid": "30561bbb778a4130b8fcab79f1fc6c4f",
                "response_text": "In the beginning of the story, Terrence leads the inquisition against Bruce for killing Lieutenant Doran without provocation. He has already determined Bruce's fate - an execution - but grants the inquest to understand his motivations. He often explodes in anger as Bruce only appears to give philosophical lectures about morality. When Terrence agrees to hear Bruce's supposed dreams out, he disagrees with Bruce's disinterest in climbing the mountain and concludes him to be a psycho. However, he agrees to let Bruce live only to note down the crew's upcoming climb to the mountain, for records. \n\nIn the latter half of the story, Terrence and his crew begin the climb up the mountain. Terrence often gives Bruce updates on the altitude of their climb, and sometimes request his response to make sure he is still there. Terrence also reported he had to shoot Anhauser for dissenting, as the latter wanted to descend back down the mountain. Upwards of an ascent of five hundred thousand feet, Terrence begins to go mad as he yells of his domination of the mountain and conquest of the Solar System. As his crazy yells fade, he is presumed to be dead, which is confirmed later on. "
              },
              {
                "worker_id": "112",
                "uid": "8b34e84754554858a57b90a6fc0af015",
                "response_text": "Terrence wears a black uniform, and he is the captain of Mars V, a rocket that lands on Mars. Terrence presides over Bruce’s trial that Bruce kills Lieutenant Doran. When they argue with each other, Terrence insists on the importance of the twisted democracy and the strength of a conqueror, which, according to Bruce, is totalitarianism disguised under democracy. Terrence regards Bruce as a psycho, deciding his fate of staying while he and all the other crewmembers climb the mountain. When they start to climb the mountain, Terrence reports to Bruce through the radio while climbing, showing his conquering feeling of climbing the highest mountain and belittling everything else, even the universe. Terrence kills Anhauser because he dissents to keep climbing. Terrence becomes more and more enthusiastic about climbing and conquering the mountain. When Marsha is talking to Bruce, Terrence interrupts them, expresses his ambition, and dies. He manages to climb to the highest but still dies."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 6004,
        "document_length_chars": 33871
      }
    }
  ]
}