{
  "item_metadata": {
    "item_id": "50905",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "50905",
      "content": "Yesterday House\n \n \n By FRITZ LEIBER\n \n Illustrated by ASHMAN\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction August 1952. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n Meeting someone who's been dead for twenty years is shocking enough for anyone with a belief in ghosts—worse for one with none!\n \n\n\n I\n \n The narrow cove was quiet as the face of an expectant child, yet so near the ruffled Atlantic that the last push of wind carried the Annie O. its full length. The man in gray flannels and sweatshirt let the sail come crumpling down and hurried past its white folds at a gait made comically awkward by his cramped muscles. Slowly the rocky ledge came nearer. Slowly the blue V inscribed on the cove's surface by the sloop's prow died. Sloop and ledge kissed so gently that he hardly had to reach out his hand.\n \n He scrambled ashore, dipping a sneaker in the icy water, and threw the line around a boulder. Unkinking himself, he looked back through the cove's high and rocky mouth at the gray-green scattering of islands and the faint dark line that was the coast of Maine. He almost laughed in satisfaction at having disregarded vague warnings and done the thing every man yearns to do once in his lifetime—gone to the farthest island out.\n \n He must have looked longer than he realized, because by the time he dropped his gaze the cove was again as glassy as if the Annie O. had always been there. And the splotches made by his sneaker on the rock had faded in the hot sun. There was something very unusual about the quietness of this place. As if time, elsewhere hurrying frantically, paused here to rest. As if all changes were erased on this one bit of Earth.\n \n The man's lean, melancholy face crinkled into a grin at the banal fancy. He turned his back on his new friend, the little green sloop, without one thought for his nets and specimen bottles, and set out to explore. The ground rose steeply at first and the oaks were close, but after a little way things went downhill and the leaves thinned and he came out on more rocks—and realized that he hadn't quite gone to the farthest one out.\n \n \n\n \n Joined to this island by a rocky spine, which at the present low tide would have been dry but for the spray, was another green, high island that the first had masked from him all the while he had been sailing. He felt a thrill of discovery, just as he'd wondered back in the woods whether his might not be the first human feet to kick through the underbrush. After all, there were thousands of these islands.\n \n Then he was dropping down the rocks, his lanky limbs now moving smoothly enough.\n \n To the landward side of the spine, the water was fairly still. It even began with another deep cove, in which he glimpsed the spiny spheres of sea urchins. But from seaward the waves chopped in, sprinkling his trousers to the knees and making him wince pleasurably at the thought of what vast wings of spray and towers of solid water must crash up from here in a storm.\n \n He crossed the rocks at a trot, ran up a short grassy slope, raced through a fringe of trees—and came straight up against an eight-foot fence of heavy mesh topped with barbed wire and backed at a short distance with high, heavy shrubbery.\n \n Without pausing for surprise—in fact, in his holiday mood, using surprise as a goad—he jumped for the branch of an oak whose trunk touched the fence, scorning the easier lower branch on the other side of the tree. Then he drew himself up, worked his way to some higher branches that crossed the fence, and dropped down inside.\n \n Suddenly cautious, he gently parted the shrubbery and, before the first surprise could really sink in, had another.\n \n \n\n \n A closely mown lawn dotted with more shrubbery ran up to a snug white Cape Cod cottage. The single strand of a radio aerial stretched the length of the roof. Parked on a neat gravel driveway that crossed just in front of the cottage was a short, square-lined touring car that he recognized from remembered pictures as an ancient Essex. The whole scene had about it the same odd quietness as the cove.\n \n Then, with the air of a clock-work toy coming to life, the white door opened and an elderly woman came out, dressed in a long, lace-edged dress and wide, lacy hat. She climbed into the driver's seat of the Essex, sitting there very stiff and tall. The motor began to chug bravely, gravel skittered, and the car rolled off between the trees.\n \n The door of the house opened again and a slim girl emerged. She wore a white silk dress that fell straight from square neck-line to hip-height waistline, making the skirt seem very short. Her dark hair was bound with a white bandeau so that it curved close to her cheeks. A dark necklace dangled against the white of the dress. A newspaper was tucked under her arm.\n \n She crossed the driveway and tossed the paper down on a rattan table between three rattan chairs and stood watching a squirrel zigzag across the lawn.\n \n \n\n \n The man stepped through the wall of shrubbery, called, \"hello!\" and walked toward her.\n \n She whirled around and stared at him as still as if her heart had stopped beating. Then she darted behind the table and waited for him there. Granting the surprise of his appearance, her alarm seemed not so much excessive as eerie. As if, the man thought, he were not an ordinary stranger, but a visitor from another planet.\n \n Approaching closer, he saw that she was trembling and that her breath was coming in rapid, irregular gasps. Yet the slim, sweet, patrician face that stared into his had an underlying expression of expectancy that reminded him of the cove. She couldn't have been more than eighteen.\n \n He stopped short of the table. Before he could speak, she stammered out, \"Are you he?\"\n \n \"What do you mean?\" he asked, smiling puzzledly.\n \n \"The one who sends me the little boxes.\"\n \n \"I was out sailing and I happened to land in the far cove. I didn't dream that anyone lived on this island, or even came here.\"\n \n \"No one ever does come here,\" she replied. Her manner had changed, becoming at once more wary and less agitated, though still eerily curious.\n \n \"It startled me tremendously to find this place,\" he blundered on.\n\"Especially the road and the car. Why, this island can't be more than a quarter of a mile wide.\"\n \n \"The road goes down to the wharf,\" she explained, \"and up to the top of the island, where my aunts have a tree-house.\"\n \n He tore his mind away from the picture of a woman dressed like Queen Mary clambering up a tree. \"Was that your aunt I saw driving off?\"\n \n \"One of them. The other's taken the motorboat in for supplies.\" She looked at him doubtfully. \"I'm not sure they'll like it if they find someone here.\"\n \n \"There are just the three of you?\" he cut in quickly, looking down the empty road that vanished among the oaks.\n \n She nodded.\n \n \"I suppose you go in to the mainland with your aunts quite often?\"\n \n She shook her head.\n \n \"It must get pretty dull for you.\"\n \n \"Not very,\" she said, smiling. \"My aunts bring me the papers and other things. Even movies. We've got a projector. My favorite stars are Antonio Morino and Alice Terry. I like her better even than Clara Bow.\"\n \n He looked at her hard for a moment. \"I suppose you read a lot?\"\n \n She nodded. \"Fitzgerald's my favorite author.\" She started around the table, hesitated, suddenly grew shy. \"Would you like some lemonade?\"\n \n \n\n \n He'd noticed the dewed silver pitcher, but only now realized his thirst. Yet when she handed him a glass, he held it untasted and said awkwardly, \"I haven't introduced myself. I'm Jack Barry.\"\n \n She stared at his outstretched right hand, slowly extended her own toward it, shook it up and down exactly once, then quickly dropped it.\n \n He chuckled and gulped some lemonade. \"I'm a biology student. Been working at Wood's Hole the first part of the summer. But now I'm here to do research in marine ecology—that's sort of sea-life patterns—of the in-shore islands. Under the direction of Professor Kesserich. You know about him, of course?\"\n \n She shook her head.\n \n \"Probably the greatest living biologist,\" he was proud to inform her. \"Human physiology as well. Tremendous geneticist. In a class with Carlson and Jacques Loeb. Martin Kesserich—he lives over there at town. I'm staying with him. You ought to have heard of him.\" He grinned. \"Matter of fact, I'd never have met you if it hadn't been for Mrs. Kesserich.\"\n \n The girl looked puzzled.\n \n Jack explained, \"The old boy's been off to Europe on some conferences, won't be back for a couple days more. But I was to get started anyhow. When I went out this morning Mrs. Kesserich—she's a drab sort of person—said to me, 'Don't try to sail to the farther islands.' So, of course, I had to. By the way, you still haven't told me your name.\"\n \n \"Mary Alice Pope,\" she said, speaking slowly and with an odd wonder, as if she were saying it for the first time.\n \n \"You're pretty shy, aren't you?\"\n \n \"How would I know?\"\n \n The question stopped Jack. He couldn't think of anything to say to this strangely attractive girl dressed almost like a \"flapper.\"\n \n \"Will you sit down?\" she asked him gravely.\n \n The rattan chair sighed under his weight. He made another effort to talk. \"I'll bet you'll be glad when summer's over.\"\n \n \"Why?\"\n \n \"So you'll be able to go back to the mainland.\"\n \n \"But I never go to the mainland.\"\n \n \"You mean you stay out here all winter?\" he asked incredulously, his mind filled with a vision of snow and frozen spray and great gray waves.\n \n \"Oh, yes. We get all our supplies on hand before winter. My aunts are very capable. They don't always wear long lace dresses. And now I help them.\"\n \n \"But that's impossible!\" he said with sudden sympathetic anger. \"You can't be shut off this way from people your own age!\"\n \n \"You're the first one I ever met.\" She hesitated. \"I never saw a boy or a man before, except in movies.\"\n \n \"You're joking!\"\n \n \"No, it's true.\"\n \n \"But why are they doing it to you?\" he demanded, leaning forward. \"Why are they inflicting this loneliness on you, Mary?\"\n \n \n\n \n She seemed to have gained poise from his loss of it. \"I don't know why. I'm to find out soon. But actually I'm not lonely. May I tell you a secret?\" She touched his hand, this time with only the faintest trembling. \"Every night the loneliness gathers in around me—you're right about that. But then every morning new life comes to me in a little box.\"\n \n \"What's that?\" he said sharply.\n \n \"Sometimes there's a poem in the box, sometimes a book, or pictures, or flowers, or a ring, but always a note. Next to the notes I like the poems best. My favorite is the one by Matthew Arnold that ends,\n \n 'Ah, love, let us be true\n To one another! for the world, which seems\n To lie before us like a land of dreams,\n So various, so beautiful, so new,\n Hath really neither joy, nor love, nor light,\n Nor certitude—'\"\n \n \"Wait a minute,\" he interrupted. \"Who sends you these boxes?\"\n \n \"I don't know.\"\n \n \"But how are the notes signed?\"\n \n \"They're wonderful notes,\" she said. \"So wise, so gay, so tender, you'd imagine them being written by John Barrymore or Lindbergh.\"\n \n \"Yes, but how are they signed?\"\n \n She hesitated. \"Never anything but 'Your Lover.'\"\n \n \"And so when you first saw me, you thought—\" He began, then stopped because she was blushing.\n \n \"How long have you been getting them?\"\n \n \"Ever since I can remember. I have two closets of the boxes. The new ones are either by my bed when I wake or at my place at breakfast.\"\n \n \"But how does this—person get these boxes to you out here? Does he give them to your aunts and do they put them there?\"\n \n \"I'm not sure.\"\n \n \"But how can they get them in winter?\"\n \n \"I don't know.\"\n \n \"Look here,\" he said, pouring himself more lemonade, \"how long is it since you've been to the mainland?\"\n \n \"Almost eighteen years. My aunts tell me I was born there in the middle of the war.\"\n \n \"What war?\" he asked startledly, spilling some lemonade.\n \n \"The World War, of course. What's the matter?\"\n \n Jack Barr was staring down at the spilled lemonade and feeling a kind of terror he'd never experienced in his waking life. Nothing around him had changed. He could still feel the same hot sun on his shoulders, the same icy glass in his hand, scent the same lemon-acid odor in his nostrils. He could still hear the faint chop-chop of the waves.\n \n And yet everything had changed, gone dark and dizzy as a landscape glimpsed just before a faint. All the little false notes had come to a sudden focus. For the lemonade had spilled on the headline of the newspaper the girl had tossed down, and the headline read:\n \n HITLER IN NEW DEFIANCE\n \n Under the big black banner of that head swam smaller ones:\n \n Foes of Machado Riot in Havana\n \n Big NRA Parade Planned\n \n Balbo Speaks in New York\n \n \n\n \n Suddenly he felt a surge of relief. He had noticed that the paper was yellow and brittle-edged.\n \n \"Why are you so interested in old newspapers?\" he asked.\n \n \"I wouldn't call day-before-yesterday's paper old,\" the girl objected, pointing at the dateline: July 20, 1933.\n \n \"You're trying to joke,\" Jack told her.\n \n \"No, I'm not.\"\n \n \"But it's 1953.\"\n \n \"Now it's you who are joking.\"\n \n \"But the paper's yellow.\"\n \n \"The paper's always yellow.\"\n \n He laughed uneasily. \"Well, if you actually think it's 1933, perhaps you're to be envied,\" he said, with a sardonic humor he didn't quite feel. \"Then you can't know anything about the Second World War, or television, or the V-2s, or Bikini bathing suits, or the atomic bomb, or—\"\n \n \"Stop!\" She had sprung up and retreated around her chair, white-faced.\n\"I don't like what you're saying.\"\n \n \"But—\"\n \n \"No, please! Jokes that may be quite harmless on the mainland sound different here.\"\n \n \"I'm really not joking,\" he said after a moment.\n \n She grew quite frantic at that. \"I can show you all last week's papers! I can show you magazines and other things. I can prove it!\"\n \n She started toward the house. He followed. He felt his heart begin to pound.\n \n At the white door she paused, looking worriedly down the road. Jack thought he could hear the faint chug of a motorboat. She pushed open the door and he followed her inside. The small-windowed room was dark after the sunlight. Jack got an impression of solid old furniture, a fireplace with brass andirons.\n \n \"Flash!\" croaked a gritty voice. \"After their disastrous break day before yesterday, stocks are recovering. Leading issues....\"\n \n Jack realized that he had started and had involuntarily put his arm around the girl's shoulders. At the same time he noticed that the voice was coming from the curved brown trumpet of an old-fashioned radio loudspeaker.\n \n The girl didn't pull away from him. He turned toward her. Although her gray eyes were on him, her attention had gone elsewhere.\n \n \"I can hear the car. They're coming back. They won't like it that you're here.\"\n \n \"All right they won't like it.\"\n \n Her agitation grew. \"No, you must go.\"\n \n \"I'll come back tomorrow,\" he heard himself saying.\n \n \"Flash! It looks as if the World Economic Conference may soon adjourn, mouthing jeers at old Uncle Sam who is generally referred to as Uncle Shylock.\"\n \n Jack felt a numbness on his neck. The room seemed to be darkening, the girl growing stranger still.\n \n \"You must go before they see you.\"\n \n \"Flash! Wiley Post has just completed his solo circuit of the Globe, after a record-breaking flight of 7 days, 18 hours and 45 minutes. Asked how he felt after the energy-draining feat, Post quipped....\"\n \n \n\n \n He was halfway across the lawn before he realized the terror into which the grating radio voice had thrown him.\n \n He leaped for the branch over-hanging the fence, vaulted up with the risky help of a foot on the barbed top. A surprised squirrel, lacking time to make its escape up the trunk, sprang to the ground ahead of him. With terrible suddenness, two steel-jawed semicircles clanked together just over the squirrel's head. Jack landed with one foot to either side of the sprung trap, while the squirrel darted off with a squeak.\n \n Jack plunged down the slope to the rocky spine and ran across it, spray from the rising waves spattering him to the waist. Panting now, he stumbled up into the oaks and undergrowth of the first island, fought his way through it, finally reached the silent cove. He loosed the line of the Annie O. , dragged it as near to the cove's mouth as he could, plunged knee-deep in freezing water to give it a final shove, scrambled aboard, snatched up the boathook and punched at the rocks.\n \n As soon as the Annie O. was nosing out of the cove into the cross waves, he yanked up the sail. The freshening wind filled it and sent the sloop heeling over, with inches of white water over the lee rail, and plunging ahead.\n \n For a long while, Jack was satisfied to think of nothing but the wind and the waves and the sail and speed and danger, to have all his attention taken up balancing one against the other, so that he wouldn't have to ask himself what year it was and whether time was an illusion, and wonder about flappers and hidden traps.\n \n When he finally looked back at the island, he was amazed to see how tiny it had grown, as distant as the mainland.\n \n Then he saw a gray motorboat astern. He watched it as it slowly overtook him. It was built like a lifeboat, with a sturdy low cabin in the bow and wheel amidship. Whoever was at the wheel had long gray hair that whipped in the wind. The longer he looked, the surer he was that it was a woman wearing a lace dress. Something that stuck up inches over the cabin flashed darkly beside her. Only when she lifted it to the roof of the cabin did it occur to him that it might be a rifle.\n \n But just then the motorboat swung around in a turn that sent waves drenching over it, and headed back toward the island. He watched it for a minute in wonder, then his attention was jolted by an angry hail.\n \n Three fishing smacks, also headed toward town, were about to cross his bow. He came around into the wind and waited with shaking sail, watching a man in a lumpy sweater shake a fist at him. Then he turned and gratefully followed the dark, wide, fanlike sterns and age-yellowed sails.\n \n \n\n \n II\n \n The exterior of Martin Kesserich's home—a weathered white cube with narrow, sharp-paned windows, topped by a cupola—was nothing like its lavish interior.\n \n In much the same way, Mrs. Kesserich clashed with the darkly gleaming furniture, persian rugs and bronze vases around her. Her shapeless black form, poised awkwardly on the edge of a huge sofa, made Jack think of a cow that had strayed into the drawing room. He wondered again how a man like Kesserich had come to marry such a creature.\n \n Yet when she lifted up her little eyes from the shadows, he had the uneasy feeling that she knew a great deal about him. The eyes were still those of a domestic animal, but of a wise one that has been watching the house a long, long while from the barnyard.\n \n \n\n \n He asked abruptly, \"Do you know anything of a girl around here named Mary Alice Pope?\"\n \n The silence lasted so long that he began to think she'd gone into some bovine trance. Then, without a word, she got up and went over to a tall cabinet. Feeling on a ledge behind it for a key, she opened a panel, opened a cardboard box inside it, took something from the box and handed him a photograph. He held it up to the failing light and sucked in his breath with surprise.\n \n It was a picture of the girl he'd met that afternoon. Same flat-bosomed dress—flowered rather than white—no bandeau, same beads. Same proud, demure expression, perhaps a bit happier.\n \n \"That is Mary Alice Pope,\" Mrs. Kesserich said in a strangely flat voice. \"She was Martin's fiancee. She was killed in a railway accident in 1933.\"\n \n The small sound of the cabinet door closing brought Jack back to reality. He realized that he no longer had the photograph. Against the gloom by the cabinet, Mrs. Kesserich's white face looked at him with what seemed a malicious eagerness.\n \n \"Sit down,\" she said, \"and I'll tell you about it.\"\n \n Without a thought as to why she hadn't asked him a single question—he was much too dazed for that—he obeyed. Mrs. Kesserich resumed her position on the edge of the sofa.\n \n \"You must understand, Mr. Barr, that Mary Alice Pope was the one love of Martin's life. He is a man of very deep and strong feelings, yet as you probably know, anything but kindly or demonstrative. Even when he first came here from Hungary with his older sisters Hani and Hilda, there was a cloak of loneliness about him—or rather about the three of them.\n \n \"Hani and Hilda were athletic outdoor women, yet fiercely proud—I don't imagine they ever spoke to anyone in America except as to a servant—and with a seething distaste for all men except Martin. They showered all their devotion on him. So of course, though Martin didn't realize it, they were consumed with jealousy when he fell in love with Mary Alice Pope. They'd thought that since he'd reached forty without marrying, he was safe.\n \n \"Mary Alice came from a pure-bred, or as a biologist would say, inbred British stock. She was very young, but very sweet, and up to a point very wise. She sensed Hani and Hilda's feelings right away and did everything she could to win them over. For instance, though she was afraid of horses, she took up horseback riding, because that was Hani and Hilda's favorite pastime. Naturally, Martin knew nothing of her fear, and naturally his sisters knew about it from the first. But—and here is where Mary's wisdom fell short—her brave gesture did not pacify them: it only increased their hatred.\n \n \"Except for his research, Martin was blind to everything but his love. It was a beautiful and yet frightening passion, an insane cherishing as narrow and intense as his sisters hatred.\"\n \n \n\n \n With a start, Jack remembered that it was Mrs. Kesserich telling him all this.\n \n She went on, \"Martin's love directed his every move. He was building a home for himself and Mary, and in his mind he was building a wonderful future for them as well—not vaguely, if you know Martin, but year by year, month by month. This winter, he'd plan, they would visit Buenos Aires, next summer they would sail down the inland passage and he would teach Mary Hungarian for their trip to Buda-Pesth the year after, where he would occupy a chair at the university for a few months ... and so on. Finally the time for their marriage drew near. Martin had been away. His research was keeping him very busy—\"\n \n Jack broke in with, \"Wasn't that about the time he did his definitive work on growth and fertilization?\"\n \n Mrs. Kesserich nodded with solemn appreciation in the gathering darkness. \"But now he was coming home, his work done. It was early evening, very chilly, but Hani and Hilda felt they had to ride down to the station to meet their brother. And although she dreaded it, Mary rode with them, for she knew how delighted he would be at her cantering to the puffing train and his running up to lift her down from the saddle to welcome him home.\n \n \"Of course there was Martin's luggage to be considered, so the station wagon had to be sent down for that.\" She looked defiantly at Jack. \"I drove the station wagon. I was Martin's laboratory assistant.\"\n \n She paused. \"It was almost dark, but there was still a white cold line of sky to the west. Hani and Hilda, with Mary between them, were waiting on their horses at the top of the hill that led down to the station. The train had whistled and its headlight was graying the gravel of the crossing.\n \n \"Suddenly Mary's horse squealed and plunged down the hill. Hani and Hilda followed—to try to catch her, they said, but they didn't manage that, only kept her horse from veering off. Mary never screamed, but as her horse reared on the tracks, I saw her face in the headlight's glare.\n \n \"Martin must have guessed, or at least feared what had happened, for he was out of the train and running along the track before it stopped. In fact, he was the first to kneel down beside Mary—I mean, what had been Mary—and was holding her all bloody and shattered in his arms.\"\n \n A door slammed. There were steps in the hall. Mrs. Kesserich stiffened and was silent. Jack turned.\n \n The blur of a face hung in the doorway to the hall—a seemingly young, sensitive, suavely handsome face with aristocratic jaw. Then there was a click and the lights flared up and Jack saw the close-cropped gray hair and the lines around the eyes and nostrils, while the sensitive mouth grew sardonic. Yet the handsomeness stayed, and somehow the youth, too, or at least a tremendous inner vibrancy.\n \n \"Hello, Barr,\" Martin Kesserich said, ignoring his wife.\n \n The great biologist had come home.\n \n \n\n \n III\n \n \"Oh, yes, and Jamieson had a feeble paper on what he called individualization in marine worms. Barr, have you ever thought much about the larger aspects of the problem of individuality?\"\n \n Jack jumped slightly. He had let his thoughts wander very far.\n \n \"Not especially, sir,\" he mumbled.\n \n The house was still. A few minutes after the professor's arrival, Mrs. Kesserich had gone off with an anxious glance at Jack. He knew why and wished he could reassure her that he would not mention their conversation to the professor.\n \n Kesserich had spent perhaps a half hour briefing him on the more important papers delivered at the conferences. Then, almost as if it were a teacher's trick to show up a pupil's inattention, he had suddenly posed this question about individuality.\n \n \"You know what I mean, of course,\" Kesserich pressed. \"The factors that make you you, and me me.\"\n \n \"Heredity and environment,\" Jack parroted like a freshman.\n \n Kesserich nodded. \"Suppose—this is just speculation—that we could control heredity and environment. Then we could re-create the same individual at will.\"\n \n Jack felt a shiver go through him. \"To get exactly the same pattern of hereditary traits. That'd be far beyond us.\"\n \n \"What about identical twins?\" Kesserich pointed out. \"And then there's parthenogenesis to be considered. One might produce a duplicate of the mother without the intervention of the male.\" Although his voice had grown more idly speculative, Kesserich seemed to Jack to be smiling secretly. \"There are many examples in the lower animal forms, to say nothing of the technique by which Loeb caused a sea urchin to reproduce with no more stimulus than a salt solution.\"\n \n Jack felt the hair rising on his neck. \"Even then you wouldn't get exactly the same pattern of hereditary traits.\"\n \n \"Not if the parent were of very pure stock? Not if there were some special technique for selecting ova that would reproduce all the mother's traits?\"\n \n \"But environment would change things,\" Jack objected. \"The duplicate would be bound to develop differently.\"\n \n \"Is environment so important? Newman tells about a pair of identical twins separated from birth, unaware of each other's existence. They met by accident when they were twenty-one. Each was a telephone repairman. Each had a wife the same age. Each had a baby son. And each had a fox terrier called 'Trixie.' That's without trying to make environments similar. But suppose you did try. Suppose you saw to it that each of them had exactly the same experiences at the same times....\"\n \n For a moment it seemed to Jack that the room was dimming and wavering, becoming a dark pool in which the only motionless thing was Kesserich's sphinx-like face.\n \n \"Well, we've escaped quite far enough from Jamieson's marine worms,\" the biologist said, all brisk again. He said it as if Jack were the one who had led the conversation down wild and unprofitable channels.\n\"Let's get on to your project. I want to talk it over now, because I won't have any time for it tomorrow.\"\n \n Jack looked at him blankly.\n \n \"Tomorrow I must attend to a very important matter,\" the biologist explained.\n \n \n\n \n IV\n \n Morning sunlight brightened the colors of the wax flowers under glass on the high bureau that always seemed to emit the faint odor of old hair combings. Jack pulled back the diamond-patterned quilt and blinked the sleep from his eyes. He expected his mind to be busy wondering about Kesserich and his wife—things said and half said last night—but found instead that his thoughts swung instantly to Mary Alice Pope, as if to a farthest island in a world of people.\n \n Downstairs, the house was empty. After a long look at the cabinet—he felt behind it, but the key was gone—he hurried down to the waterfront. He stopped only for a bowl of chowder and, as an afterthought, to buy half a dozen newspapers.\n \n The sea was bright, the brisk wind just right for the Annie O. There was eagerness in the way it smacked the sail and in the creak of the mast. And when he reached the cove, it was no longer still, but nervous with faint ripples, as if time had finally begun to stir.\n \n After the same struggle with the underbrush, he came out on the rocky spine and passed the cove of the sea urchins. The spiny creatures struck an uncomfortable chord in his memory.\n \n This time he climbed the second island cautiously, scraping the innocent-seeming ground ahead of him intently with a boathook he'd brought along for the purpose. He was only a few yards from the fence when he saw Mary Alice Pope standing behind it.\n \n He hadn't realized that his heart would begin to pound or that, at the same time, a shiver of almost supernatural dread would go through him.\n \n The girl eyed him with an uneasy hostility and immediately began to speak in a hushed, hurried voice. \"You must go away at once and never come back. You're a wicked man, but I don't want you to be hurt. I've been watching for you all morning.\"\n \n He tossed the newspapers over the fence. \"You don't have to read them now,\" he told her. \"Just look at the datelines and a few of the headlines.\"\n \n When she finally lifted her eyes to his again, she was trembling. She tried unsuccessfully to speak.\n \n \"Listen to me,\" he said. \"You've been the victim of a scheme to make you believe you were born around 1916 instead of 1933, and that it's\n1933 now instead of 1951. I'm not sure why it's been done, though I think I know who you really are.\"\n \n \"But,\" the girl faltered, \"my aunts tell me it's 1933.\"\n \n \"They would.\"\n \n \"And there are the papers ... the magazines ... the radio.\"\n \n \"The papers are old ones. The radio's faked—some sort of recording. I could show you if I could get at it.\"\n \n \" These papers might be faked,\" she said, pointing to where she'd let them drop on the ground.\n \n \"They're new,\" he said. \"Only old papers get yellow.\"\n \n \"But why would they do it to me? Why? \"\n \n \"Come with me to the mainland, Mary. That'll set you straight quicker than anything.\"\n \n \"I couldn't,\" she said, drawing back. \"He's coming tonight.\"\n \n \"He?\"\n \n \"The man who sends me the boxes ... and my life.\"\n \n Jack shivered. When he spoke, his voice was rough and quick. \"A life that's completely a lie, that's cut you off from the world. Come with me, Mary.\"",
      "metadata": {
        "title": "Yesterday House",
        "author": "Fritz Leiber",
        "passage_id": "50905",
        "uid": "655389e0e71a47b8a98b993497bf141a",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "106",
                "uid": "9724c442ce6545ac9e31854ba352e9a5",
                "response_text": "Jack Barry is a biology student, who sets sail on his boat \"Annie O\". He has sailed out to the furthest island off the coast of Maine. He gets to the shore and docks his boat. He sets out to explore the island. Once he reaches the summit, he finds that there is another island, connected by a thin line of rocks to the one he is on. He climbs down the slope, onto the rocks and crosses to the other side. He arrives at a gate, which he manages to overcome. Beyond the fence is a cottage, with a lawn. The whole scene is old fashioned and slightly eerie. An elderly woman comes out of the house, gets in an old car and drives away. A pretty girl, dressed like a flapper comes out. Jack walks over to her. She asks if he is the man who sends her little boxes. She tells him she lives here with her aunts. They talk for a while, Jack telling her about his professor \" Martin Kesserich\", whom he's staying with. The girl tells Jack her name is Mary Alice Pope. She says she's never been to the mainland, and that she's never met anyone her own age, let alone a man. She explains to him that every morning she receives a little box with a gift inside, and a note, signed by \"Your Lover\". She tells him she was born in the middle of the first world war, and that the year is 1933. Jack tries to convince her that it is in fact 1951. She doesn't believe him. They hear her aunt's car returning, so Jack leaves, telling her he'll be back tomorrow. He makes his way back to the Annie O. Once at sea, he sees the chug boat of one of Mary Alice's aunts, who points what looks like a rifle at him, before turning away to go back to the island. When Jack returns to his professor's home, he asks Mrs Kesserich about Mary Alice. She informs Jack that Mary Alice was the love of her husband's life, who died in 1933. Martin arrives home, and begins a hypothetical discussion with Jack about the possibility of recreating a human being. If you could take the same DNA as the original, and put the copy in the same circumstances as the one before, they would be the same. He tells Jack that he won't be here the following day. Jack wakes up the next morning and sets off for the little island. He brings with him newspapers from the present day to try and convince Mary Alice the truth, that it is in fact 1951, and not 1933. He tells her that she has been a victim of a conspiracy to make her believe it is a different year. He asks her to come back to the mainland with her. She then tells him that she can't, as the man who sends her the boxes is coming tonight. "
              },
              {
                "worker_id": "101",
                "uid": "9f9e8b2324c64f1e88793067108c2cb9",
                "response_text": "Jack Barry is a biology student under Professor Martin Kesserich, spending the summer studying marine biology. Though he is advised not to sail to the farther islands, one day he decides to anyway, taking his sailboat to a quiet cove. As he sets foot on the island and begins to explore, he realizes that there is another island hidden behind it. Awestruck, Jack heads towards the island and comes across a barbed fence, and beyond it, a cottage. He watches as a woman dressed in a long lace dress enters a car in the driveway and drives off. He then sees a girl in a white dress come out of the cottage, holding a newspaper. Jack approaches the girl, startling her, and she asks him whether he is the man who has been sending her boxes. Jack asks the girl questions, revealing that the woman from earlier is the girl's aunt, who brings her newspapers and other things from the mainland while she remains on the island. The girl offers Jack some lemonade, and he introduces himself, and in return the girl gives her name: Mary Alice Pope. Mary reveals that Jack is the first man she has met in real life, and that though she feels loneliness, she is greeted each morning with a small box containing a gift, all addressed from her \"lover\". Upon asking when the last time Mary visited the mainland was, she says that she was born eighteen years ago, in the middle of the World War. Perplexed, Jack notices that the newspaper Mary is holding is dated 1933. He asks her about the old newspaper, but Mary believes the newspaper is recent, that the current date is 1933 and not 1953, the actual date. Inside the cottage, Jack notices an old recording playing. In a terrified panic, Jack hurries back to his ship as Mary's aunt returns, promising to be back soon. As Jack scrambles to his boat and heads back home, he notices another boat overtake him, steered by a woman resembling those back on the island, but the boat turns back around. Back at the Kesserich's place, Jack asks Mrs. Kesserich if she knows of Mary Alice Pope. Mrs. Kesserich explains that Mary Alice Pope was Martin's fiancee, who died in an accident in 1933; Martin was intensely in love with her, but his sisters disliked her, and one night while waiting for Martin to arrive by train, she fell into the tracks and was killed. Suddenly, Martin enters, eager to tell Jack about his new discoveries about recreating individuals; specifically, about how it could be achieved if you replicated environments for both individuals. Jack comes to a realization, and the next morning he hurries over to the island. He brings recent newspapers for Mary, explaining that she is being manipulated to believe that it is 1933 on purpose. Mary is reluctant and frightened, and Jack tells Mary to follow him."
              },
              {
                "worker_id": "107",
                "uid": "a2010e90befa435ab2e0b3b6a9ad664e",
                "response_text": "Jack Barry sails his boat called the Annie O into a cove. Once he is close enough to the ledge, he scrambles onshore and throws a line around a boulder. He has sailed to the farthest island out from the coast of Maine and decides to look around some more. He enjoys exploring but is surprised to see signs of human life on the island. He sees an older woman come out to drive an ancient Essex. Soon after, a younger girl in a white silk dress emerges too. Jack takes this opportunity to speak to her, and she asks if he is the one sending little boxes. When he says no and explains his reason for being on the island, she says that she and her three aunts live in the area. He tells her that he is a Biology student studying marine ecology under Professor Kesserich, the greatest living biologist. The girl introduces herself as Mary Alice Pope, and they have a conversation about why Mary must be alone all the time. She tells him that she receives boxes from and letters somebody signed ‘Your Lover’ for as long as she can remember. Jack notices that she has a paper from 1933, and she tries to convince him that it is from the day before yesterday. Mary brings him into the house to show him more proof, and he finds it extremely odd. He then leaves the island on his boat once they hear her aunts coming back. Jack then visits Mrs. Kesserich, who informs him that the original Mary Alice Pope was Martin Kesserich’s fiancee and died in an accident in 1933. She explains how his sisters, Hilda and Hani, hated her for stealing Martin away. However, when the three of them went to visit him during his research on growth and fertilization, they could not prevent Mary Alice’s death. Suddenly, Martin Kesserich comes home. Martin and Jack then have a conversation about individuality, to which the professor reveals the possibility of controlling heredity by will. Jack begins to grow concerned, but Kesserich dismisses his thoughts and changes the topic. The next day, Jack buys half a dozen newspapers when he has his clam chowder and goes back to the island to find Mary Alice. She tells him to go away quickly because he is a wicked man, but he shows her the newspapers. Although Mary Alice tries to reason, he tells her to come with him to prove that she is being made to live a lie that has cut her off from the world.\n"
              },
              {
                "worker_id": "105",
                "uid": "a4e152cba6ae4b38953e1c9277c84637",
                "response_text": "A man observes a quiet cove and a boat for a while, then he moves into the island he has disembarked on, climbs a fence and finds himself inside a huge cottage garden. He sees a woman driving away in an ancient car and then a girl with a newspaper. The stranger greets her and she is terrified as she has never seen a man or anyone except her aunts before. She takes him for someone who has been sending her boxes with some presents accompanied by a note from 'your lover'. Turns out, the girl lives with two aunts who bring her newspapers, books and movies, while she stays home and never goes to the mainland. The man introduces himself as Jack Barry and tells about his marine ecology research for a great biologist Professor Kesserich. Jack lives with the professor and his wife, who told him not to go to these islands and thus stimulated his curiosity. Mary, the girl, tells about being born eighteen years ago in the middle of World War I and startled when Jack sees a headline about Hitler in her newspaper. The girl claims this newspaper dated the year 1933 is two days old while the man knows it is the year 1953. Jack follows her into the house and hears old news on the radio and an approaching car, Mary asks him to leave. He runs towards his boat and sets sail, far away he sees a motorboat and a woman with a rifle. Back home Mrs. Kesserich tells him Mary Alice Pope was Martin Kesserich's fiance and died in a railway accident in 1933. She also shows a photo of the girl Jack met earlier that day. Martin was deeply in love with Mary and his sisters hated her for that. One day all three of them were waiting for Martin's train on their horses and Mary's rushed before the train. Suddenly, the professor returns home and his wife's story ends. The two men talk about biology and the professor brings up the topic of recreating the same individuals. Next day Jack buys modern newspapers and visits Mary. Jack proves to her that the year is 1953 and begs to come with him to the mainland. The girl insists that she has to wait for the man sending her boxes who is coming that night. Jack realizes with terror the man is the professor. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "106",
                "uid": "9724c442ce6545ac9e31854ba352e9a5",
                "response_text": "One day, Jack Barry goes to explore the little islands off the coast of Maine.  He docks his boat on the first island inside the cove, looking back through its high walls at thousands of tiny islands, dotting the blue sea, and the thin line that is Maine in the distance. Another island is revealed. It is connected to the first by a spine of rocks. At the near side of the second island is a short slope, covered in grass and trees. Beyond the trees is a huge chicken wire fence, topped with barbed wire. Beside the fence is an oak tree, with a low hanging branch. Beyond the fence is a quaint little cottage. There is a neatly mowed lawn in front of it, with a gravel driveway reaching out into the distance. There is another house on the summit of the island, a treehouse, and a chug boat moored in the bay. Jack then returns to the stark, square home of the Kesseriches. There is a solemn, cold air to the place, one that is reflected in Mrs Kesserich. The story then flashes back to the setting in which Mary Alice and Martin Kesserich lived. It is a nondescript place, but one that is open enough to ride horses in, hills sloping down onto train tracks. "
              },
              {
                "worker_id": "101",
                "uid": "9f9e8b2324c64f1e88793067108c2cb9",
                "response_text": "The beginning of the story takes place on an island far from Wood's Hole off the coast of Maine, with a quiet, narrow cove that opens into a rocky and green shore. There is another island connected to the first by a spine of rocks, and through the trees and past a fence of barbed wire there is a quaint cottage. The cottage is white with a gravel driveway, and it is decorated with dainty vintage furniture. The inside of the cottage is also decorated with old furniture, dark and brassy. The story also takes place at the Kesserich's residence, a large, lavish house."
              },
              {
                "worker_id": "107",
                "uid": "a2010e90befa435ab2e0b3b6a9ad664e",
                "response_text": "The story is initially set on an island that Jack sails to with his boat. The island has rocky ledges by the water and a little green sloop with more rocks and oaks. As he goes further, he notices another higher island that is joined by a rocky spine. The landward part of the spine houses another cove, and he even sees the spheres of sea urchins. There are also many branches of oak and a barbed mesh fence surrounding a white Cape Cod cottage. The cottage itself has a radio aerial stretched along the length of the roof. There is also a short, square-lined ancient Essex parked near the cottage too. Inside the cottage, there is solid old furniture, a small-windowed room, a fireplace, and brass andirons. When he visits Martin Kesserich’s house, it is white and weathered on the outside, with sharp-paned windows. However, the inside of the house has dark, gleaming furniture, Persian rugs, and bronze vases."
              },
              {
                "worker_id": "105",
                "uid": "a4e152cba6ae4b38953e1c9277c84637",
                "response_text": "The story begins on an island in a narrow quiet cove near the bustling Atlantic with rocks all around and a boat carried away by wind. The place is unusually quiet compared to others on Earth, surrounded with steepness at first, and going downhill further. The island is surrounded by other islands. Further into the trees there is a huge fence with barbed wire and a mown lawn, a cottage and an ancient car are inside. A woman enters the car and drives away. A girl emerges soon with a newspaper, puts it on the table and watches a squirrel on the lawn. After sitting at the table outside with glasses of lemonade, the girl and the stranger enter the house. The room is dark and small-windowed with old furniture and a fireplace. From there, Jack runs through the lawn, jumps over the fence, runs through the oaks and rocky banks towards his boat and sails to the cross waves. From the middle of the waves and the wind the island seems small. The story moves to Kesserich's house which is a simple white cube with a cupola from the outside but luxurious and dark inside. Jack talks to Mrs. Kesserich in the drawing room and then they move to the gloomy cabinet. Next day Jack wakes up in an empty house and he goes to the same island to visit Mary. The setting changes - it is no longer still, conveying the eerie mood. "
              }
            ]
          },
          {
            "question_text": "Who is Martin Kesserich, and what has happened to him in his past?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "106",
                "uid": "9724c442ce6545ac9e31854ba352e9a5",
                "response_text": "Martin Kesserich is a biologist and professor. He lives in a coastal town in Main with his wife. He has taken in Jack Barry, to live with and study under him. He moved to America long ago from Hungary with his two sisters, Hani and Hilda. In America, he meets Mary Alice Pope, a young beautiful, intelligent girl whom he falls in love with. They plan a life together. He will build a house for them to live in and raise a family in. They will travel the world together, he will teach her Hungarian. They will marry. Soon before the day they planned to be their wedding day, Martin is called away to business. He takes the train home after the journey. On his way back, Mary Alice rides on horseback with his two sisters to greet him at the station. But, as Mary Alice sits on her horse on top of a slope overlooking the train tracks, the horse becomes spooked, and gallops down to the rail. She is thrown onto the railway line. Martin sees this, and immediately throws himself out of the moving train to save her. But it's too late. Before he can reach her, she is crushed by the train. He sits, heartbroken, with her body in his hands. Years later, he marries Mrs Kesserich, whom he doesn't seem to have any affection towards, mainly ignoring each other. Treating each other with coldness and a lack of love. "
              },
              {
                "worker_id": "101",
                "uid": "9f9e8b2324c64f1e88793067108c2cb9",
                "response_text": "Martin Kesserich is a renowned biologist and professor. He has done a wide range of research and study on topics such as fertilization, heredity, and growth. Despite his success and achievement, Martin has had a rough past. Arriving to America from Hungary with his sisters, he soon fell in love with Mary Alice Pope. The two were infatuated with each other, despite his sisters, Hani and Hilda, despising Mary. One evening, Mary is killed in a railroad accident, and Martin witnesses the death of his fiancee."
              },
              {
                "worker_id": "107",
                "uid": "a2010e90befa435ab2e0b3b6a9ad664e",
                "response_text": "Martin Kesserich is a famous biologist, physiologist, and geneticist. Jack stays as a student and researches with him as well. In the past, he had come from Hungary with his two sisters Hilda and Hani. He had an intense love for Alice Mary Pope, while his sisters were greatly devoted to him. He was guided by his love and planned many things for the two of them, including travel plans to Buenos Aires, teaching Mary Hungarian to go to Buda-Pesth, and even when he will occupy a chair at the university. He eventually lost Mary Alice in a railway accident when she lost control of her horse during a ride down to the station. "
              },
              {
                "worker_id": "105",
                "uid": "a4e152cba6ae4b38953e1c9277c84637",
                "response_text": "Martin Kesserich is a great biologist, the greatest in Jack's opinion who is his student. Martin is a geneticist and a scientist in human physiology as well. In his past he came with two older sisters from Hungary to America a long time ago. He fell in a deep and all-consuming kind of love with a young girl called Mary Alice at the age of forty. By then the biologist had only two passions - his study and his love, his sisters were jealous and hated the girl. Martin was planning every day of the future together with Mary, he was building a house and approaching the time of marriage. A terrible accident happened in 1933 when he was returning from a work trip, Mary and the sisters were waiting for his train to arrive and Mary's horse rushed to the railway before the train. Mary died and Martin kneeled down before the shattered body on the track. "
              }
            ]
          },
          {
            "question_text": "What has Martin Kesserich done to cope with the loss of Mary Alice?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "106",
                "uid": "9724c442ce6545ac9e31854ba352e9a5",
                "response_text": "Kesserich devises an elaborate, maniacal scheme to cope with the loss of his beloved fiance Mary Alice Pope. He takes his dead loves ova, and through some kind of unknown science, creates a clone of Mary Alice. He brings the baby to a hidden island, in a cove with high rock walls to keep any intruders out. He creates a setting on the island to seem as if it is 1916. He builds an english cottage with a neat lawn and a eight foot high fence surrounding it to keep unwanted visitors out, and his fiancee's copy in. He employs his two sisters, who are forever devoted to him to raise the child, as if it were this time period which he has fabricated. He sends the girl notes every day, since she was first born, along with gifts like flowers. The notes are always signed with \"Your Lover\". This is all in an attempt to create an exact replica of Mary Alice, in mind, body, and spirit at the very moment he lost her. He has put her in a place made to mimic england, which she grew up in, and the time period as well. By the end of the story, the new Mary Alice is the exact age when the original died. It is Kesserich's plan to finally meet this girl, who has been closed off completely from the outside world."
              },
              {
                "worker_id": "101",
                "uid": "9f9e8b2324c64f1e88793067108c2cb9",
                "response_text": "To cope with the loss of Mary Alice, Martin Kesserich uses his scientific ability. He has been working on potentially being able to recreate another individual at will, to make an exact copy of someone else. Kesserich believes that this can be achieved through biological manipulation as well as mirroring the environment that the individual had experienced. Martin is doing this exact practice on the far out island, where the Mary Alice that Jack encountered is being made to believe that it is 1933, and that she is experiencing past events in real time. Martin is also sending Mary gifts each morning, calling him her lover, in order to manipulate Mary's life into being as close to his late fiancee as possible; Martin believes he can bring Mary Alice back to life, in a way, by recreating her."
              },
              {
                "worker_id": "107",
                "uid": "a2010e90befa435ab2e0b3b6a9ad664e",
                "response_text": "To cope with the loss of Mary Alice, Martin Kesserich is trying to create an exact duplicate of her. He indirectly reveals this in his conversation with Jack. He discusses that controlling heredity and environment can essentially allow somebody to create a duplicate individual whenever they want. This revelation means that the Mary Alice Pope, who Jack meets on the island, is the exact duplicate that Martin Kesserich tries to create by making her physically the same and controlling every aspect of her living environment. She is kept away from the mainland so that no external influences can change her from the original Mary Alice. "
              },
              {
                "worker_id": "105",
                "uid": "a4e152cba6ae4b38953e1c9277c84637",
                "response_text": "Martin Kesserich delved into the research regarding the control of heredity and environment in order to recreate an individual. He considered environment to be not as important as heredity and he recreated the hereditary traits of Mary Alice. He placed this recreation on an isolated island nearby with two women looking over her while she grew up. He married his assistant without any warm feelings and has been living with her awaiting for the new Mary Alice to come of age. He has been sending her boxes with incredible gifts and signing 'your lover'. He made her believe she was born around 1916 and the year 1953 to be 1933 in order to recreate the environment. He even kept supplying her with the old newspapers. He wanted to meet her at the same age as the initial Mary Alice was. He never coped with the loss and put his effort and study into this recreation. \n"
              }
            ]
          },
          {
            "question_text": "Why are the newspapers such an important part of the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "106",
                "uid": "9724c442ce6545ac9e31854ba352e9a5",
                "response_text": "The newspapers are such an important part of the story because they are an indicator as to the different characters' understanding of the time period. On the island, Mary Alice is surrounded by many items and artefacts to gaslight her into thinking that the year is 1933. These include the old fashioned car and radio, which plays news from the past. The one main item used to convince her are the newspapers. Hani and Hilda, who refer to themselves as her \"aunts\", give her a new newspaper every day with the date on it. It is a way for her to keep track of the passing time, albeit incorrect. When Jack Barry sees these newspapers and exclaims that they are wrong, Mary Alice is understandably shocked, and doesn't believe him. She doesn't know that newspapers aren't supposed to be yellow, because to her, newspapers have always been yellow. They are also very important to her because even though they are false, they are her only connection to what the outside world is like, apart from the radio, film and books. They are the real time news of what is happening in the world. At the end of the story, Jack Barry takes some current newspapers, in the hopes that he can convince her that the ones she possesses are decades old, and that she is, in fact, living in 1951. She doesn't believe him at first, pointing out that the papers he has could be fake, but when he states that only old papers are yellow, it seems that she begins to believe him. "
              },
              {
                "worker_id": "101",
                "uid": "9f9e8b2324c64f1e88793067108c2cb9",
                "response_text": "The newspaper that Mary is holding when Jack first meets her is visibly old and yellowed, and dated from 1933. This newspaper is what initially makes Jack realize that something is off about Mary and the island. The newspapers are a critical part of Martin's plan in recreating his fiancee in a new individual. He delivers the old newspapers to make Mary Alice believe that the events are happening in real time. In fact, when Jack tries to explain to Mary Alice that she is being manipulated, she uses the old newspapers as her own proof that she is truly in 1933."
              },
              {
                "worker_id": "107",
                "uid": "a2010e90befa435ab2e0b3b6a9ad664e",
                "response_text": "Newspapers are an important part of the story because they reveal the lies told to Mary Alice. When she first meets Jack, she shows him the yellowed newspaper and says that it is the morning news from the day before yesterday. When Jack points out that the paper is from many years ago, she refuses to believe him and even implies that he is lying to her. The newspapers also help lead Jack to ask Mrs. Kesserich about Mary Alice Pope and why she believes she is living in 1933. Later, the newspaper from present-day that Jack buys finally convinces Mary Alice that she is living in a simulated lie. Although she is initially suspicious, he does manage to make her see the truth and question why the people around her would lie to her. "
              },
              {
                "worker_id": "105",
                "uid": "a4e152cba6ae4b38953e1c9277c84637",
                "response_text": "For the girl the newspapers are almost the only way to learn something about the world and to divert herself as she is never brought to the mainland. They are also the way Jack learns about her being tricked. He proves his point of it being the year 1953 also by bringing newspapers. Mary's newspapers are yellow which proves their age. The tool for creating the lie and the tool for destroying it is the same in the story. With the help of contemporary newspapers, Jack is able to convince the girl to believe him and to save her from deception. The whole plan of the professor is ruined mainly because of the newspapers. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5453,
        "document_length_chars": 31136
      }
    }
  ]
}