{
  "item_metadata": {
    "item_id": "50923",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "50923",
      "content": "THE SERPENT RIVER\n \n \n By Don Wilcox\n \n [Transcriber's Note: This etext was produced from Other Worlds May 1957. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n The Code was rigid—no fraternization with the peoples of other planets! Earth wanted no \"shotgun weddings\" of the worlds of space!\n \n \n \n \"Split\" Campbell and I brought our ship down to a quiet landing on the summit of a mile-wide naked rock, and I turned to the telescope for a closer view of the strange thing we had come to see.\n \n It shone, eighteen or twenty miles away, in the light of the late afternoon sun. It was a long silvery serpent-like\n \n  something\n \n that crawled slowly over the planet's surface.\n \n There was no way of guessing how large it was, at this distance. It might have been a rope rolled into shape out of a mountain—or a chain of mountains. It might have been a river of bluish-gray dough that had shaped itself into a great cable. Its diameter? If it had been a hollow tube, cities could have flowed through it upright without bending their skyscrapers. It was, to the eye, an endless rope of cloud oozing along the surface of the land. No, not cloud, for it had the compactness of solid substance.\n \n We could see it at several points among the low foothills. Even from this distance we could guess that it had been moving along its course for centuries. Moving like a sluggish snake. It followed a deep-worn path between the nearer hills and the high jagged mountains on the horizon.\n \n \n  What was it?\n \n \n \"Split\" Campbell and I had been sent here to learn the answers. Our sponsor was the well known \"EGGWE\" (the Earth-Galaxy Good Will Expeditions.) We were under the EGGWE Code. We were the first expedition to this planet, but we had come equipped with two important pieces of advance information. The Keynes-Roy roving cameras (unmanned) had brought back to the Earth choice items of fact about various parts of the universe. From these photos we knew (1) that man lived on this planet, a humanoid closely resembling the humans of the Earth; and\n(2) that a vast cylindrical \"rope\" crawled the surface of this land, continuously, endlessly.\n \n We had intentionally landed at what we guessed would be a safe distance from the rope. If it were a living thing, like a serpent, we preferred not to disturb it. If it gave off heat or poisonous gases or deadly vibrations, we meant to keep our distance. If, on the other hand, it proved to be some sort of vegetable—a vine of glacier proportions—or a river of some silvery, creamy substance—we would move in upon it gradually, gathering facts as we progressed. I could depend upon\n\"Split\" to record all observable phenomena with the accuracy of split-hairs.\n \n Split was working at the reports like a drudge at this very moment.\n \n I looked up from the telescope, expecting him to be waiting his turn eagerly. I misguessed. He didn't even glance up from his books. Rare young Campbell! Always a man of duty, never a man of impulse!\n \n \"Here Campbell, take a look at the 'rope'.\"\n \n \"Before I finish the reports, sir? If I recall our Code, Section Two, Order of Duties upon Landing: A—\"\n \n \"Forget the Code. Take a look at the rope while the sun's on it.... See it?\"\n \n \"Yes sir.\"\n \n \"Can you see it's moving? See the little clouds of dust coming up from under its belly?\"\n \n \"Yes sir. An excellent view, Captain Linden.\"\n \n \"What do you think of it, Split? Ever see a sight like that before?\"\n \n \"No sir.\"\n \n \"Well, what about it? Any comments?\"\n \n Split answered me with an enthusiastic, \"By gollies, sir!\" Then, with restraint, \"It's precisely what I expected from the photographs, sir. Any orders, sir?\"\n \n \"Relax, Split! That's the order. Relax!\"\n \n \"Thanks—thanks, Cap!\" That was his effort to sound informal, though coming from him it was strained. His training had given him an exaggerated notion of the importance of dignity and discipline.\n \n He was naturally so conscientious it was painful. And to top it all, his scientific habit of thought made him want to stop and weigh his words even when speaking of casual things such as how much sugar he required in his coffee.\n \n Needless to say, I had kidded him unmercifully over these traits. Across the millions of miles of space that we had recently traveled\n(our first voyage together) I had amused myself at his expense. I had sworn that he would find, in time, that he couldn't even trim his fingernails without calipers, or comb his hair without actually physically splitting the hairs that cropped up in the middle of the part. That was when I had nicknamed him \"Split\"—and the wide ears that stuck out from his stubble-cut blond hair had glowed with the pink of selfconsciousness. Plainly, he liked the kidding. But if I thought I could rescue him from the weight of dignity and duty, I was mistaken.\n \n Now he had turned the telescope for a view far to the right. He paused.\n \n \"What do you see?\" I asked.\n \n \"I cannot say definitely. The exact scientific classification of the object I am observing would call for more detailed scrutiny—\"\n \n \"You're seeing some sort of object?\"\n \n \"Yes sir.\"\n \n \"What sort of object?\"\n \n \"A living creature, sir—upright, wearing clothes—\"\n \n \"A\n \n  man\n \n ?\"\n \n \"To all appearances, sir—\"\n \n \"You bounder, give me that telescope!\"\n \n \n\n 2.\n \n If you have explored the weird life of many a planet, as I have, you can appreciate the deep sense of excitement that comes over me when, looking out at a new world for the first time, I see a man-like animal.\n \n Walking upright!\n \n Wearing adornments in the nature of clothing!\n \n I gazed, and my lungs filled with the breath of wonderment. A man! Across millions of miles of space—a man, like the men of the Earth.\n \n Six times before in my life of exploration I had gazed at new realms within the approachable parts of our universe, but never before had the living creatures borne such wonderful resemblance to the human life of our Earth.\n \n A man!\n \n He might have been creeping on all fours.\n \n He might have been skulking like a lesser animal.\n \n He might have been entirely naked.\n \n He was none of these—and at the very first moment of viewing him I felt a kinship toward him. Oh, he was primitive in appearance—but had my ancestors not been the same? Was this not a mirror of my own race a million years or so ago? I sensed that my own stream of life had somehow crossed with his in ages gone by. How? Who can ever know? By what faded charts of the movements through the sky will man ever be able to retrace relationships of forms of life among planets?\n \n \"Get ready to go out and meet him, Campbell,\" I said. \"He's a friend.\"\n \n Split Campbell gave me a look as if to say, Sir, you don't even know what sort of animal he is, actually, much less whether he's friendly or murderous.\n \n \"There are some things I can sense on first sight, Campbell. Take my word for it, he's a friend.\"\n \n \"I didn't say anything, sir.\"\n \n \"Good. Don't. Just get ready.\"\n \n \"We're going to go\n \n  out\n \n —?\"\n \n \"Yes,\" I said. \"Orders.\"\n \n \"And meet both of them?\" Split was at the telescope.\n \n \"Both?\" I took the instrument from him. Both! \"Well!\"\n \n \"They seem to be coming out of the ground,\" Split said. \"I see no signs of habitation, but apparently we've landed on top of an underground city—though I hasten to add that this is only an hypothesis.\"\n \n \"One's a male and the other's a female,\" I said.\n \n \"Another hypothesis,\" said Split.\n \n The late evening sunshine gave us a clear view of our two \"friends\". They were fully a mile away. Split was certain they had not seen our ship, and to this conclusion I was in agreement. They had apparently come up out of the barren rock hillside to view the sunset. I studied them through the telescope while Split checked over equipment for a hike.\n \n The man's walk was unhurried. He moved thoughtfully, one might guess. His bare chest and legs showed him to be statuesque in mold, cleanly muscled, fine of bone. His skin was almost the color of the cream-colored robe which flowed from his back, whipping lightly in the breeze. He wore a brilliant red sash about his middle, and this was matched by a red headdress that came down over his shoulders as a circular mantle.\n \n The girl stood several yards distant, watching him. This was some sort of ritual, no doubt. He was not concerned with her, but with the setting sun. Its rays were almost horizontal, knifing through a break in the distant mountain skyline. He went through some routine motions, his moving arms highlighted by the lemon-colored light of evening.\n \n The girl approached him. Two other persons appeared from somewhere back of her.... Three.... Four.... Five....\n \n \"Where do they come from?\" Split had paused in the act of checking equipment to take his turn at the telescope. If he had not done so, I might not have made a discovery. The landscape was\n \n  moving\n \n .\n \n The long shadows that I had not noticed through the telescope were a prominent part of the picture I saw through the ship's window when I looked out across the scene with the naked eye. The shadows were moving.\n \n They were tree shadows. They were moving toward the clearing where the crowd gathered. And the reason for their movement was that the trees themselves were moving.\n \n \"Notice anything?\" I asked Split.\n \n \"The crowd is growing. We've certainly landed on top of a city.\" He gazed. \"They're coming from underground.\"\n \n Looking through the telescope, obviously he didn't catch the view of the moving trees.\n \n \"Notice anything else unusual?\" I persisted.\n \n \"Yes. The females—I'm speaking hypothetically—but they\n \n  must\n \n be females—are all wearing puffy white fur ornaments around their elbows. I wonder why?\"\n \n \"You haven't noticed the trees?\"\n \n \"The females are quite attractive,\" said Split.\n \n I forgot about the moving trees, then, and took over the telescope. Mobile trees were not new to me. I had seen similar vegetation on other planets—\"sponge-trees\"—which possessed a sort of muscular quality. If these were similar, they were no doubt feeding along the surface of the slope below the rocky plateau. The people in the clearing beyond paid no attention to them.\n \n I studied the crowd of people. Only the leader wore the brilliant garb. The others were more scantily clothed. All were handsome of build. The lemon-tinted sunlight glanced off the muscular shoulders of the males and the soft curves of the females.\n \n \"Those furry elbow ornaments on the females,\" I said to Split,\n\"they're for protection. The caves they live in must be narrow, so they pad their elbows.\"\n \n \"Why don't they pad their shoulders? They don't have anything on their shoulders.\"\n \n \"Are you complaining?\"\n \n We became fascinated in watching, from the seclusion of our ship. If we were to walk out, or make any sounds, we might have interrupted their meeting. Here they were in their native ritual of sunset, not knowing that people from another world watched. The tall leader must be making a speech. They sat around him in little huddles. He moved his arms in calm, graceful gestures.\n \n \"They'd better break it up!\" Split said suddenly. \"The jungles are moving in on them.\"\n \n \"They're spellbound,\" I said. \"They're used to sponge-trees. Didn't you ever see moving trees?\"\n \n Split said sharply, \"Those trees are marching! They're an army under cover. Look!\"\n \n I saw, then. The whole line of advancing vegetation was camouflage for a sneak attack. And all those natives sitting around in meeting were as innocent as a flock of sitting ducks. Split Campbell's voice was edged with alarm. \"Captain! Those worshippers—how can we warn them? Oh-oh! Too late. Look!\"\n \n All at once the advancing sponge-trees were tossed back over the heads of the savage band concealed within. They were warriors—fifty or more of them—with painted naked bodies. They dashed forward in a wide semicircle, swinging crude weapons, bent on slaughter.\n \n \n\n 3.\n \n They were waving short clubs or whips with stones tied to the ends. They charged up the slope, about sixty yards, swinging their weird clubs with a threat of death.\n \n Wild disorder suddenly struck the audience. Campbell and I believed we were about to witness a massacre.\n \n \"Captain—\n \n  Jim\n \n ! You're not going to let this happen!\"\n \n Our sympathies had gone to the first groups, the peaceable ones. I had the same impulse as Campbell—to do something—anything! Yet here we sat in our ship, more than half a mile from our thirty-five or forty\n\"friends\" in danger.\n \n Our friends were panicked. But they didn't take flight. They didn't duck for the holes in the rocky hilltop. Instead, they rallied and packed themselves around their tall leader. They stood, a defiant wall.\n \n \"Can we shoot a ray, Jim?\"\n \n I didn't answer. Later I would recall that Split\n \n  could\n \n drop his dignity under excitement—his \"Captain Linden\" and \"sir.\" Just now he wanted any sort of split-second order.\n \n We saw the naked warriors run out in a wide circle. They spun and weaved, they twirled their deadly clubs, they danced grotesquely. They were closing in. Closer and closer. It was all their party.\n \n \"Jim, can we shoot?\"\n \n \"Hit number sixteen, Campbell.\"\n \n Split touched the number sixteen signal.\n \n The ship's siren wailed out over the land.\n \n You could tell when the sound struck them. The circle of savage ones suddenly fell apart. The dancing broke into the wildest contortions you ever saw. As if they'd been spanked by a wave of electricity. The siren scream must have sounded like an animal cry from an unknown world. The attackers ran for the sponge-trees. The rootless jungle came to life. It jerked and jumped spasmodically down the slope. And our siren kept right on singing.\n \n \"Ready for that hike, Campbell? Give me my equipment coat.\" I got into it. I looked back to the telescope. The tall man of the party had behaved with exceptional calmness. He had turned to stare in our direction from the instant the siren sounded. He could no doubt make out the lines of our silvery ship in the shadows. Slowly, deliberately, he marched over the hilltop toward us.\n \n Most of his party now scampered back to the safety of their hiding places in the ground. But a few—the brave ones, perhaps, or the officials of his group—came with him.\n \n \"He needs a stronger guard than that,\" Campbell grumbled.\n \n Sixteen was still wailing. \"Set it for ten minutes and come on,\" I said. Together we descended from the ship.\n \n We took into our nostrils the tangy air, breathing fiercely, at first. We slogged along over the rock surface feeling our weight to be one-and-a-third times normal. We glanced down the slope apprehensively. We didn't want any footraces. The trees, however, were still retreating. Our siren would sing on for another eight minutes. And in case of further danger, we were equipped with the standard pocket arsenal of special purpose capsule bombs.\n \n Soon we came face to face with the tall, stately old leader in the cream-and-red cloak.\n \n Split and I stood together, close enough to exchange comments against the siren's wail. Fine looking people, we observed. Smooth faces. Like the features of Earth men. These creatures could walk down any main street back home. With a bit of makeup they would pass.\n\"Notice, Captain, they have strange looking eyes.\" \"Very smooth.\"\n\"It's because they have no eyebrows ... no eye lashes.\" \"Very smooth—handsome—attractive.\"\n \n Then the siren went off.\n \n The leader stood before me, apparently unafraid. He seemed to be waiting for me to explain my presence. His group of twelve gathered in close.\n \n I had met such situations with ease before. \"EGGWE\" explorers come equipped. I held out a gift toward the leader. It was a singing medallion attached to a chain. It was disc-shaped, patterned after a large silver coin. It made music at the touch of a button. In clear, dainty bell tones it rang out its one tune, \"Trail of Stars.\"\n \n As it played I held it up for inspection. I placed it around my own neck, then offered it to the leader. I thought he was smiling. He was not overwhelmed by the \"magic\" of this gadget. He saw it for what it was, a token of friendship. There was a keenness about him that I liked. Yes, he was smiling. He bent his head forward and allowed me to place the gift around his neck.\n \n \"Tomboldo,\" he said, pointing to himself.\n \n Split and I tried to imitate his breathy accents as we repeated aloud,\n\"Tomboldo.\"\n \n We pointed to ourselves, in turn, and spoke our own names. And then, as the names of the others were pronounced, we tried to memorize each breathy sound that was uttered. I was able to remember four or five of them. One was Gravgak.\n \n Gravgak's piercing eyes caused me to notice him. Suspicious eyes? I did not know these people's expressions well enough to be sure.\n \n Gravgak was a guard, tall and muscular, whose arms and legs were painted with green and black diamond designs.\n \n By motions and words we didn't understand, we inferred that we were invited to accompany the party back home, inside the hill, where we would be safe. I nodded to Campbell. \"It's our chance to be guests of Tomboldo.\" Nothing could have pleased us more. For our big purpose—to understand the Serpent River—would be forwarded greatly if we could learn, through the people, what its meanings were. To analyze the river's substance, estimate its rate, its weight, its temperature, and to map its course—these facts were only a part of the information we sought. The fuller story would be to learn how the inhabitants of this planet regarded it: whether they loved or shunned it, and what legends they may have woven around it. All this knowledge would be useful when future expeditions of men from the Earth followed us (through EGGWE) for an extension of peaceful trade relationships.\n \n Tomboldo depended upon the guard Gravgak to make sure that the way was safe. Gravgak was supposed to keep an eye on the line of floating trees that had taken flight down the hillside. Danger still lurked there, we knew. And now the siren that had frightened off the attack was silent. Our ship, locked against invaders, could be forgotten. We were guests of Tomboldo.\n \n Gravgak was our guard, but he didn't work at it. He was too anxious to hear all the talk. In the excitement of our meeting, everyone ignored the growing darkness, the lurking dangers. Gravgak confronted us with agitated jabbering:\n \n \"Wollo—yeeta—vo—vandartch—vandartch! Grr—see—o—see—o—see—o!\"\n \n \"See—o—see—o—see—o,\" one of the others echoed.\n \n It began to make sense. They wanted us to repeat the siren noises. The enemy had threatened their lives. There could very well have been a wholesale slaughter. But as long as we could make the \"see—o—see—o\" we were all safe.\n \n Split and I exchanged glances. He touched his hand to the equipment jacket, to remind me we were armed with something more miraculous than a yowling siren.\n \n \"See—o—see—o—see—o!\" Others of Tomboldo's party echoed the demand. They must have seen the sponge-trees again moving toward our path.\n\"\n \n  See—o—see—o!\n \n \"\n \n Our peaceful march turned into a spasm of terror. The sponge-trees came rushing up the slope, as if borne by a sudden gust of wind. They bounced over our path, and the war party spilled out of them.\n \n Shouting. A wild swinging of clubs. And no cat-and-mouse tricks. No deliberate circling and closing in. An outright attack. Naked bodies gleaming in the semi-darkness. Arms swinging weapons, choosing the nearest victims. The luminous rocks on the ends of the clubs flashed. Shouting, screeching, hurling their clubs. The whizzing fury filled the air.\n \n I hurled a capsule bomb. It struck at the base of a bouncing sponge-tree, and blew the thing to bits.\n \n The attackers ran back into a huddle, screaming. Then they came forward, rushing defiantly.\n \n Our muscular guard, Gravgak was too bold. He had picked up one of their clubs and he ran toward their advance, and to all of Tomboldo's party it must have appeared that he was bravely rushing to his death. Yet the gesture of the club he swung so wildly could have been intended as a\n \n  warning\n \n ! It could have meant, Run back, you fools, or these strange devils will throw fire at you.\n \n I threw fire. And so did my lieutenant. He didn't wait for orders, thank goodness. He knew it was their lives or ours. Zip, zip, zip—BLANG-BLANG-BLANG! The bursts of fire at their feet ripped the rocks. The spray caught them and knocked them back. Three or four warriors in the fore ranks were torn up in the blasts. Others were flattened—and those who were able, ran.\n \n They ran, not waiting for the cover of sponge-trees. Not bothering to pick up their clubs.\n \n But the operation was not a complete success. We had suffered a serious casualty. The guard Gravgak. He had rushed out too far, and the first blast of fire and rock had knocked him down. Now Tomboldo and others of the party hovered over him.\n \n His eyes opened a little. I thought he was staring at me, drilling me with suspicion. I worked over him with medicines. The crowd around us stood back in an attitude of awe as Split and I applied ready bandages, and held a stimulant to his nostrils that made him breath back to consciousness.\n \n Suddenly he came to life. Lying there on his back, with the club still at his fingertips, he swung up on one elbow. The swift motion caused a cry of joy from the crowd. I heard a little of it—and then blacked out. For as the muscular Gravgak moved, his fingers closed over the handle of the club. It whizzed upward with him—apparently all by accident. The stone that dangled from the end of the club crashed into my head.\n \n I went into instant darkness. Darkness, and a long, long silence.\n \n \n\n 4.\n \n Vauna, the beautiful daughter of Tomboldo, came into my life during the weeks that I lay unconscious.\n \n I must have talked aloud much during those feverish hours of darkness.\n \n \"Campbell!\" I would call out of a nightmare. \"Campbell, we're about to land. Is everything set? Check the instruments again, Campbell.\"\n \n \"S-s-sh!\" The low hush of Split Campbell's voice would somehow penetrate my dream.\n \n The voices about me were soft. My dreams echoed the soft female voices of this new, strange language.\n \n \"Campbell, are you there?... Have you forgotten the Code, Campbell?\"\n \n \"Quiet, Captain.\"\n \n \"Who is it that's swabbing my face? I can't see.\"\n \n \"It's Vauna. She's smiling at you, Captain. Can't you see her?\"\n \n \"Is this the pretty one we saw through the telescope?\"\n \n \"One of them.\"\n \n \"And what of the other? There were two together. I remember—\"\n \n \"Omosla is here too. She's Vauna's attendant. We're all looking after you, Captain Linden. Did you know I performed an operation to relieve the pressure on your brain? You must get well, Captain.\" The words of Campbell came through insistently.\n \n After a silence that may have lasted for hours or days, I said,\n\"Campbell, you haven't forgot the EGGWE Code?\"\n \n \"Of course not, Captain.\"\n \n \"Section Four?\"\n \n \"Section Four,\" he repeated in a low voice, as if to pacify me and put me to sleep. \"Conduct of EGGWE agents toward native inhabitants: A, No agent shall enter into any diplomatic agreement that shall be construed as binding—\"\n \n I interrupted. \"Clause D?\"\n \n He picked it up. \"D, no agent shall enter into a marriage contract with any native.... H-m-m. You're not trying to warn me, are you, Captain Linden? Or are you warning\n \n  yourself\n \n ?\"\n \n At that moment my eyes opened a little. Swimming before my blurred vision was the face of Vauna. I did remember her—yes, she must have haunted my dreams, for now my eyes burned in an effort to define her features more clearly. This was indeed Vauna, who had been one of the party of twelve, and had walked beside her father in the face of the attack. Deep within my subconscious the image of her beautiful face and figure had lingered. I murmured a single word of answer to Campbell's question. \"Myself.\"\n \n In the hours that followed, I came to know the soft footsteps of Vauna. The caverns in which she and her father and all these Benzendella people lived were pleasantly warm and fragrant. My misty impressions of their life about me were like the first impressions of a child learning about the world into which he has been born.\n \n Sometimes I would hear Vauna and her attendant Omosla talking together. Often when Campbell would stop in this part of the cavern to inquire about me, Omosla would drop in also. She and Campbell were learning to converse in simple words. And Vauna and I—yes. If I could only avoid blacking out.\n \n I wanted to see her.\n \n So often my eyes would refuse to open. A thousand nightmares. Space ships shooting through meteor swarms. Stars like eyes. Eyes like stars. The eyes of Vauna, the daughter of Tomboldo. The sensitive stroke of Vauna's fingers, brushing my forehead, pressing my hand.\n \n I regained my health gradually.\n \n \"Are you quite awake?\" Vauna would ask me in her musical Benzendella words. \"You speak better today. Your friend Campbell has brought you more recordings of our language, so you can learn to speak more. My father is eager to talk with you. But you must sleep more. You are still weak.\"\n \n It gave me a weird sensation to awaken in the night, trying to adjust myself to my surroundings. The Benzendellas were sleep-singers. By night they murmured mysterious little songs through their sleep. Strange harmonies whispered through the caves.\n \n And if I stirred restlessly, the footsteps of Vauna might come to me through the darkness. In her sleeping garments she would come to me, faintly visible in the pink light that filtered through from some corridor. She would whisper melodious Benzendella words and tell me to go back to sleep, and I would drift into the darkness of my endless dreams.\n \n The day came when I awakened to see both Vauna and her father standing before me. Stern old Tomboldo, with his chalk-smooth face and not a hint of an eyebrow or eyelash, rapped his hand against my ribs, shook the fiber bed lightly, and smiled. From a pocket concealed in his flowing cape, he drew forth the musical watch, touched the button, and played, \"Trail of Stars.\"\n \n \"I have learned to talk,\" I said.\n \n \"You have had a long sleep.\"\n \n \"I am well again. See, I can almost walk.\" But as I started to rise, the wave of blackness warned me, and I restrained my ambition. \"I will walk soon.\"\n \n \"We will have much to talk about. Your friend has pointed to the stars and told me a strange story of your coming. We have walked around the ship. He has told me how it rides through the sky. I can hardly make myself believe.\" Tomboldo's eyes cast upward under the strong ridge of forehead where the eyebrows should have been. He was evidently trying to visualize the flight of a space ship. \"We will have much to tell each other.\"\n \n \"I hope so,\" I said. \"Campbell and I came to learn about the\n \n  serpent river\n \n .\" I resorted to my own language for the last two words, not knowing the Benzendella equivalent.\n \n  I\n \n made an eel-like motion with my arm. But they didn't understand. And before I could explain, the footsteps of other Benzendellas approached, and presently I looked around to see that quite an audience had gathered. The most prominent figure of the new group was the big muscular guard of the black and green diamond markings—Gravgak.\n \n \"You get well?\" Gravgak said to me. His eyes drilled me closely.\n \n \"I get well,\" I said.\n \n \"The blow on the head,\" he said, \"was not meant.\"\n \n I looked at him. Everyone was looking at him, and I knew this was meant to be an occasion of apology. But the light of fire in Vauna's eyes told me that she did not believe. He saw her look, and his own eyes flashed darts of defiance. With an abrupt word to me, he wheeled and started off. \"Get well!\"\n \n The crowd of men and women made way for him. But in the arched doorway he turned. \"Vauna. I am ready to speak to you alone.\"\n \n She started. I reached and barely touched her hand. She stopped. \"I will talk with you later, Gravgak.\"\n \n \"Now!\" he shouted. \"Alone.\"\n \n He stalked off. A moment later Vauna, after exchanging a word with her father, excused herself from the crowd and followed Gravgak.\n \n From the way those in the room looked, I knew this must be a dramatic moment. It was as if she had acknowledged Gravgak as her master—or her lover. He had called for her. She had followed.\n \n But her old father was still the master. He stepped toward the door.\n\"Vauna!... Gravgak!... Come back.\"\n \n (I will always wonder what might have happened if he hadn't called them! Was my distrust of Gravgak justified? Had I become merely a jealous lover—or was I right in my hunch that the tall muscular guard was a potential traitor?)\n \n Vauna reappeared at once. I believe she was glad that she had been called back.\n \n Gravgak came sullenly. At the edge of the crowd in the arched doorway he stood scowling.\n \n \"While we are together,\" old Tomboldo said quietly, looking around at the assemblage, \"I must tell you the decision of the council. Soon we will move back to the other part of the world.\"\n \n There were low murmurs of approval through the chamber.\n \n \"We will wait a few days,\" Tomboldo went on, \"until our new friend—\" he pointed to me—\"is well enough to travel. We would never leave him here to the mercy of the savage ones. He and his helper came through the sky in time to save us from being destroyed. We must never forget this kindness. When we ascend the\n \n  Kao-Wagwattl\n \n , the ever moving\n \n  rope of life\n \n , these friends shall come with us. On the back of the Kao-Wagwattl\n \n  they shall ride with us across the land\n \n .\"",
      "metadata": {
        "title": "The Serpent River",
        "author": "Don Wilcox",
        "passage_id": "50923",
        "uid": "b8771086184341ff8dbba163752e52aa",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "3",
                "uid": "3769826f6fab416d94f5cc930b54edc5",
                "response_text": "Captain Linden and his lieutenant \"Split\" Campbell make up the first manned expedition from Earth to this particular planet, aiming to investigate a large silver river on its surface. The seemingly-endless silvery strip that traveled the planet's surface was unidentifiable as of yet. They see the river-like thing early on, but Campbell spots a humanoid through his telescope--this being is much like a human man, including the fact that he wore clothing. Captain Linden decides it's time for introductions, as if he senses he can trust this being, but they watch as a female and then many other people join the first man on the surface, seemingly coming out of an underground city. Linden and Campbell think their ship is out of sight, and watch a ritual that the man is performing to the setting sun. The crowd of people continues to increase, and Linden notices that the landscape is moving: trees are shifting in the ground. He and Campbell stay in the ship and observe the various types of clothing and the ritual itself, as well as the moving trees which seemed to be moving to attack the people. They are indeed warriors starting an attack, and started swinging weapons. Linden tells Campbell to start the siren on their ship to scare away the attackers, and the first man they'd seen, presumably the leader, starts towards the ship. Once they are close enough, it is obvious that the humanoids don't have eyebrows or eye lashes. Captain Linden hands the leader a medallion that plays a song, as a token of friendship. Tomboldo, the leader, starts a round of introductions through a lot of gesturing. Linden hopes to learn about the Serpent River through the people to understand its cultural significance, and these people start to ask about the siren noises. The warriors attack again and panic ensues, pushing the humans to use weapons this time. Gravgak, the guard who had been escorting the humans, is knocked down. As Linden tries to tend to him, Gravgak knocks him out with his club. Linden is unconscious for a few weeks, and Vauna, Tomboldo's daughter, spends a lot of time by the Captian's side. Linden reminds Campbell that they weren't allowed to marry anyone from this planet, but mostly in an effort to warn himself to be careful around Vauna. He learns that these people are called the Benzendellas. Tomboldo is baffled by the technology that the humans have, but Linden is not able to communicate his questions about the Serpent River. He sees Gravgak, who apologizes for the accidental injury, but from Vauna's reaction Linden is not sure if he is telling the truth. Gravgak insists on talking to Vauna in private, but Vauna's father calls them back. It is Tomboldo's thanks to the humans that gives a glimpse into the meaning of the Serpent River: he says the humans will ride with them on the rope of life, which they call Kao-Wagwattl."
              },
              {
                "worker_id": "2",
                "uid": "015e620a75d448519691cab0a59bcb36",
                "response_text": "The story relates the experience of two agents who travel to an unnamed planet for Earth-Galaxy Good Will Expeditions (EGGWE). An unmanned camera has brought pictures from the planet back to Earth, showing two features of particular interest: 1) a human-like species, the Benzendella, living there, and 2) a rope-like, silvery undulating river. Captain Linden is the commander of the mission; his lieutenant is “Split” Campbell. After traveling millions of miles to reach the planet, the men land and use their telescope to check their surroundings before alighting from the spaceship. They see the river and the human-like beings who look like human ancestors from a million years ago. As they watch, the leader of the humans seems to perform a kind of ritual, but then, Linden notices some trees moving uphill and watches in horror as warriors toss the trees aside and launch an attack on the humans using clubs or whips with stones tied to the ends. To avert a massacre, Linden orders Campbell to hit the siren, which startles the attackers so that they retreat. Linden and Campbell then approach the people and give the leader, Tomboldo, a musical medallion on a chain. Introductions are exchanged, and some of the humans make the siren sound, indicating they want to hear it again, but the attackers return. Linden throws a capsule bomb at them, making them fall back briefly, but they quickly resume their attack. Finally, Linden and Campbell throw fire at the attackers, wounding many of them, and they retreat. One of the Benzendella men who acts as a guard, Gravgak, is injured, and Linden and Campbell treat and wrap his wounds; when they finish, they use smelling salts to rouse him, and he jumps up swinging one of the clubs he has picked up. The rock on the end of it hits Linden, causing a head injury and knocking him unconscious. While he is recuperating, Tomboldo’s daughter Vauna takes care of him, and when Linden regains consciousness, he falls in love with her and has to remind himself of Clause D of the EGGWE Code that restricts marriage between agents and natives. Gravgak visits him to say that he did not intentionally hit Linden with the rock, but Linden doubts his sincerity. Gravgak then orders Vauna to speak with him in private, but her father stops them to announce that the council has decided they will move back to the other part of their world. They will travel on the rope river and want Linden and Campbell to go with them.\n"
              },
              {
                "worker_id": "8",
                "uid": "44b068a3a8254bb48ada9259e0502c66",
                "response_text": "Captain Jim Linden and \"Split\" Campbell travel to a planet previously photographed by unmanned rovers as representatives of the EGGWE, the Earth-Galaxy Good Will Expeditions. Thier purpose is to study new planets and forge peaceful relationships with native inhabitants in order to establish trade partnerships. The Keynes-Roy cameras had captured images of humanoid natives as well as a massive, silvery \"rope\" that appeared to move along the planet's surfaces, so Linden and Campbell hope to identify the \"rope.\" They station at a safe distance from it, since they are unsure of its purpose, and, during their observations, they witness a group of native Benzendella emerge from their underground city for some kind of sunset ritual. As the group gathers around their leader--a muscular individual clothed in a cream-colored robe and red headdress--Jim and Split notice a group of trees drifting slowly over the sand towards the Benzendellas. They quickly realize the trees disguise a hostile group intending to ambush the natives. When they throw off their disguises and begin to charge, Split triggers one of the ship's sirens, and the attackers retreat back to the trees. Jim and Split walk to meet the group's leader, Tomboldo, and they offer a gift as a gesture of good will. Tomboldo has a guard, Gravgak, protect them as they make their way back to the city, and Gravgak tells them to mimic the ship's siren in order to keep the attackers at bay. However, the antagonists attack again, and Jim deploys one of his capsule bombs. Gravgak retrieves one of the attacker's clubs and runs towards them. Jim cannot decide if this is a bold move to protect the Benzendellas or a kind of warning about Jim's weapons, which would reveal Gravgak's loyalties might not be completely steadfast. When Gravgak is injured in the ensuing battle, Jim and Split revive him, and Gravgak impulsively grabs the club again and whacks Jim with it, leaving him in a state of unconsciousness. For a length of time, Jim remains in this comatose state, drifting in and out of consciousness as Split plays records of the Benzendella language and Tomboldo's daughter, Vauna, helps nurse him back to health. During this period, Jim realizes he has developed strong feelings for Vauna, and she seems to share these emotions. He tells Split to remind him of the EGGWE's Code of Conduct which bars adherents from marrying natives on planets they explore. When he awakens, Gravgak apologizes although Jim suspects the apology is insincere, and that he is either jealous of his relationship to Vauna or he is, in fact, a traitor to the Benzendellas. Tomboldo announces that because of the threat to their people, they will use the silvery \"rope of life\" called Kao-Wagwattl to find another spot to live on the planet and bring Jim and Split with them."
              },
              {
                "worker_id": "6",
                "uid": "bcdac270d027481abb1b1d7bb1da7d09",
                "response_text": "Captain Linden and his awkward and studious lieutenant “Split” Campbell arrive as the first human expedition on a strange planet. They are members of the Earth-Galaxy Good Will Expeditions (EGGWE) and Split followed their rules dutifully. Thanks to photographs, they are aware that this planet is inhabited by human-like creatures and that there is a large, serpent-like thing running through it. They land on the planet and peer through the telescope. Soon, a man and a woman rise up from the earth and stand on top of the flat, empty rock to watch the sunset. They are joined by more and more people, around 40 eventually. Split and Linden watch in awe as the leader, a man in robes and a headdress, performs some sort of ritual. Linden notices that the trees are moving towards them, nothing too unusual. He’d seen sponge-trees before on other planets. However, these trees were being used as a cover for an attack. A horde of naked warriors rushes out with clubs and circles the ceremony. Linden orders Split to hit #16, and a siren wails out from their spaceship. It shakes the warriors to their core, and they retreat. Split and Linden gather up their supplies and exit the ship. The leader, having noticed their ship during the wailing, makes his way towards them. With 10-minutes left on the wailing, Linden believes they should be safe, but they carry small bombs (specifically special-purpose capsule bombs) with them as well. \nAs they get closer, Split notices how human these creatures look, aside from the lack of eyebrows and eyelashes. Linden offers their leader a gift, a singing necklace in the shape of a coin that plays “Trail of Stars” when pressed. The leader introduces himself as Tomboldo, and each member follows. Gravgak is introduced, a large, muscular alien covered in green and black painted diamonds, and he is tasked with protecting Linden and Split. Tomboldo invites them underground, where they can speak safely. They agree, needing to know more about the Serpent River. \nThey start wailing, just like the siren, in the hopes that it would keep the attackers at bay. However, the sponge-trees started moving again and danger struck. Linden and Split threw their bombs at the warriors and took them down, but not quick enough. Gravgak was injured and lay on the ground. Split and Linden bandaged him, and when he woke up, he “accidentally” hit Linden over the head with his club. \nLinden is taken care of by Vauna, Tomboldo’s daughter, and her assistant, Omosla. He was very injured, even needing surgery performed by Split. Eventually, his health is restored and he’s caught feelings for Vauna, despite Section Four Clause D of the conduct of EGGWE. Vauna and Gravgak are potentially in a relationship, but Tomboldo does not approve. The Benzendella are sleep-singers and their song echoes in the night. Tomboldo invites Linden and Split to accompany his people on a journey to safety aboard the Kao-Wagwattl, or the Serpent River. "
              }
            ]
          },
          {
            "question_text": "Who is Gravgak and what is his importance to the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "3",
                "uid": "3769826f6fab416d94f5cc930b54edc5",
                "response_text": "Gravgak is a guard who serves under Tomboldo, the leader of the Benzendella people, and escorts the humans after they meet. He is tall and muscular, with piercing eyes, and his limbs are painted with diamonds in green and black. He is knocked down during the second attack, and when Linden tries to tend to him, Gravgak knocks him out with his club. After Linden comes to a few weeks later, Gravgak apologizes for accidentally knocking him out, but it's not clear if he is being sincere about it being an accident. Linden's suspicions primarily come from Vauna's reaction, but Gravgak seems to hold some power over Vauna and Linden is not able to learn what Gravgak's true intentions are. "
              },
              {
                "worker_id": "2",
                "uid": "015e620a75d448519691cab0a59bcb36",
                "response_text": "Gravgak is one of the native Benzendella people. He is a tall guard with green and black diamonds painted on his legs. Tomboldo, the leader of the Benzendella, relies on Gravgak to make sure the group can travel safely to their dwellings after the initial attack, but Gravgak is more interested in the siren and trying to communicate with Linden and Campbell. When the sponge-tree warriors regroup and attack again, he grabs one of their clubs and confronts them as they advance—either rushing to fight them or to warn them to back away. When Linden and Campbell throw fire at the enemy, he is so close that the fire and blasts of rock knock him down. He looks suspiciously at Linden as he and Campbell minister to his wounds and use smelling salts to make Gravgak fully conscious, making him jump up while holding the club and sending the rock attached to the club flying into Linden’s head. Several days later after Linden comes to, Gravgak comes to see him and tells him the blow to Linden’s head was not intentional. Vauna appears not to believe him. As Gravgak leaves, he tells Vauna he wants to speak to her alone. Linden stops her until Gravgak yells at her, and she starts to leave with him; this time, her father stops them. Linden wonders if Gravgak and Vauna have a relationship, but he also considers the possibility that Gravgak is a traitor.   \n\n"
              },
              {
                "worker_id": "8",
                "uid": "44b068a3a8254bb48ada9259e0502c66",
                "response_text": "Gravgak is one of Tomboldo's most important guards. He is tall and muscular, and his legs and arms are covered with green and black diamond paintings. Jim notices his eyes first, which appear piercing and suspicious to him, and Gravgak continues to arouse his suspicions throughout the story. Gravgak keeps watch for the tree-disguised warriors and guards Jim and Split on their way back to the underground city. However, he shows signs of agitation and distraction and commands the two men to mimic the siren sounds along with the rest of Tomboldo's party. When the attackers once again descend upon their party and Jim throws a capsule bomb at them, Gravgak retrieves one of their clubs and charges. Jim interprets this behavior to mean one of two things--either Gravgak bravely defends his people or he intends to warn the attackers of Jim and Split's advanced weaponry. After another of Jim's capsule bombs injures Gravgak, Jim and Split attempt to attend to his wounds and resuscitate him. When he regains consciousness, he clubs Jim and knocks him out. After Jim recovers, Gravgak visits him to apologize, but Jim isn't sure if the attack was accidental, especially because Vauna doesn't seem to trust Gravgak. Vauna appears to be in some kind of relationship with Gravgak, whether as a lover or some kind of subservient. While this is not completely clear to Jim, he is certain that Vauna's distrust of Gravgak strengthens his feeling that Gravgak is a traitor."
              },
              {
                "worker_id": "6",
                "uid": "bcdac270d027481abb1b1d7bb1da7d09",
                "response_text": "Gravgak is one of the main sources of conflict and betrayal in this story. Gravgak is a very large warrior of the Benzendella people. He is strong and muscular. His arms and legs are painted with green and black diamonds. When Captain Linden first meets him, he describes Gravgak’s piercing eyes as suspicious. His motives are never truly known, but his actions betray him. \nAfter Linden and Split meet Tomboldo, Gravgak is sent to guard them. He rushes into battle and gets injured. Linden and Split heal him, but when he wakes up, he hits Linden over the head with a club. Whether or not he did that on purpose is up in the air. The injury Linden sustained required surgery and days of bed rest. It could have killed him. \nOnce Linden wakes up, Gravgak returns and aggressively demands Linden to get better. He claims that he did not mean to hit him on the head, but everyone doubts his sincerity and integrity. Even Vauna, Tomboldo’s daughter and Linden’s crush, does not believe Gravgak. However, she is bound to him in some way, perhaps by marriage, but her father comes first. Possibly a traitor, Linden will forever question Gravgak’s actions. \n"
              }
            ]
          },
          {
            "question_text": "What is the significance of the siren?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "3",
                "uid": "3769826f6fab416d94f5cc930b54edc5",
                "response_text": "When Linden and Campbell arrive at the planet, they are primarily interested in the snaking silver rope that travels around the continent like a river, but they notice some people seemingly coming from underground. As these people were performing a ritual, the humans noticed an impending attack from a different group, but didn't want to use weapons so they started a siren on their ship to distract the attackers. This siren did scare these attackers off for a while, and when Linden and Campbell started trying to communicate with the Benzendella people the only thing the Benzendellas could say was an imitation of the siren noise. It was this siren that saved the people from the initial attack, and thus made these people trust the humans, but was also the beginning of their attempts at communication. In an indirect way, using this siren is how the humans ended up with a chance to ask the Benzendella people about the Serpent River that they came to learn more about. "
              },
              {
                "worker_id": "2",
                "uid": "015e620a75d448519691cab0a59bcb36",
                "response_text": "Captain Linden and Split Campbell use the sirens to scare away the attackers in the sponge trees to protect the Benzendella people. Because the people on the planet don’t have advanced technology, they don’t know what causes the sound of the siren, and it startles them so much that they pull back their attack. Linden and Campbell likely avert a massacre because the attackers in the trees are armed with clubs and whips with stones tied to the ends; taking their quarry by surprise with these weapons would put them at a distinct advantage. The Benzendella were engaged in some type of ritual and were unarmed when the attackers surprised them. Once the Benzendella realize the two men were responsible for the siren that saved them from the attack, they are willing to meet them close up. When the Benzendella speak to them, they make the siren sounds and seem to want the men to cause them to sound again. When the warriors launch another attack, Linden and Campbell throw a capsule bomb at them, making them drop back again, but once again, they push forward. Linden and Campbell throw fire at the warriors, making the rock break and fly up and hit them. Some of the warriors are killed or disabled, and the rest flee. So the siren is the start of a friendship between the two men on the expedition and the native people of the planet.\n"
              },
              {
                "worker_id": "8",
                "uid": "44b068a3a8254bb48ada9259e0502c66",
                "response_text": "When the tree-disguised attackers descend upon the Benzendellas, Jim orders Split to trigger the \"number sixteen siren\", which emits a loud wail and causes the attackers to retreat. Jim and Split set the siren to ten minutes as they begin their half-mile hike to meet Tomboldo and his party. This offers them some security as they walk in addition to their stash of capsule bombs. Fearing another attack, Tomboldo and his crew of guards and officials mimic the siren sound as they make their way back to their city in order to ward off their enemies. While the legitimate siren sound keeps the attackers away, the copycat sound made by Tomboldo's people does not fool them, and they attack once more. This gives Jim the opportunity to deploy his capsule bombs, and Gravgak's actions in response lead him to further question the loyalty of Tomboldo's guard. Jim also winds up in a state of unconsciousness as a result of the attack, and this is how he meets and falls in love with Tomboldo's daughter Vauna."
              },
              {
                "worker_id": "6",
                "uid": "bcdac270d027481abb1b1d7bb1da7d09",
                "response_text": "The siren saves the lives of the Benzendella people. As the sponge-tree warriors attacked them, Captain Linden ordered Split to hit #16, the siren. The sound pierced the sunset and caused the warriors to retreat. After saving the Benzendella, Tomboldo is indebted to Linden and Split. He invites them to their home underground and eventually on a trip across the Serpent River. \nThe siren is the beginning of the relationship between the humans and the Benzendella. Their gratitude allows Linden and Split to become their friends and acquaintances. The siren also showed how vulnerable the Benzendella are to attack when on the surface of the planet. Later, the Benzedella attempt to mimic the siren in an attempt to keep the warriors at bay. \n"
              }
            ]
          },
          {
            "question_text": "Who is Captain Linden and what happens to him throughout the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "3",
                "uid": "3769826f6fab416d94f5cc930b54edc5",
                "response_text": "Captain Linden is the leader of the first manned expedition from Earth to the planet that is inhabited by the Benzendella people. His sponsorship is from the Earth-Galaxy Good Will Expeditions, \"EGGWE\" for short. Because a previous rover had discovered a mysterious silver river and some humanoid creatures, Linden and his lieutenant were sent to discover more. He hoped that interacting with the humanoids would allow him to learn some cultural significance behind what he referred to as the Serpent River, which he also planned on studying scientifically. After he landed, while Campbell was monitoring the humanoids, he noticed that trees were moving towards the people, and sensed an incoming attack. He ordered Campbell to start a siren from their ship to distract the attackers, and later led the two of them to meet the local Benzendella people. He presented their leader with a token of friendship, a medallion that played music. As another attack started, and a guard fell, Linden tried to tend to the guard but was knocked out and did not regain consciousness for a few weeks. As he slowly healed and felt more normal, he had to warn himself to be careful around Vauna, the Benzendella leader's daughter, who had been watching him at his bedside. She was very beautiful, and he knew it was against mission code to marry locals. "
              },
              {
                "worker_id": "2",
                "uid": "015e620a75d448519691cab0a59bcb36",
                "response_text": "Captain Linden is the leader of the first expedition to the planet. The trip is sponsored by the Earth-Galaxy Good Will Expeditions (EGGWE). From images brought back to Earth by a roving camera, they know that humanoids live on the planet, and there is a huge rope or serpent-like object or creature moving continuously across the surface. He and Split Campbell cautiously land a good distance from the rope-like object in case it is dangerous. Although he is in command, Linden has a good sense of humor and likes to joke with and poke fun at Split; in fact, Linden is the one who gave him his nickname. Linden allows some gray area in following the Code, for example, encouraging Campbell to look through the telescope at the rope before Campbell has finished writing his reports. After exclaiming rather unprofessionally at what he sees, Linden “orders” him to take it easy. The two men are on their first voyage together, and Linden has entertained himself on the journey of millions of miles by teasing Campbell. Linden has been to six other planets, but none of them had beings that were so similar to humans; the ones on the current planet look like the human ancestors from one million years ago, and Linden is very excited about this. Linden senses that the humanoids are friendly and trusts his intuition; this is why he decides to help them when the other group attacks them. He tries to befriend the leader by offering him a singing medallion on a chain, but what really impresses them is the way he and Campbell help them when the attackers return. After the battle, Linden is hit in the head by a rock attached to the club that Gravgak used when Gravgak jumps up after being roused to consciousness. Linden suffers a head injury and is unconscious for several days. While he is recuperating, the humanoid leader’s daughter Vauna cares for him, and he falls in love with her. Linden reminds Campbell of Clause D of the EGGWE Code, which states that none of their agents can marry a native but then admits he is reminding himself of this, not Campbell. When Gravgak states he is ready to talk to Vauna alone, Linden reaches for her hand, letting her know his feelings about her. Her father orders them to come back to the group, and when Tomboldo announces the group is ready to move back to the other part of the world, he invites Linden and Campbell to go with them.\n"
              },
              {
                "worker_id": "8",
                "uid": "44b068a3a8254bb48ada9259e0502c66",
                "response_text": "Captain Jim Linden leads a fact-finding mission on behalf of the EGGWE to discover the identity of a large, silvery, rope-like entity on a planet earmarked for the establishment of an inter-planetary trade agreement. Jim and his partner Split work together to observe the object, and, while doing so, they meet the local people called the Benzendella. Jim is a calm and effective leader; he has captained six similar missions in the past and is experienced in interacting with native populations in order to establish strong relationships for the EGGWE. This experience comes to bear when a hostile group attacks the Benzendellas, and Jim uses this as an opportunity to assist them with his ship's siren. This interaction establishes trust with the Benzendellas, and he moves to deepen that trust by giving a peace gift-- a music-playing medallion. After Jim and Split help save the Benzendellas from a second attack and revive Gravgak when he is wounded, the Benzendellas provide Jim and Split a place to stay as Jim recovers from his own injury. During his state of unconsciousness, Jim learns the Benzendella language and falls in love with Vauna, Tomboldo's daughter."
              },
              {
                "worker_id": "6",
                "uid": "bcdac270d027481abb1b1d7bb1da7d09",
                "response_text": "Captain Linden is a member of the Earth-Galaxy Good Will Expeditions (EGGWE) and Lieteuant “Split” Campbell’s superior officer. He is a confident man and loves teasing Split. After having been on one expedition before, Linden and Split were ready to arrive on this planet and investigate the Serpent River. As they look out at the seemingly-barren world through their telescope, Linden notices people emerging from underground. He watches in awe as they all gather around one man and a woman, seemingly about to perform some sort of ritual. The shadows of the trees move, but he sees nothing abnormal about this. Warriors rush out of the trees to attack the Benzendella, so Captian Linden saves them by having Split press the siren button, #16. He uses the EGGWE code of conduct when addressing the leader, Tomboldo, and offers him a gift. They are invited underground to their home but are attacked by the warriors again before they can descend. Gravgak is injured, so Linden and Split try to take care of him. When he awakens, he smashes his club into Linden’s head, possibly on purpose. \nLinden wakes, days later, underground with Vauna by his side. Vauna is Tomboldo’s daughter, and Linden quickly develops feelings for her. The EGGWE code forbids its members to marry any natives, and he reminds himself of that. \nHe speaks with Tomboldo and Gravgak, the latter of which explains that it was an accident, though the look in his eyes and his tone of voice says otherwise. Tomboldo invites Linden and Split to join them on their journey aboard the Serpent River, as they travel across the planet looking for safety. \n"
              }
            ]
          },
          {
            "question_text": "Describe the relationship between Captain Linden and his lieutenant \"Split\" Campbell",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "3",
                "uid": "3769826f6fab416d94f5cc930b54edc5",
                "response_text": "Linden is a fairly relaxed captain who is ready to perform his mission to code, but is almost amused at his lieutenant's inability to stray from code. He calls Campbell \"Split\" because he does everything so by-the-book that if he were combing his hair down the middle, he wouldn't be surprised if he split the hairs in the middle of his head for perfect symmetry. They seem to work well together, and Campbell is dedicated to his scientific mission and reviewing reports, while Linden reminds him to look at the window at the world around them, which offers a nice balance to their progress. Campbell clearly respects Linden a lot, and Linden is always kind to him and not rude or condescending, which is important for team cohesion on a mission away from a home planet. "
              },
              {
                "worker_id": "2",
                "uid": "015e620a75d448519691cab0a59bcb36",
                "response_text": "Captain Linden is the senior commanding officer of Lieutenant Split Campbell; however, Campbell is a much more by-the-book military man than Linden is. Linden has a sense of humor and enjoys teasing Campbell about his strict adherence to military standards and codes. He gives Campbell the nickname “Split” because of Campbell’s extreme attention to detail and teases that Campbell will split the hairs that pop up when he parts his hair. Linden wishes Campbell would lighten up a little and even orders him to relax. At the same time, Linden also knows that he can depend on Campbell to fulfill his duties. When the two agents witness the “trees” moving toward the group of humanoids and realize they are actually warriors launching an attack, Split addresses Linden first as “Captain” and then as “Jim” as he worries about the group about to be attacked. Linden notices this and realizes that Split’s formality drops when he is excited. The two men work well together, and Campbell seems to know what Linden wants from him without needing any orders. When Linden suffers a head injury after being hit by a rock, Campbell performs the surgery that relieves the pressure on his brain; he tells Linden he must get well, as if Campbell is counting on Linden both as a friend and an officer. As Linden realizes he is falling in love with Vauna, he reminds Campbell of the EGGWE Code Clause D, which prevents agents from marrying natives, and Campbell asks whether Linden is warning Campbell or himself. Campbell seems to be speaking to him as a friend by acknowledging that Linden has feelings for Vauna. At the same time, Campbell addresses Linden as “Captain,” showing that their friendship does not place them on equal standing even though they are close enough to call each other by their first names.\n\n"
              },
              {
                "worker_id": "8",
                "uid": "44b068a3a8254bb48ada9259e0502c66",
                "response_text": "Jim gives Campbell the nickname \"Split\" because of his meticulous attention to detail and his need for order in life. Split memorizes the EGGWE code and recites relevant sections throughout the story such as when Jim asks him to recall the clause about the ban on marrying any natives whom agents might encounter during inter-planetary expeditions. After Gravgak clubs Jim, Split performs surgery on him during his state of unconsciousness in order to relieve pressure on his brain and even brings him recordings of the Benzendella language so that he can learn to speak while he gathers his strength. Split also communicates with Omosla and Tomboldo during Jim's coma-like state, so that he can learn more about the Benzendella people and share about the purpose of their own expedition. Jim’s more spontaneous, empathetic approach to leadership complements Split’s rigid commitment to rules, and this makes them a strong and effective team."
              },
              {
                "worker_id": "6",
                "uid": "bcdac270d027481abb1b1d7bb1da7d09",
                "response_text": "Captain Linden and Lieutenant “Split” Campbell have developed a very friendly relationship over the course of their two expeditions. Linden even nicknamed Lieutenant Campbell “Split” for his diligent and dutiful ways. Linden constantly teases Split and pushes him to think outside the box and outside the EGGWE’s code of conduct. They can easily rely on each other, as can be seen in battle and underground. Split throws his bombs when being attacked by the warriors, even though Linden didn’t order him to do so. Despite being a very diligent traveler, he recognizes that in times of crisis it’s better to just act. As well, when Linden was gravely injured by Gravgak, Linden performs surgery to relieve the pressure on his brain and help him heal quicker."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5104,
        "document_length_chars": 29709
      }
    }
  ]
}