{
  "item_metadata": {
    "item_id": "50969",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "50969",
      "content": "BIG ANCESTOR\n \n \n By F. L. WALLACE\n \n Illustrated by EMSH\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction November 1954. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n Man's family tree was awesome enough to give every galactic race an inferiority complex—but then he tried to climb it!\n \n\n \n In repose, Taphetta the Ribboneer resembled a fancy giant bow on a package. His four flat legs looped out and in, the ends tucked under his wide, thin body, which constituted the knot at the middle. His neck was flat, too, arching out in another loop. Of all his features, only his head had appreciable thickness and it was crowned with a dozen long though narrower ribbons.\n \n Taphetta rattled the head fronds together in a surprisingly good imitation of speech. \"Yes, I've heard the legend.\"\n \n \"It's more than a legend,\" said Sam Halden, biologist. The reaction was not unexpected—non-humans tended to dismiss the data as convenient speculation and nothing more. \"There are at least a hundred kinds of humans, each supposedly originating in strict seclusion on as many widely scattered planets. Obviously there was no contact throughout the ages before space travel— and yet each planetary race can interbreed with a minimum of ten others ! That's more than a legend—one hell of a lot more!\"\n \n \"It is impressive,\" admitted Taphetta. \"But I find it mildly distasteful to consider mating with someone who does not belong to my species.\"\n \n \"That's because you're unique,\" said Halden. \"Outside of your own world, there's nothing like your species, except superficially, and that's true of all other creatures, intelligent or not, with the sole exception of mankind. Actually, the four of us here, though it's accidental, very nearly represent the biological spectrum of human development.\n \n \n\n \n \"Emmer, a Neanderthal type and our archeologist, is around the beginning of the scale. I'm from Earth, near the middle, though on Emmer's side. Meredith, linguist, is on the other side of the middle. And beyond her, toward the far end, is Kelburn, mathematician. There's a corresponding span of fertility. Emmer just misses being able to breed with my kind, but there's a fair chance that I'd be fertile with Meredith and a similar though lesser chance that her fertility may extend to Kelburn.\"\n \n \n\n \n Taphetta rustled his speech ribbons quizzically. \"But I thought it was proved that some humans did originate on one planet, that there was an unbroken line of evolution that could be traced back a billion years.\"\n \n \"You're thinking of Earth,\" said Halden. \"Humans require a certain kind of planet. It's reasonable to assume that, if men were set down on a hundred such worlds, they'd seem to fit in with native life-forms on a few of them. That's what happened on Earth; when Man arrived, there was actually a manlike creature there. Naturally our early evolutionists stretched their theories to cover the facts they had.\n \n \"But there are other worlds in which humans who were there before the Stone Age aren't related to anything else there. We have to conclude that Man didn't originate on any of the planets on which he is now found. Instead, he evolved elsewhere and later was scattered throughout this section of the Milky Way.\"\n \n \"And so, to account for the unique race that can interbreed across thousands of light-years, you've brought in the big ancestor,\" commented Taphetta dryly. \"It seems an unnecessary simplification.\"\n \n \"Can you think of a better explanation?\" asked Kelburn.\n \n \"Something had to distribute one species so widely and it's not the result of parallel evolution—not when a hundred human races are involved, and only the human race.\"\n \n \"I can't think of a better explanation.\" Taphetta rearranged his ribbons. \"Frankly, no one else is much interested in Man's theories about himself.\"\n \n It was easy to understand the attitude. Man was the most numerous though not always the most advanced—Ribboneers had a civilization as high as anything in the known section of the Milky Way, and there were others—and humans were more than a little feared. If they ever got together—but they hadn't except in agreement as to their common origin.\n \n Still, Taphetta the Ribboneer was an experienced pilot and could be very useful. A clear statement of their position was essential in helping him make up his mind. \"You've heard of the adjacency mating principle?\" asked Sam Halden.\n \n \"Vaguely. Most people have if they've been around men.\"\n \n \"We've got new data and are able to interpret it better. The theory is that humans who can mate with each other were once physically close. We've got a list of all our races arranged in sequence. If planetary race F can mate with race E back to A and forward to M, and race G is fertile only back to B, but forward to O, then we assume that whatever their positions are now, at once time G was actually adjacent to F, but was a little further along. When we project back into time those star systems on which humans existed prior to space travel, we get a certain pattern. Kelburn can explain it to you.\"\n \n The normally pink body of the Ribboneer flushed slightly. The color change was almost imperceptible, but it was enough to indicate that he was interested.\n \n \n\n \n Kelburn went to the projector. \"It would be easier if we knew all the stars in the Milky Way, but though we've explored only a small portion of it, we can reconstruct a fairly accurate representation of the past.\"\n \n He pressed the controls and stars twinkled on the screen. \"We're looking down on the plane of the Galaxy. This is one arm of it as it is today and here are the human systems.\" He pressed another control and, for purposes of identification, certain stars became more brilliant. There was no pattern, merely a scattering of stars. \"The whole Milky Way is rotating. And while stars in a given region tend to remain together, there's also a random motion. Here's what happens when we calculate the positions of stars in the past.\"\n \n Flecks of light shifted and flowed across the screen. Kelburn stopped the motion.\n \n \"Two hundred thousand years ago,\" he said.\n \n There was a pattern of the identified stars. They were spaced at fairly equal intervals along a regular curve, a horseshoe loop that didn't close, though if the ends were extended, the lines would have crossed.\n \n Taphetta rustled. \"The math is accurate?\"\n \n \"As accurate as it can be with a million-plus body problem.\"\n \n \"And that's the hypothetical route of the unknown ancestor?\"\n \n \"To the best of our knowledge,\" said Kelburn. \"And whereas there are humans who are relatively near and not fertile, they can always mate with those they were adjacent to two hundred thousand years ago !\"\n \n \"The adjacency mating principle. I've never seen it demonstrated,\" murmured Taphetta, flexing his ribbons. \"Is that the only era that satisfies the calculations?\"\n \n \"Plus or minus a hundred thousand years, we can still get something that might be the path of a spaceship attempting to cover a representative section of territory,\" said Kelburn. \"However, we have other ways of dating it. On some worlds on which there are no other mammals, we're able to place the first human fossils chronologically. The evidence is sometimes contradictory, but we believe we've got the time right.\"\n \n Taphetta waved a ribbon at the chart. \"And you think that where the two ends of the curve cross is your original home?\"\n \n \"We think so,\" said Kelburn. \"We've narrowed it down to several cubic light-years—then. Now it's far more. And, of course, if it were a fast-moving star, it might be completely out of the field of our exploration. But we're certain we've got a good chance of finding it this trip.\"\n \n \"It seems I must decide quickly.\" The Ribboneer glanced out the visionport, where another ship hung motionless in space beside them.\n\"Do you mind if I ask other questions?\"\n \n \"Go ahead,\" Kelburn invited sardonically. \"But if it's not math, you'd better ask Halden. He's the leader of the expedition.\"\n \n Halden flushed; the sarcasm wasn't necessary. It was true that Kelburn was the most advanced human type present, but while there were differences, biological and in the scale of intelligence, it wasn't as great as once was thought. Anyway, non-humans weren't trained in the fine distinctions that men made among themselves. And, higher or lower, he was as good a biologist as the other was a mathematician. And there was the matter of training; he'd been on several expeditions and this was Kelburn's first trip. Damn it, he thought, that rated some respect.\n \n The Ribboneer shifted his attention. \"Aside from the sudden illness of your pilot, why did you ask for me?\"\n \n \"We didn't. The man became sick and required treatment we can't give him. Luckily, a ship was passing and we hailed it because it's four months to the nearest planet. They consented to take him back and told us that there was a passenger on board who was an experienced pilot. We have men who could do the job in a makeshift fashion, but the region we're heading for, while mapped, is largely unknown. We'd prefer to have an expert—and Ribboneers are famous for their navigational ability.\"\n \n Taphetta crinkled politely at the reference to his skill. \"I had other plans, but I can't evade professional obligations, and an emergency such as this should cancel out any previous agreements. Still, what are the incentives?\"\n \n Sam Halden coughed. \"The usual, plus a little extra. We've copied the Ribboneer's standard nature, simplifying it a little and adding a per cent here and there for the crew pilot and scientist's share of the profits from any discoveries we may make.\"\n \n \"I'm complimented that you like our contract so well,\" said Taphetta,\n\"but I really must have our own unsimplified version. If you want me, you'll take my contract. I came prepared.\" He extended a tightly bound roll that he had kept somewhere on his person.\n \n They glanced at one another as Halden took it.\n \n \"You can read it if you want,\" offered Taphetta. \"But it will take you all day—it's micro-printing. However, you needn't be afraid that I'm defrauding you. It's honored everywhere we go and we go nearly everywhere in this sector—places men have never been.\"\n \n There was no choice if they wanted him, and they did. Besides, the integrity of Ribboneers was not to be questioned. Halden signed.\n \n \"Good.\" Taphetta crinkled. \"Send it to the ship; they'll forward it for me. And you can tell the ship to go on without me.\" He rubbed his ribbons together. \"Now if you'll get me the charts, I'll examine the region toward which we're heading.\"\n \n \n\n \n Firmon of hydroponics slouched in, a tall man with scanty hair and an equal lack of grace. He seemed to have difficulty in taking his eyes off Meredith, though, since he was a notch or so above her in the mating scale, he shouldn't have been so interested. But his planet had been inexplicably slow in developing and he wasn't completely aware of his place in the human hierarchy.\n \n Disdainfully, Meredith adjusted a skirt that, a few inches shorter, wouldn't have been a skirt at all, revealing, while doing so, just how long and beautiful a woman's legs could be. Her people had never given much thought to physical modesty and, with legs like that, it was easy to see why.\n \n Muttering something about primitive women, Firmon turned to the biologist. \"The pilot doesn't like our air.\"\n \n \"Then change it to suit him. He's in charge of the ship and knows more about these things than I do.\"\n \n \"More than a man?\" Firmon leered at Meredith and, when she failed to smile, added plaintively, \"I did try to change it, but he still complains.\"\n \n \n\n \n Halden took a deep breath. \"Seems all right to me.\"\n \n \"To everybody else, too, but the tapeworm hasn't got lungs. He breathes through a million tubes scattered over his body.\"\n \n It would do no good to explain that Taphetta wasn't a worm, that his evolution had taken a different course, but that he was in no sense less complex than Man. It was a paradox that some biologically higher humans hadn't developed as much as lower races and actually weren't prepared for the multitude of life-forms they'd meet in space. Firmon's reaction was quite typical.\n \n \"If he asks for cleaner air, it's because his system needs it,\" said Halden. \"Do anything you can to give it to him.\"\n \n \"Can't. This is as good as I can get it. Taphetta thought you could do something about it.\"\n \n \"Hydroponics is your job. There's nothing I can do.\" Halden paused thoughtfully. \"Is there something wrong with the plants?\"\n \n \"In a way, I guess, and yet not really.\"\n \n \"What is it, some kind of toxic condition?\"\n \n \"The plants are healthy enough, but something's chewing them down as fast as they grow.\"\n \n \"Insects? There shouldn't be any, but if there are, we've got sprays. Use them.\"\n \n \"It's an animal,\" said Firmon. \"We tried poison and got a few, but now they won't touch the stuff. I had electronics rig up some traps. The animals seem to know what they are and we've never caught one that way.\"\n \n Halden glowered at the man. \"How long has this been going on?\"\n \n \"About three months. It's not bad; we can keep up with them.\"\n \n It was probably nothing to become alarmed at, but an animal on the ship was a nuisance, doubly so because of their pilot.\n \n \"Tell me what you know about it,\" said Halden.\n \n \"They're little things.\" Firmon held out his hands to show how small.\n\"I don't know how they got on, but once they did, there were plenty of places to hide.\" He looked up defensively. \"This is an old ship with new equipment and they hide under the machinery. There's nothing we can do except rebuild the ship from the hull inward.\"\n \n Firmon was right. The new equipment had been installed in any place just to get it in and now there were inaccessible corners and crevices everywhere that couldn't be closed off without rebuilding.\n \n They couldn't set up a continuous watch and shoot the animals down because there weren't that many men to spare. Besides, the use of weapons in hydroponics would cause more damage to the thing they were trying to protect than to the pest. He'd have to devise other ways.\n \n Sam Halden got up. \"I'll take a look and see what I can do.\"\n \n \"I'll come along and help,\" said Meredith, untwining her legs and leaning against him. \"Your mistress ought to have some sort of privileges.\"\n \n Halden started. So she knew that the crew was calling her that! Perhaps it was intended to discourage Firmon, but he wished she hadn't said it. It didn't help the situation at all.\n \n \n\n \n Taphetta sat in a chair designed for humans. With a less flexible body, he wouldn't have fitted. Maybe it wasn't sitting, but his flat legs were folded neatly around the arms and his head rested comfortably on the seat. The head ribbons, which were his hands and voice, were never quite still.\n \n He looked from Halden to Emmer and back again. \"The hydroponics tech tells me you're contemplating an experiment. I don't like it.\"\n \n Halden shrugged. \"We've got to have better air. It might work.\"\n \n \"Pests on the ship? It's filthy! My people would never tolerate it!\"\n \n \"Neither do we.\"\n \n The Ribboneer's distaste subsided. \"What kind of creatures are they?\"\n \n \"I have a description, though I've never seen one. It's a small four-legged animal with two antennae at the lower base of its skull. A typical pest.\"\n \n Taphetta rustled. \"Have you found out how it got on?\"\n \n \"It was probably brought in with the supplies,\" said the biologist.\n\"Considering how far we've come, it may have been any one of a half a dozen planets. Anyway, it hid, and since most of the places it had access to were near the outer hull, it got an extra dose of hard radiation, or it may have nested near the atomic engines; both are possibilities. Either way, it mutated, became a different animal. It's developed a tolerance for the poisons we spray on plants. Other things it detects and avoids, even electronic traps.\"\n \n \"Then you believe it changed mentally as well as physically, that it's smarter?\"\n \n \"I'd say that, yes. It must be a fairly intelligent creature to be so hard to get rid of. But it can be lured into traps, if the bait's strong enough.\"\n \n \"That's what I don't like,\" said Taphetta, curling. \"Let me think it over while I ask questions.\" He turned to Emmer. \"I'm curious about humans. Is there anything else you can tell me about the hypothetical ancestor?\"\n \n Emmer didn't look like the genius he was—a Neanderthal genius, but nonetheless a real one. In his field, he rated very high. He raised a stubble-flecked cheek from a large thick-fingered paw and ran shaggy hands through shaggier hair.\n \n \"I can speak with some authority,\" he rumbled. \"I was born on a world with the most extensive relics. As a child, I played in the ruins of their camp.\"\n \n \"I don't question your authority,\" crinkled Taphetta. \"To me, all humans—late or early and male or female—look remarkably alike. If you are an archeologist, that's enough for me.\" He paused and flicked his speech ribbons. \"Camp, did you say?\"\n \n \n\n \n Emmer smiled, unsheathing great teeth. \"You've never seen any pictures? Impressive, but just a camp, monolithic one-story structures, and we'd give something to know what they're made of. Presumably my world was one of the first they stopped at. They weren't used to roughing it, so they built more elaborately than they did later on. One-story structures and that's how we can guess at their size. The doorways were forty feet high.\"\n \n \"Very large,\" agreed Taphetta. It was difficult to tell whether he was impressed. \"What did you find in the ruins?\"\n \n \"Nothing,\" said Emmer. \"There were buildings there and that was all, not a scrap of writing or a tool or a single picture. They covered a route estimated at thirty thousand light-years in less than five thousand years—and not one of them died that we have a record of.\"\n \n \"A faster-than-light drive and an extremely long life,\" mused Taphetta.\n\"But they didn't leave any information for their descendants. Why?\"\n \n \"Who knows? Their mental processes were certainly far different from ours. They may have thought we'd be better off without it. We do know they were looking for a special kind of planet, like Earth, because they visited so many of that type, yet different from it because they never stayed. They were pretty special people themselves, big and long-lived, and maybe they couldn't survive on any planet they found. Perhaps they had ways of determining there wasn't the kind of planet they needed in the entire Milky Way. Their science was tremendously advanced and when they learned that, they may have altered their germ plasm and left us, hoping that some of us would survive. Most of us did.\"\n \n \"This special planet sounds strange,\" murmured Taphetta.\n \n \"Not really,\" said Emmer. \"Fifty human races reached space travel independently and those who did were scattered equally among early and late species. It's well known that individuals among my people are often as bright as any of Halden's or Meredith's, but as a whole we don't have the total capacity that later Man does, and yet we're as advanced in civilization. The difference? It must lie somewhere in the planets we live on and it's hard to say just what it is.\"\n \n \"What happened to those who didn't develop space travel?\" asked Taphetta.\n \n \"We helped them,\" said Emmer.\n \n And they had, no matter who or what they were, biologically late or early, in the depths of the bronze age or the threshold of atomic—because they were human. That was sometimes a frightening thing for non-humans, that the race stuck together. They weren't actually aggressive, but their total number was great and they held themselves aloof. The unknown ancestor again. Who else had such an origin and, it was tacitly assumed, such a destiny?\n \n \n\n \n Taphetta changed his questioning. \"What do you expect to gain from this discovery of the unknown ancestor?\"\n \n It was Halden who answered him. \"There's the satisfaction of knowing where we came from.\"\n \n \"Of course,\" rustled the Ribboneer. \"But a lot of money and equipment was required for this expedition. I can't believe that the educational institutions that are backing you did so purely out of intellectual curiosity.\"\n \n \"Cultural discoveries,\" rumbled Emmer. \"How did our ancestors live? When a creature is greatly reduced in size, as we are, more than physiology is changed—the pattern of life itself is altered. Things that were easy for them are impossible for us. Look at their life span.\"\n \n \"No doubt,\" said Taphetta. \"An archeologist would be interested in cultural discoveries.\"\n \n \"Two hundred thousand years ago, they had an extremely advanced civilization,\" added Halden. \"A faster-than-light drive, and we've achieved that only within the last thousand years.\"\n \n \"But I think we have a better one than they did,\" said the Ribboneer.\n\"There may be things we can learn from them in mechanics or physics, but wouldn't you say they were better biologists than anything else?\"\n \n Halden nodded. \"Agreed. They couldn't find a suitable planet. So, working directly with their germ plasm, they modified themselves and produced us. They were master biologists.\"\n \n \"I thought so,\" said Taphetta. \"I never paid much attention to your fantastic theories before I signed to pilot this ship, but you've built up a convincing case.\" He raised his head, speech ribbons curling fractionally and ceaselessly. \"I don't like to, but we'll have to risk using bait for your pest.\"\n \n He'd have done it anyway, but it was better to have the pilot's consent. And there was one question Halden wanted to ask; it had been bothering him vaguely. \"What's the difference between the Ribboneer contract and the one we offered you? Our terms are more liberal.\"\n \n \"To the individual, they are, but it won't matter if you discover as much as you think you will. The difference is this: My terms don't permit you to withhold any discovery for the benefit of one race.\"\n \n Taphetta was wrong; there had been no intention of withholding anything. Halden examined his own attitudes. He hadn't intended, but could he say that was true of the institutions backing the expedition? He couldn't, and it was too late now—whatever knowledge they acquired would have to be shared.\n \n That was what Taphetta had been afraid of—there was one kind of technical advancement that multiplied unceasingly. The race that could improve itself through scientific control of its germ plasm had a start that could never be headed. The Ribboneer needn't worry now.\n \n \n\n \n \"Why do we have to watch it on the screen?\" asked Meredith, glancing up. \"I'd rather be in hydroponics.\"\n \n Halden shrugged. \"They may or may not be smarter than planetbound animals, but they're warier. They don't come out when anyone's near.\"\n \n Lights dimmed in the distant hydroponic section and the screen with it, until he adjusted the infra-red frequencies. He motioned to the two crew members, each with his own peculiar screen, below which was a miniature keyboard.\n \n \"Ready?\"\n \n When they nodded, Halden said: \"Do as you've rehearsed. Keep noise at a minimum, but when you do use it, be vague. Don't try to imitate them exactly.\"\n \n At first, nothing happened on the big screen, and then a gray shape crept out. It slid through leaves, listened intently before coming forward. It jumped off one hydroponic section and fled across the open floor to the next. It paused, eyes glittering and antennae twitching.\n \n Looking around once, it leaped up, seizing the ledge and clawing up the side of the tank. Standing on top and rising to its haunches, it began nibbling what it could reach.\n \n Suddenly it whirled. Behind it and hitherto unnoticed was another shape, like it but larger. The newcomer inched forward. The small one retreated, skittering nervously. Without warning, the big one leaped and the small one tried to flee. In a few jumps, the big one caught up and mauled the other unmercifully.\n \n \n\n \n It continued to bite even after the little one lay still. At last it backed off and waited, watching for signs of motion. There was none. Then it turned to the plant. When it had chewed off everything within reach, it climbed into the branches.\n \n The little one twitched, moved a leg, and cautiously began dragging itself away. It rolled off the raised section and surprisingly made no noise as it fell. It seemed to revive, shaking itself and scurrying away, still within range of the screen.\n \n Against the wall was a small platform. The little one climbed on top and there found something that seemed to interest it. It sniffed around and reached and felt the discovery. Wounds were forgotten as it snatched up the object and frisked back to the scene of its recent defeat.\n \n This time it had no trouble with the raised section. It leaped and landed on top and made considerable noise in doing so. The big animal heard and twisted around. It saw and clambered down hastily, jumping the last few feet. Squealing, it hit the floor and charged.\n \n The small one stood still till the last instant—and then a paw flickered out and an inch-long knife blade plunged into the throat of the charging creature. Red spurted out as the bigger beast screamed. The knife flashed in and out until the big animal collapsed and stopped moving.\n \n The small creature removed the knife and wiped it on the pelt of its foe. Then it scampered back to the platform on which the knife had been found— and laid it down .\n \n \n\n \n At Halden's signal, the lights flared up and the screen became too bright for anything to be visible.\n \n \"Go in and get them,\" said Halden. \"We don't want the pests to find out that the bodies aren't flesh.\"\n \n \"It was realistic enough,\" said Meredith as the crewmen shut off their machines and went out. \"Do you think it will work?\"\n \n \"It might. We had an audience.\"\n \n \"Did we? I didn't notice.\" Meredith leaned back. \"Were the puppets exactly like the pests? And if not, will the pests be fooled?\"\n \n \"The electronic puppets were a good imitation, but the animals don't have to identify them as their species. If they're smart enough, they'll know the value of a knife, no matter who uses it.\"\n \n \"What if they're smarter? Suppose they know a knife can't be used by a creature without real hands?\"\n \n \"That's part of our precautions. They'll never know until they try—and they'll never get away from the trap to try.\"\n \n \"Very good. I never thought of that,\" said Meredith, coming closer. \"I like the way your primitive mind works. At times I actually think of marrying you.\"\n \n \"Primitive,\" he said, alternately frozen and thawed, though he knew that, in relation to her, he was not advanced.\n \n \"It's almost a curse, isn't it?\" She laughed and took the curse away by leaning provocatively against him. \"But barbaric lovers are often nice.\"\n \n Here we go again, he thought drearily, sliding his arm around her. To her, I'm merely a passionate savage.\n \n They went to his cabin.\n \n She sat down, smiling. Was she pretty? Maybe. For her own race, she wasn't tall, only by Terran standards. Her legs were disproportionately long and well shaped and her face was somewhat bland and featureless, except for a thin, straight, short nose. It was her eyes that made the difference, he decided. A notch or two up the scale of visual development, her eyes were larger and she could see an extra color on the violet end of the spectrum.\n \n She settled back and looked at him. \"It might be fun living with you on primeval Earth.\"\n \n He said nothing; she knew as well as he that Earth was as advanced as her own world. She had something else in mind.\n \n \"I don't think I will, though. We might have children.\"\n \n \"Would it be wrong?\" he asked. \"I'm as intelligent as you. We wouldn't have subhuman monsters.\"\n \n \"It would be a step up—for you.\" Under her calm, there was tension. It had been there as long as he'd known her, but it was closer to the surface now. \"Do I have the right to condemn the unborn? Should I make them start lower than I am?\"\n \n The conflict was not new nor confined to them. In one form or another, it governed personal relations between races that were united against non-humans, but held sharp distinctions themselves.\n \n \"I haven't asked you to marry me,\" he said bluntly.\n \n \"Because you're afraid I'd refuse.\"\n \n It was true; no one asked a member of a higher race to enter a permanent union.\n \n \"Why did you ever have anything to do with me?\" demanded Halden.\n \n \"Love,\" she said gloomily. \"Physical attraction. But I can't let it lead me astray.\"\n \n \"Why not make a play for Kelburn? If you're going to be scientific about it, he'd give you children of the higher type.\"\n \n \"Kelburn.\" It didn't sound like a name, the way she said it. \"I don't like him and he wouldn't marry me.\"\n \n \"He wouldn't, but he'd give you children if you were humble enough. There's a fifty per cent chance you might conceive.\"\n \n \n\n \n She provocatively arched her back. Not even the women of Kelburn's race had a body like hers and she knew it.\n \n \"Racially, there should be a chance,\" she said. \"Actually, Kelburn and I would be infertile.\"\n \n \"Can you be sure?\" he asked, knowing it was a poor attempt to act unconcerned.\n \n \"How can anyone be sure on a theoretical basis?\" she asked, an oblique smile narrowing her eyes. \"I know we can't.\"\n \n His face felt anesthetized. \"Did you have to tell me that?\"\n \n She got up and came to him. She nuzzled against him and his reaction was purely reflexive. His hand swung out and he could feel the flesh give when his knuckles struck it.\n \n She fell back and dazedly covered her face with her hand. When she took it away, blood spurted. She groped toward the mirror and stood in front of it. She wiped the blood off, examining her features carefully.\n \n \"You've broken my nose,\" she said factually. \"I'll have to stop the blood and pain.\"\n \n She pushed her nose back into place and waggled it to make sure. She closed her eyes and stood silent and motionless. Then she stepped back and looked at herself critically.\n \n \"It's set and partially knitted. I'll concentrate tonight and have it healed by morning.\"\n \n She felt in the cabinet and attached an invisible strip firmly across the bridge. Then she came over to him.\n \n \"I wondered what you'd do. You didn't disappoint me.\"\n \n He scowled miserably at her. Her face was almost plain and the bandage, invisible or not, didn't improve her appearance any. How could he still feel that attraction to her?\n \n \"Try Emmer,\" he suggested tiredly. \"He'll find you irresistible, and he's even more savage than I am.\"\n \n \"Is he?\" She smiled enigmatically. \"Maybe, in a biological sense. Too much, though. You're just right.\"\n \n He sat down on the bed. Again there was only one way of knowing what Emmer would do—and she knew. She had no concept of love outside of the physical, to make use of her body so as to gain an advantage—what advantage?—for the children she intended to have. Outside of that, nothing mattered, and for the sake of alloying the lower with the higher, she was as cruel to herself as she was to him. And yet he wanted her.\n \n \"I do think I love you,\" she said. \"And if love's enough, I may marry you in spite of everything. But you'll have to watch out whose children I have.\" She wriggled into his arms.\n \n The racial disparity was great and she had provoked him, but it was not completely her fault. Besides....\n \n Besides what? She had a beautiful body that could bear superior children—and they might be his.\n \n He twisted away. With those thoughts, he was as bad as she was. Were they all that way, every one of them, crawling upward out of the slime toward the highest goal they could conceive of? Climbing over—no, through —everybody they could coerce, seduce or marry—onward and upward. He raised his hand, but it was against himself that his anger was turned.\n \n \"Careful of the nose,\" she said, pressing against him. \"You've already broken it once.\"\n \n He kissed her with sudden passion that even he knew was primitive.",
      "metadata": {
        "title": "Big Ancestor",
        "author": "F. L. Wallace",
        "passage_id": "50969",
        "uid": "74a1c4030265483da3483be2fb782546",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8f4bf470977a4c4abc9410bd38d43dfb",
                "response_text": "The story starts with four of the species of the spectrum of human development together, talking and explaining about the possibility of mating with different species on the spectrum to Taphetta the Ribboneer. Emmer is an archeologist and he sits on one end of the spectrum. Halden, the biologist is from Earth, he is somewhat towards the middle on the spectrum. Meredith is a linguist, and she is further down the spectrum. And Kelburn, the mathematician, is at the far end of it. They explain to Taphetta about the theory of ability to mate with humans that are on planets that are close to each other. However, due to movement of planets, they are no longer close to each other. But with some accurate calculations, if all the stars were to go back two hundred thousand years, the position of those stars line up in the shape of a horse shoe. And they theorize that their original home lands on where the extension of the two ends of the horse shoe cross over. And the four explorers believe they have a chance of finding their original home. They are explaining this to Taphetta because they need him to be the pilot of this expedition. \n\nAfter Taphetta suggests that he does not like the air in the ship, they realize that some animals hs been eating the plants. With failing attempts to capture them, the biologist suggest that their mental and physical state might have changed due to radiation or atomic engines. Thus they set up a play for the animal to watch so that they will get into the trap. \n\nMeredith and Halden get into a fight because Meredith thinks Halden as primitive, and Halden does not like that. When he realizes that Meredith somehow knows she can’t be fertile with Kelburn, he gets so angry that he hits her nose. Then he come to realize why Meredith will not want to marry him and have children with him, even he would want superior children."
              },
              {
                "worker_id": "104",
                "uid": "343eb9baf6ec4f67b8e139cc875113bf",
                "response_text": "The story begins with Taphetta discussing with Sam Halden, the leader of the expedition, Sam’s theory on the origins of humans. They talk about different species and their abilities to mate with other species depending on how closely related the species are physical. They attempt to persuade Taphetta to pilot the ship by arguing that their theory is sound in logic and could lead to a great discovery. Taphetta is skeptical of their assertions for the origins of humans. Kelburn continues to explain in an attempt to convince him to navigate their ship.\n\nEventually, Taphetta agrees to navigate their ship as long as they sign his contract. The group does sign his contract as they desperately need his skills to complete their expedition. Halden trusts that his contract will not be deceitful. Once he has agreed, the group discusses Taphetta’s need for better oxygen on the ship. During this discussion, it is brought to Halden’s attention that there is an unknown pest on board the ship, an animal. \n\nEmmer talks to Taphetta about how every human race has achieved space travel at some point in their existence. Taphetta questions what they hope to achieve from their expedition, assuming that there will be money and technology to gain from the mission. Emmer and Halden argue that the examination of their culture and the drive of curiosity are their motivations for the mission. \n\nAt some point, the animals on the ship engage in a fight with a knife. After, Meredith and Halden begin conversing about their potential relationship. Halden leads Meredith to his cabin where he instinctively punches her nose after she has made him upset. They exchange words of admiration and lust for each other. Halden primitively kisses Meredith with passion.\n"
              },
              {
                "worker_id": "102",
                "uid": "d90c4553c9e94d6b9085bdbc828fde00",
                "response_text": "Sam Halden, a biologist from a world where humans have developed to the early-middle section of their evolution, is in conversation with Taphetta, an individual of the non-human species Ribboneers, so named because of the ribbons protruding from his head. Halden explains to Taphetta that there are hundreds of independently-evolved human species on just as many worlds, each at various stages of human development. The crew of Halden’s expedition, humans from the various human-inhabited worlds, represents the range of human development: Emmer is a Neanderthal-type archeologist who represents early humanity, Halden is an early-middle human, Meredith is a linguist from an advanced-middle human society, and Kelburn is a mathematician from the far advanced side of human evolution. \nTaphetta, himself from an advanced civilization, is initially uninterested in Halden’s theories of human evolution. However, as Kelburn elaborates on the adjacency mating principle, an observation supporting the humans’ hypothesis of a common ancestor which distributed humans throughout the galaxy, he becomes interested. Taphetta accepts the humans’ invitation to be their pilot for the expedition, on the condition that they use his contract. \n\tAn engineer from the ship’s hydroponics department, which is responsible for regulation of the ship’s air, reports to Meredith, who is physically attractive and wearing a revealing skirt, that Taphetta is not fond of the air. Halden learns that the air quality in the ship has been suffering due to damage to the plants caused by an animal. Despite the engineer’s efforts, the animal is resistant to pesticides and is intelligent enough to avoid the electric traps. They resolve to bait it into a trap. \n\tHalden approaches the ribboneer to inform him of the infestation. As he considers using the bait, Taphetta asks Emmer about the archeological evidence of their common ancestor on his home planet. The Neanderthal reveals that relics of massive proportions indicate the size of the common ancestor, and that they were likely long-lived and able to travel faster than light. Halden hypothesizes that their ancestor was unable to find a suitable planet, so instead left modified versions of themselves on each planet they visited. Taphetta is further interested by the theory of the common ancestry and finally acquiesces to using a bait to trap the pest. He also reveals that the terms of the contract upon which he insisted prohibits that information discovered during the expedition be withheld to the benefit of any race. \n\tMeredith and Halden are now monitoring the hydroponics room. They control two pest-like puppets which enact a fight scene: the smaller puppet, initially defeated by the larger, finds a knife and is able to slay the larger. The humans hope that the pests will be lured to the knife. Meredith and Halden then retire to his cabin, where she discusses the possible father of her children. Though she loves him, she dismisses the idea of bearing his child, as it will dilute her evolved biology. He strikes her and breaks her nose, but she quickly heals. He kisses her. \n"
              },
              {
                "worker_id": "101",
                "uid": "eb8455ccad4e4921aef1deb001587ea0",
                "response_text": "Taphetta, a creature of the Ribboneer species, has recently been recruited by a team of humans to aid in navigating a mission to discover the human race's \"big ancestor\": the original source of all humans which are now scattered across the Milky Way. Curious, and slightly skeptical, of the mission, Taphetta interrogates Sam Halden, a biologist, and Kelburn, a mathematician, about their theory of how humans evolved. Through analyzing the galactic routes of the human race and their locations throughout history, the team believes they have pinned the general home of the big ancestor. Taphetta agrees to help in the mission, under the condition that the team agrees to his own proposed contract rather than their own. As Taphetta prepares for navigation, he notes to Firmon, head of hydroponics, that he is bothered by the air quality on the ship. Firmon attempts to improve the air, however is met with an issue; the plants on the ship are being eaten by an unknown animal that hides within its machinery. With options limited to rebuilding the ship or baiting the animals through a risky experiment, Taphetta is again skeptical of the conditions of the ship. He requests that the team answer more questions while he thinks it over, and inquires about the big ancestor and its qualities. Emmer, a Neanderthal archaeologist, recounts his experiences growing up around the ruins of the ancestors; the infrastructure was all that they left behind, with no other scrap of information that would indicate their existence, though it is likely that they left in search of another planet to live on while improving themselves through the alteration of their germ plasm. Taphetta then questions the motives of the mission, to which Emmer and Halden consider the abilities of the big ancestor, and how much of an achievement it would be to gain the knowledge they possessed biologically. Holden asks Taphetta what the difference was between the contract the team proposed and his own; he responds and says that his contract ensured the discoveries made on this mission would not be withheld for humans exclusively. With Taphetta agreeing to baiting the animals, the team uses a realistic puppet that resembles the pests, with a retractable knife that is able to kill them when they get close. After a successful test run, Halden and linguist Meredith, who have an intimate relationship to each other, go back to Halden's cabin, where they discuss the future, including having children. Meredith, who is of a higher race than Halden, admits that her main concern is bearing children that are as superior as possible, which requires a partner of a higher race than her. This angers Halden, resulting in him striking her, yet they both love each other and their passion overweighs their tension."
              }
            ]
          },
          {
            "question_text": "Who is Garrett and what happens to him in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8f4bf470977a4c4abc9410bd38d43dfb",
                "response_text": "Taphetta the Ribboneer was on another ship that was passing by the expedition ship. Since the pilot that was supposed to fly the expedition got very sick and needed some treatment, he was taken by the other ship, and they told the explorers that they have an experienced pilot on board. After having Taphetta on the expedition ship, they introduce themselves and explains how they are at different points on the development spectrum. However, unlike human themselves, Taphetta does not see any difference between the early and late stage of humans, they are all the same to her. \n\nLater they explain the theory of horse shoe planets, the adjacency mating principle and suggest that they are likely to find their origin planet on their trip. Taphetta is interested and asks them to take her contract. Taphetta is afraid of them holding discoveries for the benefit of one race, thus offers them his own contract. While the truth is that the explorers are not going to hold anything, no one can be sure of the institutions that support this expedition. \n\nFurthermore, Taphetta senses that something is wrong with the air, which makes them realize that there has been animals consuming the plants they grew. Despite the fact that he doesn’t want to risk bait for the pest, he is convinced. "
              },
              {
                "worker_id": "104",
                "uid": "343eb9baf6ec4f67b8e139cc875113bf",
                "response_text": "Taphetta is a part of the Ribboneer racial group. He has four flat legs, a wide and thin body with a flat neck. His head is thick and is topped with a dozen narrow, long ribbons. He is an experienced pilot, which is common among people in his group. Ribboneer’s are well-known for their navigational ability in the universe. \n\nTaphetta was on board a ship that was passing a group in need of help. The group had a pilot that became sick and they hailed a ship that was passing by to get him to treatment. They heard that there was an experienced pilot on the passing ship, which is how Taphetta came upon their group. The group is trying to convince Taphetta to pilot them to their desired destination. He presents them with a contract that they have to accept for him to agree to the mission. His contract includes a provision that any discovery during the mission cannot be withheld to benefit one race. They accept the contract. He begins to be ready for the mission. \n"
              },
              {
                "worker_id": "102",
                "uid": "d90c4553c9e94d6b9085bdbc828fde00",
                "response_text": "Taphetta is a member of the non-human species known as Ribboneers, who are renowned for their integrity and navigational skills. He is described as having four flat, ribbon-like legs which loop out and tuck under his flat body. His neck is thicker than the rest of his body, and his head has a crown of many smaller ribbons. Prior to the start of the story, the pilot of the humans’ ship falls ill. They hail a ship passing by, partly in an attempt to find a new pilot. Taphetta was on that ship, and the story begins with a conversation between him and the human biologist, Sam Halden. \n\tHalden describes to Taphetta the theory behind the expedition on which the human ship has embarked, concerning an ancestor common to the many planets of humans in the Milky Way galaxy. Though initially uninterested, Taphetta is confronted with evidence for the humans’ theory, and later admits that they make a compelling argument. Taphetta arees to join the crew of the expedition, on the condition that he be hired under an extensive micro-printed contract which stipulates that no discovery in which he takes part should be hidden to the benefit of any race. \nOn the ship, Taphetta suffers from the air quality. Ribboneers breathe through tubes scattered throughout their bodies. Halden discovers that the problem is animals interfering with the growth of plants in the hydroponics sector of the ship, which are responsible for air quality regulation. Halden proposes using bait to trap the pests, to which Taphetta says he needs to think on the issue. As he thinks, Taphetta enquires further about the evidence supporting the humans’ theory, asking about the significance of discovering an answer, and the unequal development of humans across various planets. Aftering demonstrating interest in the answers given by his interlocutor Emmer, an archeologist, he acquiesces to use of bait to deal with the pest problem.\n"
              },
              {
                "worker_id": "101",
                "uid": "eb8455ccad4e4921aef1deb001587ea0",
                "response_text": "Taphetta is a non-human, of the Ribboneer species. His appearance resembles his name; he has flat limbs and a knotted thin body. Taphetta is also an experienced pilot, as his species specializes in navigation. Taphetta is recruited by the humans to guide their ship for their mission in finding their original ancestor, as their initial pilot became ill. Taphetta is a wary and dubious creature, so he asks several questions before agreeing to help. He also requires that the team agree to his own terms and contract, which demand transparency in their findings and condemn the withholding of information. Taphetta settles into the ship, but is uncomfortable with the cleanliness of the air; the team recognizes how crucial Taphetta's compliance is to their mission and stages an experiment to catch pests that are damaging the ship's plants. Taphetta uses this as another opportunity to ask questions and gauge more information on the mission."
              }
            ]
          },
          {
            "question_text": "What is the relationship between Meredith and Halden?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8f4bf470977a4c4abc9410bd38d43dfb",
                "response_text": "Meredith is a linguist who sits on the middle towards end of the spectrum; Halden is a biologist that is on the middle towards beginning of the spectrum. Meredith is wearing a short skirt which gets Firmon’s unwanted attention. She is also aware of the fact that she has been called “mistress” by the ship crews. \n\nAfter setting the trap for the plant eating animals, Meredith complements Halden for his primitiveness and calls their love barbaric, but Halden takes it a different way. He is indeed primitive in comparison to Meredith, but he clearly does not like the sound of it. He is of the lower level, she is a step up for him. In strong constrast to Taphetta’s belief of all humans are the same disregarding where they are on the spectrum, Meredith thinks that this spectrum weights more than the amount of love between Meredith and Halden. They seem to have known this all along. Halden never asks Meredith if she wanted to marry him, nor will Meredith say yes to that. Halden doesn’t like to be thought of the lower level human, but to his surprise, Halden later realizes that he also prefers a higher level children. "
              },
              {
                "worker_id": "104",
                "uid": "343eb9baf6ec4f67b8e139cc875113bf",
                "response_text": "Sam Halden is a biologist from Earth and Meredith is a linguist from a place located on the other side of the middle. They are from two different points on the biological spectrum of human development. Meredith is on a higher point of the scale. They have the potential to be able to successfully produce a child from mating. Halden is from a more primitive version of humans. \n\nPeople have rumored that Meredith is Halden’s mistress. There is a conflict between them as a potential relationship would cause Meredith to be reproducing with a race lesser than her race. She admits that she is in love and is physically attracted to Halden, but she does not want that to convince her to be in a relationship with him. They have tension in the story that creates a fight where Halden instinctively punches Meredith in the nose. Halden recognizes that Meredith is cruel to him and perhaps using him, yet he too loves her. He is tortured by the thought that he is as manipulative as Meredith because he is attracted to the idea of marrying a woman of a higher race as it would reflect him achieving a high goal. \n"
              },
              {
                "worker_id": "102",
                "uid": "d90c4553c9e94d6b9085bdbc828fde00",
                "response_text": "Meredith and Halden are both human crewmembers on an expedition with the intention of exploring the humans’ common ancestor. Though they are of the same species, they are from different planets on each of which humans have evolved independently and at different rates. Halden, a biologist, is on the early-middle side of the evolutionary scale. Meredith, a linguist, though more closely related to Halden than to any of her other crewmates, is from the later-middle side of the evolutionary scale. Despite Meredith’s refusal to bear children with halden, they are of similar enough evolutionary stages that they are compatible. \nAs Meredith and Halden watch the simulated fight between the puppet pests, she comments on Halden’s primitive strategizing, and fetishizes this aspect of Halden. Halden briefly recalls the previous times when she did the same, before they return to his cabin. Halden reflects on Meredith’s physical attractiveness, but concludes that her facial features are plain. She reiterates her desire against bearing children with him, for they would be of a lower evolutionary status than she is. Halden comments that, if she were searching for a mate who would yield offspring of the higher type, then Kelburn, a far-advanced human, would be the best choice. However, Meredith implies that she and Kelburn have previously attempted to mate, but are incompatible with one another. She nuzzles Halden, before he instinctively hits her. She quickly heals her nose, and tells him that she loves him, but will not bear his children if they marry. He kisses her. \n"
              },
              {
                "worker_id": "101",
                "uid": "eb8455ccad4e4921aef1deb001587ea0",
                "response_text": "Meredith and Halden have a passionate but high-strung relationship. They are both of the general human race; however, Halden is of an inferior species on Earth, while Meredith is slightly more advanced, of the Terran race. Halden and Meredith are in love, but face several complications: their relationship is mainly, at its surface level, physical, as Halden and the team refer to Meredith as his \"mistress\". Additionally, Meredith is preoccupied with the idea of bearing children that are biologically superior; she believes that having children with Halden would be a setback and against her morals. For these reasons, Meredith plans to explore bearing children with humans from other races, which enrages Halden. The tension between them is detrimental to their relationship, as Halden expresses it through violence. However, their love and passion for each other keeps them together in an imperfect situation. "
              }
            ]
          },
          {
            "question_text": "What is the mission of the expedition and its theory?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8f4bf470977a4c4abc9410bd38d43dfb",
                "response_text": "The goal of the expedition is to find their original home. There are many different species on the human development spectrum, and it is assumed that they can only mate with the species that are close to them on the spectrum according to the adjacency mating principle. Following this principle, careful calculations are done on the orbits of those planets. By determining their location in space at different times, the team are able to find a specific time in the whole universe that not only makes the specific pattern of a horse shoe, but also has supporting data backed up this hypothesis. Furthermore, if two imaginary lines extend from the ends of the horse shoe, the two lines will eventually meet and cross over at a specific location in space. The team are able to narrow the crossing point down to a few cubic light-years. According to the team, this space should be the place that their original home is. If they are to find the planet that the hypothetical unknown ancestors belongs to, they will be making cultural discoveries, technological advances, and finding out where they actually come from. "
              },
              {
                "worker_id": "104",
                "uid": "343eb9baf6ec4f67b8e139cc875113bf",
                "response_text": "The mission of the expedition is to find the origins of the human race. Taphetta refers to this as the big ancestor. The theory is that the human race did not originate on any planets that it currently inhabits. They believe that humans evolved at a different location and then began to settle across a particular section of the Milk Way. Their evidence to support this theory is that there are worlds where humans have been before the Stone Age and are not related to anything in that world. \n\nAnother supporting theory they present is the adjacency mating principle. The principle outlines which humans can mate with each other, theorizing that those which can mate had to have been physically close at one point. \n"
              },
              {
                "worker_id": "102",
                "uid": "d90c4553c9e94d6b9085bdbc828fde00",
                "response_text": "Humans have independently evolved across hundreds of planets across a stretch of the Milky Way galaxy. The patterning of planets in the galaxy on which human species have developed reveals a pattern of stars, which is hypothesized by humans to be the path of their common ancestor. Furthermore, it appears that the path traced by their ancestor attempts to gather a representative sample of planets in the Milky Way. This is consistent with the hypothesis that the ancestors’ aim to find an inhabitable planet. Were the pattern extended, the original home of the common ancestors would be found, and to find this common home is the purpose of the expedition. \n"
              },
              {
                "worker_id": "101",
                "uid": "eb8455ccad4e4921aef1deb001587ea0",
                "response_text": "Across the galaxy, there are hundreds of species of humans; certain species are able to mate with others, despite them living in faraway areas with no possible contact before space travel. To make sense of these circumstances, the mission's team believes that one original ancestor exists from which all humans came from, and were then dispersed throughout the Milky Way. There is also a pattern in the ways human races can interbreed; humans can mate with other humans that were adjacent to each other two hundred thousand years ago, indicating that this historical proximity points to a source of the big ancestor. The mission of this expedition is to travel to that location in search of the big ancestor, hopefully gaining cultural insight into the species as well as their superior biological abilities that make them able to mutate and improve themselves."
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8f4bf470977a4c4abc9410bd38d43dfb",
                "response_text": "The story is set in a space ship of an expedition with the goal of finding human’s original home. The universe has many species of human beings at different development levels, and four of them are on board of the ship. They seem to believe that there is a planet of origin, where they evolved. They assume that later, they were brought from the original planet to the planets they now live on. There was another ship that passed the expedition ship, which allow the explorers to send their pilot home since he is sick. They learn that there is a Ribboneer on that ship. The Ribboneer is a pilot and has been to some expeditions. Thus, the team want to have him on board and be the pilot of their ship. Hence, they start to explain about their theories in trying to find out about human race and their origin. The Ribboneer is interested and decides to join the team. Later, they notice that the plants are being eaten by some animals. Thus they put on a show at the hydroponics to trick the animals. Later, we follow Halden and Meredith to Halden’s cabin where they have an argument over the level of development they have and Halden punches Meredith’s nose. Then, the story ends with the two of them in Halden’s room. "
              },
              {
                "worker_id": "104",
                "uid": "343eb9baf6ec4f67b8e139cc875113bf",
                "response_text": "The story is set on a ship in space settled in the Milky Way. There is a projector on the spaceship that Kelburn uses to explain their theory of the origins of Man. The ship is quite isolated as it is currently located four months away from the nearest planet. The ship they are on is old, which creates some problems for them when trying to find a pest. The ship had new equipment added to its old frame, this has created hard to reach corners and small crevices that cannot be fixed without a proper rebuilding effort. There is a plant growing area on the ship that does not use soil in its growing. Halden has his own cabin on the ship. "
              },
              {
                "worker_id": "102",
                "uid": "d90c4553c9e94d6b9085bdbc828fde00",
                "response_text": "This story takes place in a human spaceship, floating in the expanse of space next to another ship. Prior to the start of the story, the human pilot falls ill and is unable to be treated with the resources on their ship. Fortunately, another ship, the one now idling next to the human ship, was passing and has agreed to return the pilot home. Coincidentally, a passenger of the other ship, Taphetta, is a ribbonrer, a species known for their navigational skills, and agrees to pilot the human ship on their expedition. \n\tLater in the story, when Meredith and Halden are monitoring the goings-on in the hydroponics room, they are in a room with a big screen displaying a night-vision feed of the hydroponics room. Meredith and Halden then return to Halden’s room. \n"
              },
              {
                "worker_id": "101",
                "uid": "eb8455ccad4e4921aef1deb001587ea0",
                "response_text": "The story takes place on the expedition team's ship, which is in an unknown part of space. The ship is designed for humans, making Taphetta's comfortability a bit more difficult to achieve, as indicated by his dissatisfaction with the air quality. The ship contains tanks of plants that, when running smoothly, produce oxygen to supply the ship. The ship also contains cabins for each team member. Outside the ship, not much is visible that indicates location; the only thing visible out the window is a neighboring ship from which Taphetta was pulled from."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5470,
        "document_length_chars": 32129
      }
    }
  ]
}