{
  "item_metadata": {
    "item_id": "50988",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "50988",
      "content": "Bodyguard\n \n \n By CHRISTOPHER GRIMM\n \n Illustrated by CAVAT\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction February 1956. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n When overwhelming danger is constantly present,of course a man is entitled to have a bodyguard. The annoyance was that he had to do it himself ... and his body would not cooperate!\n \n\n \n The man at the bar was exceptionally handsome, and he knew it. So did the light-haired girl at his side, and so did the nondescript man in the gray suit who was watching them from a booth in the corner.\n \n Everyone in the room was aware of the big young man, and most of the humans present were resentful, for he handled himself consciously and arrogantly, as if his appearance alone were enough to make him superior to anyone. Even the girl with him was growing restless, for she was accustomed to adulation herself, and next to Gabriel Lockard she was almost ordinary-looking.\n \n As for the extraterrestrials—it was a free bar—they were merely amused, since to them all men were pathetically and irredeemably hideous.\n \n Gabe threw his arm wide in one of his expansive gestures. There was a short man standing next to the pair—young, as most men and women were in that time, thanks to the science which could stave off decay, though not death—but with no other apparent physical virtue, for plastic surgery had not fulfilled its bright promise of the twentieth century.\n \n The drink he had been raising to his lips splashed all over his clothing; the glass shattered at his feet. Now he was not only a rather ugly little man, but also a rather ridiculous one—or at least he felt he was, which was what mattered.\n \n \"Sorry, colleague,\" Gabe said lazily. \"All my fault. You must let me buy you a replacement.\" He gestured to the bartender. \"Another of the same for my fellow-man here.\"\n \n The ugly man dabbed futilely at his dripping trousers with a cloth hastily supplied by the management.\n \n \"You must allow me to pay your cleaning bill,\" Gabe said, taking out his wallet and extracting several credit notes without seeming to look at them. \"Here, have yourself a new suit on me.\" You could use one was implied.\n \n And that, coming on top of Gabriel Lockard's spectacular appearance, was too much. The ugly man picked up the drink the bartender had just set before him and started to hurl it, glass and all, into Lockard's handsome face.\n \n \n\n \n Suddenly a restraining hand was laid upon his arm. \"Don't do that,\" the nondescript man who had been sitting in the corner advised. He removed the glass from the little man's slackening grasp. \"You wouldn't want to go to jail because of him.\"\n \n The ugly man gave him a bewildered stare. Then, seeing the forces now ranged against him—including his own belated prudence—were too strong, he stumbled off. He hadn't really wanted to fight, only to smash back, and now it was too late for that.\n \n Gabe studied the newcomer curiously. \"So, it's you again?\"\n \n The man in the gray suit smiled. \"Who else in any world would stand up for you?\"\n \n \"I should think you'd have given up by now. Not that I mind having you around, of course,\" Gabriel added too quickly. \"You do come in useful at times, you know.\"\n \n \"So you don't mind having me around?\" The nondescript man smiled again.\n\"Then what are you running from, if not me? You can't be running from yourself—you lost yourself a while back, remember?\"\n \n Gabe ran a hand through his thick blond hair. \"Come on, have a drink with me, fellow-man, and let's let bygones be bygones. I owe you something—I admit that. Maybe we can even work this thing out.\"\n \n \"I drank with you once too often,\" the nondescript man said. \"And things worked out fine, didn't they? For you.\" His eyes studied the other man's incredibly handsome young face, noted the suggestion of bags under the eyes, the beginning of slackness at the lips, and were not pleased with what they saw. \"Watch yourself, colleague,\" he warned as he left. \"Soon you might not be worth the saving.\"\n \n \"Who was that, Gabe?\" the girl asked.\n \n He shrugged. \"I never saw him before in my life.\" Of course, knowing him, she assumed he was lying, but, as a matter of fact, just then he happened to have been telling the truth.\n \n \n\n \n Once the illuminators were extinguished in Gabriel Lockard's hotel suite, it seemed reasonably certain to the man in the gray suit, as he watched from the street, that his quarry would not go out again that night. So he went to the nearest airstation. There he inserted a coin in a locker, into which he put most of his personal possessions, reserving only a sum of money. After setting the locker to respond to the letter combination bodyguard , he went out into the street.\n \n If he had met with a fatal accident at that point, there would have been nothing on his body to identify him. As a matter of fact, no real identification was possible, for he was no one and had been no one for years.\n \n The nondescript man hailed a cruising helicab. \"Where to, fellow-man?\" the driver asked.\n \n \"I'm new in the parish,\" the other man replied and let it hang there.\n \n \"Oh...? Females...? Narcophagi...? Thrill-mills?\"\n \n But to each of these questions the nondescript man shook his head.\n \n \"Games?\" the driver finally asked, although he could guess what was wanted by then. \"Dice...? Roulette...? Farjeen?\"\n \n \"Is there a good zarquil game in town?\"\n \n The driver moved so he could see the face of the man behind him in the teleview. A very ordinary face. \"Look, colleague, why don't you commit suicide? It's cleaner and quicker.\"\n \n \"I can't contact your attitude,\" the passenger said with a thin smile. \"Bet you've never tried the game yourself. Each time it happens, there's a ... well, there's no experience to match it at a thrill-mill.\" He gave a sigh that was almost an audible shudder, and which the driver misinterpreted as an expression of ecstasy.\n \n \"Each time, eh? You're a dutchman then?\" The driver spat out of the window. \"If it wasn't for the nibble, I'd throw you right out of the cab. Without even bothering to take it down even. I hate dutchmen ... anybody with any legitimate feelings hates 'em.\"\n \n \"But it would be silly to let personal prejudice stand in the way of a commission, wouldn't it?\" the other man asked coolly.\n \n \"Of course. You'll need plenty of foliage, though.\"\n \n \"I have sufficient funds. I also have a gun.\"\n \n \"You're the dictator,\" the driver agreed sullenly.\n \n \n\n II\n \n It was a dark and rainy night in early fall. Gabe Lockard was in no condition to drive the helicar. However, he was stubborn.\n \n \"Let me take the controls, honey,\" the light-haired girl urged, but he shook his handsome head.\n \n \"Show you I can do something 'sides look pretty,\" he said thickly, referring to an earlier and not amicable conversation they had held, and of which she still bore the reminder on one thickly made-up cheek.\n \n Fortunately the car was flying low, contrary to regulations, so that when they smashed into the beacon tower on the outskirts of the little town, they didn't have far to fall. And hardly had their car crashed on the ground when the car that had been following them landed, and a short fat man was puffing toward them through the mist.\n \n To the girl's indignation, the stranger not only hauled Gabe out onto the dripping grass first, but stopped and deliberately examined the young man by the light of his minilume, almost as if she weren't there at all. Only when she started to struggle out by herself did he seem to remember her existence. He pulled her away from the wreck just a moment before the fuel tank exploded and the 'copter went up in flames.\n \n Gabe opened his eyes and saw the fat man gazing down at him speculatively. \"My guardian angel,\" he mumbled—shock had sobered him a little, but not enough. He sat up. \"Guess I'm not hurt or you'd have thrown me back in.\"\n \n \"And that's no joke,\" the fat man agreed.\n \n The girl shivered and at that moment Gabriel suddenly seemed to recall that he had not been alone. \"How about Helen? She on course?\"\n \n \"Seems to be,\" the fat man said. \"You all right, miss?\" he asked, glancing toward the girl without, she thought, much apparent concern.\n \n \" Mrs. ,\" Gabriel corrected. \"Allow me to introduce you to Mrs. Gabriel Lockard,\" he said, bowing from his seated position toward the girl.\n\"Pretty bauble, isn't she?\"\n \n \"I'm delighted to meet you, Mrs. Gabriel Lockard,\" the fat man said, looking at her intently. His small eyes seemed to strip the make-up from her cheek and examine the livid bruise underneath. \"I hope you'll be worthy of the name.\" The light given off by the flaming car flickered on his face and Gabriel's and, she supposed, hers too. Otherwise, darkness surrounded the three of them.\n \n There were no public illuminators this far out—even in town the lights were dimming and not being replaced fast enough nor by the newer models. The town, the civilization, the planet all were old and beginning to slide downhill....\n \n Gabe gave a short laugh, for no reason that she could see.\n \n \n\n \n There was the feeling that she had encountered the fat man before, which was, of course, absurd. She had an excellent memory for faces and his was not included in her gallery. The girl pulled her thin jacket closer about her chilly body. \"Aren't you going to introduce your—your friend to me, Gabe?\"\n \n \"I don't know who he is,\" Gabe said almost merrily, \"except that he's no friend of mine. Do you have a name, stranger?\"\n \n \"Of course I have a name.\" The fat man extracted an identification card from his wallet and read it. \"Says here I'm Dominic Bianchi, and Dominic Bianchi is a retail milgot dealer.... Only he isn't a retail milgot dealer any more; the poor fellow went bankrupt a couple of weeks ago, and now he isn't ... anything.\"\n \n \"You saved our lives,\" the girl said. \"I'd like to give you some token of my—of our appreciation.\" Her hand reached toward her credit-carrier with deliberate insult. He might have saved her life, but only casually, as a by-product of some larger scheme, and her appreciation held little gratitude.\n \n The fat man shook his head without rancor. \"I have plenty of money, thank you, Mrs. Gabriel Lockard.... Come,\" he addressed her husband,\n\"if you get up, I'll drive you home. I warn you, be more careful in the future! Sometimes,\" he added musingly, \"I almost wish you would let something happen. Then my problem would not be any problem, would it?\"\n \n Gabriel shivered. \"I'll be careful,\" he vowed. \"I promise—I'll be careful.\"\n \n \n\n \n When he was sure that his charge was safely tucked in for the night, the fat man checked his personal possessions. He then requested a taxi driver to take him to the nearest zarquil game. The driver accepted the commission phlegmatically. Perhaps he was more hardened than the others had been; perhaps he was unaware that the fat man was not a desperate or despairing individual seeking one last chance, but what was known colloquially as a flying dutchman, a man, or woman, who went from one zarquil game to another, loving the thrill of the sport, if you could call it that, for its own sake, and not for the futile hope it extended and which was its sole shred of claim to moral justification. Perhaps—and this was the most likely hypothesis—he just didn't care.\n \n Zarquil was extremely illegal, of course—so much so that there were many legitimate citizens who weren't quite sure just what the word implied, knowing merely that it was one of those nameless horrors so deliciously hinted at by the fax sheets under the generic term of\n\"crimes against nature.\" Actually the phrase was more appropriate to zarquil than to most of the other activities to which it was commonly applied. And this was one crime—for it was crime in law as well as nature—in which victim had to be considered as guilty as perpetrator; otherwise the whole legal structure of society would collapse.\n \n \n\n \n Playing the game was fabulously expensive; it had to be to make it profitable for the Vinzz to run it. Those odd creatures from Altair's seventh planet cared nothing for the welfare of the completely alien human beings; all they wanted was to feather their own pockets with interstellar credits, so that they could return to Vinau and buy many slaves. For, on Vinau, bodies were of little account, and so to them zarquil was the equivalent of the terrestrial game musical chairs. Which was why they came to Terra to make profits—there has never been big money in musical chairs as such.\n \n When the zarquil operators were apprehended, which was not frequent—as they had strange powers, which, not being definable, were beyond the law—they suffered their sentences with equanimity. No Earth court could give an effective prison sentence to a creature whose life spanned approximately two thousand terrestrial years. And capital punishment had become obsolete on Terra, which very possibly saved the terrestrials embarrassment, for it was not certain that their weapons could kill the Vinzz ... or whether, in fact, the Vinzz merely expired after a period of years out of sheer boredom. Fortunately, because trade was more profitable than war, there had always been peace between Vinau and Terra, and, for that reason, Terra could not bar the entrance of apparently respectable citizens of a friendly planet.\n \n The taxi driver took the fat man to one of the rather seedy locales in which the zarquil games were usually found, for the Vinzz attempted to conduct their operations with as much unobtrusiveness as was possible. But the front door swung open on an interior that lacked the opulence of the usual Vinoz set-up; it was down-right shabby, the dim olive light hinting of squalor rather than forbidden pleasures. That was the trouble in these smaller towns—you ran greater risks of getting involved in games where the players had not been carefully screened.\n \n The Vinoz games were usually clean, because that paid off better, but, when profits were lacking, the Vinzz were capable of sliding off into darkside practices. Naturally the small-town houses were more likely to have trouble in making ends meet, because everybody in the parish knew everybody else far too well.\n \n The fat man wondered whether that had been his quarry's motive in coming to such desolate, off-trail places—hoping that eventually disaster would hit the one who pursued him. Somehow, such a plan seemed too logical for the man he was haunting.\n \n However, beggars could not be choosers. The fat man paid off the heli-driver and entered the zarquil house. \"One?\" the small green creature in the slightly frayed robe asked.\n \n \"One,\" the fat man answered.\n \n \n\n III\n \n The would-be thief fled down the dark alley, with the hot bright rays from the stranger's gun lancing out after him in flamboyant but futile patterns. The stranger, a thin young man with delicate, angular features, made no attempt to follow. Instead, he bent over to examine Gabriel Lockard's form, appropriately outstretched in the gutter. \"Only weighted out,\" he muttered, \"he'll be all right. Whatever possessed you two to come out to a place like this?\"\n \n \"I really think Gabriel must be possessed....\" the girl said, mostly to herself. \"I had no idea of the kind of place it was going to be until he brought me here. The others were bad, but this is even worse. It almost seems as if he went around looking for trouble, doesn't it?\"\n \n \"It does indeed,\" the stranger agreed, coughing a little. It was growing colder and, on this world, the cities had no domes to protect them from the climate, because it was Earth and the air was breathable and it wasn't worth the trouble of fixing up.\n \n The girl looked closely at him. \"You look different, but you are the same man who pulled us out of that aircar crash, aren't you? And before that the man in the gray suit? And before that...?\"\n \n The young man's cheekbones protruded as he smiled. \"Yes, I'm all of them.\"\n \n \"Then what they say about the zarquil games is true? There are people who go around changing their bodies like—like hats?\" Automatically she reached to adjust the expensive bit of blue synthetic on her moon-pale hair, for she was always conscious of her appearance; if she had not been so before marriage, Gabriel would have taught her that.\n \n \n\n \n He smiled again, but coughed instead of speaking.\n \n \"But why do you do it? Why! Do you like it? Or is it because of Gabriel?\" She was growing a little frantic; there was menace here and she could not understand it nor determine whether or not she was included in its scope. \"Do you want to keep him from recognizing you; is that it?\"\n \n \"Ask him.\"\n \n \"He won't tell me; he never tells me anything. We just keep running. I didn't recognize it as running at first, but now I realize that's what we've been doing ever since we were married. And running from you, I think?\"\n \n There was no change of expression on the man's gaunt face, and she wondered how much control he had over a body that, though second- or third- or fourth-hand, must be new to him. How well could he make it respond? What was it like to step into another person's casing? But she must not let herself think that way or she would find herself looking for a zarquil game. It would be one way of escaping Gabriel, but not, she thought, the best way; her body was much too good a one to risk so casually.\n \n \n\n \n It was beginning to snow. Light, feathery flakes drifted down on her husband's immobile body. She pulled her thick coat—of fur taken from some animal who had lived and died light-years away—more closely about herself. The thin young man began to cough again.\n \n Overhead a tiny star seemed to detach itself from the pale flat disk of the Moon and hurl itself upward—one of the interstellar ships embarking on its long voyage to distant suns. She wished that somehow she could be on it, but she was here, on this solitary old world in a barren solar system, with her unconscious husband and a strange man who followed them, and it looked as if here she would stay ... all three of them would stay....\n \n \"If you're after Gabriel, planning to hurt him,\" she asked, \"why then do you keep helping him?\"\n \n \"I am not helping him . And he knows that.\"\n \n \"You'll change again tonight, won't you?\" she babbled. \"You always change after you ... meet us? I think I'm beginning to be able to identify you now, even when you're ... wearing a new body; there's something about you that doesn't change.\"\n \n \"Too bad he got married,\" the young man said. \"I could have followed him for an eternity and he would never have been able to pick me out from the crowd. Too bad he got married anyway,\" he added, his voice less impersonal, \"for your sake.\"\n \n She had come to the same conclusion in her six months of marriage, but she would not admit that to an outsider. Though this man was hardly an outsider; he was part of their small family group—as long as she had known Gabriel, so long he must have known her. And she began to suspect that he was even more closely involved than that.\n \n \"Why must you change again?\" she persisted, obliquely approaching the subject she feared. \"You have a pretty good body there. Why run the risk of getting a bad one?\"\n \n \"This isn't a good body,\" he said. \"It's diseased. Sure, nobody's supposed to play the game who hasn't passed a thorough medical examination. But in the places to which your husband has been leading me, they're often not too particular, as long as the player has plenty of foliage.\"\n \n \"How—long will it last you?\"\n \n \"Four or five months, if I'm careful.\" He smiled. \"But don't worry, if that's what you're doing; I'll get it passed on before then. It'll be expensive—that's all. Bad landing for the guy who gets it, but then it was tough on me too, wasn't it?\"\n \n \"But how did you get into this ... pursuit?\" she asked again. \"And why are you doing it?\" People didn't have any traffic with Gabriel Lockard for fun, not after they got to know him. And this man certainly should know him better than most.\n \n \"Ask your husband.\"\n \n The original Gabriel Lockard looked down at the prostrate, snow-powdered figure of the man who had stolen his body and his name, and stirred it with his toe. \"I'd better call a cab—he might freeze to death.\"\n \n He signaled and a cab came.\n \n \"Tell him, when he comes to,\" he said to the girl as he and the driver lifted the heavy form of her husband into the helicar, \"that I'm getting pretty tired of this.\" He stopped for a long spell of coughing.\n\"Tell him that sometimes I wonder whether cutting off my nose wouldn't, in the long run, be most beneficial for my face.\"\n \n \n\n \n \"Sorry,\" the Vinzz said impersonally, in English that was perfect except for the slight dampening of the sibilants, \"but I'm afraid you cannot play.\"\n \n \"Why not?\" The emaciated young man began to put on his clothes.\n \n \"You know why. Your body is worthless. And this is a reputable house.\"\n \n \"But I have plenty of money.\" The young man coughed. The Vinzz shrugged. \"I'll pay you twice the regular fee.\"\n \n The green one shook his head. \"Regrettably, I do mean what I say. This game is really clean.\"\n \n \"In a town like this?\"\n \n \"That is the reason we can afford to be honest.\" The Vinzz' tendrils quivered in what the man had come to recognize as amusement through long, but necessarily superficial acquaintance with the Vinzz. His heavy robe of what looked like moss-green velvet, but might have been velvet-green moss, encrusted with oddly faceted alien jewels, swung with him.\n \n \"We do a lot of business here,\" he said unnecessarily, for the whole set-up spelled wealth far beyond the dreams of the man, and he was by no means poor when it came to worldly goods. \"Why don't you try another town where they're not so particular?\"\n \n The young man smiled wryly. Just his luck to stumble on a sunny game. He never liked to risk following his quarry in the same configuration. And even though only the girl had actually seen him this time, he wouldn't feel at ease until he had made the usual body-shift. Was he changing because of Gabriel, he wondered, or was he using his own discoverment and identification simply as an excuse to cover the fact that none of the bodies that fell to his lot ever seemed to fit him? Was he activated solely by revenge or as much by the hope that in the hazards of the game he might, impossible though it now seemed, some day win another body that approached perfection as nearly as his original casing had?\n \n He didn't know. However, there seemed to be no help for it now; he would have to wait until they reached the next town, unless the girl, seeing him reappear in the same guise, would guess what had happened and tell her husband. He himself had been a fool to admit to her that the hulk he inhabited was a sick one; he still couldn't understand how he could so casually have entrusted her with so vital a piece of information.\n \n \n\n \n The Vinzz had been locking antennae with another of his kind. Now they detached, and the first approached the man once more. \"There is, as it happens, a body available for a private game,\" he lisped. \"No questions to be asked or answered. All I can tell you is that it is in good health.\"\n \n The man hesitated. \"But unable to pass the screening?\" he murmured aloud. \"A criminal then.\"\n \n The green one's face—if you could call it a face—remained impassive.\n \n \"Male?\"\n \n \"Of course,\" the Vinzz said primly. His kind did have certain ultimate standards to which they adhered rigidly, and one of those was the curious tabu against mixed games, strictly enforced even though it kept them from tapping a vast source of potential players. There had also never been a recorded instance of humans and extraterrestrials exchanging identities, but whether that was the result of tabu or biological impossibility, no one could tell.\n \n It might merely be prudence on the Vinzz' part—if it had ever been proved that an alien life-form had \"desecrated\" a human body, Earthmen would clamor for war ... for on this planet humanity held its self-bestowed purity of birthright dear—and the Vinzz, despite being unquestionably the stronger, were pragmatic pacifists. It had been undoubtedly some rabid member of the anti-alien groups active on Terra who had started the rumor that the planetary slogan of Vinau was,\n\"Don't beat 'em; cheat 'em.\"\n \n \"It would have to be something pretty nuclear for the other guy to take such a risk.\" The man rubbed his chin thoughtfully. \"How much?\"\n \n \"Thirty thousand credits.\"\n \n \"Why, that's three times the usual rate!\"\n \n \"The other will pay five times the usual rate.\"\n \n \"Oh, all right,\" the delicate young man gave in. It was a terrific risk he was agreeing to take, because, if the other was a criminal, he himself would, upon assuming the body, assume responsibility for all the crimes it had committed. But there was nothing else he could do.\n \n \n\n \n He looked at himself in the mirror and found he had a fine new body; tall and strikingly handsome in a dark, coarse-featured way. Nothing to match the one he had lost, in his opinion, but there were probably many people who might find this one preferable. No identification in the pockets, but it wasn't necessary; he recognized the face. Not that it was a very famous or even notorious one, but the dutchman was a careful student of the \"wanted\" fax that had decorated public buildings from time immemorial, for he was ever mindful of the possibility that he might one day find himself trapped unwittingly in the body of one of the men depicted there. And he knew that this particular man, though not an important criminal in any sense of the word, was one whom the police had been ordered to burn on sight. The abolishing of capital punishment could not abolish the necessity for self-defense, and the man in question was not one who would let himself be captured easily, nor whom the police intended to capture easily.\n  This might be a lucky break for me after all , the new tenant thought, as he tried to adjust himself to the body. It, too, despite its obvious rude health, was not a very comfortable fit. I can do a lot with a hulk like this. And maybe I'm cleverer than the original owner; maybe I'll be able to get away with it.\n \n\n\n IV\n \n \"Look, Gabe,\" the girl said, \"don't try to fool me! I know you too well. And I know you have that man's—the real Gabriel Lockard's—body.\" She put unnecessary stardust on her nose as she watched her husband's reflection in the dressing table mirror.\n \n Lockard—Lockard's body, at any rate—sat up and felt his unshaven chin. \"That what he tell you?\"\n \n \"No, he didn't tell me anything really—just suggested I ask you whatever I want to know. But why else should he guard somebody he obviously hates the way he hates you? Only because he doesn't want to see his body spoiled.\"\n \n \"It is a pretty good body, isn't it?\" Gabe flexed softening muscles and made no attempt to deny her charge; very probably he was relieved at having someone with whom to share his secret.\n \n \"Not as good as it must have been,\" the girl said, turning and looking at him without admiration. \"Not if you keep on the way you're coursing. Gabe, why don't you...?\"\n \n \"Give it back to him, eh?\" Lockard regarded his wife appraisingly.\n\"You'd like that, wouldn't you? You'd be his wife then. That would be nice—a sound mind in a sound body. But don't you think that's a little more than you deserve?\"\n \n \"I wasn't thinking about that, Gabe,\" she said truthfully enough, for she hadn't followed the idea to its logical conclusion. \"Of course I'd go with you,\" she went on, now knowing she lied, \"when you got your ... old body back.\"\n  Sure , she thought, I'd keep going with you to farjeen houses and thrill-mills. Actually she had accompanied him to a thrill-mill only once, and from then on, despite all his threats, she had refused to go with him again. But that once had been enough; nothing could ever wash that experience from her mind or her body.\n \n \"You wouldn't be able to get your old body back, though, would you?\" she went on. \"You don't know where it's gone, and neither, I suppose, does he?\"\n \n \"I don't want to know!\" he spat. \"I wouldn't want it if I could get it back. Whoever it adhered to probably killed himself as soon as he looked in a mirror.\" He swung long legs over the side of his bed.\n\"Christ, anything would be better than that! You can't imagine what a hulk I had!\"\n \n \"Oh, yes, I can,\" she said incautiously. \"You must have had a body to match your character. Pity you could only change one.\"",
      "metadata": {
        "title": "Bodyguard",
        "author": "Christopher Grimm",
        "passage_id": "50988",
        "uid": "0b5352c67d35444984e866a129ee4f0f",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "3",
                "uid": "ad2acea196584f569f3432f52034def4",
                "response_text": "\nGabriel (Gabe) Lockard, an attractive man, is sitting in a bar with humans and extraterrestrials. He knocks over a man's drink while he talks to a girl. He offers to pay for a new suit, showing off his wealth. The other man reaches to throw his drink at Lockard but is stopped by a third man wearing a gray suit, who seems to know Lockard. This man warns Lockard to be careful, and when he leaves, Lockard tells the woman he's with that he's never seen him before, even though they talked as if they were acquaintances. The stranger visits a locker at a nearby airstation, puts most of his belongings inside, including all forms of identification, and sets the lock to the word \"bodyguard\". He climbs into a helicab, where he pressures the driver into taking him to a zarquil game. This man has been floating around without an identity, but operates as a flying dutchman, floating between zarquil games. Another day, Lockard crashes a helicar on a rainy fall night in a dark corner of a degrading city, and a fat stranger pulls him and his wife out of the helicar before it exploded. The man who saved them has the ID of Dominic Bianchi, a milgot dealer who seems to have disappeared in the past few weeks. Mrs. Lockard warns her husband to be more careful lest something happen to him. It seems the stranger's job is to rotate identities and protect Lockard. On yet another day, a thin stranger chases off a thief with his gun, and checks in on Mr. and Mrs. Lockard. Mrs. Lockard realizes that he is the same man who pulled them out of their aircar crash, and was the man wearing the gray suit at the bar. He has been changing bodies this whole time. She wants to know why, but the stranger suggests she ask Gabriel. She suspects they've been running from this stranger, and has started to be able to identify him, which the stranger is disappointed by as he explains it is not Gabriel he is helping. Because Gabriel is going to run-down cities, the bodies the stranger is getting are not well-vetted, and can't last too long. It turns out the stranger was the original Gabriel Lockard, the implication being that he's trying to protect his original body. As the stranger tries to swap bodies again, he finds that nobody wants the one he's in. He's offered a body that is healthy but likely a criminal, for three times the usual fee, and the stranger accepts the expensive deal. After the bodyswap, he recognizes the man as someone police are ordered to burn on sights. Mrs. Lockard interrogates her husband about his stolen body, which starts an argument. She recognizes he can't get his old body back, but lies and says she'd stay with him if he switched back, and the two talk about how ugly he was. "
              },
              {
                "worker_id": "1",
                "uid": "4f41c38b37cc4119a4348535244076dc",
                "response_text": "Gabriel Lockard, a good looking man, stands at the bar with his wife. He accidentally hits another man’s drink, and the ugly little man winds up to hit Gabe. However, a stranger in a gray suit interjects. Gabe’s wife asks who the stranger was, and he tells her that he’s never seen him before. \n\nThe stranger hails a cab  and requests to be taken to the zarquil game. The cab driver tells him that he might as well commit suicide, but the stranger insists. \n\nOn a dark and rainy night, Gabe refuses to allow his wife to drive the helicar. When they crash, the stranger, with a brand new look, is right behind them. He pulls them out of the car before it blows up. Mrs. Lockard has a feeling that she has met the stranger before, but she dismisses her thought as ludicrous. When she asks for an introduction, Gabe asks the stranger for his name. He pulls out an ID card with the name Dominic Bianchi on it and explains that Bianchi lost all of his money a few weeks ago, and now he’s nothing. Mrs. Lockard tries to compensate the stranger for saving their lives, but he tells her that he has plenty of money. Gabe promises to be more careful in the future.\n\nThe stranger then makes his way to the zarquil game, which is an illegal activity. The game is run by the Vinzz, and it is very expensive to play. While there, he gains a new body, and this time he has small, angular features. \n\nLater, the stranger approaches Gabe, laying on the ground in an alleyway, and his distressed wife. Mrs. Lockard recognizes the skinny stranger as the same man that has been following them and saving their lives. He admits that he is all of them, and she realizes that the stranger is playing in the zarquil games. The stranger calls a cab so that Gabe won’t freeze to death outside, once again saving his life. \n\nThe stranger then goes to a zarquil game to change his appearance again. The Vinzz tries to turn him away because his body is in poor condition, but he asserts that he has lots of money to fork over. The alien offers him the body of a criminal. The stranger agrees to take the body, and he finds it to be very handsome. He recognizes the new face he wears as one that belongs to a man who will be burned immediately by any police officer he encounters. \n\nMrs. Lockard tells Gabe that she knows that the stranger who has been chasing them is the real Gabe Lockard, and he wants his body back. When the man in Lockard’s body becomes defensive, she assures him that she would stay with him regardless of what his actual body looks like. He has zero interest in returning to his old body, and his wife says it’s sad that he can’t buy a new personality as well. \n"
              },
              {
                "worker_id": "10",
                "uid": "beb41634158d4082844e490a3240e552",
                "response_text": "The story takes place in a reality where humans can trade bodies through a game called zarquil, thus taking on the physical appearance of a new person while someone else gets their old body. The premise is that the body of Gabriel Lockard is actually inhabited by an unknown person. His wife, Helen, is the one to unravel the story as she begins to discover that “strangers” (the real Gabe inhabiting the bodies of strangers, changing form repeatedly through the story) keep coming to their rescue. \nThe “strangers” that Helen starts to realize are a single person (Gabe’s consciousness) changing bodies over time appear when the arrogant and incredibly handsome body of Gabriel Lockard: gets a drink thrown in his face at a bar, crashes his vehicle into a tower with Helen as a passenger, and when he is face down unconscious in an alley. \nHelen first realizes what is happening when the “strangers” seem deeply concerned that Gabe remain alive. Through their interactions, she comes to realize that Gabe is not actually in his own body, and that the real Gabe is following his body around like a bodyguard, resentful of the person in there and not wanting any harm to come to what he considers his perfect physique. \nThe stranger continues to change forms throughout the story to evade detection by Gabe, though Helen foils that plan. He also does this for the reason of wanting to inhabit a body as perfect as he believes his original body was, hoping to “trade up” to a body he finds suitable through the process. The last body switch he makes is a dark deal into the body of a wanted criminal that is very handsome and fit. He is happy with the outcome as he thinks he may be able to get away with the crimes this body committed with his cunning wit.\nThe story closes with Helen confronting the body of Gabe with an unknown person inside, in which he confirms that what she knows is true. The person inside Gabe is unkind to her and does not treat her well, and the story ends with her in this predicament, having to make a choice whether to stay or go.\n"
              },
              {
                "worker_id": "2",
                "uid": "c7dd20d7f0f04817961ecd8b481324d5",
                "response_text": " In a bar with his wife, Gabriel Lockard draws attention to himself with his good looks and arrogance. Lockard gestures expansively, bumping another man and spilling his drink on his suit, knocking his glass to the floor. Condescendingly, Lockard offers to buy him another drink and pay his cleaning bill. When the man starts to throw his fresh drink on Lockard, he is stopped by a stranger in a gray suit. Lockard and the man in the gray suit talk as if they know each other; Lockard acknowledges the stranger is useful to have around, and the stranger, noticing signs of Lockard’s aging, comments Lockard soon might not be worth saving. \nAfter following Lockard to his hotel, the stranger takes a cab to the zarquil games to change his body, something he does after every encounter with Lockard. In the meantime, Gabe and Mrs. Lockart go out in a helicar. When Mrs. Lockart suggests she drive because Gabe is drunk, he insists on driving. He crashes the helicar, and the stranger, now a fat man, rescues him and his wife from the helicar just before it catches on fire. Gabe introduces his wife, and the stranger mysteriously states, “I hope you’ll be worthy of the name.” He takes the Lockards back to their hotel and then goes to the zarquil games again.\nAs a slim, sickly man, the stranger rescues Lockard and his wife from a would-be thief. Lockard is unconscious while Mrs. Lockard and the stranger discuss the situation. She realizes he is the same person who keeps protecting Gabe but exchanging bodies over and over and wants to know why he does it; the stranger says she should ask her husband. He acknowledges Mrs. Lockard is in a difficult situation with her marriage, stating, “Too bad he got married anyway for your sake.” When Mrs. Lockard wants to know why the stranger protects Gabriel, he encourages her to ask her husband. \nWhen the stranger tries to change bodies again, he is first told his diseased body makes him ineligible but then is offered a game where all he knows is the other body is a healthy male. He suspects this means the other person is a criminal but accepts the offer anyway, knowing he will assume responsibility for the crimes the other identity had committed. The stranger ends up with a “fine” new body that is handsome in a dark way, but the stranger recognizes the face as someone wanted by the police.\nMrs. Lockard confronts her husband about knowing the stranger better than he claimed. She asks if he would consider taking his original body back, and Gabe states she would then be the real Gabriel Lockart’s wife. She claims she would stay with her husband’s soul but knows this is a lie. He claims anything would be better than the hulk of his original body; Mrs. Lockard comments it’s a shame he could only change his body or his character, not both. \n\n\t\t\t\t\t\t"
              }
            ]
          },
          {
            "question_text": "Who is Mrs. Lockard and what is her significance to the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "3",
                "uid": "ad2acea196584f569f3432f52034def4",
                "response_text": "The young woman who Lockard is sitting with at the bar at the beginning of the story is the woman who would eventually become his wife. Her name is Helen, but she is mostly referred to as Mrs. Lockard. By the time the helicar crash happens, they have been married, and by the time they are almost robbed, they have been married six months. Her role is most clear when she is talking to the stranger after the robbery. She is the one who explicitly pieces together that the stranger she has seen, although varying in form at each event, has been the same person. The gray suit, the fat man, and the scrawny man have all been the same person. It is her perspective that changes Lockard's life and his possible path for the future, and the two of them have been on the run from the stranger the whole time they've been married. She gets enough information from the stranger to be able to confront her husband about what's happening, allowing her to uncover the whole story."
              },
              {
                "worker_id": "1",
                "uid": "4f41c38b37cc4119a4348535244076dc",
                "response_text": "\nMrs. Lockard is Gabe’s wife of six months. She is a very good-looking woman with a penchant for furs. She does not realize that the Gabe Lockard she knows is not the true Gabe Lockard until she uncovers the mystery of why a shape-changing stranger is always saving their lives. Mrs. Lockard is not part of the seedy underclass, so she has little awareness of the zarquil games and would not know to be on the lookout for an intruder in her husband’s body. \n\nEven before she realizes that the man she is married to is a liar, she is deeply unhappy in the marriage. At one point, the stranger who is chasing them, the real Gabe Lockard, notices that her face is bruised beneath her makeup. She is being abused by her husband, and she feels as though she has no way out of the relationship. Mrs. Lockard also complains that she has been forced to run from these strangers ever since she married Gabe. He won't tell her anything, so she is forced to figure everything out on her own, and she now recognizes that she is constantly on the run. When the real Gabe Lockard says that it’s a pity that she’s married, she agrees with him. \n\nThroughout her many interactions with the stranger that saves Gabe’s life, Mrs. Lockard asks a lot of tough questions. She is very intelligent and continues to seek the truth even when she’s being ignored. Her persistence pays off because the real Gabe Lockard admits to her that he is the same person in all of the strangers’ bodies. She is then able to approach her husband with the information she has uncovered. When she tells him that she knows what’s really going on, she suggests that he go back to his old body and promises to stay with him. She discovers how vain and immoral he is when he tells her that would never happen; he had the worst body before and he has zero intention of living in it again. Mrs. Lockard tells him that it’s too bad he can’t get a new personality. \n"
              },
              {
                "worker_id": "10",
                "uid": "beb41634158d4082844e490a3240e552",
                "response_text": "Helen Lockard is the wife of Gabe. She is significant because she guides the story and unravels the mysterious plot line of her husband trading bodies. She also has a significant role in attempting to enact justice upon the person that came to inhabit Gabe’s body, though the reader does not see this situation fully resolved.\n\nAs the story’s guide, she discovers that the strangers following her and her husband continue to rescue them from the harmful situations that Gabe places them in. She realizes the strangers are actually a single person (Gabe’s consciousness) that has been taking different bodily forms by playing zarquil and following his real body around.\n\nShe often assumes Gabe is lying to her, and even considers escaping her marriage by entering a game of zarquil to become someone else. When she discovers that the body of Gabe actually has the consciousness of another person in it, she confronts them. Although she is demeaned and taunted, her motivations are set on seeking justice for Gabe.\n"
              },
              {
                "worker_id": "2",
                "uid": "c7dd20d7f0f04817961ecd8b481324d5",
                "response_text": "Mrs. Lockard is first described as “the girl” with Gabriel Lockard in the bar. Gabriel is extremely good-looking and draws a lot of attention because of his looks. Compared to him, Mrs. Lockard almost looks plain. She has been married to Gabe for six months. Her husband is rude, coarse, and self-centered, and she regrets marrying him. He isn’t above striking her cheek violently when they argue. For instance, Mrs. Lockard tries to get along with Gabe, gently offering to drive the helicar when Gabe has had too much to drink. After she sees the stranger at the bar, and he rescues her from the wrecked helicar, she begins to think the stranger is familiar, although he looks different each time she sees him. After the stranger saves her and Gabe from the thief, she opens up to the stranger and confesses she feels like Gabe is looking for trouble. This is also when she realizes the stranger is definitely the same person from the bar, the wreck, and now the attempted theft. She opens up to the stranger and admits that Gabe is running from something. She wonders what it would be like to change bodies with another person in a zarquil game and escape from Gabriel, but she realizes her body is a good one and would hate to give it up. She begins to realize how closely connected the stranger is to her and Gabe. She accepts the stranger, although his significance is a secret her husband keeps from her, and her acceptance spurs the stranger to admit that his current body, thin and sickly, will only last another four or five months. She later asks her husband why he doesn’t give up the body, and he skeptically accuses her of wanting to be the real Gabe’s wife because then her husband would be sound in mind and body. She denies thinking of herself with the real Gabe and says she would stay with her husband in his “real” body. When her husband admits he doesn’t know where his real body is and thinks whoever has it might have killed himself after looking in the mirror, Mrs. Lockard comments that his real body must have matched his character and that it is a shame he could only change one of them, not both. Her husband realizes that she is dissatisfied with him, and her interaction with the stranger helps her see her husband as he really is. Compared to her husband, the stranger is much kinder, more honest, and stable. \n"
              }
            ]
          },
          {
            "question_text": "Who is the stranger in the gray suit and what is his significance?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "3",
                "uid": "ad2acea196584f569f3432f52034def4",
                "response_text": "The stranger in the gray suit at the bar in the beginning of the story happens to be the original Gabriel Lockard, and it is hinted that the original Lockard only switched bodies because the current one had convinced him to when they'd had too much to drink. The stranger is keeping an eye on the current Gabriel Lockard to protect the body from harm. He does this by participating in zarquil games, run by the alien race the Vinzz, which allows him to swap bodies with other people. If he is in a reputable area, there are careful checks to make sure that these bodies are healthy, but he ends up with a sick body partway through the story, which forces him to take the body of a criminal as his only option because nobody will buy the sick body from him. The stranger's desire to protect his original body pushes him to become obsessed with this task, and it is his only real goal. He follows Lockard throughout the story, switching bodies every time he is seen, which forces Lockard and his wife to flee from him, staying constantly on the run. Lockard is used to this stranger being around, and tries to avoid making him angry, but there is a sense that he is sick of being saved and wants to live his own life. Lockard even offers to buy the stranger a drink at the beginning to try to work something out, seemingly exhausted from being followed. His single-mindedness is shown by the fact that the stranger's password on his locker is \"bodyguard\", in reference to his original body."
              },
              {
                "worker_id": "1",
                "uid": "4f41c38b37cc4119a4348535244076dc",
                "response_text": "The stranger in the gray suit is the real Gabriel Lockard. He managed to lose his body through the illegal game known as zarquil, and he desperately wants it back. The stranger thinks of himself as Gabe Lockard’s bodyguard, and he uses the term as the passcode for the locker where he keeps his valuables. His life’s mission is to guard Gabe’s body and get it back so that he can be himself once more. In order to do this, he follows the fake Gabe Lockard and his wife around town to make sure that he is treating his body nicely. Fake Gabe Lockard frequently gets into fights, accidents, and other situations that could lead to his death or irreparably damage his body, and the stranger spends nearly all of his waking hours keeping tabs on him and rescuing him from destruction. \n\nThe stranger seems sinister at first, especially since he goes to seedy areas of town where the Vinzz run illegal zarquil games. He uses his immense wealth to purchase other peoples’ bodies. However, his motivation for continuously changing bodies is to keep his secret from the fake Gabe Lockard. He does not want the man who stole his body to be able to recognize him and kill him. Although he has not found the perfect solution to his problem, he is merely doing what he can to survive, protect his true body, and try to get it back. The stranger treats Gabe’s new wife well, and he even tells her the truth about his predicament. If he did not have the incredible amounts of cash he has, he would not be able to keep up with this plan. But he is able to use his money to keep buying new bodies and chasing around Gabe. \n"
              },
              {
                "worker_id": "10",
                "uid": "beb41634158d4082844e490a3240e552",
                "response_text": "The stranger in the gray suit is just one of the embodiments of the “stranger” throughout the story that keeps watch over Gabe. It is revealed that this stranger is actually Gabe himself who is continuously changing physical appearance by playing zarquil. He tries to take on bodies of greater and greater physical beauty until he can find one that is as good as the body he left, which he considers to be a perfect physical form. \n\nThe stranger is significant because he ultimately provides the key information that could liberate Helen from a marriage where she is treated poorly and gets into dangerous situations that could ultimately get her killed if she stays with him. \n\nThe stranger also represents the great lengths humans are willing to go to for pursuing or maintaining physical beauty or health. The game required to change form is dangerous and illegal, but the stranger continues to return to it for the allure of a better form.\n"
              },
              {
                "worker_id": "2",
                "uid": "c7dd20d7f0f04817961ecd8b481324d5",
                "response_text": "The stranger in the gray suit at the bar is the real Gabriel Lockart. He lost his body to the man who currently inhabits it in a zarquil game after having too many drinks with him, and now he follows Gabe Lockart wherever he goes and protects him whenever he is in danger. Actually, the stranger is not protecting the person in Gabe Lockart’s body, but the body of Gabe Lockart. The stranger shows up in the bar and protects Gabe when another man wants to throw a drink on Gabe; he also shows up and pulls Gabe and his wife from the wreckage of their helicar. He saves them from a would-be thief and calls for a cab to take them to where they are staying to prevent Gabe from freezing to death. The stranger follows Gabe wherever he goes, protecting his body. The stranger seems to want his body and identity back, but the current Gabe will not willingly give up the body and identity because he enjoys them too much.\n"
              }
            ]
          },
          {
            "question_text": "What are the zarquil games and what is their significance?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "3",
                "uid": "ad2acea196584f569f3432f52034def4",
                "response_text": "An alien race called the Vinzz, from Altair's seventh planet, run the zarquil games as a way to make money so that they can buy slaves. Through these games, humans are able to swap bodies so they can experience what it is like to live as someone else. People who participate frequently are known as flying dutchmen, and the stranger in the story is called this a few times. These games are illegal and dangerous, and you must have a lot of money to participate. In larger cities with more resources and oversight, all of the potential bodies go through a detailed vetting process to make sure that the body in question does not have any illnesses or a criminal past. When the stranger ends up with a sick body near the end of the story, his only option is to accept a body with a criminal past because nobody will accept an ill body at a reputable game. Public perception shows that society looks down on these games. The cab driver that the stranger meets explicitly says that he looks down on dutchmen, saying he hates them, and very reluctantly takes the stranger to a zarquil game because he is promised the money and he knows the stranger has a gun. It is this game that caused the original Gabriel Lockard to lose his body and identity, and it is through this game that he rotates through nameless people in order to follow the new Lockard to keep an eye on the body. \n"
              },
              {
                "worker_id": "1",
                "uid": "4f41c38b37cc4119a4348535244076dc",
                "response_text": "The zarquil games are illegally run by the Vinzz, an alien race. The illegal operation has such a terrible reputation that one of the cab drivers the stranger encounters suggests that he kill himself rather than playing. The cab driver almost refuses to bring him to the games, but he sees the amount of cash the stranger is holding and agrees to do his bidding. Many people in the society know nothing about zarquil because it’s an underground game that people with good reputations do not take part in. The stranger is known as a “dutchman,” which is a term for someone who plays zarquil all the time for the rush of it. \n\nZarquil is an interesting phenomenon because both the victim and the perpetrator are both considered guilty. The game is very expensive to play, and that’s why the Vinzz spend their time running the activity for humans. The Vinzz use the money they make to return to their home planet of Vinau and purchase slaves. The aliens rarely get in trouble for hosting the games because the Vinzz live about 2,000 years, and therefore no punishment would be worthwhile. The Vinzz are not subjected to capital punishment because the humans don’t know if their weapons are good enough to kill them. \n\nMales are given male bodies, and females are given female bodies. The Vinzz do not play “mixed games” and switch up genders, even though there is surely a market for that. Humans are also not allowed to trade bodies with aliens. The Vinzz feel that if they successfully traded a human body for an alien one, the humans would become outraged and start a war over the matter. Some seedy zarquil games include private purchases of criminal bodies. Criminals do not pass the standard testing and must be bought in secret. \n\nThe zarquil games are an important part of the story because Gabe Lockard loses his body to the stranger in one of these illegal games. The stranger, or the real Gabe Lockard, then uses zarquil to continuously change bodies to go undetected by the fake Gabe Lockard. He wants to get his real body back, and in order to do that he must not let the fake Gabe Lockard know his true identity. \n"
              },
              {
                "worker_id": "10",
                "uid": "beb41634158d4082844e490a3240e552",
                "response_text": "Zarquil is an extremely illegal “crime against nature” sport which is akin to a game of musical chairs. Instead of trading chairs, the game is a high consequence one where humans trade bodies. Supposedly the entrants to the game have a physical health check to ensure the participants get into bodies free of disease, but this proves to not be well regulated as the stranger receives several bodies which he thinks are “diseased”.\n\nThe sport is run by aliens, Vinzz, from Altair’s seventh planet that have no regard for the welfare of the humans playing, only the profits. The game persists on Terra (where humans live in the story) because there is no capital punishment that can be brought upon the Vinzz, as they live over 2000 years, making prison sentences useless to discourage them from running the game.\n\nThe games are significant because they allow humans to escape their lives by changing into completely different identities. This can enable criminals to escape the law, or for a single person to follow others undetected by continuously changing appearances.\n"
              },
              {
                "worker_id": "2",
                "uid": "c7dd20d7f0f04817961ecd8b481324d5",
                "response_text": "The zarquil games are an illegal activity played by people referred to as dutchmen who go from one game to another seeking the thrills they get from it. Part of the thrill of the game was the unknown; players don’t know for sure what kind of body they will end up with. The games are very expensive and are run by the Vinzz, who are strange beings from Altair’s seventh planet Vinau. The Vinzz have no concerns for the humans playing their games; they are running the games strictly for the money they can make from them so that they can return to Vinau and buy many slaves. The Vinzz live for around two thousand earth years and bodies mean little to them; they care nothing about a human’s body. The Vinzz are not barred from coming to Earth to run their games because the trade between the two planets is so valuable that they maintain peace. In the games, people exchange bodies. The Vinzz are supposed to vet everyone who plays to make sure their bodies are healthy, but they have been known to cut corners when profits are lagging. This explains why the stranger ends up as the sickly, thin man who only has four or five months left to live. \nThe zarquil games are significant in the story because that is how the stranger lost his body and name to the current Gabe Lockard. Apparently, the stranger drank too much too many times and played the zarquil game, losing his body and identity. He continues playing the game, changing his identity after every interaction with the current Gabe. The stranger isn’t sure whether he keeps changing after interacting with the current Gabe because of his interaction or because none of the subsequent bodies feel right to him. Perhaps he just wants to one day obtain a body that is as close to perfection as his original body was. \n"
              }
            ]
          },
          {
            "question_text": "What is the relationship between Gabe Lockard and the stranger?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "3",
                "uid": "ad2acea196584f569f3432f52034def4",
                "response_text": "The stranger is actually the original Gabriel Lockard, and the man we know as Lockard now is the man who took this body a while ago. The new Lockard has some sense of who the stranger is, though he knows he will never recognize him because the stranger switches bodies frequently. The stranger is keeping an eye out on his original body, trying to protect it, with a bit of hope that he may one day get it back. They have a tenuous and superficial relationship, with the new Lockard being somewhat hesitant about the stranger's involvement in his life. The stranger makes it clear that it is not Lockard he is protecting, but just the body he is in. Through this story, the stranger keeps a man from throwing a glass in Lockard's face at a bar, pulls Lockard and his wife out of a helicar crash, and stops a robbery from happening. There is bitterness and exhaustion on both sides of this relationship, and at the beginning of the story the new Lockard tries to offer the stranger a drink so they can sort things out, but the stranger refuses and it seems he would only be appeased if he had his original body back. "
              },
              {
                "worker_id": "1",
                "uid": "4f41c38b37cc4119a4348535244076dc",
                "response_text": "The stranger follows Gabe Lockard and his wife around everywhere they go in order to protect them. The stranger used to be the real owner of Gabe Lockard's body, but he lost it in a game of zarquil. Since then, he has made it his life's mission to protect his former body from harm. When an angry man at a bar almost assaults Gabe, the stranger stops the man from hitting Gabe in the face. When Gabe crashes his helicar into a beacon tower, the stranger is right behind the vehicle, and he pulls Gabe and his wife out of the crashed car before it blows up. When Gabe lies unconscious in the snow on a freezing night in an alleyway, the stranger shows up and calls him a cab to get his body back home in the warmth. \n\nGabe knows exactly why the stranger is following him and saving his life, but he refuses to tell his wife, Mrs. Lockard, the reason behind the strange behavior. However, Mrs. Lockard continues asking the stranger questions and eventually uncovers the truth. She realizes that she's married to the fake Gabe Lockard, and that he is a liar and a manipulator. "
              },
              {
                "worker_id": "10",
                "uid": "beb41634158d4082844e490a3240e552",
                "response_text": "The stranger is Gabe’s consciousness inhabiting the bodies of other people. Gabe left his own body in unknown circumstances, and now his body is inhabited by someone else. The relationship between them is not a shared mutual experience. The person in Gabe’s body is largely indifferent to the help from the stranger and does not recognize it is the same person sharing care towards him over time. The stranger (the real Gabe) feels a mix of protectiveness for his body and a deep resentment of the new person that is inside of it.\n\nThe stranger monitors “Gabe” closely like a bodyguard and cares deeply about his body continuing to exist, even calling a cab so it doesn’t freeze to death at one point. Potentially he does this with the hope that he can one day get back into it. The stranger continues to follow and save the body of “Gabe” while simultaneously changing physical forms through playing zarquil. This serves both to try to avoid being detected by Gabe and Helen (ultimately foiled when Helen figures it out), and to attempt to enter a physical form that is as perfect as he felt his original body was.\n"
              },
              {
                "worker_id": "2",
                "uid": "c7dd20d7f0f04817961ecd8b481324d5",
                "response_text": "Gabe Lockard in the story is actually a man inhabiting the body and adopting the identity of the real Gabriel Lockard. The real Gabe Lockard is the stranger in the gray suit in the bar, the fat man who pulls Gabe and Mrs. Lockard from their wrecked helicar, the thin, sickly man who saves Gabe and Mrs. Lockard from the would-be thief, and the handsome, dark, coarse-featured hulking man at the end of the story. The stranger follows Gabe and Mrs. Lockard from town to town, acting like a kind of bodyguard for Gabe to protect him from the harm he can do to himself and from other dangers. Apparently, at some time in the past, the real Gabe Lockard crossed paths with the man who now inhabits his body, and they had drinks together. The real Gabe comments that he drank with the current Gabe “once too often” and says that things worked out well for the current Gabe. Gabe Lockard’s body is incredibly handsome and attracts attention wherever he goes. The current Gabe, though, is coarse, rude, and self-centered; he has been moving from town to town to get away from the real Gabe who is following him, protecting Gabe’s body. It seems that the real Gabe hopes to get his real body back at some point in the future.\n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5002,
        "document_length_chars": 28618
      }
    }
  ]
}