{
  "item_metadata": {
    "item_id": "50998",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "50998",
      "content": "DELAY IN TRANSIT\n \n \n By F. L. WALLACE\n \n Illustrated by SIBLEY\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction September 1952. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n An unprovoked, meaningless night attack is terrifying enough on your own home planet, worse on a world across the Galaxy. But the horror is the offer of help that cannot be accepted!\n \n\n \n \"Muscles tense,\" said Dimanche. \"Neural index 1.76, unusually high. Adrenalin squirting through his system. In effect, he's stalking you. Intent: probably assault with a deadly weapon.\"\n \n \"Not interested,\" said Cassal firmly, his subvocalization inaudible to anyone but Dimanche. \"I'm not the victim type. He was standing on the walkway near the brink of the thoroughfare. I'm going back to the habitat hotel and sit tight.\"\n \n \"First you have to get there,\" Dimanche pointed out. \"I mean, is it safe for a stranger to walk through the city?\"\n \n \"Now that you mention it, no,\" answered Cassal. He looked around apprehensively. \"Where is he?\"\n \n \n\n \n \"Behind you. At the moment he's pretending interest in a merchandise display.\"\n \n A native stamped by, eyes brown and incurious. Apparently he was accustomed to the sight of an Earthman standing alone, Adam's apple bobbing up and down silently. It was a Godolphian axiom that all travelers were crazy.\n \n Cassal looked up. Not an air taxi in sight; Godolph shut down at dusk. It would be pure luck if he found a taxi before morning. Of course he could walk back to the hotel, but was that such a good idea?\n \n A Godolphian city was peculiar. And, though not intended, it was peculiarly suited to certain kinds of violence. A human pedestrian was at a definite disadvantage.\n \n \"Correction,\" said Dimanche. \"Not simple assault. He has murder in mind.\"\n \n \"It still doesn't appeal to me,\" said Cassal. Striving to look unconcerned, he strolled toward the building side of the walkway and stared into the interior of a small cafe. Warm, bright and dry. Inside, he might find safety for a time.\n \n Damn the man who was following him! It would be easy enough to elude him in a normal city. On Godolph, nothing was normal. In an hour the streets would be brightly lighted—for native eyes. A human would consider it dim.\n \n \"Why did he choose me?\" asked Cassal plaintively. \"There must be something he hopes to gain.\"\n \n \"I'm working on it,\" said Dimanche. \"But remember, I have limitations. At short distances I can scan nervous systems, collect and interpret physiological data. I can't read minds. The best I can do is report what a person says or subvocalizes. If you're really interested in finding out why he wants to kill you, I suggest you turn the problem over to the godawful police.\"\n \n \"Godolph, not godawful,\" corrected Cassal absently.\n \n That was advice he couldn't follow, good as it seemed. He could give the police no evidence save through Dimanche. There were various reasons, many of them involving the law, for leaving the device called Dimanche out of it. The police would act if they found a body. His own, say, floating face-down on some quiet street. That didn't seem the proper approach, either.\n \n \"Weapons?\"\n \n \"The first thing I searched him for. Nothing very dangerous. A long knife, a hard striking object. Both concealed on his person.\"\n \n Cassal strangled slightly. Dimanche needed a good stiff course in semantics. A knife was still the most silent of weapons. A man could die from it. His hand strayed toward his pocket. He had a measure of protection himself.\n \n \"Report,\" said Dimanche. \"Not necessarily final. Based, perhaps, on tenuous evidence.\"\n \n \"Let's have it anyway.\"\n \n \"His motivation is connected somehow with your being marooned here. For some reason you can't get off this planet.\"\n \n That was startling information, though not strictly true. A thousand star systems were waiting for him, and a ship to take him to each one.\n \n Of course, the one ship he wanted hadn't come in. Godolph was a transfer point for stars nearer the center of the Galaxy. When he had left Earth, he had known he would have to wait a few days here. He hadn't expected a delay of nearly three weeks. Still, it wasn't unusual. Interstellar schedules over great distances were not as reliable as they might be.\n \n Was this man, whoever and whatever he might be, connected with that delay? According to Dimanche, the man thought he was. He was self-deluded or did he have access to information that Cassal didn't?\n \n \n\n \n Denton Cassal, sales engineer, paused for a mental survey of himself. He was a good engineer and, because he was exceptionally well matched to his instrument, the best salesman that Neuronics, Inc., had. On the basis of these qualifications, he had been selected to make a long journey, the first part of which already lay behind him. He had to go to Tunney 21 to see a man. That man wasn't important to anyone save the company that employed him, and possibly not even to them.\n \n The thug trailing him wouldn't be interested in Cassal himself, his mission, which was a commercial one, nor the man on Tunney. And money wasn't the objective, if Dimanche's analysis was right. What did the thug want?\n \n Secrets? Cassal had none, except, in a sense, Dimanche. And that was too well kept on Earth, where the instrument was invented and made, for anyone this far away to have learned about it.\n \n And yet the thug wanted to kill him. Wanted to? Regarded him as good as dead. It might pay him to investigate the matter further, if it didn't involve too much risk.\n \n \"Better start moving.\" That was Dimanche. \"He's getting suspicious.\"\n \n Cassal went slowly along the narrow walkway that bordered each side of that boulevard, the transport tide. It was raining again. It usually was on Godolph, which was a weather-controlled planet where the natives like rain.\n \n He adjusted the controls of the weak force field that repelled the rain. He widened the angle of the field until water slanted through it unhindered. He narrowed it around him until it approached visibility and the drops bounced away. He swore at the miserable climate and the near amphibians who created it.\n \n A few hundred feet away, a Godolphian girl waded out of the transport tide and climbed to the walkway. It was this sort of thing that made life dangerous for a human—Venice revised, brought up to date in a faster-than-light age.\n \n Water. It was a perfect engineering material. Simple, cheap, infinitely flexible. With a minimum of mechanism and at break-neck speed, the ribbon of the transport tide flowed at different levels throughout the city. The Godolphian merely plunged in and was carried swiftly and noiselessly to his destination. Whereas a human—Cassal shivered. If he were found drowned, it would be considered an accident. No investigation would be made. The thug who was trailing him had certainly picked the right place.\n \n The Godolphian girl passed. She wore a sleek brown fur, her own. Cassal was almost positive she muttered a polite \"Arf?\" as she sloshed by. What she meant by that, he didn't know and didn't intend to find out.\n \n \"Follow her,\" instructed Dimanche. \"We've got to investigate our man at closer range.\"\n \n \n\n \n Obediently, Cassal turned and began walking after the girl. Attractive in an anthropomorphic, seal-like way, even from behind. Not graceful out of her element, though.\n \n The would-be assassin was still looking at merchandise as Cassal retraced his steps. A man, or at least man type. A big fellow, physically quite capable of violence, if size had anything to do with it. The face, though, was out of character. Mild, almost meek. A scientist or scholar. It didn't fit with murder.\n \n \"Nothing,\" said Dimanche disgustedly. \"His mind froze when we got close. I could feel his shoulderblades twitching as we passed. Anticipated guilt, of course. Projecting to you the action he plans. That makes the knife definite.\"\n \n Well beyond the window at which the thug watched and waited, Cassal stopped. Shakily he produced a cigarette and fumbled for a lighter.\n \n \"Excellent thinking,\" commended Dimanche. \"He won't attempt anything on this street. Too dangerous. Turn aside at the next deserted intersection and let him follow the glow of your cigarette.\"\n \n The lighter flared in his hand. \"That's one way of finding out,\" said Cassal. \"But wouldn't I be a lot safer if I just concentrated on getting back to the hotel?\"\n \n \"I'm curious. Turn here.\"\n \n \"Go to hell,\" said Cassal nervously. Nevertheless, when he came to that intersection, he turned there.\n \n It was a Godolphian equivalent of an alley, narrow and dark, oily slow-moving water gurgling at one side, high cavernous walls looming on the other.\n \n He would have to adjust the curiosity factor of Dimanche. It was all very well to be interested in the man who trailed him, but there was also the problem of coming out of this adventure alive. Dimanche, an electronic instrument, naturally wouldn't consider that.\n \n \"Easy,\" warned Dimanche. \"He's at the entrance to the alley, walking fast. He's surprised and pleased that you took this route.\"\n \n \"I'm surprised, too,\" remarked Cassal. \"But I wouldn't say I'm pleased. Not just now.\"\n \n \"Careful. Even subvocalized conversation is distracting.\" The mechanism concealed within his body was silent for an instant and then continued:\n\"His blood pressure is rising, breathing is faster. At a time like this, he may be ready to verbalize why he wants to murder you. This is critical.\"\n \n \"That's no lie,\" agreed Cassal bitterly. The lighter was in his hand. He clutched it grimly. It was difficult not to look back. The darkness assumed an even more sinister quality.\n \n \"Quiet,\" said Dimanche. \"He's verbalizing about you.\"\n \n \"He's decided I'm a nice fellow after all. He's going to stop and ask me for a light.\"\n \n \"I don't think so,\" answered Dimanche. \"He's whispering: 'Poor devil. I hate to do it. But it's really his life or mine'.\"\n \n \"He's more right than he knows. Why all this violence, though? Isn't there any clue?\"\n \n \"None at all,\" admitted Dimanche. \"He's very close. You'd better turn around.\"\n \n \n\n \n Cassal turned, pressed the stud on the lighter. It should have made him feel more secure, but it didn't. He could see very little.\n \n A dim shadow rushed at him. He jumped away from the water side of the alley, barely in time. He could feel the rush of air as the assailant shot by.\n \n \"Hey!\" shouted Cassal.\n \n Echoes answered; nothing else did. He had the uncomfortable feeling that no one was going to come to his assistance.\n \n \"He wasn't expecting that reaction,\" explained Dimanche. \"That's why he missed. He's turned around and is coming back.\"\n \n \"I'm armed!\" shouted Cassal.\n \n \"That won't stop him. He doesn't believe you.\"\n \n Cassal grasped the lighter. That is, it had been a lighter a few seconds before. Now a needle-thin blade had snapped out and projected stiffly. Originally it had been designed as an emergency surgical instrument. A little imagination and a few changes had altered its function, converting it into a compact, efficient stiletto.\n \n \"Twenty feet away,\" advised Dimanche. \"He knows you can't see him, but he can see your silhouette by the light from the main thoroughfare. What he doesn't know is that I can detect every move he makes and keep you posted below the level of his hearing.\"\n \n \"Stay on him,\" growled Cassal nervously. He flattened himself against the wall.\n \n \"To the right,\" whispered Dimanche. \"Lunge forward. About five feet. Low.\"\n \n Sickly, he did so. He didn't care to consider the possible effects of a miscalculation. In the darkness, how far was five feet? Fortunately, his estimate was correct. The rapier encountered yielding resistance, the soggy kind: flesh. The tough blade bent, but did not break. His opponent gasped and broke away.\n \n \"Attack!\" howled Dimanche against the bone behind his ear. \"You've got him. He can't imagine how you know where he is in the darkness. He's afraid.\"\n \n Attack he did, slicing about wildly. Some of the thrusts landed; some didn't. The percentage was low, the total amount high. His opponent fell to the ground, gasped and was silent.\n \n Cassal fumbled in his pockets and flipped on a light. The man lay near the water side of the alley. One leg was crumpled under him. He didn't move.\n \n \"Heartbeat slow,\" said Dimanche solemnly. \"Breathing barely perceptible.\"\n \n \"Then he's not dead,\" said Cassal in relief.\n \n Foam flecked from the still lips and ran down the chin. Blood oozed from cuts on the face.\n \n \"Respiration none, heartbeat absent,\" stated Dimanche.\n \n \n\n \n Horrified, Cassal gazed at the body. Self-defense, of course, but would the police believe it? Assuming they did, they'd still have to investigate. The rapier was an illegal concealed weapon. And they would question him until they discovered Dimanche. Regrettable, but what could he do about it?\n \n Suppose he were detained long enough to miss the ship bound for Tunney\n21?\n \n Grimly, he laid down the rapier. He might as well get to the bottom of this. Why had the man attacked? What did he want?\n \n \"I don't know,\" replied Dimanche irritably. \"I can interpret body data—a live body. I can't work on a piece of meat.\"\n \n Cassal searched the body thoroughly. Miscellaneous personal articles of no value in identifying the man. A clip with a startling amount of money in it. A small white card with something scribbled on it. A picture of a woman and a small child posed against a background which resembled no world Cassal had ever seen. That was all.\n \n Cassal stood up in bewilderment. Dimanche to the contrary, there seemed to be no connection between this dead man and his own problem of getting to Tunney 21.\n \n Right now, though, he had to dispose of the body. He glanced toward the boulevard. So far no one had been attracted by the violence.\n \n He bent down to retrieve the lighter-rapier. Dimanche shouted at him. Before he could react, someone landed on him. He fell forward, vainly trying to grasp the weapon. Strong fingers felt for his throat as he was forced to the ground.\n \n He threw the attacker off and staggered to his feet. He heard footsteps rushing away. A slight splash followed. Whoever it was, he was escaping by way of water.\n \n Whoever it was. The man he had thought he had slain was no longer in sight.\n \n \"Interpret body data, do you?\" muttered Cassal. \"Liveliest dead man I've ever been strangled by.\"\n \n \"It's just possible there are some breeds of men who can control the basic functions of their body,\" said Dimanche defensively. \"When I checked him, he had no heartbeat.\"\n \n \"Remind me not to accept your next evaluation so completely,\" grunted Cassal. Nevertheless, he was relieved, in a fashion. He hadn't wanted to kill the man. And now there was nothing he'd have to explain to the police.\n \n He needed the cigarette he stuck between his lips. For the second time he attempted to pick up the rapier-lighter. This time he was successful. Smoke swirled into his lungs and quieted his nerves. He squeezed the weapon into the shape of a lighter and put it away.\n \n Something, however, was missing—his wallet.\n \n The thug had relieved him of it in the second round of the scuffle. Persistent fellow. Damned persistent.\n \n It really didn't matter. He fingered the clip he had taken from the supposedly dead body. He had intended to turn it over to the police. Now he might as well keep it to reimburse him for his loss. It contained more money than his wallet had.\n \n Except for the identification tab he always carried in his wallet, it was more than a fair exchange. The identification, a rectangular piece of plastic, was useful in establishing credit, but with the money he now had, he wouldn't need credit. If he did, he could always send for another tab.\n \n A white card fluttered from the clip. He caught it as it fell. Curiously he examined it. Blank except for one crudely printed word, STAB. His unknown assailant certainly had tried.\n \n \n\n \n The old man stared at the door, an obsolete visual projector wobbling precariously on his head. He closed his eyes and the lettering on the door disappeared. Cassal was too far away to see what it had been. The technician opened his eyes and concentrated. Slowly a new sign formed on the door.\n \n \n TRAVELERS AID BUREAU Murra Foray, First Counselor\n \n It was a drab sign, but, then, it was a dismal, backward planet. The old technician passed on to the next door and closed his eyes again.\n \n With a sinking feeling, Cassal walked toward the entrance. He needed help and he had to find it in this dingy rathole.\n \n Inside, though, it wasn't dingy and it wasn't a rathole. More like a maze, an approved scientific one. Efficient, though not comfortable. Travelers Aid was busier than he thought it would be. Eventually he managed to squeeze into one of the many small counseling rooms.\n \n A woman appeared on the screen, crisp and cool. \"Please answer everything the machine asks. When the tape is complete, I'll be available for consultation.\"\n \n Cassal wasn't sure he was going to like her. \"Is this necessary?\" he asked. \"It's merely a matter of information.\"\n \n \"We have certain regulations we abide by.\" The woman smiled frostily.\n\"I can't give you any information until you comply with them.\"\n \n \"Sometimes regulations are silly,\" said Cassal firmly. \"Let me speak to the first counselor.\"\n \n \"You are speaking to her,\" she said. Her face disappeared from the screen.\n \n Cassal sighed. So far he hadn't made a good impression.\n \n Travelers Aid Bureau, in addition to regulations, was abundantly supplied with official curiosity. When the machine finished with him, Cassal had the feeling he could be recreated from the record it had of him. His individuality had been capsuled into a series of questions and answers. One thing he drew the line at—why he wanted to go to Tunney\n21 was his own business.\n \n The first counselor reappeared. Age, indeterminate. Not, he supposed, that anyone would be curious about it. Slightly taller than average, rather on the slender side. Face was broad at the brow, narrow at the chin and her eyes were enigmatic. A dangerous woman.\n \n \n\n \n She glanced down at the data. \"Denton Cassal, native of Earth. Destination, Tunney 21.\" She looked up at him. \"Occupation, sales engineer. Isn't that an odd combination?\" Her smile was quite superior.\n \n \"Not at all. Scientific training as an engineer. Special knowledge of customer relations.\"\n \n \"Special knowledge of a thousand races? How convenient.\" Her eyebrows arched.\n \n \"I think so,\" he agreed blandly. \"Anything else you'd like to know?\"\n \n \"Sorry. I didn't mean to offend you.\"\n \n He could believe that or not as he wished. He didn't.\n \n \"You refused to answer why you were going to Tunney 21. Perhaps I can guess. They're the best scientists in the Galaxy. You wish to study under them.\"\n \n Close—but wrong on two counts. They were good scientists, though not necessarily the best. For instance, it was doubtful that they could build Dimanche, even if they had ever thought of it, which was even less likely.\n \n There was, however, one relatively obscure research worker on Tunney 21 that Neuronics wanted on their staff. If the fragments of his studies that had reached Earth across the vast distance meant anything, he could help Neuronics perfect instantaneous radio. The company that could build a radio to span the reaches of the Galaxy with no time lag could set its own price, which could be control of all communications, transport, trade—a galactic monopoly. Cassal's share would be a cut of all that.\n \n His part was simple, on the surface. He was to persuade that researcher to come to Earth, if he could . Literally, he had to guess the Tunnesian's price before the Tunnesian himself knew it. In addition, the reputation of Tunnesian scientists being exceeded only by their arrogance, Cassal had to convince him that he wouldn't be working for ignorant Earth savages. The existence of such an instrument as Dimanche was a key factor.\n \n Her voice broke through his thoughts. \"Now, then, what's your problem?\"\n \n \"I was told on Earth I might have to wait a few days on Godolph. I've been here three weeks. I want information on the ship bound for Tunney\n21.\"\n \n \"Just a moment.\" She glanced at something below the angle of the screen. She looked up and her eyes were grave. \" Rickrock C arrived yesterday. Departed for Tunney early this morning.\"\n \n \"Departed?\" He got up and sat down again, swallowing hard. \"When will the next ship arrive?\"\n \n \"Do you know how many stars there are in the Galaxy?\" she asked.\n \n He didn't answer.\n \n \n\n \n \"That's right,\" she said. \"Billions. Tunney, according to the notation, is near the center of the Galaxy, inside the third ring. You've covered about a third of the distance to it. Local traffic, anything within a thousand light-years, is relatively easy to manage. At longer distances, you take a chance. You've had yours and missed it. Frankly, Cassal, I don't know when another ship bound for Tunney will show up on or near Godolph. Within the next five years—maybe.\"\n \n \n\n \n He blanched. \"How long would it take to get there using local transportation, star-hopping?\"\n \n \"Take my advice: don't try it. Five years, if you're lucky.\"\n \n \"I don't need that kind of luck.\"\n \n \"I suppose not.\" She hesitated. \"You're determined to go on?\" At the emphatic nod, she sighed. \"If that's your decision, we'll try to help you. To start things moving, we'll need a print of your identification tab.\"\n \n \"There's something funny about her,\" Dimanche decided. It was the usual speaking voice of the instrument, no louder than the noise the blood made in coursing through arteries and veins. Cassal could hear it plainly, because it was virtually inside his ear.\n \n Cassal ignored his private voice. \"Identification tab? I don't have it with me. In fact, I may have lost it.\"\n \n She smiled in instant disbelief. \"We're not trying to pry into any part of your past you may wish concealed. However, it's much easier for us to help you if you have your identification. Now if you can't remember your real name and where you put your identification—\" She arose and left the screen. \"Just a moment.\"\n \n He glared uneasily at the spot where the first counselor wasn't. His real name!\n \n \"Relax,\" Dimanche suggested. \"She didn't mean it as a personal insult.\"\n \n Presently she returned.\n \n \"I have news for you, whoever you are.\"\n \n \"Cassal,\" he said firmly. \"Denton Cassal, sales engineer, Earth. If you don't believe it, send back to—\" He stopped. It had taken him four months to get to Godolph, non-stop, plus a six-month wait on Earth for a ship to show up that was bound in the right direction. Over distances such as these, it just wasn't practical to send back to Earth for anything.\n \n \"I see you understand.\" She glanced at the card in her hand. \"The spaceport records indicate that when Rickrock C took off this morning, there was a Denton Cassal on board, bound for Tunney 21.\"\n \n \"It wasn't I,\" he said dazedly. He knew who it was, though. The man who had tried to kill him last night. The reason for the attack now became clear. The thug had wanted his identification tab. Worse, he had gotten it.\n \n \"No doubt it wasn't,\" she said wearily. \"Outsiders don't seem to understand what galactic travel entails.\"\n \n Outsiders? Evidently what she called those who lived beyond the second transfer ring. Were those who lived at the edge of the Galaxy, beyond the first ring, called Rimmers? Probably.\n \n \n\n \n She was still speaking: \"Ten years to cross the Galaxy, without stopping. At present, no ship is capable of that. Real scheduling is impossible. Populations shift and have to be supplied. A ship is taken off a run for repairs and is never put back on. It's more urgently needed elsewhere. The man who depended on it is left waiting; years pass before he learns it's never coming.\n \n \"If we had instantaneous radio, that would help. Confusion wouldn't vanish overnight, but it would diminish. We wouldn't have to depend on ships for all the news. Reservations could be made ahead of time, credit established, lost identification replaced—\"\n \n \"I've traveled before,\" he interrupted stiffly. \"I've never had any trouble.\"\n \n She seemed to be exaggerating the difficulties. True, the center was more congested. Taking each star as the starting point for a limited number of ships and using statistical probability as a guide—why, no man would arrive at his predetermined destination.\n \n But that wasn't the way it worked. Manifestly, you couldn't compare galactic transportation to the erratic paths of air molecules in a giant room. Or could you?\n \n For the average man, anyone who didn't have his own inter-stellar ship, was the comparison too apt? It might be.\n \n \"You've traveled outside, where there are still free planets waiting to be settled. Where a man is welcome, if he's able to work.\" She paused.\n\"The center is different. Populations are excessive. Inside the third ring, no man is allowed off a ship without an identification tab. They don't encourage immigration.\"\n \n In effect, that meant no ship bound for the center would take a passenger without identification. No ship owner would run the risk of having a permanent guest on board, someone who couldn't be rid of when his money was gone.\n \n Cassal held his head in his hands. Tunney 21 was inside the third ring.\n \n \"Next time,\" she said, \"don't let anyone take your identification.\"\n \n \"I won't,\" he promised grimly.\n \n \n\n \n The woman looked directly at him. Her eyes were bright. He revised his estimate of her age drastically downward. She couldn't be as old as he. Nothing outward had happened, but she no longer seemed dowdy. Not that he was interested. Still, it might pay him to be friendly to the first counselor.\n \n \"We're a philanthropic agency,\" said Murra Foray. \"Your case is special, though—\"\n \n \"I understand,\" he said gruffly. \"You accept contributions.\"\n \n She nodded. \"If the donor is able to give. We don't ask so much that you'll have to compromise your standard of living.\" But she named a sum that would force him to do just that if getting to Tunney 21 took any appreciable time.\n \n He stared at her unhappily. \"I suppose it's worth it. I can always work, if I have to.\"\n \n \"As a salesman?\" she asked. \"I'm afraid you'll find it difficult to do business with Godolphians.\"\n \n Irony wasn't called for at a time like this, he thought reproachfully.\n \n \"Not just another salesman,\" he answered definitely. \"I have special knowledge of customer reactions. I can tell exactly—\"\n \n He stopped abruptly. Was she baiting him? For what reason? The instrument he called Dimanche was not known to the Galaxy at large. From the business angle, it would be poor policy to hand out that information at random. Aside from that, he needed every advantage he could get. Dimanche was his special advantage.\n \n \"Anyway,\" he finished lamely, \"I'm a first class engineer. I can always find something in that line.\"\n \n \"A scientist, maybe,\" murmured Murra Foray. \"But in this part of the Milky Way, an engineer is regarded as merely a technician who hasn't yet gained practical experience.\" She shook her head. \"You'll do better as a salesman.\"\n \n He got up, glowering. \"If that's all—\"\n \n \"It is. We'll keep you informed. Drop your contribution in the slot provided for that purpose as you leave.\"\n \n A door, which he hadn't noticed in entering the counselling cubicle, swung open. The agency was efficient.\n \n \"Remember,\" the counselor called out as he left, \"identification is hard to work with. Don't accept a crude forgery.\"\n \n He didn't answer, but it was an idea worth considering. The agency was also eminently practical.\n \n The exit path guided him firmly to an inconspicuous and yet inescapable contribution station. He began to doubt the philanthropic aspect of the bureau.\n \n \n\n \n \"I've got it,\" said Dimanche as Cassal gloomily counted out the sum the first counselor had named.\n \n \"Got what?\" asked Cassal. He rolled the currency into a neat bundle, attached his name, and dropped it into the chute.\n \n \"The woman, Murra Foray, the first counselor. She's a Huntner.\"\n \n \"What's a Huntner?\"\n \n \"A sub-race of men on the other side of the Galaxy. She was vocalizing about her home planet when I managed to locate her.\"\n \n \"Any other information?\"\n \n \"None. Electronic guards were sliding into place as soon as I reached her. I got out as fast as I could.\"\n \n \"I see.\" The significance of that, if any, escaped him. Nevertheless, it sounded depressing.\n \n \"What I want to know is,\" said Dimanche, \"why such precautions as electronic guards? What does Travelers Aid have that's so secret?\"\n \n Cassal grunted and didn't answer. Dimanche could be annoyingly inquisitive at times.\n \n Cassal had entered one side of a block-square building. He came out on the other side. The agency was larger than he had thought. The old man was staring at a door as Cassal came out. He had apparently changed every sign in the building. His work finished, the technician was removing the visual projector from his head as Cassal came up to him. He turned and peered.\n \n \"You stuck here, too?\" he asked in the uneven voice of the aged.\n \n \"Stuck?\" repeated Cassal. \"I suppose you can call it that. I'm waiting for my ship.\" He frowned. He was the one who wanted to ask questions.\n\"Why all the redecoration? I thought Travelers Aid was an old agency. Why did you change so many signs? I could understand it if the agency were new.\"\n \n The old man chuckled. \"Re-organization. The previous first counselor resigned suddenly, in the middle of the night, they say. The new one didn't like the name of the agency, so she ordered it changed.\"\n \n She would do just that, thought Cassal. \"What about this Murra Foray?\"\n \n The old man winked mysteriously. He opened his mouth and then seemed overcome with senile fright. Hurriedly he shuffled away.\n \n Cassal gazed after him, baffled. The old man was afraid for his job, afraid of the first counselor. Why he should be, Cassal didn't know. He shrugged and went on. The agency was now in motion in his behalf, but he didn't intend to depend on that alone.",
      "metadata": {
        "title": "Delay in Transit",
        "author": "F. L. Wallace",
        "passage_id": "50998",
        "uid": "c6e07e8cefdd474b9e52e357cd68e3e5",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "101",
                "uid": "53d459a19b394bf48d12d4769c2ce534",
                "response_text": "Denton Cassal is a sales engineer of Neuronics, Inc., from Earth. On a business trip to Tunney 21, he awaits his next ship on the planet of Godolph. One evening, Cassal is warned by Dimanche, an informative electronic companion, that he is being stalked by a man. The man's motives are not completely known, but according to Dimanche, the man is intending to murder Cassal. One thing is known, which is that the man's objective is related to Cassal being stranded on Godolph. As it begins to rain heavily, Cassal attempts to evade the man with the help of Dimanche; he follows a Godolphian girl and turns into an alleyway. As they pass by the man, Dimanche notes that he is becoming increasingly suspicious. Cassal leads the man into an alleyway, and as the dusk turns to darkness, Dimanche assists him in dodging and fighting the man. With a lighter-turned-knife, Cassal is able to attack the man and stab him several times. According to Dimanche, the man is presumed dead, although moments later the man strangles Cassal and steals his wallet. The next day, Cassal visits the Travelers Aid Bureau, where Murra Foray, the First Counselor, prods him for information, including why he is on his way to Tunney 21. Avoiding the question, Cassal asks about the status of the next ship to Tunney 21. He learns that the ship departed from Godolph that morning, and that someone named Denton Cassal did board it; he then realizes that the man who attacked him the night before used the identification from his wallet to board that ship. Stranded and uncertain of how long he would have to wait for another ship, Cassal is out of options. He contributes a donation to the bureau as he leaves. Dimanche reports that he tried to gather information on Foray, but only got her home planet, as electronic guards were blocking the rest of the information, which Dimanche finds suspicious. On his way out of the agency, Cassal encounters a man that works for Traveler's Aid, but flees after being asked about Murra Foray. Cassal continues on as he remains stranded on Godolph. "
              },
              {
                "worker_id": "104",
                "uid": "38a3ab20487f48bba4d662b6bb7774b5",
                "response_text": "The story begins with Cassal concerned about someone following him. His electronic device alerts him that there is potential danger and directs him to walk down an alley. Cassal acknowledges that an alley is not the best choice to walk down if he is concerned about his safety. The person who was following him attacks him. Cassal is able to fend him off but his wallet is stolen. \n\nCassal begins to grow impatient because his ship has not arrived in weeks. He walks towards the Travel Agency Bureau to get counseling advice for his plan to go to Tunney 21. Marra talks about how unlikely it will be that he gets to planet Tunney 21. The ship that he was meant to be on, he did not make because he did not know when it would arrive. Marra tells him that there might not be another ship headed towards Tunney 21 for another 5 years. Even then, Cassal would not be able to board the ship without identification as the region Tunney 21 requires everyone who steps off the ship to present identification. Cassal becomes upset at this news and realizes why the man had attacked him – the man wanted Casals’s identification. Marra agrees to help Cassal for a price and Cassal agrees to the deal.\n\nWhen Cassal leaves the building, he asks an old man about his boss, Marra. The man becomes scared and does not answer Cassal, instead, he walks away. Cassal finds the old man’s behavior curious. \n"
              },
              {
                "worker_id": "103",
                "uid": "8b70991044dd4ae6abc5679efd759973",
                "response_text": "Denton Cassal is a sales engineer who was selected to see a man at Tunney 21. The story starts with Dimanche talking to Cassel where Dimanche is warning him that there could be a stalker who is harmful to him. After further analysis, Dimanche believed that the guy stalking him had murder in mind. Dimanche is a device that is designed on Earth and it’s able to analyze people. Then the readers learn that Cassal is on Godolph, a transfer center for the stars that are located near the center of the Galaxy. And Cassel is here to transfer from Earth to Tunney 21. He was supposed to get on the ship after a few days of landing in Godolph, but apparently the ship has not arrived and it has been almost three weeks. Hearing Dimanche’s analysis on the man’s connection to the delay, Cassal gets curious. \n\nThen Cassal is suggested by Dimanche to follow a girl in order to get closer to the stalker. Then he gets to a deserted intersection holding his cigarette so that the guy will follow, which he does. Because Godolphian won’t be seen when it’s dark, but they can see Cassal very well, so Dimanche becomes Cassal’s eyes once they entered the intersection. Cassal listens to him and follows his instructions. Luckily he is able to get the distance correct to injure the guy. Right after that, to Cassal’s surprise, Dimanche detects no heartbeat and the guy is not breathing anymore. Despite that he is horrified by the fact he has just murdered someone, Cassal wants to figure out who wants the man to attack him. So he looks through the man’s wallet and other personal items, but could find no connection. Then suddenly the supposed-to-be-dead man attacks Cassal and then runs away with his wallet. \n\nLater, Cassal found himself inside the travelers aid bureau answering questions in order to get a consultation. During the consultation, he realizes that he just missed the ship. Moreover, someone used his identity to get on to that ship. Then, Murra Foray, the first counselor of the travelers aid bureau offers him help if he donates to them. He is surprised by the amount they wish for, but he donates anyways. Then after he exits from the other side of the building, he sees a man who finishes with putting up the signs. But somehow he would not talk about Murra Foray as if he is afraid of her, which Cassal does not understand at all. "
              },
              {
                "worker_id": "102",
                "uid": "b5013c2b078e4b08b75e454ec8c928d2",
                "response_text": "On the planet Godolph, Neronics, Inc., salesman Denton Cassal is being stalked by a mysterious local. An intelligent implanted machine able to detect and interpret physiological data of nearby individuals, which Cassal calls Dimanche, tells him that the man likely intends to murder him. Dimanche gathers that the assassin's motivation is connected to Cassal’s being stranded on Godolph; Cassal had initially meant to stay in Godolph for only a couple days before continuing his journey to Tunney 21, but has been stuck there for several weeks. \nCassal moves closer to the man in order for Dimanche to better analyze him; Dimanche reveals that the man wields a concealed knife. Instructing Cassal to turn into an alley, Dimanche learns that the man expressed regret about having to kill Cassal, saying that one of them had to die. Suddenly, the assailant rushes Cassal, who narrowly dodges and deploys a hidden blade. Dimanche guides Cassal, whose eyes are unable to see in the dim Godolphian light, in a fight against the man, and Cassal seemingly dispatches the man. However, he quickly recovers and tackles Cassal, managing to steal his wallet and identification tab before running off. \n\tNow at the Travelers Aid Bureau, where an old technician is changing signs throughout the building, Cassal waits to enter a counseling room to ask about his onward journey to Tunney 21. Through a screen, he speaks with Murra Foray, who asks that he complete an onboarding questionnaire. He answers all the required questions, except for one which asks for his purpose in traveling to Tunney. We learn that Cassal aims to persuade a Tunnesian scientist to come to Earth in order to develop instantaneous radio, which would make them very wealthy. \n\tMurra reveals that the transport for which Cassal had been waiting had departed that morning, and that a man named Denton Cassal had been aboard it. Cassal concludes that his assailant from the previous night had stolen his identification tab with the intention of traveling to Tunney 21. Murra understands Cassal’s situation, and elicits a contribution from him in exchange for the Travelers Aid Bureau’s assistance. Throughout their conversation, Murra seems to bait Cassal into revealing his secret to success as a salesman; because of his possession of Dimanche, Cassal is able to successfully interpret his customers’ reactions. However, Cassal is wary of Murra’s line of questioning and reveals nothing. \n\tAs Cassal leaves the counseling room, he runs into the old man changing the signs, who reveals that Murra has recently assumed control of the Bureau. Cassal sees that the technician is afraid of Murra, but thinks nothing of it.\n"
              }
            ]
          },
          {
            "question_text": "Who is Dimanche, and how is he used in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "101",
                "uid": "53d459a19b394bf48d12d4769c2ce534",
                "response_text": "Dimanche is a device attached to Cassal's ear that is able to collect physiological data on a person, including nervous systems and physical reactions to stimuli. In addition, Dimanche is able to understand what people \"subvocalize\", or think to themselves in their subconscious. In the story, Dimanche's abilities are shown when he is able to read the thoughts of Cassal's attacker as well as his body's reactions to Cassal's movements, such as his heart rate and blood pressure. Dimanche's features also give Cassal an advantage in his work as a salesperson, as he is able to gauge people's thoughts, motives, and desires. Dimanche is a secret kept from the rest of the galaxy, and Cassal is hesitant to tell others about his abilities."
              },
              {
                "worker_id": "104",
                "uid": "38a3ab20487f48bba4d662b6bb7774b5",
                "response_text": "Dimanche is an electronic instrument that was invented on Earth. Cassal refers to Dimanche as a device. It is a secret instrument that very few know about. It has the ability to scan the nervous systems of individuals at short distances to collect and interpret data. He is used in the story to analyze the data that he collects from people nearby to complete a report of what a person says and thinks inside of their head. "
              },
              {
                "worker_id": "103",
                "uid": "8b70991044dd4ae6abc5679efd759973",
                "response_text": "Dimanche is a device invented on Earth to help Cassal analyze people. Dimanche is first used to help Cassel notice a man that is stalking him, Dimanche gives his analysis and interpretations about that man, confirming his intention. Dimanche believes that there is some connection between the delay in the transit ship to Tunney 21 and the stalker. So Cassal decides to let the guy find him and see what he is trying to do. When the guy tries to hurt Cassal, Dimanche helps him to fight the man since Cassal cannot see the guy after dark. With Dimanche’s information, Cassal is able to stab the guy. Then he realizes that he has accidentally killed him after Dimanche found no heartbeat and he is not breathing. But neither Dimanche nor Cassal is aware of their ability to pretend to be dead. So before Cassal could react to Dimanche’s warning, he gets hit and his wallet is stolen by the guy. \n\nLater at the travelers aid bureau, we learn that Dimanche is quite crucial to bring the researcher back to Earth. Moreover, Dimanche thought there’s something weird about the Murra Foray, the first counselor of the travelers aid bureau, but he could not identify anything else before  the electric guards slide into place. "
              },
              {
                "worker_id": "102",
                "uid": "b5013c2b078e4b08b75e454ec8c928d2",
                "response_text": "Dimanche is a device implanted next to the bone behind Denton Cassal’s ear which is able to detect various things about people in proximity to him. Among these things are heart rate, neural index, mental state, and motivation. An intelligent machine, Dimanche is also able to determine any concealed weapons, and can silently communicate with Cassal. Dimanche is an example of the advanced technology of Earth, and Cassal hopes to demonstrate it to a scientist on Tunney 21 to convince him to join Neuronics Inc., in developing instantaneous radio. \n\tCassal employs Dimanche’s capabilities several times throughout the story, often without giving explicit instructions. It is first employed in assessing the mental states and likely motivations of Cassal’s assailant. Dimanche is able to locate the assailant when Cassal’s eyes, in virtue of the poor lighting, could not, and is able to communicate his location to Cassal. Later, Dimanche is used in the Traveler’s Aid Bureau to gather information about Murra Fora, but, as it reaches her, electronic guards prevent it from gathering any information other than her planet of origin. \n"
              }
            ]
          },
          {
            "question_text": "Why is Cassal on his way to Tunney 21?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "101",
                "uid": "53d459a19b394bf48d12d4769c2ce534",
                "response_text": "Cassal is sent on a business trip by Neuronics, Inc., to visit Tunney 21 to see a man. Tunney 21, according to the first counselor, is home to some of the galaxy's most genius scientists. It is later revealed that Neuronics, Inc. wants that man on their staff back on Earth. The man would work towards the company's goal of developing instantaneous radio; this radio system would impact the entire galaxy, technology that could share information with every planet with no time delay. This radio would dominate means of transportation, communications, and commerce. For these reasons, Cassal is not eager to disclose his plans for going to Tunney 21."
              },
              {
                "worker_id": "104",
                "uid": "38a3ab20487f48bba4d662b6bb7774b5",
                "response_text": "Denton Cassal was selected to make the journey to Tunney 21 because he is the best sales engineer at Neuronics, Inc. He is secretive about why he wants to go to Tunney 21. He reveals that he wants to go to Tunney 21 to find a research worker that could help Neuronics perfect their instantaneous radio. If he were able to convince the researcher to go to Earth and work on the radio, he would get a share of the profits. An instantaneous radio would be invaluable throughout the galaxy, the profits for both Neuronics and him would be large. "
              },
              {
                "worker_id": "103",
                "uid": "8b70991044dd4ae6abc5679efd759973",
                "response_text": "Cassal is a sales engineer back on Earth where he did very good since he matched very well to his instrument. Thus he was selected to go on a trip to see a man. Since this man is at Tunney 21, Cassal has to travel all the way from Earth to Tunney 21. Tunney 21 has great scientists and especially the one that works on Neuronics. If Earth can get his help, then Earth will have perfect instantaneous radio that span the whole Galaxy. Because of its monopoly in instantaneousness and vastness, Earth can literally set its own price. Thus, for this trip to Tunney 21, with the help of Dimanche, Cassal needs to persuade the researcher to come with him to Earth. This way he can also gain profit from the instantaneous radio which will be build afterward."
              },
              {
                "worker_id": "102",
                "uid": "b5013c2b078e4b08b75e454ec8c928d2",
                "response_text": "Cassal is on his way to Tunney 21 in order to convince a Tunnesian scientist to join his company, Neuronics. From the pieces of the scientist’s research that had reached Earth, it was concluded that he would be instrumental in perfecting instantaneous radio, a technology which would revolutionize communication in the galaxy. Neuronics aims to monopolize the technology and amass great wealth, from which Cassal would receive a commission.\nCassal, because of his possession of Dimanche, an intelligent implant capable of determining the thoughts of those nearby, is in a good position to negotiate terms with the scientist for two reasons: firstly because he will be able to guess the Tunnesian’s price, and secondly because Dimanche’s sophisticated technology will convince him that Earth is an advanced civilization.\n"
              }
            ]
          },
          {
            "question_text": "Who is Murra Foray and how is she significant to the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "101",
                "uid": "53d459a19b394bf48d12d4769c2ce534",
                "response_text": "Murra Foray is the First Counselor of the Traveler's Aid Bureau on Godolph. Little is known about her personally, other than the fact that she is a Huntner, a people from across the Galaxy. Foray was an intimidating, cold woman, who was particularly curious about Cassal. Upon Cassal's arrival, she interrogates him about his personal life before offering help. Additionally, once Cassal realizes he had missed the ship to Tunney 21, and is stranded on Godolph, Murra Foray offers little support or sympathy. Instead, she reprimands him for lack of identification and nevertheless presses for a financial contribution. Foray is a mysterious character, whose motives are questioned, especially by Dimanche; while Dimanche is usually able to read people, Foray had electronic guards protecting information, indicating that the Traveler's Aid Bureau is hiding something."
              },
              {
                "worker_id": "104",
                "uid": "38a3ab20487f48bba4d662b6bb7774b5",
                "response_text": "Murra Foray is the First Counselor at Travelers Aid Bureau. She is significant to the story because Cassal goes to her for help because he is unsure where the ship is that is supposed to take him to Tunney 21. She is described as being cool, clean, and with bright eyes. She is possibly younger than Cassal. Murra informs Cassal that without his identification card, no ship would be willing to let him board as identification is necessary to leave the ship in the region that Tunney 21 is located. She describes the Travelers Aid Bureau as a philanthropic agency that can help him solve his issue, for a price. She informs him that they will keep him informed. \n\nDimanche assesses Murra and claims that she is a Huntner, which is a sub-race of men that are located on the other side of the galaxy. Dimanche was not able to gather more information because she was blocking him from collecting data. After Cassal questions an old man about Murra, he receives a jarring reaction that he waves off without concern. \n"
              },
              {
                "worker_id": "103",
                "uid": "8b70991044dd4ae6abc5679efd759973",
                "response_text": "Murra Foray is the first counselor of the travelers aid bureau, she looks enigmatic and dangerous. At first, she is doubtful about Cassel’s destination to Tunney 21 and his occupation as a sales engineer. She points out that there are a thousand races, how is Cassal able to have special knowledge of all those different types of customers. \n\nLater she tells Cassal that his ship has already left in the morning. And no one is sure when the next ship will be coming to Godolph. Murra suggests five years if lucky. Star hopping would also take that much of time since he has only covered one third of the whole distance. Then later Murra realizes that someone has already boarded the ship under Cassal’s name, using Cassal’s identification. Now the stalker’s motive of stealing his wallet becomes clear. Then Murra suggests that he donate to the bureau so that they will help him with his special case, which he did. Afterwards, Dimanche suggest that Murra is a Huntner. But before Dimanche can learn anything else, the electronic guards stopped him. Outside the building of the bureau, Cassal learned that even the old man switching the signs on the building is afraid of Murra Foray. "
              },
              {
                "worker_id": "102",
                "uid": "b5013c2b078e4b08b75e454ec8c928d2",
                "response_text": "Murra Foray is the new first counselor at the Travelers Aid Bureau on Godolph. She is a Huntner, a sub-race of humans from the other side of the galaxy. First appearing on a screen in a Bureau counseling room in which the protagonist Denton Cassal enters, she asks him to fill out a questionnaire. Cassal is unable to determine her age, but comments that she is taller than average, lean, and has a broad face that narrows at her chin. \n\tMurra asks Cassal why he has not answered the question about the purpose of his onward journey to Tunney 21, and speculates that it is to recruit a scientist for his company. She reveals to him that the transport for which he had been waiting had already departed, and offers her help in arranging alternate transportation to Tunney. She elicits a monetary donation from Cassal before terminating their conversation. \n\tAs Cassal leaves the counseling room, he encounters an old technician who seems afraid of Murra. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "101",
                "uid": "53d459a19b394bf48d12d4769c2ce534",
                "response_text": "The story takes place in a city on Godolph, a planet that acts as a transfer location in between stars. Godolph is a threatening and violent city, not safe for ordinary humans. A unique feature of Godolph is that its environment is specifically catered to natives, where the weather is controlled, often with heavy rain. The city is compared to Venice, where water is used as a mode of transport and essential to engineering. Additionally, at dusk the city becomes dark for travelers, but bright for its natives. "
              },
              {
                "worker_id": "104",
                "uid": "38a3ab20487f48bba4d662b6bb7774b5",
                "response_text": "The story is set on Godolph, in a Godolphian city. Violence occurs in these cities and they typically shut down at dusk. Being a human pedestrian at night is not a safe option. Cassal is on Godolph as it is in between Earth, which he left, and Tunney 21, where he intends to go. He describes Godolph as a backwards planet.  As Cassal is walking on the street, there is a tide of water that is used by Godolphian’s as a transportation network. He is walking in the rain as that is the type of weather preferred by Godolphian’s. \n\nCassal heads down an alley at the direction of Dimanche. The alley is narrow and dark with a slow-moving, oily type of water jutting from one side and large walls standing overhead on the other side. \n\nEventually, Cassal finds himself at the Travelers Aid Bureau. The building is shaped like a square block. The Bureau was similar to a maze inside with many small counseling rooms. A\n\nCassal is only 1/3 of the distance to Tunnel 21. \n"
              },
              {
                "worker_id": "103",
                "uid": "8b70991044dd4ae6abc5679efd759973",
                "response_text": "The story is set at the place called Godolph. Godolph is the place that travelers transfer from a star that is located further from the Galaxy to the stars that are located near the center of the Galaxy. The story follows Cassal as he walk to the deserted intersection to fight with the guy since Dimanche suggests that there is a connection between him and the delay in his ship. After fighting with the guy, he gets the guys wallet but loses his. Without his identification, he comes to the travelers aid bureau. Here he has to answer questions in order to get a consultation. And during the consultation he learns about missing the ship and about someone who boarded the ship using his identity. Then the story ends with him walking out of the bureau building and asking an old man about Murra Foray, but apparently he is too afraid to answer him. "
              },
              {
                "worker_id": "102",
                "uid": "b5013c2b078e4b08b75e454ec8c928d2",
                "response_text": "The first scene of the story takes place on the poorly illuminated streets of the planet Godolph. The natives of the planet have sensitive eyes, and as a result the streets appear dimly lit for human eyes. It rains often on Godolph, whose climate is controlled by its amphibian inhabitants who are fond of rain. A means of transportation on Godolph is the transport tide, rapidly moving water which carries Godolphian natives to their destination quickly and quietly. In the scene where Cassal is confronted by an assailant, there is oily water moving on one side of a narrow alley, and high walls on the opposite side. \n\tThe second half of the story is set in the labyrinthine Travelers Aid Bureau, whose busy corridors are pocketed with small counseling rooms. In each counseling room is a small door into which visitors can deposit contributions to the agency. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5070,
        "document_length_chars": 30236
      }
    }
  ]
}