{
  "item_metadata": {
    "item_id": "51167",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51167",
      "content": "Butterfly 9\n \n \n By DONALD KEITH\n \n Illustrated by GAUGHAN\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction January 1957. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n Jeff needed a job and this man had a job to offer—one where giant economy-size trouble had labels like fakemake, bumsy and peekage!\n \n\n\n I\n \n At first, Jeff scarcely noticed the bold-looking man at the next table. Nor did Ann. Their minds were busy with Jeff's troubles.\n \n \"You're still the smartest color engineer in television,\" Ann told Jeff as they dallied with their food. \"You'll bounce back. Now eat your supper.\"\n \n \"This beanery is too noisy and hot,\" he grumbled. \"I can't eat. Can't talk. Can't think.\" He took a silver pillbox from his pocket and fumbled for a black one. Those were vitamin pills; the big red and yellow ones were sleeping capsules. He gulped the pill.\n \n Ann looked disapproving in a wifely way. \"Lately you chew pills like popcorn,\" she said. \"Do you really need so many?\"\n \n \"I need something. I'm sure losing my grip.\"\n \n Ann stared at him. \"Baby! How silly! Nothing happened, except you lost your lease. You'll build up a better company in a new spot. We're young yet.\"\n \n \n\n \n Jeff sighed and glanced around the crowded little restaurant. He wished he could fly away somewhere. At that moment, he met the gaze of the mustachioed man at the next table.\n \n The fellow seemed to be watching him and Ann. Something in his confident gaze made Jeff uneasy. Had they met before?\n \n Ann whispered, \"So you noticed him, too. Maybe he's following us. I think I saw him on the parking lot where we left the car.\"\n \n Jeff shrugged his big shoulders. \"If he's following us, he's nuts. We've got no secrets and no money.\"\n \n \"It must be my maddening beauty,\" said Ann.\n \n \"I'll kick him cross-eyed if he starts anything,\" Jeff said. \"I'm just in the mood.\"\n \n Ann giggled. \"Honey, what big veins you have! Forget him. Let's talk about the engineering lab you're going to start. And let's eat.\"\n \n He groaned. \"I lose my appetite every time I think about the building being sold. It isn't worth the twelve grand. I wouldn't buy it for that if I could. What burns me is that, five years ago, I could have bought it for two thousand.\"\n \n \"If only we could go back five years.\" She shrugged fatalistically.\n\"But since we can't—\"\n \n The character at the next table leaned over and spoke to them, grinning. \"You like to get away? You wish to go back?\"\n \n Jeff glanced across in annoyance. The man was evidently a salesman, with extra gall.\n \n \"Not now, thanks,\" Jeff said. \"Haven't time.\"\n \n The man waved his thick hand at the clock, as if to abolish time.\n\"Time? That is nothing. Your little lady. She spoke of go back five years. Maybe I help you.\"\n \n He spoke in an odd clipped way, obviously a foreigner. His shirt was yellow. His suit had a silky sheen. Its peculiar tailoring emphasized the bulges in his stubby, muscular torso.\n \n Ann smiled back at him. \"You talk as if you could take us back to 1952. Is that what you really mean?\"\n \n \"Why not? You think this silly. But I can show you.\"\n \n Jeff rose to go. \"Mister, you better get to a doctor. Ann, it's time we started home.\"\n \n \n\n \n Ann laid a hand on his sleeve. \"I haven't finished eating. Let's chat with the gent.\" She added in an undertone to Jeff, \"Must be a psycho—but sort of an inspired one.\"\n \n The man said to Ann, \"You are kind lady, I think. Good to crazy people. I join you.\"\n \n He did not wait for consent, but slid into a seat at their table with an easy grace that was almost arrogant.\n \n \"You are unhappy in 1957,\" he went on. \"Discouraged. Restless. Why not take trip to another time?\"\n \n \"Why not?\" Ann said gaily. \"How much does it cost?\"\n \n \"Free trial trip. Cost nothing. See whether you like. Then maybe we talk money.\" He handed Jeff a card made of a stiff plastic substance.\n \n Jeff glanced at it, then handed it to Ann with a half-smile. It read:\n \n \n 4-D TRAVEL BEURO Greet Snader, Traffic Ajent\n \n \"Mr. Snader's bureau is different,\" Jeff said to his wife. \"He even spells it different.\"\n \n Snader chuckled. \"I come from other time. We spell otherwise.\"\n \n \"You mean you come from the future?\"\n \n \"Just different time. I show you. You come with me?\"\n \n \"Come where?\" Jeff asked, studying Snader's mocking eyes. The man didn't seem a mere eccentric. He had a peculiar suggestion of humor and force.\n \n \"Come on little trip to different time,\" invited Snader. He added persuasively, \"Could be back here in hour.\"\n \n \"It would be painless, I suppose?\" Jeff gave it a touch of derision.\n \n \"Maybe not. That is risk you take. But look at me. I make trips every day. I look damaged?\"\n \n As a matter of fact, he did. His thick-fleshed face bore a scar and his nose was broad and flat, as if it had been broken. But Jeff politely agreed that he did not look damaged.\n \n Ann was enjoying this. \"Tell me more, Mr. Snader. How does your time travel work?\"\n \n \"Cannot explain. Same if you are asked how subway train works. Too complicated.\" He flashed his white teeth. \"You think time travel not possible. Just like television not possible to your grandfather.\"\n \n Ann said, \"Why invite us? We're not rich enough for expensive trips.\"\n \n \"Invite many people,\" Snader said quickly. \"Not expensive. You know Missing Persons lists, from police? Dozens people disappear. They go with me to other time. Many stay.\"\n \n \"Oh, sure,\" Jeff said. \"But how do you select the ones to invite?\"\n \n \"Find ones like you, Mr. Elliott. Ones who want change, escape.\"\n \n \n\n \n Jeff was slightly startled. How did this fellow know his name was Elliott?\n \n Before he could ask, Ann popped another question. \"Mr. Snader, you heard us talking. You know we're in trouble because Jeff missed a good chance five years ago. Do you claim people can really go back into the past and correct mistakes they've made?\"\n \n \"They can go back. What they do when arrive? Depends on them.\"\n \n \"Don't you wish it were true?\" she sighed to Jeff.\n \n \"You afraid to believe,\" said Snader, a glimmer of amusement in his restless eyes. \"Why not try? What you lose? Come on, look at station. Very near here.\"\n \n Ann jumped up. \"It might be fun, Jeff. Let's see what he means, if anything.\"\n \n Jeff's pulse quickened. He too felt a sort of midsummer night's madness—a yearning to forget his troubles. \"Okay, just for kicks. But we go in my car.\"\n \n Snader moved ahead to the cashier's stand. Jeff watched the weasel-like grace of his short, broad body.\n \n \"This is no ordinary oddball,\" Jeff told Ann. \"He's tricky. He's got some gimmick.\"\n \n \"First I just played him along, to see how loony he was,\" Ann said.\n\"Now I wonder who's kidding whom.\" She concluded thoughtfully, \"He's kind of handsome, in a tough way.\"\n \n \n\n II\n \n Snader's \"station\" proved to be a middle-sized, middle-cost home in a good neighborhood. Lights glowed in the windows. Jeff could hear the whisper of traffic on a boulevard a few blocks away. Through the warm dusk, he could dimly see the mountains on the horizon. All was peaceful.\n \n Snader unlocked the front door with a key which he drew from a fine metal chain around his neck. He swept open the front door with a flourish and beamed at them, but Ann drew back.\n \n \"'Walk into my parlor, said the spider to the fly,'\" she murmured to Jeff. \"This could be a gambling hell. Or a dope den.\"\n \n \"No matter what kind of clip joint, it can't clip us much,\" he said.\n\"There's only four bucks in my wallet. My guess is it's a 'temple' for some daffy religious sect.\"\n \n They went in. A fat man smiled at them from a desk in the hall. Snader said, \"Meet Peter Powers. Local agent of our bureau.\"\n \n The man didn't get up, but nodded comfortably and waved them toward the next room, after a glance at Snader's key.\n \n The key opened this room's door, too. Its spring lock snapped shut after them.\n \n The room was like a doctor's waiting room, with easy chairs along the walls. Its only peculiar aspects were a sign hanging from the middle of the ceiling and two movie screens—or were they giant television screens?—occupying a whole wall at either end of the room.\n \n The sign bore the number 701 in bright yellow on black. Beneath it, an arrow pointed to the screen on the left with the word Ante , and to the right with the word Post .\n \n \n\n \n Jeff studied the big screens. On each, a picture was in motion. One appeared to be moving through a long corridor, lined with seats like a railroad club car. The picture seemed to rush at them from the left wall. When he turned to the right, a similar endless chair-lined corridor moved toward him from that direction.\n \n \"Somebody worked hard on this layout,\" he said to Snader. \"What's it for?\"\n \n \"Time travel,\" said Snader. \"You like?\"\n \n \"Almost as good as Disneyland. These movies represent the stream of time, I suppose?\"\n \n \n\n \n Instead of answering, Snader pointed to the screen. The picture showed a group of people chatting in a fast-moving corridor. As it hurtled toward them, Snader flipped his hand in a genial salute. Two people in the picture waved back.\n \n Ann gasped. \"It was just as if they saw us.\"\n \n \"They did,\" Snader said. \"No movie. Time travelers. In fourth dimension. To you, they look like flat picture. To them, we look flat.\"\n \n \"What's he supposed to be?\" Jeff asked as the onrushing picture showed them briefly a figure bound hand and foot, huddled in one of the chairs. He stared at them piteously for an instant before the picture surged past.\n \n Snader showed his teeth. \"That was convict from my time. We have criminals, like in your time. But we do not kill. We make them work. Where he going? To end of line. To earliest year this time groove reach. About 600 A.D., your calendar. Authorities pick up when he get there. Put him to work.\"\n \n \"What kind of work?\" Jeff asked.\n \n \"Building the groove further back.\"\n \n \"Sounds like interesting work.\"\n \n Snader chortled and slapped him on the back. \"Maybe you see it some day, but forget that now. You come with me. Little trip.\"\n \n Jeff was perspiring. This was odder than he expected. Whatever the fakery, it was clever. His curiosity as a technician made him want to know about it. He asked Snader, \"Where do you propose to go? And how?\"\n \n Snader said, \"Watch me. Then look at other wall.\"\n \n He moved gracefully to the screen on the left wall, stepped into it and disappeared. It was as if he had slid into opaque water.\n \n Jeff and Ann blinked in mystification. Then they remembered his instruction to watch the other screen. They turned. After a moment, in the far distance down the long moving corridor, they could see a stocky figure. The motion of the picture brought him nearer. In a few seconds, he was recognizable as Snader—and as the picture brought him forward, he stepped down out of it and was with them again.\n \n \"Simple,\" Snader said. \"I rode to next station. Then crossed over. Took other carrier back here.\"\n \n \"Brother, that's the best trick I've seen in years,\" Jeff said. \"How did you do it? Can I do it, too?\"\n \n \"I show you.\" Grinning like a wildcat, Snader linked his arms with Ann and Jeff, and walked them toward the screen. \"Now,\" he said. \"Step in.\"\n \n \n\n \n Jeff submitted to Snader's pressure and stepped cautiously into the screen. Amazingly, he felt no resistance at all, no sense of change or motion. It was like stepping through a fog-bank into another room.\n \n In fact, that was what they seemed to have done. They were in the chair-lined corridor. As Snader turned them around and seated them, they faced another moving picture screen. It seemed to rush through a dark tunnel toward a lighted square in the far distance.\n \n The square grew on the screen. Soon they saw it was another room like the waiting room they had left, except that the number hanging from the ceiling was 702. They seemed to glide through it. Then they were in the dark tunnel again.\n \n Ann was clutching Jeff's arm. He patted her hand. \"Fun, hey? Like Alice through the looking-glass.\"\n \n \"You really think we're going back in time?\" she whispered.\n \n \"Hardly! But we're seeing a million-dollar trick. I can't even begin to figure it out yet.\"\n \n Another lighted room grew out of the tunnel on the screen, and when they had flickered through it, another and then another.\n \n \"Mr. Snader,\" Ann said unsteadily, \"how long—how many years back are you taking us?\"\n \n Snader was humming to himself. \"Six years. Station 725 fine place to stop.\"\n \n For a little while, Jeff let himself think it might be true. \"Six years ago, your dad was alive,\" he mused to Ann. \"If this should somehow be real, we could see him again.\"\n \n \"We could if we went to our house. He lived with us then, remember? Would we see ourselves, six years younger? Or would—\"\n \n Snader took Jeff's arm and pulled him to his feet. The screen was moving through a room numbered 724.\n \n \"Soon now,\" Snader grunted happily. \"Then no more questions.\"\n \n He took an arm of each as he had before. When the screen was filled by a room with the number 725, he propelled them forward into it.\n \n \n\n \n Again there was no sense of motion. They had simply stepped through a bright wall they could not feel. They found themselves in a replica of the room they had left at 701. On the wall, a picture of the continuous club-car corridor rolled toward them in a silent, endless stream.\n \n \"The same room,\" Ann said in disappointment. \"They just changed the number. We haven't been anywhere.\"\n \n \n\n \n Snader was fishing under his shirt for the key. He gave Ann a glance that was almost a leer. Then he carefully unlocked the door.\n \n In the hall, a motherly old lady bustled up, but Snader brushed past her. \"Official,\" he said, showing her the key. \"No lodging.\"\n \n He unlocked the front door without another word and carefully shut it behind them as Jeff and Ann followed him out of the house.\n \n \"Hey, where's my car?\" Jeff demanded, looking up and down the street.\n \n The whole street looked different. Where he had parked his roadster, there was now a long black limousine.\n \n \"Your car is in future,\" Snader said briskly. \"Where it belong. Get in.\" He opened the door of the limousine.\n \n Jeff felt a little flame of excitement licking inside him. Something was happening, he felt. Something exciting and dangerous.\n \n \"Snader,\" he said, \"if you're kidnaping us, you made a mistake. Nobody on Earth will pay ransom for us.\"\n \n Snader seemed amused. \"You are foolish fellow. Silly talk about ransom. You in different time now.\"\n \n \"When does this gag stop?\" Jeff demanded irritably. \"You haven't fooled us. We're still in 1957.\"\n \n \"You are? Look around.\"\n \n Jeff looked at the street again. He secretly admitted to himself that these were different trees and houses than he remembered. Even the telephone poles and street lights seemed peculiar, vaguely foreign-looking. It must be an elaborate practical joke. Snader had probably ushered them into one house, then through a tunnel and out another house.\n \n \"Get in,\" Snader said curtly.\n \n Jeff decided to go along with the hoax or whatever it was. He could see no serious risk. He helped Ann into the back seat and sat beside her. Snader slammed the door and slid into the driver's seat. He started the engine with a roar and they rocketed away from the curb, narrowly missing another car.\n \n Jeff yelled, \"Easy, man! Look where you're going!\"\n \n Snader guffawed. \"Tonight, you look where you are going.\"\n \n Ann clung to Jeff. \"Did you notice the house we came out of?\"\n \n \"What about it?\"\n \n \"It looked as though they were afraid people might try to break in. There were bars at the windows.\"\n \n \"Lots of houses are built that way, honey. Let's see, where are we?\" He glanced at house numbers. \"This is the 800 block. Remember that. And the street—\" He peered up at a sign as they whirled around a corner.\n\"The street is Green Thru-Way. I never heard of a street like that.\"\n \n \n\n III\n \n They were headed back toward what should have been the boulevard. The car zoomed through a cloverleaf turn and up onto a broad freeway. Jeff knew for certain there was no freeway there in 1957—nor in any earlier year. But on the horizon, he could see the familiar dark bulk of the mountains. The whole line of moonlit ridges was the same as always.\n \n \"Ann,\" he said slowly, \"I think this is for real. Somehow I guess we escaped from 1957. We've been transported in time.\"\n \n She squeezed his arm. \"If I'm dreaming, don't wake me! I was scared a minute ago. But now, oh, boy!\"\n \n \"Likewise. But I still wonder what Snader's angle is.\" He leaned forward and tapped the driver on his meaty shoulder. \"You brought us into the future instead of the past, didn't you?\"\n \n It was hard to know whether Snader was sleepy or just bored, but he shrugged briefly to show there was no reply coming. Then he yawned.\n \n Jeff smiled tightly. \"I guess we'll find out in good time. Let's sit back and enjoy the strangest ride of our lives.\"\n \n As the limousine swept along through the traffic, there were plenty of big signs for turn-offs, but none gave any hint where they were. The names were unfamiliar. Even the language seemed grotesque. \"Rite Channel for Creepers,\" he read. \"Yaw for Torrey Rushway\" flared at him from a fork in the freeway.\n \n \"This can't be the future,\" Ann said. \"This limousine is almost new, but it doesn't even have an automatic gear shift—\"\n \n She broke off as the car shot down a ramp off the freeway and pulled up in front of an apartment house. Just beyond was a big shopping center, ablaze with lights and swarming with shoppers. Jeff did not recognize it, in spite of his familiarity with the city.\n \n Snader bounded out, pulled open the rear door and jerked his head in a commanding gesture. But Jeff did not get out. He told Snader, \"Let's have some answers before we go any further.\"\n \n Snader gave him a hard grin. \"You hear everything upstairs.\"\n \n The building appeared harmless enough. Jeff looked thoughtfully at Ann.\n \n She said, \"It's just an apartment house. We've come this far. Might as well go in and see what's there.\"\n \n Snader led them in, up to the sixth floor in an elevator and along a corridor with heavy carpets and soft gold lights. He knocked on a door.\n \n \n\n \n A tall, silver-haired, important-looking man opened it and greeted them heartily.\n \n \"Solid man, Greet!\" he exclaimed. \"You're a real scratcher! And is this our sharp?\" He gave Jeff a friendly but appraising look.\n \n \"Just what you order,\" Snader said proudly. \"His name—Jeff Elliott. Fine sharp. Best in his circuit. He brings his lifemate, too. Ann Elliott.\"\n \n The old man rubbed his smooth hands together. \"Prime! I wish joy,\" he said to Ann and Jeff. \"I'm Septo Kersey. Come in. Bullen's waiting.\"\n \n He led them into a spacious drawing room with great windows looking out on the lights of the city. There was a leather chair in a corner, and in it sat a heavy man with a grim mouth. He made no move, but grunted a perfunctory \"Wish joy\" when Kersey introduced them. His cold eyes studied Jeff while Kersey seated them in big chairs.\n \n Snader did not sit down, however. \"No need for me now,\" he said, and moved toward the door with a mocking wave at Ann.\n \n Bullen nodded. \"You get the rest of your pay when Elliott proves out.\"\n \n \"Here, wait a minute!\" Jeff called. But Snader was gone.\n \n \"Sit still,\" Bullen growled to Jeff. \"You understand radioptics?\"\n \n The blood went to Jeff's head. \"My business is television, if that's what you mean. What's this about?\"\n \n \"Tell him, Kersey,\" the big man said, and stared out the window.\n \n Kersey began, \"You understand, I think, that you have come back in time. About six years back.\"\n \n \"That's a matter of opinion, but go on.\"\n \n \"I am general manager of Continental Radioptic Combine, owned by Mr. Dumont Bullen.\" He nodded toward the big man. \"Chromatics have not yet been developed here in connection with radioptics. They are well understood in your time, are they not?\"\n \n \"What's chromatics? Color television?\"\n \n \"Exactly. You are an expert in—ah—colored television, I think.\"\n \n Jeff nodded. \"So what?\"\n \n The old man beamed at him. \"You are here to work for our company. You will enable us to be first with chromatics in this time wave.\"\n \n Jeff stood up. \"Don't tell me who I'll work for.\"\n \n \n\n \n Bullen slapped a big fist on the arm of his chair. \"No fog about this! You're bought and paid for, Elliott! You'll get a fair labor contract, but you do what I say!\"\n \n \"Why, the man thinks he owns you.\" Ann laughed shakily.\n \n \"You'll find my barmen know their law,\" Bullen said. \"This isn't the way I like to recruit. But it was only way to get a man with your knowledge.\"\n \n Kersey said politely, \"You are here illegally, with no immigrate permit or citizen file. Therefore you cannot get work. But Mr. Bullen has taken an interest in your trouble. Through his influence, you can make a living. We even set aside an apartment in this building for you to live in. You are really very luxe, do you see?\"\n \n Jeff's legs felt weak. These highbinders seemed brutally confident. He wondered how he and Ann would find their way home through the strange streets. But he put on a bold front.\n \n \"I don't believe your line about time travel and I don't plan to work for you,\" he said. \"My wife and I are walking out right now. Try and stop us, legally or any other way.\"\n \n Kersey's smooth old face turned hard. But, unexpectedly, Bullen chuckled deep in his throat. \"Good pop and bang. Like to see it. Go on, walk out. You hang in trouble, call up here—Butterfly 9, ask for Bullen. Whole exchange us. I'll meet you here about eleven tomorrow pre-noon.\"\n \n \"Don't hold your breath. Let's go, Ann.\"\n \n When they were on the sidewalk, Ann took a deep breath. \"We made it. For a minute, I thought there'd be a brawl. Why did they let us go?\"\n \n \"No telling. Maybe they're harmless lunatics—or practical jokers.\" He looked over his shoulder as they walked down the street, but there was no sign of pursuit. \"It's a long time since supper.\"\n \n \n\n \n Her hand was cold in his and her face was white. To take her mind off their problem, he ambled toward the lighted shop windows.\n \n \"Look at that sign,\" he said, pointing to a poster over a display of neckties. \"'Sleek neck-sashes, only a Dick and a dollop!' How do they expect to sell stuff with that crazy lingo?\"\n \n \"It's jive talk. They must cater to the high-school crowd.\" Ann glanced nervously at the strolling people around them. \"Jeff, where are we? This isn't any part of the city I've ever seen. It doesn't even look much like America.\" Her voice rose. \"The way the women are dressed—it's not old-fashioned, just different.\"\n \n \"Baby, don't be scared. This is an adventure. Let's have fun.\" He pressed her hand soothingly and pulled her toward a lunch counter.\n \n If the haberdasher's sign was jive, the restaurant spoke the same jargon. The signs on the wall and the bill of fare were baffling. Jeff pondered the list of beef shingles, scorchers, smack sticks and fruit chills, until he noticed that a couple at the counter were eating what clearly were hamburgers—though the \"buns\" looked more like tortillas.\n \n Jeff jerked his thumb at them and told the waitress, \"Two, please.\"\n \n When the sandwiches arrived, they were ordinary enough. He and Ann ate in silence. A feeling of foreboding hung over them.\n \n When they finished, the clerk gave him a check marked 1/20. Jeff looked at it thoughtfully, shrugged and handed it to the cashier with two dollar bills.\n \n The man at the desk glanced at them and laughed. \"Stage money, eh?\"\n \n \"No, that's good money,\" Jeff assured him with a rather hollow smile.\n\"They're just new bills, that's all.\"\n \n The cashier picked one up and looked at it curiously. \"I'm afraid it's no good here,\" he said, and pushed it back.\n \n The bottom dropped out of Jeff's stomach. \"What kind of money do you want? This is all I have.\"\n \n The cashier's smile faded. He caught the eye of a man in uniform on one of the stools. The uniform was dark green, but the man acted like a policeman. He loomed up beside Jeff.\n \n \"What's the rasper?\" he demanded. Other customers, waiting to pay their checks, eyed Jeff curiously.\n \n \"I guess I'm in trouble,\" Jeff told him. \"I'm a stranger here and I got something to eat under the impression that my money was legal tender. Do you know where I can exchange it?\"\n \n \n\n \n The officer picked up the dollar bill and fingered it with evident interest. He turned it over and studied the printing. \"United States of America,\" he read aloud. \"What are those?\"\n \n \"It's the name of the country I come from,\" Jeff said carefully.\n\"I—uh—got on the wrong train, apparently, and must have come further than I thought. What's the name of this place?\"\n \n \"This is Costa, West Goodland, in the Continental Federation. Say, you must come from an umpty remote part of the world if you don't know about this country.\" His eyes narrowed. \"Where'd you learn to speak Federal, if you come from so far?\"\n \n Jeff said helplessly, \"I can't explain, if you don't know about the United States. Listen, can you take me to a bank, or some place where they know about foreign exchange?\"\n \n The policeman scowled. \"How'd you get into this country, anyway? You got immigrate clearance?\"\n \n An angry muttering started among the bystanders.\n \n The policeman made up his mind. \"You come with me.\"\n \n At the police station, Jeff put his elbows dejectedly on the high counter while the policeman talked to an officer in charge. Some men whom Jeff took for reporters got up from a table and eased over to listen.\n \n \"I don't know whether to charge them with fakemake, bumsy, peekage or lunate,\" the policeman said as he finished.\n \n His superior gave Jeff a long puzzled stare.\n \n Jeff sighed. \"I know it sounds impossible, but a man brought me in something he claimed was a time traveler. You speak the same language I do—more or less—but everything else is kind of unfamiliar. I belong in the United States, a country in North America. I can't believe I'm so far in the future that the United States has been forgotten.\"\n \n There ensued a long, confused, inconclusive interrogation.\n \n The man behind the desk asked questions which seemed stupid to Jeff and got answers which probably seemed stupid to him.\n \n The reporters quizzed Jeff gleefully. \"Come out, what are you advertising?\" they kept asking. \"Who got you up to this?\"\n \n The police puzzled over his driver's license and the other cards in his wallet. They asked repeatedly about the lack of a \"Work License,\" which Jeff took to be some sort of union card. Evidently there was grave doubt that he had any legal right to be in the country.\n \n In the end, Jeff and Ann were locked in separate cells for the night. Jeff groaned and pounded the bars as he thought of his wife, imprisoned and alone in a smelly jail. After hours of pacing the cell, he lay down in the cot and reached automatically for his silver pillbox. Then he hesitated.\n \n In past weeks, his insomnia had grown worse and worse, so that lately he had begun taking stronger pills. After a longing glance at the big red and yellow capsules, he put the box away. Whatever tomorrow brought, it wouldn't find him slow and drowsy.\n \n \n\n IV\n \n He passed a wakeful night. In the early morning, he looked up to see a little man with a briefcase at his cell door.\n \n \"Wish joy, Mr. Elliott,\" the man said coolly. \"I am one of Mr. Bullen's barmen. You know, represent at law? He sent me to arrange your release, if you are ready to be reasonable.\"\n \n Jeff lay there and put his hands behind his head. \"I doubt if I'm ready. I'm comfortable here. By the way, how did you know where I was?\"\n \n \"No problem. When we read in this morning's newspapers about a man claiming to be a time traveler, we knew.\"\n \n \"All right. Now start explaining. Until I understand where I am, Bullen isn't getting me out of here.\"\n \n The lawyer smiled and sat down. \"Mr. Kersey told you yesterday—you've gone back six years. But you'll need some mental gymnastics to understand. Time is a dimension, not a stream of events like a movie film. A film never changes. Space does—and time does. For example, if a movie showed a burning house at Sixth and Main, would you expect to find a house burning whenever you returned to that corner?\"\n \n \"You mean to say that if I went back to 1865, I wouldn't find the Civil War was over and Lincoln had been assassinated?\"\n \n \"If you go back to the time you call 1865—which is most easily done—you will find that the people there know nothing of a Lincoln or that war.\"\n \n Jeff looked blank. \"What are they doing then?\"\n \n The little man spread his hands. \"What are the people doing now at Sixth and Main? Certainly not the same things they were doing the day of the fire. We're talking about a dimension, not an event. Don't you grasp the difference between the two?\"\n \n \"Nope. To me, 1865 means the end of the Civil War. How else can you speak of a point in time except by the events that happened then?\"\n \n \"Well, if you go to a place in three-dimensional space—say, a lake in the mountains—how do you identify that place? By looking for landmarks. It doesn't matter that an eagle is soaring over a mountain peak. That's only an event. The peak is the landmark. You follow me?\"\n \n \"So far. Keep talking.\"",
      "metadata": {
        "title": "Butterfly 9",
        "author": "Donald Keith",
        "passage_id": "51167",
        "uid": "fa007cda081b4ea49beebbbe072d8af8",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "10",
                "uid": "94cecd3da9374d6b93edce3a87af109b",
                "response_text": "Jeff Elliott and his wife Ann meet a peculiar stranger, Mr. Snader, at a restaurant in the year 1957 as they are discussing Jeff’s desire to go 5 years into the past to buy a building for $2000 that would’ve changed his luck entirely. The stranger had been listening to their conversation and was seeking someone with Jeff’s credentials (color television engineer) to complete an illegal job he’d been hired for. Jeff and Ann have no idea that Mr. Snader is on such a job, but entertain his quirky conversation.\n\nMr. Snader has a friendly and persuasive personality, narrowly convincing Jeff and Ann to follow him to his time travel station and take a free trip to see if they like it. The Elliots do not perceive the situation as dangerous, and continue choosing to trust him at each step. Ultimately, the Elliots are escorted six years back in time through a time travelling process that appears like stepping through a screen, but their past is nothing like they remember. It is a different place entirely, and though they are frightened, their excitement and perhaps also their complete reliance on Mr. Snader to get them back home, causes them to keep following him even though he has become mean with them. \n\nMr. Snader takes the Elliotts to an apartment house to meet Septo Kersey and Dumont Bullen, the general manager of Continental Radioptic Combine. It’s revealed that Mr. Snader tricked the Elliots, and brought them to Mr. Bullen who had illegally sought Jeff’s services as a color engineer to profit his own interests by creating color television that did not yet exist in their time. Jeff was furious, and totally helpless.\n\nJeff and Ann were allowed to leave, because their captors were certain that they could not actually escape them. They had no idea how to leave this timeline, and had no way of finding justice being illegally present with no work permits. When Jeff and Ann stop for lunch and try to pay with the money in their pockets (which appears as illegal tender), they are approached by an officer and find out they are in a place called Costa, West Goodland, in the Continental Federation. Everyone in the interaction is deeply confused, because time travel is not understood to be possible by the public - Jeff and Ann look crazy. Both are escorted to separate jail cells in a prison.\n\nOne of Mr. Bullen's barmen, a lawyer, was sent to arrange Jeff’s release, if he was willing to cooperate and go work for Mr. Bullen. The lawyer has to explain to Jeff the concept of time travelling before he can get any cooperation, and so says that time travel is entering a different dimension, not moving along a linear timeline. Things look so different to Jeff in the past because he didn’t travel back a linear path to exactly the way things were when he experienced these things six years ago. The story ends during their discussion.\n"
              },
              {
                "worker_id": "1",
                "uid": "9603ebadf8614b538af88a55d40103b6",
                "response_text": "The year is 1957. Jeff and Ann sit at a restaurant and discuss Jeff’s business troubles. He is concerned that he made a bad business choice five years ago. Ann tries to reassure him that that he has plenty of time to make it all back again. Greet Snader, a foreign man with a mustache, sits nearby, and overhears their conversation. He asks if they would like to go back in time. Jeff tries to leave, but Ann insists that they listen to what he has to say. Snader hands them his card and offers them a free trial. He calls Jeff Mr. Elliot although Jeff has not given the stranger his name. This gives Jeff the slightest sense of hesitation, but Ann is eager to go with Snader.\n\nAnn and Jeff follow Snader to the station, which turns out to be a reasonably-sized home in a residential neighborhood. Inside, there are two screens hanging from the ceiling. One is labeled “Ante” while the other is labeled “Post.” Each screen shows a movie, and when Snader salutes the people that appear on one screen, the strangers wave back. Ann and Jeff are both shocked because the entire thing seems impossible. Ann and Jeff watch Snader step into one of the screens, and when they look at the other screen, he steps out. \n \nSnader tells them they are going back six years. They step into a screen and jump out a few moments later. When they walk through the same door they entered, the surroundings are different, and Jeff’s car has been replaced by a limousine. Snader drives, and they do not recognize anything around them. Snader stops the car outside of a building and tells them to follow him inside. \n\nAnn and Jeff meet Mr. Bullen. He explains that he is the general manager of Continental Radioptic Combine, and he needs Jeff, someone from the future, to make sure that he gets colored television before anyone else. Jeff refuses to work for him, but Bullen says that Jeff is there illegally without a permit or a file. Jeff and Ann call his bluff and leave, but Bullen reminds them to call Butterfly 9 if they get in trouble. The couple goes to a restaurant, and when Jeff tries to pay, the cashier says it’s counterfeit. They find out that they’re in a country called Continental Federation, and these people have never heard of the U.S. Jeff and Ann are taken to jail. One of Mr. Bullen’s henchmen shows up to talk to Jeff, and he explains that Jeff and Ann went back in time six years, but time isn’t like a movie. Events don’t stay consistent in the past because dimensions change. Technically, Snader didn’t lie, but he manipulated Jeff into believing that time traveling is something that it’s not. \n"
              },
              {
                "worker_id": "2",
                "uid": "e219c6c0ba3e40f899cd6034fa6fe4a5",
                "response_text": "\n\tJeff and Ann Elliott are having dinner in a restaurant after Jeff has learned he’ll need to start his business over again after his building is sold. They are approached by a man at the next table who has been watching and listening to them and who offers them a chance to get away. At first, they think he means a trip, but he is referring to time travel. Jeff says he wishes he could go back five years and buy the building. The man offers them time travel for free and gives Jeff his business card, identifying him as Greet Snader, Traffic Ajent for the 4-D Travel Beuro. Snader invites them to come with him and indicates they can be back in one hour. Jeff and Ann ask many questions but ultimately decide to go with Snader to see what he is about.\nHe takes them to his station, a mid-sized home in a middle-class neighborhood, and shows them a room labeled 701 with two screens, indicating that they are showing people who are time traveling right now in the fourth dimension. He waves at some of them, and they wave back at him. Snader demonstrates how the screens work, walking into one and then exiting from the other. Jeff wants to try this, and he and Ann enter. Snader says they will exit at Station 725 which is six years in the past. When they exit the screen, they are in another house; Snader escorts them to a limousine outside, explaining to Jeff that his car isn’t there because it’s in the future. Jeff and Ann notice that the street seems somehow different than it did when they arrived. \nSnader drives them across town, using a freeway where Jeff knows there was only a boulevard in the past. He accuses Snader of taking them to the future rather than the past, but Snader doesn’t respond. He pulls up in front of an apartment building and tells Jeff that he’ll learn everything upstairs when Jeff demands answers before getting out of the car. In a luxurious apartment, they are introduced to Septo Kersey, who congratulates Snader for bringing Jeff and then takes the couple to meet Mr. Bullen. Bullen confirms that Jeff understands radioptics and chromatics and then tells him that he will develop these features for his company. Angered, Jeff tells Bullen he won’t be told who he works for and that he and Ann are leaving. Bullen allows them to go but warns that they will be in serious legal trouble since they have no immigrate permit or citizen file. \nJeff and Ann walk to a restaurant at a nearby shopping center to eat, and all the food on the menu is unfamiliar. They eat a meal, but when Jeff tries to pay with his money, the clerk calls the police over because his money is no good. Jeff and Ann are locked in jail overnight until Bullen’s lawyer comes the next day to get them out.\n"
              },
              {
                "worker_id": "3",
                "uid": "eb397ba002bf44ef92ddb72a2a61c457",
                "response_text": "Over dinner, Ann tells her husband Jeff (a TV color specialist) that he will be able to make a comeback after his building's lease has expired. Snader, a man at the next table who had been listening, suggested that they go back in time to get a better deal on the sale. Jeff dismisses him but the man joins them at their table, explaining that he’s from a different time and offering them a free trial time-travel trip at the “4-D Travel Beuro”, Ann asks for more details: Snader invites people who want change, but he knows more about Jeff than expected. Despite these concerns, his wife agrees to give time travel a try. They head to an average home in a good neighborhood that serves as Snader’s office, where they meet Peter Powers, a bureau agent. They enter a room labeled \"701\" with two large screens with moving pictures; the people on these screens are explained to be time travelers in the fourth dimension. This time groove can reach as early as 600AD, with convicts from Snader's time working to build the groove further back. Snader walked into one of the screens, and Jeff and Ann saw him in the other screen shortly after. Jeff is convinced this is a visual trick and wants to be shown how it works, and hesitantly steps into one of the screens. Snader leads them six years prior but tells them they can’t ask any more questions, and they get out at station 725, a room that looks identical to the one they left from. Nothing else is the same: Powers is gone, and the street outside looks different; Snader insists it’s because they have traveled through time. Ann is over her fear and feels excited, figuring that they were in the future instead of the past because of a freeway they did not recognize, but Snader doesn’t confirm anything. They explore and eventually meet an older man named Septo Kersey, who has asked for Snader to retrieve Jeff to work for him, as a sort of informant in color television technology. Kersey and Bullen (another man who works for the company) threaten the couple, saying they were illegal immigrants in this particular time stream. Jeff and Ann insist on leaving, and are given instructions of how to return if they get into trouble. It’s now Ann who’s concerned, and Jeff tries to calm her as they look for food. After they eat, they learn that their money isn’t recognized in this society; they are in the Continental Federation, not the United States, even though their languages are mutually intelligible. Jeff is convinced he’s so far in the future that the US has been forgotten, the police think he’s trying to fool them. One of Bullen’s lawyers was there for them when they woke up, and tried to explain that time is a dimension, not a series of events, so that nobody would have experienced the same history that Jeff had. "
              }
            ]
          },
          {
            "question_text": "Describe the settings the story takes place in.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "10",
                "uid": "94cecd3da9374d6b93edce3a87af109b",
                "response_text": "The story takes place on Earth, in the year 1957. It opens in a restaurant, and quickly transitions to Mr. Snader’s 4-D TRAVEL BEURO time travel station, inside of a “middle-sized, middle-cost home in a good neighborhood.” They could hear traffic dimly in the station and see mountains out the windows on the horizon.  \n\nThe time travelling room appears like a doctor's waiting room, with chair lined walls. There is a station sign - 701 - that hangs on the ceiling and two movie screens on the far ends of the room. Stepping through one screen would take them forwards in time, and one backwards in time. The Elliotts go to station 725, which Mr. Snader tells them is six years in the past.\n\nThe past is very unfamiliar, more industrialized with more highways than they remember. After travelling in a limousine, they transition to a 6th floor apartment house of a building with heavy carpets and soft lighting.\nThe final settings are a lunch counter, with unfamiliar food to the Elliotts, and finally their jail cells.\n"
              },
              {
                "worker_id": "1",
                "uid": "9603ebadf8614b538af88a55d40103b6",
                "response_text": "Ann and Jeff meet Greet Snader in a restaurant where they are having dinner and discussing Jeff’s business troubles. After meeting Snader, they follow him to a place called a “station.” They are surprised to find that it’s actually a moderately-sized home in a residential neighborhood. It doesn’t look suspicious at all. Jeff notes the mountains on the horizon and the warm breeze he feels before he steps inside. Snader uses a key hanging from his necklace to unlock the door, and once inside, he leads the couple to an area that looks a lot like a doctor’s waiting room. However, there are two screens hanging from the ceiling, and they are both playing moving pictures. There is a large plaque that says “701”, and Jeff and Ann do not know what to make of it. They are even more dumbfounded when Snader salutes some of the people on screen, and they wave back at him. \n\nAfter Jeff and Ann time travel, they exit the screen and find that the room looks very similar to the one they were just in. For a moment, they believe that Snader has tricked them. However, when they leave the building, they find a limousine out front instead of Jeff’s car. They drive through the city they call home, but none of the signs and landmarks are even remotely the same. \n\nAfter leaving Mr. Bullen’s office, they walk around town a little bit and quickly realize that the language on all the signage is different from how they speak. One reads, “'Sleek neck-sashes, only a Dick and a dollop!” Ann also notes that the women dress strangely, and it’s unlike anything she’s ever seen before. After noticing that all of the food at the restaurant looks slightly different than what they’re used to, they learn that they are actually in the town of Costa, in the state of West Goodland, in the country of Continental Federation. The language they are speaking is called Federal, and the cash they are using appears to be counterfeit. Although Jeff and Ann believed they would be returning to the exact same world they knew six years ago when Ann’s father was alive and he lived with them, they were misled by Snader. The couple was actually taken to a different dimension where events have unfolded in completely different ways.\n"
              },
              {
                "worker_id": "2",
                "uid": "e219c6c0ba3e40f899cd6034fa6fe4a5",
                "response_text": "The first setting is 1957 in a small, crowded, noisy, and hot restaurant. Jeff and Ann are having dinner, and Snader’s table is near enough that he can overhear the couple talking. This enables him to join their conversation and eventually lure them into time travel.\nSnader takes the Elliotts to the second setting, the station where he begins their time travel. The station is located in a mid-sized house in a middle-class neighborhood. Lights are glowing in the windows as they arrive, and outside they can hear the traffic on the boulevard a few blocks away. It is dusk, the weather is warm, and Jeff can see the mountains on the horizon. Snader unlocks the door, and they are greeted by a man at a desk in the hallway who sends them to another room. \nThis room is the station. A sign with the number 701 hangs from the middle of the ceiling, and there are two big screens like movies screens hanging on one wall, showing movement through a corridor with rows of seats like a railroad car. There are easy chairs along the walls, making it look like a doctor’s office waiting room. \nWhen they enter the screen, they are in the chair-lined corridor. Snader tells the Elliotts to sit, and they face a screen like the one in the room they had just left. The image on the screen makes it look as if they are racing through a dark tunnel toward a light at the far end. As they approach the light, they see a room like 701, but this one is 702. They exit at room 725 by stepping through the screen.\nStation 725 looks much like 701, but when they leave the room, there is a motherly old lady outside. Snader tells them they aren’t there for lodging, and they leave the house. Outside, Jeff notices his car is missing. Snader tells him it’s in the future. The street outside the house has different trees and houses than he remembered in the neighborhood with the 701 station. Telephone poles and streetlights also seem different. As the limousine pulls away from the curb, Jeff makes it a point to remember the street name, Green Thru-Way, and the block number, 800. Ann notices bars on the windows of the house. The limo heads onto a freeway where the boulevard should be, but the mountains are the same as always. Signs are unfamiliar and have strange wording like Rite Channel for Creepers and Yaw for Torrey Rushway.\nSnader takes the Elliotts to an apartment building near a shopping center with bright lights and lots of shoppers, neither of which are familiar. Snader escorts them inside the apartment building, riding the elevator to the sixth floor and traversing a heavily carpeted hallway with soft gold lights. Later they eat at a restaurant with unfamiliar food names and monetary units; their check is for 1/20. Finally, the Elliotts are imprisoned in a jail with smelly cells.\n\n"
              },
              {
                "worker_id": "3",
                "uid": "eb397ba002bf44ef92ddb72a2a61c457",
                "response_text": "The story starts in a restaurant, but quickly moves to a house that is known as the 4-D Travel Beuro. This is a fairly typical, mid-range house of average size in a good neighborhood, which keeps it from sticking out in any way because nobody would be suspicious of it. Inside the house there are a number of ornate rooms locked behind closed doors, guarded by a bureau agent known as Peter Powers. Behind one of these doors is the room that serves as station 701 on this particular time groove, that has two large screens that show moving images of people who seem to be aware of the people standing in the room. People can easily step into these rooms and find themselves traveling on a time groove, and this is how Jeff and Ann travel to the time Snader is from. Once they have traveled through time, they expect to see the same suburban neighborhood but much of the context has changed: a different highway, different cars, and different houses. The people in this time use different currency and have different vocabulary than the people Jeff and Ann are used to. After some time in lockup, Jeff and Ann also encounter an apartment building. On the sixth floor of this building, they meet the man who hired Snader to find Jeff. There is an ornate drawing room where Jeff and Ann have a meeting with Septo Kersey and a man named Bullen who are hoping they can use Jeff's expertise to move ahead of the technological developments of their own time. Refusing to help, Jeff and Ann leave and are eventually captured for not having legal money, and the story ends with them in a holding cell at a local police station."
              }
            ]
          },
          {
            "question_text": "What is the significance of time in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "10",
                "uid": "94cecd3da9374d6b93edce3a87af109b",
                "response_text": "Time travel is suggested as a way to solve troubles. To fix regrets. Ironically, it is not this at all, because the way time travel works is not linear. Thus, it’s not possible to go back to an exact moment in your past and make a different decision.\n\nJeff is very impatient about the time they are spending with Mr. Snader, but continues to be roped into one thing and the next by convincing himself that they are in no real danger. There is a kind of tension between Jeff feeling like he is wasting time, but then allowing time to run on as their involvement with Mr. Snader deepens further and further until they lose 6 years of time completely.\n"
              },
              {
                "worker_id": "1",
                "uid": "9603ebadf8614b538af88a55d40103b6",
                "response_text": "At the beginning of the story, Jeff is worried that he has lost so much time on his failed business. Ann tries to convince him that he’s still plenty young, and he has many years to make back whatever he lost. Snader hears their conversation and butts in. Ann and Jeff don’t realize that he has already had his sights on them specifically because Jeff has been ordered by Mr. Bullen to improve his business. Bullen wants to make colored television before anyone else can, and in order to do that he needs someone from the future to give him the secrets. \n\nSnader makes Jeff and Ann believe they are going on an adventure to visit the past that they knew only six years ago, but he lies to them. They do not understand that the past does not work like a movie. When you travel to the past, the events change. This is because time is a dimension, and it is not linear. One of Bullen’s henchmen explains to Jeff that if he went back to 1865, there would no longer be a Civil War, and no one would know who Abraham Lincoln is. Landmarks, like the mountains outside of the station, will not change, but events will. "
              },
              {
                "worker_id": "2",
                "uid": "e219c6c0ba3e40f899cd6034fa6fe4a5",
                "response_text": "Time is significant in the story because it is the basis for Jeff’s unhappiness and the couple’s reception of Snader’s travel offer. The reality of time as a dimension is why Jeff doesn’t recognize the past when he and Ann travel back. Jeff wishes he could go back in time five years and buy the building where he has been working for $2,000. It has just sold for $12,000, and now he has to leave and start his business over again. Snader’s offer of time travel appeals to Jeff and Ann because Jeff believes he’ll be able to buy the building. Snader’s assurance that they can be back in an hour helps persuade the couple to go with him to the nearby station. When they go into the screen to travel through time and Snader drives them along a freeway that didn’t exist in the present 1957 or five years earlier, Jeff is convinced that Snader has actually taken them to the future. Kersey tells them that they have traveled six years back in time before the development of chromatics (color television). Bullen wants Jeff to develop color television for his company, Continental Radioptic Combine, so that he will be first on the market with color TVs. When Jeff and Ann eat at the restaurant, and Jeff tries to pay with two one-dollar bills, the clerk calls the bills “stage money” and motions for a policeman to come to them. The officer looks at the bills and wonders aloud what the United States of America is and tells Jeff he is in Costa, West Goodland, in the Continental Federation. None of this makes sense to Jeff and Ann, and when Jeff is interrogated at the police station, the questions seems stupid to him. When Bullen’s lawyer arrives to get Jeff and Ann out of jail, he explains to Jeff that he did travel six years in the past but that time is a dimension rather than a stream of events. He indicates that if Jeff went back to 1865, the people there would know nothing of Lincoln or the Civil War. Therefore, Jeff’s idea that he could buy the building is incorrect because different events will be happening in 1952. \n"
              },
              {
                "worker_id": "3",
                "uid": "eb397ba002bf44ef92ddb72a2a61c457",
                "response_text": "Time plays a few roles in this story. One is the motivation for Jeff and Ann to be interested in the time-travel technology in the first place: if Jeff could travel back in time a few years, he could sign a lease for a building for a much cheaper price that the going rate in his own time. Snader takes advantage of this fact to slip himself into the conversation the couple is having and offer his services in time travel, the particular mechanics of which are another major role of time in this story. Snader offers a time travel service that works with a technology too complicated for him to be able to explain, but for which we see two screens in one room that have moving images on them. These screens show people passing through the timestream and work as stations along a moving path of time, kind of like a train line. Once the group travels on this \"time groove\", they notice a number of differences in the \"new\" time, the past that Snader comes from. In fact, because of the differences, even though Ann and Jeff are in the past, they think that they must be far in the future because of how different things are. One of these is the construction of a highway that was not there during their time, and the other is that nobody has heard of the United States of America. Jeff figures that nobody has heard of where he comes from because they have moved so far forward in time, when it is really because in this version of the past, the United States did not develop in the way it did in Jeff's time. Because time affects the way language develops, it is interesting that one of the major differences between the time Jeff and Ann live in compared to the time Snader is from is the way people talk. In the past (that is, Snader's time), there are a lot of phrases and nouns that do not match the same words that Jeff and Ann have for those same concepts. The word for lawyer, for instance, differs. However, the languages have enough in common for the people from the different times to communicate with one another. The story ends with a discussion of how this time travel works, to show how differently the various people think about time. "
              }
            ]
          },
          {
            "question_text": "What is the relationship like between Jeff and Ann?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "10",
                "uid": "94cecd3da9374d6b93edce3a87af109b",
                "response_text": "Jeff and Ann Elliott are a married couple. Ann is supportive of Jeff, and assures him that with their youth he will be able to rebuild his failed business. She reassures him throughout the story, even at points where it ultimately leads them into deeper trouble - such as when she tells him it wouldn’t hurt to try Mr. Snader’s time travel. \n\nJeff is protective of Ann on several occasions, like at the start of the story suggesting he would start a brawl at the restaurant if the stranger was interested in Ann’s beauty. He is also upset enough with his business struggles that he needs to take sleeping pills, of which Ann is concerned about the amount.\n\nThey remain together in the story until they are held in separate jail cells. They do not have any major disagreements in the story, and seem to enjoy their time together, only hoping to improve their lot by trying a risky time travel adventure.\n"
              },
              {
                "worker_id": "1",
                "uid": "9603ebadf8614b538af88a55d40103b6",
                "response_text": "Jeff and Ann have a loving and supportive relationship. When Jeff is feeling down on himself, Ann reminds him that he’s great at his job and that he has plenty of time to bounce back. She worries about the number of pills he’s taking, and she insists that he stop worrying about losing his lease. She is genuinely concerned for his mental health and his overall well-being. The couple can easily joke around with one another. When Ann suggests that Snader might be following them, she makes light of the situation by suggesting that it’s because he’s attracted to her. Jeff, in turn, offers to physically assault him if he tries anything. After meeting Mr. Snader, both Jeff and Ann have a good time playing along with the scenario they never imagined themselves being a part of. It doesn’t take a lot of prodding on Ann’s part to make Jeff go to the station with her and Snader. They both have a devil-may-care attitude that makes this adventure worth checking out. \n\nLater, when they find themselves in a heap of trouble and end up in separate jail cells, Jeff can only think of Ann. He worries about her being all alone for the night. \n"
              },
              {
                "worker_id": "2",
                "uid": "e219c6c0ba3e40f899cd6034fa6fe4a5",
                "response_text": "Jeff and Ann are like many married couples; when one is down or frightened, the other tries to build him up or assure him that all will be fine. They switch between these roles with each other easily, suggesting that they have been married a good while. Ann is supportive of Jeff’s career and his skills, assuring him that he will be able to start over and be successful again. She also teases him and makes humorous comments to lighten his mood. When they disagree with each other, it isn’t antagonistic. When Jeff wants to leave but Ann wants to hear what Snader has to say, she simply puts her hand on Jeff’s arm and says she hasn’t finished eating and would like to hear what Snader has to say. Jeff and Ann also play off of each other. When Ann jumps up to see what Snader wants to show them, Jeff’s pulse picks up as he entertains the idea, too. They make decisions together; when Jeff is undecided about going into the apartment building, he looks to Ann to see her reaction. When she says they might as well go inside and see what is there, Jeff agrees and goes along with her. They make a good team: Bullen’s comment that Jeff is going to make his company be the first to produce chromatics, Jeff’s takes affront at the man’s boldness, and Ann is likewise disturbed.\n"
              },
              {
                "worker_id": "3",
                "uid": "eb397ba002bf44ef92ddb72a2a61c457",
                "response_text": "Jeff and Ann react differently to most things, but in a way where they are able to balance each other out. For instance, when they meet Snader at the beginning of the story, Jeff is frustrated with the interruption to his dinner and does not want to hear more about what he thinks is bogus, but Ann is curious and wants to hear Snader out, to be entertained if nothing else. Ann is very supportive of Jeff and the story starts with her trying to console him about the recent failure of his business venture as a lease on a building he was using had ended. While reassuring him, she reminds him that he is excellent at what he does and have no trouble starting up again, but Jeff is feeling very grumpy and sad about the entire situation. Jeff is very cautious, and is concerned when he hears Snader use his last name, because he had never given the man his name. Ann is more on the curious side, willing to give anything a try, including a method of time travel she only knew about from a stranger she encountered at a restaurant. She does get a little bit nervous once she has actually stepped inside the device, but the fear dissipates once she is outside again in a whole new world. Although Jeff starts the story upset, he remains mostly calm throughout the story and even when he is hesitant he does not become overwhelmed with fear at his situation. He and Ann both have to encounter some issues with their money not working, and sorting out what to make of their situation, but they support each other and keep each other calm throughout the story. "
              }
            ]
          },
          {
            "question_text": "What is the relationship like between the Elliotts and Mr. Snader?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "10",
                "uid": "94cecd3da9374d6b93edce3a87af109b",
                "response_text": "Initially, the Elliotts find Mr. Snader to be peculiar with his mustache, facial scar, traces of a broken nose, and accented speech. Jeff is not interested in engaging with him, but Ann continues to deepen their conversation with him at the restaurant thinking that Mr. Snader is insane and she will humor his ideas.\n\nMr. Snader shows hints of being forceful to the Elliots throughout the story. His persuasiveness to come to his time travel station is forceful at times, he takes their arms to escort them into the future portal (as if he wants to ensure their compliance), and once they are roaming the city in the future Mr. Snader largely drops the act and stops being nice to the Elliots altogether (ignoring their requests for him to drive safely, and being curt with them to get them into his drop off spot with Mr. Bullen).\n\nThe Elliots are captivated by the silliness of Mr. Snader’s story at first, believing it is a magic trick right up until they travel into the past, and then seem largely blinded by their curiosity and excitement to think critically about how much danger they are really in. They acknowledge Mr. Snader is being deceitful at times, like when Jeff asks for his questions to be answered, but become so reliant on Mr. Snader’s support to get them back home that they remain with him. When Mr. Snader’s plan is revealed - that he has delivered the Eliotts into the past to be forced into labor to create a color television company - they feel betrayed by Mr. Snader.\n"
              },
              {
                "worker_id": "1",
                "uid": "9603ebadf8614b538af88a55d40103b6",
                "response_text": "The Elliots are initially wary of Snader. They look at him before he approaches them in the restaurant, and Ann tells her husband that she thinks she saw him outside in the parking lot. She wonders aloud if he has been following them. When he first starts up a conversation with them, Jeff immediately wants to leave, and it’s Ann who gets a kick out of the improbable dialogue they have. She wants to learn more about his insane-sounding ideas about time travel, although she doesn’t necessarily believe anything he’s saying at first. Both Jeff and Ann laugh at the card that Snader hands them because nearly every word is misspelled and to them he appears unprofessional. \n\nThey do not spend very much time with Snader, but they appear to trust him quite readily. They are skeptical about his promises and insist that it’s probably all fake, but they don’t associate the dishonesty with Snader personally. When Snader physically shows them how time traveling works by stepping in and out of the screens, Jeff and Ann are so excited that they actually link arms with the stranger. Moments later, Jeff calls him “brother”. Jeff initially insists that they take his car to go to the station, but when it disappears outside after they have time traveled, they have no problem getting into the backseat of a limousine and allowing Snader to drive them. When he brings them to a building they have never seen before, they wonder what could possibly be dangerous about it instead of insisting that they remain vigilant. Snader delivers Jeff and Ann right to the bad guys, and they never see it coming. Bullen’s guys thank Snader and mention the payment he will receive as a result of bringing them their victim, Jeff. Had Jeff and Ann refused to trust a stranger with a wild story about time traveling, they would not be stuck in another dimension. \n\n"
              },
              {
                "worker_id": "2",
                "uid": "e219c6c0ba3e40f899cd6034fa6fe4a5",
                "response_text": "The Elliotts are always somewhat suspicious of Mr. Snader, but they are intrigued by his claims and offer of time travel and curious enough to want to find out more about it. Snader uses Ann to draw the couple’s initial interest; she is more open to listening to him than Jeff is. Jeff is somewhat antagonistic to Snader, for example, commenting on the misspelled words on his business card and sometimes speaking to him derisively. Likewise, Snader mocks Jeff with his eyes. Ann is more open to Snader’s offer, asking him questions to learn more about it and commenting she wishes time travel could be true. Her receptiveness ignites Jeff’s desire to escape his worries for a while so that he is willing to learn more from Snader. When Snader takes them to the station, Ann expresses concerns to Jeff, but he believes they won’t be in danger. However, when Snader shows Jeff the screens and waves to people on them who wave back, the Elliotts are more convinced that what Snader offers is real. Snader is his nicest to Jeff just before they enter the time travel screen, but the closer they get to the apartment building, the less interested he is in answering questions and being polite. He orders them into the limousine and at one point issues a warning: “Tonight, you look where you are going.” Ann notices the station house has bars on it, and Jeff is suspicious enough that he makes a point of remembering the street names where the station is located so they will be able to find it again on their own. His tentative trust of Snader continues eroding when he realizes they are on a freeway that didn’t exist yet in the present. When he asks Snader if he’s brought them to the future instead of the past, Snader doesn’t even bother to answer. At the apartment, Jeff and Ann learn that Snader was paid to bring them there, and he “mockingly” waves at them as he leaves now that his job is done.\n\n\n"
              },
              {
                "worker_id": "3",
                "uid": "eb397ba002bf44ef92ddb72a2a61c457",
                "response_text": "The relationship between the Elliotts and Mr. Snader is one with varying levels of distrust and suspicion but also some curiosity and genuine interest. When they all meet, Jeff is suspicious of everything that Mr. Snader says and does not thing it is worth his time to listen to Snader talk. Ann is curious, though, and wants to hear Snader out. It is not clear from this first part of the story what Snader thinks of the Elliots besides his interest in them as people who might be able to benefit from what he has to offer, at least on the surface. Once they all arrive at the \"4-D Travel Beuro\", as Ann has agreed to give Snader's time travel a try, the suspicion is continued. Because Jeff is an expert in color television, he is convinced everything he is seeing is some kind of visual trick and he wants to learn how it works. Jeff lets this color his interactions with Snader, and most of what he says to him has some audible distrust. At this point, Ann is also worried, once they step into the moving picture, but her fear dissipates once they are outside of the house in a different time. During this time travel, Jeff and Ann have had a lot of questions for Snader, but he is not answering any of them, at least not directly--this adds to the mistrust felt by the Elliotts. Once Snader drops the Elliots off with Kersey, they are understandably upset when they realize they have been tricked."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5144,
        "document_length_chars": 29349
      }
    }
  ]
}