{
  "item_metadata": {
    "item_id": "51203",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51203",
      "content": "A Coffin for Jacob\n \n \n By EDWARD W. LUDWIG\n \n Illustrated by EMSH\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction May 1956. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n With never a moment to rest, the pursuit through space felt like a game of hounds and hares ... or was it follow the leader?\n \n\n \n Ben Curtis eased his pale, gaunt body through the open doorway of the Blast Inn, the dead man following silently behind him.\n \n His fear-borne gaze traveled into the dimly illumined Venusian gin mill. The place was like an evil caldron steaming with a brew whose ingredients had been culled from the back corners of three planets.\n \n Most of the big room lay obscured behind a shimmering veil of tobacco smoke and the sweet, heavy fumes of Martian Devil's Egg. Here and there, Ben saw moving figures. He could not tell if they were Earthmen, Martians or Venusians.\n \n Someone tugged at his greasy coat. He jumped, thinking absurdly that it was the dead man's hand.\n \n \" Coma esta, senor? \" a small voice piped. \" Speken die Deutsch? Desirez-vous d'amour? Da? Nyet? \"\n \n Ben looked down.\n \n The speaker was an eager-eyed Martian boy of about ten. He was like a red-skinned marionette with pipestem arms and legs, clad in a torn skivvy shirt and faded blue dungarees.\n \n \"I'm American,\" Ben muttered.\n \n \"Ah, buena ! I speak English tres fine, senor . I have Martian friend, she tres pretty and tres fat. She weigh almost eighty pounds, monsieur . I take you to her, si ?\"\n \n Ben shook his head.\n \n \n\n \n He thought, I don't want your Martian wench. I don't want your opium or your Devil's Egg or your Venusian kali. But if you had a drug that'd bring a dead man to life, I'd buy and pay with my soul.\n \n \n \"It is deal, monsieur ? Five dollars or twenty keelis for visit Martian friend. Maybe you like House of Dreams. For House of Dreams—\"\n \n \"I'm not buying.\"\n \n The dirty-faced kid shrugged. \"Then I show you to good table,— tres bien . I do not charge you, senor .\"\n \n The boy grabbed his hand. Because Ben could think of no reason for resisting, he followed. They plunged into shifting layers of smoke and through the drone of alcohol-cracked voices.\n \n \n\n \n They passed the bar with its line of lean-featured, slit-eyed Earthmen—merchant spacemen.\n \n They wormed down a narrow aisle flanked by booths carved from Venusian marble that jutted up into the semi-darkness like fog-blanketed tombstones.\n \n Several times, Ben glimpsed the bulky figures of CO\n 2\n -breathing Venusians, the first he'd ever seen.\n \n They were smoky gray, scaly, naked giants, toads in human shape. They stood solitary and motionless, aloof, their green-lidded eyes unblinking. They certainly didn't look like telepaths, as Ben had heard they were, but the thought sent a fresh rivulet of fear down his spine.\n \n Once he spied a white-uniformed officer of Hoover City's Security Police. The man was striding down an aisle, idly tapping his neuro-club against the stone booths.\n  Keep walking , Ben told himself. You look the same as anyone else here. Keep walking. Look straight ahead.\n \n \n The officer passed. Ben breathed easier.\n \n \"Here we are, monsieur ,\" piped the Martian boy. \"A tres fine table. Close in the shadows.\"\n \n Ben winced. How did this kid know he wanted to sit in the shadows? Frowning, he sat down—he and the dead man.\n \n He listened to the lonely rhythms of the four-piece Martian orchestra.\n \n The Martians were fragile, doll-like creatures with heads too large for their spindly bodies. Their long fingers played upon the strings of their cirillas or crawled over the holes of their flutes like spider legs. Their tune was sad. Even when they played an Earth tune, it still seemed a song of old Mars, charged with echoes of lost voices and forgotten grandeur.\n \n For an instant, Ben's mind rose above the haunting vision of the dead man. He thought, What are they doing here, these Martians? Here, in a smoke-filled room under a metalite dome on a dust-covered world? Couldn't they have played their music on Mars? Or had they, like me, felt the challenge of new worlds?\n \n \n He sobered. It didn't matter. He ordered a whiskey from a Chinese waiter. He wet his lips but did not drink. His gaze wandered over the faces of the Inn's other occupants.\n  You've got to find him , he thought. You've got to find the man with the red beard. It's the only way you can escape the dead man.\n \n \n \n\n \n The dead man was real. His name was Cobb. He was stout and flabby and about forty and he hated spacemen.\n \n His body was buried now—probably in the silent gray wastes outside Luna City. But he'd become a kind of invisible Siamese twin, as much a part of Ben as sight in his eyes.\n \n Sometimes the image would be shuffling drunkenly beside him, its lips spitting whiskey-slurred curses.\n \n Again, its face would be a pop-eyed mask of surprise as Ben's fist thudded into its jaw. More often, the face would be frozen in the whiteness of death. The large eyes would stare. Blood would trickle from a corner of the gaping mouth.\n \n You can forget a living man. You can defeat him or submit to him or ignore him, and the matter is over and done. You can't escape from a memory that has burned into your mind.\n \n It had begun a week ago in Luna City. The flight from White Sands had been successful. Ben, quietly and moderately, wanted to celebrate. He stopped alone in a rocketfront bar for a beer. The man named Cobb plopped his portly and unsteady posterior on the stool next to him.\n \n \"Spacemen,\" he muttered, \"are getting like flies. Everywhere, all you see's spacemen.\"\n \n He was a neatly dressed civilian.\n \n Ben smiled. \"If it weren't for spacemen, you wouldn't be here.\"\n \n \"The name's Cobb.\" The man hiccoughed. \"Spacemen in their white monkey suits. They think they're little tin gods. Betcha you think you're a little tin god.\" He downed a shot of whiskey.\n \n Ben stiffened. He was twenty-four and dressed in the white, crimson-braided uniform of the Odyssey's junior astrogation officer. He was three months out of the Academy at White Sands and the shining uniform was like a key to all the mysteries of the Universe.\n \n He'd sought long for that key.\n \n \n\n \n At the age of five—perhaps in order to dull the memory of his parents' death in a recent strato-jet crash—he'd spent hours watching the night sky for streaking flame-tails of Moon rockets. At ten, he'd ground his first telescope. At fourteen, he'd converted an abandoned shed on the government boarding-school grounds to a retreat which housed his collection of astronomy and rocketry books.\n \n At sixteen, he'd spent every weekend holiday hitchhiking from Boys Town No. 5 in the Catskills to Long Island Spaceport. There, among the grizzled veterans of the old Moon Patrol, he'd found friends who understood his dream and who later recommended his appointment to the U. S. Academy for the Conquest of Space.\n \n And a month ago, he'd signed aboard the Odyssey —the first ship, it was rumored, equipped to venture as far as the asteroids and perhaps beyond.\n \n Cobb was persistent: \"Damn fools shoulda known enough to stay on Earth. What the hell good is it, jumpin' from planet to planet?\"\n  The guy's drunk , Ben thought. He took his drink and moved three stools down the bar.\n \n Cobb followed. \"You don't like the truth, eh, kid? You don't like people to call you a sucker.\"\n \n Ben rose and started to leave the bar, but Cobb grabbed his arm and held him there.\n \n \"Thas what you are—a sucker. You're young now. Wait ten years. You'll be dyin' of radiation rot or a meteor'll get you. Wait and see, sucker!\"\n \n Until this instant, Ben had suppressed his anger. Now, suddenly and without warning, it welled up into savage fury.\n \n His fist struck the man on the chin. Cobb's eyes gaped in shocked horror. He spun backward. His head cracked sickeningly on the edge of the bar. The sound was like a punctuation mark signaling the end of life.\n \n He sank to the floor, eyes glassy, blood tricking down his jaw.\n \n Ben knew that he was dead.\n \n Then, for a single absurd second, Ben was seized with terror—just as, a moment before, he'd been overwhelmed with anger.\n \n He ran.\n \n \n\n \n For some twenty minutes, he raced through a dizzying, nightmare world of dark rocketfront alleys and shouting voices and pursuing feet.\n \n At last, abruptly, he realized that he was alone and in silence. He saw that he was still on the rocketfront, but in the Tycho-ward side of the city.\n \n He huddled in a dark corner of a loading platform and lit a cigarette. A thousand stars—a thousand motionless balls of silver fire—shone above him through Luna City's transparent dome.\n \n He was sorry he'd hit Cobb, of course. He was not sorry he'd run. Escaping at least gave him a power of choice, of decision.\n  You can do two things , he thought.\n  You can give yourself up, and that's what a good officer would do. That would eliminate the escape charge. You'd get off with voluntary manslaughter. Under interplanetary law, that would mean ten years in prison and a dishonorable discharge. And then you'd be free.\n \n  But you'd be through with rockets and space. They don't want new men over thirty-four for officers on rockets or even for third-class jet-men on beat-up freighters—they don't want convicted killers. You'd get the rest of the thrill of conquering space through video and by peeking through electric fences of spaceports.\n \n  Or—\n \n \n There were old wives' tales of a group of renegade spacemen who operated from the Solar System's frontiers. The spacemen weren't outlaws. They were misfits, rejectees from the clearing houses on Earth.\n \n And whereas no legally recognized ship had ventured past Mars, the souped-up renegade rigs had supposedly hit the asteroids. Their headquarters was Venus. Their leader—a subject of popular and fantastic conjecture in the men's audiozines—was rumored to be a red-bearded giant.\n  So , Ben reflected, you can take a beer-and-pretzels tale seriously. You can hide for a couple of days, get rid of your uniform, change your name. You can wait for a chance to get to Venus. To hell with your duty. You can try to stay in space, even if you exile yourself from Earth.\n \n \n After all, was it right for a single second, a single insignificant second, to destroy a man's life and his dream?\n \n \n\n \n He was lucky. He found a tramp freighter whose skipper was on his last flight before retirement. Discipline was lax, investigation of new personnel even more so.\n \n Ben Curtis made it to Venus.\n \n There was just one flaw in his decision. He hadn't realized that the memory of the dead man's face would haunt him, torment him, follow him as constantly as breath flowed into his lungs.\n \n But might not the rumble of atomic engines drown the murmuring dead voice? Might not the vision of alien worlds and infinite spaceways obscure the dead face?\n \n So now he sat searching for a perhaps nonexistent red-bearded giant, and hoping and doubting and fearing, all at once.\n \n \"You look for someone, senor ?\"\n \n He jumped. \"Oh. You still here?\"\n \n \" Oui. \" The Martian kid grinned, his mouth full of purple teeth. \"I keep you company on your first night in Hoover City, n'est-ce-pas ?\"\n \n \"This isn't my first night here,\" Ben lied. \"I've been around a while.\"\n \n \"You are spacemen?\"\n \n Ben threw a fifty-cent credit piece on the table. \"Here. Take off, will you?\"\n \n Spiderlike fingers swept down upon the coin. \" Ich danke, senor. You know why city is called Hoover City?\"\n \n Ben didn't answer.\n \n \"They say it is because after women come, they want first thing a thousand vacuum cleaners for dust. What is vacuum cleaner, monsieur ?\"\n \n Ben raised his hand as if to strike the boy.\n \n \" Ai-yee , I go. You keep listen to good Martian music.\"\n \n The toothpick of a body melted into the semi-darkness.\n \n Minutes passed. There were two more whiskeys. A ceaseless parade of faces broke through the smoky veil that enclosed him—reddish balloon faces, scaly reptilian faces, white-skinned, slit-eyed faces, and occasionally a white, rouged, powdered face. But nowhere was there a face with a red beard.\n \n A sense of hopelessness gripped Ben Curtis. Hoover City was but one of a dozen cities of Venus. Each had twenty dives such as this.\n \n He needed help.\n \n But his picture must have been 'scoped to Venusian visiscreens. A reward must have been offered for his capture. Whom could he trust? The Martian kid, perhaps?\n \n Far down the darkened aisle nearest him, his eyes caught a flash of white. He tensed.\n \n Like the uniform of a Security Policeman, he thought.\n \n His gaze shifted to another aisle and another hint of whiteness.\n \n And then he saw another and another and another.\n \n Each whiteness became brighter and closer, like shrinking spokes of a wheel with Ben as their focal point.\n  You idiot! The damned Martian kid! You should have known!\n \n \n \n\n \n Light showered the room in a dazzling explosion. Ben, half blinded, realized that a broad circle of unshaded globes in the ceiling had been turned on.\n \n The light washed away the room's strangeness and its air of brooding wickedness, revealing drab concrete walls and a debris-strewn floor.\n \n Eyes blinked and squinted. There were swift, frightened movements and a chorus of angry murmurs. The patrons of the Blast Inn were like tatter-clad occupants of a house whose walls have been ripped away.\n \n Ben Curtis twisted his lean body erect. His chair tumbled backward, falling.\n \n The white-clad men charged, neuro-clubs upraised.\n \n A woman screamed. The music ceased. The Martian orchestra slunk with feline stealth to a rear exit. Only the giant Venusians remained undisturbed. They stood unmoving, their staring eyes shifting lazily in Ben's direction.\n \n \"Curtis!\" one of the policemen yelled. \"You're covered! Hold it!\"\n \n Ben whirled away from the advancing police, made for the exit into which the musicians had disappeared.\n \n A hissing sound traveled past his left ear, a sound like compressed air escaping from a container. A dime-sized section of the concrete wall ahead of him crumbled.\n \n He stumbled forward. They were using deadly neuro-pistols now, not the mildly stunning neuro-clubs.\n \n Another hiss passed his cheek. He was about twelve feet from the exit. Another second , his brain screamed. Just another second—\n \n \n Or would the exits be guarded?\n \n He heard the hiss.\n \n It hit directly in the small of his back. There was no pain, just a slight pricking sensation, like the shallow jab of a needle.\n \n \n\n \n He froze as if yanked to a stop by a noose. His body seemed to be growing, swelling into balloon proportions. He knew that the tiny needle had imbedded itself deep in his flesh, knew that the paralyzing mortocain was spreading like icy fire into every fiber and muscle of his body.\n \n He staggered like a man of stone moving in slow motion. He'd have fifteen—maybe twenty—seconds before complete lethargy of mind and body overpowered him.\n \n In the dark world beyond his fading consciousness, he heard a voice yell, \"Turn on the damn lights!\"\n \n Then a pressure and a coldness were on his left hand. He realized that someone had seized it.\n \n A soft feminine voice spoke to him. \"You're wounded? They hit you?\"\n \n \"Yes.\" His thick lips wouldn't let go of the word.\n \n \"You want to escape—even now?\"\n \n \"Yes.\"\n \n \"You may die if you don't give yourself up.\"\n \n \"No, no.\"\n \n He tried to stumble toward the exit.\n \n \"All right then. Not that way. Here, this way.\"\n \n Heavy footsteps thudded toward them. A few yards away, a flashlight flicked on.\n \n Hands were guiding him. He was aware of being pushed and pulled. A door closed behind him. The glare of the flashlight faded from his vision—if he still had vision.\n \n \"You're sure?\" the voice persisted.\n \n \"I'm sure,\" Ben managed to say.\n \n \"I have no antidote. You may die.\"\n \n His mind fought to comprehend. With the anti-paralysis injection, massage and rest, a man could recover from the effects of mortocain within half a day. Without treatment, the paralysis could spread to heart and lungs. It could become a paralysis of death. An effective weapon: the slightest wound compelled the average criminal to surrender at once.\n \n \"Anti ... anti ...\" The words were as heavy as blobs of mercury forced from his throat. \"No ... I'm sure ... sure.\"\n \n He didn't hear the answer or anything else.\n \n \n\n \n Ben Curtis had no precise sensation of awakening. Return to consciousness was an intangible evolution from a world of black nothingness to a dream-like state of awareness.\n \n He felt the pressure of hands on his naked arms and shoulders, hands that massaged, manipulated, fought to restore circulation and sensitivity. He knew they were strong hands. Their strength seemed to transfer itself to his own body.\n \n For a long time, he tried to open his eyes. His lids felt welded shut. But after a while, they opened. His world of darkness gave way to a translucent cloak of mist. A round, featureless shape hovered constantly above him—a face, he supposed.\n \n He tried to talk. Although his lips moved slightly, the only sound was a deep, staccato grunting.\n \n But he heard someone say, \"Don't try to talk.\" It was the same gentle voice he'd heard in the Blast Inn. \"Don't talk. Just lie still and rest. Everything'll be all right.\"\n  Everything all right , he thought dimly.\n \n There were long periods of lethargy when he was aware of nothing. There were periods of light and of darkness. Gradually he grew aware of things. He realized that the soft rubber mouth of a spaceman's oxygen mask was clamped over his nose. He felt the heat of electric blankets swathed about his body. Occasionally a tube would be in his mouth and he would taste liquid food and feel a pleasant warmth in his stomach.\n \n Always, it seemed, the face was above him, floating in the obscuring mist. Always, it seemed, the soft voice was echoing in his ears:\n \n \"Swallow this now. That's it. You must have food.\" Or, \"Close your eyes. Don't strain. It won't be long. You're getting better.\"\n  Better , he'd think. Getting better....\n \n \n At last, after one of the periods of lethargy, his eyes opened. The mist brightened, then dissolved.\n \n He beheld the cracked, unpainted ceiling of a small room, its colorless walls broken with a single, round window. He saw the footboard of his aluminite bed and the outlines of his feet beneath a faded blanket.\n \n Finally he saw the face and figure that stood at his side.\n \n \"You are better?\" the kind voice asked.\n \n \n\n \n The face was that of a girl probably somewhere between twenty-five and thirty. Her features, devoid of makeup, had an unhealthy-looking pallor, as if she hadn't used a sunlamp for many weeks. Yet, at the same time, her firm slim body suggested a solidity and a strength. Her straight brown hair was combed backward, tight upon her scalp, and drawn together in a knot at the nape of her neck.\n \n \"I—I am better,\" he murmured. His words were still slow and thick. \"I am going to live?\"\n \n \"You will live.\"\n \n He thought for a moment. \"How long have I been here?\"\n \n \"Nine days.\"\n \n \"You took care of me?\" He noted the deep, dark circles beneath her sleep-robbed eyes.\n \n She nodded.\n \n \"You're the one who carried me when I was shot?\"\n \n \"Yes.\"\n \n \"Why?\"\n \n Suddenly he began to cough. Breath came hard. She held the oxygen mask in readiness. He shook his head, not wanting it.\n \n \"Why?\" he asked again.\n \n \"It would be a long story. Perhaps I'll tell you tomorrow.\"\n \n A new thought, cloaked in sudden fear, entered his murky consciousness.\n\"Tell me, will—will I be well again? Will I be able to walk?\"\n \n He lay back then, panting, exhausted.\n \n \"You have nothing to worry about,\" the girl said softly. Her cool hand touched his hot forehead. \"Rest. We'll talk later.\"\n \n His eyes closed and breath came easier. He slept.\n \n When he next awoke, his gaze turned first to the window. There was light outside, but he had no way of knowing if this was morning, noon or afternoon—or on what planet.\n \n He saw no white-domed buildings of Hoover City, no formal lines of green-treed parks, no streams of buzzing gyro-cars. There was only a translucent and infinite whiteness. It was as if the window were set on the edge of the Universe overlooking a solemn, silent and matterless void.\n \n The girl entered the room.\n \n \"Hi,\" she said, smiling. The dark half-moons under her eyes were less prominent. Her face was relaxed.\n \n She increased the pressure in his rubberex pillows and helped him rise to a sitting position.\n \n \"Where are we?\" he asked.\n \n \"Venus.\"\n \n \"We're not in Hoover City?\"\n \n \"No.\"\n \n He looked at her, wondering. \"You won't tell me?\"\n \n \"Not yet. Later, perhaps.\"\n \n \"Then how did you get me here? How did we escape from the Inn?\"\n \n \n\n \n She shrugged. \"We have friends who can be bribed. A hiding place in the city, the use of a small desert-taxi, a pass to leave the city—these can be had for a price.\"\n \n \"You'll tell me your name?\"\n \n \"Maggie.\"\n \n \"Why did you save me?\"\n \n Her eyes twinkled mischievously. \"Because you're a good astrogator.\"\n \n His own eyes widened. \"How did you know that?\"\n \n She sat on a plain chair beside his bed. \"I know everything about you, Lieutenant Curtis.\"\n \n \"How did you learn my name? I destroyed all my papers—\"\n \n \"I know that you're twenty-four. Born July 10, 1971. Orphaned at four, you attended Boys Town in the Catskills till you were 19. You graduated from the Academy at White Sands last June with a major in Astrogation. Your rating for the five-year period was 3.8—the second highest in a class of fifty-seven. Your only low mark in the five years was a 3.2 in History of Martian Civilization. Want me to go on?\"\n \n Fascinated, Ben nodded.\n \n \"You were accepted as junior astrogation officer aboard the Odyssey . You did well on your flight from Roswell to Luna City. In a barroom fight in Luna City, you struck and killed a man named Arthur Cobb, a pre-fab salesman. You've been charged with second degree murder and escape. A reward of 5,000 credits has been offered for your capture. You came to Hoover City in the hope of finding a renegade group of spacemen who operate beyond Mars. You were looking for them in the Blast Inn.\"\n \n He gaped incredulously, struggling to rise from his pillows. \"I—don't get it.\"\n \n \"There are ways of finding out what we want to know. As I told you, we have many friends.\"\n \n He fell back into his pillows, breathing hard. She rose quickly.\n \n \"I'm sorry,\" she said. \"I shouldn't have told you yet. I felt so happy because you're alive. Rest now. We'll talk again soon.\"\n \n \"Maggie, you—you said I'd live. You didn't say I'd be able to walk again.\"\n \n She lowered her gaze. \"I hope you'll be able to.\"\n \n \"But you don't think I will, do you?\"\n \n \"I don't know. We'll try walking tomorrow. Don't think about it now. Rest.\"\n \n He tried to relax, but his mind was a vortex of conjecture.\n \n \"Just one more question,\" he almost whispered.\n \n \"Yes?\"\n \n \"The man I killed—did he have a wife?\"\n \n She hesitated. He thought, Damn it, of all the questions, why did I ask that?\n \n \n Finally she said, \"He had a wife.\"\n \n \"Children?\"\n \n \"Two. I don't know their ages.\"\n \n She left the room.\n \n \n\n \n He sank into the softness of his bed. As he turned over on his side, his gaze fell upon an object on a bureau in a far corner of the room.\n \n He sat straight up, his chest heaving.\n \n The object was a tri-dimensional photo of a rock-faced man in a merchant spaceman's uniform. He was a giant of a man with a neatly trimmed red beard !\n \n Ben stared at the photo for a long time. At length, he slipped into restless sleep. Images of faces and echoes of words spun through his brain.\n \n The dead man returned to him. Bloodied lips cursed at him. Glassy eyes accused him. Somewhere were two lost children crying in the night.\n \n And towering above him was a red-bearded man whose great hands reached down and beckoned to him. Ben crawled through the night on hands and knees, his legs numb and useless. The crying of the children was a chilling wail in his ears.\n \n His head rose and turned to the red-bearded man. His pleading voice screamed out to him in a thick, harsh cackle. Yet even as he screamed, the giant disappeared, to be replaced by white-booted feet stomping relentlessly toward him.\n \n He awoke still screaming....\n \n A night without darkness passed. Ben lay waiting for Maggie's return, a question already formed in his mind.\n \n She came and at once he asked, \"Who is the man with the red beard?\"\n \n She smiled. \"I was right then when I gave you that thumbnail biog. You were looking for him, weren't you?\"\n \n \"Who is he?\"\n \n She sat on the chair beside him.\n \n \"My husband,\" she said softly.\n \n He began to understand. \"And your husband needs an astrogator? That's why you saved me?\"\n \n \"We need all the good men we can get.\"\n \n \"Where is he?\"\n \n She cocked her head in mock suspicion. \"Somewhere between Mercury and Pluto. He's building a new base for us—and a home for me. When his ship returns, I'll be going to him.\"\n \n \"Why aren't you with him now?\"\n \n \"He said unexplored space is no place for a woman. So I've been studying criminal reports and photos from the Interplanetary Bureau of Investigation and trying to find recruits like yourself. You know how we operate?\"\n \n He told her the tales he'd heard.\n \n \n\n \n She nodded. \"There are quite a few of us now—about a thousand—and a dozen ships. Our base used to be here on Venus, down toward the Pole. The dome we're in now was designed and built by us a few years ago after we got pushed off Mars. We lost a few men in the construction, but with almost every advance in space, someone dies.\"\n \n \"Venus is getting too civilized. We're moving out and this dome is only a temporary base when we have cases like yours. The new base—I might as well tell you it's going to be an asteroid. I won't say which one.\"\n \n \"Don't get the idea that we're outlaws. Sure, about half our group is wanted by the Bureau, but we make honest livings. We're just people like yourself and Jacob.\"\n \n \"Jacob? Your husband?\"\n \n She laughed. \"Makes you think of a Biblical character, doesn't it? Jacob's anything but that. And just plain 'Jake' reminds one of a grizzled old uranium prospector and he isn't like that, either.\"\n \n She lit a cigarette. \"Anyway, the wanted ones stay out beyond the frontiers. Jacob and those like him can never return to Earth—not even to Hoover City—except dead. The others are physical or psycho rejects who couldn't get clearance if they went back to Earth. They know nothing but rocketing and won't give up. They bring in our ships to frontier ports like Hoover City to unload cargo and take on supplies.\"\n \n \"Don't the authorities object?\"\n \n \"Not very strongly. The I. B. I. has too many problems right here to search the whole System for a few two-bit crooks. Besides, we carry cargoes of almost pure uranium and tungsten and all the stuff that's scarce on Earth and Mars and Venus. Nobody really cares whether it comes from the asteroids or Hades. If we want to risk our lives mining it, that's our business.\"\n \n She pursed her lips. \"But if they guessed how strong we are or that we have friends planted in the I. B. I.—well, things might be different. There probably would be a crackdown.\"\n \n Ben scowled. \"What happens if there is a crackdown? And what will you do when Space Corps ships officially reach the asteroids? They can't ignore you then.\"\n \n \"Then we move on. We dream up new gimmicks for our crates and take them to Jupiter, Saturn, Uranus, Neptune, Pluto. In time, maybe, we'll be pushed out of the System itself. Maybe it won't be the white-suited boys who'll make that first hop to the stars. It could be us, you know—if we live long enough. But that Asteroid Belt is murder. You can't follow the text-book rules of astrogation out there. You make up your own.\"\n \n \n\n \n Ben stiffened. \"And that's why you want me for an astrogator.\"\n \n Maggie rose, her eyes wistful. \"If you want to come—and if you get well.\" She looked at him strangely.\n \n \"Suppose—\" He fought to find the right words. \"Suppose I got well and decided not to join Jacob. What would happen to me? Would you let me go?\"\n \n Her thin face was criss-crossed by emotion—alarm, then bewilderment, then fear. \"I don't know. That would be up to Jacob.\"\n \n He lay biting his lip, staring at the photo of Jacob. She touched his hand and it seemed that sadness now dominated the flurry of emotion that had coursed through her.\n \n \"The only thing that matters, really,\" she murmured, \"is your walking again. We'll try this afternoon. Okay?\"\n \n \"Okay,\" he said.\n \n When she left, his eyes were still turned toward Jacob's photo.\n \n He was like two people, he thought.\n \n Half of him was an officer of the Space Corps. Perhaps one single starry-eyed boy out of ten thousand was lucky enough to reach that goal.\n \n He remembered a little picture book his mother had given him when she was alive. Under the bright pictures of spacemen were the captions:\n \n \"A Space Officer Is Honest\" \"A Space Officer Is Loyal.\" \"A Space Officer Is Dutiful.\"\n \n Honesty, loyalty, duty. Trite words, but without those concepts, mankind would never have broken away from the planet that held it prisoner for half a million years.\n \n Without them, Everson, after three failures and a hundred men dead, would never have landed on the Moon twenty-seven years ago.",
      "metadata": {
        "title": "A Coffin for Jacob",
        "author": "Edward W. Ludwig",
        "passage_id": "51203",
        "uid": "45e6eefc1a9f40be83f2b22b2ffbe47b",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "105",
                "uid": "2418299adb5540d7a8f9d87b9e5e0f01",
                "response_text": "Ben Curtis enters a dark gin mill followed by the dead man and a boy offers him a wench. Ben denies and follows to a table past drinking men from different planets and a policeman, whose presence makes Ben anxious. He is followed by the dead man everywhere and has to find some red-bearded man to escape the dead man. A week ago Ben met a drunk man Cobb in a bar and they had a fight which led to Cobb's death by accident. Ben ran and didn't give in not to end his space career. He starts searching for the red-bearded man on Venus who led a group of renegade spacemen. In the gin mill Ben gets hopeless and is surrounded by the police, he runs again. He is paralyzed by the police but a woman who doesn't have an antidote helps him escape. He wakes up and can't talk, the woman massages him and looks after. When Ben gains consciousness he asks questions, he is not in Hoover city any longer but still on Venus. Turns out the woman knows a lot about her patient and saved him with a use of money. She doesn't know if he is to walk again but he will live. Ben learns the dead man had a family and they haunt him in nightmares. He also sees a photo of a red-bearded man, and it turns out the woman is his wife and they need an astrogator. She tells about her husband, his team and goal. Ben understands he won't be let go if he denies the job. "
              },
              {
                "worker_id": "103",
                "uid": "17cc12ae998944819b41659b8e90874c",
                "response_text": "The story begins with Ben Curtis entering Blast Inn. A boy catches him and brings him to a table that is close in the shadows after passing through a narrow aisle and a white-uniformed officer. Sitting at the table, Ben tells himself that he needs to find the man with red beard. He wants to escape from the images of a dead man. Later we learn that Ben murdered this man. Ben was celebrating in a bar when Cobb, a man in the bar insulted him. While Ben tries to reason with him, he expressed his dissatisfaction about spacemen. Ben has always wanted to be spacemen. He moved down three stools but the drunk man won’t stop. Thus he tried to leave. But he continued and called him a sucker. Getting furious, Ben hits the man. The man’s head hits the edge of the bar and he dies. Ben ran away, trying to find the group of renegade spacemen made up of misfits and rejectees. Back in Blast Inn, he suddenly sees the Security Policeman. They are coming for him. As he tries to run, the police try to hit him with neuro-pistols. As he is about to go unconscious, a female holds onto his hand. After he regains conscious, he realizes that the girl who grabbed him has been taking care of him for the past nine days that he was unconscious. At first, she refuses to answer his questions, but she knows everything about him. Later he learns that she is the red bearded man’s wife. She saves him because he is an astrogator and a good man. "
              },
              {
                "worker_id": "101",
                "uid": "2c8e0788b54942b68281a01d0b8a0b5a",
                "response_text": "Spaceman Ben Curtis walks into the Blast Inn, a dive bar in the Venusian Hoover City. He is approached by a young Martian boy, who brings him to a table where a Martian orchestra plays aside them. In the bar, Ben is anxious and paranoid, particularly upon noticing a few Hoover City police officers. While he sits, Ben is unable to shake the image of a dead man next to him, who is a man named Cobb. Prior to Ben's arrival to Venus, he had stepped into a bar in Luna City, where an intoxicated Cobb was rambling about spacemen and how he despises them. Out of rage and personal offense, Ben punched Cobb in the chin, who died on impact after falling. Ben immediately fled to Venus in search of a red-bearded giant, the leader of a renegade space crew, who was his only hope in survival and job security after the murder. Still seated at the table, the Martian boy continues prodding Ben, who gives him a coin to shoo him off. He soon notices the space policemen from before closing in on him, raising weapons, and he attempts to escape the bar but is shot. Becoming unconscious, Ben hears the voice of a woman, who leads him out of the exit and helps him escape. He then awakes, unable to see clearly, but being cared for and fed. After nine days, he is able to see the woman clearly, who introduces herself as Maggie, and she tells him that they are no longer in Hoover City. She then discloses all the information she has on Ben, including his desire to find the red-bearded man. Ben asks her if Cobb had a wife and kids, which she confirms. As Ben scans the room, he notices a photo of the red-bearded man, and he slips into sleep, where he is again haunted by visions of Cobb. Ben asks Maggie how she knows the man, and she reveals that he is her husband, and that they saved Ben because they were in need of an astrogator. Maggie tells him about the renegade crew, and how they plan on relocating to an asteroid to avoid the authorities. Ben is overwhelmed and fearful of the prospect, but Maggie encourages him to get rest, and he reflects on his future and his duty."
              },
              {
                "worker_id": "104",
                "uid": "fb49f598c19b4ab29098294e20cd03a1",
                "response_text": "The story begins with Ben Curtis, an officer of the Space Corps and astrogator, leaving the Blast Inn on Venus. When he gets to the Venusian gin mill, a Martian kid tries to sell him various things to pique his interest. Ben indicates that he is not interested in any of the offers and the kid eventually leads him to a table that is partially hidden. The location of his table is intentional because he does not want to be seen. Ben becomes deep in thought at the table, intent on finding a man described as having a red beard. \n\nWhile at the table, he also thinks about the events that transpired over the last week when he arrived in Luna City from White Sands. Ben had gone to a bar to celebrate his arrival to Luna City when Cobb drunkenly accosted him. Cobb purposefully tried to anger Ben and eventually was successful in doing so after a particularly poignant threat. In a quick and anger-filled response, Ben struck Cobb causing Cobb to crack his head against the edge of the bar and die. Ben flew to Venus in response to the incident, which explains how he currently arrived in a Venusian bar. \n\nHis thoughts are interrupted when he notices policemen entering the bar. The police quickly find Ben and begin to use deadly neuro-pistols. He begins to run and is eventually hit by one of the blasts from the neuro-pistols. As he realizes he is losing consciousness, an unknown pair of hands guided him towards a different exit. Ben passes out from the blast and wakes up in a room. For 9+ days, he goes in and out of sleep in this room while he recovers from his injuries. Maggie, the woman who helped him escape, is the one helping him recover from his injuries. She knows a lot of information about him and his background. \n\nWhile still recovering, Ben notices that on one side of the bed, there is a picture on a bureau in the far corner of the room that shows a portrait of a red-bearded man. He gets really excited at this new revelation. He asks Maggie about the red-bearded man and she confesses that he is her husband and then explains what he does and why she brought Ben with her. Jacob’s group needs an astrogator and want Ben to join them. While Maggie shows that she would be confused if Ben chose not to join the group, she seems to truly be concerned with his recovery. \n\nWhen Maggie leaves the room, Ben reflects on words found in a book from his childhood that talk about the morals of a Space Officer. He acknowledges how very few are able to get the job in the SpaceCorps. The story ends with implications that Ben will choose his moral values and choose not to join Jacob’s group. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "105",
                "uid": "2418299adb5540d7a8f9d87b9e5e0f01",
                "response_text": "The story begins in the Blast Inn, a dim gin mill with a sense of evil. The huge room is obscure with smoke and full of people from different planets drinking and smoking. Ben's table is in the shadows far away, a lonely Martian orchestra is playing. Then the story goes to one week ago, a bar on Earth and a fight. There was a chase then through the rocket front alleys with a thousand stars above. Ben fled to Venus. In the gin mill's shadow, the light is suddenly on, the orchestra leaves and Ben is surrendered to the police. He runs and wakes up in a place he can't see. He is with a woman who looks after him, the room is small with a small window with infinite whiteness outside. He was moved to a different city on Venus. Soon, there turns out to be a photo of a red-bearded man in the room. Nightmares and memories haunt Ben in this room. "
              },
              {
                "worker_id": "103",
                "uid": "17cc12ae998944819b41659b8e90874c",
                "response_text": "The story first takes place at the Blast Inn. There are big rooms, a bar and some tables. There is also music playing in the background. Blast Inn has drab concrete walls and debris-strewn floor. There is a rear exit. Later, on Venus, inside the small room in the dome building, there is an unpainted ceiling. The walls are broken and there is a single, round window. There is also a blanket. Outside the window, there is only a translucent and infinite whiteness. The room has a plain chair. On the corner of the room, there is a tri-dimensional photo of the red-bearded man. "
              },
              {
                "worker_id": "101",
                "uid": "2c8e0788b54942b68281a01d0b8a0b5a",
                "response_text": "The first part of the story takes place in the Blast Inn, a bar located in Hoover City on Venus. The bar is described as dark and smoky, with an ominous and mysterious aura. In the bar, a Martian orchestra plays music, and the room is occupied with Venusians, Earthmen, and Martians. When Ben is wounded by the space officials, he is taken to a room by Maggie, still on Venus but outside of Hoover City. The room is comfortable and small, but colorless. It contains a bureau with a photo of Jacob on it. "
              },
              {
                "worker_id": "104",
                "uid": "fb49f598c19b4ab29098294e20cd03a1",
                "response_text": "The story begins with Ben Curtis standing in the doorway of the Blast Inn on Venus. He walks towards a Venusian gin mill where a Martian kid seats him at a table in a secluded area. The story details that Ben ended up on Venus after accidentally killing a man on Earth. He begins to run from the bar once policemen began to come after him to arrest him. As he’s making his exit, an unfamiliar person guides him towards a hidden exit. After losing consciousness, from the policeman’s blast hitting him during his escape, he wakes up in a room. The room does not give him any indication of the time of day it is nor the name of the planet. In the room, Maggie really comes to aid his recovery. On a bureau in a far corner of the room is a rock portrait of Jacob, the red-bearded man and Maggie’s husband. "
              }
            ]
          },
          {
            "question_text": "What do we know about the red-bearded man and his operations?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "105",
                "uid": "2418299adb5540d7a8f9d87b9e5e0f01",
                "response_text": "The man is the leader of renegade spacemen who operate from the Solar System's frontiers and are not outlaws. The man is almost a myth. Right now the man is exploring new parts of space and is building a new base. The team is huge and the base has moved from Venus towards the Pole for a while, planning to move to an asteroid later. Half the team are wanted but their livings are still honest. The man is banned from Earth and brings cargo to the frontiers and the authorities close their eyes. They want to go further than the System itself and need a good astrogator like Ben out there."
              },
              {
                "worker_id": "103",
                "uid": "17cc12ae998944819b41659b8e90874c",
                "response_text": "The red-bearded man is named Jacob. He is said to run an operation of renegade spacemen. They have supposedly hit the asteroids while no legal ships has made pass Mars. He is currently exploring between Mercury and Pluto because he wants to build a new base for them. His operation was based on Venus, but because the place is getting to civilized, they need to move to a new home on an asteroid. While the group is filled with people wanted by the IBI, but they are people that makes honest livings. They unload cargo to ports like Hoover City and take on supplies. "
              },
              {
                "worker_id": "101",
                "uid": "2c8e0788b54942b68281a01d0b8a0b5a",
                "response_text": "We know that the red-bearded man is named Jacob, and he is the leader of a renegade space crew, made up of misfits and rejects. The space crew transports cargoes of minerals to and from planets, and they advance to another location time after time to avoid authorities catching up with them. After Venus, the next planned location is on the Asteroid belt, which requires advanced navigation and astrogation, which is why Jacob seeks Ben Curtis for help."
              },
              {
                "worker_id": "104",
                "uid": "fb49f598c19b4ab29098294e20cd03a1",
                "response_text": "We know that Maggie is the wife of the red-bearded man Jacob. Jacob is the leader of a group of about a thousand. They own about a dozen ships. They have changed their bases many times depending on threatening circumstances. If they see trouble, they move on to the next place. The previous base was near the Pole on Venus. Venus was the base after the group was exiled from Mars. Venus is now no longer able to be the group’s home because it is becoming more and more civilized. So, the group has decided that the new base is going to be on an asteroid. The operation of Jacob and his group is mining. They mine almost pure uranium and tungsten, materials that are scarce on both Earth and Mars. They then sell the materials. "
              }
            ]
          },
          {
            "question_text": "What do we know about Ben's life before the murder in the bar?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "105",
                "uid": "2418299adb5540d7a8f9d87b9e5e0f01",
                "response_text": "Ben lost his parents at four in a a crash in space and has wanted to be a spaceman ever since. All his life he has been passionate about space. He graduated from an academy as an astrogation major and was a great student. After one month he signed aboard the ship called Odyssey. The bar fight occurred when he was celebrating his successful flight and he was proud of his uniform yet considering it a key for everything - the idea he had for a long time before. "
              },
              {
                "worker_id": "103",
                "uid": "17cc12ae998944819b41659b8e90874c",
                "response_text": "Ben is orphaned at four because his parents are killed in a strato-jet crash. At the age of five, he watched the night sky for the Moon rockets. He obtaind his first telescope at the age of 10. He had many astronomy and rocketry books. At the age of 16, he spent every weekend at the Long Island Spaceport. He attended the Boys Town until 19 years old. Then he graduated from the Academy at White Sands in June. He majors in Astrogation and was the second highest in his class. Then he was accepted as junior astrogation officer for the Odyssey. He was celebrating for his flight from Roswell to Luna City when he murdered Cobb in the bar. "
              },
              {
                "worker_id": "101",
                "uid": "2c8e0788b54942b68281a01d0b8a0b5a",
                "response_text": "Ben became an orphan at the age of four after his parents died in a strato-jet accident. He then became interested in space and the sky, buying a telescope and converting a shed at his boarding school into an astronomy hideout. Ben majored in astrogation at the Academy of White Sands with the second highest position in his class, where he became an astrogation officer on the Odyssey and had since been an acclaimed spaceman."
              },
              {
                "worker_id": "104",
                "uid": "fb49f598c19b4ab29098294e20cd03a1",
                "response_text": "Both of Ben’s parents died in a strato-jet cash when he was very young. After their death when he was about five years old, he would regularly watch the night sky hoping to see Moon rockets. He acquired his first telescope at the age of ten. By fourteen, Ben had a large collection of astronomy and rocketry books that could fill a shed. When he was 16, he would often hike from the Catskills to Long Island Spaceport. The trips to Long Island Spaceport would inspire him to apply to the U.S. Academy for the Conquest of Space. It is clear from his early life that from a young age Ben was fascinated and interested in space and rocketry. "
              }
            ]
          },
          {
            "question_text": "What images keep haunting Ben?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "105",
                "uid": "2418299adb5540d7a8f9d87b9e5e0f01",
                "response_text": "Ben is haunted with the image of a dead man. In a bar a man, Cobb, picked a fight with Ben claiming that spacemen suck. Ben soon surrendered to his anger and hit the man, who died by accident. Now Ben is followed everywhere by the scary rage of the dead man with blood in his mouth. Ben is even more upset when he learns that Cobb had a wife and two kids. The whole family haunts Ben in nightmares. He is constantly scared of being found as well and deprived of being a spaceman. "
              },
              {
                "worker_id": "103",
                "uid": "17cc12ae998944819b41659b8e90874c",
                "response_text": "The dead man that Ben killed keeps haunting him. Ben would see the drunk man with his lips spitting whiskey-slurred curses. His face has a pop-eyed masked of surprise. His face is white and frozen because of the sudden death; his eyes staring and blood dripping from the corner of the mouth of the dead man. After he learns that the man has a wife and two kids, he sees the man again. He is cursing, accusing him. Ben hears the children crying in the night.  "
              },
              {
                "worker_id": "101",
                "uid": "2c8e0788b54942b68281a01d0b8a0b5a",
                "response_text": "The image of Cobb haunts Ben after the murder. Ben cannot escape visions of his face, as it appeared when he punched him. He sees his bloody jaw, shocked face, and glassy-eyed stare as he sits in the bar, and he describes Cobb's image as having a dead Siamese twin. When Ben is rescued by Maggie, he still sees Cobb's image as he sleeps, this time with the cries of his two children haunting him."
              },
              {
                "worker_id": "104",
                "uid": "fb49f598c19b4ab29098294e20cd03a1",
                "response_text": "The dead man that haunts Ben is named Cobb. Cobb is described as being short and heavier set. He is no longer alive, as his body is for sure buried outside of Luna City. He haunts Ben because Ben is the one that killed him. When Ben sees him, the image of Cobb is one with large eyes with a piercing stare and trickles of blood leaving his open mouth. As the story develops and Ben learns that Cobb had two children and a wife, he starts to hear children crying at night. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5052,
        "document_length_chars": 29441
      }
    }
  ]
}