{
  "item_metadata": {
    "item_id": "51210",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51210",
      "content": "I, the Unspeakable\n \n \n By WALT SHELDON\n \n Illustrated by LOUIS MARCHETTI\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction April 1951. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n\n \"What's in a name?\" might be very dangerous to ask in certain societies, in which sticks and stones are also a big problem!\n \n \n \n I fought to be awake. I was dreaming, but I think I must have blushed. I must have blushed in my sleep.\n \n \" Do it! \" she said. \" Please do it! For me! \"\n \n It was the voice that always came, low, intense, seductive, the sound of your hand on silk ... and to a citizen of Northem, a conformist, it was shocking. I was a conformist then; I was still one that morning.\n \n I awoke. The glowlight was on, slowly increasing. I was in my living machine in Center Four, where I belonged, and all the familiar things were about me, reality was back, but I was breathing very hard.\n \n I lay on the pneumo a while before getting up. I looked at the chroner: 0703 hours, Day 17, Month IX, New Century Three. My morning nuro-tablets had already popped from the tube, and the timer had begun to boil an egg. The egg was there because the realfood allotment had been increased last month. The balance of trade with Southem had just swung a decimal or two our way.\n \n I rose finally, stepped to the mirror, switched it to positive and looked at myself. New wrinkles—or maybe just a deepening of the old ones. It was beginning to show; the past two years were leaving traces.\n \n I hadn't worried about my appearance when I'd been with the Office of Weapons. There, I'd been able to keep pretty much to myself, doing research on magnetic mechanics as applied to space drive. But other jobs, where you had to be among people, might be different. I needed every possible thing in my favor.\n \n Yes, I still hoped for a job, even after two years. I still meant to keep on plugging, making the rounds.\n \n I'd go out again today.\n \n The timer clicked and my egg was ready. I swallowed the tablets and then took the egg to the table to savor it and make it last.\n \n As I leaned forward to sit, the metal tag dangled from my neck, catching the glowlight. My identity tag.\n \n Everything came back in a rush—\n \n My name. The dream and her voice. And her suggestion.\n  Would I dare? Would I start out this very morning and take the risk, the terrible risk?\n \n \n \n\n \n You remember renumbering. Two years ago. You remember how it was then; how everybody looked forward to his new designation, and how everybody made jokes about the way the letters came out, and how all the records were for a while fouled up beyond recognition.\n \n The telecomics kidded renumbering. One went a little too far and they psycho-scanned him and then sent him to Marscol as a dangerous nonconform.\n \n If you were disappointed with your new designation, you didn't complain. You didn't want a sudden visit from the Deacons during the night.\n \n There had to be renumbering. We all understood that. With the population of Northem already past two billion, the old designations were too clumsy. Renumbering was efficient. It contributed to the good of Northem. It helped advance the warless struggle with Southem.\n \n The equator is the boundary. I understand that once there was a political difference and that the two superstates sprawled longitudinally, not latitudinally, over the globe. Now they are pretty much the same. There is the truce, and they are both geared for war. They are both efficient states, as tightly controlled as an experiment with enzymes, as microsurgery, as the temper of a diplomat.\n \n We were renumbered, then, in Northem. You know the system: everybody now has six digits and an additional prefix or suffix of four letters. Stateleader, for instance, has the designation AAAA-111/111. Now, to address somebody by calling off four letters is a little clumsy. We try to pronounce them when they are pronounceable. That is, no one says to Stateleader, \"Good morning, A-A-A-A.\" They say, \"Good morning, Aaaa.\"\n \n Reading the last quote, I notice a curious effect. It says what I feel. Of course I didn't feel that way on that particular morning. I was still conformal; the last thing in my mind was that I would infract and be psycho-scanned.\n \n Four letters then, and in many cases a pronounceable four letter word.\n \n A four letter word.\n \n Yes, you suspect already. You know what a four letter word can be.\n \n Mine was.\n \n It was unspeakable.\n \n The slight weight on my forehead reminded me that I still wore my sleep-learner. I'd been studying administrative cybernetics, hoping to qualify in that field, although it was a poor substitute for a space drive expert. I removed the band and stepped across the room and turned off the oscillator. I went back to my egg and my bitter memories.\n \n I will never forget the first day I received my new four letter combination and reported it to my chief, as required. I was unthinkably embarrassed. He didn't say anything. He just swallowed and choked and became crimson when he saw it. He didn't dare pass it to his secretarial engineer; he went to the administrative circuits and registered it himself.\n \n I can't blame him for easing me out. He was trying to run an efficient organization, after all, and no doubt I upset its efficiency. My work was important—magnetic mechanics was the only way to handle quanta reaction, or the so-called non-energy drive, and was therefore the answer to feasible space travel beyond our present limit of Mars—and there were frequent inspection tours by Big Wheels and Very Important Persons.\n \n Whenever anyone, especially a woman, asked my name, the embarrassment would become a crackling electric field all about us. The best tactic was just not to answer.\n \n \n\n \n The chief called me in one day. He looked haggard.\n \n \"Er—old man,\" he said, not quite able to bring himself to utter my name, \"I'm going to have to switch you to another department. How would you like to work on nutrition kits? Very interesting work.\"\n \n \"Nutrition kits? Me? On nutrition kits?\"\n \n \"Well, I—er—know it sounds unusual, but it justifies. I just had the cybs work it over in the light of present regulations, and it justifies.\"\n \n Everything had to justify, of course. Every act in the monthly report had to be covered by regulations and cross-regulations. Of course there were so many regulations that if you just took the time to work it out, you could justify damn near anything. I knew what the chief was up to. Just to remove me from my post would have taken a year of applications and hearings and innumerable visits to the capital in Center One. But if I should infract—deliberately infract—it would enable the chief to let me go. The equivalent of resigning.\n \n \"I'll infract,\" I said. \"Rather than go on nutrition kits, I'll infract.\"\n \n He looked vastly relieved. \"Uh—fine,\" he said. \"I rather hoped you would.\"\n \n It took a week or so. Then I was on Non-Productive status and issued an N/P book for my necessities. Very few luxury coupons in the N/P book. I didn't really mind at first. My new living machine was smaller, but basically comfortable, and since I was still a loyal member of the state and a verified conformist, I wouldn't starve.\n \n But I didn't know what I was in for.\n \n I went from bureau to bureau, office to office, department to department—any place where they might use a space drive expert. A pattern began to emerge; the same story everywhere. When I mentioned my specialty they would look delighted. When I handed them my tag and they saw my name, they would go into immediate polite confusion. As soon as they recovered they would say they'd call me if anything turned up....\n \n \n\n \n A few weeks of this and I became a bit dazed.\n \n And then there was the problem of everyday existence. You might say it's lucky to be an N/P for a while. I've heard people say that. Basic needs provided, worlds of leisure time; on the surface it sounds attractive.\n \n But let me give you an example. Say it is monthly realfood day. You go to the store, your mouth already watering in anticipation. You take your place in line and wait for your package. The distributor takes your coupon book and is all ready to reach for your package—and then he sees the fatal letters N/P. Non-Producer. A drone, a drain upon the State. You can see his stare curdle. He scowls at the book again.\n \n \"Not sure this is in order. Better go to the end of the line. We'll check it later.\"\n \n You know what happens before the end of the line reaches the counter. No more packages.\n \n Well, I couldn't get myself off N/P status until I got a post, and with my name I couldn't get a post.\n \n Nor could I change my name. You know what happens when you try to change something already on the records. The very idea of wanting change implies criticism of the State. Unthinkable behavior.\n \n That was why this curious dream voice shocked me so. The thing that it suggested was quite as embarrassing as its non-standard, emotional, provocative tone.\n \n Bear with me; I'm getting to the voice—to her —in a moment.\n \n I want to tell you first about the loneliness, the terrible loneliness. I could hardly join group games at any of the rec centers. I could join no special interest clubs or even State Loyalty chapters. Although I dabbled with theoretical research in my own quarters, I could scarcely submit any findings for publication—not with my name attached. A pseudonym would have been non-regulation and illegal.\n \n But there was the worst thing of all. I could not mate.\n \n \n\n \n Funny, I hadn't thought about mating until it became impossible. I remember the first time, out of sheer idleness, I wandered into a Eugenic Center. I filled out my form very carefully and submitted it for analysis and assignment. The clerk saw my name, and did the usual double-take. He coughed and swallowed and fidgeted.\n \n He said, \"Of course you understand that we must submit your application to the woman authorized to spend time in the mating booths with you, and that she has the right to refuse.\"\n \n \"Yes, I understand that.\"\n \n \"M'm,\" he said, and dismissed me with a nod.\n \n I waited for a call in the next few weeks, still hoping, but I knew no woman would consent to meet a man with my name, let alone enter a mating booth with him.\n \n The urge to reproduce myself became unbearable. I concocted all sorts of wild schemes.\n \n I might infract socially and be classified a nonconform and sent to Marscol. I'd heard rumors that in that desolate land, on that desolate planet, both mingling and mating were rather disgustingly unrestricted. Casual mating would be terribly dangerous, of course, with all the wild irradiated genes from the atomic decade still around, but I felt I'd be willing to risk that. Well, almost....\n \n About then I began to have these dreams. As I've told you, in the dream there was only this woman's seductive voice. The first time I heard it I awoke in a warm sweat and swore something had gone wrong with the sleep-learner. You never hear the actual words with this machine, of course; you simply absorb the concepts unconsciously. Still, it seemed an explanation. I checked thoroughly. Nothing wrong.\n \n The next night I heard the woman's voice again.\n \n \" Try it ,\" she said. \" Do it. Start tomorrow to get your name changed. There will be a way. There must be a way. The rules are so mixed up that a clever man can do almost anything. Do it, please—for me. \"\n \n \n\n \n She was not only trying to get me to commit nonconformity, but making heretical remarks besides. I awoke that time and half-expected a Deacon to pop out of the tube and turn his electric club upon me.\n \n And I heard the voice nearly every night.\n \n It hammered away.\n \n \" What if you do fail? Almost anything would be better than the miserable existence you're leading now! \"\n \n One morning I even caught myself wondering just how I'd go about this idea of hers. Wondering what the first step might be.\n \n She seemed to read my thoughts. That night she said, \" Consult the cybs in the Govpub office. If you look hard enough and long enough, you'll find a way. \"\n \n Now, on this morning of the seventeenth day in the ninth month, I ate my boiled egg slowly and actually toyed with the idea. I thought of being on productive status again. I had almost lost my fanatical craving to be useful to the State, but I did want to be busy—desperately. I didn't want to be despised any more. I didn't want to be lonely. I wanted to reproduce myself.\n \n I made my decision suddenly. Waves of emotion carried me along. I got up, crossed the room to the directory, and pushbuttoned to find the location of the nearest Govpub office.\n \n I didn't know what would happen and almost didn't care.\n \n \n\n II\n \n Like most important places, the Govpub Office in Center Four was underground. I could have taken a tunnelcar more quickly, but it seemed pleasanter to travel topside. Or maybe I just wanted to put this off a bit. Think about it. Compose myself.\n \n At the entrance to the Govpub warren there was a big director cyb, a plate with a speaker and switch. The sign on it said to switch it on and get close to the speaker and I did.\n \n The cyb's mechanical voice—they never seem to get the \"th\" sounds right—said, \"This is Branch Four of the Office of Government Publications. Say, 'Publications,' and/or, 'Information desired,' as thoroughly and concisely as possible. Use approved voice and standard phraseology.\"\n \n Well, simple enough so far. I had always rather prided myself on my knack for approved voice, those flat, emotionless tones that indicate efficiency. And I would never forget how to speak Statese. I said,\n\"Applicant desires all pertinent information relative assignment, change or amendment of State Serial designations, otherwise generally referred to as nomenclature.\"\n \n There was a second's delay while the audio patterns tripped relays and brought the memory tubes in.\n \n Then the cyb said, \"Proceed to Numbering and Identity section. Consult alphabetical list and diagram on your left for location of same.\"\n \n \"Thanks,\" I said absent-mindedly.\n \n I started to turn away and the cyb said, \"Information on tanks is military information and classified. State authorization for—\"\n \n I switched it off.\n \n \n\n \n Numbering and Identity wasn't hard to find. I took the shaft to the proper level and then it was only a walk of a few hundred yards through the glowlit corridors.\n \n N. & I. turned out to be a big room, somewhat circular, very high-ceilinged, with banks of cyb controls covering the upper walls. Narrow passageways, like spokes, led off in several directions. There was an information desk in the center of the room.\n \n I looked that way and my heart went into free fall.\n \n There was a girl at the information desk. An exceptionally attractive girl. She was well within the limits of acceptable standard, and her features were even enough, and her hair a middle blonde—but she had something else. Hard to describe. It was a warmth, a buoyancy, a sense of life and intense animation. It didn't exactly show; it radiated. It seemed to sing out from her clear complexion, from her figure, which even a tunic could not hide, from everything about her.\n \n And if I were to state my business, I would have to tell her my name.\n \n I almost backed out right then. I stopped momentarily. And then common sense took hold and I realized that if I were to go through with this thing, here would be only the first of a long series of embarrassments and discomforts. It had to be done.\n \n I walked up to the desk and the girl turned to face me, and I could have sworn that a faint smile crossed her lips. It was swift, like the shadow of a bird across one of the lawns in one of the great parks topside. Very non-standard. Yet I wasn't offended; if anything, I felt suddenly and disturbingly pleased.\n \n \"What information is desired?\" she asked. Her voice was standard—or was it?\n \n Again I had the feeling of restrained warmth.\n \n I used colloquial. \"I want to get the dope on State Serial designations, how they're assigned and so forth. Especially how they might be changed.\"\n \n She put a handsteno on the desk top and said, \"Name? Address? Post?\"\n \n I froze. I stood there and stared at her.\n \n She looked up and said, \"Well?\"\n \n \"I—er—no post at present. N/P status.\"\n \n Her fingers moved on the steno.\n \n I gave her my address and she recorded that.\n \n Then I paused again.\n \n She said, \"And your name?\"\n \n I took a deep breath and told her.\n \n I didn't want to look into her eyes. I wanted to look away, but I couldn't find a decent excuse to. I saw her eyes become wide and noticed for the first time that they were a warm gray, almost a mouse color. I felt like laughing at that irrelevant observation, but more than that I felt like turning and running. I felt like climbing and dashing all over the walls like a frustrated cat and yelling at the top of my lungs. I felt like anything but standing there and looking stupid, meeting her stare—\n \n \n\n \n She looked down quickly and recorded my name. It took her a little longer than necessary. In that time she recovered. Somewhat.\n \n \"All right,\" she said finally, \"I'll make a search.\"\n \n She turned to a row of buttons on a console in the center of the desk and began to press them in various combinations. A typer clicked away. She tore off a slip of paper, consulted it, and said, \"Information desired is in Bank 29. Please follow me.\"\n \n Well, following her was a pleasure, anyway. I could watch the movement of her hips and torso as she walked. She was not tall, but long-legged and extremely lithe. Graceful and rhythmic. Very, very feminine, almost beyond standard in that respect. I felt blood throb in my temples and was heartily ashamed of myself.\n \n I would like to be in a mating booth with her, I thought, the full authorized twenty minutes. And I knew I was unconformist and the realization hardly scared me at all.\n \n She led me down one of the long passageways.\n \n A few moments later I said, \"Don't you sometimes get—well, pretty lonely working here?\" Personal talk at a time like this wasn't approved behavior, but I couldn't help it.\n \n She answered hesitantly, but at least she answered. She said, \"Not terribly. The cybs are company enough most of the time.\"\n \n \"You don't get many visitors, then.\"\n \n \"Not right here. N. & I. isn't a very popular section. Most people who come to Govpub spend their time researching in the ancient manuscript room. The—er—social habits of the pre-atomic civilization.\"\n \n I laughed. I knew what she meant, all right. Pre-atomics and their ideas about free mating always fascinated people. I moved up beside her. \"What's your name, by the way?\"\n \n \"L-A-R-A 339/827.\"\n \n I pronounced it. \"Lara. Lah-rah. That's beautiful. Fits you, too.\"\n \n \n\n \n She didn't answer; she kept her eyes straight ahead and I saw the faint spot of color on her cheek.\n \n I had a sudden impulse to ask her to meet me after hours at one of the rec centers. If it had been my danger alone, I might have, but I couldn't very well ask her to risk discovery of a haphazard, unauthorized arrangement like that and the possibility of going to the psycho-scan.\n \n We came to a turn in the corridor and something happened; I'm not sure just how it happened. I keep telling myself that my movements were not actually deliberate. I was to the right of her. The turn was to the left. She turned quickly, and I didn't, so that I bumped into her, knocking her off balance. I grabbed her to keep her from falling.\n \n For a moment we stood there, face to face, touching each other lightly. I held her by the arms. I felt the primitive warmth of her breath. Our eyes held together ... proton ... electron ... I felt her tremble.\n \n She broke from my grip suddenly and started off again.\n \n After that she was very business-like.\n \n We came finally to the controls of Bank 29 and she stood before them and began to press button combinations. I watched her work; I watched her move. I had almost forgotten why I'd come here. The lights blinked on and off and the typers clacked softly as the machine sorted out information.\n \n She had a long printed sheet from the roll presently. She frowned at it and turned to me. \"You can take this along and study it,\" she said,\n\"but I'm afraid what you have in mind may be—a little difficult.\"\n \n She must have guessed what I had in mind. I said, \"I didn't think it would be easy.\"\n \n \"It seems that the only agency authorized to change a State Serial under any circumstances is Opsych.\"\n \n \"Opsych?\" You can't keep up with all these departments.\n \n \"The Office of Psychological Adjustment. They can change you if you go from a lower to higher E.A.C.\"\n \n \"I don't get it, exactly.\"\n \n As she spoke I had the idea that there was sympathy in her voice. Just an overtone. \"Well,\" she said, \"as you know, the post a person is qualified to hold often depends largely on his Emotional Adjustment Category. Now if he improves and passes from, let us say, Grade 3 to Grade 4, he will probably change his place of work. In order to protect him from any associative maladjustments developed under the old E.A.C, he is permitted a new number.\"\n \n I groaned. \"But I'm already in the highest E.A.C.!\"\n \n \"It looks very uncertain then.\"\n \n \"Sometimes I think I'd be better off in the mines, or on Marscol—or—in the hell of the pre-atomics!\"\n \n She looked amused. \"What did you say your E.A.C. was?\"\n \n \"Oh, all right. Sorry.\" I controlled myself and grinned. \"I guess this whole thing has been just a little too much for me. Maybe my E.A.C.'s even gone down.\"\n \n \"That might be your chance then.\"\n \n \"How do you mean?\"\n \n \"If you could get to the top man in Opsych and demonstrate that your number has inadvertently changed your E.A.C., he might be able to justify a change.\"\n \n \"By the State, he might!\" I punched my palm. \"Only how do I get to him?\"\n \n \"I can find his location on the cyb here. Center One, the capital, for a guess. You'll have to get a travel permit to go there, of course. Just a moment.\"\n \n She worked at the machine again, trying it on general data. The printed slip came out a moment later and she read it to me. Chief, Opsych, was in the capital all right. It didn't give the exact location of his office, but it did tell how to find the underground bay in Center One containing the Opsych offices.\n \n We headed back through the passageway then and she kept well ahead of me. I couldn't keep my eyes from her walk, from the way she walked with everything below her shoulders. My blood was pounding at my temples again.\n \n I tried to keep the conversation going. \"Do you think it'll be hard to get a travel permit?\"\n \n \"Not impossible. My guess is that you'll be at Travbur all day tomorrow, maybe even the next day. But you ought to be able to swing it if you hold out long enough.\"\n \n I sighed. \"I know. It's that way everywhere in Northem. Our motto ought to be, 'Why make it difficult when with just a little more effort you can make it impossible?'\"\n \n \n\n \n She started to laugh, and then, as she emerged from the passageway into the big circular room, she cut her laugh short.\n \n A second later, as I came along, I saw why.\n \n There were two Deacons by the central desk. They were burly and had that hard, pinched-face look and wore the usual black belts. Electric clubs hung from the belts. Spidery looking pistols were at their sides.\n \n I didn't know whether these two had heard my crack or not. I know they kept looking at me.\n \n Lara and I crossed the room silently, she back to her desk, I to the exit door. The Deacons' remote, disapproving eyes swung in azimuth, tracking us.\n \n I walked out and wanted to turn and smile at Lara, and get into my smile something of the hope that someday, somewhere, I'd see her again—but of course I didn't dare.\n \n \n\n III\n \n I had the usual difficulties at Travbur the next day. I won't go into them, except to say that I was batted from office to office like a ping pong ball, and that, when I finally got my travel permit, I was made to feel that I had stolen an original Picasso from the State Museum.\n \n I made it in a day. Just. I got my permit thirty seconds before closing time. I was to take the jetcopter to Center One at 0700 hours the following morning.\n \n In my living machine that evening, I was much too excited to work at theoretical research as I usually did after a hard day of tramping around. I bathed, I paced a while, I sat and hummed nervously and got up and paced again. I turned on the telepuppets. There was a drama about the space pilots who fly the nonconformist prisoners to the forests and pulp-acetate plants on Mars. Seemed that the Southem political prisoners who are confined to the southern hemisphere of Mars, wanted to attack and conquer the north. The nonconformists, led by our pilot, came through for the State in the end. Corn is thicker than water. Standard.\n \n There were, however, some good stereofilm shots of the limitless forests of Mars, and I wondered what it would be like to live there, in a green, fresh-smelling land. Pleasant, I supposed, if you could put up with the no doubt revolting morality of a prison planet.\n \n And the drama seemed to point out that there was no more security for the nonconformists out there than for us here on Earth. Maybe somewhere in the universe, I thought, there would be peace for men. Somewhere beyond the solar system, perhaps, someday when we had the means to go there....\n \n Yet instinct told me that wasn't the answer, either. I thought of a verse by an ancient pre-atomic poet named Hoffenstein. (People had unwieldy, random combinations of letters for names in those days.) The poem went:\n \n Wherever I go,\n \n I\n \n go too,\n And spoil everything.\n \n That was it. The story of mankind.\n \n I turned the glowlight down and lay on the pneumo after a while, but I didn't sleep for a long, long time.\n \n Then, when I did sleep, when I had been sleeping, I heard the voice again. The low, seductive woman's voice—the startling, shocking voice out of my unconscious.\n \n \" You have taken the first step ,\" she said. \" You are on your way to freedom. Don't stop now. Don't sink back into the lifelessness of conformity. Go on ... on and on. Keep struggling, for that is the only answer.... \"\n \n \n\n \n I didn't exactly talk back, but in the queer way of the dream, I thought objections. I was in my thirties, at the mid-point of my life, and the whole of that life had been spent under the State. I knew no other way to act. Suppressing what little individuality I might have was, for me, a way of survival. I was chockful of prescribed, stereotyped reactions, and I held onto them even when something within me told me what they were. This wasn't easy, this breaking away, not even this slight departure from the secure, camouflaged norm....\n \n \" The woman, Lara, attracts you ,\" said the voice.\n \n I suppose at that point I twitched or rolled in my sleep. Yes, the voice was right, the woman Lara attracted me. So much that I ached with it.\n \n \" Take her. Find a way. When you succeed in changing your name, and know that you can do things, then find a way. There will be a way. \"\n \n The idea at once thrilled and frightened me.\n \n I woke writhing and in a sweat again.\n \n It was morning.\n \n I dressed and headed for the jetcopter stage and the ship for Center One.\n \n The ship was comfortable and departed on time, a transport with seats for about twenty passengers. I sat near the tail and moodily busied myself watching the gaunt brown earth far below. Between Centers there was mostly desert, only occasional patches of green. Before the atomic decade, I had heard, nearly all the earth was green and teemed with life ... birds, insects, animals, people, too. It was hard rock and sand now, with a few scrubs hanging on for life. The pre-atomics, who hadn't mastered synthesization, would have a hard time scratching existence from the earth today.\n \n I tried to break the sad mood, and started to look around at some of the other passengers. That was when I first noticed the prisoners in the forward seats. Man and woman, they were, a youngish, rather non-descript couple, thin, very quiet. They were manacled and two Deacons sat across from them. The Deacons' backs were turned to me and I could see the prisoners' faces.\n \n They had curious faces. Their eyes were indescribably sad, and yet their lips seemed to be ready to smile at any moment.\n \n They were holding hands, not seeming to care about this vulgar emotional display.\n \n I had the sudden crazy idea that Lara and I were sitting there, holding hands like that, nonconforming in the highest, and that we were wonderfully happy. Our eyes were sad too, but we were really happy, quietly happy, and that was why our lips stayed upon the brink of a smile.",
      "metadata": {
        "title": "I, the Unspeakable",
        "author": "Walt Sheldon",
        "passage_id": "51210",
        "uid": "0b419fac2b9f42d38531f21de380c4d2",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "102",
                "uid": "11dd8ba238544c898543567786418130",
                "response_text": "The narrator is awoken by a female voice in his head. He recounts his time as a conformist citizen of Northem, a futuristic dystopian civilization: one day, he wakes up and regards himself in the mirror, observing signs of aging on his face. He sees the toll of the past two years, since the renumbering. \nThe narrator explains that, as part of ensuring the efficiency of Northem, the designation of each citizen is periodically changed. In the most recent one, everyone was assigned six numerical digits and a prefix or suffix of four letters, which often spelled something pronounceable – for the narrator, the four letters spelled an unspeakably vulgar word. As a result, the narrator is forced to infract from his job and assume non-productive status and begins encountering difficulties in quotidien tasks, such as receiving his realfood package. Furthermore, his designation prevents him from acquiring gainful employment and reassuming productive status, as well as the ability to mate. \nThe narrator then recounts hearing the woman’s voice for the first time. She encourages him to change his name, a difficult thing to do because of its implied criticism of the state. The voice returns in his sleep, nearly every night. Driven by his loneliness and social ostracization, the narrator brings himself to the Govpub Office, a sort of government center, in an attempt to change his designation. \nIn the underground office of his local Govpub Office, the narrator navigates his way to the Numbering and Identity section with help of a cyb, an automated assistant. In the round room that is the Number and Identity department, he observes a remarkably attractive woman at the information desk. Though he is nervous at first, fearing that he will have to share with her his embarrassing name, he dismisses his hesitance and approaches her. He reluctantly shares his name, and asks that she direct him to information concerning state serial designations. \nAs the girl, whose name she reveals is LARA, leads the narrator to information bank 29 where the requested information is stored, they share an inappropriate moment: Lara trips and the narrator grabs her arms. Lara’s demeanor changes, and she now conducts herself in an all-business fashion. At bank 29, Lara explains to the narrator the tasks he must complete in order to change his name, including traveling to the capital. On their way back to the main room, the narrator makes a joke which elicits a laugh from Lara. As she enters the rotunda, she abruptly stops laughing. The narrator, following closely behind, quickly realizes why: two Deacons, officers of the state, are at the central desk. \nOn the night before his departure to the capital, the narrator once again hears the mysterious female voice in his head. She tells him that he is attracted to Lara. On the transport to the capital the narrator sees a young couple holding hands, and pictures himself with Lara in their position.\n"
              },
              {
                "worker_id": "103",
                "uid": "1c5ddd896ea841ea89234102f2ce9331",
                "response_text": "The story starts with the main character having a dream that tells him to do something. Later we learn that the voice in his dream is telling him to escape from the life that he is living now. We learn that there had been an atomic disaster that changed the way people live. The main character explains that now everyone has a code as their name. It consists of six digits with a four letter prefix or suffix. And two years ago when he got his name, it was so unusual and embarrassing that no one even wanted to pronounce it. And the name is the reason he lost his job; it is the reason that he cannot get a woman who would agree to mate with him. He was okay at first with this N/P (Non-Producer) status, however, later he realizes that the boredom of being a N/P is too much. He goes looking for jobs. However, it disappointed him again. When the employer hears about his specialty, they look very delight. However, when he hands them his tag with his name on it, they always tell him that they will call if anything turns up. But just like what happened with the Eugenic Center, no one called. The main character further complains about being an N/P, it might sound great at first, but he cannot even get a package.\n\nFinally, with the voice in his dream telling him to “do it” every night, he decided to go to the Govpub Office in Center Four to look for ways that he can change his name. At the N. & I. he gets attracted to the information desk girl, L-A-R-A 339/827. He asked her for information regarding how State Serial, thus the names, are assigned, and how they can be changed. After hearing his name, she is a bit shocked, but then she decides to help him out. Then later she points out that he needs to get a travel permit in order to get to Opsych, The Office of Psychological Adjustment. Apparently, Opsych is the only place that can authorize a change to the State Serial. She tells him to explain how his State Serial has affected his E.A.C, and then there may be a chance that they will change it. Even though he is still doubtful that night, the next day he goes to the jetcopter stage and board the ship for Center One. "
              },
              {
                "worker_id": "101",
                "uid": "586e7936eb9941978028b9d956a4cf8c",
                "response_text": "The narrator awakes after hearing a feminine voice call out to him in his dreams; it is a voice he is used to hearing, but is nevertheless bothersome. As he wakes up, the chief calls him into work, where he practices magnetic mechanics in hopes of developing space travel beyond Mars. The chief tells the narrator that he would like to switch him to another department; the narrator responds by resigning from him job. The world of Mars, divided into the Northem and Southem, has practices in regulating its civilians. One of these was a renaming of everyone in the Northem, where everyone was given four letters and a series of numbers. The narrator's name is unfortunate and unspeakable, and creates difficulty in his profession, causing him to lose his job. The narrator then becomes unemployed, given the Non-Productive status, and struggles to find another job due to his name. The narrator's name also disrupts other aspects of daily life, including mating and social interaction. The narrator considers changing his name, but decides that it would be seen as criticism to the State. However, one night, the voice calls out to him again in his dreams, urging him to change his name. The next day, the narrator is led to the Govpub office by the voice. There, he is led to the Numbering and Identity section, where he meets Lara, sitting at the information desk. The narrator is immediately attracted to Lara, who tells him that names can be changed if he moves to a higher Emotional Adjustment Category. The narrator, already having achieved the highest EAC, argues that if anything, the difficulties his name has given him have lowered it. Lara advises that he pose this argument to the Office of Psychological Adjustment, where he gets a travel permit the next day. That night, the voice in his dreams encourages him yet again to go on this journey, and the following morning he boards the ship, where he notices two prisoners aboard, holding hands despite their lack of freedom. The narrator then considers what it would be like to be there with Lara, nonconforming but happy."
              },
              {
                "worker_id": "104",
                "uid": "982b4ca7f133466bac8618b7d10d96fa",
                "response_text": "The plot begins with a narrator discussing his morning routine as a citizen of Northem. Northem is located on Earth after the atomic period. He discusses the process of renumbering. The narrator mentions how his designation has been unfortunate since he was assigned it as it is embarrassing and causes people not to want to associate with him. The narrator has an important job but is eventually let go because of his name. As a result of losing his job, he is placed on a Non-Productive status, limiting his ability to require goods and where he can live. An N/P status is not looked upon as good by other citizens of Northem. \n\nThe narrator describes how because of his name and he cannot get a job, mate, or have a social life. Because of the rules of the State, it is unthinkable to change a person’s assigned name. The narrator desperately wants to mate and thinks of ideas on how he might be able to mate. When he sleeps, a seductive voice comes to the narrator in his dreams. The voice encourages the narrator to change his name, even though the idea would be nonconformist according to Northem standards. On the 17th day of the 9th month, the narrator decides to try to change his name and heads to a Govpub office. He is then directed to the Numbering and Identity office where he meets a woman that he finds very attractive. He tells her his name and she reacts negatively, but then recovers. They talk casually, not a common occurrence in Northem. The narrator manages to make Lara, the girl in the office, blush. \n\nLara discusses how she can help the narrator change his name and tells him that he has to go to the Capital and go to the Office of Psychological Adjustment. He needs a travel permit to go to the capital. Over the next day, he is excited about the possibility of his name actually being changed. The voice in his dream continues to encourage him to get his name changed. While on the transportation to the capital, he sees two prisoners who appear to be a couple. They display emotions that he describes as vulgar. Yet, he is curious about their relationship as they sit holding hands. He expresses a desire to be in the same position as the couple, but with him and Lara instead. \n"
              }
            ]
          },
          {
            "question_text": "What appears to be the role of the State in the Northem?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "102",
                "uid": "11dd8ba238544c898543567786418130",
                "response_text": "Northem, one of the two superstates of the world and home to the Narrator, is ruled by the State. It is highly efficient, and allocates alphanumeric designations to its citizens to be used as names. In the most recent renumbering, the State assigns the narrator an unspeakable four-letter designation. \n\tThe State, through its officers the Deacons, enforces norms of acceptability. These norms include the ranges of physical attractiveness within which women are required to stay, the flat tone of voice in which citizens must speak, and the facial expressions citizens are allowed to display. Additionally, the State regulates sexual behaviour: mating is only allowed in Eugenic Centers, and those who infract upon sexual norms are sent to a prison planet called Marscol. \n\tThe State further regulates the allocation of realfood, such as eggs, which is a valuable commodity. When the balance of trade between Northem and Southem, the other superstate, fluctuates, more or less realfood becomes available. Non-productive members of society, so long as they are conformists, or loyal members of the state, are cared for by the State.\n"
              },
              {
                "worker_id": "103",
                "uid": "1c5ddd896ea841ea89234102f2ce9331",
                "response_text": "The State is currently ruling over Northem. They’ve set rules that must be followed by the citizens, those that infract and do not obey will be send to Marscol. Those that follow the rules, the states will provide food to them. Thus, the State cultivate and organize conformists, and tell them to obey rules. Moreover, because the old designations were not efficient, and there are more than two billion people in Northem. Thus the State has decided to introduce a new renumbering system that would be benificial to both the Northm and the Southem. Thus everyone was renumbered. They each receives a six digits along with four digits of prefix or sufix. \n\nFurthermore, the State favors short and succinct languages. It prefers efficiency. They changed the numbering system because it was not efficient; the boss was trying to ease the main character out because he desired an efficient organization; the cyb asked for efficient words when the main character was the Govpub Office. \n\nAlso, there had been political differences between the Northern and Southern states. During those times, they each spread longitudinally across the globe. While not in war currently, both of the states are geared up for it. "
              },
              {
                "worker_id": "101",
                "uid": "586e7936eb9941978028b9d956a4cf8c",
                "response_text": "The Northem acts as the moral, civilized, and orderly opposition to the Southem. The State helps to enforce this order and civility, primarily by the renumbering of its citizens. This structured system of naming attempts to place citizens on similar levels and address each other formally. To challenge this naming system would be to question the authority of the State. Society is also divided into Producers and Non-Producers; the Non-Producers are seen as draining of the Northem, reinforcing productivity as a defining value of the State. The State also aids in enforcing mating regulations; the narrator notes that pre-atomic civilization had free mating, where public affection and partnership was common; however, mating is now a State-regulated activity as provided by Eugenic Centers."
              },
              {
                "worker_id": "104",
                "uid": "982b4ca7f133466bac8618b7d10d96fa",
                "response_text": "The citizens of Northem are conformists that dare do not go against the State nor criticize the State. The State regulates nearly every aspect of a person’s life. The State of Northem is in charge of renumbering, assigning a work designation, food allotments, sleeping arrangements, and mating abilities for its citizens. Renumbering is claimed to help the war-type struggle against Southem. With the new designation, every person was assigned six digits and four letters as a prefix or suffix. "
              }
            ]
          },
          {
            "question_text": "What is the narrator’s relationship to the mysterious voice in his dreams?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "102",
                "uid": "11dd8ba238544c898543567786418130",
                "response_text": "As the narrator finds it increasingly difficult to find a sexual partner as a result of his state-appointed designation, he begins to hear a mysterious female voice in his dreams. She first encourages him to change his name. Initially, he worries that his sleep-learner, a wearable head device which enables learning during sleep, has malfunctioned, but he finds no evidence of this. \nThe narrator hears the voice nearly every night. He often worries about the voice, as the contents of its speech are heretical. She encourages him to go to the Govpub office, a sort of government office in his locality, and he eventually obliges. \nOn the night before the narrator is slated to take a transport to the capital to change his name, he hears the voice again. It encourages him to persevere, and that he is attracted to Lara, a woman he had met earlier in the week. The voice further pushes him to pursue a relationship with Lara once he is able to change his name.\n"
              },
              {
                "worker_id": "103",
                "uid": "1c5ddd896ea841ea89234102f2ce9331",
                "response_text": "The mysterious voice always come to the main character during his dreams. It insists that he should “do it,” thus change his way of living. Because of his name, he has lost his job, and he is not able to mate. Even living an everyday life is quite difficult. The voice wants him to change that. She does not state that she want him to commit nonconformity, but making heretical remarks besides. The narrator’s difficulty in finding a new job and in having a normal social life negatively affects him because of name and no post. He feels lonely, thus there is a desire to change his name. The urge to reproduce himself becomes unbearable. He concoctes all sorts of wild schemes. The mysterious voice encourages him to dare to change his name, and find the freedom. When he even catches himeself wondering just how he'd go about this idea of hers. Wondering what the first step might be. The voice will appear at night and tell him the prompts. He absorbs the concepts unconsciously. He follows what the voice leads him to do. On the night before he board the ship for Center One, he thinks of objections to refute the voice. He thinks of his life now, and how breaking away from it will be very difficult. However, even though he is still hesitating if he should go, the voice seems to understand him very well. It reminds him of Lara, of how there will be a way to change his name, and to take her with him. "
              },
              {
                "worker_id": "101",
                "uid": "586e7936eb9941978028b9d956a4cf8c",
                "response_text": "The narrator experiences a voice in his dreams that encourages him to take risks, particularly regarding changing his name. He hears the voice practically every night, and describes it as a woman's voice: intense, seductive, and intriguing. The voice, though enticing, troubles the narrator, as he is concerned about the consequences of the actions that she is suggesting. However, as he continues to hear the voice every night, he starts to consider obeying it. The voice then drives him to begin the journey of changing his name, which is risky and radical in his society, and also tempts him in pursuing Lara and gaining freedom."
              },
              {
                "worker_id": "104",
                "uid": "982b4ca7f133466bac8618b7d10d96fa",
                "response_text": "The mysterious voice in the narrator’s dreams talks in a seductive tone that was low and intense. The voice in his dreams went against the narrator’s conformists ideals that fit the State in the Northem. It suggests non-standard actions in an emotional tone that is unthinkable behavior in the Northem. The actions the voice suggest are ones of nonconformity and criticisms against the State. The narrator is hesitant and unsure about the voice’s presence. The voice continues to encourage the narrator to change his name. It even suggests that he should act on his attraction to Lara. "
              }
            ]
          },
          {
            "question_text": "How does the narrator’s name affect his social life?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "102",
                "uid": "11dd8ba238544c898543567786418130",
                "response_text": "The narrator, who was designated an unspeakably vulgar four-letter designation during the last renumbering, has been negatively affected by his new name. Because of its distracting effect on those who learn it, he is forced to resign from his job studying magnetic mechanics and assume non-productive status, which in turn hampers his ability to acquire realfood. Theoretical research which the narrator privately conducts could not be published. His designation further prevents him from participating in group games at the rec center, special interest clubs, and State Loyalty chapters. The narrator is unable to mate since, at the Eugenic Centers where mating is regulated by the State, he must submit an application which must be approved by women who are authorized to mate with him."
              },
              {
                "worker_id": "103",
                "uid": "1c5ddd896ea841ea89234102f2ce9331",
                "response_text": "His social life is heavily affected by his name. He cannot get himself off the N/P status with his name. Firslty, he loses his job due to this name. He can still remember the day that he got his name, and the embarrasement that came with it. His boss finds his name making the company less efficient, making him resign. Secondly, he cannot find any new job. Each of the employer, hearing his name, would tell him that they will call of something comes up. But they never do. Secondly, he can hardly join group games at any of the rec centers. No special interest clubs or even State Loyalty chapters would allow him to join them; simply because of his name, he can scarcely submit any findings for publication, at least not under his name. Moreover, because he is at N/P status, he cannot even get his order because the distributer tells him to get to the end of the line. And the food packages never reachese the end. Lastly, he cannot mate, no one at the Eugenic Center would even bother to call him back after hearing his name. No woman would want to mate with him. Thus, he feels terribly lonely. "
              },
              {
                "worker_id": "101",
                "uid": "586e7936eb9941978028b9d956a4cf8c",
                "response_text": "The narrator's name makes it difficult for him to lead a normal life, and instead makes him very lonely. At the beginning of the story, the narrator's chief lets him go from his place of employment, because of the difficulties that his name brought to the workplace. He has trouble getting a new job, despite his impressive expertise, because of his name. This makes the narrator stuck in the Non-Productive status, which interrupts his everyday life, including on realfood day, joining games and clubs, and even being unable to publish anything with his name on it. These difficulties also apply for mating; the narrator is unable to find a partner and finds himself extremely lonely. "
              },
              {
                "worker_id": "104",
                "uid": "982b4ca7f133466bac8618b7d10d96fa",
                "response_text": "The narrator is embarrassed by his name and upset with it due to its effect on his social life. Women and others, in general, become quite embarrassed when they hear his name. People seem to not want to associate with him due to his name. He loses his job because of his name, though the manager does not directly state that it is the reason. People do not want him to join their group games, clubs, or State Loyalty chapters and his research is unable to be submitted for publication. Because people have adverse reactions to his name, the narrator is lonely due to the lack of his social life. In addition, because of his name, the narrator is not able to mate with a woman. His inability to find a woman that will mate with him creates a longing and a desire for him to mate with a woman. "
              }
            ]
          },
          {
            "question_text": "How do others react upon hearing the narrator’s name?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "102",
                "uid": "11dd8ba238544c898543567786418130",
                "response_text": "Typically, people are unwelcoming of the narrator upon learning his name. During his job search, he is welcome in virtue of his previous experience in space drives, but is quickly dismissed upon sharing his name. In submitting his application to mate at a Eugenic Center, the clerk dismisses the narrator’s chances of finding a mate with a reminder that the women are able to refuse. Lara, the information clerk at the department of Numbering and Identity, is taken aback and hesitates in recording the narrator’s personal information. \n"
              },
              {
                "worker_id": "103",
                "uid": "1c5ddd896ea841ea89234102f2ce9331",
                "response_text": "People around the narrator are embarrassed to even utter his name. When he reports his name to his chief of his past job, his boss was speechless, and definitely was feeling awkward. He did not give the name to the secretarial engineer, who usually takes care of the names. Instead, he went directly to the administrative circuits. Later, the boss asked him to resign, simply because of his name. Moreover, when trying to get hired for other jobs, upon hearing his name, the employer would react with confusion, and they would try to be polite and say that they will call if any thing turn up. The women at the Eugenic Center have similar reactions. They would be embarrassed, and then tell him that they will call if anything comes up. But they never do. At monthly realfood day, he can hardly get the package because the distributor sees his post and realizes that he is a Non-Producer, they would tell him to go to the end of the line, where the food never gets there. Even Lara was a bit shocked, and she has to take some time to recover. "
              },
              {
                "worker_id": "101",
                "uid": "586e7936eb9941978028b9d956a4cf8c",
                "response_text": "Upon hearing the narrator's name, people are shocked, and sympathetically try to ignore it. Firstly, when the narrator first reports his name to the chief, he reacts silently and refuses to share it with anyone else. The chief then does not refer to the narrator by his name, instead calling him by nicknames. When the clerk at the Eugenic Center hears the narrator's name, he coughs awkwardly and reminds the narrator that women have the right to refuse entering the mating booth with him. When Lara hears the narrator's name, she tries to hide her reaction and looks down, but takes longer to record it."
              },
              {
                "worker_id": "104",
                "uid": "982b4ca7f133466bac8618b7d10d96fa",
                "response_text": "People have various reactions when they hear the narrator’s name. When he first reports his name to his chief, the chief does not respond directly and instead becomes red in the face and chokes from the shock. Individuals at the different bureaus during his search for a job are excited when they learn of his job specialty, but lose their delight when they see his name on his name tag. A clerk at the Eugenic Center reacts to the narrator’s name with surprise and becomes uncomfortable, shown by his fidgeting and coughing that follows hearing the name. In general, many people have an uncomfortable reaction to his name and have to take a second to process it and recover from their reaction. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5102,
        "document_length_chars": 28902
      }
    }
  ]
}