{
  "item_metadata": {
    "item_id": "51241",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51241",
      "content": "Bridge Crossing\n \n \n BY DAVE DRYFOOS\n \n Illustrated by HARRISON\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction May 1951. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n He knew the city was organized for his individual defense, for it had been that way since he was born. But who was his enemy?\n \n \n \n In 1849, the mist that sometimes rolled through the Golden Gate was known as fog. In 2149, it had become far more frequent, and was known as smog. By 2349, it was fog again.\n \n But tonight there was smoke mixed with the fog. Roddie could smell it. Somewhere in the forested ruins, fire was burning.\n \n He wasn't worried. The small blaze that smoldered behind him on the cracked concrete floor had consumed everything burnable within blocks; what remained of the gutted concrete office building from which he peered was fire-proof.\n \n But Roddie was himself aflame with anger. As always when Invaders broke in from the north, he'd been left behind with his nurse, Molly, while the soldiers went out to fight.\n \n And nowadays Molly's presence wasn't the comfort it used to be. He felt almost ready to jump out of his skin, the way she rocked and knitted in that grating ruined chair, saying over and over again, \"The soldiers don't want little boys. The soldiers don't want little boys. The soldiers don't—\"\n \n \"I'm not a little boy!\" Roddie suddenly shouted. \"I'm full-grown and I've never even seen an Invader. Why won't you let me go and fight?\"\n \n Fiercely he crossed the bare, gritty floor and shook Molly's shoulder. She rattled under his jarring hand, and abruptly changed the subject.\n \n \"A is for Atom, B is for Bomb, C is for Corpse—\" she chanted.\n \n Roddie reached into her shapeless dress and pinched. Lately that had helped her over these spells. But this time, though it stopped the kindergarten song, the treatment only started something worse.\n \n \"Wuzzums hungry?\" Molly cooed, still rocking.\n \n Utterly disgusted, Roddie ripped her head off her neck.\n \n It was a completely futile gesture. The complicated mind that had cared for him and taught him speech and the alphabet hadn't made him a mechanic, and his only tool was a broken-handled screwdriver.\n \n \n\n \n He was still tinkering when the soldiers came in. While they lined up along the wall, he put Molly's head back on her neck.\n \n She gaped coyly at the new arrivals. \"Hello, boys,\" she simpered.\n\"Looking for a good time?\"\n \n Roddie slapped her to silence, reflecting briefly that there were many things he didn't know about Molly. But there was work to be done. Carefully he framed the ritual words she'd taught him: \"Soldiers, come to attention and report!\"\n \n There were eleven of them, six feet tall, with four limbs and eight extremities. They stood uniformly, the thumbs on each pair of hands touching along the center line of the legs, front feet turned out at an angle of forty-five degrees, rear feet turned inward at thirty degrees.\n \n \"Sir,\" they chorused, \"we have met the enemy and he is ours.\"\n \n He inspected them. All were scratched and dented, but one in particular seemed badly damaged. His left arm was almost severed at the shoulder.\n \n \"Come here, fellow,\" Roddie said. \"Let's see if I can fix that.\"\n \n The soldier took a step forward, lurched suddenly, stopped, and whipped out a bayonet.\n \n \"Death to Invaders!\" he yelled, and charged crazily.\n \n \n \n Molly stepped in front of him.\n \n \"You aren't being very nice to my baby,\" she murmured, and thrust her knitting needles into his eyes.\n \n Roddie jumped behind him, knocked off his helmet, and pressed a soft spot on his conical skull. The soldier collapsed to the floor.\n \n \n\n \n Roddie salvaged and returned Molly's needles. Then he examined the patient, tearing him apart as a boy dismembers an alarm clock.\n \n It was lucky he did. The left arm's pair of hands suddenly writhed off the floor in an effort to choke him. But because the arm was detached at the shoulder and therefore blind, he escaped the clutching onslaught and could goad the reflexing hands into assaulting one another harmlessly.\n \n \n \n Meanwhile, the other soldiers left, except for one, apparently another casualty, who stumbled on his way out and fell into the fire. By the time Roddie had hauled him clear, damage was beyond repair. Roddie swore, then decided to try combining parts of this casualty with pieces of the other to make a whole one.\n \n To get more light for the operation, he poked up the fire. Roddie was new at his work, and took it seriously. It alarmed him to watch the soldiers melt away, gradually succumbing to battle damage, shamed him to see the empty ruins burn section by section as the Invaders repeatedly broke through and had to be burned out.\n \n Soon there would be nothing left of the Private Property Keep Out that, according to Molly's bedtime story, the Owners had entrusted to them when driven away by radioactivity. Soon the soldiers themselves would be gone. None would remain to guard the city but a few strayed servants like Molly, and an occasional Civil Defender.\n \n And himself, Roddie reflected, spitting savagely into the fire. He might remain. But how he fitted into the picture, he didn't know. And Molly, who claimed to have found him in the ruins after a fight with Invaders twenty years before, couldn't or wouldn't say.\n \n Well, for as long as possible, Roddie decided, he'd do his duty as the others did theirs—single-mindedly. Eventually the soldiers might accept him as one of themselves; meanwhile, this newly attempted first aid was useful to them.\n \n He gave the fire a final poke and then paused, wondering if, when heated, his screwdriver could make an unfastened end of wire stick on the grayish spot where it seemed to belong.\n \n Stretching prone to blow the embers hot so he could try out his new idea, Roddie got too close to the flames. Instantly the room filled with the stench of singed hair. Roddie drew angrily back, beating out the sparks in his uncut blond mane.\n \n As he stood slapping his head and muttering, a deranged Civil Defense firefighter popped into the doorway and covered him with carbon dioxide foam.\n \n Roddie fled. His life-long friends were not merely wearing out, they were unbearably wearing.\n \n \n\n \n In the street, even before he'd wiped off the foam, he regretted his flight. The fire was back home. And here in the cold of this fog-shrouded canyon, a mere trail between heaped-up walls of rubble, the diaper he wore felt inadequate against the pre-dawn cold. His cherished weapon, a magnetic tack-hammer, was chill beneath the diaper's top, and the broken, radium-dialed wristwatch suspended from a string around his neck hung clammy against his chest. He stood irresolute on numbing bare feet, and considered returning to the more familiar bedlam.\n \n But colder than cold was his shame at being cold. Molly never was, though she knew how to keep him warm, nor were the others. Hunger, thirst, pain and coldness were sensations never experienced by his friends. Like the growth he'd been undergoing till recently, these were things of ignominy, to be hidden as far as possible from inquiring eyes. Cold as it was, he'd have to hide.\n \n Temporarily, the darkness concealed him, though it was not quite complete. From above the fog, the moon played vaguely deceptive light on the splinters of architecture looming toward it. Some distance off, an owl hooted, but here nocturnal rodents felt free to squeak and rustle as they scampered.\n \n The world seemed ghostly. Yet it wasn't dead; it merely lurked. And as an irrepressible yawn reminded Roddie of his absurd need for sleep even in the midst of danger, he concluded for the thousandth time that the One who'd built him must have been an apprentice.\n \n For just such reasons he'd developed the hideout toward which he now walked. It had been the haven of his adolescence, when the discovery of how much he differed from his friends had been a shock, and the shock itself a difference to be hidden.\n \n His hiding place was a manhole, dead center in the dead street. A weathered bronze bar, carefully placed in the cover's slotted rim, was the levering key that opened its door.\n  Everything was wrong tonight! He couldn't even find the bar. Of course that spoiled things, because the bar was a roller on which to move the heavy cover from below, and a support that held it ajar for ventilation.\n \n But the example of his friends had taught him above all else to carry out every purpose. Molly was a nurse; she had raised him despite all obstacles. The soldiers were guards; they protected the ruins against everything larger than a rat. The firefighter had put even him out when he was aflame....\n \n Anyhow, the manhole cover had been loosened by his frequent handling. He lifted it aside by main strength, then flattened himself to the street, and felt with his feet for the top rung.\n \n Halfway down the iron ladder, something made him pause. He looked, but saw only blackness. He listened, sniffed, found nothing. What could have entered through the iron cover?\n \n He sneered at his own timidity and jumped to the bottom.\n \n It was warm! The dry bottom of the hole had the temperature of body heat, as if a large animal had recently rested there!\n \n \n\n \n Quickly, Roddie drew the hammer from his waist. Then, with weapon ready for an instantaneous blow, he stretched his left hand through the darkness. He touched something warm, softish. Gingerly he felt over that curving surface for identifying features.\n \n While Roddie investigated by touch, his long fingers were suddenly seized and bitten. At the same time, his right shin received a savage kick. And his own retaliatory blow was checked in mid-swing by an unexpected voice.\n \n \"Get your filthy hands off me!\" it whispered angrily. \"Who do you think you are?\"\n \n Startled, he dropped his hammer. \"I'm Roddie,\" he said, squatting to fumble for it. \"Who do you think you are?\"\n \n \"I'm Ida, naturally! Just how many girls are there in this raiding party?\"\n \n His first Invader—and he had dropped his weapon!\n \n Scrabbling fearfully in the dust for his hammer, Roddie paused suddenly. This girl—whatever that was—seemed to think him one of her own kind. There was a chance, not much, but worth taking, to turn delay to advantage. Maybe he could learn something of value before he killed her. That would make the soldiers accept him!\n \n He stalled, seeking a gambit. \"How would I know how many girls there are?\"\n \n Half expecting a blow, he got instead an apology. \"I'm sorry,\" the girl said. \"I should have known. Never even heard your name before, either. Roddie.... Whose boat did you come in, Roddie?\"\n \n Boat? What was a boat? \"How would I know?\" he repeated, voice tight with fear of discovery.\n \n If she noticed the tension, she didn't show it. Certainly her whisper was friendly enough. \"Oh, you're one of the fellows from Bodega, then. They shoved a boy into our boat at the last minute, too. Tough, wasn't it, getting separated in the fog and tide like that? If only we didn't have to use boats.... But, say, how are we going to get away from here?\"\n \n \"I wouldn't know,\" Roddie said, closing his fingers on the hammer, and rising. \"How did you get in?\"\n \n \"Followed your footprints. It was sundown and I saw human tracks in the dust and they led me here. Where were you?\"\n \n \"Scouting around,\" Roddie said vaguely. \"How did you know I was a man when I came back?\"\n \n \"Because you couldn't see me, silly! You know perfectly well these androids are heat-sensitive and can locate us in the dark!\"\n \n Indeed he did know! Many times he'd felt ashamed that Molly could find him whenever she wanted to, even here in the manhole. But perhaps the manhole would help him now to redeem himself....\n \n \n\n \n \"I'd like to get a look at you,\" he said.\n \n The girl laughed self-consciously. \"It's getting gray out. You'll see me soon enough.\"\n \n But she'd see him , Roddie realized. He had to talk fast.\n \n \"What'll we do when it's light?\" he asked.\n \n \"Well, I guess the boats have gone,\" Ida said. \"You could swim the Gate, I guess—you seem tall and strong enough. But I couldn't. You'll think it's crazy, but I've given this some thought, and even looked it over from the other side. I expect to try the Golden Gate Bridge!\"\n \n Now he was getting somewhere! The bridge was ruined, impassable. Even her own people had crossed the Strait by other means. But if there were a way over the bridge....\n \n \"It's broken,\" he said. \"How in the world can we cross it?\"\n \n \"Oh, you'll find out, if you take me up there. I—I don't want to be alone, Roddie. Will you go with me? Now?\"\n \n Well, she could be made to point out the route before he killed her— if nothing happened when she saw him.\n \n Uneasy, Roddie hefted the hammer in his hand.\n \n A giggle broke the pause. \"It's nice of you to wait and let me go first up the ladder,\" the girl said. \"But where the heck is the rusty old thing?\"\n \n \"I'll go first,\" said Roddie. He might need the advantage. \"The ladder's right behind me.\"\n \n He climbed with hammer in teeth, and stretched his left hand from street level to grasp and neutralize the girl's right. Then, nervously fingering his weapon, he stared at her in the thin gray dawn.\n \n She was short and lean, except for roundnesses here and there. From her shapeless doeskin dress stretched slender legs that tapered to feet that were bare, tiny, and, like her hands, only two in number.\n \n Roddie was pleased. They were evenly matched as to members, and that would make things easy when the time came.\n \n He looked into her face. It smiled at him, tanned and ruddy, with a full mouth and bright dark eyes that hid under long lashes when he looked too long.\n \n Startling, those wary eyes. Concealing. For a moment he felt a rush of fear, but she gave his hand a squeeze before twisting loose, and burst into sudden laughter.\n \n \"Diapers!\" she chortled, struggling to keep her voice low. \"My big, strong, blond and blue-eyed hero goes into battle wearing diapers, and carrying only a hammer to fight with! You're the most unforgettable character I have ever known!\"\n \n He'd passed inspection, then—so far. He expelled his withheld breath, and said, \"I think you'll find me a little odd, in some ways.\"\n \n \"Oh, not at all,\" Ida replied quickly. \"Different, yes, but I wouldn't say odd.\"\n \n \n\n \n When they started down the street, she was nervous despite Roddie's assertion that he knew where the soldiers were posted. He wondered if she felt some of the doubt he'd tried to conceal, shared his visions of what the soldiers might do if they found him brazenly strolling with an Invader. They might not believe he was only questioning a prisoner.\n \n Every day, his friends were becoming more unpredictable.\n \n For that very reason, because he didn't know what precautions would do any good, he took a chance and walked openly to the bridge by the most direct route. In time this apparent assurance stilled Ida's fears, and she began to talk.\n \n Many of the things she said were beyond his experience and meaningless to him, but he did note with interest how effective the soldiers had been.\n \n \"It's awful,\" Ida said. \"So few young men are left, so many casualties....\n \n \"But why do you—we—keep up the fight?\" Roddie asked. \"I mean, the soldiers will never leave the city; their purpose is to guard it and they can't leave, so they won't attack. Let them alone, and there'll be plenty of young men.\"\n \n \"Well!\" said Ida, sharply. \"You need indoctrination! Didn't they ever tell you that the city is our home, even if the stupid androids do keep us out? Don't you know how dependent we are on these raids for all our tools and things?\"\n \n She sounded suspicious. Roddie shot her a furtive, startled glance. But she wasn't standing off to fight him. On the contrary, she was too close for both comfort and combat. She bumped him hip and shoulder every few steps, and if he edged away, she followed.\n \n He went on with his questioning. \"Why are you here? I mean, sure, the others are after tools and things, but what's your purpose?\"\n \n Ida shrugged. \"I'll admit no girl has ever done it before,\" she said,\n\"but I thought I could help with the wounded. That's why I have no weapon.\"\n \n She hesitated, glanced covertly up at him, and went on with a rush of words. \"It's the lack of men, I guess. All the girls are kind of bored and hopeless, so I got this bright idea and stowed away on one of the boats when it was dark and the fog had settled down. Do you think I was being silly?\"\n \n \"No, but you do seem a little purposeless.\"\n \n In silence they trudged through a vast area of charred wood and concrete foundations on the northern end of the city. Thick fog over the water hid Alcatraz, but in-shore visibility was better, and they could see the beginning of the bridge approach.\n \n A stone rattled nearby. There was a clink of metal. Ida gasped, and clung to Roddie's arm.\n \n \"Behind me!\" he whispered urgently. \"Get behind me and hold on!\"\n \n He felt Ida's arms encircling his waist, her chin digging into his back below the left shoulder. Facing them, a hundred feet away, stood a soldier. He looked contemptuous, hostile.\n \n \n \n \"It's all right,\" Roddie said, his voice breaking.\n \n There was a long, sullen, heart-stopping stare. Then the soldier turned and walked away.\n \n Ida's grip loosened, and he could feel her sag behind him. Roddie turned and held her. With eyes closed, she pressed cold blue lips to his. He grimaced and turned away his head.\n \n Ida's response was quick. \"Forgive me,\" she breathed, and slipped from his arms, but she held herself erect. \"I was so scared. And then we've had no sleep, no food or water.\"\n \n Roddie was familiar with these signs of weakness, proud of appearing to deny his own humiliating needs.\n \n \"I guess you're not as strong as me,\" he said smugly. \"I'll take care of you. Of course we can't sleep now, but I'll get food and water.\"\n \n Leaving her to follow, he turned left to the ruins of a supermarket he had previously visited, demonstrating his superior strength by setting a pace Ida couldn't match. By the time she caught up with him, he had grubbed out a few cans of the special size that Molly always chose. Picking two that were neither dented, swollen, nor rusted, he smashed an end of each with his hammer, and gave Ida her choice of strained spinach or squash.\n \n \"Baby food!\" she muttered. \"Maybe it's just what we need, but to eat baby food with a man wearing a diaper.... Tell me, Roddie, how did you happen to know where to find it?\"\n \n \"Well, this is the northern end of the city,\" he answered, shrugging.\n\"I've been here before.\"\n \n \"Why did the soldier let us go?\"\n \n \"This watch,\" he said, touching the radium dial. \"It's a talisman.\"\n \n But Ida's eyes had widened, and the color was gone from her face. She was silent, too, except when asking him to fill his fast-emptied can with rain-water. She didn't finish her own portion, but lay back in the rubble with feet higher than her head, obviously trying to renew her strength.\n \n And when they resumed their walk, her sullen, fear-clouded face showed plainly that he'd given himself away.\n \n But to kill her now, before learning how she planned to cross the supposedly impassable bridge, seemed as purposeless and impulsive as Ida herself. Roddie didn't think, in any case, that her death would satisfy the soldiers. With new and useful information to offer, he might join them as an equal at last. But if his dalliance with this enemy seemed pointless, not even Molly's knitting needles could protect him.\n \n He was sure the soldiers must be tracking the mysterious emanations of his watch dial, and had trouble to keep from glancing over his shoulder at every step. But arrival at the bridge approach ended the need for this self-restraint. Here, difficult going demanded full attention.\n \n \n\n \n He'd never gone as far as the bridge before, not having wanted to look as if he might be leaving the city. The approach was a jungle of concrete with an underbrush of reinforcing-steel that reached for the unwary with rusted spines. Frequently they had to balance on cracked girders, and inch over roadless spots high off the ground.\n \n Here Ida took the lead. When they got to where three approach roads made a clover-leaf, she led him down a side road and into a forest.\n \n Roddie stopped, and seized her arm.\n \n \"What are you trying to do?\" he demanded.\n \n \"I'm taking you with me,\" Ida said firmly. \"Taking you where you belong!\"\n \n \"No!\" he blurted, drawing his hammer. \"I can't go, nor let you go. I belong here!\"\n \n Ida gasped, twisted loose, and ran. Roddie ran after her.\n \n She wasn't so easily caught. Like a frightened doe, she dashed in and out among the trees, leaped to the bridge's underpinnings where they thrust rustedly from a cliff, and scrambled up the ramp.\n \n Roddie sighed and slowed down. The pavement ended just beyond the cable anchors. From there to the south tower, only an occasional dangling support wire showed where the actual bridge had been suspended. Ida was trapped.\n \n He could take his time. Let the soldiers come up, as they undoubtedly would, to finish the job....\n \n But Ida didn't seem to realize she was trapped. Without hesitation she dashed up the main left-hand suspension cable and ran along its curved steel surface.\n \n For a moment, Roddie thought of letting her go, letting her run up the ever-steepening catenary until—because there were no guard-ropes or handgrips—she simply fell. That would solve his problem.\n \n Except it wouldn't be his solution. Her death wouldn't prove him to his friends.\n \n He set out quickly, before Ida was lost to sight in the thick fog that billowed in straight from the ocean. At first he ran erect along the top of the yard-wide cylinder of twisted metal, but soon the curve steepened. He had to go on all fours, clinging palm and sole.\n \n Blood was on the cable where she'd passed. More blood stained it when he'd followed.\n \n But because his friends knew neither pain nor fatigue, Roddie would admit none either. Nor would he give in to the fear that dizzied him at every downward look. He scrambled on like an automaton, watching only his holds, till he rammed Ida's rear with his head.\n \n \n\n \n She had stopped, trembling and gasping. Roddie clung just below her and looked dazedly around. There was nothing in sight but fog, pierced by the rapier of rusted wire supporting them. Neither end of it was in sight.\n \n Upward lay success, if death were not nearer on the cable. No soldier had ever come even this far, for soldiers, as he'd told Ida, never left the city, were not built to do so. But he was here; with luck, he could capitalize on the differences that had plagued him so long.\n \n \"Go on!\" he ordered hoarsely. \"Move!\"\n \n There was neither answer nor result. He broke off an end of loosened wire and jabbed her rear. Ida gasped and crawled on.\n \n Up and up they went, chilled, wet, bleeding, pain-racked, exhausted. Never had Roddie felt so thoroughly the defects of his peculiar non-mechanical construction.\n \n Without realizing it, he acquired a new purpose, a duty as compelling as that of any soldier or fire-watcher. He had to keep that trembling body of his alive, mount to the tall rust tower overhead.\n \n He climbed and he made Ida climb, till, at nightmare's end, the fog thinned and they came into clear, windswept air and clawed up the last hundred feet to sanctuary.\n \n They were completely spent. Without word or thought they crept within the tower, huddled together for warmth on its dank steel deck, and slept for several hours.\n \n \n\n \n Roddie awoke as Ida finished struggling free of his unconscious grip. Limping, he joined her painful walk around the tower. From its openings they looked out on a strange and isolated world.\n \n To the north, where Ida seemed drawn as though by instinct, Mount Tamalpais reared its brushy head, a looming island above a billowy white sea of fog. To the south were the Twin Peaks, a pair of buttons on a cotton sheet. Eastward lay Mount Diablo, bald and brooding, tallest of the peaks and most forbidding.\n \n But westward over the ocean lay the land of gold—of all the kinds of gold there are, from brightest yellow to deepest orange. Only a small portion of the setting sun glared above the fog-bank; the rest seemed to have been broken off and smeared around by a child in love with its color.\n \n Fascinated, Roddie stared for minutes, but turned when Ida showed no interest. She was intent on the tower itself. Following her eyes, Roddie saw his duty made suddenly clear.\n \n Easy to make out even in the fading light was the route by which Invaders could cross to the foot of this tower on the remaining ruins of the road, climb to where he now stood, and then descend the cable over the bridge's gap and catch the city unaware. Easy to estimate was the advantage of even this perilous route over things that scattered on the water and prevented a landing in strength. Easy to see was the need to kill Ida before she carried home this knowledge.\n \n Roddie took the hammer from his waist.\n \n \"Don't! Oh, don't!\" Ida screamed. She burst into tears and covered her face with scratched and bloodied hands.\n \n Surprised, Roddie withheld the blow. He had wept, as a child, and, weeping, had for the first time learned he differed from his friends. Ida's tears disturbed him, bringing unhappy memories.\n \n \"Why should you cry?\" he asked comfortingly. \"You know your people will come back to avenge you and will destroy my friends.\"\n \n \"But—but my people are your people, too,\" Ida wailed. \"It's so senseless, now, after all our struggle to escape. Don't you see? Your friends are only machines, built by our ancestors. We are Men—and the city is ours, not theirs!\"\n \n \"It can't be,\" Roddie objected. \"The city surely belongs to those who are superior, and my friends are superior to your people, even to me. Each of us has a purpose, though, while you Invaders seem to be aimless. Each of us helps preserve the city; you only try to rob and end it by destroying it. My people must be the true Men, because they're so much more rational than yours.... And it isn't rational to let you escape.\"\n \n Ida had turned up her tear-streaked face to stare at him.\n \n \"Rational! What's rational about murdering a defenseless girl in cold blood? Don't you realize we're the same sort of being, we two? Don't—don't you remember how we've been with each other all day?\"\n \n She paused. Roddie noticed that her eyes were dark and frightened, yet somehow soft, over scarlet cheeks. He had to look away. But he said nothing.\n \n \"Never mind!\" Ida said viciously. \"You can't make me beg. Go ahead and kill—see if it proves you're superior. My people will take over the city regardless of you and me, and regardless of your jumping-jack friends, too! Men can accomplish anything!\"\n \n \n\n \n Scornfully she turned and looked toward the western twilight. It was Roddie's turn to stand and stare.\n \n \"Purpose!\" Ida flung at him over her shoulder. \"Logic! Women hear so much of that from men! You're a man, all right! Men always call it logic when they want to destroy! Loyalty to your own sort, kindness, affection—all emotional, aren't they? Not a bit logical. Emotion is for creating, and it's so much more logical to destroy, isn't it?\"\n \n She whirled back toward him, advancing as if she wanted to sink her teeth into his throat. \"Go ahead. Get it over with—if you have the courage.\"\n \n It was hard for Roddie to look away from that wrath-crimsoned face, but it was even harder to keep staring into the blaze of her eyes. He compromised by gazing out an opening at the gathering dusk. He thought for a long time before he decided to tuck his hammer away.\n \n \"It isn't reasonable to kill you now,\" he said. \"Too dark. You can't possibly get down that half-ruined manway tonight, so let's see how I feel in the morning.\"\n \n Ida began to weep again, and Roddie found it necessary to comfort her.\n \n And by morning he knew he was a Man.",
      "metadata": {
        "title": "Bridge Crossing",
        "author": "Dave Dryfoos",
        "passage_id": "51241",
        "uid": "0432355ff34b464c83f357f44cbab7b6",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "109",
                "uid": "009af7d819474772adbfce8e44e0f3bc",
                "response_text": "The protagonist of this story is Roddie, a young male character whose interactions with the characters around him include mechanical arms and robotic functionalities. It turns out that Roddie lives within a dystopian city, to which alongside his android friends, seek to defend the city against its enemy. Whilst going about his day, Roddie investigates the manhole he often frequents and finds that it has recently been visited by something warm. Further investigation reveals Ida to be the culprit, a human female who has decided to help the wounded in the city.\n\nDespite Roddie’s initial hesitance, Ida and Roddie strike up an easygoing acquaintance and gallivant around the city, with the latter guiding the former due to his experience. In addition to helping Ida find food and shelter, Roddie is able to ward off a potential attack from an android soldier with a talisman - his watch. However, this watch leads Ida to be suspicious of Roddie. As they neared the bridge, Ida insists on bringing Roddie back to where he belongs, fearing he had been wrongfully taken or indoctrinated. After a chase and climbing up the south tower, Roddie notices that Ida may be able to inform her fellow humans on how to infiltrate the city due to them being on top of the bridge. Choosing to defend his city and prove himself to his friends, Roddie does not hesitate to kill Ida and advances to do so. Ida begins to cry and defend her people - insisting that they are on the same side as Men and that the city belongs to the two of them, not Roddie’s friends. Initially in disbelief, Roddie continues to advance before deciding to leave it for the next morning before comforting Ida and later on, realizing that he too, is Man. \n"
              },
              {
                "worker_id": "112",
                "uid": "931fb996928c476ca6e0783fc2e63a63",
                "response_text": "Roddie, a man, raised by the androids in the ruined city, is angry to be left behind with his nurse, Molly, whenever the soldiers go out to fight the Invaders from the north. When he complains about it with Molly, a nursing android, Molly’s robotic response irritates him, and he rips her head off her neck. The soldiers come back when Roddie is repairing Molly. Roddie orders the soldiers to line up and report, inspecting their damages. One soldier suddenly attacks Roddie as it seems to identify Roddie as one of the Invaders, but Molly protects Roddie, and he stops it. After the chaos has been eased, Roddie tries to fix and recombine the damaged soldier while reflecting on the dim future for him and the city. He accidentally burns his hair, and a civil defender firefighter covers him with carbon dioxide foam, irritating him and making him run away. \n\nOn the street, Roddie feels cold, being shamed by the sensation of coldness and reflecting on all the other differences that he has from the androids. The night comes, and he tries to find the way down to his usual hiding spot: a manhole under a bar. Once he arrives at the bottom of the manhole, he feels the warmth, realizing that something had just rested there. He prepares his hammer as a weapon, touches the thing in the darkness, and gets attacked by it. It is a girl named Ida who is one of the Invaders. She identifies Roddie as one of her sides. Roddie takes advantage of that, intending to kill her after gaining more information about the way to pass the impassable Golden Gate Bridge that connects the ruins and the Invaders’ area. After the conversation with Ida, Roddie climbs out of the manhole, followed by Ida. When he learns that Ida recognizes him as one of the Invaders, he thinks it is his chance to be accepted by his friends by giving them his achievement. Roddie learns many new things and beliefs from Ida on their way to the bridge. They also meet an android, but Roddie lets it go away without hurting them. Roddie finds canned baby food from the ruined supermarket to feed him and Ida. Once they arrive at the bridge, as Ida keeps going towards it, Roddie grabs her, but Ida loosens his grip and escapes from him. She climbs on the dangling wire, followed by him. Ida is scared and wants to stop on the wire, but Roddie forces her to keep climbing. After they arrive at the tower, Roddie tries to kill Ida as she may bring more Invaders to come, but Ida tells him that he is a human, not an android, and surrenders herself to him. After the dispute about his identity and the superiority of either the robot or the humans, Roddie decides to wait for a night. The following day, Roddie acknowledges himself as a man."
              },
              {
                "worker_id": "111",
                "uid": "b394c82fc81648c183f71bdf6fa3b756",
                "response_text": "The story follows the journey of a man called Roddie. He lives in a destroyed San Francisco under the care of a robot called Molly. San Francisco is protected against “invaders” by other robots, who Roddie takes care of with his tools. Roddie believes that the robots are his friends and wishes to go out and fight with them against the invaders. Roddie knows that he is different from the robots, but still wishes to become a part of them. When Molly and other robots start to malfunction more and more, Roddie runs to a manhole which he uses as a hiding place. Here, he meets a girl called Ida. Roddie believes that he has to kill Ida in order to finally be able to fight side by side with the robots, but decides to first get information out of her. They traverse together to the Golden Gate Bridge, where Ida tells him that the invaders are in fact humans like them that go into the city in order to get food and supplies. Roddie doesn’t want to believe that he is like an invader, so he chases Ida to the top of the bridge in order to kill her. Here, they confront each other and Roddie was very close to killing her, but decides not to. At the end, it is insinuated that Roddie learns that he belongs with the humans at the other side of the bridge and not with the robots."
              },
              {
                "worker_id": "113",
                "uid": "b86ec5af04f94109855a29fa768bb6d3",
                "response_text": "It’s the twenty-fourth century. San Francisco is ruined and now guarded by robot soldiers built by humans in the past. They fight with humans - Invaders - and don’t let them come to the city. Roddie lives with Molly - a robotic nurse who still treats him as a child - and hasn’t seen an invader. He sits with Molly and complains about not being allowed to fight alongside the soldiers. She starts singing a children’s song, and Roddie rips her head off her neck. Soldiers come back. Roddie tries to fix one of them, but the robot unexpectedly attacks the young man. Molly defends Roddie by thrusting needles into the robot’s eyes. Roddie is working and thinking about his desire to be accepted by the soldiers. His hair catches fire accidentally, and a Civil Defense firefighter covers him with carbon dioxide foam. Roddie gets frustrated and leaves. He is walking along cold streets and stone ruins toward his hideout. Roddie comes down to his manhole and realizes that someone was there. He starts moving in the darkness and soon finds Ida, a young human girl. Roddie understands that she thinks he is one of her kind and continues talking to her. She came on some boat and followed Roddie’s footprints to his hideout. Ida says she knows a way over the Golden Gate Bridge and invites Roddie to go with her. They leave the hole, and Ida starts laughing at the diapers he’s wearing. While walking, Ida tells him that men  rely on raids for tools and that she left here to help the wounded. Suddenly they meet one of the soldiers, Roddie quickly tells him everything is fine, and the robot leaves. Ida kisses him after the shock. They go to a supermarket to get food, and Ida asks why the robot let them go. Roddie shows her his watch - a talisman, and she looks scared. They reach the bridge. Ida starts leading him somewhere unknown, saying that she’s taking him where he belongs. He refuses and starts chasing her with a hummer. While following her, Roddie starts walking along the suspension cable’s steel surface; soon, walking turns into crawling. He thinks about killing Ida - it will earn him a place among the robot soldiers. They keep going up, finally reach a tower, and fall asleep for several hours. They wake up, and Roddie decides to look around the tower. He can see Mount Tamalpais, the Twin Peaks, and Mount Diablo. He follows Ida’s gaze and finds the secret path the invaders are using. Roddie prepares to kill Ida, but she starts crying - it disturbs him. She tells him that he is a man, not a robot. Roddie says he believes the true men are rational and superior - thus, the robot soldiers are the real men. She asks him why killing a defenseless girl is rational and says that emotion is for creating. Roddie tucks his hammer away and comforts crying Ida.\n\n\n"
              }
            ]
          },
          {
            "question_text": "Who is Ida and what are her characteristics?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "109",
                "uid": "009af7d819474772adbfce8e44e0f3bc",
                "response_text": "Ida is a human girl that Roddie first encounters when she is hiding in the manhole that he frequents himself. She appears to have come into the android-ridden city on her own with the altruistic desire to help the wounded. She is selfless and persistent in her mission. She is inexperienced with the android world as demonstrated by her fright when the pair encountered a soldier, who only walked away after Roddie confronted it. Similarly, Roddie had to guide her around the city and help her with access to resources like shelter and food. \n\nIda is loyal and brave as well. Despite Roddie threatening to kill her at the end of the story, Ida insists on the idea that they are both human and that Roddie’s way of thinking was incorrect. In the end, she is able to discourage him from killing her and he ends up comforting her. \n\n"
              },
              {
                "worker_id": "112",
                "uid": "931fb996928c476ca6e0783fc2e63a63",
                "response_text": "Ida is short and lean, wearing a doeskin dress. Her legs are slender, and her tiny bare feet wear nothing. Her face is tanned and ruddy, with a full mouth and dark eyes. She is friendly to Roddie when she guesses he is lost from the boat. Ida is brilliant as she figures out Roddie’s identity after his interaction with an android and his familiarity with the surrounding areas and baby food. She is also brave as she suppresses her fear and manages her way to escape from Roddie after knowing his intention to catch her. She is dedicated as her purpose in ruins is to help her fellows in every way possible. Roddie sees her as purposeless and impulsive. She is weaker than Roddie. She is nervous and scared when they walk towards the bridge, being furtive and close behind Roddie. She is emotional, and she considers it a good thing because she is angry at Roddie’s claim of the superiority of being rational."
              },
              {
                "worker_id": "111",
                "uid": "b394c82fc81648c183f71bdf6fa3b756",
                "response_text": "Ida is a girl that traversed illegally into San Francisco in order to help men get supplies and fight the robots that patrolled the city. Women weren’t allowed to go into the city, so she snuck into one of the boats in order to help the wounded men who were fighting. She is described as small and thin, but that allows her to be quick and agile. When Ida meets Roddie, she wants to bring him back to the humans so he can learn where he comes from, and that he doesn’t belong with the robots. She is very brave, because she wasn’t afraid of being killed by Roddie or the robots. "
              },
              {
                "worker_id": "113",
                "uid": "b86ec5af04f94109855a29fa768bb6d3",
                "response_text": "Ida is a young girl, one of the Invaders living outside the city. The fact that she followed Roddie’s footprints and found his hideout seems to indicate her intelligence. She is brave and compassionate - Ida was ready to secretly leave her safe community and come to the city to help the wounded. She is emotional: we see that when she unexpectedly kisses Roddie or when she starts crying at the end. Ida also has a strong sense of justice - she considers returning the city to men a necessity, she thinks San Francisco belongs to them. Ida also doesn’t seem to like violence or destructive behavior - this is what she says to Roddie at the end. \n"
              }
            ]
          },
          {
            "question_text": "What is the relationship between Roddie and Ida?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "109",
                "uid": "009af7d819474772adbfce8e44e0f3bc",
                "response_text": "Although Roddie has been preparing his entire life for defense against something, someone, he never knows who his enemy is. Ida - by nature of being Man - is his enemy, as Roddie believes him to be an android. When they first meet in the darkness, Roddie is afraid that Ida may realize what he is. However, they have no trouble once they see each other and spend the entire day together. Roddie proudly takes the role of Ida’s caretaker, noting that she is scared of the soldiers and not as strong as he is, so he takes her to a supermarket and feeds her. \n\nHowever, when Roddie reveals the talisman that prevented the soldier from attacking, their relationship changes. Ida tries to take Roddie back to her boat where she proclaims he belongs and Roddie insists that he belongs in this android-ridden dystopia. In their chase, they end up atop a tower. Realizing Ida now has the knowledge to bring home to the Invaders on how to enter the city, Roddie feels a sense of duty to kill her. She is the enemy, as he thinks she wishes to harm his city. As Ida cries - something Roddie can do but his friends can’t - he realizes that he too is Man and decides not to kill her.  \n"
              },
              {
                "worker_id": "112",
                "uid": "931fb996928c476ca6e0783fc2e63a63",
                "response_text": "Roddie and Ida meet in the manhole, usually Roddie’s hiding place. Roddie learns information about Invaders and the relationship between Invaders and the androids. He also realizes the similarities between him and Ida, compared to his differences from the androids. When they walk towards the bridge, their relationship is the protector and the protected. It is the teacher-student relationship when Roddie learns many new and inexperienced things from Ida throughout the conversation. The hunting-hunted relationship is when Roddie tries to grab and kill Ida, and Ida escapes to the bridge. They have to support each other on the bridge cable as they can barely maintain their strength through climbing, where their relationship is supportive. But after they arrive and sleep in the tower, Roddie regains his energy and tries to kill Ida again. Their relationship becomes hostile again. When Ida finally convinces Roddie that he is also a man, they become mutually supportive."
              },
              {
                "worker_id": "111",
                "uid": "b394c82fc81648c183f71bdf6fa3b756",
                "response_text": "The relationship between them is tense. Roddie wants to kill Ida because he believes that she is an invader, and he wants to prove to the robots that he can fight alongside them. Ida, on the other hand, wants to help Roddie and take him back to the humans, because it is where he belongs. They both learn a lot from each other, as Roddie had never seen an “invader” and Ida was in San Francisco for the first time, so she thought that only robots lived in the city. The relationship between them is tense and violent as Roddie chases her up the bridge. Then, they seem to become friends, and Roddie ends up not killing her. "
              },
              {
                "worker_id": "113",
                "uid": "b86ec5af04f94109855a29fa768bb6d3",
                "response_text": "At the beginning, Roddie is apprehensive and uncomfortable because he has never seen another human being. Soon, Ida makes him feel better by chatting with him. Roddie, who thinks that he is a peculiar type of robot, realizes that she thinks that he is a human, like her. She makes fun of him and seems to be comfortable with Roddie. When he shows her his watch, she becomes tense, and Roddie realizes that she knows who he is. She tries to take the young man with her to other people, but he attacks her instead. Both stubborn, they spend hours climbing the suspension cable and then sleep in the tower, too tired to keep up the altercation. At the end, Ida is crying and explaining to Roddie why he is not a robot. He doesn’t want to accept it, but Ida’s crying expression and an emotional monologue keep him from killing her. He seems to accept his identity the next morning.\n"
              }
            ]
          },
          {
            "question_text": "How does Roddie use his tools (screwdriver and hammer) throughout the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "109",
                "uid": "009af7d819474772adbfce8e44e0f3bc",
                "response_text": "The first tool that Roddie uses is a screwdriver with a broken handle. He uses it to tinker with and screw Molly’s head back onto her robot body, after tearing it off himself. He also used it when he was considering heating it over a fire to mold it into a different tool, but ended up not completing it. \n\nHis hammer is his weapon. Roddie keeps his hammer on his body, which he was able to reach for conveniently when he initially found a warm body hiding in the manhole. All throughout this initial encounter with Ida, Roddie has his hammer close to him, either clutching it or holding it in his mouth while climbing the ladder. He also uses it as a tool to break open cans. Finally, at the end of the story, he is prepared to use the hammer to kill Ida - even going as far as raising it threateningly - before deciding not to. \n"
              },
              {
                "worker_id": "112",
                "uid": "931fb996928c476ca6e0783fc2e63a63",
                "response_text": "Roddie uses the screwdriver to repair the androids when the soldier ones come back with damages. After ripping her head off her neck, he also uses it to repair Molly, a nursing android. Roddie uses the hammer as a weapon to protect himself whenever he feels there is danger nearby. During his conversation with Ida, he holds the hammer in hand all the time so that he can attack at any time needed. He also uses the hammer to open the canned baby food that he finds in the ruined supermarket. He tries to use the hammer to kill Ida after they arrive at the tower across the bridge, but he doesn’t."
              },
              {
                "worker_id": "111",
                "uid": "b394c82fc81648c183f71bdf6fa3b756",
                "response_text": "Throughout the story, Roddie has to use his tools in different ways. At the beginning, he has to use his screwdriver in order to fix Molly and the other robots that reached his building. When Molly malfunctions, Roddie tries to fix her using the screwdriver. He also uses the screwdriver to fix some robots that were badly damaged after fighting with some invaders. Roddie also uses the hammer, but he uses it as a weapon. When he encounters Ida, he wants to kill her using the hammer, and the same thing happens on the bridge."
              },
              {
                "worker_id": "113",
                "uid": "b86ec5af04f94109855a29fa768bb6d3",
                "response_text": "Roddie uses his screwdriver when dealing with the mechanical parts of the robots. When one of the soldiers collapses, Roddie combines his metal limbs with the other ones he has, using the screwdriver. A hammer is a fighting tool for Roddie. He has it in his hand when he senses someone else’s presence in his hideout. Roddie tries to attack Ida near the bridge and kill her near the tower at the very end with his hammer but changes his mind. He also uses it to get baby food at the supermarket. "
              }
            ]
          },
          {
            "question_text": "How does Roddie figure out why he's different from his friends?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "109",
                "uid": "009af7d819474772adbfce8e44e0f3bc",
                "response_text": "Put simply, Roddie is Man and his friends in the story are androids. Despite growing up with them and having been brought up by Molly, Roddie is human. One clear difference is the fact that Roddie is able to tear off the limbs of his friends and repair it back together. For example, he tore off Molly’s head when her “spells” became worse, and then later tinkered it back on her head. Another example of this difference is when Ida begins to cry at the end of the story, and Roddie internally expresses that the first time he wept was the first time he noted a difference between him and his android friends, who presumably cannot emote in the same way. Similarly, they do not know pain nor fatigue, so Roddie pretends he doesn’t either. At the very end of the story, he finally accepts that he is Man. \n"
              },
              {
                "worker_id": "112",
                "uid": "931fb996928c476ca6e0783fc2e63a63",
                "response_text": "Roddie knows that he is weaker than Molly, his nursing android, and other soldiers as he has all the sensations, such as coldness, hunger, pain, and thirst, while they don’t. The growth he has been undergoing until recently is also a sign that he is different from his friends, the soldier androids in the city. His yearning to sleep amid the danger makes him think that he was built by an apprentice when he still believes he is one of the androids. He learns from Ida, a girl he meets in his hiding place, that all the androids are heat-sensitive to locate them in the dark. He also realizes the similarities between Ida and him when Ida is supposed to be the Invader. After going through all the obstacles with Ida to cross the bridge and feeling his weakness on the cable, he realizes the differences between his friends and him again. Recalling his memory of weeping after seeing Ida weep when she tries to convince him that he is a man, not an android,  Roddie finally acknowledges himself as a man different from his friends."
              },
              {
                "worker_id": "111",
                "uid": "b394c82fc81648c183f71bdf6fa3b756",
                "response_text": "Roddie always knew that he was different from the robots which he lived with. He didn’t have the same build, or the same gears and cables as them. Roddie always wanted to prove that he was the same, and that he could help them fight. When he meets Ida, who is very similar to him, he starts to doubt where he belongs. Ida helps him understand that he is in fact human, and not a robot. He learns that he belongs with the other humans outside the city, and not with the robots. "
              },
              {
                "worker_id": "113",
                "uid": "b86ec5af04f94109855a29fa768bb6d3",
                "response_text": "\nThroughout the story, Roddie ponders the question of identity: he is different from Molly and the soldiers. Roddie can feel pain, he can be hot and cold, exhausted, hungry, or sleepy. While growing up, Roddie knew that the robots surrounding him did not have the same experience. He cried when he realized that he was different. This emotion also made him unique. After meeting Ida, he slowly analyzes her behavioral traits and sees how similar they are. She says that he is a human being, not a robot. He believes rationality creates the superior. But Roddie knows he’s not a completely rational creature - he has feelings, too. Roddie spends enough time with her to finally accept that he is a man, not a soldier. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4854,
        "document_length_chars": 28073
      }
    }
  ]
}