{
  "item_metadata": {
    "item_id": "51249",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51249",
      "content": "Spacemen Die at Home\n \n \n By EDWARD W. LUDWIG\n \n Illustrated by THORNE\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction October 1951. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n One man's retreat is another's prison ... and it takes a heap of flying to make a hulk a home!\n \n\n \n Forty days of heaven and forty nights of hell. That's the way it's been, Laura. But how can I make you understand? How can I tell you what it's like to be young and a man and to dream of reaching the stars? And yet, at the same time, to be filled with a terrible, gnawing fear—a fear locked in my mind during the day and bursting out like an evil jack-in-the-box at night. I must tell you, Laura.\n \n Perhaps if I start at the beginning, the very beginning....\n \n It was the Big Day. All the examinations, the physicals and psychos, were over. The Academy, with its great halls and classrooms and laboratories, lay hollow and silent, an exhausted thing at sleep after spawning its first-born.\n \n For it was June in this year of 1995, and we were the graduating class of the U. S. Academy of Interplanetary Flight.\n \n The first graduating class, Laura. That's why it was so important, because we were the first .\n \n We sat on a little platform, twenty-five of us. Below us was a beach of faces, most of them strange, shining like pebbles in the warm New Mexican sunlight. They were the faces of mothers and fathers and grandparents and kid brothers and sisters—the people who a short time ago had been only scrawled names on letters from home or words spoken wistfully at Christmas. They were the memory-people who, to me, had never really existed.\n \n But today they had become real, and they were here and looking at us with pride in their eyes.\n \n A voice was speaking, deep, sure, resonant. \"... these boys have worked hard for six years, and now they're going to do a lot of big things. They're going to bring us the metals and minerals that we desperately need. They're going to find new land for our colonists, good rich land that will bear food and be a home for our children. And perhaps most important of all, they'll make other men think of the stars and look up at them and feel humility—for mankind needs humility.\"\n \n The speaker was Robert Chandler, who'd brought the first rocket down on Mars just five years ago, who'd established the first colony there, and who had just returned from his second hop to Venus.\n \n Instead of listening to his words, I was staring at his broad shoulders and his dark, crew-cut hair and his white uniform which was silk-smooth and skin-tight. I was worshiping him and hating him at the same time, for I was thinking:\n  He's already reached Mars and Venus. Let him leave Jupiter and the others alone! Let us be the first to land somewhere! Let us be the first!\n \n \n \n\n \n Mickey Cameron, sitting next to me, dug an elbow into my ribs. \"I don't see 'em, Ben,\" he whispered. \"Where do you suppose they are?\"\n \n I blinked. \"Who?\"\n \n \"My folks.\"\n \n That was something I didn't have to worry about. My parents had died in a strato-jet crash when I was four, so I hadn't needed many of those\n\"You are cordially invited\" cards. Just one, which I'd sent to Charlie Taggart.\n \n Stardust Charlie, we called him, although I never knew why. He was a veteran of Everson's first trip to the Moon nearly twenty-five years ago, and he was still at it. He was Chief Jetman now on the Lunar Lady , a commercial ore ship on a shuttle between Luna City and White Sands.\n \n I remembered how, as a kid, I'd pestered him in the Long Island Spaceport, tagging after him like a puppy, and how he'd grown to like me until he became father, mother, and buddy all in one to me. And I remembered, too, how his recommendation had finally made me a cadet.\n \n My gaze wandered over the faces, but I couldn't find Charlie's. It wasn't surprising. The Lunar Lady was in White Sands now, but liberties, as Charlie said, were as scarce as water on Mars.\n  It doesn't matter , I told myself.\n \n Then Mickey stiffened. \"I see 'em, Ben! There in the fifth row!\"\n \n Usually Mickey was the same whether in a furnace-hot engine room or a garden party, smiling, accepting whatever the world offered. But now a tenseness and an excitement had gripped even him. I was grateful that he was beside me; we'd been a good team during those final months at the Academy and I knew we'd be a good team in space. The Universe was mighty big, but with two of us to face it together, it would be only half as big.\n \n And then it seemed that all the proud faces were looking at us as if we were gods. A shiver went through my body. Though it was daytime, I saw the stars in my mind's vision, the great shining balls of silver, each like a voice crying out and pleading to be explored, to be touched by the sons of Earth.\n  They expect a lot from us. They expect us to make a new kind of civilization and a better place out of Earth. They expect all this and a hell of a lot more. They think there's nothing we can't do.\n \n \n I felt very small and very humble. I was scared. Damned scared.\n \n \n\n \n At last it was over, and the proud faces descended upon us in a huge, babbling wave.\n \n Then I saw him. Good old Stardust Charlie.\n \n His wizened little body was shuffling down an aisle, his eyes shining like a child's. He'd been sandwiched, evidently, in one of the rear rows.\n \n But he wasn't the Charlie I'd seen a year ago. He'd become gaunt and old, and he walked with an unnatural stiffness. He looked so old that it was hard to believe he'd once been young.\n \n He scratched his mop of steel-gray hair and grinned.\n \n \"You made it, boy,\" he chortled, \"and by Jupiter, we'll celebrate tonight. Yes, siree, I got twenty-four hours, and we'll celebrate as good spacemen should!\"\n \n Then Mickey strode up to us. He was his normal, boyish self again, walking lightly, his blond, curly-haired skull swaying as if in rhythm with some silent melody.\n \n And you, Laura, were with him.\n \n \"Meet the Brat,\" he said. \"My sister Laura.\"\n \n I stared almost rudely. You were like a doll lost in the immensity of your fluffy pink dress. Your hair was long and transformed into a golden froth where sunlight touched it. But your eyes were the eyes of a woman, glowing like dark stars and reflecting a softness, a gentleness that I'd never seen in eyes before.\n \n \"I'm happy to meet you, Ben,\" you said. \"I've heard of no one else for the past year.\"\n \n A tide of heat crept up from my collar. I stuttered through an introduction of Charlie.\n \n You and Mickey looked strangely at Charlie, and I realized that old Stardust was not a cadet's notion of the ideal spaceman. Charlie scorned the skin-tight uniforms of the government service and wore a shiny black suit that was a relic of Everson's early-day Moon Patrol. His tie was clumsily knotted, and a button on his coat was missing.\n \n And the left side of his face was streaked with dark scar tissue, the result of an atomic blowup on one of the old Moon ships. I was so accustomed to the scars, I was seldom aware of them; but others, I knew, would find them ugly.\n \n You were kind. You shook hands and said, softly: \"It's a privilege to meet you, Charlie. Just think—one of Everson's men, one of the first to reach the Moon!\"\n \n Charlie gulped helplessly, and Mickey said: \"Still going to spend the weekend with us, aren't you, Ben?\"\n \n I shook my head. \"Charlie has only twenty-four hours liberty. We're planning to see the town tonight.\"\n \n \"Why don't you both come with us?\" you asked. \"Our folks have their own plane, so it would be no problem. And we've got a big guest room. Charlie, wouldn't you like a home-cooked meal before going back to the Moon?\"\n \n Charlie's answer was obscured by a sudden burst of coughing. I knew that he'd infinitely prefer to spend his liberty sampling Martian fizzes and Plutonian zombies.\n \n But this night seemed too sacred for Charlie's kind of celebration.\n \n \"We'd really like to come,\" I said.\n \n \n\n \n On our way to the 'copter parking field, Dean Dawson passed us. He was a tall, willowy man, spectacled, looking the way an academy professor should look.\n \n \"Ben,\" he called, \"don't forget that offer. Remember you've got two months to decide.\"\n \n \"No, thanks,\" I answered. \"Better not count on me.\"\n \n A moment later Mickey said, frowning, \"What was he talking about, Ben? Did he make you an offer?\"\n \n I laughed. \"He offered me a job here at the Academy teaching astrogation. What a life that would be! Imagine standing in a classroom for forty years when I've got the chance to—\"\n \n I hesitated, and you supplied the right words: \"When you've got the chance to be the first to reach a new planet. That's what most of you want, isn't it? That's what Mickey used to want.\"\n \n I looked at you as if you were Everson himself, because you seemed to understand the hunger that could lie in a man's heart.\n \n Then your last words came back and jabbed me: \"That's what Mickey used to want.\"\n \n \" Used to want?\" I asked. \"What do you mean?\"\n \n You bit your lip, not answering.\n \n \"What did she mean, Mickey?\"\n \n Mickey looked down at his feet. \"I didn't want to tell you yet, Ben. We've been together a long time, planning to be on a rocket. But—\"\n \n \"Yes?\"\n \n \"Well, what does it add up to? You become a spaceman and wear a pretty uniform. You wade through the sands of Mars and the dust of Venus. If you're lucky, you're good for five, maybe ten years. Then one thing or another gets you. They don't insure rocketmen, you know.\"\n \n My stomach was full of churning, biting ice. \"What are you trying to say, Mickey?\"\n \n \"I've thought about it a long time. They want me for Cargo Supervisor of White Sands Port.\" He raised his hand to stop me. \"I know. It's not so exciting. I'll just live a lot longer. I'm sorry, Ben.\"\n \n I couldn't answer. It was as if someone had whacked the back of my knees with the blast of a jet.\n \n \"It doesn't change anything, Ben—right now, I mean. We can still have a good weekend.\"\n \n Charlie was muttering under his breath, smoldering like a bomb about to reach critical mass. I shook my head dazedly at him as we got to the\n'copter.\n \n \"Sure,\" I said to Mickey, \"we can still have a good weekend.\"\n \n \n\n \n I liked your folks, Laura. There was no star-hunger in them, of course. They were simple and solid and settled, like green growing things, deep-rooted, belonging to Earth. They were content with a home that was cool on this warm summer night, with a 'copter and a tri-dimensional video, and a handsome automatic home that needed no servants or housework.\n \n Stardust Charlie was as comfortable as a Martian sand-monkey in a shower, but he tried courageously to be himself.\n \n At the dinner table he stared glassily at nothing and grated, \"Only hit Mars once, but I'll never forget the kid who called himself a medic. Skipper started coughing, kept it up for three days. Whoopin' cough, the medic says, not knowin' the air had chemicals that turned to acid in your lungs. I'd never been to Mars before, but I knew better'n that. Hell, I says, that ain't whoopin' cough, that's lung-rot.\"\n \n That was when your father said he wasn't so hungry after all.\n \n Afterward, you and I walked onto the terrace, into the moonlit night, to watch for crimson-tailed continental rockets that occasionally streaked up from White Sands.\n \n We gazed for a few seconds up into the dark sky, and then you said:\n\"Charlie is funny, isn't he? He's nice and I'm glad he's here, but he's sort of funny.\"\n \n \"He's an old-time spaceman. You didn't need much education in those days, just a lot of brawn and a quick mind. It took guts to be a spaceman then.\"\n \n \"But he wasn't always a spaceman. Didn't he ever have a family?\"\n \n I smiled and shook my head. \"If he had, he never mentioned it. Charlie doesn't like to be sentimental, at least not on the outside. As far as I know, his life began when he took off for the Moon with Everson.\"\n \n You stared at me strangely, almost in a sacred kind of way. I knew suddenly that you liked me, and my heart began to beat faster.\n \n There was silence.\n \n You were lovely, your soft hair like strands of gold, and there were flecks of silver in your dark eyes. Somehow I was afraid. I had the feeling that I shouldn't have come here.\n \n You kept looking at me until I had to ask: \"What are you thinking, Laura?\"\n \n You laughed, but it was a sad, fearful laugh. \"No, I shouldn't be thinking it. You'd hate me if I told you, and I wouldn't want that.\"\n \n \"I could never hate you.\"\n \n \"It—it's about the stars,\" you said very softly. \"I understand why you want to go to them. Mickey and I used to dream about them when we were kids. Of course I was a girl, so it was just a game to me. But once I dreamed of going to England. Oh, it was going to be so wonderful. I lived for months, just thinking about it.\n \n \"One summer we went. I had fun. I saw the old buildings and castles, and the spaceports and the Channel Tube. But after it was over, I realized England wasn't so different from America. Places seem exciting before you get to them, and afterward they're not really.\"\n \n I frowned. \"And you mean it might be the same with the stars? You think maybe I haven't grown up yet?\"\n \n Anxiety darkened your features. \"No, it'd be good to be a spaceman, to see the strange places and make history. But is it worth it? Is it worth the things you'd have to give up?\"\n \n I didn't understand at first, and I wanted to ask, \"Give up what ?\"\n \n Then I looked at you and the promise in your eyes, and I knew.\n \n All through the years I'd been walking down a single, narrow path.\n \n Government boarding school, the Academy, my eyes always upward and on the stars.\n \n Now I'd stumbled into a cross-roads, beholding a strange new path that I'd never noticed before.\n  You can go into space , I thought, and try to do as much living in ten years as normal men do in fifty. You can be like Everson, who died in a Moon crash at the age of 36, or like a thousand others who lie buried in Martian sand and Venusian dust. Or, if you're lucky, like Charlie—a kind of human meteor streaking through space, eternally alone, never finding a home.\n \n  Or there's the other path. To stay on this little prison of an Earth in cool, comfortable houses. To be one of the solid, rooted people with a wife and kids. To be one of the people who live long enough to grow old, who awake to the song of birds instead of rocket grumblings, who fill their lungs with the clean rich air of Earth instead of poisonous dust.\n \n \n \"I'm sorry,\" you said. \"I didn't mean to make you sad, Ben.\"\n \n \"It's all right,\" I said, clenching my fists. \"You made sense—a lot of sense.\"\n \n \n\n \n The next morning Charlie said good-bye in our room. He rubbed his scarred face nervously as he cleared his throat with a series of thin, tight coughs.\n \n Then he pointed to a brown, faded tin box lying on the bed. \"I'm leavin' that for you. It's full of old stuff, souvenirs mostly. Thought maybe you'd like to have 'em.\"\n \n I scowled, not understanding. \"Why, Charlie? What for?\"\n \n He shrugged as if afraid he might be accused of sentimentality. \"Oh, it's just that I've been dodgin' meteors now for twenty-five years. That's a long time, boy. Ain't one spaceman in a thousand that lucky. Some of these days, I won't be so lucky.\"\n \n I tried to laugh. \"You're good for another twenty-five years, Charlie.\"\n \n He shook his head stiffly, staring at nothing. \"Maybe. Anyway, I'm gonna get off the Shuttle this time, make one more trip to Mars. Tell you what. There's a little stone cafe on Mars, the Space Rat , just off Chandler Field on the Grand Canal. When you get to Mars, take a look inside. I'll probably be there.\"\n \n He coughed again, a deep, rasping cough that filled his eyes with tears.\n \n \"Not used to this Earth air,\" he muttered. \"What I need's some Martian climate.\"\n \n Suddenly that cough frightened me. It didn't seem normal. I wondered, too, about his stiff movements and glassy stare. It was as if he were drugged.\n \n I shook the thought away. If Charlie was sick, he wouldn't talk about going to Mars. The medics wouldn't let him go even as far as Luna.\n \n We watched him leave, you and Mickey and I.\n \n \"When will you be back?\" you asked.\n \n Charlie's hard face contorted itself into a gargoylish grin. \"Maybe a couple of months, maybe a couple of years. You know spacemen.\"\n \n Then he waved and strode away, a strange, gray, withered gnome of a man.\n \n I wanted him to say something, to tell me the secret that would kill the doubt worming through my brain.\n \n But he rounded a corner, still grinning and waving, and then he was gone.\n \n \n\n \n That afternoon Mickey showed me his room. It was more like a boy's room than a spaceman's. In it were all the little things that kids treasure—pennants, models of Everson's two ships, a tennis trophy, books, a home-made video.\n \n I began to realize how important a room like this could be to a boy. I could imagine, too, the happiness that parents felt as they watched their children grow to adulthood.\n \n I'd missed something. My folks were shadow-people, my impressions of them drawn half from ancient photos, half from imagination. For me, it had been a cold, automatic kind of life, the life of dormitories and routines and rules. I'd been so blinded by the brilliancy of my dreams, I hadn't realized I was different.\n  My folks were killed in a rocket crash. If it weren't for rockets, I'd have lived the kind of life a kid should live.\n \n \n Mickey noticed my frown.\n \n \"What's the matter, Ben? Still sore? I feel like a heel, but I'm just not like you and Charlie, I guess. I—\"\n \n \"No, I understand, Mickey. I'm not sore, really.\"\n \n \"Listen, then. You haven't accepted any offer yet, have you?\"\n \n \"No. I got a couple of possibilities. Could get a berth on the Odyssey , the new ship being finished at Los Angeles. They want me, too, for the Moon Patrol, but that's old stuff, not much better than teaching. I want to be in deep space.\"\n \n \"Well, how about staying with us till you decide? Might as well enjoy Earth life while you can. Okay?\"\n \n I felt like running from the house, to forget that it existed. I wanted someone to tell me one of the old stories about space, a tale of courage that would put fuel on dying dreams.\n \n But I wanted, also, to be with you, Laura, to see your smile and the flecks of silver in your eyes and the way your nose turned upward ever so slightly when you laughed. You see, I loved you already, almost as much as I loved the stars.\n \n And I said, slowly, my voice sounding unfamiliar and far away, \"Sure, I'll stay, Mickey. Sure.\"\n \n \n\n \n Forty days of joy, forty nights of fear and indecision. We did all the little things, like watching the rockets land at White Sands and flying down to the Gulf to swim in cool waters. You tried, unsuccessfully, to teach me to dance, and we talked about Everson and Charlie and the Moon and the stars. You felt you had to give the stars all the beauty and promise of a child's dream, because you knew that was what I wanted.\n \n One morning I thought, Why must I make a choice? Why can't I have both you and the stars? Would that be asking too much?\n \n \n All day the thought lay in my mind like fire.\n \n That evening I asked you to marry me. I said it very simply: \"Laura, I want you to be my wife.\"\n \n You looked up at Venus, and you were silent for a long while, your face flushed.\n \n Then you murmured, \"I—I want to marry you, Ben, but are you asking me to marry a spaceman or a teacher?\"\n \n \"Can't a spaceman marry, too?\"\n \n \"Yes, a spaceman can marry, but what would it be like? Don't you see, Ben? You'd be like Charlie. Gone for maybe two months, maybe two years. Then you'd have a twenty-four hour liberty—and I'd have what?\"\n \n Somehow I'd expected words like these, but still they hurt. \"I wouldn't have to be a spaceman forever. I could try it for a couple of years, then teach.\"\n \n \"Would you, Ben? Would you be satisfied with just seeing Mars? Wouldn't you want to go on to Jupiter and Saturn and Uranus and on and on?\"\n \n Your voice was choked, and even in the semi-darkness I saw tears glittering in your eyes.\n \n \"Do you think I'd dare have children, Ben? Mickey told me what happened on the Cyclops . There was a leak in the atomic engines. The ship was flooded with radiation—just for a second. It didn't seem serious. The men had no burns. But a year later the captain had a child. And it was—\"\n \n \"I know, Laura. Don't say it.\"\n \n You had to finish. \"It was a monster.\"\n \n That night I lay awake, the fears and doubts too frantic to let me sleep.\n  You've got to decide now , I told myself. You can't stay here. You've got to make a choice.\n \n \n The teaching job was still open. The spot on the Odyssey was still open—and the big ship, it was rumored, was equipped to make it all the way to Pluto.\n  You can take Dean Dawson's job and stay with Laura and have kids and a home and live to see what happens in this world sixty years from now.\n \n  Or you can see what's on the other side of the mountain. You can be a line in a history book.\n \n \n I cursed. I knew what Charlie would say. He'd say, \"Get the hell out of there, boy. Don't let a fool woman make a sucker out of you. Get out there on the Odyssey where you belong. We got a date on Mars, remember? At the Space Rat , just off Chandler Field on the Grand Canal.\"\n \n That's what he'd say.\n \n And yet I wanted you, Laura. I wanted to be with you, always.\n \n \"Oh God,\" I moaned, \"what shall I do?\"\n \n \n\n \n Next morning the door chimes pealed, and you went to the door and brought back the audiogram. It was addressed to me; I wondered who could be sending me a message.\n \n I pressed the stud on the little gray cylinder, and a rasping, automatic voice droned: \"Luna City, Luna, July 27, 1995. Regret to inform you of death of Charles Taggart, Chief Jetman....\"\n \n Then there was a Latin name which was more polite than the word\n\"lung-rot\" and the metallic phrase, \"This message brought to you by courtesy of United Nations Earth-Luna Communication Corps.\"\n \n I stood staring at the cylinder.\n \n Charles Taggart was dead.\n \n Charles Taggart was Charlie. Stardust Charlie.\n \n My heart thudded crazily against my chest. It couldn't be! Not Charlie! The audiogram had lied!\n \n I pressed the stud again. \"... regret to inform you of death of Charles ...\"\n \n I hurled the cylinder at the wall. It thudded, fell, rolled. The broken voice droned on.\n \n You ran to it, shut it off. \"I'm sorry, Ben, so terribly—\"\n \n Without answering, I walked into my room. I knew it was true now. I remembered Charlie's coughing, his gaunt features, his drugged gaze. The metallic words had told the truth.\n \n I sat for a long time on my bed, crying inside, but staring dry-eyed at Charlie's faded tin box.\n \n Then, finally, I fingered his meager possessions—a few wrinkled photos, some letters, a small black statue of a forgotten Martian god, a gold service medal from the Moon Patrol.\n \n \n\n \n This was what remained of Charlie after twenty-five years in space. It was a bitter bargain. A statue instead of a wife, yellowed letters instead of children, a medal instead of a home.\n  It'd be a great future , I thought. You'd dream of sitting in a dingy stone dive on the Grand Canal with sand-wasps buzzing around smoky, stinking candles. A bottle of luchu juice and a couple of Martian girls with dirty feet for company. And a sudden cough that would be the first sign of lung-rot.\n \n \n To hell with it!\n \n I walked into your living room and called Dean Dawson on the visiphone.\n \n I accepted that job teaching.\n \n \n\n \n And now, Laura, it's nearly midnight. You're in your room, sleeping, and the house is silent.\n \n It's hard to tell you, to make you understand, and that is why I am writing this.\n \n I looked through Charlie's box again, more carefully this time, reading the old letters and studying the photographs. I believe now that Charlie sensed my indecision, that he left these things so that they could tell me what he could not express in words.\n \n And among the things, Laura, I found a ring.\n \n A wedding ring.\n \n In that past he never talked about, there was a woman—his wife. Charlie was young once, his eyes full of dreams, and he faced the same decision that I am facing. Two paths were before him, but he tried to travel both. He later learned what we already know—that there can be no compromise. And you know, too, which path he finally chose.\n \n Do you know why he had to drug himself to watch me graduate? So he could look at me, knowing that I would see the worlds he could never live to see. Charlie didn't leave just a few trinkets behind him. He left himself, Laura, for he showed me that a boy's dream can also be a man's dream.\n \n He made his last trip to Luna when he knew he was going to die. Heaven knows how he escaped a checkup. Maybe the captain understood and was kind—but that doesn't matter now.\n \n Do you know why he wanted to reach Mars? Do you know why he didn't want to die in the clean, cool air of Earth?\n \n It was because he wanted to die nearer home. His home, Laura, was the Universe, where the ship was his house, the crew his father, mother, brothers, the planets his children.\n \n You say that the beauty of the other side of the mountain vanishes after you reach it. But how can one ever be sure until the journey is made? Could I or Charlie or the thousand before us bear to look upon a star and think, I might have gone there; I could have been the first ?\n \n We said, too, that the life of a spaceman is lonely. Yet how could one be lonely when men like Charlie roam the spaceways?\n \n Charlie wanted me to himself that night after graduation. He wanted us to celebrate as spacemen should, for he knew that this would be his last night on Earth. It might have seemed an ugly kind of celebration to you, but he wanted it with all his heart, and we robbed him of it.\n \n Because of these things, Laura, I will be gone in the morning. Explain the best you can to Mickey and to your parents and Dean Dawson.\n \n Right now I've got a date that I'm going to keep—at a dingy stone cafe on Mars, the Space Rat , just off Chandler Field on the Grand Canal.\n \n Stardust Charlie will be there; he'll go with me in memory to whatever part of the Galaxy I may live to reach. And so will you, Laura.\n \n I have two wedding rings with me—his wife's ring and yours.",
      "metadata": {
        "title": "Spacemen Die at Home",
        "author": "Edward W. Ludwig",
        "passage_id": "51249",
        "uid": "b7171edacda943a3b5671b0da2e8a0ba",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "1",
                "uid": "85e20d36291f4c3eb3be04fdbf2fdf4b",
                "response_text": "After studying for six years, Ben sits at his U.S. Academy of Interplanetary Flight graduation. Next to Ben is Mickey, his best friend who also plans to go into deep space. Ben is an orphan, and he wonders if the only person he invited, Charlie Taggart, is there. Ben met Charlie, an accomplished spaceman, when he was a boy, and Charlie took him under his wing. When Ben connects with Charlie after the ceremony, he worries about his gaunt face and terrible cough. \n\nBen then meets Laura, Mickey’s sister. There is an undeniable and instant connection between them. Charlie only has 24 hours to spend with Ben before he has to report back for duty, and although he wants to have some drinks with Ben alone, Laura invites them both over, and Ben can’t help but say yes.\n\nMoments later, Dean Dawson reminds Ben about an offer to teach at the Academy. Mickey takes this opportunity to admit to Ben that he will be working as a Supervisor at White Sands Port. Ben is disappointed to hear that Mickey has chosen to live a boring life, but Mickey insists that he does not want to die in his 30s. \n\nAfter dinner at Mickey’s house, Laura and Ben take a walk together. Laura asks about Charlie’s life before he was a spaceman, but Ben doesn’t have answers for her. He doesn’t know anything about Charlie’s past. Ben looks at Laura and realizes that she has feelings for him, too. When she suggests that a career in deep space may not be worth what Ben would be leaving behind, Ben finds himself at a crossroads. Should he live his dream  or should he settle down with the woman he loves and live an ordinary life?\n\nThe next morning, Charlie gives Ben an old tin with souvenirs inside, and then tells him to meet him at the Space Rat, a little cafe on Mars, when he gets there. Ben still hasn’t chosen a career path and decides to stay with Mickey and Laura and their family until he does. He experiences forty days of happiness with his love, Laura, and forty nights of indecision about which career to choose. Ben asks Laura to marry him, but she says she can’t unless he decides to stay on earth. \n\nThe next day, Ben receives a message informing him that Charlie has died from lung-rot, a disease he got in space. When Ben looks in Charlie’s tin and finds useless trinkets, he decides  to take the teaching job so that he does not live a similarly meaningless life. However, hours later, he looks in the tin again and finds a wedding ring. Ben surmises that Charlie wanted to tell him to take the chance on space, and he believes it’s the right decision to make. He can’t live his life without knowing what the stars look like, even if that means he can’t have Laura too. \n"
              },
              {
                "worker_id": "6",
                "uid": "135f12f8d4f047789db372879fa69d6c",
                "response_text": "Spacemen Die at Home is a story in the form of a letter written from Ben to Laura, explaining his decision to leave her behind on Earth. It all begins in June of 1965 in New Mexico when the first class of the U.S. Academy of Interplentary Flight is finally graduating after six years. These 25 students were trained to take on interplanetary flight and space exploration, so they can continue to discover the outer planets. Robert Chandler gave a speech detailing why these brave men were so important to modern society, as women were not allowed to become space explorers. Mickey and Ben, graduates and friends, sat next to each other during the ceremony. Mickey struggles to find his family in the crowd, and Ben reveals that he was orphaned after his parents died in a rocket crash. A spaceman named Charlie Taggart (Stardust Charlie) raised him instead. He was one of the oldest spacemen ever, having travelled for nearly 25 years, and was the Chief Jetman on the Lunar Lady. \nAfter the ceremony, Ben runs into Charlie and sees how much he’s aged in just a year. He looks ill and drugged, but he still asks Ben to celebrate with him. Before Ben can respond, Mickey and his sister Laura came up to him. He is instantly attracted to her and feels a connection. Ben was supposed to spend the weekend with Mickey and his family, but now that Charlie’s in town he feels conflicted. Both Ben and Charlie decide to join them, despite Charlie not being a family man. Dean Dawson, an academy professor, approaches Ben and reminds him of his job offer at the Academy. Ben turns him down laughing, until Mickey reveals that he is not going to space anymore. Instead, he’ll be the Cargo Supervisor of White Sands Sport. After an awkward dinner together, Laura and Ben went stargazing and spoke of Charlie and the draw of space. Laura hints at loving Ben, but doesn’t say it outright. Charlie left the next day, but left Ben some of his possessions. He knows he hasn’t got much time in this universe, but he goes back to Mars anyways. \nWith several job options to choose from, Ben decides to stay at Mickey’s house for the timebeing. He stays for 40 days and nights, spending much of his time with Laura. He asked Laura to marry him, but she says she’d only marry him if he were a teacher, not a spaceman. Ben was faced with a serious conundrum. The next day he received word that Charlges Taggart died of lung-rot, and Ben broke down. Ben sifted through Charlie’s possessions and decided to take on a the teaching gig for Dawson. However, after looking through the box again, he found a wedding ring. Seeing himself in Charlie, Ben decided to fly to the stone cafe on Mars called the Space Rat where Stardust Charlie said he’d be waiting for him. \n"
              },
              {
                "worker_id": "10",
                "uid": "36695036dc4a4779b90033922ea594e9",
                "response_text": "Nearly the entire story is a recollection of the narrator, Ben, as he writes a letter to his love, Laura, who he is leaving behind for his dreams of becoming a spaceman.\nIn June of 1995, Ben and Mickey are sitting together during their graduation ceremony from the first class of the U. S. Academy of Interplanetary Flight, looking at out at the audience for their guests. Mickey is cheerful and generally accepts the world with a smile. Ben’s invited guest, Charlie Taggart, is a pioneering spaceman of 25 years who he thinks of as a parental figure since his parents died in a strato-jet crash when he was four. Ben and Mickey both spot their guests, and there is a contrasting moment between Ben’s orphaned upbringing and Mickey’s family.\nCharlie looks different from the other guests, with scars on his face, and a missing button on his suit - known for doing things his own way. Charlie is a veteran of the explorer Everson's first trip to the Moon, and he had spent his life in space. Mickey introduces Ben to his sister, Laura, after the ceremony. Since Mickey has invited Ben to spend the weekend with them, Laura goes a step further to also invite Charlie, which they both accept. Charlie leaves after one night, gifting Ben a tin box of “souvenirs” from his life, foreshadowing his imminent passing.\nAlthough Ben and Mickey both graduated from the school of interplanetary flight, they have both been offered terrestrial jobs. Ben was offered a job teaching Astrogation at the Academy by Dean Dawson. No doubt very prestigious, but Ben dreams of being the first to visit new planets with Mickey. Mickey awkwardly reveals he had a change of heart, citing that spacemen have short lives because of the demands and danger. Mickey was offered a Cargo Supervisor role at the White Sands Port that he accepted because he will “live a lot longer” there.\nBen is deeply uncertain about his future, accepting Mickey’s offer to stay until he figures it out. During the forty days and forty nights he spends with them he falls in love with Laura and contemplates a family life on Earth with her - even proposing marriage to her - but his desire to be a spaceman remains a barrier to them being together. After Ben learns of Charlie’s death (at “home” on Mars), he remembers the box Charlie gave him. At first he thinks it’s pitiful that there are trinkets in place of the family Charlie might have had on Earth, and makes a decision to take the teaching job and remain on Earth in a safe life with Laura. \nProcessing the contents of the box further, seeing a wedding ring Charlie left for the marriage he couldn’t have due to his life in space, Ben is inspired to again chase his dream in space. He leaves behind the wedding ring and a note (the story) for Laura to find in the morning when he is gone.\n"
              },
              {
                "worker_id": "3",
                "uid": "953982fb7f034f29b94098ca62a33764",
                "response_text": "This story is a letter from Ben to Laura, and starts with Ben's retelling of his graduation day from the U.S. Academy of Interplanetary Flight, with inspiring quotes from the guest speaker about how important spacemen are to society. Ben and his friend Mickey looked around for the one person Ben had invited: Charlie Taggart, aka \"Spaceman Charlie\". They spotted him, and Ben was relieved; the three of them went out afterwards to celebrate along with Mickey's sister, Laura. Ben explained that he'd been offered a teaching job at The Academy but wanted to join an exploratory crew. After getting to the helicopter, Ben eventually met Laura and Charlie's parents--simple people who were happy to live on Earth and not be going anywhere any time soon. Charlie did his best to interact with these new people, even though he told some disturbing stories. Laura and Ben headed to the terrace to look for rockets and talked about Charlie; Laura had a lot of questions about his past. They shared a quiet moment, appreciating each other, before Laura made a comment about the desire to go to the stars might be a disappointment: if they weren't what they seemed, maybe they would never be enough. She asked Ben if he really wanted to give up everything he could have, making Ben sad. The next morning, Charlie returned to work and left a box of belongings with Ben; it was only then when Ben became worried about the coughing he'd noticed over the past day, and his glassy eyes and stiff movements. Before they could talk, Charlie was gone. Later, in Mickey's room, Ben reflected on how his childhood was different from that of other children, after his parents died in a rocket crash. It was after this that he realized he wasn't sure if he wanted to stay or to go, and agreed to stay with Mickey's family until he made a decision about what to do. He spent most of the time with Laura, and after forty days of this he proposed to her, prompting her to ask what he wanted to do for his job. She didn't want to marry someone who would be absent, or someone in such a dangerous profession, but would feel better if he stayed and worked as a teacher, because she loved him too.  It was the next day that Ben got the news that Charlie had died from lung-rot. Shocked, he looked through the box of belongings that Charlie had left him, and after seeing what little Charlie had left behind in terms of meaningful connections, he called The Academy to accept the teaching job. In the end, though, Ben recognized that he would never be happy without trying to explore the stars, so he tells Laura he will not be around when she wakes up because he has to see what's out there, and takes Laura's wedding ring and that of Charlie's wife with him, as mementos. "
              }
            ]
          },
          {
            "question_text": "What is peoples' perception of spacemen?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "1",
                "uid": "85e20d36291f4c3eb3be04fdbf2fdf4b",
                "response_text": "Ben experiences a lot of anxiety at his graduation from the U.S. Academy of Interplanetary Flight because of the high expectations he perceives that the audience has of the 25 men who are graduating. The students have spent the last six years of their lives dedicating themselves to learning about minerals, metals, colonization, and space travel for the sake of helping the people on Earth. The class of 1995 is the first of its kind, and the family members and friends who attend the graduation understandably have very high hopes for the graduates. The graduation speaker is Robert Chandler, a spaceman who landed a rocket on Mars and created the first colony there. He has also traveled to Venus twice. For most laymen, accomplishing something as adventurous as landing on other planets is unthinkable, and the men graduating are the next in line to make such unthinkable journeys. \n\nBen looks out over the crowds of people and thinks to himself that these strangers are looking at him as if he’s some sort of god. He knows that they expect the world from him and his fellow graduates, and he worries that he won’t be able to deliver on such incredible promises. \n\n"
              },
              {
                "worker_id": "6",
                "uid": "135f12f8d4f047789db372879fa69d6c",
                "response_text": "Spacemen are highly valued and, in some ways, superior members of society. Only a very small group of people were selected to attend the U.S. Academy of Interplanetary Flight, which shows how selective and exclusive these members of society are. Although their work is valued and fawned over, those who work in space are often killed early on in their careers. The mortality rate is extremely high in this job and increases with every trip taken. With such a dangerous reputation, the family members of spacemen see the darker side of it: solitude, fear, and sadness. "
              },
              {
                "worker_id": "10",
                "uid": "36695036dc4a4779b90033922ea594e9",
                "response_text": "Ben reflects on the pressures of being a spaceman during graduation, that there is a lot expected from them; such as making “a new kind of civilization and a better place out of Earth.” \nAs Ben and Mickey talk about their futures, Mickey reveals he is no longer going to become a spaceman because their lives are short. Mickey reveals for the first time in the story the dangers of the job, the exposure to uncertainty and hazards, and the demands it places on a human body.\nAlthough it is a high pressure, dangerous job, being a spaceman is romanticized through Ben’s childhood dream while he ultimately commits to see through at the end of the story. The allure of adventure in space and seeing the unknown for himself is a stronger draw than a safe life of certainty on Earth.\n"
              },
              {
                "worker_id": "3",
                "uid": "953982fb7f034f29b94098ca62a33764",
                "response_text": "In the speech that Robert Chandler gave to the first graduating class of the U.S. Academy of Interplanetary Flight, he reminded the students that the six years of training would pay off for society, and that these spacemen would retrieve metals and minerals that the people of Earth needed, find new land, and inspire others, all of which were necessary things for the society. However, Ben and Mickey know it can be a dangerous profession: Mickey explains that on the more dangerous missions, where one is one of the first on a planet, you're lucky to live five to ten years. This is important because Laura has this knowledge when she talks to Ben about their possible future together. She knows that he could die, their children could be exposed to dangerous radiation, and he would likely always be looking for the next adventure instead of coming home to her. In general, the spacemen are appreciated for their services to the society but there is some understanding of the limitations on the types of meaningful personal connections they are able to make."
              }
            ]
          },
          {
            "question_text": "What role does Charlie Taggart play in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "1",
                "uid": "85e20d36291f4c3eb3be04fdbf2fdf4b",
                "response_text": "Charlie Taggart, also known as Stardust Charlie, is a very important character in the story. Ben is orphaned at the age of four when his parents perished in a strato-jet crash. Within a few years, he meets Charlie, a successful spaceman, at the Long Island Spaceport. He follows him around, eager to learn everything he can about space, and Charlie eventually becomes the closest thing Ben has to a family member. \n\nAlthough Ben doesn’t know if Charlie will show up at his graduation, he is happy to see he has taken 24 hours off of work to come and celebrate with him. He worries, however, that Charlie looks very ill. He becomes even more concerned when Charlie leaves a small tin for Ben to look through after he leaves. Charlie admits that he has cheated death many times, and he knows he won’t be able to escape it forever. Ben remains hopeful that they will see each other again when Charlie tells him to meet him at the Space Rat, a cafe on Mars. \n\nAfter Ben receives word that Charlie died from lung-rot, he takes it as a sign that he should stay on earth and live an ordinary life with Laura as his wife. The trinkets in Charlie’s tin do not impress Ben or symbolize a life well-lived. Yet, hours later, Ben finds Charlie’s wedding ring and changes his mind about his entire life’s path. He knows that Charlie wanted to talk to him alone before he died, and he never gave him the chance to tell him about the same difficult decisions he had to make. Ben realizes that Charlie’s life may not be one that’s suitable for everyone, but it was certainly a life worth living. Charlie returned to space knowing that he was about to die because the planets and moons and stars were his reason for living. To Charlie, the sacrifices he made to be a spaceman were worth it, and Ben sees that he wants that for himself as well. \n"
              },
              {
                "worker_id": "6",
                "uid": "135f12f8d4f047789db372879fa69d6c",
                "response_text": "Charlie Taggart or Charlie Stardust acts as a father figure and caregiver for Ben, one of the graduates of the U.S. Academy for Interplanetary Flight. Stardust Charlie has worked as a spaceman for nearly 25 years, one of the longest careers ever seen. His presence in Ben’s life furthered his love of space, and Charlie’s recommendation allowed Ben to attend the U.S. Academy for Interplanetary Flight. \nIn the end, Charlie dies of lung-rot right where he wanted to: in a stone cafe on Mars. Space was his home, not Earth. Charlie’s death causes a slight crisis for Ben when he has to decide if he should stay on Earth or take to the skies. At first, he decides to stay so he can marry Laura and live a long and happy life with her. He didn’t want to die alone like Charlie. However, after discovering a wedding ring hidden in Charlie’s possessions, he realizes that despite Charlie’s solitary lifestyle he was never truly alone. Space was his true home, and Ben decides that space truly can’t be that lonely if men like Charlie are out there flying around. He decides to leave Laura and all his domestic dreams behind on Earth and follow his mentor to Mars, so he can meet in the place where he took his last breath: the Space Rat on Mars. Ben realizes that no matter where he goes, he will always carry Charlie and Laura with him. Charlie’s presence and death acts as a catalyst in two of Ben’s major life decisions. \n"
              },
              {
                "worker_id": "10",
                "uid": "36695036dc4a4779b90033922ea594e9",
                "response_text": "Charlie Taggart represents the childhood dream Ben has been working towards of becoming a spaceman and being the first to explore a new planet. Ben thinks of Charlie as the example of what future him would be like if he were to take the berth on the Odyssey. Charlie is also actively helping him to achieve that dream, as Ben remembers Charlie’s recommendation finally getting him in as a cadet to become a spaceman.\nCharlie acts as a guide in the story, made possible because Ben trusts him so deeply. Ben treats Charlie as family, even inviting him to his graduating ceremony as part of the first class of the US Academy of Interplanetary Flight. Ben thinks of him as a parent and a friend, since both of his parents are deceased.\nCharlie avoids being sentimental, and Ben doesn’t realize he is dying when he gives him a small metal box after his graduation. Ben doesn’t open it until after he learns of Charlie’s death - a shocking realization that immediately causes him to drop his dream of becoming a spaceman and choose a life on Earth with Laura. However, the sentimental items in Charlie’s box make Ben reconsider that decision. Thereby, guiding Ben’s life in a different direction.\nCharlie is an inspiration to Ben and he ultimately chooses to become a spaceman and leave the safe life with Laura on Earth (even though it pains him) because he has to see the moon and other planets for himself.\n"
              },
              {
                "worker_id": "3",
                "uid": "953982fb7f034f29b94098ca62a33764",
                "response_text": "Charlie Taggart, aka \"Spaceman Charlie\", was a seasoned spaceman who had been to the moon and on a regular shuttle mission between the moon and New Mexico. Because Ben did not have family left alive, Charlie was the one person who Ben invited to his graduation; he had met him as a child, they got to know one another, and it was Charlie's recommendation that got Ben into the U.S. Academy of Interplanetary Flight. He had aged much in the year before Ben's graduation, but did show up to the ceremony, ready to celebrate with Ben. After a day of celebration, Charlie left a box of belongings with Ben as he went back to work. It was then that Ben started to worry about Charlie's health. After spending forty days with Mickey's family trying to decide what he wants, Ben got the news that Charlie had died from lung-rot. When Ben looked through Charlie's possessions, he realized that there was a lack of evidence of real human connection, and this pushed Ben to call The Academy and accept the teaching job so that he could be with Laura and not run away to the stars. At the same time, Ben reflected on the stories he had been told and the life Charlie had lived. Charlie had been married, but learned the hard way that he could not have both a family and the stars. Eventually, Ben decided to go into space instead of staying with Laura, but the only context he had for the decision was Charlie's stories. \n"
              }
            ]
          },
          {
            "question_text": "How does Ben's childhood affect him later in life?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "1",
                "uid": "85e20d36291f4c3eb3be04fdbf2fdf4b",
                "response_text": "Ben becomes an orphan when he is just 4 years old. The first person he finds that he can trust and look up to is Charlie Taggart, who also happens to be a spaceman. From this point forward, Ben’s life revolves around reaching his dream of going to the stars. When he sits in his best friend Mickey’s childhood bedroom, he realizes that he never got to experience a “normal” childhood, and this probably impacted his life’s goals. The bedroom contains trophies, books, videos, and other treasures from typical childhoods. Ben sees that his life, filled with dorms, rules, and routines, completely lacked a warmth that he would have experienced if he had grown up with parents who loved him. All he had to rely on were his dreams for his future. He never got to experience the little moments of pleasure and togetherness that families have. Ben put all of his energy into becoming a spaceman because it would make him special, and it was something supremely important to work towards. He has no idea who he would be if his parents hadn’t died. "
              },
              {
                "worker_id": "6",
                "uid": "135f12f8d4f047789db372879fa69d6c",
                "response_text": "When Ben was a child, his parents were tragically killed in a rocket crash, leaving him orphaned and alone. Although the story doesn’t reveal the exact circumstances or series of events, Ben eventually winds up in the hands of Charlie Taggert who looks after him as a father, mother, and brother. Charlie’s devotion to space inspires a love for it in Ben and sets him on the path to interplanetary flight. Without Ben’s parents dying, he may never have met Charlie or attended the U.S. Academy for Interplanetary Flight. \nAs well, his childhood prepared him for a life of solitude. He was not a family man by nature or by nurture, which made his ascent into space much easier. \n"
              },
              {
                "worker_id": "10",
                "uid": "36695036dc4a4779b90033922ea594e9",
                "response_text": "Ben’s parents both died in a strato-jet crash when he was four, leaving him with no mother and father. He realizes while he is an invited guest staying with Mickey and Laura at their parent’s house after his graduation that they had a childhood different from his. Their childhood bedrooms and their upbringing was something that he all of a sudden felt he was lacking due to his experience growing up in dormitories with rules and regulations. He cites that his singular focus on his dream to be a spaceman didn’t allow him to stop and notice the things that he felt he missed in his childhood.\nThis childhood of separation from family, and attaching himself to a pioneering lone-wolf spaceman (Charlie) after pestering him while he was a child in a spaceport, led Ben to romanticize and want a life of opportunity to be the first to see new planets. That dream, and the independence he had known since childhood ultimately led him to choose a life in space instead of settle into a family on Earth with Laura.\n"
              },
              {
                "worker_id": "3",
                "uid": "953982fb7f034f29b94098ca62a33764",
                "response_text": "One major event in Ben's childhood changed his life in a large number of ways. His parents died in a rocket crash when he was young, which caused two immediate effects: Ben's lack of parental figures in his life, which spurred his interest in Charlie and causes his childhood to be irregular in other ways, and Ben's general interest in rockets. In this way, rockets have affected him at various stages in life: he would have lived a very different life if they didn't exist, because his parents would not have died, but he would not have had them to attach his big dreams to either, which means that maybe he would have been perfectly happy staying on Earth with Laura in another version of events. He had to clutch onto his dreams as he was growing up because everything he saw was structure. As he put it, it was a \"cold, automatic kind of life, the life of dormitories and routines and rules\". His dreams of going to the stars, then, were his way of escaping this structure. He would never have applied to the U.S. Academy of Interplanetary Flight otherwise. "
              }
            ]
          },
          {
            "question_text": "How does Ben's relationship with Laura change over time?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "1",
                "uid": "85e20d36291f4c3eb3be04fdbf2fdf4b",
                "response_text": "When Ben meets Laura, Mickey’s sister, at his spaceman graduation, he feels an instant connection with her. He enjoys talking to her and wants to learn everything there is to know about her. Although he’s happy to see Charlie Taggart, the closest thing he has to a family member, he chooses spending time with Laura and her family over spending time with Charlie alone. He can’t help feeling drawn to her. \n\nAt first, Ben is completely oblivious to the feelings that Laura has for him, but after a walk under the stars together, he sees that she also sees a future with him. He has never before considered living on earth, getting married, owning a house, and settling for a “boring” life, but after she suggests that visiting the stars might just be like her trip to England, he wonders if she’s right. Maybe he has hyped up space travel so much and it will end up being a disappointment. Maybe Mickey is onto something, and sacrificing a normal life on earth where living to old age is expected is not a choice he should give up so easily. Ben desperately wants to be with Laura. He loves her just as much as he loves the stars. \n\nHe spends forty incredible days with the woman of his dreams, but in the end, it’s not enough to convince him to give up his lifelong dream of being a spaceman. Sure, he’s uncomfortable with the amount of pressure that’s put on him, and he recognizes that he will be risking his life every single day, but he can see that Charlie does not regret giving up the quiet homelife for the incredible adventures that await in space. Ben wants to be the first man to visit a planet or find a helpful mineral or create a useful colony, and his love for Laura cannot change his dreams.\n"
              },
              {
                "worker_id": "6",
                "uid": "135f12f8d4f047789db372879fa69d6c",
                "response_text": "At first, Ben is infatuated with Laura and the dark flecks in her eyes. They grow closer and closer together as Ben’s stay in their house continues on. Between stargazing, conversing, swimming, and dancing, Ben and Laura quickly fell in love. When he asks her to marry him, however, things start to change. She says that she will marry Ben the teacher, but not Ben the spaceman. She does not want to be resigned to a life of solitude, fear, and separation. Ben is forced to make a choice then: Laura or his dreams of being an explorer. Although at first he decides to stay with Laura and become a teacher, he quickly changes his mind. In some ways, he has already married space and is as devoted to it as he was to Laura. He says in the end that he will always carry Laura and Charlie with him wherever he goes, though they may not be there with him physically. Although there was the potential for marriage, it seems that it was not meant to be. "
              },
              {
                "worker_id": "10",
                "uid": "36695036dc4a4779b90033922ea594e9",
                "response_text": "Ben and Laura’s relationship moves quickly from the time they meet at Ben’s graduation until he decides to become a spaceman (about forty days later).\nBen meets Laura at his graduation ceremony as part of the first class of the US Academy of Interplanetary Flight. Laura is the sister of his fellow spaceman, Mickey, whom he has become close with during training. Laura learns about Ben before she meets him from the stories told to her by her brother Mickey. When they have Ben and Charlie to their parents house for the weekend, Ben and Laura spend an evening after dinner watching for crimson-tailed continental rockets taking off from White Sands port. It was then that Ben knew Laura liked him.\nMickey invites Ben to stay with them until he decides what to take as his next opportunity - a berth on the Odyssey spaceship with the potential to go to Pluto or a safe job teaching astrogation at the academy. He stays forty days and forty nights. During this time, he falls in love with Laura and proposes to her.\nTheir relationship changes when Laura questions what a life would be like married to Ben as a spaceman. She has fears about bearing children with a spaceman since there was an example of one family having a “monster” child after the father was exposed to radiation in space. She is worried about not seeing her husband for months or years at a time. Ben is torn between the woman he loves and the life he has been dreaming of since childhood to become a spaceman.\nUltimately Ben decides to be a spaceman and leaves Laura the wedding ring in Charlie’s tin box (that was from Charlie’s broken marriage after choosing life in space) as a token of his affection, and of the bittersweetness of having to leave behind a potentially happy life for his love of space. Perhaps Ben one day hopes to return and have Laura still waiting to marry him.\n"
              },
              {
                "worker_id": "3",
                "uid": "953982fb7f034f29b94098ca62a33764",
                "response_text": "Laura is the sister of Ben's friend Mickey, whom he met at their graduation from The Academy. She invited Ben and Charlie to celebrate with her and Mickey after the ceremony, and gives away the fact that Mickey is no longer planning on signing up to be on a rocket with Ben, and wants a safer job. Ben realizes later that night that he and Laura have feelings for each other, so this is motivation for him to stay with Mickey's family while he sorts out what he wants to do. The two spend forty days together before Ben proposes to Laura, who has been trying to figure out what Ben wants for the entirety of their relationship. This is the entirety of their relationship as of the time of the story, starting with their realization of an attraction and an interest in each other and ending in a proposal (that was presumably accepted) and then a breaking-off of the relationship. They both want to be with one another, and Ben wants to get married no matter what, but Laura knows that he cannot live as a spaceman and as a caring and attentive husband to her, so he must choose. In this sense, Laura's outlook is very steady for their entire relationship, as she asked Ben on the first night they met if he really wanted to become a spaceman if it meant giving up everything he could have. A lot changes in the last day or so of Ben's stay with the family, as he receives news that Charlie passed away. It looking through Charlie's belongings that he recognizes that he can't have the space life and the meaningful personal connections he might want (at least of the sort he had with Laura at the time), which makes him come to a snap realization that he should accept the teaching job and stay on Earth. However, his eventually falls to his gut which tells him he would never be happy if he never tried to see the stars, and that his relationship with Laura has to end. Without Charlie's stories and belongings, Ben may not have realized that he would not be able to have the best of both worlds at the same time.\n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4821,
        "document_length_chars": 26425
      }
    }
  ]
}