{
  "item_metadata": {
    "item_id": "51268",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51268",
      "content": "THE GIRLS FROM EARTH\n \n \n By FRANK M. ROBINSON\n \n Illustrated by EMSH\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction January 1952. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n Problem: How can you arrange marriages with men in one solar system, women in another—and neither willing to leave his own world?\n \n\n\n I\n \n \"The beasts aren't much help, are they?\"\n \n Karl Allen snatched a breath of air and gave another heave on the line tied to the raft of parampa logs bobbing in the middle of the river.\n \n \"No,\" he grunted, \"they're not. They always balk at a time like this, when they can see it'll be hard work.\"\n \n Joseph Hill wiped his plump face and coiled some of the rope's slack around his thick waist.\n \n \"Together now, Karl. One! Two! \"\n \n They stood knee-deep in mud on the bank, pulling and straining on the rope, while some few yards distant, in the shade of a grove of trees, their tiny yllumphs nibbled grass and watched them critically, but made no effort to come closer.\n \n \n\n \n \"If we're late for ship's landing, Joe, we'll get crossed off the list.\"\n \n Hill puffed and wheezed and took another hitch on the rope.\n \n \"That's what I've been thinking about,\" he said, worried.\n \n They took a deep breath and hauled mightily on the raft rope. The raft bobbed nearer. For a moment the swift waters of the Karazoo threatened to tear it out of their grasp, and then it was beached, most of it solidly, on the muddy bank. One end of it still lay in the gurgling, rushing waters, but that didn't matter. They'd be back in ten hours or so, long before the heavy raft could be washed free.\n \n \"How much time have we got, Karl?\"\n \n The ground was thick with shadows, and Karl cast a critical eye at them. He estimated that even with the refusal of their yllumphs to help beach the raft, they still had a good two hours before the rocket put down at Landing City.\n \n \"Two hours, maybe a little more,\" he stated hastily when Hill looked more worried. \"Time enough to get to Landing City and put in for our numbers on the list.\"\n \n He turned back to the raft, untied the leather and horn saddles, and threw them over the backs of their reluctant mounts. He cinched his saddle and tied on some robes and furs behind it.\n \n Hill watched him curiously. \"What are you taking the furs for? This isn't the trading rocket.\"\n \n \"I know. I thought that when we come back tonight, it might be cold and maybe she'll appreciate the coverings then.\"\n \n \"You never would have thought of it yourself,\" Hill grunted. \"Grundy must have told you to do it, the old fool. If you ask me, the less you give them, the less they'll come to expect. Once you spoil them, they'll expect you to do all the trapping and the farming and the family-raising yourself.\"\n \n \"You didn't have to sign up,\" Karl pointed out. \"You could have applied for a wife from some different planet.\"\n \n \"One's probably just as good as another. They'll all have to work the farms and raise families.\"\n \n Karl laughed and aimed a friendly blow at Hill. They finished saddling up and headed into the thick forest.\n \n \n\n \n It was quiet as Karl guided his mount along the dimly marked trail and he caught himself thinking of the return trip he would be making that night. It would be nice to have somebody new to talk to. And it would be good to have somebody to help with the trapping and tanning, somebody who could tend the small vegetable garden at the rear of his shack and mend his socks and wash his clothes and cook his meals.\n \n And it was time, he thought soberly, that he started to raise a family. He was mid-twenty now, old enough to want a wife and children.\n \n \"You going to raise a litter, Joe?\"\n \n Hill started. Karl realized that he had probably been thinking of the same thing.\n \n \"One of these days I'll need help around the sawmill,\" Hill answered defensively. \"Need some kids to cut the trees, a couple more to pole them down the river, some to run the mill itself and maybe one to sell the lumber in Landing City. Can't do it all myself.\"\n \n He paused a moment, thinking over something that had just occurred to him.\n \n \"I've been thinking of your plans for a garden, Karl. Maybe I ought to have one for my wife to take care of, too.\"\n \n Karl chuckled. \"I don't think she'll have the time!\"\n \n They left the leafy expanse of the forest and entered the grasslands that sloped toward Landing City. He could even see Landing City itself on the horizon, a smudge of rusting, corrugated steel shacks, muddy streets, and the small rocket port—a scorched thirty acres or so fenced off with barbed wire.\n \n Karl looked out of the corner of his eye at Hill and felt a vague wave of uneasiness. Hill was a big, thick man wearing the soiled clothes and bristly stubble of a man who was used to living alone and who liked it. But once he took a wife, he would probably have to keep himself in clean clothes and shave every few days. It was even possible that the woman might object to Hill letting his yllumph share the hut.\n \n The path was getting crowded, more of the colonists coming onto the main path from the small side trails.\n \n Hill broke the silence first. \"I wonder what they'll be like.\"\n \n Karl looked wise and nodded knowingly. \"They're Earthwomen, Joe. Earth! \"\n \n It was easy to act as though he had some inside information, but Karl had to admit to himself that he actually knew very little about it. He was a Second System colonist and had never even seen an Earthwoman. He had heard tales, though, and even discounting a large percentage of them, some of them must have been true. Old Grundy at the rocket office, who should know about these things if anybody did, seemed disturbingly lacking on definite information, though he had hinted broadly enough. He'd whistle softly and wink an eye and repeat the stories that Karl had already heard; but he had nothing definite to offer, no real facts at all.\n \n Some of the other colonists whom they hadn't seen for the last few months shouted greetings, and Karl began to feel some of the carnival spirit. There was Jenkins, who had another trapping line fifty miles farther up the Karazoo; Leonard, who had the biggest farm on Midplanet; and then the fellow who specialized in catching and breaking in yllumphs, whose name Karl couldn't remember.\n \n \"They say they're good workers,\" Hill said.\n \n Karl nodded. \"Pretty, too.\"\n \n They threaded their way through the crowded and muddy streets. Landing City wasn't big, compared to some of the cities on Altair, where he had been raised, but Karl was proud of it. Some day it would be as big as any city on any planet—maybe even have a population of ten thousand people or more.\n \n \"Joe,\" Karl said suddenly, \"what's supposed to make women from Earth better than women from any other world?\"\n \n Hill located a faint itch and frowned. \"I don't know, Karl. It's hard to say. They're—well, sophisticated, glamorous.\"\n \n Karl absorbed this in silence. Those particular qualities were, he thought, rather hard to define.\n \n The battered shack that served as rocket port office and headquarters for the colonial office on Midplanet loomed up in front of them. There was a crowd gathered in front of the building and they forced their way through to see what had caused it.\n \n \"We saw this the last time we were here,\" Hill said.\n \n \"I know,\" Karl agreed, \"but I want to take another look.\" He was anxious to glean all the information that he could.\n \n It was a poster of a beautiful woman leaning toward the viewer. The edges of the poster were curling and the colors had faded during the last six months, but the girl's smile seemed just as inviting as ever. She held a long-stemmed goblet in one hand and was blowing a kiss to her audience with the other. Her green eyes sparkled, her smile was provocative. A quoted sentence read: \"I'm from Earth !\" There was nothing more except a printed list of the different solar systems to which the colonial office was sending the women.\n \n \n\n \n She was real pretty, Karl thought. A little on the thin side, maybe, and the dress she was wearing would hardly be practical on Midplanet, but she had a certain something. Glamour, maybe?\n \n A loudspeaker blared.\n \n \"All colonists waiting for the wife draft assemble for your numbers! All colonists....\"\n \n There was a jostling for places and then they were in the rapidly moving line. Grundy, fat and important-looking, was handing out little blue slips with numbers on them, pausing every now and then to tell them some entertaining bit of information about the women. He had a great imagination, nothing else.\n \n Karl drew the number 53 and hurried to the grassy lot beside the landing field that had been decorated with bunting and huge welcome signs for the new arrivals. A table was loaded with government pamphlets meant to be helpful to newly married colonists. Karl went over and stuffed a few in his pockets. Other tables had been set out and were loaded with luncheon food, fixed by the few colonial women in the community. Karl caught himself eyeing the women closely, wondering how the girls from Earth would compare with them.\n \n He fingered the ticket in his pocket. What would the woman be like who had drawn the companion number 53 aboard the rocket? For when it landed, they would pair up by numbers. The method had its drawbacks, of course, but time was much too short to allow even a few days of getting acquainted. He'd have to get back to his trapping lines and he imagined that Hill would have to get back to his sawmill and the others to their farms. What the hell, you never knew what you were getting either way, till it was too late.\n \n \"Sandwich, mister? Pop?\"\n \n Karl flipped the boy a coin, picked up some food and a drink, and wandered over to the landing field with Hill. There were still ten minutes or so to go before the rocket landed, but he caught himself straining his sight at the blue sky, trying to see a telltale flicker of exhaust flame.\n \n The field was crowded and he caught some of the buzzing conversation.\n \n \"... never knew one myself, but let me tell you....\"\n \n \"... knew a fellow once who married one, never had a moment's rest afterward....\"\n \n \"... no comparison with colonial women. They got culture....\"\n \n \"... I'd give a lot to know the girl who's got number twenty-five....\"\n \n \"Let's meet back here with the girls who have picked our numbers,\" Hill said. \"Maybe we could trade.\"\n \n Karl nodded, though privately he felt that the number system was just as good as depending on first impressions.\n \n There was a murmur from the crowd and he found his gaze riveted overhead. High above, in the misty blue sky, was a sudden twinkle of fire.\n \n He reached up and wiped his sweaty face with a muddy hand and brushed aside a straggly lock of tangled hair. It wouldn't hurt to try to look his best.\n \n The twinkling fire came nearer.\n \n \n\n II\n \n \"A Mr. Macdonald to see you, Mr. Escher.\"\n \n Claude Escher flipped the intercom switch.\n \n \"Please send him right in.\"\n \n That was entirely superfluous, he thought, because MacDonald would come in whether Escher wanted him to or not.\n \n The door opened and shut with a slightly harder bang than usual and Escher mentally braced himself. He had a good hunch what the problem was going to be and why it was being thrown in their laps.\n \n MacDonald made himself comfortable and sat there for a few minutes, just looking grim and not saying anything. Escher knew the psychology by heart. A short preliminary silence is always more effective in browbeating subordinates than an initial furious bluster.\n \n He lit a cigarette and tried to outwait MacDonald. It wasn't easy—MacDonald had great staying powers, which was probably why he was the head of the department.\n \n Escher gave in first. \"Okay, Mac, what's the trouble? What do we have tossed in our laps now?\"\n \n \"You know the one—colonization problem. You know that when we first started to colonize, quite a large percentage of the male population took to the stars, as the saying goes. The adventuresome, the gamblers, the frontier type all decided they wanted to head for other worlds, to get away from it all. The male of the species is far more adventuresome than the female; the men left—but the women didn't. At least, not in nearly the same large numbers.\n \n \"Well, you see the problem. The ratio of women to men here on Earth is now something like five to three. If you don't know what that means, ask any man with a daughter. Or any psychiatrist. Husband-hunting isn't just a pleasant pastime on Earth. It's an earnest cutthroat business and I'm not just using a literary phrase.\"\n \n He threw a paper on Escher's desk. \"You'll find most of the statistics about it in that, Claude. Notice the increase in crimes peculiar to women. Shoplifting, badger games, poisonings, that kind of thing. It's quite a list. You'll also notice the huge increase in petty crimes, a lot of which wouldn't have bothered the courts before. In fact, they wouldn't even have been considered crimes. You know why they are now?\"\n \n Escher shook his head blankly.\n \n \"Most of the girls in the past who didn't catch a husband,\" MacDonald continued, \"grew up to be the type of old maid who's dedicated to improving the morals and what-not of the rest of the population. We've got more puritanical societies now than we ever had, and we have more silly little laws on the books as a result. You can be thrown in the pokey for things like violating a woman's privacy—whatever that means—and she's the one who decides whether what you say or do is a violation or not.\"\n \n Escher looked bored. \"Not to mention the new prohibition which forbids the use of alcohol in everything from cough medicines to hair tonics. Or the cleaned up moral code that reeks—if you'll pardon the expression—of purity. Sure, I know what you mean. And you know the solution. All we have to do is get the women to colonize.\"\n \n MacDonald ran his fingers nervously through his hair.\n \n \"But it won't be easy, and that's why it's been given to us. It's your baby, Claude. Give it a lot of thought. Nothing's impossible, you know.\"\n \n \"Perpetual motion machines are,\" Escher said quietly. \"And pulling yourself up by your boot-straps. But I get the point. Nevertheless, women just don't want to colonize. And who can blame them? Why should they give up living in a luxury civilization, with as many modern conveniences as this one, to go homesteading on some wild, unexplored planet where they have to work their fingers to the bone and play footsie with wild animals and savages who would just as soon skin them alive as not?\"\n \n \"What do you advise I do, then?\" MacDonald demanded. \"Go back to the Board and tell them the problem is not solvable, that we can't think of anything?\"\n \n Escher looked hurt. \"Did I say that? I just said it wouldn't be easy.\"\n \n \"The Board is giving you a blank check. Do anything you think will pay off. We have to stay within the letter of the law, of course, but not necessarily the spirit.\"\n \n \"When do they have to have a solution?\"\n \n \"As soon as possible. At least within the year. By that time the situation will be very serious. The psychologists say that what will happen then won't be good.\"\n \n \"All right, by then we'll have the answer.\"\n \n MacDonald stopped at the door. \"There's another reason why they want it worked out. The number of men applying to the Colonization Board for emigration to the colony planets is falling off.\"\n \n \"How come?\"\n \n MacDonald smiled. \"On the basis of statistics alone, would you want to emigrate from a planet where the women outnumber the men five to three?\"\n \n When MacDonald had gone, Escher settled back in his chair and idly tapped his fingers on the desk-top. It was lucky that the Colonization Board worked on two levels. One was the well-publicized, idealistic level where nothing was too good and every deal was 99 and 44/100 per cent pure. But when things got too difficult for it to handle on that level, they went to Escher and MacDonald's department. The coal mine level. Nothing was too low, so long as it worked. Of course, if it didn't work, you took the lumps, too.\n \n He rummaged around in his drawer and found a list of the qualifications set up by the Board for potential colonists. He read the list slowly and frowned. You had to be physically fit for the rigors of space travel, naturally, but some of the qualifications were obviously silly. You couldn't guarantee physical perfection in the second generation, anyway.\n \n He tore the qualification list in shreds and dropped it in the disposal chute. That would have to be the first to go.\n \n There were other things that could be done immediately. For one thing, as it stood now, you were supposed to be financially able to colonize. Obviously a stupid and unappealing law. That would have to go next.\n \n He picked up the sheet of statistics that MacDonald had left and read it carefully. The Board could legalize polygamy, but that was no solution in the long run. Probably cause more problems than it would solve. Even with women as easy to handle as they were nowadays, one was still enough.\n \n Which still left him with the main problem of how to get people to colonize who didn't want to colonize.\n \n The first point was to convince them that they wanted to. The second point was that it might not matter whether they wanted to or not.\n \n No, it shouldn't be hard to solve at all—provided you held your nose, silenced your conscience, and were willing to forget that there was such a thing as a moral code.\n \n \n\n III\n \n Phyllis Hanson put the cover over her typewriter and locked the correspondence drawer. Another day was done, another evening about to begin.\n \n She filed into the washroom with the other girls and carefully redid her face. It was getting hard to disguise the worry lines, to paint away the faint crow's-feet around her eyes.\n \n She wasn't, she admitted to herself for the thousandth time, what you would call beautiful. She inspected herself carefully in her compact mirror. In a sudden flash of honesty, she had to admit that she wasn't even what you would call pretty. Her face was too broad, her nose a fraction too long, and her hair was dull. Not homely, exactly—but not pretty, either.\n \n Conversation hummed around her, most of it from the little group in the corner, where the extreme few who were married sat as practically a race apart. Their advice was sought, their suggestions avidly followed.\n \n \"Going out tonight, Phyl?\"\n \n She hesitated a moment, then slowly painted on the rest of her mouth. The question was technically a privacy violator, but she thought she would sidestep it this time, instead of refusing to answer point-blank.\n \n \"I thought I'd stay home tonight. Have a few things I want to rinse out.\"\n \n The black-haired girl next to her nodded sympathetically. \"Sure, Phyl, I know what you mean. Just like the rest of us—waiting for the phone to ring.\"\n \n Phyllis finished washing up and then left the office, carefully noting the girl who was waiting for the boss. The girl was beautiful in a hard sort of way, a platinum blonde with an entertainer's busty figure. Waiting for a plump, middle-aged man like a stagestruck kid outside a theatre.\n \n At home, in her small two-room bachelor-girl apartment, she stripped and took a hot, sudsing shower, then stepped out and toweled herself in front of a mirror. She frowned slightly. You didn't know whether you should keep yourself in trim just on some off-chance, or give up and let yourself go.\n \n She fixed dinner, took a moderately long time doing the dishes, and went through the standard routine of getting a book and curling up on the sofa. It was a good book of the boot-legged variety—scientifically written with enough surplus heroes and heroines and lushly described love affairs to hold anybody's interest.\n \n It held hers for ten pages and then she threw the book across the room, getting a savage delight at the way the pages ripped and fluttered to the floor.\n \n What was the use of kidding herself any longer, of trying to live vicariously and hoping that some day she would have a home and a husband? She was thirty now; the phone hadn't rung in the last three years. She might as well spend this evening as she had spent so many others—call up the girls for a bridge game and a little gossip, though heaven knew you always ended up envying the people you were gossiping about.\n \n Perhaps she should have joined one of the organizations at the office that did something like that seven nights out of every seven. A bridge game or a benefit for some school or a talk on art. Or she could have joined the Lecture of the Week club, or the YWCA, or any one of the other government-sponsored clubs designed to fill the void in a woman's life.\n \n But bridge games and benefits and lectures didn't take the place of a husband and family. She was kidding herself again.\n \n She got up and retrieved the battered book, then went over to the mail slot. She hadn't had time to open her mail that morning; most of the time it wasn't worth the effort. Advertisements for book clubs, lecture clubs, how to win at bridge and canasta....\n \n Her fingers sprang the metal tabs on a large envelope and she took out the contents and spread it wide.\n \n She gasped. It was a large poster, about a yard square. A man was on it, straddling a tiny city and a small panorama of farms and forests at his feet. He was a handsome specimen, with wavy blond hair and blue eyes and a curly mat on his bare chest that was just enough to be attractive without being apelike. He held an axe in his hands and was eyeing her with a clearly inviting look of brazen self-confidence.\n  It was definitely a privacy violator and she should notify the authorities immediately!\n \n \n Bright lettering at the top of the poster shrieked: \"Come to the Colonies, the Planets of Romance!\"\n \n \n\n Whoever had mailed it should be arrested and imprisoned! Preying on....\n \n \n The smaller print at the bottom was mostly full of facts and figures. The need for women out on the colony planets, the percentage of men to women—a startling disproportion—the comfortable cities that weren't nearly as primitive as people had imagined, and the recently reduced qualifications.\n \n She caught herself admiring the man on the poster. Naturally, it was an artist's conception, but even so....\n \n And the cities were far in advance of the frontier settlements, where you had to battle disease and dirty savages.\n \n It was all a dream. She had never done anything like this and she wouldn't think of doing it now. And had any of her friends seen the poster? Of course, they probably wouldn't tell her even if they had.\n  But the poster was a violation of privacy. Whoever had sent it had taken advantage of information that was none of their business. It was up to her to notify the authorities!\n \n \n \n\n \n She took another look at the poster.\n \n The letter she finally finished writing was very short. She addressed it to the box number in the upper left-hand corner of the plain wrapper that the poster had come in.\n \n \n\n IV\n \n The dress lay on the counter, a small corner of it trailing off the edge. It was a beautiful thing, sheer sheen satin trimmed in gold nylon thread. It was the kind of gown that would make anybody who wore it look beautiful. The price was high, much too high for her to pay. She knew she would never be able to buy it.\n \n But she didn't intend to buy it.\n \n She looked casually around and noted that nobody was watching her. There was another woman a few counters down and a man, obviously embarrassed, at the lingerie counter. Nobody else was in sight. It was a perfect time. The clerk had left to look up a difficult item that she had purposely asked for and probably wouldn't be back for five minutes.\n \n Time enough, at any rate.\n \n The dress was lying loose, so she didn't have to pry it off any hangers. She took another quick look around, then hurriedly bundled it up and dropped it in her shopping bag.\n \n She had taken two self-assured steps away from the counter when she felt a hand on her shoulder. The grip was firm and muscular and she knew she had lost the game. She also knew that she had to play it out to the end, to grasp any straw.\n \n \"Let go of me!\" she ordered in a frostily offended voice.\n \n \"Sorry, miss,\" the man said politely, \"but I think we have a short trip to take.\"\n \n She thought for a moment of brazening it out further and then gave up. She'd get a few weeks or months in the local detention building, a probing into her background for the psychological reasons that prompted her to steal, and then she'd be out again.\n \n They couldn't do anything to her that mattered.\n \n She shrugged and followed the detective calmly. None of the shoppers had looked up. None seemed to notice anything out of the ordinary.\n \n In the detention building she thanked her good luck that she was facing a man for the sentence, instead of one of the puritanical old biddies who served on the bench. She even found a certain satisfaction in the presence of the cigar smoke and the blunt, earthy language that floated in from the corridor.\n \n \"Why did you steal it?\" the judge asked. He held up the dress, which, she noted furiously, didn't look nearly as nice as it had under the department store lights.\n \n \"I don't have anything to say,\" she said. \"I want to see a lawyer.\"\n \n She could imagine what he was thinking. Another tough one, another plain jane who was shoplifting for a thrill.\n \n And she probably was. You had to do something nowadays. You couldn't just sit home and chew your fingernails, or run out and listen to the endless boring lectures on art and culture.\n \n \"Name?\" he asked in a tired voice.\n \n She knew the statistics he wanted. \"Ruby Johnson, 32, 145 pounds, brown hair and green eyes. Prints on file.\"\n \n The judge leaned down and mentioned something to the bailiff, who left and presently came back with a ledger. The judge opened it and ran his fingers down one of the pages.\n \n The sentence would probably be the usual, she thought—six months and a fine, or perhaps a little more when they found out she had a record for shoplifting.\n \n A stranger in the courtroom in the official linens of the government suddenly stepped up beside the judge and looked at the page. She could hear a little of what he said:\n \n \"... anxiety neurosis ... obvious feeling of not being wanted ... probably steals to attract attention ... recommend emigration.\"\n \n \"In view of some complicating factors, we're going to give you a choice,\" the judge finally said. \"You can either go to the penitentiary for ten years and pay a $10,000 fine, or you can ship out to the colony planets and receive a five-hundred-dollar immigration bonus.\"\n \n She thought for a minute that she hadn't heard right. Ten thousand dollars and ten years! It was obvious that the state was interested in neither the fine nor in paying her room and board for ten years. She could recognize a squeeze play when she saw it, but there was nothing she could do about it.\n \n \"I wouldn't call that a choice,\" she said sourly. \"I'll ship out.\"\n \n \n\n V\n \n Suzanne was proud of the apartment. It had all the modern conveniences, like the needle shower with the perfume dispenser, the built-in soft-drink bar in the library, the all-communications set, and the electrical massager. It was a nice, comfortable setup, an illusion of security in an ever-changing world.\n \n She lit a cigarette and chuckled. Mrs. Burger, the fat old landlady, thought she kept up the apartment by working as a buyer for one of the downtown stores.\n \n Well, maybe some day she would.\n \n But not today. And not tonight.\n \n The phone rang and she answered in a casual tone. She talked for a minute, then let a trace of sultriness creep into her voice. The conversation wasn't long.\n \n She let the receiver fall back on the base and went into the bedroom to get a hat box. She wouldn't need much; she'd probably be back that same night.\n \n It was a nice night and since the address was only a few blocks away, she decided to walk it. She blithely ignored the curious stares from other pedestrians, attracted by the sharp, clicking sound of her heels on the sidewalk.\n \n The address was a brownstone that looked more like an office building than anything else, but then you could never tell. She pressed the buzzer and waited a moment for the sound to echo back and forth on the inside. She pressed it again and a moment later a suave young man appeared in the doorway.\n \n \"Miss Carstens?\"\n \n She smiled pertly.\n \n \"We've been expecting you.\"\n \n She wondered a little at the \"we,\" but dutifully smiled and followed him in.\n \n The glare of the lights inside the office blinded her for a moment. When she could focus them again, her smile became slightly blurry at the edges and then disappeared entirely. She wasn't alone. There was a battery of chairs against one side of the room. She recognized most of the girls sitting in them.\n \n She forced a smile to her lips and tried to laugh.\n \n \"I'm sure there's been some mistake! Why, I never....\"\n \n The young man coughed politely. \"I'm afraid there's been no mistake. Full name, please.\"\n \n \"Suzanne Carstens,\" she said grimly, and gave the other statistics he wanted. She idly wondered what stoolie had peddled the phone numbers.\n \n \"Suzanne Carstens,\" the young man noted, and slowly shook his head.\n\"A very pretty name, but no doubt not your own. It actually doesn't matter, though. Take a seat over there.\"\n \n She did as he asked and he faced the entire group.\n \n \"I and the other gentlemen here represent the Colonization Board. We've interceded with the local authorities in order to offer you a choice. We would like to ship you out to the colony planets. Naturally, we will pay you the standard emigration bonus of five hundred dollars. The colonists need wives; they offer you—security.\"\n \n He stressed the word slightly.\n \n \"Now, of course, if you don't prefer the colony planets, you can stay behind and face the penalties of ten years in jail and a fine of ten thousand dollars.\"\n \n Suzanne felt that her lower jaw needed support. Ten thousand dollars and ten years! And in either case she'd lose the apartment she had worked so hard for, her symbol of security.\n \n \"Well, what do you say?\" There was a dead silence. The young man from the Colonization Board turned to Suzanne. \"How about you, Miss Carstens?\"\n \n She smiled sickly and nodded her head. \"I love to travel!\" she said.\n \n It didn't sound at all witty even to herself.",
      "metadata": {
        "title": "The Girls from Earth",
        "author": "Frank M. Robinson",
        "passage_id": "51268",
        "uid": "8c2b16e11112420fbe89df8ac6df7e6c",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "103",
                "uid": "d9303442052146d499959ec7d318fc29",
                "response_text": "The story starts with Karl Allen, a Second System colonist, and Joe dragging their raft from the water, hoping that they will make it in time to put their names on the list. Later we learned that the list is used to pair up the females that are coming to their colony – planet – as husbands and wives. After Karl and Joe Hill finish, they still have about two hours left before the rocket lands at Landing City. On their way towards the Landing City, Karl caught himself wondering about the trip back with a girl whom he will be paired with. Apparently, they have never seen an Earthwoman, but tales seems to cherish them as hardworking and beautiful. The speaker announces that it’s time to draw their numbers. Karl draws 53. Later, Joe and Karl agrees to meet later to see if they want to trade the girls that has their numbers. \n\nMacDonald and Claude Escher meet to discuss matters regarding the ratios between male and female at the colonies. Currently, there are not as many females on the colonized planets. From the beginning of the colonization, there were more adventuresome males than females, they headed for the new world but most of the females stayed behind. Thus, there are five females for every three males on Earth, while the colonies have more males. Thus those girls needs to be brought from their original planet, in this case the Earth, to colonies for those males there. Another problem, states MacDonald, is the number of men applying for emigration to colonized planets have been dropping. MacDonald considers this reasonable since it seems illogical for a male to move away from a place that has more females than males. Escher then disregards the qualification for colonization and decides to focus on making the people that don’t want to colonize to colonize, whether it is through convincing or forcing. \n\nPhyllis Hanson is a thirty years old woman who desires a husband. The government’s supplement offering cannot replace a husband and family. Then in her mail today, she gets a poster that tells her to come to the colonies. Though she admires the man on the poster, she thought the poster is a violation of privacy. Then we see Ruby Johnson stealing a beautiful gown from the store and then getting caught. Ruby thinks that she will simply face a small fine along with a few weeks or months in detention and that’s it. She seems to have shoplifted many times that she even knows the information that the officers want. However, to her surprised, she will be charged with a 10,000 dollar fine along with ten years in prison, or she can choose to go to a colony planet and get a five-hundred-dollar bonus. She was shocked, but chooses the latter. Similarly, Suzanne is given a similar choice between shipping out to the colony or going to jail. She also chooses the colony planet. "
              },
              {
                "worker_id": "104",
                "uid": "3612c681ff434c0d8be81edb2c40f652",
                "response_text": "Karl Allen and Joseph Hill are doing hard work on a boat and complaining about the lack of help they are receiving. After finishing her work, Karl begins to walk along a trail and thinks about the wife draft. They continue along the trail towards Landing City where they have to walk through varying crowds and navigate the muddy streets of the city. Karl and Joseph eventually see a crowd of people in front of the rocket port office and go to inspect what is causing the commotion. The familiar poster shows a beautiful woman from Earth being advertised on the poster. They hear an announcement and follow its instructions to assemble in a line with their numbers for the wife draft. \n\nThe story switches to MacDonald and Claude Escher. MacDonald enters Escher’s office and tells Escher that the departure of men from Earth to the different colonized planets has caused the ratio of women to be much higher than men, causing various issues on Earth. Escher thinks of a plan and decides that the strict qualifications for travels and need to be financially stable need to be removed. He considers using immoral methods as a solution to convince women to colonize other planets. \n\nThe story focuses on Phyliss Hanson. Phyllis finishes her job and heads to her home. She acknowledges to herself that she is not attractive while she looks at her reflection. She grows frustrated as she is 30 and longs to have a husband but she has no prospects. She receives a letter in the mail that presents an opportunity for her to solve her problem. She mails a reply to the return address in hopes of being matched with a husband. \n\nThe story then takes a look at Ruby Johnson. She sees an absolutely gorgeous gown in a store and enacts a plan to steal it. She is immediately caught by security when she steals it. She goes through the motions of the court which she has previous experience with doing. She expects a light sentence. The judge then informs her that she has 2 choices for her sentence: emigrate to a colony planet or go to jail for 10 years with a hefty fine attached. This is an example of the immoral method Escher is enacting. While shocked, she recognizes she is being played and agrees to go to a colony planet. \n\nSuzanne is the next woman-focused upon in the story. While admiring her apartment, she gets a call. Prompted by the call, she finishes getting dressed and leaves. She walks into a brownstone after being greeted by a young man. She is surprised and unhappy to see a group of women she recognizes sitting in a room. She sits down as instructed and the man addresses the room. The man presents a similar choice as the judge did to Ruby Johnson. When asked by the man, Suzanne tries to wittingly reply that she loves to travel, indicating she chooses to emigrate. \n"
              },
              {
                "worker_id": "107",
                "uid": "88462abd748748e395f1210d625e867d",
                "response_text": "Karl Allen and Joseph Hill are working with parampa logs by heaving them up the river. They discuss how much time is left before they go to Landing City and register for a number on the list. They start talking about the possibilities with their future wives, including raising a family and taking care of a garden. None of them have ever met an Earthwoman, but there are many stories about the pretty women. Once in Landing City, they go to the rocket port office and headquarters for the colonial office on Midplanet. Karl draws the number 53 and gets a few pamphlets with helpful information. He gets a sandwich and Pop from a boy before wandering back to the main field to wait for the rocket as it arrives. The story cuts to a conversation between Claude Escher and Mr. MacDonald. They discuss the growing ratio between women and men. Women are now turning to more petty crime because they believe it will help them catch a husband on Earth. They discuss more problems, especially how women do not want to colonize and men do not want to emigrate to the colonies. Once MacDonald leaves, Escher goes through the rules set up by the Board and tries to think of a better solution. The story then cuts to Phyllis Hansen, who goes to the washroom to clean up after a day at work. She then heads home and is worried about not finding a husband. There are alternatives to spending her evenings, such as bridge, gossiping, or a similar organization to fill the void. As she goes through the mail, Phyllis receives a poster advertising for women to go to the colonies to find a husband. She is offended and believes it is a violation of privacy. However, later, she writes a letter to the address on the poster. After, the story cuts to Ruby Johnson stealing a dress from a shop. She believes that the coast is clear but is caught by a detective. The male judge at the detention center asks why she stole it, but she refuses to tell him. Ruby gives out her statistics to the judge; he tells her that she can either go to the penitentiary for ten years and pay a ten thousand dollar fine or go to one of the colonies for a five-hundred-dollar immigration bonus. Ruby agrees to be shipped out. The final woman is Suzanne Carstens, who rents her apartment by tricking her old landlady into believing she works as a buyer in one of the downtown stores. She receives a call and goes to the address promptly. Once she steps inside, she realizes that most of the women sitting in the chairs in the building are ones that she recognizes. Suzanne tries to explain herself, but even her name is fake. However, she is offered to be shipped out to the colonies for security or to face jail time. With no choice, she accepts the offer. \n"
              },
              {
                "worker_id": "106",
                "uid": "d08b8153934c41018cdba8a10f0c39f2",
                "response_text": "This story takes place in multiple facets of the same storyline. In the first part of the story, we meet Karl Allen and Joseph Hill, who are on one of the planets that have been colonised by Earth. They are waiting for the arrival of a shipment of women from Earth, who will become their future brides. There are more men in the colonies than there are women, and so the government has sent these shipments of women from Earth to marry these men. \nIn the second part of the story, Mr. Macdonald and Mr. Escher of the colonisation board try to come up with a plan on how to convince women to leave Earth, to go and live on these worlds that are just beginning to become civilised, and marry men they've never met. They eventually come up with the idea that the method they use to entrap these women into their plan does not have to be technically all that moral, and they may be able to cross a legal grey area. \nIn the third part of the story, Phyllis Hanson, a woman of Earth, returns home from work. She is in her thirties, and probably destined to be alone and unmarried for the rest of her life at this stage. That is until she receives a poster from an unknown source, with a picture of a strapping man, telling her to \"come to the colonies, the planets of romance\". She sends a letter to the address at the bottom of the poster. \nRuby Johnson is caught stealing a dress from a department store. At her criminal hearing, a judge sentences her to either ten years in prison, with a ten thousand dollar fine to work off, or a chance to go to the colonies, and get a five hundred dollar bonus. \nSuzanne Carstens leaves her gorgeous apartment one night to  meet a blind date (or a John) it seems. She goes to an address that looks like an office building, where a young man greets her. She is taken into a room where she is held, along with many other women. They are all given the same ultimatum as Ruby Johnson. \nTHE END."
              }
            ]
          },
          {
            "question_text": "Describe the different expectations about women",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "103",
                "uid": "d9303442052146d499959ec7d318fc29",
                "response_text": "First, Joe takes some furs that could help cover the girl, and Joe hopes that she will appreciate it. However, Hill believes that they should give less to the girls. Because the less you give, the less they will expect, and if they are spoiled, the men has to do all the farming and family raising yourself, which is all that they have to do. Joe thought of the girl as somebody he can talk to, somebody that can help him with the farm. Hill suggests for his wife to have a garden, but Karl doesn’t think she will have the time for a garden. However, it is important to note that the girls were considered as objects since Karl and Joe mentions trading them. In particular, Earthwomen are expected to be beautiful, sophisticated, glamorous, and hardworking. Moreover, Escher is thinking about persuading and forcing the girls to colonize while forgetting about the moral codes. The governments seems to expect the women without husbands to be satisfied with bridge games and benefits and lectures. "
              },
              {
                "worker_id": "104",
                "uid": "3612c681ff434c0d8be81edb2c40f652",
                "response_text": "The few women that were on the colonized planet where Karl and Joseph lived were expected to cook the food that was being served as part of the welcoming party for the wife draft. On Earth, the expectations for women are to find a husband. Phyliss is 30 years old and details her frustration with not being married at her age, complaining that nothing else can fill the emptiness that she feels from not having a husband. "
              },
              {
                "worker_id": "107",
                "uid": "88462abd748748e395f1210d625e867d",
                "response_text": "In the story, the women are expected to find husbands. This is especially apparent on Earth, where locking down a man has become an intense competition because of the five to three ratio between women and men. Furthermore, the Earthwomen are expected to be more sophisticated, cultured, prettier, and glamorous than the colonial women. These women are also expected to fulfill the traditional roles of raising families, helping colonize the planet, and supporting their husbands with whatever they need help with. The decision to send the women to the colonies is also made by men. On the other hand, women are expected to just follow along and accept the offer if they want any chance of landing a husband at all. \n"
              },
              {
                "worker_id": "106",
                "uid": "d08b8153934c41018cdba8a10f0c39f2",
                "response_text": "There are many expectations for women both on the colonised worlds, and on Earth. On Earth, women are expected to behave in a polite, civilised manner. They are also lucky to get a man of any kind, with women outnumbering men 5 to 3, so they are expected to take what they can get. Women on the colonised worlds are expected to obey their husbands, and take care of all tasks related to life on their farms. This includes: working the farms, and raising the families. \n"
              }
            ]
          },
          {
            "question_text": "What are some odd things that happened in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "103",
                "uid": "d9303442052146d499959ec7d318fc29",
                "response_text": "Phyllis Hanson has been wanting a husband and a family for almost three years. She does not think that the bridge games and benefits and lectures can replace a husband and family. However, in her mail today, she gets a poster that tells her to come to the colonies. This is clearly a violation of her privacy. However, the man on the poster is very handsome, and she looks at it again and again. Though she admires the man on the poster, she still writes a letter reporting it. Then Ruby Johnson also goes through something strange. She steals a beautiful gown from the store and then gets caught. She knows that she will simply face a small fine along with a few weeks or months in detention because she was caught stealing dress from the . However, to her surprised, she is told that she be charged with a 10,000 dollar fine along with ten years in prison, or she can choose to go to a colony planet and get a five-hundred-dollar bonus. She is shocked, but chooses the latter. Similarly, Suzanne is given a similar choice between shipping out to the colony or going to jail after receiving a phone call telling her to get to a specific place. She also chooses the colony planet. "
              },
              {
                "worker_id": "104",
                "uid": "3612c681ff434c0d8be81edb2c40f652",
                "response_text": "MacDonald notes that because of the higher population of women on Earth than men, a lot stricter laws have been enacted. An example includes a prohibition of alcohol from being used in everyday items such as cough medicines and hair tonics. In addition, there are laws against violating a women’s privacy and a purity related moral code. An example of a privacy violation is when a woman asks Phyllis Hanson about her plans for the night. "
              },
              {
                "worker_id": "107",
                "uid": "88462abd748748e395f1210d625e867d",
                "response_text": "One of the odd things that happen in the story is the whole process of pairing up a husband and wife. The system is based on numbers as first impressions; although this seems to be an efficient way, Karl notices that there is almost no time for him and his future wife to get acquainted with one another. This is rather odd because many of them want to marry for love, yet the system caters to an arranged marriage rather than a natural relationship. Hill even brings up trading women if they are not satisfied with who they get.\n\nAnother odd occurrence in the story is how both men and women do not want to emigrate to the colonies. There are clearly more men in the colonies, yet many choose to stay on Earth because more women are there. None of the women want to go either; if they decide to leave Earth to colonize, it will be the same as giving up their luxurious, modern civilization to fight disease. \n"
              },
              {
                "worker_id": "106",
                "uid": "d08b8153934c41018cdba8a10f0c39f2",
                "response_text": "There are many odd things that happen in the story. The story itself is quite odd in form. It jumps from different times in one linear storyline, beginning at the end, and ending towards the beginning. It is also quite odd that the two men on the colonised planet think that women should be subservient, and that if you start to treat a woman with kindness and respect, and not as a servant, she will end up being spoiled. Another interesting part of the story is the nondescript place which Suzanne Carstens walks to. We are not really informed as to whether or not Ms Carstens is a prostitute, although it is insinuated. \n"
              }
            ]
          },
          {
            "question_text": "What is the setting of the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "103",
                "uid": "d9303442052146d499959ec7d318fc29",
                "response_text": "The story first sets next to the river on Midplanet. The road connecting the river to the Landing City goes from forest to grassland, multiple small trails connects to the large one, leading towards the city. The Landing City is not really that big, especially comparing to Altair. The battered shack and headquarters building appears as they reach the Landing City. There is a grassy lot next to the landing field. The landing field is decorated with bunting and welcome signs. There is a table with government pamphlets as well as tables for luncheon food. \n\nInside Mr. Eescher’s room, there is an intercom switch, some seats, and on his desk, there was also a drawer. Phyllis’ in an office that has a typewriter which is put inside a drawer. There is a washroom along with a mirror where she notices her worry lines. She owns a small two-room bachelor-girl apartment, in the bathroom there’s a mirror. She is on the sofa reading a book when she throws it across the room. There’s also a mail slot where she finds the odd poster. Rudy is in shop, and there’s a dress laying on the counter. In a courtroom in the detention building, there’s a judge and he has a ledger with him. Suzanne’s apartment has needle shower with perfume dispenser, build-in soft-drink bar in the library, as well as all-communications set and electrical massager. There is also a telephone, and her bedroom has a hat box. She arrives at a brownstone office building, there’s a buzzer and a then a young man appears in the doorway. There are bright lights inside the room, and there was a battery of chairs against one side of the room where the girls are sitting. "
              },
              {
                "worker_id": "104",
                "uid": "3612c681ff434c0d8be81edb2c40f652",
                "response_text": "The story begins with Karl and Joseph working with water and trying to tie logs together. Karl describes the ground as being thick with shadows. When they finish their work, they walk on a trail through a forest towards Landing City. Landing City is described as having rusting, steel shacks with muddy streets. When they get to Landing City, they begin to line up on the landing field that is decorated with welcome signs in anticipation for the wife draft that is going to begin soon. There are tables on the landing field filled with informational pamphlets and food. \n\nWhen the story goes to Phyllis Hanson it details her leaving work and going to her apartment. Her apartment is a small two-room p[lace. \n\nRuby’s Johnson story begins at a clothing store. She is soon taken to a court for trial after she is caught stealing. \n\nSuzanne’s story is originally set at her apartment. After receiving a call, she leaves and walks to a nearby brownstone that looks like an office building. Once in the brownstone, she is instructed to sit in a room filled with chairs where other women that she recognizes are sitting. \n"
              },
              {
                "worker_id": "107",
                "uid": "88462abd748748e395f1210d625e867d",
                "response_text": "The story begins near Landing City on Altair. There is a river in the thick forest where Hill and Karl work, while their tiny yllumphs nibble on grass in a nearby grove of trees. Landing City is a smudge of corrugated steel shacks that are rusting, muddy streets, and a small rocket port of thirty acres fenced off with barbed wire. Even the main office and headquarter is a dirty shack. The grassy field beside the landing port is decorated with huge welcome signs for the new arrivals. A table with luncheon food has also been set up. \n\nPhyllis Hansen has a typewriter on her desk and correspondence drawer at the office she works at. There is also a washroom for the ladies' to do their makeup. Her home is a two-room bachelor girl apartment, with a bathroom. The bathroom has a mirror and a shower. There is also a kitchen area to cook, a sink to do the dishes, books, and a sofa to sit on. There is a mail slot to receive mail in too. \n\nRuby Johnson's story takes place in a department store with many counters, including a lingerie one that a man and woman are in. There is also a counter from which Ruby takes the dress. Later, she is sent to the detention center and the courtroom. \n\nFinally, Suzanne Carsten's 'rented' apartment has the latest conveniences, such as a needle shower and perfume dispenser. There is also a built-in soft drink bar in the library, an all-communications set, and an electrical massager. The building that she goes to later is a brownstone one, resembling more of an office building than anything else. Inside, there is a battery of chairs on one side, where many other women are seated. "
              },
              {
                "worker_id": "106",
                "uid": "d08b8153934c41018cdba8a10f0c39f2",
                "response_text": "The story is set in many different places. The story begins on the newly colonised planet, where Karl and Joseph are in a river. They haul themselves out and make their way to the ramshackle city of the area. It is muddy and the buildings are mostly makeshift huts. \nMr. Macdonald and Mr. Escher discuss their issue in the office building of the colonisation board.\nPhyllis Hanson walks home after taking a trip to the bathroom in her office. At home, she goes into the kitchen to make dinner, gets ready for bed in the bathroom and finally curls up on the sofa to read a book. \nRuby Johnson movies from a brightly lit department store, to a courtroom in her part of the story. \nSuzanne begins her story in her comfortable apartment. It has a needle shoer that sprays perfume, a built-in soft drink bar, a library, an all communications set and a massage chair. She then walks the streets to an unusual brownstone office building, where she is taken inside, to a brightly lit room. "
              }
            ]
          },
          {
            "question_text": "What leads Escher and MacDonald’s meeting in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "103",
                "uid": "d9303442052146d499959ec7d318fc29",
                "response_text": "They are meeting because currently, there are not as many females on the colonized planets. And this is a huge problem. From the beginning of the colonization, there were more adventuresome males than females, thus they headed for the new world but most of the females stayed behind. The disproportional rate in the genders that gone to colonies lead to five females for every three males on Earth, while the colonies have the opposite. Hence, those girls needs to be shipped from their original planet, in this case the Earth, to colony planets for those males there. However, not many girls are applying to go. Another problem, states MacDonald, is the number of men applying for emigration to colonized planets have been dropping. MacDonald considers this reasonable since it seems illogical for a male to move away from a place that has more females than males. Escher then disregards the qualification for colonization and decides to focus on making the people that don’t want to colonize to colonize, whether it is through convincing or forcing. "
              },
              {
                "worker_id": "104",
                "uid": "3612c681ff434c0d8be81edb2c40f652",
                "response_text": "MacDonald and Escher meet because the Colonization Board has given MacDonald a blank check to get Escher to fix the gender ratio problem. The Colonization Board is worried about the effects that the gender ratio is having on Earth and the great psychological implications that it presents. They are concerned because it is also becoming more difficult to convince men to colonize planets because they do not want to leave Earth where they are easily favored by women due to their rarity. They have a greater advantage on Earth with their pick of women who cannot be easy picky with their choices. "
              },
              {
                "worker_id": "107",
                "uid": "88462abd748748e395f1210d625e867d",
                "response_text": "Escher and MacDonald meet to discuss the problems on Earth and how to encourage more people to immigrate to the colonies. They go over the concerning ratio between the two genders on Earth as a result of the colonization problem. Many of the men were initially eager to go into the stars, but the women did not follow as quickly. Many of the women are husbandless too, and men are refusing to emigrate to the colonies because there are so many women on Earth. Furthermore, the women who have grown husbandless have made the societies more puritanical than ever. The Colonization Board is looking for a solution to this problem, which leads MacDonald and Escher to meet. "
              },
              {
                "worker_id": "106",
                "uid": "d08b8153934c41018cdba8a10f0c39f2",
                "response_text": "Escher and MacDonald meet to discuss how to get women to come to the newly colonised planets. When the planets were first colonised, more men than women went, as they had more sense of adventure, and women didn't want to leave the luxury of Earth to go live on a makeshift farm on a muddy planet. The men on these colonised planets need wives however, and they have been given the task of finding a way to get these women on Earth over to these new planets. They try to think of a solution, and come up with one that is in a very much legal, and moral grey area. They decide to give every woman who commits a petty crime a very serious ultimatum. They can either spend ten years in jail and pay a fine of ten thousand dollars, or they can go to these colonises and get a five hundred dollar bonus. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5387,
        "document_length_chars": 30623
      }
    }
  ]
}