{
  "item_metadata": {
    "item_id": "51296",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51296",
      "content": "The Sense of Wonder\n \n \n By MILTON LESSER\n \n Illustrated by HARRY ROSENBAUM\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction September 1951. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n When nobody aboard ship remembers where it's going, how can they tell when it has arrived?\n \n \n \n Every day for a week now, Rikud had come to the viewport to watch the great changeless sweep of space. He could not quite explain the feelings within him; they were so alien, so unnatural. But ever since the engines somewhere in the rear of the world had changed their tone, from the steady whining Rikud had heard all twenty-five years of his life, to the sullen roar that came to his ears now, the feelings had grown.\n \n If anyone else had noticed the change, he failed to mention it. This disturbed Rikud, although he could not tell why. And, because he had realized this odd difference in himself, he kept it locked up inside him.\n \n Today, space looked somehow different. The stars—it was a meaningless concept to Rikud, but that was what everyone called the bright pinpoints of light on the black backdrop in the viewport—were not apparent in the speckled profusion Rikud had always known. Instead, there was more of the blackness, and one very bright star set apart by itself in the middle of the viewport.\n \n If he had understood the term, Rikud would have told himself this was odd. His head ached with the half-born thought. It was—it was—what was it?\n \n Someone was clomping up the companionway behind Rikud. He turned and greeted gray-haired old Chuls.\n \n \"In five more years,\" the older man chided, \"you'll be ready to sire children. And all you can do in the meantime is gaze out at the stars.\"\n \n Rikud knew he should be exercising now, or bathing in the rays of the health-lamps. It had never occurred to him that he didn't feel like it; he just didn't, without comprehending.\n \n Chuls' reminder fostered uneasiness. Often Rikud had dreamed of the time he would be thirty and a father. Whom would the Calculator select as his mate? The first time this idea had occurred to him, Rikud ignored it. But it came again, and each time it left him with a feeling he could not explain. Why should he think thoughts that no other man had? Why should he think he was thinking such thoughts, when it always embroiled him in a hopeless, infinite confusion that left him with a headache?\n \n Chuls said, \"It is time for my bath in the health-rays. I saw you here and knew it was your time, too....\"\n \n His voice trailed off. Rikud knew that something which he could not explain had entered the elder man's head for a moment, but it had departed almost before Chuls knew of its existence.\n \n \"I'll go with you,\" Rikud told him.\n \n \n\n \n A hardly perceptible purple glow pervaded the air in the room of the health-rays. Perhaps two score men lay about, naked, under the ray tubes. Chuls stripped himself and selected the space under a vacant tube. Rikud, for his part, wanted to get back to the viewport and watch the one new bright star. He had the distinct notion it was growing larger every moment. He turned to go, but the door clicked shut and a metallic voice said. \"Fifteen minutes under the tubes, please.\"\n \n Rikud muttered to himself and undressed. The world had begun to annoy him. Now why shouldn't a man be permitted to do what he wanted, when he wanted to do it? There was a strange thought, and Rikud's brain whirled once more down the tortuous course of half-formed questions and unsatisfactory answers.\n \n He had even wondered what it was like to get hurt. No one ever got hurt. Once, here in this same ray room, he had had the impulse to hurl himself head-first against the wall, just to see what would happen. But something soft had cushioned the impact—something which had come into being just for the moment and then abruptly passed into non-being again, something which was as impalpable as air.\n \n Rikud had been stopped in this action, although there was no real authority to stop him. This puzzled him, because somehow he felt that there should have been authority. A long time ago the reading machine in the library had told him of the elders—a meaningless term—who had governed the world. They told you to do something and you did it, but that was silly, because now no one told you to do anything. You only listened to the buzzer.\n \n And Rikud could remember the rest of what the reading machine had said. There had been a revolt—again a term without any real meaning, a term that could have no reality outside of the reading machine—and the elders were overthrown. Here Rikud had been lost utterly. The people had decided that they did not know where they were going, or why, and that it was unfair that the elders alone had this authority. They were born and they lived and they died as the elders directed, like little cogs in a great machine. Much of this Rikud could not understand, but he knew enough to realize that the reading machine had sided with the people against the elders, and it said the people had won.\n \n Now in the health room, Rikud felt a warmth in the rays. Grudgingly, he had to admit to himself that it was not unpleasant. He could see the look of easy contentment on Chuls' face as the rays fanned down upon him, bathing his old body in a forgotten magic which, many generations before Rikud's time, had negated the necessity for a knowledge of medicine. But when, in another ten years, Chuls would perish of old age, the rays would no longer suffice. Nothing would, for Chuls. Rikud often thought of his own death, still seventy-five years in the future, not without a sense of alarm. Yet old Chuls seemed heedless, with only a decade to go.\n \n Under the tube at Rikud's left lay Crifer. The man was short and heavy through the shoulders and chest, and he had a lame foot. Every time Rikud looked at that foot, it was with a sense of satisfaction. True, this was the only case of its kind, the exception to the rule, but it proved the world was not perfect. Rikud was guiltily glad when he saw Crifer limp.\n \n But, if anyone else saw it, he never said a word. Not even Crifer.\n \n \n\n \n Now Crifer said, \"I've been reading again, Rikud.\"\n \n \"Yes?\" Almost no one read any more, and the library was heavy with the smell of dust. Reading represented initiative on the part of Crifer; it meant that, in the two unoccupied hours before sleep, he went to the library and listened to the reading machine. Everyone else simply sat about and talked. That was the custom. Everyone did it.\n \n But if he wasn't reading himself, Rikud usually went to sleep. All the people ever talked about was what they had done during the day, and it was always the same.\n \n \"Yes,\" said Crifer. \"I found a book about the stars. They're also called astronomy, I think.\"\n \n This was a new thought to Rikud, and he propped his head up on one elbow. \"What did you find out?\"\n \n \"That's about all. They're just called astronomy, I think.\"\n \n \"Well, where's the book?\" Rikud would read it tomorrow.\n \n \"I left it in the library. You can find several of them under\n'astronomy,' with a cross-reference under 'stars.' They're synonymous terms.\"\n \n \"You know,\" Rikud said, sitting up now, \"the stars in the viewport are changing.\"\n \n \"Changing?\" Crifer questioned the fuzzy concept as much as he questioned what it might mean in this particular case.\n \n \"Yes, there are less of them, and one is bigger and brighter than the others.\"\n \n \"Astronomy says some stars are variable,\" Crifer offered, but Rikud knew his lame-footed companion understood the word no better than he did.\n \n Over on Rikud's right, Chuls began to dress. \"Variability,\" he told them, \"is a contradictory term. Nothing is variable. It can't be.\"\n \n \"I'm only saying what I read in the book,\" Crifer protested mildly.\n \n \"Well, it's wrong. Variability and change are two words without meaning.\"\n \n \"People grow old,\" Rikud suggested.\n \n A buzzer signified that his fifteen minutes under the rays were up, and Chuls said, \"It's almost time for me to eat.\"\n \n Rikud frowned. Chuls hadn't even seen the connection between the two concepts, yet it was so clear. Or was it? He had had it a moment ago, but now it faded, and change and old were just two words.\n \n His own buzzer sounded a moment later, and it was with a strange feeling of elation that he dressed and made his way back to the viewport. When he passed the door which led to the women's half of the world, however, he paused. He wanted to open that door and see a woman. He had been told about them and he had seen pictures, and he dimly remembered his childhood among women. But his feelings had changed; this was different. Again there were inexplicable feelings—strange channelings of Rikud's energy in new and confusing directions.\n \n He shrugged and reserved the thought for later. He wanted to see the stars again.\n \n \n\n \n The view had changed, and the strangeness of it made Rikud's pulses leap with excitement. All the stars were paler now than before, and where Rikud had seen the one bright central star, he now saw a globe of light, white with a tinge of blue in it, and so bright that it hurt his eyes to look.\n \n Yes, hurt! Rikud looked and looked until his eyes teared and he had to turn away. Here was an unknown factor which the perfect world failed to control. But how could a star change into a blinking blue-white globe—if, indeed, that was the star Rikud had seen earlier? There was that word change again. Didn't it have something to do with age? Rikud couldn't remember, and he suddenly wished he could read Crifer's book on astronomy, which meant the same as stars. Except that it was variable, which was like change, being tied up somehow with age.\n \n Presently Rikud became aware that his eyes were not tearing any longer, and he turned to look at the viewport. What he saw now was so new that he couldn't at first accept it. Instead, he blinked and rubbed his eyes, sure that the ball of blue-white fire somehow had damaged them. But the new view persisted.\n \n Of stars there were few, and of the blackness, almost nothing. Gone, too, was the burning globe. Something loomed there in the port, so huge that it spread out over almost the entire surface. Something big and round, all grays and greens and browns, and something for which Rikud had no name.\n \n A few moments more, and Rikud no longer could see the sphere. A section of it had expanded outward and assumed the rectangular shape of the viewport, and its size as well. It seemed neatly sheered down the middle, so that on one side Rikud saw an expanse of brown and green, and on the other, blue.\n \n Startled, Rikud leaped back. The sullen roar in the rear of the world had ceased abruptly. Instead an ominous silence, broken at regular intervals by a sharp booming.\n \n Change—\n \n \"Won't you eat, Rikud?\" Chuls called from somewhere down below.\n \n \"Damn the man,\" Rikud thought. Then aloud: \"Yes, I'll eat. Later.\"\n \n \"It's time....\" Chuls' voice trailed off again, impotently.\n \n But Rikud forgot the old man completely. A new idea occurred to him, and for a while he struggled with it. What he saw—what he had always seen, except that now there was the added factor of change—perhaps did not exist in the viewport.\n \n Maybe it existed through the viewport.\n \n That was maddening. Rikud turned again to the port, where he could see nothing but an obscuring cloud of white vapor, murky, swirling, more confusing than ever.\n \n \"Chuls,\" he called, remembering, \"come here.\"\n \n \"I am here,\" said a voice at his elbow.\n \n Rikud whirled on the little figure and pointed to the swirling cloud of vapor. \"What do you see?\"\n \n Chuls looked. \"The viewport, of course.\"\n \n \"What else?\"\n \n \"Else? Nothing.\"\n \n Anger welled up inside Rikud. \"All right,\" he said, \"listen. What do you hear?\"\n \n \"Broom, brroom, brrroom!\" Chuls imitated the intermittent blasting of the engines. \"I'm hungry, Rikud.\"\n \n The old man turned and strode off down the corridor toward the dining room, and Rikud was glad to be alone once more.\n \n \n\n \n Now the vapor had departed, except for a few tenuous whisps. For a moment Rikud thought he could see the gardens rearward in the world. But that was silly. What were the gardens doing in the viewport? And besides, Rikud had the distinct feeling that here was something far vaster than the gardens, although all of it existed in the viewport which was no wider than the length of his body. The gardens, moreover, did not jump and dance before his eyes the way the viewport gardens did. Nor did they spin. Nor did the trees grow larger with every jolt.\n \n Rikud sat down hard. He blinked.\n \n The world had come to rest on the garden of the viewport.\n \n \n\n \n For a whole week that view did not change, and Rikud had come to accept it as fact. There—through the viewport and in it—was a garden. A garden larger than the entire world, a garden of plants which Rikud had never seen before, although he had always liked to stroll through the world's garden and he had come to know every plant well. Nevertheless, it was a garden.\n \n He told Chuls, but Chuls had responded, \"It is the viewport.\"\n \n Crifer, on the other hand, wasn't so sure. \"It looks like the garden,\" he admitted to Rikud. \"But why should the garden be in the viewport?\"\n \n Somehow, Rikud knew this question for a healthy sign. But he could not tell them of his most amazing thought of all. The change in the viewport could mean only one thing. The world had been walking—the word seemed all wrong to Rikud, but he could think of no other, unless it were running. The world had been walking somewhere. That somewhere was the garden and the world had arrived.\n \n \"It is an old picture of the garden,\" Chuls suggested, \"and the plants are different.\"\n \n \"Then they've changed?\"\n \n \"No, merely different.\"\n \n \"Well, what about the viewport? It changed. Where are the stars? Where are they, Chuls, if it did not change?\"\n \n \"The stars come out at night.\"\n \n \"So there is a change from day to night!\"\n \n \"I didn't say that. The stars simply shine at night. Why should they shine during the day when the world wants them to shine only at night?\"\n \n \"Once they shone all the time.\"\n \n \"Naturally,\" said Crifer, becoming interested. \"They are variable.\"\n \n \n\n \n Rikud regretted that he never had had the chance to read that book on astronomy. He hadn't been reading too much lately. The voice of the reading machine had begun to bore him. He said, \"Well, variable or not, our whole perspective has changed.\"\n \n And when Chuls looked away in disinterest, Rikud became angry. If only the man would realize! If only anyone would realize! It all seemed so obvious. If he, Rikud, walked from one part of the world to another, it was with a purpose—to eat, or to sleep, or perhaps to bathe in the health-rays. Now if the world had walked from—somewhere, through the vast star-speckled darkness and to the great garden outside, this also was purposeful. The world had arrived at the garden for a reason. But if everyone lived as if the world still stood in blackness, how could they find the nature of that purpose?\n \n \"I will eat,\" Chuls said, breaking Rikud's revery.\n \n Damn the man, all he did was eat!\n \n Yet he did have initiative after a sort. He knew when to eat. Because he was hungry.\n \n And Rikud, too, was hungry.\n \n Differently.\n \n \n\n \n He had long wondered about the door in the back of the library, and now, as Crifer sat cross-legged on one of the dusty tables, reading machine and book on astronomy or stars in his lap, Rikud approached the door.\n \n \"What's in here?\" he demanded.\n \n \"It's a door, I think,\" said Crifer.\n \n \"I know, but what's beyond it?\"\n \n \"Beyond it? Oh, you mean through the door.\"\n \n \"Yes.\"\n \n \"Well,\" Crifer scratched his head, \"I don't think anyone ever opened it. It's only a door.\"\n \n \"I will,\" said Rikud.\n \n \"You will what?\"\n \n \"Open it. Open the door and look inside.\"\n \n A long pause. Then, \"Can you do it?\"\n \n \"I think so.\"\n \n \"You can't, probably. How can anyone go where no one has been before? There's nothing. It just isn't. It's only a door, Rikud.\"\n \n \"No—\" Rikud began, but the words faded off into a sharp intake of breath. Rikud had turned the knob and pushed. The door opened silently, and Crifer said, \"Doors are variable, too, I think.\"\n \n Rikud saw a small room, perhaps half a dozen paces across, at the other end of which was another door, just like the first. Halfway across, Rikud heard a voice not unlike that of the reading machine.\n \n He missed the beginning, but then:\n  —therefore, permit no unauthorized persons to go through this door. The machinery in the next room is your protection against the rigors of space. A thousand years from now, journey's end, you may have discarded it for something better—who knows? But if you have not, then here is your protection. As nearly as possible, this ship is a perfect, self-sustaining world. It is more than that: it is human-sustaining as well. Try to hurt yourself and the ship will not permit it—within limits, of course. But you can damage the ship, and to avoid any possibility of that, no unauthorized persons are to be permitted through this door—\n \n \n Rikud gave the voice up as hopeless. There were too many confusing words. What in the world was an unauthorized person? More interesting than that, however, was the second door. Would it lead to another voice? Rikud hoped that it wouldn't.\n \n When he opened the door a strange new noise filled his ears, a gentle humming, punctuated by a throb-throb-throb which sounded not unlike the booming of the engines last week, except that this new sound didn't blast nearly so loudly against his eardrums. And what met Rikud's eyes—he blinked and looked again, but it was still there—cogs and gears and wheels and nameless things all strange and beautiful because they shone with a luster unfamiliar to him.\n \n \"Odd,\" Rikud said aloud. Then he thought, \"Now there's a good word, but no one quite seems to know its meaning.\"\n \n Odder still was the third door. Rikud suddenly thought there might exist an endless succession of them, especially when the third one opened on a bare tunnel which led to yet another door.\n \n Only this one was different. In it Rikud saw the viewport. But how? The viewport stood on the other end of the world. It did seem smaller, and, although it looked out on the garden, Rikud sensed that the topography was different. Then the garden extended even farther than he had thought. It was endless, extending all the way to a ridge of mounds way off in the distance.\n \n And this door one could walk through, into the garden. Rikud put his hand on the door, all the while watching the garden through the new viewport. He began to turn the handle.\n \n Then he trembled.\n \n What would he do out in the garden?\n \n He couldn't go alone. He'd die of the strangeness. It was a silly thought; no one ever died of anything until he was a hundred. Rikud couldn't fathom the rapid thumping of his heart. And Rikud's mouth felt dry; he wanted to swallow, but couldn't.\n \n Slowly, he took his hand off the door lever. He made his way back through the tunnel and then through the room of machinery and finally through the little room with the confusing voice to Crifer.\n \n By the time he reached the lame-footed man, Rikud was running. He did not dare once to look back. He stood shaking at Crifer's side, and sweat covered him in a clammy film. He never wanted to look at the garden again. Not when he knew there was a door through which he could walk and then might find himself in the garden.\n \n It was so big.\n \n \n\n \n Three or four days passed before Rikud calmed himself enough to talk about his experience. When he did, only Crifer seemed at all interested, yet the lame-footed man's mind was inadequate to cope with the situation. He suggested that the viewport might also be variable and Rikud found himself wishing that his friend had never read that book on astronomy.\n \n Chuls did not believe Rikud at all. \"There are not that many doors in the world,\" he said. \"The library has a door and there is a door to the women's quarters; in five years, the Calculator will send you through that. But there are no others.\"\n \n Chuls smiled an indulgent smile and Rikud came nearer to him. \"Now, by the world, there are two other doors!\"\n \n Rikud began to shout, and everyone looked at him queerly.\n \n \"What are you doing that for?\" demanded Wilm, who was shorter even than Crifer, but had no lame foot.\n \n \"Doing what?\"\n \n \"Speaking so loudly when Chuls, who is close, obviously has no trouble hearing you.\"\n \n \"Maybe yelling will make him understand.\"\n \n Crifer hobbled about on his good foot, doing a meaningless little jig.\n\"Why don't we go see?\" he suggested. Then, confused, he frowned.\n \n \"Well, I won't go,\" Chuls replied. \"There's no reason to go. If Rikud has been imagining things, why should I?\"\n \n \"I imagined nothing. I'll show you—\"\n \n \"You'll show me nothing because I won't go.\"\n \n Rikud grabbed Chuls' blouse with his big fist. Then, startled by what he did, his hands began to tremble. But he held on, and he tugged at the blouse.\n \n \"Stop that,\" said the older man, mildly.\n \n \n\n \n Crifer hopped up and down. \"Look what Rikud's doing! I don't know what he's doing, but look. He's holding Chuls' blouse.\"\n \n \"Stop that,\" repeated Chuls, his face reddening.\n \n \"Only if you'll go with me.\" Rikud was panting.\n \n Chuls tugged at his wrist. By this time a crowd had gathered. Some of them watched Crifer jump up and down, but most of them watched Rikud holding Chuls' blouse.\n \n \"I think I can do that,\" declared Wilm, clutching a fistful of Crifer's shirt.\n \n Presently, the members of the crowd had pretty well paired off, each partner grabbing for his companion's blouse. They giggled and laughed and some began to hop up and down as Crifer had done.\n \n A buzzer sounded and automatically Rikud found himself releasing Chuls.\n \n Chuls said, forgetting the incident completely, \"Time to retire.\"\n \n In a moment, the room was cleared. Rikud stood alone. He cleared his throat and listened to the sound, all by itself in the stillness. What would have happened if they hadn't retired? But they always did things punctually like that, whenever the buzzer sounded. They ate with the buzzer, bathed in the health-rays with it, slept with it.\n \n What would they do if the buzzer stopped buzzing?\n \n This frightened Rikud, although he didn't know why. He'd like it, though. Maybe then he could take them outside with him to the big garden of the two viewports. And then he wouldn't be afraid because he could huddle close to them and he wouldn't be alone.\n \n \n\n \n Rikud heard the throbbing again as he stood in the room of the machinery. For a long time he watched the wheels and cogs and gears spinning and humming. He watched for he knew not how long. And then he began to wonder. If he destroyed the wheels and the cogs and the gears, would the buzzer stop? It probably would, because, as Rikud saw it, he was clearly an \"unauthorized person.\" He had heard the voice again upon entering the room.\n \n He found a metal rod, bright and shiny, three feet long and half as wide as his arm. He tugged at it and it came loose from the wires that held it in place. He hefted it carefully for a moment, and then he swung the bar into the mass of metal. Each time he heard a grinding, crashing sound. He looked as the gears and cogs and wheels crumbled under his blows, shattered by the strength of his arm.\n \n \n\n \n Almost casually he strode about the room, but his blows were not casual. Soon his easy strides had given way to frenzied running. Rikud smashed everything in sight.\n \n When the lights winked out, he stopped. Anyway, by that time the room was a shambles of twisted, broken metal. He laughed, softly at first, but presently he was roaring, and the sound doubled and redoubled in his ears because now the throbbing had stopped.\n \n He opened the door and ran through the little corridor to the smaller viewport. Outside he could see the stars, and, dimly, the terrain beneath them. But everything was so dark that only the stars shone clearly. All else was bathed in a shadow of unreality.\n \n Rikud never wanted to do anything more than he wanted to open that door. But his hands trembled too much when he touched it, and once, when he pressed his face close against the viewport, there in the darkness, something bright flashed briefly through the sky and was gone.\n \n Whimpering, he fled.\n \n \n\n \n All around Rikud were darkness and hunger and thirst. The buzzer did not sound because Rikud had silenced it forever. And no one went to eat or drink. Rikud himself had fumbled through the blackness and the whimpering to the dining room, his tongue dry and swollen, but the smooth belt that flowed with water and with savory dishes did not run any more. The machinery, Rikud realized, also was responsible for food.\n \n Chuls said, over and over, \"I'm hungry.\"\n \n \"We will eat and we will drink when the buzzer tells us,\" Wilm replied confidently.\n \n \"It won't any more,\" Rikud said.\n \n \"What won't?\"\n \n \"The buzzer will never sound again. I broke it.\"\n \n Crifer growled. \"I know. You shouldn't have done it. That was a bad thing you did, Rikud.\"\n \n \"It was not bad. The world has moved through the blackness and the stars and now we should go outside to live in the big garden there beyond the viewport.\"\n \n \"That's ridiculous,\" Chuls said.\n \n Even Crifer now was angry at Rikud. \"He broke the buzzer and no one can eat. I hate Rikud, I think.\"\n \n There was a lot of noise in the darkness, and someone else said, \"I hate Rikud.\" Then everyone was saying it.\n \n Rikud was sad. Soon he would die, because no one would go outside with him and he could not go outside alone. In five more years he would have had a woman, too. He wondered if it was dark and hungry in the women's quarters. Did women eat?\n \n Perhaps they ate plants. Once, in the garden, Rikud had broken off a frond and tasted it. It had been bitter, but not unpleasant. Maybe the plants in the viewport would even be better.\n \n \"We will not be hungry if we go outside,\" he said. \"We can eat there.\"\n \n \"We can eat if the buzzer sounds, but it is broken,\" Chuls said dully.\n \n Crifer shrilled, \"Maybe it is only variable and will buzz again.\"\n \n \"No,\" Rikud assured him. \"It won't.\"\n \n \"Then you broke it and I hate you,\" said Crifer. \"We should break you, too, to show you how it is to be broken.\"\n \n \"We must go outside—through the viewport.\" Rikud listened to the odd gurgling sound his stomach made.\n \n A hand reached out in the darkness and grabbed at his head. He heard Crifer's voice. \"I have Rikud's head.\" The voice was nasty, hostile.\n \n Crifer, more than anyone, had been his friend. But now that he had broken the machinery, Crifer was his enemy, because Crifer came nearer to understanding the situation than anyone except Rikud.\n \n The hand reached out again, and it struck Rikud hard across the face.\n\"I hit him! I hit him!\"\n \n Other hands reached out, and Rikud stumbled. He fell and then someone was on top of him, and he struggled. He rolled and was up again, and he did not like the sound of the angry voices. Someone said, \"Let us do to Rikud what he said he did to the machinery.\" Rikud ran. In the darkness, his feet prodded many bodies. There were those who were too weak to rise. Rikud, too, felt a strange light-headedness and a gnawing hurt in his stomach. But it didn't matter. He heard the angry voices and the feet pounding behind him, and he wanted only to get away.\n \n It was dark and he was hungry and everyone who was strong enough to run was chasing him, but every time he thought of the garden outside, and how big it was, the darkness and the hunger and the people chasing him were unimportant. It was so big that it would swallow him up completely and positively.\n \n He became sickly giddy thinking about it.\n \n But if he didn't open the door and go into the garden outside, he would die because he had no food and no water and his stomach gurgled and grumbled and hurt. And everyone was chasing him.\n \n He stumbled through the darkness and felt his way back to the library, through the inner door and into the room with the voice—but the voice didn't speak this time—through its door and into the place of machinery. Behind him, he could hear the voices at the first door, and he thought for a moment that no one would come after him. But he heard Crifer yell something, and then feet pounding in the passage.\n \n Rikud tripped over something and sprawled awkwardly across the floor. He felt a sharp hurt in his head, and when he reached up to touch it with his hands there in the darkness, his fingers came away wet.\n \n He got up slowly and opened the next door. The voices behind him were closer now. Light streamed in through the viewport. After the darkness, it frightened Rikud and it made his eyes smart, and he could hear those behind him retreating to a safe distance. But their voices were not far away, and he knew they would come after him because they wanted to break him.\n \n Rikud looked out upon the garden and he trembled. Out there was life. The garden stretched off in unthinkable immensity to the cluster of low mounds against the bright blue which roofed the many plants. If plants could live out there as they did within the world, then so could people. Rikud and his people should . This was why the world had moved across the darkness and the stars for all Rikud's lifetime and more. But he was afraid.\n \n He reached up and grasped the handle of the door and he saw that his fingers were red with the wetness which had come from his hurt head. Slowly he slipped to the cool floor—how his head was burning!—and for a long time he lay there, thinking he would never rise again. Inside he heard the voices again, and soon a foot and then another pounded on the metal of the passage. He heard Crifer's voice louder than the rest:\n\"There is Rikud on the floor!\"\n \n Tugging at the handle of the door, Rikud pulled himself upright. Something small and brown scurried across the other side of the viewport and Rikud imagined it turned to look at him with two hideous red eyes.\n \n Rikud screamed and hurtled back through the corridor, and his face was so terrible in the light streaming in through the viewport that everyone fled before him. He stumbled again in the place of the machinery, and down on his hands and knees he fondled the bits of metal which he could see in the dim light through the open door.\n \n \"Where's the buzzer?\" he sobbed. \"I must find the buzzer.\"\n \n Crifer's voice, from the darkness inside, said, \"You broke it. You broke it. And now we will break you—\"\n \n Rikud got up and ran. He reached the door again and then he slipped down against it, exhausted. Behind him, the voices and the footsteps came, and soon he saw Crifer's head peer in through the passageway. Then there were others, and then they were walking toward him.\n \n His head whirled and the viewport seemed to swim in a haze. Could it be variable, as Crifer had suggested? He wondered if the scurrying brown thing waited somewhere, and nausea struck at the pit of his stomach. But if the plants could live out there and the scurrying thing could live and that was why the world had moved through the blackness, then so could he live out there, and Crifer and all the others....\n \n So tightly did he grip the handle that his fingers began to hurt. And his heart pounded hard and he felt the pulses leaping on either side of his neck.\n \n He stared out into the garden, and off into the distance, where the blue-white globe which might have been a star stood just above the row of mounds.\n \n \n\n \n Crifer was tugging at him, trying to pull him away from the door, and someone was grabbing at his legs, trying to make him fall. He kicked out and the hands let go, and then he turned the handle and shoved the weight of his body with all his strength against the door.\n \n It opened and he stepped outside into the warmth.\n \n The air was fresh, fresher than any air Rikud had ever breathed. He walked around aimlessly, touching the plants and bending down to feel the floor, and sometimes he looked at the blue-white globe on the horizon. It was all very beautiful.\n \n Near the ship, water that did not come from a machine gurgled across the land, and Rikud lay down and drank. It was cool and good, and when he got up, Crifer and Wilm were outside the world, and some of the others followed. They stood around for a long time before going to the water to drink.\n \n \n\n \n Rikud sat down and tore off a piece of a plant, munching on it. It was good.\n \n Crifer picked his head up, from the water, his chin wet. \"Even feelings are variable. I don't hate you now, Rikud.\"\n \n Rikud smiled, staring at the ship. \"People are variable, too, Crifer. That is, if those creatures coming from the ship are people.\"\n \n \"They're women,\" said Crifer.\n \n They were strangely shaped in some ways, and yet in others completely human, and their voices were high, like singing. Rikud found them oddly exciting. He liked them. He liked the garden, for all its hugeness. With so many people, and especially now with women, he was not afraid.\n \n It was much better than the small world of machinery, buzzer, frightening doors and women by appointment only.\n \n Rikud felt at home.",
      "metadata": {
        "title": "The Sense of Wonder",
        "author": "Milton Lesser",
        "passage_id": "51296",
        "uid": "4caa0cdf23444c0c864a679fa01c1ec6",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "111",
                "uid": "f79f2525868d40058315766e1347c0da",
                "response_text": "The story starts off with the main character, Rikud, watching space from a viewport that is located on what seems to be a spaceship. Rikud is part of a group of men that live on the spaceship under a strict set of unspoken rules. Rikud then connects with other characters named Chuls and Crifer while getting a bath of health-rays, an example of the high technology in the ship. After the stars in the viewport start changing, Rikud doubts the way of living that the men have taken. He starts to doubt the fact that they have a set span of years, and that they have to live separately from the women (even though he doesn't know what women are). When the view of the viewport changes to “gardens”, Rikud begins to question more and more, and ends up finding the machine room for the ship, as well as a control center that has another viewport. Unsuccessfully convincing the others to go outside with him, Rikud becomes enraged and breaks the machine room of the ship. After realizing that Rikud has messed up the buzzers that control the actions of the people, they begin to hurt Rikud and chase him through the ship. Rikud ends up opening the door that leads outside from the control room, and they discover a new world where they can live freely with the women. \n"
              },
              {
                "worker_id": "107",
                "uid": "1a3867c95d414d3db23ee190dc35f2bc",
                "response_text": "Rikud has come to watch the great changeless sweep of space for a week. The steady whining of the world that he has heard for all twenty-five years of his life have grown. Space looks different to him today because the stars are not as bright, and there is more darkness except for one very bright star that has set itself apart. Old Chuls approaches him and chides him for staring at stars when he is almost ready to foster children in five years. Rikud is nervous because no other man has these thoughts about who the Calculator will select as their mate. Chuls says that it is time for his bath in the health-rays, and Rikud goes with him. When they get to the health-ray area, Rikud feels the urge to see the stars again. The machine tells him fifteen minutes under the tub. Crifer, who is in the tube on his left, brings satisfaction to Rikud through his lame foot because it is proof that the world is not perfect. Crifer tells Rikud that he has been reading about astronomy lately in the library and stars. When Rikud tells him that the stars are changing, Crifer offers that variability may contribute. He later goes to see the stars again, observing how they make his eyes hurt and are paler than before. Rikud then sees a new shape appear in the form of a big sphere. He tries to get Chuls to see it too when the old man tells him it is time to eat, but Chuls sees and hears nothing. After a while, Rikud becomes fascinated with the gardens in the viewport. The view does not change for an entire week, and Crifer also agrees that the view looks like a garden. When he brings the conversation back to the stars appearing and disappearing, Crifer once again brings up variable. Rikud believes he has a bigger purpose in life; he decides to investigate the door at the back of the library while Crifer reads another book on astronomy. He sees another door that explains how this ship is a self-sustaining world, but Rikud cannot understand the words. He then has a traumatizing experience about going out to the garden because it is completely foreign to him. Three or four days later, Rikud feels comfortable enough to tell Crifer about what happened. He tries to convince Chuls too and grabs his blouse. Others in the crowd copy Rikud grabbing Chul’s blouse, but a buzzer goes off and it is time for them to retire. Rikud then decides to break the buzzer, and everybody hates him. Nobody wants to go out with him, and they all decide to begin attacking him for breaking the buzzer. He tries to escape them, and all of them end up going into the garden. The story cuts to them realizing how beautiful it is outside, and the women begin to appear from the ship as well. "
              },
              {
                "worker_id": "109",
                "uid": "3dcac22cb29343ca9815678547bef0dc",
                "response_text": "This story follows Rikud who lives aboard a ship that is self-sustaining and separated by men and women. He first encounters a unique feeling when he looks through the viewport and notices that the space around him has changed. The stars in particular, previously speckled and scattered, have now been replaced by a singular bright star. \n\nWhile undergoing his bath in the health rays, Rikud laments his life on the ship. Noting the lack of authority - the closest being the automated buzzer - he ponders the perfectness of life around him and realizes he is assured by Crifer’s limp because it demonstrated that not everything was perfect. When talking to him, Crifer reveals that he has begun reading again in lieu of the normal evening activity of chatting to other ship passengers. In return, Rikud reveals that the stars in the viewport are changing and Crifer suggests that it may be due to variability - a concept newly introduced in his book on astronomy. While Rikud and Crifer contemplate the meaning of variability and the connection between the concepts, Chuls interrupts by denouncing variability as a contradictory term. Once the buzzer sounds again, they all continue with their daily routine. \n\nAs Rikud looks again at the star, he finds that the landscape has changed to reveal a sphere with brown and green, just like the garden aboard the ship. Despite the hesitant acknowledgment and adamant denial from Crifer and Chuls respectively, they are unable to explain why the garden is in the viewpoint. Continuing with his exploration, Rikud enters through a set of doors no man has gone through. As he enters through each door, he receives warnings from the buzzer and encounters stranger noises. By the time he attempts to reach the third, Rikud is overwhelmed with a sense of fear and runs back. In explaining his discovery, Rikud begins to hold Chul’s blouse and sets off a chain of reactions with the other men as they begin to mimic his unfamiliar but exciting activity. However, once the buzzer sounds again, the men forget their behavior. Frustrated with the buzzing, Rikud finds a metal rod and smashes all the machinery on board - destroying the buzzer and the machines that provided the ship with light, food, and water. Disrupted by their routine and lifeline to the buzzer, Crifer and the other men begin to riot against Rikud, chasing and beating him. In running away from them, Rikud finds himself at the third door and while uncertain about the potential of life beyond the door, he chooses to open it to reveal the garden and the blue-white globe. \n\nThrough the door reveals fresh air, plants, and running water. Rikud and the others step out and bask in this strange but comforting new landscape, and as the women on the ship stepped off as well, Rikud noted a sense of contentedness in a world away from the buzzer and the machines.\n"
              },
              {
                "worker_id": "113",
                "uid": "cea70479b2c3463b90fdc5b5c98c4c16",
                "response_text": "The story talks about a distant future where people left Earth long ago and now are living on a spaceship that is traveling through space. The ship is divided into two parts: male and female. People of two different sexes meet when they turn 30 after the so-called calculator defines their future partner.  Everyone on the ship lives by the buzzer - a sound that signifies the beginning or the end of any daily activity. They do not understand the concepts of change, world, space, authority, just living with the same schedule. They do not understand sickness since now they can take a bath in the health rays that provide them with immunity. \n\nRikud is a 25-year-old inhabitant who enjoys looking at the viewport that shows the changing stars. Sometimes he chats with Chuls, a 90-year-old fellow inhabitant of the ship, who doesn't show any traits of nonconformity and is satisfied with his regulated schedule. We meet him at the very beginning when he joins Rikud who stands near the viewport gazing at the stars. Together they go to the health rays’ room. While waiting for the procedure to be over, Rikud thinks about different arbitrary notions, like authority, history, human will. In the same room lies Crifer, another inhabitant of the ship. He’s short and has a lame foot which reminds Rikud of the world’s imperfection. Crifer says that he found an interesting book about astronomy during his visit to the reading room. Rikud says that stars may be changing and Crifer claims that the book mentioned their variability, Chuls protests but their conversation ends quickly. Later, Rikud, during his visits to the viewport,  witnesses a rapid change in the stars, their form, location, and even experiences a novel feeling of pain while looking at one of them without breaks. Amazed, Rikud stands there and asks Chuls about the differences in the viewport and in the sound of the engines, which, as Rikud noticed, had become quieter, but the old man gives an unsatisfying answer. Later, apparently after landing, Rikud sees a huge garden in the viewport and this image doesn’t change for a whole week. \n\nWhile visiting the reading room with Crifer, Rikud decides to open the door that he finds there. It leads to a room where he hears a voice saying something about unauthorized visitors. The next room is full of wires, gears, and cogs. The third one has a small viewport showing the same garden from a different side. When no one believes him later, infuriated, Rikud comes back and destroys the wired room, which he suspects to be the buzzer. Now it doesn’t go off and the food mechanism is not working, leaving the ship's inhabitants confused and hungry. They become angry and try to chase Rikud. The sense of danger forces Rikud to open the little viewport from the third room and finally leave the ship. Everybody goes out into the world and finally sees the garden.\n"
              }
            ]
          },
          {
            "question_text": "What is the setting of the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "111",
                "uid": "f79f2525868d40058315766e1347c0da",
                "response_text": "The story is located in space, inside of a large spaceship. The ship has a viewport that looks outside of the ship, and is where Rikad spends most of his time. The ship also seems to have high tech, showcased in the med room. Here is where the men go to stay healthy by being showered under health rays. The ship also has a library, which is where Crifer and Rikud read about astronomy and stars, and where Rikud started to doubt more and more about their lifestyle. The ship then arrives at a planet, full of lush greenery, making Rikud more and more suspicious of the changing view. After exploring the back of the room Rikud finds a series of rooms. These rooms include both a machinery room that is full of gears and tubes as well as a control room that has a smaller viewport. The story ends in the new planet, after Rikud opened the door that led outside, knowing that they would be able to survive after he compared the new planet to the gardens that the ship had. "
              },
              {
                "worker_id": "107",
                "uid": "1a3867c95d414d3db23ee190dc35f2bc",
                "response_text": "The story is set on a self-sustaining ship. Rikud starts off observing the space sky from the viewport. Inside of the ship, there is a health-ray bath area; people lie naked under the ray tubes. It is also impossible for people to injure themselves; for example, Rikud was cushioned by something soft when he hurled himself at the wall. There is a library too, but nobody reads anymore so it is covered in dust. There is also a dusty table and a door at the back. Outside of the viewport, a garden soon appears. It is larger than the entire world, with plants that Rikud has never seen before. Later, Rikud confronts Chuls in a room where other people gather as well. There is also a sleeping area for them to rest when the buzzer goes off. The buzzer dictates their entire life. Rikud later goes to a room full of machinery, with cogs and gears that constantly spin. There is also a bright metal rod that he tugs free from the wires that hold it in place. The women’s quarters are located on the ship too, but they are separated from the men. Once they go outside, the air is more fresh than any air Rikud has breathed before. There is also a blue-white globe on the horizon. The water does not flow from machines either, and there are plants everywhere. "
              },
              {
                "worker_id": "109",
                "uid": "3dcac22cb29343ca9815678547bef0dc",
                "response_text": "This story takes place on the inside of a ship that is described to be self-sustaining, with food, water, healthy heat lamps and social interaction all provided and guided by a buzzer. On this ship, the characters are led by a routine in which the buzzer will sound a buzz and the next step in the daily routine will commence. The daily routine occurs in a set number of rooms whereby the ship inhabitants eat, sleep, lay amongst the healthy lamp rays, chat amongst each other after dinner, etc. The only doors on this ship are between the men and women, and for rooms like the library or sleeping quarters - besides the ones that Rikud discovers that leads to the machinery room and the outside world. However, the ship itself is a perfect world, where inhabitants are protected from injury. The ship continues its journey and maintains its automation until the supposed journey ends a thousand years from the occurrence of the story - or until its inhabitants find something better. \n\nThe ship floats amongst space and houses a viewport in which characters like Rikud are able to look outside the ship and into the vastness of space and its stars. By the end of the story, the setting transitions to the outside of the ship with the lush greenery, fresh air and water. \n"
              },
              {
                "worker_id": "113",
                "uid": "cea70479b2c3463b90fdc5b5c98c4c16",
                "response_text": "The story is set in the distant future where people live on a big spaceship cruising through space. The ship is divided into two parts: the male and female sections, the readers follow the life of the male character, Rikud, a twenty-five-year-old man who enjoys thinking about life and looking at the viewport where we find him at the beginning of the story. Then together with the other ship inhabitant Chuls, an old man who doesn’t like thought-provoking ideas, Rikud goes to the health rays room where they get the required scheduled dose of immunity, and we also meet another character - Crifer, a short limping man who occasionally likes reading in the reading room. Rikud gets back to the viewport a few times, noticing how the stars change their form and then surprisingly disappear just to be replaced by an image of a garden - this puzzles him. Later, in the reading room with Crifer, Rikud opens a mysterious doof, leading to a room with a voice that prohibits his unauthorized presence. The next room turns out to be full of wires, cogs, and gears - apparently, it’s the buzzer - the sound system that controls the ship’s inhabitants’ daily life. The last room was a tunnel with a small viewport at the end. When no one believes Rikud, he comes back, upset and angry, and breaks the mechanism in the second room, turning off the buzzer and the food system. Hungry and violent, people chase Rikud who runs back to the small viewport door he found and opens it, leaving the craft. Now everybody was in a large garden, apparently, on some new planet their craft landed on. "
              }
            ]
          },
          {
            "question_text": "What is the significance of \"variability\" in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "111",
                "uid": "f79f2525868d40058315766e1347c0da",
                "response_text": "Variability is a big part of the story. The inhabitants of the ship have always lived the same routine, the same life, and when things start to change they don’t know how to react. First, when the view of the ship starts to change, Rikud doesn’t understand what it means, and begins to think about the meaning of change. These thoughts are enhanced when Crifer told him that he had been reading Astronomy, and that stars are variable. When the ship lands on the new planet, and Rikud begins to explore, he starts to think about the variability of doors, and the meaning of going through doors and how it relates to the viewport. In the end, the change from having the buzzers to not knowing how to act is what sparks the violence of the men towards Rikud. This is due to the fact that he changed their routine, and having never experienced it, they don’t know how to react to change. "
              },
              {
                "worker_id": "107",
                "uid": "1a3867c95d414d3db23ee190dc35f2bc",
                "response_text": "Variability signifies the change to the lifestyle on the self-sustaining ship. When Crifer brings up the variability of the stars, Chuls is quick to refute the idea and says that nothing is variable. In the story, variability exists when Rikuld begins to notice the sweep of space and the stars. While the others are perfectly content with their lives and believe that they will not leave the ship, Rikuld differentiates from the rest. He wants to explore the greater world and does not believe that their only function is to live on the ship, conceive children, and eventually grow to die. The variability that is he believes he has a greater purpose, and this differentiates him from the rest. It also motivates him to see the world that the ship has landed in once the landscape does not change for a week. "
              },
              {
                "worker_id": "109",
                "uid": "3dcac22cb29343ca9815678547bef0dc",
                "response_text": "The concept of variability is significant because it exists in contrast to the world that is presented in the story. The ship, the routine, and the characters that follow the routine are not variable. Everything is premeditated and controlled, with no room for change. However, the changing landscape outside the viewport and Crifer’s base understanding of the astronomy book introduces this idea of variability, which Rikud in particular latches onto as the potential answer for the dissonance he is experiencing. The stars, the sphere, and the garden that they see - could it be due to variability? \n\nAs the story progresses, Rikud begins to better understand the meaning of variability and finds that many concepts around him are in fact variable, like Crifer’s feelings towards him. \n"
              },
              {
                "worker_id": "113",
                "uid": "cea70479b2c3463b90fdc5b5c98c4c16",
                "response_text": "The story describes the life of people of the future: they live on a big spaceship with a regulated daily schedule consisting of health ray procedures, eating, and limited free time. No one questions the limits of their world, so no one understands the phenomenon of change as it has never occurred in their lives on the craft. Rikud, a young inhabitant of the ship, analyzes the changing views of the stars and tries to explain them. His friend, Crifer, tells him about the stars’ feature called variability that he read about in an old astronomy book. They both do not really understand this concept, neither don’t they understand change, but Rikud needs to rationalize why stars become brighter and change form. His attempts are also hindered by Chuls, an old man who actively claims that both change and variability are useless terms with no real meaning. When the views change again, and the image of a garden replaces the stars, Rikud is even more puzzled. Crifer mentions the variability of stars again, explaining their disappearance, and Rikud starts thinking about the concept of change. He uses the word variable to label everything that is not functioning normally or is unknown to him, including doors, the rooms he finds near the reading room, and people. The term both serves as a stepping stone to an understanding of changes and as an independent notion that explains the differences in behavior, environment, etc. After all, seeking the explanation of change and variability, Rikud opens the viewport-door and enables the others to step outside and see the garden that their craft landed in. "
              }
            ]
          },
          {
            "question_text": "Describe the relationship between Rikud and Chuls",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "111",
                "uid": "f79f2525868d40058315766e1347c0da",
                "response_text": "At the beginning of the story, the relationship between Rikud and Chuls seemed like a mentor-mentee or like a father-son relationship. Rikud was a young forward-thinker, and Chuls was an older man who had already lived a lot and tried to guide Rikud on how he should live. As the story progresses more, Rikud seems to stray from Chuls’ guidance and tries to figure out what to think on his own. When Rikud tries to explain his reasoning, Chuls doesn’t understand because he has lived so much time inside of the ship and its routine that he can’t seem to doubt it. This led to Rikud getting mildly violent at Chuls because he couldn’t understand why Chuls didn’t believe him. "
              },
              {
                "worker_id": "107",
                "uid": "1a3867c95d414d3db23ee190dc35f2bc",
                "response_text": "Initially, Chuls is very dismissive of Rikud’s ideas. He does not listen to Rikud much, instead telling him to take a health-ray bath and eat. Chuls is content with how he lives, but he does care for Rikud when he tells him to eat. Rikud, on the other hand, does not like that Chuls is content with how he lives his life. He is angry that Chuls is so dismissive of his ideas and thinks that all the other man cares about is eating. When Rikud asks Chuls to come to see the garden, he refuses and thinks about eating again. Rikud is furious and grabs him by the shirt; everybody else copies this action. Although Chuls is not as angry as Crifer when Rikud breaks the machine, he is sad because he does not have a purpose of living by the buzzer’s announcement. "
              },
              {
                "worker_id": "109",
                "uid": "3dcac22cb29343ca9815678547bef0dc",
                "response_text": "The relationship between Rikud and Chuls is antagonistic. Rikud is presented as the wild card who sees the changing star, who begins to question the routine aboard the ship and who ultimately incites new and unfamiliar behaviors and feelings amongst the other men on the ship. On the other hand, Chuls is an old man who follows the rule without question and content with the life he lives. \n\nFor example, when Rikud and Crifer begin to discuss the word “variability” and the potential of the changing stars being variable, Chuls quickly shuts down this idea by adamantly declaring that the word itself is a contradiction - and that they should go eat. When looking at the changed landscape of the star through the viewport, Rikud and Crifer begin to question why the garden is in the viewport, but Chuls simply says that it is the viewport. Therein lies the tension between these two characters, with Rikud constantly questioning and probing and Chuls remaining steadfast in his routine and knowledge of the world. \n"
              },
              {
                "worker_id": "113",
                "uid": "cea70479b2c3463b90fdc5b5c98c4c16",
                "response_text": "Rikud and Chuls are two inhabitants of the same spaceship where people now live while traveling to their new home. Rikud is a young curious man, he thinks about the future and the past and sometimes thinks outside the box. Chuls, on the other hand, is an old man who got used to the same regular daily schedule that everybody lives by. He is not seeking answers and has no urge to understand the world or see anything beyond the walls of the spaceship. When Rikud notices the changes in the viewport he tries to find an explanation and define the term ‘change’. Bur Chuls is consciously ignoring anything that reminds him of change, he can see the same view, though the stars changed their size and location, hear the same engine sound, though in reality, it became quieter. Rikud even becomes angry for the first time, grabbing Chuls’ blouse when the man doesn’t believe that Rikud found some new rooms with another viewport. Admitting this would mean admitting the reality of change and Chuls can’t do that.  When Rikud breaks the buzzer, the sound mechanism that controls the ship’s inhabitants’ daily life, Chuls cannot realize that eating is possible without it, again showing how dependent he is on the ship’s regulated way of life. "
              }
            ]
          },
          {
            "question_text": "Describe the significance of the viewport in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "111",
                "uid": "f79f2525868d40058315766e1347c0da",
                "response_text": "The viewport is one of the most important parts of the story. Rikud goes to the viewport in order to get a break from his routine life inside the ship. The changing stars that he could see through the viewport is what inspired Rikud to think more about the changes going on around him and to explore hhhhhh\bhe ship. Ultimately it is the viewport that showed him the possibility of a new life on the planet. The viewport essentially lead Rikud to breaking the engine room and to opening the door of the ship. "
              },
              {
                "worker_id": "107",
                "uid": "1a3867c95d414d3db23ee190dc35f2bc",
                "response_text": "The viewport that Rikud looks through initially shows a great changeless sweep of space. He believes that there is a greater purpose for him in the world, even if he has spent his entire life on the ship. There is a bright star that Rikuld sees through it, and it bothers him nonstop. When he looks through the viewport again, he sees that the bright central star has become a blue-tinged globe of light. This is extremely significant because what Rikud is observing is actually the ship’s landing on a new planet. This motivates him to investigate further, and he finds that the scenery has not changed for a week after a garden begins to enter the viewport’s field of vision. The viewport also serves as a reason for Rikud to break the ship’s buzzer announcement system; this stops everybody from living their pre-programmed way of life and to leave the ship for the more mysterious world outside. Without the viewport, Rikud would have never noticed the changes in space and as they eventually land on the planet. "
              },
              {
                "worker_id": "109",
                "uid": "3dcac22cb29343ca9815678547bef0dc",
                "response_text": "The viewport in this story is the only portal in which characters in this story are able to look beyond their perfect, constructed world aboard the ship. It is the only window into what exists outside of the ship, and throughout the story, we can see that it is where change and a variability in landscape is seen. \n\nIt is significant because what Rikud sees through the viewport is what begins to create dissonance in his relationship with the world around him. It is only when he begins to notice the change in the stars, the appearance of a sphere with blue and green, and a bright light that he further questions why the men live on the ship and not outside. Additionally, it is significant because the viewport is one-dimensional in that all information is one-way. Whatever Rikud and the other men see through the viewport can only be explained by them, and so they have no way of knowing if it is true or not. As seen in the story, many times the other men are reluctant to even wonder what it is or simply shrug and move on. \n"
              },
              {
                "worker_id": "113",
                "uid": "cea70479b2c3463b90fdc5b5c98c4c16",
                "response_text": "The story talks about our distant future. Humans left Earth long ago and now live on a spaceship that has been traveling through space for centuries. Everyone on the ship lives by the buzzer - a sound that signifies the beginning or the end of any daily activity: eating, sleeping, free time. They do not understand the concepts of change, space, because their life is limited to the rooms of the ship. The main character, Rikud, is a young man who enjoys looking at the viewport - it allows him to see the stars surrounding the ship and the cosmic blackness. He spends some time every day contemplating the view and notices when the stars change in size and location, disappearing from the view. This observation makes him think about variability and change, what these terms mean. When sometime later Rikud sees an unchanging image of a garden instead of cosmos in the viewport, he starts questioning the space he’s so long lived in. His attempt to rationalize this makes him more curious, and soon he finds another viewport that also looks like a door to the outer world. A different angle of view surprises him since he has always thought that there’s only one possible viewpoint on this ship. After days of chaotic thoughts and revelations, after breaking the buzzer and causing the inhabitants’ anger, Rikud finally opens the small viewport and sets foot in the garden, allowing everyone else to leave the ship, too. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5910,
        "document_length_chars": 33410
      }
    }
  ]
}