{
  "item_metadata": {
    "item_id": "51305",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51305",
      "content": "Confidence Game\n \n \n By JIM HARMON\n \n Illustrated by EPSTEIN\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction June 1957. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n I admit it: I didn't know if I was coming or going—but I know that if I stuck to the old man, I was a comer ... even if he was a goner!\n \n\n \n Doc had this solemn human by the throat when I caught up with him.\n \n \"Tonight,\" Doc was saying in his old voice that was as crackled and important as parchment, \"tonight Man will reach the Moon. The golden Moon and the silver ship, symbols of greed. Tonight is the night when this is to happen.\"\n \n \"Sure,\" the man agreed severely, prying a little worriedly at Doc's arthritic fingers that were clamped on his collar. \"No argument. Sure, up we go. But leave me go or, so help me, I'll fetch you one in the teeth!\"\n \n I came alongside and carefully started to lever the old man loose, one finger at a time. It had to be done this way. I had learned that during all these weeks and months. His hands looked old and crippled, but I felt they were the strongest in the world. If a half dozen winos in Seattle hadn't helped me get them loose, Doc and I would have been wanted for the murder of a North American Mountie.\n \n It was easier this night and that made me afraid. Doc's thin frame, layered with lumpy fat, was beginning to muscle-dance against my side. One of his times was coming on him. Then at last he was free of the greasy collar of the human.\n \n \"I hope you'll forgive him, sir,\" I said, not meeting the man's eyes.\n\"He's my father and very old, as you can see.\" I laughed inside at the absurd, easy lie. \"Old events seem recent to him.\"\n \n The human nodded, Adam's apple jerking in the angry neon twilight.\n\"'Memory Jump,' you mean. All my great-grandfathers have it. But Great-great-grandmother Lupos, funny thing, is like a schoolgirl. Sharp, you know. I.... Say, the poor old guy looks sick. Want any help?\"\n \n I told the human no, thanks, and walked Doc toward the flophouse three doors down. I hoped we would make it. I didn't know what would happen if we didn't. Doc was liable to say something that might nova Sol, for all I knew.\n \n \n\n \n Martians approaching the corner were sensing at Doc and me. They were just cheap tourists slumming down on Skid Row. I hated tourists and especially I hated Martian tourists because I especially hated Martians. They were aliens . They weren't men like Doc and me.\n \n Then I realized what was about to happen. It was foolish and awful and true. I was going to have one of mine at the same time Doc was having his. That was bad. It had happened a few times right after I first found him, but now it was worse. For some undefinable reason, I felt we kept getting closer each of the times.\n \n I tried not to think about it and helped Doc through the fly-specked flophouse doors.\n \n The tubercular clerk looked up from the gaudy comics sections of one of those little tabloids that have the funnies a week in advance.\n \n \"Fifteen cents a bed,\" he said mechanically.\n \n \"We'll use one bed,\" I told him. \"I'll give you twenty cents.\" I felt the round hard quarter in my pocket, sweaty hand against sticky lining.\n \n \"Fifteen cents a bed,\" he played it back for me.\n \n Doc was quivering against me, his legs boneless.\n \n \"We can always make it over to the mission,\" I lied.\n \n The clerk turned his upper lip as if he were going to spit. \"Awright, since we ain't full up. In ad vance.\"\n \n I placed the quarter on the desk.\n \n \"Give me a nickel.\"\n \n The clerk's hand fell on the coin and slid it off into the unknown before I could move, what with holding up Doc.\n \n \"You've got your nerve,\" he said at me with a fine mist of dew. \"Had a quarter all along and yet you Martian me down to twenty cents.\" He saw the look on my face. \"I'll give you a room for the two bits. That's better'n a bed for twenty.\"\n \n I knew I was going to need that nickel. Desperately. I reached across the desk with my free hand and hauled the scrawny human up against the register hard. I'm not as strong in my hands as Doc, but I managed.\n \n \"Give me a nickel,\" I said.\n \n \"What nickel?\" His eyes were big, but they kept looking right at me.\n\"You don't have any nickel. You don't have any quarter, not if I say so. Want I should call a cop and tell him you were flexing a muscle?\"\n \n I let go of him. He didn't scare me, but Doc was beginning to mumble and that did scare me. I had to get him alone.\n \n \"Where's the room?\" I asked.\n \n \n\n \n The room was six feet in all directions and the walls were five feet high. The other foot was finished in chicken wire. There was a wino singing on the left, a wino praying on the right, and the door didn't have any lock on it. At last, Doc and I were alone.\n \n I laid Doc out on the gray-brown cot and put his forearm over his face to shield it some from the glare of the light bulb. I swept off all the bedbugs in sight and stepped on them heavily.\n \n Then I dropped down into the painted stool chair and let my burning eyes rest on the obscene wall drawings just to focus them. I was so dirty, I could feel the grime grinding together all over me. My shaggy scalp still smarted from the alcohol I had stolen from a convertible's gas tank to get rid of Doc's and my cooties. Lucky that I never needed to shave and that my face was so dirty, no one would even notice that I didn't need to.\n \n The cramp hit me and I folded out of the chair onto the littered, uncovered floor.\n \n It stopped hurting, but I knew it would begin if I moved. I stared at a jagged cut-out nude curled against a lump of dust and lint, giving it an unreal distortion.\n \n Doc began to mumble louder.\n \n I knew I had to move.\n \n I waited just a moment, savoring the painless peace. Then, finally, I moved.\n \n I was bent double, but I got from the floor to the chair and found my notebook and orb-point in my hands. I found I couldn't focus both my mind and my eyes through the electric flashes of agony, so I concentrated on Doc's voice and trusted my hands would follow their habit pattern and construct the symbols for his words. They were suddenly distinguishable.\n \n \n\n \n \" Outsider ... Thoth ... Dyzan ... Seven ... Hsan ... Beyond Six, Seven, Eight ... Two boxes ... Ralston ... Richard Wentworth ... Jimmy Christopher ... Kent Allard ... Ayem ... Oh, are ... see ....\"\n \n \n\n \n His voice rose to a meaningless wail that stretched into non-existence. The pen slid across the scribbled face of the notebook and both dropped from my numb hands. But I knew. Somehow, inside me, I knew that these words were what I had been waiting for. They told everything I needed to know to become the most powerful man in the Solar Federation.\n \n That wasn't just an addict's dream. I knew who Doc was. When I got to thinking it was just a dream and that I was dragging this old man around North America for nothing, I remembered who he was.\n \n I remembered that he was somebody very important whose name and work I had once known, even if now I knew him only as Doc.\n \n Pain was a pendulum within me, swinging from low throbbing bass to high screaming tenor. I had to get out and get some. But I didn't have a nickel. Still, I had to get some.\n \n I crawled to the door and raised myself by the knob, slick with greasy dirt. The door opened and shut—there was no lock. I shouldn't leave Doc alone, but I had to.\n \n He was starting to cry. He didn't always do that.\n \n I listened to him for a moment, then tested and tasted the craving that crawled through my veins. I got back inside somehow.\n \n Doc was twisting on the cot, tears washing white streaks across his face. I shoved Doc's face up against my chest. I held onto him and let him bellow. I soothed the lanks of soiled white hair back over his lumpy skull.\n \n He shut up at last and I laid him down again and put his arm back across his face. (You can't turn the light off and on in places like that. The old wiring will blow the bulb half the time.)\n \n I don't remember how I got out onto the street.\n \n \n\n \n She was pink and clean and her platinum hair was pulled straight back, drawing her cheek-bones tighter, straightening her wide, appealing mouth, drawing her lean, athletic, feminine body erect. She was wearing a powder-blue dress that covered all of her breasts and hips and the upper half of her legs.\n \n The most wonderful thing about her was her perfume. Then I realized it wasn't perfume, only the scent of soap. Finally, I knew it wasn't that. It was just healthy, fresh-scrubbed skin.\n \n I went to her at the bus stop, forcing my legs not to stagger. Nobody would help a drunk. I don't know why, but nobody will help you if they think you are blotto.\n \n \"Ma'am, could you help a man who's not had work?\" I kept my eyes down. I couldn't look a human in the eye and ask for help. \"Just a dime for a cup of coffee.\" I knew where I could get it for three cents, maybe two and a half.\n \n I felt her looking at me. She spoke in an educated voice, one she used, perhaps, as a teacher or supervising telephone operator. \"Do you want it for coffee, or to apply, or a glass or hypo of something else?\"\n \n I cringed and whined. She would expect it of me. I suddenly realized that anybody as clean as she was had to be a tourist here. I hate tourists.\n \n \"Just coffee, ma'am.\" She was younger than I was, so I didn't have to call her that. \"A little more for food, if you could spare it.\"\n \n I hadn't eaten in a day and a half, but I didn't care much.\n \n \"I'll buy you a dinner,\" she said carefully, \"provided I can go with you and see for myself that you actually eat it.\"\n \n I felt my face flushing red. \"You wouldn't want to be seen with a bum like me, ma'am.\"\n \n \"I'll be seen with you if you really want to eat.\"\n \n It was certainly unfair and probably immoral. But I had no choice whatever.\n \n \"Okay,\" I said, tasting bitterness over the craving.\n \n \n\n \n The coffee was in a thick white cup before me on the counter. It was pale, grayish brown and steaming faintly. I picked it up in both hands to feel its warmth.\n \n Out of the corner of my eye, I could see the woman sitting on the stool beside me. She had no right to intrude. This moment should be mine, but there she sat, marring it for me, a contemptible tourist .\n \n I gulped down the thick, dark liquid brutally. It was all I could do. The cramp flowed out of my diaphragm. I took another swallow and was able to think straight again. A third swallow and I felt—good. Not abnormally stimulated, but strong, alert, poised on the brink of exhilaration.\n \n That was what coffee did for me.\n \n I was a caffeine addict.\n \n Earth-norm humans sometimes have the addiction to a slight extent, but I knew that as a Centurian I had it infinitely worse. Caffeine affected my metabolism like a pure alkaloid. The immediate effects weren't the same, but the need ran as deep.\n \n I finished the cup. I didn't order another because I wasn't a pure sensualist. I just needed release. Sometimes, when I didn't have the price of a cup, I would look around in alleys and find cola bottles with a few drops left in them. They have a little caffeine in them—not enough, never enough, but better than nothing.\n \n \"Now what do you want to eat?\" the woman asked.\n \n I didn't look at her. She didn't know. She thought I was a human—an Earth human. I was a man , of course, not an alien like a Martian. Earthmen ran the whole Solar Federation, but I was just as good as an Earthman. With my suntan and short mane, I could pass, couldn't I? That proved it, didn't it?\n \n \"Hamburger,\" I said. \"Well done.\" I knew that would probably be all they had fit to eat at a place like this. It might be horse meat, but then I didn't have the local prejudices.\n \n I didn't look at the woman. I couldn't. But I kept remembering how clean she looked and I was aware of how clean she smelled. I was so dirty, so very dirty that I could never get clean if I bathed every hour for the rest of my life.\n \n The hamburger was engulfed by five black-crowned, broken fingernails and raised to two rows of yellow ivory. I surrounded it like an ameba, almost in a single movement of my jaws.\n \n Several other hamburgers followed the first. I lost count. I drank a glass of milk. I didn't want to black out on coffee with Doc waiting for me.\n \n \"Could I have a few to take with me, miss?\" I pleaded.\n \n She smiled. I caught that out of the edge of my vision, but mostly I just felt it.\n \n \"That's the first time you've called me anything but 'ma'am',\" she said. \"I'm not an old-maid schoolteacher, you know.\"\n \n That probably meant she was a schoolteacher, though. \"No, miss,\" I said.\n \n \"It's Miss Casey—Vivian Casey,\" she corrected. She was a schoolteacher, all right. No other girl would introduce herself as Miss Last Name. Then there was something in her voice....\n \n \"What's your name?\" she said to me.\n \n I choked a little on a bite of stale bun.\n \n I had a name, of course .\n \n \n\n \n Everybody has a name, and I knew if I went off somewhere quiet and thought about it, mine would come to me. Meanwhile, I would tell the girl that my name was ... Kevin O'Malley. Abruptly I realized that that was my name.\n \n \"Kevin,\" I told her. \"John Kevin.\"\n \n \"Mister Kevin,\" she said, her words dancing with bright absurdity like waterhose mist on a summer afternoon, \"I wonder if you could help me .\"\n \n \"Happy to, miss,\" I mumbled.\n \n She pushed a white rectangle in front of me on the painted maroon bar.\n\"What do you think of this?\"\n \n I looked at the piece of paper. It was a coupon from a magazine.\n  Dear Acolyte R. I. S. :\n  Please send me FREE of obligation, in sealed wrapper, \"The Scarlet Book\" revealing to me how I may gain Secret Mastery of the Universe.\n \n  Name : ........................\n  Address : .....................\n \n The world disoriented itself and I was on the floor of the somber diner and Miss Vivian Casey was out of sight and scent.\n \n There was a five dollar bill tight in my fist. The counterman was trying to pull it out.\n \n I looked up at his stubbled face. \"I had half a dozen hamburgers, a cup of coffee and a glass of milk. I want four more 'burgers to go and a pint of coffee. By your prices, that will be one sixty-five—if the lady didn't pay you.\"\n \n \"She didn't,\" he stammered. \"Why do you think I was trying to get that bill out of your hand?\"\n \n I didn't say anything, just got up off the floor. After the counterman put down my change, I spread out the five dollar bill on the vacant bar, smoothing it.\n \n I scooped up my change and walked out the door. There was no one on the sidewalk, only in the doorways.\n \n \n\n \n First I opened the door on an amber world, then an azure one. Neon light was coming from the chickenwire border of the room, from a window somewhere beyond. The wino on one side of the room was singing and the one on the other side was praying, same as before. Only they had changed around—prayer came from the left, song from the right.\n \n Doc sat on the floor in the half-darkness and he had made a thing .\n \n \n\n \n My heart hammered at my lungs. I knew this last time had been different. Whatever it was was getting closer. This was the first time Doc had ever made anything. It didn't look like much, but it was a start.\n \n He had broken the light bulb and used the filament and screw bottom. His strong hands had unraveled some of the bed \"springs\"—metal webbing—and fashioned them to his needs. My orb-point pen had dissolved under his touch. All of them, useless parts, were made into a meaningful whole.\n \n I knew the thing had meaning, but when I tried to follow its design, I became lost.\n \n I put the paper container of warm coffee and the greasy bag of hamburgers on the wooden chair, hoping the odor wouldn't bring any hungry rats out of the walls.\n \n I knelt beside Doc.\n \n \"An order, my boy, an order,\" he whispered.\n \n I didn't know what he meant. Was he suddenly trying to give me orders?\n \n He held something out to me. It was my notebook. He had used my pen, before dismantling it, to write something. I tilted the notebook against the neon light, now red wine, now fresh grape. I read it.\n \n \"Concentrate,\" Doc said hoarsely. \"Concentrate....\"\n \n I wondered what the words meant. Wondering takes a kind of concentration.\n \n The words \"First Edition\" were what I was thinking about most.\n \n \n\n \n The heavy-set man in the ornate armchair was saying, \"The bullet struck me as I was pulling on my boot....\"\n \n I was kneeling on the floor of a Victorian living room. I'm quite familiar with Earth history and I recognized the period immediately.\n \n Then I realized what I had been trying to get from Doc all these months—time travel.\n \n A thin, sickly man was sprawled in the other chair in a rumpled dressing gown. My eyes held to his face, his pinpoint pupils and whitened nose. He was a condemned snowbird! If there was anything I hated or held in more contempt than tourists or Martians, it was a snowbird.\n \n \"My clients have occasioned singular methods of entry into these rooms,\" the thin man remarked, \"but never before have they used instantaneous materialization.\"\n \n The heavier man was half choking, half laughing. \"I say—I say, I would like to see you explain this, my dear fellow.\"\n \n \"I have no data,\" the thin man answered coolly. \"In such instance, one begins to twist theories into fact, or facts into theories. I must ask this unemployed, former professional man who has gone through a serious illness and is suffering a more serious addiction to tell me the place and time from which he comes.\"\n \n The surprise stung. \"How did you know?\" I asked.\n \n He gestured with a pale hand. \"To maintain a logical approach, I must reject the supernatural. Your arrival, unless hallucinatory—and despite my voluntary use of one drug and my involuntary experiences recently with another, I must accept the evidence of my senses or retire from my profession—your arrival was then super-normal. I might say super-scientific, of a science not of my or the good doctor's time, clearly. Time travel is a familiar folk legend and I have been reading an article by the entertaining Mr. Wells. Perhaps he will expand it into one of his novels of scientific romance.\"\n \n I knew who these two men were, with a tormenting doubt. \"But the other—\"\n \n \"Your hands, though unclean, have never seen physical labor. Your cranial construction is of a superior type, or even if you reject my theories, concentration does set the facial features. I judge you have suffered an illness because of the inhibition of your beard growth. Your over-fondness for rum or opium, perhaps, is self-evident. You are at too resilient an age to be so sunk by even an amour. Why else then would you let yourself fall into such an underfed and unsanitary state?\"\n \n \n\n \n He was so smug and so sure, this snowbird. I hated him. Because I couldn't trust to my own senses as he did.\n \n \"You don't exist,\" I said slowly, painfully. \"You are fictional creations.\"\n \n The doctor flushed darkly. \"You give my literary agent too much credit for the addition of professional polish to my works.\"\n \n The other man was filling a large, curved pipe from something that looked vaguely like an ice-skate. \"Interesting. Perhaps if our visitor would tell us something of his age with special reference to the theory and practice of temporal transference, Doctor, we would be better equipped to judge whether we exist.\"\n \n There was no theory or practice of time travel. I told them all I had ever heard theorized from Hindu yoga through Extra-sensory Perception to Relativity and the positron and negatron.\n \n \"Interesting.\" He breathed out suffocating black clouds of smoke.\n\"Presume that the people of your time by their 'Extra-sensory Perception' have altered the past to make it as they suppose it to be. The great historical figures are made the larger than life-size that we know them. The great literary creations assume reality.\"\n \n I thought of Cleopatra and Helen of Troy and wondered if they would be the goddesses of love that people imagined or the scrawny, big-nosed redhead and fading old woman of scholarship. Then I noticed the detective's hand that had been resting idly on a round brass weight of unknown sort to me. His tapered fingertips had indented the metal.\n \n His bright eyes followed mine and he smiled faintly. \"Withdrawal symptoms.\"\n \n The admiration and affection for this man that had been slowly building up behind my hatred unbrinked. I remembered now that he had stopped. He was not really a snowbird.\n \n After a time, I asked the doctor a question.\n \n \"Why, yes. I'm flattered. This is the first manuscript. Considering my professional handwriting, I recopied it more laboriously.\"\n \n \n\n \n Accepting the sheaf of papers and not looking back at these two great and good men, I concentrated on my own time and Doc. Nothing happened. My heart raced, but I saw something dancing before me like a dust mote in sunlight and stepped toward it....\n \n ... into the effective range of Miss Casey's tiny gun.\n \n \n\n \n She inclined the lethal silver toy. \"Let me see those papers, Kevin.\"\n \n I handed her the doctor's manuscript.\n \n Her breath escaped slowly and loudly. \"It's all right. It's all right. It exists. It's real. Not even one of the unwritten ones. I've read this myself.\"\n \n Doc was lying on the cot, half his face twisted into horror.\n \n \"Don't move, Kevin,\" she said. \"I'll have to shoot you—maybe not to kill, but painfully.\"\n \n I watched her face flash blue, red, blue and knew she meant it. But I had known too much in too short a time. I had to help Doc, but there was something else.\n \n \"I just want a drink of coffee from that container on the chair,\" I told her.\n \n She shook her head. \"I don't know what you think it does to you.\"\n \n It was getting hard for me to think. \"Who are you?\"\n \n She showed me a card from her wrist purse. Vivian Casey, Constable, North American Mounted Police.\n \n I had to help Doc. I had to have some coffee. \"What do you want?\"\n \n \"Listen, Kevin. Listen carefully to what I am saying. Doc found a method of time travel. It was almost a purely mathematical, topographical way divorced from modern physical sciences. He kept it secret and he wanted to make money with it. He was an idealist—he had his crusades. How can you make money with time travel?\"\n \n I didn't know whether she was asking me, but I didn't know. All I knew was that I had to help Doc and get some coffee.\n \n \"It takes money—money Doc didn't have—to make money,\" Miss Casey said, \"even if you know what horse will come in and what stock will prosper. Besides, horse-racing and the stock market weren't a part of Doc's character. He was a scholar.\"\n \n Why did she keep using the past tense in reference to Doc? It scared me. He was lying so still with the left side of his face so twisted. I needed some coffee.\n \n \"He became a book finder. He got rare editions of books and magazines for his clients in absolutely mint condition. That was all right—until he started obtaining books that did not exist .\"\n \n \n\n \n I didn't know what all that was supposed to mean. I got to the chair, snatched up the coffee container, tore it open and gulped down the soothing liquid.\n \n I turned toward her and threw the rest of the coffee into her face.\n \n The coffee splashed out over her platinum hair and powder-blue dress that looked white when the neon was azure, purple when it was amber. The coffee stained and soiled and ruined, and I was fiercely glad, unreasonably happy.\n \n I tore the gun away from her by the short barrel, not letting my filthy hands touch her scrubbed pink ones.\n \n I pointed the gun generally at her and backed around the thing on the floor to the cot. Doc had a pulse, but it was irregular. I checked for a fever and there wasn't one. After that, I didn't know what to do.\n \n I looked up finally and saw a Martian in or about the doorway.\n \n \"Call me Andre,\" the Martian said. \"A common name but foreign. It should serve as a point of reference.\"\n \n I had always wondered how a thing like a Martian could talk. Sometimes I wondered if they really could.\n \n \"You won't need the gun,\" Andre said conversationally.\n \n \"I'll keep it, thanks. What do you want?\"\n \n \"I'll begin as Miss Casey did—by telling you things. Hundreds of people disappeared from North America a few months ago.\"\n \n \"They always do,\" I told him.\n \n \"They ceased to exist—as human beings—shortly after they received a book from Doc,\" the Martian said.\n \n Something seemed to strike me in the back of the neck. I staggered, but managed to hold onto the gun and stand up.\n \n \"Use one of those sneaky Martian weapons again,\" I warned him,\n\"and I'll kill the girl.\" Martians were supposed to be against the destruction of any life-form, I had read someplace. I doubted it, but it was worth a try.\n \n \"Kevin,\" Andre said, \"why don't you take a bath?\"\n \n The Martian weapon staggered me again. I tried to say something. I tried to explain that I was so dirty that I could never get clean no matter how often I bathed. No words formed.\n \n \"But, Kevin,\" Andre said, \"you aren't that dirty.\"\n \n \n\n \n The blow shook the gun from my fingers. It almost fell into the thing on the floor, but at the last moment seemed to change direction and miss it.\n \n I knew something. \"I don't wash because I drink coffee.\"\n \n \"It's all right to drink coffee, isn't it?\" he asked.\n \n \"Of course,\" I said, and added absurdly, \"That's why I don't wash.\"\n \n \"You mean,\" Andre said slowly, ploddingly, \"that if you bathed, you would be admitting that drinking coffee was in the same class as any other solitary vice that makes people wash frequently.\"\n \n I was knocked to my knees.\n \n \"Kevin,\" the Martian said, \"drinking coffee represents a major vice only in Centurian humanoids, not Earth-norm human beings. Which are you? \"\n \n Nothing came out of my gabbling mouth.\n \n \" What is Doc's full name? \"\n \n I almost fell in, but at the last instant I caught myself and said,\n\"Doctor Kevin O'Malley, Senior.\"\n \n From the bed, Doc said a word. \"Son.\"\n \n Then he disappeared.\n \n I looked at that which he had made. I wondered where he had gone, in search of what.\n \n \"He didn't use that,\" Andre said.\n \n So I was an Earthman, Doc's son. So my addiction to coffee was all in my mind. That didn't change anything. They say sex is all in your mind. I didn't want to be cured. I wouldn't be. Doc was gone. That was all I had now. That and the thing he left.\n \n \"The rest is simple,\" Andre said. \"Doc O'Malley bought up all the stock in a certain ancient metaphysical order and started supplying members with certain books. Can you imagine the effect of the Book of Dyzan or the Book of Thoth or the Seven Cryptical Books of Hsan or the Necronomican itself on human beings?\"\n \n \"But they don't exist,\" I said wearily.\n \n \"Exactly, Kevin, exactly. They have never existed any more than your Victorian detective friend. But the unconscious racial mind has reached back into time and created them. And that unconscious mind, deeper than psychology terms the subconscious, has always known about the powers of ESP, telepathy, telekinesis, precognition. Through these books, the human race can tell itself how to achieve a state of pure logic, without food, without sex, without conflict—just as Doc has achieved such a state—a little late, true. He had a powerful guilt complex, even stronger than your withdrawal, over releasing this blessing on the inhabited universe, but reason finally prevailed. He had reached a state of pure thought.\"\n \n \"The North American government has to have this secret, Kevin,\" the girl said. \"You can't let it fall into the hands of the Martians.\"\n \n \n\n \n Andre did not deny that he wanted it to fall into his hands.\n \n I knew I could not let Doc's—Dad's—time travel thing fall into anyone's hands. I remembered that all the copies of the books had disappeared with their readers now. There must not be any more, I knew.\n \n Miss Casey did her duty and tried to stop me with a judo hold, but I don't think her heart was in it, because I reversed and broke it.\n \n I kicked the thing to pieces and stomped on the pieces. Maybe you can't stop the progress of science, but I knew it might be millenniums before Doc's genes and creative environment were recreated and time travel was rediscovered. Maybe we would be ready for it then. I knew we weren't now.\n \n Miss Casey leaned against my dirty chest and cried into it. I didn't mind her touching me.\n \n \"I'm glad,\" she said.\n \n Andre flowed out of the doorway with a sigh. Of relief?\n \n I would never know. I supposed I had destroyed it because I didn't want the human race to become a thing of pure reason without purpose, direction or love, but I would never know for sure. I thought I could kick the habit—perhaps with Miss Casey's help—but I wasn't really confident.\n \n Maybe I had destroyed the time machine because a world without material needs would not grow and roast coffee.",
      "metadata": {
        "title": "Confidence Game",
        "author": "Jim Harmon",
        "passage_id": "51305",
        "uid": "411a0ad5de844886845225228d2738cb",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "107",
                "uid": "06d8240dd7bb4a74a7b773fe9fac5b8d",
                "response_text": "John Kevin catches up with Doc, who has grabbed a human by the throat. He tells the human that man will reach the moon tonight, and the man agrees, so Doc will let him go. Kevin apologizes to the human and says that his father has trouble differentiating old events. They see Martian tourists approaching the corner, and Kevin recalls how he hates Martian tourists because they are aliens. The two go to a flophouse, where Kevin bargains with the clerk over the price of a room. He threatens the human but stops when he hears Doc mumbling. They go to the room, and he lays Doc out on the cot. Doc begins to mumble more, while Kevin begins to copy down the words in his notebook again. Kevin knows that what Doc is mumbling will make him the most powerful man in the Solar Federation, especially because Doc was once somebody extremely important. Doc then begins to cry, and Kevin decides to comfort him slightly. Kevin then meets a woman by the bus stop and asks her for a dime for coffee. He realizes that she is a human tourist and recalls how he hates tourists. She offers to buy him dinner too, and they go to get a coffee. Kevin is revealed to be a caffeine addict, and he tells the woman that he wants a hamburger. One hamburger becomes several, and he drinks a glass of milk. Kevin asks the woman for a few to take home, and she introduces herself as Miss Vivian Casey. Kevin tells her his name too, and she hands him a coupon from a magazine. When he comes back to his senses, the counterman is pulling a five-dollar bill from under his hand. When he goes back, Doc has made something. It is revealed that Kevin has been trying to get time travel from Doc for the past few months and sees a condemned snowbird. The two thin and heavy men talk to him, asking him to tell them where he came from. The doctor explains his condition and hands him a manuscript, and Kevin steps into the range of Miss Casey’s gun in real life. He asks her for coffee again, and she re-introduces herself as a North American Mounted Police member. She explains that Doc wanted to profit off of his time travel, but he did not have money. He wrestles the gun from her; suddenly, a Martian by the name of Andre appears. Andre makes Kevin realize that he is not a Centurian humanoid because he is the son of Doc. Kevin destroys the thing that Doc creates because he knows nobody is ready for time travel to be rediscovered. Miss Casey and Andre are relieved, while Kevin ponders why he destroyed the machine. He thinks it may be because of emotions or roast coffee. "
              },
              {
                "worker_id": "113",
                "uid": "a3561d99c15e47a188aacccef2ee2713",
                "response_text": "The story is set in the world of intergalactic life and tells us about Kevin, a poor Centurian humanoid, and Doc, a person whose real name and significance Kevin forgot, but still remembers him as someone somewhat important to him in the past and roams with him around North America. Kevin pulls Doc away from an unfamiliar man whose collar he grabbed and carefully walks him to a flophouse. He pays for the room after a small conflict with the clerk. Once inside, Kevin falls down from muscle pain and Doc starts mumbling something that Kevin subconsciously remembers to be of utter importance. After writing down everything he heard from the old man, Kevin leaves in a search for coffee. A woman on the street agrees to pay for his drink and food despite Kevin’s impoverished appearance -  we learn that he has a caffeine addiction that presents in a way more profound and serious way in Centurian men than in earthmen. She introduces herself as Vivian Casey and asks for a favor in return, handing him what seems to be a magazine coupon with some strange content. Suddenly Kevin becomes disoriented, Vivian disappears, leaving the money for the food in his fist. He pays for the bill, ordering some more to take with him, and comes back to Doc who has managed to create some strangely looking device from a bulb, a pen, and the bed carcass while Kevin was away. After kneeling beside Doc while the old man is murmuring something Kevin soon realizes that he is in a Victorian living room. He finally remembers that time travel was the reason why he considered Doc important. He meets two men that seem to be Sherlock Holmes and Dr.Watson. They briefly talk about time travel and after the doctor gives him his manuscript  Kevin finally goes back to his time only to find Miss Casey’s gun pointed at him. She turns out to be a constable and tells Kevin that Doc found a way to travel in time and decided to make money by getting rare books in the past, but apparently started bringing works that had never existed. Kevin throws coffee at Casey, disarming her, but instantly sees a Martian at his door. Andre, as he introduced himself, continues the story Casey started and claims that hundreds of people disappeared after receiving Doc’s books, but what’s even more important, these books, which never existed, can help humans reach a state of pure logic. During their conversation, Andre also helps Kevin remember that Doc is his father and Kevin himself is actually an earthman not a Centurian. Overwhelmed, Kevin quickly decides to break the time travel device and, thus, lose this knowledge for many years because he’s certain that neither Martians nor earthmen are truly ready for time travel."
              },
              {
                "worker_id": "109",
                "uid": "adf28c4e9adc4f4bbcf63cfd797f0fe5",
                "response_text": "The story introduces an initially unnamed protagonist, who accompanies a fellow named “Doc”, both of whom are men but not Earthmen, hence Centurians. Doc is first introduced as choking a human man, seemingly in a trance and talking about a man reaching the moon. The protagonist carefully removes the human from Doc’s hold and asks for forgiveness, claiming memory issues, and the pair move on to a cheap motel. While arguing for the cost of their stay, the clerk finds out that the protagonist had cheapened him despite having a quarter, and keeps the remaining nickel. \n\nThere, the protagonist lays Doc on the bed in the dirty room and as he begins to mumble, the protagonist begins to take notes amidst his own cramps and feelings of dirtiness. He soon remembers that the Doc holds the information to become a powerful man. However, his own pain wins out and the protagonist stumbles out of the room and encounters a clean, young woman, hoping to beg for a cup of coffee and she does, but only as she accompanies him in drinking coffee and eating several hamburgers. Introducing herself as Miss Vivian Casey and himself as John Kevin - the protagonist finally realizing his name - Casey presents Kevin with a coupon clipping from a magazine detailing a request for “The Scarlet Book”. As he reads it however, Kevin finds himself disoriented and the young woman gone. Kevin heads back to the room and finds that Doc has created an unnamed thing, which he finds trouble understanding its meaning. \n\nKevin suddenly finds himself in a Victorian living room with a man he labels as a snowbird, the latter who probes Kevin to reveal what time and place he has come from. Surprised, Kevin realizes that the information he was trying to get from Doc was time travel, and this Victorian snowbird had come to this conclusion as well. Through a length of discourse, Kevin describes what he knows about various Earth theories like yoga and relativity. Afterwards, he asks the doctor a question about his first manuscript and accepts the papers before finding himself back in the original timeline of this story, looking straight into Casey’s gun. \n\nMiss Casey turns out to be a policewoman, who after being handed the manuscript papers, reveals to Kevin that Doc has indeed figured out a method for time travel by obtaining rare editions of literature and books that did not exist for his clients. Aided by a Martian named Andre, it is revealed that hundreds of people have disappeared after receiving a book from the Doc and that Kevin was actually Doc’s son - and human. A dispute soon occurs between the three ending with Kevin destroying the time machine, hoping that the future rediscovery of time travel will be accompanied by the world’s readiness for it. In his ending thoughts - Kevin debates why he did that - for the human race’s purpose, or for the production of coffee. \n"
              },
              {
                "worker_id": "112",
                "uid": "e663afd356ca4eed92d8f32eb03c7030",
                "response_text": "When John Kevin caught up with Doc, a man was grabbing the collar of Doc. He took Doc from the man and walked him to a flophouse. When he got them a room to stay in, he tried to save some money from the only quarter. He needed that money to get something caffeinated after taking care of Doc. However, he failed, and the clerk took the money in the flophouse. After he recorded some notes for Doc’s mumbling, he went out to get food. He begged for a woman on the street for money, but the woman would only buy him food after watching him eat. He gulped some hamburgers and coffee when the woman watched him eat, bought some food after the women had left, and left for the flophouse to feed the Doc. John Kevin has trouble finding the memory of himself because of the side effects of time travel. He mistook himself as Kevin O’Malley, which is Doc’s name. He also mistakenly considered himself a Centurian, who regarded drinking coffee as a vice, when he was an Earthman. When the woman asked for his name, he introduced himself as Kevin because he thought Kevin O’Malley was his name. When John Kevin went back to the room, he saw Doc had made a thing by using the materials in the room.\n\nHe time-traveled to the Victorian era, where he saw two men sitting on chairs and chatting. During his stay in that era, he realized what he had been trying to know from Doc was time travel. He also realized that the man he talked to within the room, who he mistook as a snowbird, is Doc. After talking to the men, he received the first manuscript from them and returned to his own time, where he reencountered the woman, whose gun pointed at him. She revealed herself as a constable from the police, trying to tell Kevin the truth. But he rivaled against her. Then a Martian came, trying to do the same thing as the woman. From their saying, John Kevin realized his true identity as Doc’s son and knew the consequences of Doc’s use of time travel. Once he understood the situation, he destroyed the time machine because he didn’t want to live in a pure logical state, which is the outcome of using time travel to make fantasy reality.\n"
              }
            ]
          },
          {
            "question_text": "Who is Vivian Casey, and what are her characteristics?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "107",
                "uid": "06d8240dd7bb4a74a7b773fe9fac5b8d",
                "response_text": "Vivian Casey is described as a pink and clean woman who smells of clean soap. Her hair is platinum, pulled straight back to draw her cheek-bones tighter. She has an appealing mouth; Kevin also notes that her body is lean, athletic, and feminine. She also wears a powder-blue dress that goes down to the lower-half of her legs. She speaks in an educated voice and is kind enough to take Kevin to get some food. Although he is annoyed she decided to tag along, she lets him order multiple hamburgers to satisfy his hunger. When she introduces herself, he assumes that she is a schoolteacher. Kevin later realizes that she did not pay for his dinner at all. Miss Casey then comes back with a tiny gun. She is shown to be proficient with the firearm, introducing her true identity as a Constable of the North American Mounted Police. She is also very intelligent, being fully aware of what Doc has tried to do in the past. Although she uses force to judo hold Kevin, she doesn’t put her heart into it. Finally, she is shown to be proud of Kevin when he does the right thing and destroys the time machine. "
              },
              {
                "worker_id": "113",
                "uid": "a3561d99c15e47a188aacccef2ee2713",
                "response_text": "Vivian Casey is a decently looking woman who agrees to pay for the drink and food of Kevin, a poor Centurian man who has been wandering around North America with Doc, someone who Kevin believes to be important to him. After Kevin uses the time travel device, that Doc has made while Kevin was away, and finally comes back from the Victorian era, Vivian waits for him with a gun and introduces herself as a constable of North American mounted Police. Apparently, she has been following Kevin and Doc, his father who found a method of time travel,  for a while and even got closer to him by pretending to be an innocent bystander when he was hungry and suffering withdrawal effects in the beginning of the story. When Kevin destroys the device she cries and admits that she’s glad he did that. Vivian seems to be a good constable who can understand people well, but she’s also sincere enough to accept her view on things. "
              },
              {
                "worker_id": "109",
                "uid": "adf28c4e9adc4f4bbcf63cfd797f0fe5",
                "response_text": "Vivian Casey is first introduced to us as a clean young woman waiting at a bus stop, assumed by Kevin to be a schoolteacher and a tourist. She is approached by Kevin as he begs for a small amount of change to use to buy coffee. His request will only be fulfilled if she accompanies him, so Kevin reluctantly follows her as she buys him coffee and hamburgers. She is heavily emphasized as being clean and introduces herself to Kevin as Miss Vivian Casey with a bright smile. After providing him with food and drink, Casey requests a small favor from Kevin and presents him with a coupon clipping from a magazine that details a request for “The Scarlet Book”. \n\nWe see Miss Casey again as the protagonist reappears in front of her tiny gun, where it is revealed that she is not a schoolteacher nor a tourist but rather a North American Mounted Police. Her interaction with Kevin was intentional, as she had been tracking him and the Doc in order to stop the latter’s method of time travel. She plays a key role in helping Kevin unravel the truth about his identity and what the Doc was doing. In the scuffle to keep the time machine out of the hands of the Martians, she grabs Kevin in a judo hold which he quickly breaks and then  destroys the machine. She is seen at the end of the story crying into Kevin’s chest, relieved at its destruction. \n"
              },
              {
                "worker_id": "112",
                "uid": "e663afd356ca4eed92d8f32eb03c7030",
                "response_text": "Vivan Casey is a woman who offers food to Kevin when he begs for money to buy some food on the street. She is a constable from Northern American Mounted Police. She has a clean scent and pink, clean skin, with long, straight platinum hair. Her body is lean and healthy. She stands straight. She wore a powder-blue dress and a wrist purse when she met Kevin, who begged for food on the street. Her voice sounds educated. Her smile looks good. When she revealed her identity to Kevin, Kevin threw the coffee to her face, which splashed and dirtied her dress."
              }
            ]
          },
          {
            "question_text": "What are some of the harmful consequences caused by Doc’s use of time travel?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "107",
                "uid": "06d8240dd7bb4a74a7b773fe9fac5b8d",
                "response_text": "Doc’s use of time travel has caused hundreds of people to disappear from North America a few months ago. He initially starts off using time travel to get rare editions of books and magazines in mint condition. However, he derails and starts getting books that do not exist. For many of his clients, they shortly ceased to exist after obtaining a book from Doc. Doc also had bought the entire stock of an ancient metaphysical order, which he then supplied to his clients. Books such as the Book of Dyzan, Book of Thoth, Seven Cryptical Books of Hsan, and the Necromican were given away even if they do not exist in the present-day. These books are extremely harmful because they essentially instruct the human race on how to achieve a state of pure logic without requiring food, sex, or conflict. "
              },
              {
                "worker_id": "113",
                "uid": "a3561d99c15e47a188aacccef2ee2713",
                "response_text": "After finding a method to travel in time Doc, an earthly scholar, decided to make money by bringing rare book editions from different times to his clients. But once he started bringing books that have never existed his clients disappeared soon after receiving them - at least several hundred people in North America ceased to exist after getting their order from Doc. Furthermore, time traveling allowed the “unconscious racial mind” to construct new worlds and realities by creating new books that were able to teach humans how to reach the state of pure logic and therefore deprive them of all humanly characteristics. "
              },
              {
                "worker_id": "109",
                "uid": "adf28c4e9adc4f4bbcf63cfd797f0fe5",
                "response_text": "Doc’s use of time travel has caused hundreds of people to disappear from North America - as if they ceased to exist. This occurred shortly after Doc gave them a book - books that were collected in metaphysical order and distributed to his liking. As a result, the interplay of time travel and bringing books and their knowledge in and out of existence has caused them to ultimately not exist, but still influence the unconscious mind into creating them. As such, it is revealed that the human mind has been able to understand and access the powers of ESP, telekinesis, etc as well as achieve states of pure logic and thought. Both immediate consequences, like the erasure of people’s existence, as well as existential consequences like the potential for the power of human minds to be accessed occurred because of his time travel. \n"
              },
              {
                "worker_id": "112",
                "uid": "e663afd356ca4eed92d8f32eb03c7030",
                "response_text": "Time travel allows the unconscious racial mind, a mind that knows the power of extrasensory perception, to go back in time and create books that do not exist before. These books allow the human race to teach itself how to turn the material body with desires into a pure logic state without the body, where they don’t need sex, food, or any material supply. Therefore, when Doc uses time travel to create those books and distribute them to people, people who received the books from Doc disappear. Their material existence vanishes. And Doc himself also reaches the state of pure logic, where his material existence disappears."
              }
            ]
          },
          {
            "question_text": "Who is Kevin, and what are his characteristics?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "107",
                "uid": "06d8240dd7bb4a74a7b773fe9fac5b8d",
                "response_text": "Kevin initially believes that he is a Centurian who must carry Doc around in order to achieve something powerful from the man. He firmly believes him and Doc to be superior to the Earthmen and Martian tourists. Kevin is filthy, but he refuses to take a bath. He also has an addiction to caffeine, mistakenly believing that it is the side effect of being a Centurian. Although he looks down on humans, he is desperate enough to ask one for help and for some food. His fingernails are black-crowned and broken, while his teeth are of yellow ivory. He is also suntan and sprouts a short mane. Although he lies to Miss Casey and says his name is John Kevin, he realizes that his name is actually Kevin O’Malley. While Kevin does admit that he wants something from Doc, he also is clearly shown to care for the old man. It is later revealed that Doc is his father, Kevin O’Malley Sr. Even after Miss Casey reveals she is a member of the police, Kevin is still brave enough to throw the rest of the coffee in her face. Later, he realizes that he is actually an Earth human and not a Centurian. His caffeine addiction comes from the mind. Even though he cares for his father, Kevin does choose to make the right decision to destroy the time machine because he does not want humanity to become purely logical. "
              },
              {
                "worker_id": "113",
                "uid": "a3561d99c15e47a188aacccef2ee2713",
                "response_text": "Kevin is a Centurian humanoid who roams around North America with Doc, a man whom Kevin finds utterly important though he doesn’t exactly remember why. He has a strong caffeine addiction and doesn’t know a lot of facts about his life. Kevin cares about Doc even before he remembers that the man is his father. He aspires to get the knowledge of time travel from Doc, but later understands that his time is not ready for this yet and he cannot let two powerful empires fight for it and destroys the device. Kevin is lost and confused throughout the entire story, he’s sometimes judgmental and condescending but also kind and gentle.   \n"
              },
              {
                "worker_id": "109",
                "uid": "adf28c4e9adc4f4bbcf63cfd797f0fe5",
                "response_text": "Kevin is the protagonist in this story, who is first introduced as accompanying the Doc as to gain some important information from him to become the most powerful person in the Solar Federation. He is described to be incessantly dirty - no matter how many baths he may take he can never be clean, and hence chooses not to be anymore. He is a self-proclaimed Centuarian, and like his kind, has a vice for caffeine which he fulfills with coffee or if desperate, with leftover droplets of soda. If he does not get enough caffeine, he becomes withdrawn with pain and behaves similar to an addict. Kevin has a disliking for Martians, tourists and Earth-humans, and is always sure to emphasize the distinction between him as a Man but not as a Earth-man. \n\nThroughout Kevin’s own time travel adventures and later interactions with Miss Casey, the policewoman, and the Martian Andre, he finds out that he is the Doctor, Kevin O’Malley Senior’s son, and is in fact human. As the story comes to a close, he plays an integral role in destroying the Doc’s time machine and hence halting science’s momentary progression on time travel. In some of his ending thoughts, he debates requesting Miss Casey’s help in stopping his addiction to caffeine while also wanting to ensure the continued production of coffee. \n"
              },
              {
                "worker_id": "112",
                "uid": "e663afd356ca4eed92d8f32eb03c7030",
                "response_text": "Kevin is the son of Doc, the son of a scholar who found the method of time travel and caused the disappearance of hundreds of people in Northern America. Kevin is dirty and addicted to caffeine. Kevin also introduced himself as John Kevin when he misremembered Doc’s name as his own. He is unsanitary and underfed. He is also addicted to rum or opium. His teeth are yellow, and his fingernails are filled with black dirt and broken. He never grows a beard. He staggers like a wino. He considered himself a Centurian, a humanoid species that sees drinking coffee as a vice. However, contrary to his memory, he was an Earthman, but he didn’t want to admit this fact. He didn’t want to be cured or told who he was.\n\n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "107",
                "uid": "06d8240dd7bb4a74a7b773fe9fac5b8d",
                "response_text": "The story first begins with Doc and Kevin going to a flophouse three doors down from where Doc has his confrontation. As they turn around the corner, many Martian tourists walk by. The flophouse door is fly-specked, and a tubercular clerk is sitting in a gaudy comics section. The room they later go to is six feet in all directions with five feet high walls. The other foot is finished in chickenwire; there is also a wino singing on the left, wino praying on the right, and a door with no lock. There is also a gray-brown cot that Kevin lays Doc on, and a light bulb for light. Kevin also sits in a chair; the floor is littered and uncovered. The knob of the door is slick with greasy dirt. Later, Kevin goes out to the streets. They go to a restaurant, where he sits at the counter with a cup of coffee. There is also a stool for Miss Casey to sit in next to his stool. As he leaves, he notices that there is nobody on the sidewalks. Kevin describes himself opening the door to an amber world and then an azure one. Neon light also comes from the chickenwire border of the room, from a window somewhere beyond. When Kevin brings back food to the flophouse, he mentions that there are rats in the walls. Inside his mind, one man sits on an ornate armchair. Another man is sprawled in the other chair. Later, as Kevin goes back to reality, the confrontation between Miss Casey, Andre, and him happens in the same room with Doc still on the cot. "
              },
              {
                "worker_id": "113",
                "uid": "a3561d99c15e47a188aacccef2ee2713",
                "response_text": "The story is set in the world where earthmen run a Solar Federation - it incorporates several different planets and population groups, including humans, Martians, Centurian humanoids, etc. Kevin, a Centurian man, and Doc, a nameless old earthman that Kevin remembers to be very important for something, walk to a flophouse. They get a small room which Kevin leaves shortly after on a search for food and coffee - he has a caffeine addiction. He meets a woman called Vivian at the bus stop and she agrees to pay for his food, leading him to a cafe. Later, he comes back to Doc who has managed to construct a device which is used for time travel as Kevin understands after he unexpectedly finds himself  in an old Victorian room. Coming back to his time and his room, Kevin meets Vivian, a North American constable, holding a gun and later, Andre, the representative of the Martians. After they tell him the truth about the consequences of time traveling and help him remember his identity, Kevin breaks the device, destroying the time travel knowledge for many years, as it seems to be the most prudent decision to him. \n"
              },
              {
                "worker_id": "109",
                "uid": "adf28c4e9adc4f4bbcf63cfd797f0fe5",
                "response_text": "This story takes place in the Solar Federation in an unnamed town or city where Earth humans, Centuarians and Martians alike all interact with each other. Tourists seem to be prevalent as well as the protagonist moves around from various locations within the setting like the bus stop, the diner or restaurant, and the motel room. The story primarily takes place in the dirty motel room where it is first inhabited by the Doc on the single bed and the protagonist, Kevin, slipping in out and then later by the stand-off between the Doc, Kevin, Vivian Casey and Andre. \nDue to the existence of time travel in this story, the setting also changes momentarily for Kevin. In the middle of the story, he finds himself in a Victorian living room, which he is able to identify due to his familiarity with Earth’s history. In this temporary setting, he finds himself in the company of a thin, sickly man who sits in an ornate chair and another man filling a curved pipe with what looked like ice-skate. \n"
              },
              {
                "worker_id": "112",
                "uid": "e663afd356ca4eed92d8f32eb03c7030",
                "response_text": "The story occurs in Northern America. It is an era where three species exist together: Earth-norm humans, Centurian humanoids, and Martians. The earth government and the Martian government are rivals. The story begins with an Earthman, suffering from memory loss due to time travel, considered himself a Centurian. Throughout the whole story, he finally found out his dad, an Earthman known as Doc, had caused many people to disappear from Northern America due to the use of time travel. Time travel allows people to make things that do not exist come into existence by extrasensory perception. And the incident is caused by such an ability to create nonexistent things that would enable humans to achieve a pure immaterial logical state."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5244,
        "document_length_chars": 28974
      }
    }
  ]
}