{
  "item_metadata": {
    "item_id": "51321",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51321",
      "content": "PRIME DIFFERENCE\n \n \n By ALAN E. NOURSE\n \n Illustrated by SCHOENHEER\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction June 1957. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n Being two men rolled out of one would solve my problems—but which one would I be?\n \n\n \n I suppose that every guy reaches a point once in his lifetime when he gets one hundred and forty per cent fed up with his wife.\n \n Understand now—I've got nothing against marriage or any thing like that. Marriage is great. It's a good old red-blooded American Institution. Except that it's got one defect in it big enough to throw a cat through, especially when you happen to be married to a woman like Marge—\n \n It's so permanent .\n \n Oh, I'd have divorced Marge in a minute if we'd been living in the Blissful 'Fifties—but with the Family Solidarity Amendment of 1968, and all the divorce taxes we have these days since the women got their teeth into politics, to say nothing of the Aggrieved Spouse Compensation Act, I'd have been a pauper for the rest of my life if I'd tried it. That's aside from the social repercussions involved.\n \n You can't really blame me for looking for another way out. But a man has to be desperate to try to buy himself an Ego Prime.\n \n So, all right, I was desperate. I'd spent eight years trying to keep Marge happy, which was exactly seven and a half years too long.\n \n Marge was a dream to look at, with her tawny hair and her sulky eyes and a shape that could set your teeth chattering—but that was where the dream stopped.\n \n She had a tongue like a #10 wood rasp and a list of grievances long enough to paper the bedroom wall. When she wasn't complaining, she was crying, and when she wasn't crying, she was pointing out in chilling detail exactly where George Faircloth fell short as a model husband, which happened to be everywhere. Half of the time she had a \"beastly headache\" (for which I was personally responsible) and the other half she was sore about something, so ninety-nine per cent of the time we got along like a couple of tomcats in a packing case.\n \n \n\n \n Maybe we just weren't meant for each other. I don't know. I used to envy guys like Harry Folsom at the office. His wife is no joy to live with either, but at least he could take a spin down to Rio once in a while with one of the stenographers and get away with it.\n \n I knew better than to try. Marge was already so jealous that I couldn't even smile at the company receptionist without a twinge of guilt. Give Marge something real to howl about, and I'd be ready for the Rehab Center in a week.\n \n But I'd underestimated Marge. She didn't need anything real, as I found out when Jeree came along.\n \n Business was booming and the secretaries at the office got shuffled around from time to time. Since I had an executive-type job, I got an executive-type secretary. Her name was Jeree and she was gorgeous. As a matter of fact, she was better than gorgeous. She was the sort of secretary every businessman ought to have in his office. Not to do any work—just to sit there.\n \n Jeree was tall and dark, and she could convey more without saying anything than I ever dreamed was possible. The first day she was there, she conveyed to me very clearly that if I cared to supply the opportunity, she'd be glad to supply the motive.\n \n That night, I could tell that Marge had been thinking something over during the day. She let me get the first bite of dinner halfway to my mouth, and then she said, \"I hear you got a new secretary today.\"\n \n I muttered something into my coffee cup and pretended not to hear.\n \n Marge turned on her Accusing Look #7. \"I also hear that she's five-foot-eight and tapes out at 38-25-36 and thinks you're handsome.\"\n \n Marge had quite a spy system.\n \n \"She couldn't be much of a secretary,\" she added.\n \n \"She's a perfectly good secretary,\" I blurted, and kicked myself mentally. I should have known Marge's traps by then.\n \n Marge exploded. I didn't get any supper, and she was still going strong at midnight. I tried to argue, but when Marge got going, there was no stopping her. I had my ultimatum, as far as Jeree was concerned.\n \n Harry Folsom administered the coup de grace at coffee next morning.\n\"What you need is an Ego Prime,\" he said with a grin. \"Solve all your problems. I hear they work like a charm.\"\n \n I set my coffee cup down. Bells were ringing in my ears. \"Don't be ridiculous. It's against the law. Anyway, I wouldn't think of such a thing. It's—it's indecent.\"\n \n Harry shrugged. \"Just joking, old man, just joking. Still, it's fun to think about, eh? Freedom from wife. Absolutely safe and harmless. Not even too expensive, if you've got the right contacts. And I've got a friend who knows a guy—\"\n \n Just then, Jeree walked past us and flashed me a big smile. I gripped my cup for dear life and still spilled coffee on my tie.\n \n As I said, a guy gets fed up.\n \n And maybe opportunity would only knock once.\n \n And an Ego Prime would solve all my problems, as Harry had told me.\n \n \n\n \n It was completely illegal, of course. The wonder was that Ego Prime, Inc., ever got to put their product on the market at all, once the nation's housewives got wind of just what their product was.\n \n From the first, there was rigid Federal control and laws regulating the use of Primes right down to the local level. You could get a license for a Utility model Prime if you were a big business executive, or a high public official, or a movie star, or something like that; but even then his circuits had to be inspected every two months, and he had to have a thousand built-in Paralyzers, and you had to specify in advance exactly what you wanted your Prime to be able to do when, where, how, why, and under what circumstances.\n \n The law didn't leave a man much leeway.\n \n But everybody knew that if you really wanted a personal Prime with all his circuits open and no questions asked, you could get one. Black market prices were steep and you ran your own risk, but it could be done.\n \n Harry Folsom told his friend who knew a guy, and a few greenbacks got lost somewhere, and I found myself looking at a greasy little man with a black mustache and a bald spot, up in a dingy fourth-story warehouse off lower Broadway.\n \n \"Ah, yes,\" the little man said. \"Mr. Faircloth. We've been expecting you.\"\n \n \n\n \n I didn't like the looks of the guy any more than the looks of the place. \"I've been told you can supply me with a—\"\n \n He coughed. \"Yes, yes. I understand. It might be possible.\" He fingered his mustache and regarded me from pouchy eyes. \"Busy executives often come to us to avoid the—ah—unpleasantness of formal arrangements. Naturally, we only act as agents, you might say. We never see the merchandise ourselves—\" He wiped his hands on his trousers. \"Now were you interested in the ordinary Utility model, Mr. Faircloth?\"\n \n I assumed he was just being polite. You didn't come to the back door for Utility models.\n \n \"Or perhaps you'd require one of our Deluxe models. Very careful workmanship. Only a few key Paralyzers in operation and practically complete circuit duplication. Very useful for—ah—close contact work, you know. Social engagements, conferences—\"\n \n I was shaking my head. \"I want a Super Deluxe model,\" I told him.\n \n He grinned and winked. \"Ah, indeed! You want perfect duplication. Yes, indeed. Domestic situations can be—awkward, shall we say. Very awkward—\"\n \n I gave him a cold stare. I couldn't see where my domestic problems were any affairs of his. He got the idea and hurried me back to a storeroom.\n \n \"We keep a few blanks here for the basic measurement. You'll go to our laboratory on 14th Street to have the minute impressions taken. But I can assure you you'll be delighted, simply delighted.\"\n \n The blanks weren't very impressive—clay and putty and steel, faceless, brainless. He went over me like a tailor, checking measurements of all sorts. He was thorough—embarrassingly thorough, in fact—but finally he was finished. I went on to the laboratory.\n \n And that was all there was to it.\n \n \n\n \n Practical androids had been a pipe dream until Hunyadi invented the Neuro-pantograph. Hunyadi had no idea in the world what to do with it once he'd invented it, but a couple of enterprising engineers bought him body and soul, sub-contracted the problems of anatomy, design, artistry, audio and visio circuitry, and so forth, and ended up with the modern Ego Primes we have today.\n \n I spent a busy two hours under the NP microprobes; the artists worked outside while the NP technicians worked inside. I came out of it pretty woozy, but a shot of Happy-O set that straight. Then I waited in the recovery room for another two hours, dreaming up ways to use my Prime when I got him. Finally the door opened and the head technician walked in, followed by a tall, sandy-haired man with worried blue eyes and a tired look on his face.\n \n \n\n \n \"Meet George Faircloth Prime,\" the technician said, grinning at me like a nursing mother.\n \n I shook hands with myself. Good firm handshake, I thought admiringly. Nothing flabby about it.\n \n I slapped George Prime on the shoulder happily. \"Come on, Brother,\" I said. \"You've got a job to do.\"\n \n But, secretly, I was wondering what Jeree was doing that night.\n \n George Prime had remote controls, as well as a completely recorded neurological analogue of his boss, who was me. George Prime thought what I thought about the same things I did in the same way I did. The only difference was that what I told George Prime to do, George Prime did.\n \n If I told him to go to a business conference in San Francisco and make the smallest possible concessions for the largest possible orders, he would go there and do precisely that. His signature would be my signature. It would hold up in court.\n \n And if I told him that my wife Marge was really a sweet, good-hearted girl and that he was to stay home and keep her quiet and happy any time I chose, he'd do that, too.\n \n George Prime was a duplicate of me right down to the sandy hairs on the back of my hands. Our fingerprints were the same. We had the same mannerisms and used the same figures of speech. The only physical difference apparent even to an expert was the tiny finger-depression buried in the hair above his ear. A little pressure there would stop George Prime dead in his tracks.\n \n He was so lifelike, even I kept forgetting that he was basically just a pile of gears.\n \n I'd planned very carefully how I meant to use him, of course.\n \n Every man who's been married eight years has a sanctuary. He builds it up and maintains it against assault in the very teeth of his wife's natural instinct to clean, poke, pry and rearrange things. Sometimes it takes him years of diligent work to establish his hideout and be confident that it will stay inviolate, but if he starts early enough, and sticks with it long enough, and is fierce enough and persistent enough and crafty enough, he'll probably win in the end. The girls hate him for it, but he'll win.\n \n With some men, it's just a box on their dressers, or a desk, or a corner of an unused back room. But I had set my sights high early in the game. With me, it was the whole workshop in the garage.\n \n \n\n \n At first, Marge tried open warfare. She had to clean the place up, she said. I told her I didn't want her to clean it up. She could clean the whole house as often as she chose, but I would clean up the workshop.\n \n After a couple of sharp engagements on that field, Marge staged a strategic withdrawal and reorganized her attack. A little pile of wood shavings would be on the workshop floor one night and be gone the next. A wrench would be back on the rack—upside down, of course. An open paint can would have a cover on it.\n \n I always knew. I screamed loudly and bitterly. I ranted and raved. I swore I'd rig up a booby-trap with a shotgun.\n \n So she quit trying to clean in there and just went in once in a while to take a look around. I fixed that with the old toothpick-in-the-door routine. Every time she so much as set foot in that workshop, she had a battle on her hands for the next week or so. She could count on it. It was that predictable.\n \n She never found out how I knew, and after seven years or so, it wore her down. She didn't go into the workshop any more.\n \n As I said, you've got to be persistent, but you'll win.\n \n Eventually.\n \n If you're really persistent.\n \n Now all my effort paid off. I got Marge out of the house for an hour or two that day and had George Prime delivered and stored in the big closet in the workshop. They hooked his controls up and left me a manual of instructions for running him. When I got home that night, there he was, just waiting to be put to work.\n \n After supper, I went out to the workshop—to get the pipe I'd left there, I said. I pushed George Prime's button, winked at him and switched on the free-behavior circuits.\n \n \"Go to it, Brother,\" I said.\n \n George Prime put my pipe in his mouth, lit it and walked back into the house.\n \n Five minutes later, I heard them fighting.\n \n It sounded so familiar that I laughed out loud. Then I caught a cab on the corner and headed uptown.\n \n We had quite a night, Jeree and I. I got home just about time to start for work, and sure enough, there was George Prime starting my car, business suit on, briefcase under his arm.\n \n I pushed the recall and George Prime got out of the car and walked into the workshop. He stepped into his cradle in the closet. I turned him off and then drove away in the car.\n \n Bless his metallic soul, he'd even kissed Marge good-by for me!\n \n \n\n \n Needless to say, the affairs of George Faircloth took on a new sparkle with George Prime on hand to cover the home front.\n \n For the first week, I was hardly home at all. I must say I felt a little guilty, leaving poor old George Prime to cope with Marge all the time—he looked and acted so human, it was easy to forget that he literally couldn't care less. But I felt apologetic all the same whenever I took him out of his closet.\n \n \"She's really a sweet girl underneath it all,\" I'd say. \"You'll learn to like her after a bit.\"\n \n \"Of course I like her,\" George Prime said. \"You told me to, didn't you? Stop worrying. She's really a sweet girl underneath it all.\"\n \n He sounded convincing enough, but still it bothered me. \"You're sure you understand the exchange mechanism?\" I asked. I didn't want any foul-ups there, as you can imagine.\n \n \"Perfectly,\" said George Prime. \"When you buzz the recall, I wait for the first logical opportunity I can find to come out to the workshop, and you take over.\"\n \n \"But you might get nervous. You might inadvertently tip her off.\"\n \n George Prime looked pained. \"Really, old man! I'm a Super Deluxe model, remember? I don't have fourteen activated Hunyadi tubes up in this cranial vault of mine just for nothing. You're the one that's nervous. I'll take care of everything. Relax.\"\n \n So I did.\n \n Jeree made good all her tacit promises and then some. She had a very cozy little apartment on 34th Street where we went to relax after a hard day at the office. When we weren't doing the town, that is. As long as Jeree didn't try too much conversation, everything was wonderful.\n \n And then, when Jeree got a little boring, there was Sybil in the accounting department. Or Dorothy in promotion. Or Jane. Or Ingrid.\n \n I could go on at some length, but I won't. I was building quite a reputation for myself around the office.\n \n Of course, it was like buying your first 3-V set. In a week or so, the novelty wears off a little and you start eating on schedule again. It took a little while, but I finally had things down to a reasonable program.\n \n Tuesday and Thursday nights, I was informally \"out\" while formally\n\"in.\" Sometimes I took Sunday nights \"out\" if things got too sticky around the house over the weekend. The rest of the time, George Prime cooled his heels in his closet. Locked up, of course. Can't completely trust a wife to observe a taboo, no matter how well trained she is.\n \n There, was an irreconcilable amount of risk. George Prime had to quick-step some questions about my work at the office—there was no way to supply him with current data until the time for his regular two-month refill and pattern-accommodation at the laboratory. In the meantime, George Prime had to make do with what he had.\n \n But as he himself pointed out he was a Super Deluxe model.\n \n \n\n \n Marge didn't suspect a thing. In fact, George Prime seemed to be having a remarkable effect on her. I didn't notice anything at first—I was hardly ever home. But one night I found my pipe and slippers laid out for me, and the evening paper neatly folded on my chair, and it brought me up short. Marge had been extremely docile lately. We hadn't had a good fight in days. Weeks, come to think of it.\n \n I thought it over and shrugged. Old age, I figured. She was bound to mellow sometime.\n \n But pretty soon I began to wonder if she wasn't mellowing a little too much.\n \n One night when I got home, she kissed me almost as though she really meant it. There wasn't an unpleasant word all through dinner, which happened to be steak with mushrooms, served in the dining room (!) by candlelight (!!) with dinner music that Marge could never bear, chiefly because I liked it.\n \n We sat over coffee and cigarettes, and it seemed almost like old times. Very old times, in fact I even caught myself looking at Marge again—really looking at her, watching the light catch in her hair, almost admiring the sparkle in her brown eyes. Sparkle, I said, not glint.\n \n As I mentioned before, Marge was always easy to look at. That night, she was practically ravishing.\n \n \"What are you doing to her?\" I asked George Prime later, out in the workshop.\n \n \"Why, nothing,\" said George Prime, looking innocent. He couldn't fool me with his look, though, because it was exactly the look I use when I'm guilty and pretending to be innocent.\n \n \"There must be something .\"\n \n George Prime shrugged. \"Any woman will warm up if you spend enough time telling her all the things she wants to hear and pay all the attention to her that she wants paid to her. That's elemental psychology. I can give you page references.\"\n \n I ought to mention that George Prime had a complete set of basic texts run into his circuits, at a slightly additional charge. Never can tell when an odd bit of information will come in useful.\n \n \"Well, you must be doing quite a job,\" I said. I'd never managed to warm Marge up much.\n \n \"I try,\" said George Prime.\n \n \"Oh, I'm not complaining,\" I hastened to add, forgetting that a Prime's feelings can't be hurt and that he was only acting like me because it was in character. \"I was just curious.\"\n \n \"Of course, George.\"\n \n \"I'm really delighted that you're doing so well.\"\n \n \"Thank you, George.\"\n \n But the next night when I was with Dawn, who happens to be a gorgeous redhead who could put Marge to shame on practically any field of battle except maybe brains, I kept thinking about Marge all evening long, and wondering if things weren't getting just a little out of hand.\n \n \n\n \n The next evening I almost tripped over George Prime coming out of a liquor store. I ducked quickly into an alley and flagged him. \" What are you doing out on the street? \"\n \n He gave me my martyred look. \"Just buying some bourbon. You were out.\"\n \n \"But you're not supposed to be off the premises—\"\n \n \"Marge asked me to come. I couldn't tell her I was sorry, but her husband wouldn't let me, could I?\"\n \n \"Well, certainly not—\"\n \n \"You want me to keep her happy, don't you? You don't want her to get suspicious.\"\n \n \"No, but suppose somebody saw us together! If she ever got a hint—\"\n \n \"I'm sorry,\" George Prime said contritely. \"It seemed the right thing to do. You would have done it. At least that's what my judgment center maintained. We had quite an argument.\"\n \n \"Well, tell your judgment center to use a little sense,\" I snapped. \"I don't want it to happen again.\"\n \n The next night, I stayed home, even though it was Tuesday night. I was beginning to get worried. Of course, I did have complete control—I could snap George Prime off any time I wanted, or even take him in for a complete recircuiting—but it seemed a pity. He was doing such a nice job.\n \n Marge was docile as a kitten, even more so than before. She sympathized with my hard day at the office and agreed heartily that the boss, despite all appearances, was in reality a jabbering idiot. After dinner, I suggested a movie, but Marge gave me an odd sort of look and said she thought it would be much nicer to spend the evening at home by the fire.\n \n I'd just gotten settled with the paper when she came into the living room and sat down beside me. She was wearing some sort of filmy affair I'd never laid eyes on before, and I caught a whiff of my favorite perfume.\n \n \"Georgie?\" she said.\n \n \"Uh?\"\n \n \"Do you still love me?\"\n \n I set the paper down and stared at her. \"How's that? Of course I still—\"\n \n \"Well, sometimes you don't act much like it.\"\n \n \"Mm. I guess I've—uh—got an awful headache tonight.\" Damn that perfume!\n \n \"Oh,\" said Marge.\n \n \"In fact, I thought I'd turn in early and get some sleep—\"\n \n \"Sleep,\" said Marge. There was no mistaking the disappointment in her voice. Now I knew that things were out of hand.\n \n The next evening, I activated George Prime and caught the taxi at the corner, but I called Ruby and broke my date with her. I took in an early movie alone and was back by ten o'clock. I left the cab at the corner and walked quietly up the path toward the garage.\n \n Then I stopped. I could see Marge and George Prime through the living room windows.\n \n George Prime was kissing my wife the way I hadn't kissed her in eight long years. It made my hair stand on end. And Marge wasn't exactly fighting him off, either. She was coming back for more. After a little, the lights went off.\n \n George Prime was a Super Deluxe model, all right.\n \n \n\n \n I dashed into the workshop and punched the recall button as hard as I could, swearing under my breath. How long had this been going on? I punched the button again, viciously, and waited.\n \n George Prime didn't come out.\n \n It was plenty cold out in the workshop that night and I didn't sleep a wink. About dawn, out came George Prime, looking like a man with a four-day hangover.\n \n Our conversation got down to fundamentals. George Prime kept insisting blandly that, according to my own directions, he was to pick the first logical opportunity to come out when I buzzed, and that was exactly what he'd done.\n \n I was furious all the way to work. I'd take care of this nonsense, all right. I'd have George Prime rewired from top to bottom as soon as the laboratory could take him.\n \n But I never phoned the laboratory. The bank was calling me when I got to the office. They wanted to know what I planned to do about that check of mine that had just bounced.\n \n \"What check?\" I asked.\n \n \"The one you wrote to cash yesterday—five hundred dollars—against your regular account, Mr. Faircloth.\"\n \n The last I'd looked, I'd had about three thousand dollars in that account. I told the man so rather bluntly.\n \n \"Oh, no, sir. That is, you did until last week. But all these checks you've been cashing have emptied the account.\"\n \n He flashed the checks on the desk screen. My signature was on every one of them.\n \n \"What about my special account?\" I'd learned long before that an account Marge didn't know about was sound rear-guard strategy.\n \n \"That's been closed out for two weeks.\"\n \n I hadn't written a check against that account for over a year! I glared at the ceiling and tried to think things through.\n \n I came up with a horrible thought.\n \n Marge had always had her heart set on a trip to Bermuda. Just to get away from it all, she'd say. A second honeymoon.\n \n I got a list of travel agencies from the business directory and started down them. The third one I tried had a pleasant tenor voice. \"No, sir, not Mrs. Faircloth. You bought two tickets. One way. Champagne flight to Bermuda.\"\n \n \"When?\" I choked out.\n \n \"Why, today, as a matter of fact. It leaves Idlewild at eleven o'clock—\"\n \n I let him worry about my amnesia and started home fast. I didn't know what they'd given that Prime for circuits, but there was no question now that he was out of control— way out of control. And poor Marge, all worked up for a second honeymoon—\n \n Then it struck me. Poor Marge? Poor sucker George! No Prime in his right circuits would behave this way without some human guidance and that meant only one thing: Marge had spotted him. It had happened before. Couple of nasty court battles I'd read about. And she'd known all about George Prime.\n  For how long?\n \n \n \n\n \n When I got home, the house was empty. George Prime wasn't in his closet. And Marge wasn't in the house.\n \n They were gone.\n \n I started to call the police, but caught myself just in time. I couldn't very well complain to the cops that my wife had run off with an android.\n \n Worse yet, I could get twenty years for having an illegal Prime wandering around.\n \n I sat down and poured myself a stiff drink.\n \n My own wife deserting me for a pile of bearings.\n \n It was indecent.\n \n Then I heard the front door open and there was Marge, her arms full of grocery bundles. \"Why, darling! You're home early!\"\n \n I just blinked for a moment. Then I said, \"You're still here!\"\n \n \"Of course. Where did you think I'd be?\"\n \n \"But I thought—I mean the ticket office—\"\n \n She set down the bundles and kissed me and looked up into my eyes, almost smiling, half reproachful. \"You didn't really think I'd go running off with something out of a lab, did you?\"\n \n \"Then—you knew?\"\n \n \"Certainly I knew, silly. You didn't do a very good job of instructing him, either. You gave him far too much latitude. Let him have ideas of his own and all that. And next thing I knew, he was trying to get me to run off with him to Hawaii or someplace.\"\n \n \"Bermuda,\" I said.\n \n And then Marge was in my arms, kissing me and snuggling her cheek against my chest.\n \n \"Even though he looked like you, I knew he couldn't be,\" she said. \"He was like you, but he wasn't you , darling. And all I ever want is you. I just never appreciated you before....\"\n \n I held her close and tried to keep my hands from shaking. George Faircloth, Idiot, I thought. She'd never been more beautiful. \"But what did you do with him?\"\n \n \"I sent him back to the factory, naturally. They said they could blot him out and use him over again. But let's not talk about that any more. We've got more interesting things to discuss.\"\n \n Maybe we had, but we didn't waste a lot of time talking. It was the Marge I'd once known and I was beginning to wonder how I could have been so wrong about her. In fact unless my memory was getting awfully porous, the old Marge was never like this—\n \n I kissed her tenderly and ran my hands through her hair, and felt the depression with my fore-finger, and then I knew what had really happened.\n \n That Marge always had been a sly one.\n \n I wondered how she was liking things in Bermuda.\n \n \n\n \n Marge probably thought she'd really put me where I belonged, but the laugh was on her, after all.\n \n As I said, the old Marge was never like the new one. Marge Prime makes Jeree and Sybil and Dorothy and Dawn and Jane and Ruby all look pretty sad by comparison.\n \n She cooks like a dream and she always brings me my pipe and slippers. As they say, there's nothing a man likes more than to be appreciated.\n \n A hundred per cent appreciated, with a factory guarantee to correct any slippage, which would only be temporary, anyhow.\n \n One of these days, we'll take that second honeymoon. But I think we'll go to Hawaii.",
      "metadata": {
        "title": "Prime Difference",
        "author": "Alan E. Nourse",
        "passage_id": "51321",
        "uid": "6ef019ca2d1540c09580cc1b77c7c385",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "112",
                "uid": "04dba3dc7983427b9d5d8c1088f67294",
                "response_text": "George Faircloth, a husband who has an eight-year marriage with Marge Faircloth, is unsatisfied with his wife as he thinks she is annoying and unbearable. He desires but cannot divorce her as the law and society are critical of the divorce. His colleague, Harry Folsom, suggests he get an illegal Ego Prime, a technology that can produce a human duplicate possessing all the human features and functions, after he becomes fed up with his wife after a fight over his new secretary. He goes to the black market, goes through all the examinations needed for the technology, and buys a Super Deluxe Prime, George Prime, to hide in his workshop in the garage. The workshop is his sanctuary that he keeps for years after a long fight with Marge, a place where Marge cannot go in. He sets up George Prime and orders it to pretend him whenever he goes out to have some extramarital affairs with women in his office. George Prime does an excellent job on that as it behaves completely identical to George Faircloth, except that it gives Marge Faircloth more pleasure than George Faircloth does. At first, George Faircloth enjoys the freedom of playing around with women and not having to worry about Marge’s hysteria. But after a while, as he realizes that Marge has been more mellow and sweet whenever he is at home, catching George Prime on the street once when it is not supposed to be outside according to his order, he starts to suspect whether his choice is correct or not. One day, he leaves his date and comes home early, seeing George Prime have sexual affairs with Marge. Gripped by the anger, he tries to recall George Prime coming back to the garage, but it doesn’t respond due to the lack of the first logical opportunity for it to return. After that, through the conversation with George Prime, he realizes that things are out of his control as he cannot decide specifically what George Prime will do. Even worse, he finds out that his money is spent through the signature of George Prime as their signatures both have legal effects, and that he cannot call the police to fix it as he couldn’t explain the situation of illegal George Prime. George Prime and Marge Faircloth leave for Bermuda with his money. Marge comes home when he feels desperate in his house and comforts him. He soon realizes that it is not Marge Faircloth but Marge Prime, his wife’s duplicate and that his wife had already found out his trick long before. In the end, George Faircloth lives happily with Marge Prime, and Marge Faircloth lives happily with George Prime. Both of them are satisfied with the duplicates as they would satisfy their needs in the marriage."
              },
              {
                "worker_id": "113",
                "uid": "0f71335354ce468884f6cce52a5c4a36",
                "response_text": "The main character is George Faircloth. He has been married to his wife, Marge, for eight years, and he is tired of her and their relationship. He describes her as emotional and grumpy. He also calls her jealous and brings up the story of when she fought with him because of his new female secretary. His friend Harry Folsom suggests  buying an Ego Prime - an android that fully resembles the person it was built after, including the feature of speech and mannerisms. The sale of this mechanism is heavily regulated by the law - having a personal Ego Prime with open circuits is illegal, but George feels desperate. He comes to a four-storied warehouse near Broadway meets a little man, a consultant who, after a quick chat, sends him to a laboratory where they can copy George’s appearance and behavioral patterns. Two hours later, Faircloth meets his android duplicate George Prime, who later gets delivered and stored in the big closet in George's workshop - Marge never comes here. After supper, he switches on George Prime, lets him go to the house, and leaves for a date. During the following weeks George leaves at night after switching with his duplicate. He usually uses the android several days a week and puts him back in the workshop closet when he returns. Soon George realizes that his wife has become happier and calmer. George Prime claims that he was simply paying attention to her, listening - that’s why she changed. George thanks him. The next evening, Faircloth unexpectedly meets the duplicate at the liquor store and becomes angry, but George Prime says that he had to get bourbon for Marge and was in no position to refuse. Faircloth decides to stay home the next night and has a strange conversation with his wife, after which he decides to go to bed. The next night, he activates George Prime and goes to the movies alone. Once back, Faircloth sees his wife and the duplicate kiss. He walks to the workshop and pushes the recall button waiting for the android to come, but George Prime appears only at dawn. The next morning, George gets a call from the bank and learns that someone who appeared to be him has been cashing checks for the last weeks, and now his account is empty. He calls one of the city travel agencies and learns that George Prime just bought two tickets to Bermuda. Apparently, Marge has spotted the substitution and convinced the android to purchase the tickets. George comes back home, but no one is there. Suddenly his wife opens the front door, her arms full of groceries. She tells him that she figured out everything but was not planning on running away with George Prime. She sent him back to the factory. George becomes suspicious and soon understands that it is a duplicate of Marge standing in front of him - his real wife did run away. \n"
              },
              {
                "worker_id": "111",
                "uid": "3d348c41e8d6428eb75dcc5467492287",
                "response_text": "The story follows a couple, the Faircloths. It starts out with George being tired of his marriage, and he wants to find ways to enjoy his life more. The story is narrated in first person, so we get much better insight into George’s thoughts. He describes his marriage as tiresome and draining, and says that he would have liked to divorce his wife a long time ago. He tries to flirt with different women, but his wife finds out and that just leads to more and more fighting. One day, one of his coworkers tells him about a new technology that allows him to buy a perfect robot replica of himself. George doubts buying the technology, because it is illegal, but then decides to do it. The robot he buys is a perfect replica of himself, and can be completely controlled by George. George uses the robot to stay at home with his wife while he goes out with different women. George is very happy with how his life is going, and he also starts to notice that his wife is much happier than before. Slowly, Prime George starts to defy George’s orders until one day he realizes that Prime George bought two one-way tickets to Bermuda. George gets worried that his wife ran off with the android, but then she enters the house as if nothing happened and tells George that she wasn’t going to run off with the android. When they embrace, George realizes that he was hugging an android replica of his wife, and he seems okay with that. "
              },
              {
                "worker_id": "108",
                "uid": "e3b88f4f101345c392c43b0bc03bbd4e",
                "response_text": "The story introduces Goerge Faircloth, husband to Marge Faircloth. The two live together and have been in a marriage for eight years. The story is told through George who explains that he has been desperate to find a way out of their marriage. He finds Marge complaining, whining too much and picking up on every little detail he does that does not go her way. Because of the Family Solidarity Amendment of 1968, divorce was never an option for them as taxes charged on it are too high.At work, George envies his co-worker, Harry Folsom, who is equally not in the happiest relationship but is allowed to gets away with traveling away from his wife. Marge is easily jealous. George has an affair with his new secretary, Jeree, which Marge finds out about and calls George out over dinner. The next morning, Harry advises George to get an “Ego Prime,” a clone android of one’s self that looks and behaves just like the real person. This “Ego Prime,” however, seems to only be accessible to highly respected individuals with reputable titles. Harry recommends an agent from the black market to George. The agent recommends the Utility model but George wants the Super Deluxe Model. George’s measurements are taken and after the whole process, gets to meet “George Prime.” The android is delivered to George’s home along with a remote. George has manipulated Marge beforehand as to not make her check upon the garage, which is where he plans to hide George Prime. The first week George Prime was put to use, George was barely at home, hanging out with not only Jeree but also other women. When he came back home ready for work, he would turn George Prime off and get to work. As time went on, George noticed something different: Marge became softer, nicer, cooking him dinner with music he likes. George Prime tells him he has just been telling her the right things. George Prime starts getting out of control as he makes his own decisions like going to the liquor store or spending intimate time with Marge overnight. George unexpectedly starts to crave Marge and cancels on his date. As he gets a call from the bank informing him about checks that were made to his account, he realizes Marge has known his tactic all along, and has been using the android to get what she wants, a trip to Bermuda. He finds no way out as calling the police would out get him into prison because of the prime being illegal. He comes back home to Marge, who expected would already be on the trip. She tells him she knew all along and realized she never fully appreciated the real him. From hugging her and feeling the depression button under her hair, he realizes Marge has also been using a Prime. He is, however, satisfied with her prime as she seems to do and say all the right things.\n"
              }
            ]
          },
          {
            "question_text": "What is the significance of the “Prime” technology?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "112",
                "uid": "04dba3dc7983427b9d5d8c1088f67294",
                "response_text": "The Ego Prime is a technology that produces a robotic duplicate of a person. This duplicate is based on a neuro-pantograph with a humanlike body and soul. The duplicate is identical to a real person, including the habits, thought processes, physiological functions, or even the handwritten legal signature that one person may have. The only difference between the real person and one’s duplicate is that the duplicate has a finger-depression button hidden underneath the hair above the ear. Throughout the story, George, a husband who has been tired of his wife, buys a George Prime, the duplicate of himself, to deal with his wife and have sexual affairs with other women around his office. However, he finds out that George Prime leaves with her wife, and his wife, Marge Faircloth, sends her duplicate Marge Prime to accompany her, just as he did to her. The exchange of their duplicates to escape from the unsatisfying marriage contributes to most of the story. Prime technology plays a significant role as duplicates can satisfy human needs better than a natural person. Due to this characteristic of being able to meet one’s demand by their logical inferences and inability to feel annoyed, the duplicates of both sides become the ideal mates for each person, both George and Marge, ending the story with both of them living with the Primes. Without Prime Technology, the story would not have developed."
              },
              {
                "worker_id": "113",
                "uid": "0f71335354ce468884f6cce52a5c4a36",
                "response_text": "The Prime technology allows George to spend evenings with his other romantic partners without maddening or upsetting his wife. He leaves his duplicate created with the Prime technology with her while spending his nights in other places. She is not supposed to notice the substitution, but eventually, George realizes that she did. She uses this knowledge to convince George Prime to buy two tickets to Bermuda. Apparently, she enjoys George Prime’s company and feels happier with him than with her real husband. George, too, enjoys spending time with the duplicate of his wife at the end of the story, claiming that this android is a dream in comparison to all the other women he knows. The Prime technology practically ends the relationship between George and Marge but allows them to get better partners. "
              },
              {
                "worker_id": "111",
                "uid": "3d348c41e8d6428eb75dcc5467492287",
                "response_text": "The prime technology is one of the most important parts of the story. It allows George to get a break from a draining marriage. The technology allows people to make android replicas that can be completely controlled by their owners, and that is completely the same as the owner. George uses this technology to make a copy of himself that keeps his wife busy and happy. While the android is with his wife, he takes advantage to meet with many different women that he couldn’t have met before. Slowly, the android starts to stretch George’s commands, and George realizes that he has to turn the android off. Before he can do this, the android runs off with his wife. George realizes that his wife also had a prime replica. "
              },
              {
                "worker_id": "108",
                "uid": "e3b88f4f101345c392c43b0bc03bbd4e",
                "response_text": "The “Prime” is a technology that allows an individual to create an android clone of themselves that looks and behaves like them. This can be used for many intentions, in this story’s case, to get some time off a marriage that no longer brings joy to the parties involved. The technology is said to have been started by Hunyadi who invented the “Neuro-pantograph.” Larger technology enterprises then bought the model to modify and improve it further. The “Ego Prime” by “Ego Prime, Inc.” became so popular that the wives all over the country caught up with what the technology was and what its purpose was for. That is when black markets for the same technology started, which is where George gets his Prime. The Primes have different levels of model specificity ranging from the Utility model to the Super Deluxe model, which is the one George requests. The individual has to go through measurements and be under NP microprobes to create their Prime. The Prime produced has remote controls and has neurological pathways that are identical to its owner ingrained in them, allowing them to behave like the owner. All physicialities are identical except for finger-depression above the Prime’s ear which if clicked, would end the android.\n"
              }
            ]
          },
          {
            "question_text": "How is the theme of marriage explored throughout the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "112",
                "uid": "04dba3dc7983427b9d5d8c1088f67294",
                "response_text": "The story starts with a husband, George Faircloth, who is unsatisfied with his marriage, trying to escape from his wife without communicating with her. Throughout the story, he uses Prime Technology, a technology that can produce an identical duplicate of a human, to deal with his wife’s complaints and other annoying interactions with him. However, when he finds out that George Prime, his duplicate, gets along better with his wife than him and finally leaves him behind together, he realizes what he has done wrong. When he feels desperate, his wife’s duplicate comes to stay with him, and he finally finds his wife’s duplicate better than his wife. The central theme of the story is the marriage relationship. The beginning of the story reveals a marriage failure where both the husband and the wife are not satisfied with each other after years-long marriage. Their solutions are not to communicate with each other or change for the better but to escape from each other through Prime technology. In the middle of the story, where George Faircloth once finds his wife adorable again due to George Prime’s effort, it shows the importance of communication and mutual support in the marriage, which is lacking in their relationship. The ending of the story, where both of them live with the duplicates of each other, indicates that a good relationship in marriage is to listen to and satisfy what each other needs with proper communication."
              },
              {
                "worker_id": "113",
                "uid": "0f71335354ce468884f6cce52a5c4a36",
                "response_text": "George Faircloth deems his marriage unhappy because it’s permanent. He doesn’t enjoy spending all his time with the same woman, even though he initially loved Marge. He is exhausted and theoretically would be happy to get a divorce. His despair leads to the events that follow his inner monologue. He buys an android that resembles him and activates him when he wants to meet a woman or simply leave the house for a bit. At the end, Marge and George Prime empty Faircloth’s accounts and go to Bermuda. They are happy together. George himself enjoys living with Marge’s android because she seems like a dream to him, a perfect woman. George and Marge both get too tired of their unhappy, imperfect marriage and choose ideal partners instead."
              },
              {
                "worker_id": "111",
                "uid": "3d348c41e8d6428eb75dcc5467492287",
                "response_text": "Marriage is depicted as an awful thing. George hates his marriage, but he can’t end it because there are laws that would have allowed his wife to take a lot of his money. George says that he constantly fights with his wife, and that he finds it very hard to spend time with her due to her jealousy and other bad attributes. Marriage is depicted as something that people must do, but isn’t taken seriously, as George very easily cheats on his wife with other women from the office. "
              },
              {
                "worker_id": "108",
                "uid": "e3b88f4f101345c392c43b0bc03bbd4e",
                "response_text": "One of the central themes explored in “Prime Difference” is the concept of marriage. The story revolves around a couple, George Faircloth and Marge Faircloth, trapped in an eight year long unhappy marriage. Marge complains, whines and cries too much for George. Equally, George does not fulfill his potential in being a good, supportive husband either. After trying to fix it in every way possible, George is hopeless and gives in to the idea of getting an “Ego Prime,” a android clone of him that would look and act like him, allowing him to lead a joyful parallel life as the android directly deals with his wife.\n\nFirst, the story gives a social commentary on the concept of marriage. With the couple being trapped in such a long unhappy marriage, even after trying to fix it yet not finding any way out of it, the story showcases the unnatural aspect of marriage as a social construct. Two individuals are bound to live life together but yet are not able to get out of it because of an imaginary societal contract they agreed upon and societal norms that would view such action as dishonorable. Instead of finding other ways other than a divorce, which they could not afford, to fix it, they thus put up with living together unhappily. This leaves the reader questioning whether marriage should truly limit two individuals’ freedom to this extent.\n\nThe story also gives a commentary on the nature of a good marriage. As the story goes on, George’s Ego Prime starts to turn Marge into a softer, nicer woman, who George starts to appreciate more. George Prime gives credit to this change in behavior to his choice of saying the right things, in other words, the things Marge wants to hear. Equally, when George finds out the Marge he has been falling for again is merely a Prime too, he still accepts and wants her as she makes him feel appreciated. These intentions make the readers question the selfishness behind the concept of marriage. Do we agree to a marital contract purely for our own selfishness of wanting to be serviced and on some level, praised? Are the nice actions we do for our partners merely to selfishly receive those same actions back?\n"
              }
            ]
          },
          {
            "question_text": "What is the relationship between George Faircloth and Marge Faircloth?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "112",
                "uid": "04dba3dc7983427b9d5d8c1088f67294",
                "response_text": "George Faircloth and Marge Faircloth are husband and wife. They have married for 8 years. Their relationship is toxic and unsatisfying. George is fed up with Marge’s constant complaints, grievance, and crying. Marge is unsatisfied with George’s inattention to her and his possible affairs with women in his office, so she often spies on George’s office life, which irritates George more. They are constantly in fight. Their way of communicating with each other is to attack and fight, and they haven’t seen each other carefully and sweetly for a long time. Their relationship is to conquer and be conquered repeatedly, fighting all the time."
              },
              {
                "worker_id": "113",
                "uid": "0f71335354ce468884f6cce52a5c4a36",
                "response_text": "George and Marge Faircloth have been married for eight years. George claims that their life is full of scandals and distrust. They fight ninety percent of the time. Marge is often complaining, crying, or criticizing George. She is jealous, and once when a new secretary started working with George, she threw a tantrum and spoiled the evening. Marge doesn’t get enough attention from him and knows that he can be indecent. They both do not enjoy living together, and George finds it easy to buy the Prime android and spend his evenings with his female colleagues. At the end, Marge and George end up with the android duplicates of their spouse and feel much happier. "
              },
              {
                "worker_id": "111",
                "uid": "3d348c41e8d6428eb75dcc5467492287",
                "response_text": "The relationship between George and Marge is very tense. It seems as if in the past they had a great relationship, but now they just fight. George states that they fight almost every night, and that it is very hard for them to spend time together without there being something that Marge complains about. It is also clear that George doesn’t try to make Marge happy anymore. Both of them quit the relationship and instead bought prime androids so that they could have more freedom outside of the marriage. "
              },
              {
                "worker_id": "108",
                "uid": "e3b88f4f101345c392c43b0bc03bbd4e",
                "response_text": "George Faircloth and Marge Faircloth are a couple that have been engaged for eight years. They are trapped in an unhappy marriage where George feels trapped by a wife, who although he finds stunning, does not stop complaining, crying and whining about the most unnecessary issues of their coupled life. The two have tried to make the marriage better but never yet succeeded. They were never able to consider divorce as an option because the Family Solidarity Amendment of 1968 charges incredibly high taxes on the process. Marge is also a jealous wife which makes George feel even more suffocated. Marge finds out that George has an affair with his secretary, Jeree. In the story, George finds a solution to this unhappy marriage by purchasing an Ego Prime, an android clone of himself that looks and behaves like him, so that he can go on about his life as the android deals with the coupled life for him. In the first stage, this android brings him lots of joy as he is able to meet with his secretary and other women as he pleases. Then, as he notices that his wife gets more tender and more caring, he starts appreciating and missing her more. By the end of the story, he finds out that Marge knew his trick all along and that she booked herself a trip to Bermuda with his money. Marge also had a Prime of herself, who is the real person George has in fact fallen for.\n"
              }
            ]
          },
          {
            "question_text": "Who is Harry Folsom and what role does he play in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "112",
                "uid": "04dba3dc7983427b9d5d8c1088f67294",
                "response_text": "Harry Folsom is a colleague of George Faircloth, a husband fed up with his wife. He also has a wife who is unbearable to him, but he gets the chance to escape from her once in a while. In addition, he has a friend who knows how to get the Ego Prime, a technology to produce duplicate people from natural human beings, from the black market. Harry is the person who inspires and provides the resource for George to get an illegal Ego Prime, which contributes to the whole story."
              },
              {
                "worker_id": "113",
                "uid": "0f71335354ce468884f6cce52a5c4a36",
                "response_text": "Harry Folsom is George’s colleague and friend. They work at the same office. George is envious of him because Folsom can leave his wife and go to Rio from time to time, and George doesn't have this opportunity. Harry is also the person who mentions purchasing the Ego Prime when he talks with George. During this conversation, he explains that getting the android is not very expensive and can solve all the family issues George has. Harry also gives him the contact details of a man from whom George can buy the deluxe model with open circuits. "
              },
              {
                "worker_id": "111",
                "uid": "3d348c41e8d6428eb75dcc5467492287",
                "response_text": "Harry Folsom is one of George’s friends and coworkers. After George complains to him about the state of his marriage, Harry is the one that offers George the solution of getting a prime android replica of himself. George seems to be jealous of Harry because Harry once in a while goes out with different women without his wife finding out. Harry helped George get the prime replica, as Harry knew people that sold them. Basically, it was Harry who steered George into buying the android and lying to his wife. "
              },
              {
                "worker_id": "108",
                "uid": "e3b88f4f101345c392c43b0bc03bbd4e",
                "response_text": "Harry Folsom is George Faircloth’s co-worker who works at the same office. He is the individual who shows him the possibility of freedom from his wife and the actions to take to make it happen. In his unhappy marriage, George has always been envious of men like Harry. Harry’s wife is equally not easy to deal with but the difference was he would always get away with leaving to Rio every now and then with a stenographer. He plays an important role when Harry comes to him for advice the day after Marge finds out about Harry’s secretary, Jeree, and their affair. Over coffee the next morning, Harry is the person who jokingly suggests George to get an Ego Prime, selling him the idea of freedom from a wife, to which George initially declines because of how it is illegal. Still saying that he is joking, Harry confirms that with the right contact, George could get one of those androids at a decent price. After successfully convincing George, Harry recommends one of his contacts to him. Following his advice, George finds himself meeting an agent with a mustache from the black market for Primes, who from then took on the responsibility to create George’s Prime. Without Harry’s lifestyle and recommendations in the story, George may not have chosen to go on with creating his Prime.\n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5006,
        "document_length_chars": 27791
      }
    }
  ]
}