{
  "item_metadata": {
    "item_id": "51337",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51337",
      "content": "THE MAN OUTSIDE\n \n \n By EVELYN E. SMITH\n \n Illustrated by DILLON\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction August 1957. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n No one, least of all Martin, could dispute that a man's life should be guarded by his kin—but by those who hadn't been born yet?\n \n\n \n Nobody in the neighborhood was surprised when Martin's mother disappeared and Ninian came to take care of him. Mothers had a way of disappearing around those parts and the kids were often better off without them. Martin was no exception. He'd never had it this good while he was living with his old lady. As for his father, Martin had never had one. He'd been a war baby, born of one of the tides of soldiers—enemies and allies, both—that had engulfed the country in successive waves and bought or taken the women. So there was no trouble that way.\n \n Sometimes he wondered who Ninian really was. Obviously that story about her coming from the future was just a gag. Besides, if she really was his great-great-grand-daughter, as she said, why would she tell him to call her \" Aunt Ninian \"? Maybe he was only eleven, but he'd been around and he knew just what the score was. At first he'd thought maybe she was some new kind of social worker, but she acted a little too crazy for that.\n \n He loved to bait her, as he had loved to bait his mother. It was safer with Ninian, though, because when he pushed her too far, she would cry instead of mopping up the floor with him.\n \n \"But I can't understand,\" he would say, keeping his face straight. \"Why do you have to come from the future to protect me against your cousin Conrad?\"\n \n \"Because he's coming to kill you.\"\n \n \"Why should he kill me? I ain't done him nothing.\"\n \n Ninian sighed. \"He's dissatisfied with the current social order and killing you is part of an elaborate plan he's formulated to change it. You wouldn't understand.\"\n \n \"You're damn right. I don't understand. What's it all about in straight gas?\"\n \n \"Oh, just don't ask any questions,\" Ninian said petulantly. \"When you get older, someone will explain the whole thing to you.\"\n \n \n\n \n So Martin held his peace, because, on the whole, he liked things the way they were. Ninian really was the limit, though. All the people he knew lived in scabrous tenement apartments like his, but she seemed to think it was disgusting.\n \n \"So if you don't like it, clean it up,\" he suggested.\n \n She looked at him as if he were out of his mind.\n \n \"Hire a maid, then!\" he jeered.\n \n And darned if that dope didn't go out and get a woman to come clean up the place! He was so embarrassed, he didn't even dare show his face in the streets—especially with the women buttonholing him and demanding to know what gave. They tried talking to Ninian, but she certainly knew how to give them the cold shoulder.\n \n One day the truant officer came to ask why Martin hadn't been coming to school. Very few of the neighborhood kids attended classes very regularly, so this was just routine. But Ninian didn't know that and she went into a real tizzy, babbling that Martin had been sick and would make up the work. Martin nearly did get sick from laughing so hard inside.\n \n But he laughed out of the other side of his mouth when she went out and hired a private tutor for him. A tutor—in that neighborhood! Martin had to beat up every kid on the block before he could walk a step without hearing \"Fancy Pants!\" yelled after him.\n \n Ninian worried all the time. It wasn't that she cared what these people thought of her, for she made no secret of regarding them as little better than animals, but she was shy of attracting attention. There were an awful lot of people in that neighborhood who felt exactly the same way, only she didn't know that, either. She was really pretty dumb, Martin thought, for all her fancy lingo.\n \n \"It's so hard to think these things out without any prior practical application to go by,\" she told him.\n \n He nodded, knowing what she meant was that everything was coming out wrong. But he didn't try to help her; he just watched to see what she'd do next. Already he had begun to assume the detached role of a spectator.\n \n When it became clear that his mother was never going to show up again, Ninian bought one of those smallish, almost identical houses that mushroom on the fringes of a city after every war, particularly where intensive bombing has created a number of desirable building sites.\n \n \"This is a much better neighborhood for a boy to grow up in,\" she declared. \"Besides, it's easier to keep an eye on you here.\"\n \n And keep an eye on him she did—she or a rather foppish young man who came to stay with them occasionally. Martin was told to call him Uncle Raymond.\n \n From time to time, there were other visitors—Uncles Ives and Bartholomew and Olaf, Aunts Ottillie and Grania and Lalage, and many more—all cousins to one another, he was told, all descendants of his.\n \n \n\n \n Martin was never left alone for a minute. He wasn't allowed to play with the other kids in the new neighborhood. Not that their parents would have let them, anyway. The adults obviously figured that if a one-car family hired private tutors for their kid, there must be something pretty wrong with him. So Martin and Ninian were just as conspicuous as before. But he didn't tip her off. She was grown up; she was supposed to know better than he did.\n \n He lived well. He had food to eat that he'd never dreamed of before, warm clothes that no one had ever worn before him. He was surrounded by more luxury than he knew what to do with.\n \n The furniture was the latest New Grand Rapids African modern. There were tidy, colorful Picasso and Braque prints on the walls. And every inch of the floor was modestly covered by carpeting, though the walls were mostly unabashed glass. There were hot water and heat all the time and a freezer well stocked with food—somewhat erratically chosen, for Ninian didn't know much about meals.\n \n The non-glass part of the house was of neat, natural-toned wood, with a neat green lawn in front and a neat parti-colored garden in back.\n \n Martin missed the old neighborhood, though. He missed having other kids to play with. He even missed his mother. Sure, she hadn't given him enough to eat and she'd beaten him up so hard sometimes that she'd nearly killed him—but then there had also been times when she'd hugged and kissed him and soaked his collar with her tears. She'd done all she could for him, supporting him in the only way she knew how—and if respectable society didn't like it, the hell with respectable society.\n \n From Ninian and her cousins, there was only an impersonal kindness. They made no bones about the fact that they were there only to carry out a rather unpleasant duty. Though they were in the house with him, in their minds and in their talk they were living in another world—a world of warmth and peace and plenty where nobody worked, except in the government service or the essential professions. And they seemed to think even that kind of job was pretty low-class, though better than actually doing anything with the hands.\n \n In their world, Martin came to understand, nobody worked with hands; everything was done by machinery. All the people ever did was wear pretty clothes and have good times and eat all they wanted. There was no devastation, no war, no unhappiness, none of the concomitants of normal living.\n \n It was then that Martin began to realize that either the whole lot of them were insane, or what Ninian had told him at first was the truth. They came from the future.\n \n \n\n \n When Martin was sixteen, Raymond took him aside for the talk Ninian had promised five years before.\n \n \"The whole thing's all my brother Conrad's fault. You see, he's an idealist,\" Raymond explained, pronouncing the last word with distaste.\n \n Martin nodded gravely. He was a quiet boy now, his brief past a dim and rather ridiculous memory. Who could ever imagine him robbing a grocery store or wielding a broken bottle now? He still was rather undersized and he'd read so much that he'd weakened his eyes and had to wear glasses. His face was pallid, because he spent little time in the sun, and his speech rather overbred, his mentors from the future having carefully eradicated all current vulgarities.\n \n \"And Conrad really got upset over the way Earth has been exploiting the not so intelligent life-forms on the other planets,\" Raymond continued. \"Which is distressing—though, of course, it's not as if they were people. Besides, the government has been talking about passing laws to do away with the—well, abuses and things like that, and I'm sure someday everything will come out all right. However, Conrad is so impatient.\"\n \n \"I thought, in your world, machines did all the work,\" Martin suggested.\n \n \"I've told you—our world is precisely the same as this one!\" Raymond snapped. \"We just come a couple of centuries or so later, that's all. But remember, our interests are identical. We're virtually the same people ... although it is amazing what a difference two hundred odd years of progress and polish can make in a species, isn't it?\"\n \n He continued more mildly: \"However, even you ought to be able to understand that we can't make machinery without metal. We need food. All that sort of thing comes from the out-system planets. And, on those worlds, it's far cheaper to use native labor than to ship out all that expensive machinery. After all, if we didn't give the natives jobs, how would they manage to live?\"\n \n \"How did they live before? Come to think of it, if you don't work, how do you live now?... I don't mean in the now for me, but the now for you,\" Martin explained laboriously. It was so difficult to live in the past and think in the future.\n \n \"I'm trying to talk to you as if you were an adult,\" Raymond said, \"but if you will persist in these childish interruptions—\"\n \n \"I'm sorry,\" Martin said.\n \n But he wasn't, for by now he had little respect left for any of his descendants. They were all exceedingly handsome and cultivated young people, with superior educations, smooth ways of speaking and considerable self-confidence, but they just weren't very bright. And he had discovered that Raymond was perhaps the most intelligent of the lot. Somewhere in that relatively short span of time, his line or—more frightening—his race had lost something vital.\n \n Unaware of the near-contempt in which his young ancestor held him, Raymond went on blandly: \"Anyhow, Conrad took it upon himself to feel particularly guilty, because, he decided, if it hadn't been for the fact that our great-grandfather discovered the super-drive, we might never have reached the stars. Which is ridiculous—his feeling guilty, I mean. Perhaps a great-grandfather is responsible for his great-grandchildren, but a great-grandchild can hardly be held accountable for his great-grandfather.\"\n \n \"How about a great-great-grandchild?\" Martin couldn't help asking.\n \n \n\n \n Raymond flushed a delicate pink. \"Do you want to hear the rest of this or don't you?\"\n \n \"Oh, I do!\" Martin said. He had pieced the whole thing together for himself long since, but he wanted to hear how Raymond would put it.\n \n \"Unfortunately, Professor Farkas has just perfected the time transmitter. Those government scientists are so infernally officious—always inventing such senseless things. It's supposed to be hush-hush, but you know how news will leak out when one is always desperate for a fresh topic of conversation.\"\n \n Anyhow, Raymond went on to explain, Conrad had bribed one of Farkas' assistants for a set of the plans. Conrad's idea had been to go back in time and \"eliminate!\" their common great-grandfather. In that way, there would be no space-drive, and, hence, the Terrestrials would never get to the other planets and oppress the local aborigines.\n \n \"Sounds like a good way of dealing with the problem,\" Martin observed.\n \n Raymond looked annoyed. \"It's the adolescent way,\" he said, \"to do away with it, rather than find a solution. Would you destroy a whole society in order to root out a single injustice?\"\n \n \"Not if it were a good one otherwise.\"\n \n \"Well, there's your answer. Conrad got the apparatus built, or perhaps he built it himself. One doesn't inquire too closely into such matters. But when it came to the point, Conrad couldn't bear the idea of eliminating our great-grandfather—because our great-grandfather was such a good man, you know.\" Raymond's expressive upper lip curled. \"So Conrad decided to go further back still and get rid of his great-grandfather's father—who'd been, by all accounts, a pretty worthless character.\"\n \n \"That would be me, I suppose,\" Martin said quietly.\n \n Raymond turned a deep rose. \"Well, doesn't that just go to prove you mustn't believe everything you hear?\" The next sentence tumbled out in a rush. \"I wormed the whole thing out of him and all of us—the other cousins and me—held a council of war, as it were, and we decided it was our moral duty to go back in time ourselves and protect you.\" He beamed at Martin.\n \n The boy smiled slowly. \"Of course. You had to. If Conrad succeeded in eliminating me, then none of you would exist, would you?\"\n \n Raymond frowned. Then he shrugged cheerfully. \"Well, you didn't really suppose we were going to all this trouble and expense out of sheer altruism, did you?\" he asked, turning on the charm which all the cousins possessed to a consternating degree.\n \n \n\n \n Martin had, of course, no illusions on that score; he had learned long ago that nobody did anything for nothing. But saying so was unwise.\n \n \"We bribed another set of plans out of another of the professor's assistants,\" Raymond continued, as if Martin had answered,\n\"and—ah—induced a handicraft enthusiast to build the gadget for us.\"\n  Induced , Martin knew, could have meant anything from blackmail to the use of the iron maiden.\n \n \"Then we were all ready to forestall Conrad. If one of us guarded you night and day, he would never be able to carry out his plot. So we made our counter-plan, set the machine as far back as it would go—and here we are!\"\n \n \"I see,\" Martin said.\n \n Raymond didn't seem to think he really did. \"After all,\" he pointed out defensively, \"whatever our motives, it has turned into a good thing for you. Nice home, cultured companions, all the contemporary conveniences, plus some handy anachronisms—I don't see what more you could ask for. You're getting the best of all possible worlds. Of course Ninian was a ninny to locate in a mercantile suburb where any little thing out of the way will cause talk. How thankful I am that our era has completely disposed of the mercantiles—\"\n \n \"What did you do with them?\" Martin asked.\n \n But Raymond rushed on: \"Soon as Ninian goes and I'm in full charge, we'll get a more isolated place and run it on a far grander scale. Ostentation—that's the way to live here and now; the richer you are, the more eccentricity you can get away with. And,\" he added, \"I might as well be as comfortable as possible while I suffer through this wretched historical stint.\"\n \n \"So Ninian's going,\" said Martin, wondering why the news made him feel curiously desolate. Because, although he supposed he liked her in a remote kind of way, he had no fondness for her—or she, he knew, for him.\n \n \"Well, five years is rather a long stretch for any girl to spend in exile,\" Raymond explained, \"even though our life spans are a bit longer than yours. Besides, you're getting too old now to be under petticoat government.\" He looked inquisitively at Martin. \"You're not going to go all weepy and make a scene when she leaves, are you?\"\n \n \"No....\" Martin said hesitantly. \"Oh, I suppose I will miss her. But we aren't very close, so it won't make a real difference.\" That was the sad part: he already knew it wouldn't make a difference.\n \n Raymond clapped him on the shoulder. \"I knew you weren't a sloppy sentimentalist like Conrad. Though you do have rather a look of him, you know.\"\n \n Suddenly that seemed to make Conrad real. Martin felt a vague stirring of alarm. He kept his voice composed, however. \"How do you plan to protect me when he comes?\"\n \n \"Well, each one of us is armed to the teeth, of course,\" Raymond said with modest pride, displaying something that looked like a child's combination spaceman's gun and death ray, but which, Martin had no doubt, was a perfectly genuine—and lethal—weapon. \"And we've got a rather elaborate burglar alarm system.\"\n \n Martin inspected the system and made one or two changes in the wiring which, he felt, would increase its efficiency. But still he was dubious. \"Maybe it'll work on someone coming from outside this house , but do you think it will work on someone coming from outside this time ?\"\n \n \"Never fear—it has a temporal radius,\" Raymond replied. \"Factory guarantee and all that.\"\n \n \"Just to be on the safe side,\" Martin said, \"I think I'd better have one of those guns, too.\"\n \n \"A splendid idea!\" enthused Raymond. \"I was just about to think of that myself!\"\n \n \n\n \n When it came time for the parting, it was Ninian who cried—tears at her own inadequacy, Martin knew, not of sorrow. He was getting skillful at understanding his descendants, far better than they at understanding him. But then they never really tried. Ninian kissed him wetly on the cheek and said she was sure everything would work out all right and that she'd come see him again. She never did, though, except at the very last.\n \n Raymond and Martin moved into a luxurious mansion in a remote area. The site proved a well-chosen one; when the Second Atomic War came, half a dozen years later, they weren't touched. Martin was never sure whether this had been sheer luck or expert planning. Probably luck, because his descendants were exceedingly inept planners.\n \n Few people in the world then could afford to live as stylishly as Martin and his guardian. The place not only contained every possible convenience and gadget but was crammed with bibelots and antiques, carefully chosen by Raymond and disputed by Martin, for, to the man from the future, all available artifacts were antiques. Otherwise, Martin accepted his new surroundings. His sense of wonder had become dulled by now and the pink pseudo-Spanish castle—\"architecturally dreadful, of course,\" Raymond had said, \"but so hilariously typical\"—impressed him far less than had the suburban split-level aquarium.\n \n \"How about a moat?\" Martin suggested when they first came. \"It seems to go with a castle.\"\n \n \n\n \n \"Do you think a moat could stop Conrad?\" Raymond asked, amused.\n \n \"No,\" Martin smiled, feeling rather silly, \"but it would make the place seem safer somehow.\"\n \n The threat of Conrad was beginning to make him grow more and more nervous. He got Raymond's permission to take two suits of armor that stood in the front hall and present them to a local museum, because several times he fancied he saw them move. He also became an adept with the ray gun and changed the surrounding landscape quite a bit with it, until Raymond warned that this might lead Conrad to them.\n \n During those early years, Martin's tutors were exchanged for the higher-degreed ones that were now needful. The question inevitably arose of what the youth's vocation in that life was going to be. At least twenty of the cousins came back through time to hold one of their vigorous family councils. Martin was still young enough to enjoy such occasions, finding them vastly superior to all other forms of entertainment.\n \n \n\n \n \"This sort of problem wouldn't arise in our day, Martin,\" Raymond commented as he took his place at the head of the table, \"because, unless one specifically feels a call to some profession or other, one just—well, drifts along happily.\"\n \n \"Ours is a wonderful world,\" Grania sighed at Martin. \"I only wish we could take you there. I'm sure you would like it.\"\n \n \"Don't be a fool, Grania!\" Raymond snapped. \"Well, Martin, have you made up your mind what you want to be?\"\n \n Martin affected to think. \"A physicist,\" he said, not without malice.\n\"Or perhaps an engineer.\"\n \n There was a loud, excited chorus of dissent. He chuckled inwardly.\n \n \"Can't do that,\" Ives said. \"Might pick up some concepts from us. Don't know how; none of us knows a thing about science. But it could happen. Subconscious osmosis, if there is such a thing. That way, you might invent something ahead of time. And the fellow we got the plans from particularly cautioned us against that. Changing history. Dangerous.\"\n \n \"Might mess up our time frightfully,\" Bartholomew contributed, \"though, to be perfectly frank, I can't quite understand how.\"\n \n \"I am not going to sit down and explain the whole thing to you all over again, Bart!\" Raymond said impatiently. \"Well, Martin?\"\n \n \"What would you suggest?\" Martin asked.\n \n \"How about becoming a painter? Art is eternal. And quite gentlemanly. Besides, artists are always expected to be either behind or ahead of their times.\"\n \n \"Furthermore,\" Ottillie added, \"one more artist couldn't make much difference in history. There were so many of them all through the ages.\"\n \n Martin couldn't hold back his question. \"What was I, actually, in that other time?\"\n \n There was a chilly silence.\n \n \"Let's not talk about it, dear,\" Lalage finally said. \"Let's just be thankful we've saved you from that !\"\n \n So drawing teachers were engaged and Martin became a very competent second-rate artist. He knew he would never be able to achieve first rank because, even though he was still so young, his work was almost purely intellectual. The only emotion he seemed able to feel was fear—the ever-present fear that someday he would turn a corridor and walk into a man who looked like him—a man who wanted to kill him for the sake of an ideal.\n \n But the fear did not show in Martin's pictures. They were pretty pictures.\n \n \n\n \n Cousin Ives—now that Martin was older, he was told to call the descendants cousin —next assumed guardianship. Ives took his responsibilities more seriously than the others did. He even arranged to have Martin's work shown at an art gallery. The paintings received critical approval, but failed to evoke any enthusiasm. The modest sale they enjoyed was mostly to interior decorators. Museums were not interested.\n \n \"Takes time,\" Ives tried to reassure him. \"One day they'll be buying your pictures, Martin. Wait and see.\"\n \n Ives was the only one of the descendants who seemed to think of Martin as an individual. When his efforts to make contact with the other young man failed, he got worried and decided that what Martin needed was a change of air and scenery.\n \n \"'Course you can't go on the Grand Tour. Your son hasn't invented space travel yet. But we can go see this world. What's left of it. Tourists always like ruins best, anyway.\"\n \n So he drew on the family's vast future resources and bought a yacht, which Martin christened The Interregnum . They traveled about from sea to ocean and from ocean to sea, touching at various ports and making trips inland. Martin saw the civilized world—mostly in fragments; the nearly intact semi-civilized world and the uncivilized world, much the same as it had been for centuries. It was like visiting an enormous museum; he couldn't seem to identify with his own time any more.\n \n The other cousins appeared to find the yacht a congenial head-quarters, largely because they could spend so much time far away from the contemporary inhabitants of the planet and relax and be themselves. So they never moved back to land. Martin spent the rest of his life on The Interregnum . He felt curiously safer from Conrad there, although there was no valid reason why an ocean should stop a traveler through time.\n \n More cousins were in residence at once than ever before, because they came for the ocean voyage. They spent most of their time aboard ship, giving each other parties and playing an avant-garde form of shuffleboard and gambling on future sporting events. That last usually ended in a brawl, because one cousin was sure to accuse another of having got advance information about the results.\n \n Martin didn't care much for their company and associated with them only when not to have done so would have been palpably rude. And, though they were gregarious young people for the most part, they didn't court his society. He suspected that he made them feel uncomfortable.\n \n \n\n \n He rather liked Ives, though. Sometimes the two of them would be alone together; then Ives would tell Martin of the future world he had come from. The picture drawn by Raymond and Ninian had not been entirely accurate, Ives admitted. True, there was no war or poverty on Earth proper, but that was because there were only a couple of million people left on the planet. It was an enclave for the highly privileged, highly interbred aristocracy, to which Martin's descendants belonged by virtue of their distinguished ancestry.\n \n \"Rather feudal, isn't it?\" Martin asked.\n \n Ives agreed, adding that the system had, however, been deliberately planned, rather than the result of haphazard natural development. Everything potentially unpleasant, like the mercantiles, had been deported.\n \n \"Not only natives livin' on the other worlds,\" Ives said as the two of them stood at the ship's rail, surrounded by the limitless expanse of some ocean or other. \"People, too. Mostly lower classes, except for officials and things. With wars and want and suffering,\" he added regretfully, \"same as in your day.... Like now, I mean,\" he corrected himself. \"Maybe it is worse, the way Conrad thinks. More planets for us to make trouble on. Three that were habitable aren't any more. Bombed. Very thorough job.\"\n \n \"Oh,\" Martin murmured, trying to sound shocked, horrified—interested, even.\n \n \"Sometimes I'm not altogether sure Conrad was wrong,\" Ives said, after a pause. \"Tried to keep us from getting to the stars, hurting the people—I expect you could call them people—there. Still—\" he smiled shamefacedly—\"couldn't stand by and see my own way of life destroyed, could I?\"\n \n \"I suppose not,\" Martin said.\n \n \"Would take moral courage. I don't have it. None of us does, except Conrad, and even he—\" Ives looked out over the sea. \"Must be a better way out than Conrad's,\" he said without conviction. \"And everything will work out all right in the end. Bound to. No sense to—to anything, if it doesn't.\" He glanced wistfully at Martin.\n \n \"I hope so,\" said Martin. But he couldn't hope; he couldn't feel; he couldn't even seem to care.\n \n During all this time, Conrad still did not put in an appearance. Martin had gotten to be such a crack shot with the ray pistol that he almost wished his descendant would show up, so there would be some excitement. But he didn't come. And Martin got to thinking....\n \n He always felt that if any of the cousins could have come to realize the basic flaw in the elaborate plan they had concocted, it would have been Ives. However, when the yacht touched at Tierra del Fuego one bitter winter, Ives took a severe chill. They sent for a doctor from the future—one of the descendants who had been eccentric enough to take a medical degree—but he wasn't able to save Ives. The body was buried in the frozen ground at Ushuaia, on the southern tip of the continent, a hundred years or more before the date of his birth.\n \n A great many of the cousins turned up at the simple ceremony. All were dressed in overwhelming black and showed a great deal of grief. Raymond read the burial service, because they didn't dare summon a clerical cousin from the future; they were afraid he might prove rather stuffy about the entire undertaking.\n \n \"He died for all of us,\" Raymond concluded his funeral eulogy over Ives, \"so his death was not in vain.\"\n \n But Martin disagreed.\n \n \n\n \n The ceaseless voyaging began again. The Interregnum voyaged to every ocean and every sea. Some were blue and some green and some dun. After a while, Martin couldn't tell one from another. Cousin after cousin came to watch over him and eventually they were as hard for him to tell apart as the different oceans.\n \n \n\n \n All the cousins were young, for, though they came at different times in his life, they had all started out from the same time in theirs. Only the young ones had been included in the venture; they did not trust their elders.\n \n As the years went by, Martin began to lose even his detached interest in the land and its doings. Although the yacht frequently touched port for fuel or supplies—it was more economical to purchase them in that era than to have them shipped from the future—he seldom went ashore, and then only at the urging of a newly assigned cousin anxious to see the sights. Most of the time Martin spent in watching the sea—and sometimes he painted it. There seemed to be a depth to his seascapes that his other work lacked.\n \n When he was pressed by the current cousin to make a land visit somewhere, he decided to exhibit a few of his sea paintings. That way, he could fool himself into thinking that there was some purpose to this journey. He'd come to believe that perhaps what his life lacked was purpose, and for a while he kept looking for meaning everywhere, to the cousin's utter disgust.\n \n \"Eat, drink and be merry, or whatever you Romans say when you do as you do,\" the cousin—who was rather woolly in history; the descendants were scraping bottom now—advised.\n \n Martin showed his work in Italy, so that the cousin could be disillusioned by the current crop of Romans. He found that neither purpose nor malice was enough; he was still immeasurably bored. However, a museum bought two of the paintings. Martin thought of Ives and felt an uncomfortable pang of a sensation he could no longer understand.\n \n \"Where do you suppose Conrad has been all this time?\" Martin idly asked the current cousin—who was passing as his nephew by now.\n \n The young man jumped, then glanced around him uncomfortably. \"Conrad's a very shrewd fellow,\" he whispered. \"He's biding his time—waiting until we're off guard. And then—pow!—he'll attack!\"\n \n \"Oh, I see,\" Martin said.\n \n He had often fancied that Conrad would prove to be the most stimulating member of the whole generation. But it seemed unlikely that he would ever have a chance for a conversation with the young man. More than one conversation, anyhow.\n \n \"When he does show up, I'll protect you,\" the cousin vowed, touching his ray gun. \"You haven't a thing to worry about.\"\n \n Martin smiled with all the charm he'd had nothing to do but acquire. \"I have every confidence in you,\" he told his descendant. He himself had given up carrying a gun long ago.\n \n There was a war in the Northern Hemisphere and so The Interregnum voyaged to southern waters. There was a war in the south and they hid out in the Arctic. All the nations became too drained of power—fuel and man and will—to fight, so there was a sterile peace for a long time. The Interregnum roamed the seas restlessly, with her load of passengers from the future, plus one bored and aging contemporary. She bore big guns now, because of the ever-present danger of pirates.\n \n \n\n \n Perhaps it was the traditionally bracing effect of sea air—perhaps it\n was the sheltered life—but Martin lived to be a very old man. He was a\n hundred and four when his last illness came. It was a great relief when\n the family doctor, called in again from the future, said there was no\n hope. Martin didn't think he could have borne another year of life.\n \n All the cousins gathered at the yacht to pay their last respects to\n their progenitor. He saw Ninian again, after all these years, and\n Raymond—all the others, dozens of them, thronging around his bed,\n spilling out of the cabin and into the passageways and out onto the\n deck, making their usual clamor, even though their voices were hushed.\n \n Only Ives was missing. He'd been the lucky one, Martin knew. He had\n been spared the tragedy that was going to befall these blooming young\n people—all the same age as when Martin had last seen them and doomed\n never to grow any older. Underneath their masks of woe, he could see\n relief at the thought that at last they were going to be rid of their\n responsibility. And underneath Martin's death mask lay an impersonal\n pity for those poor, stupid descendants of his who had blundered so\n irretrievably.\n \n \n\n \n There was only one face which Martin had never seen before. It wasn't\n a strange face, however, because Martin had seen one very like it in\n the looking glass when he was a young man.\n \n \"You must be Conrad,\" Martin called across the cabin in a voice that\n was still clear. \"I've been looking forward to meeting you for some\n time.\"\n \n The other cousins whirled to face the newcomer.\n \n \"You're too late, Con,\" Raymond gloated for the whole generation. \"He's\n lived out his life.\"\n \n \"But he hasn't lived out his life,\" Conrad contradicted. \"He's lived\n out the life you created for him. And for yourselves, too.\"\n \n For the first time, Martin saw compassion in the eyes of one of his\n lineage and found it vaguely disturbing. It didn't seem to belong there.\n \n \"Don't you realize even yet,\" Conrad went on, \"that as soon as he goes,\n you'll go, too—present, past, future, wherever you are, you'll go up\n in the air like puffs of smoke?\"\n \n \"What do you mean?\" Ninian quavered, her soft, pretty face alarmed.\n \n Martin answered Conrad's rueful smile, but left the explanations up to\n him. It was his show, after all.\n \n \"Because you will never have existed,\" Conrad said. \"You have no right\n to existence; it was you yourselves who watched him all the time,\n so he didn't have a chance to lead a normal life, get married, have\n children ....\"\n \n \n\n \n Most of the cousins gasped as the truth began to percolate through.\n \n \"I knew from the very beginning,\" Conrad finished, \"that I didn't\n have to do anything at all. I just had to wait and you would destroy\n yourselves.\"\n \n \"I don't understand,\" Bartholomew protested, searching the faces of the\n cousins closest to him. \"What does he mean, we have never existed?\n We're here, aren't we? What—\"\n \n \"Shut up!\" Raymond snapped. He turned on Martin. \"You don't seem\n surprised.\"\n \n The old man grinned. \"I'm not. I figured it all out years ago.\"\n \n At first, he had wondered what he should do. Would it be better to\n throw them into a futile panic by telling them or to do nothing? He\n had decided on the latter; that was the role they had assigned him—to\n watch and wait and keep out of things—and that was the role he would\n play.\n \n \"You knew all the time and you didn't tell us!\" Raymond spluttered.\n\"After we'd been so good to you, making a gentleman out of you instead\n of a criminal.... That's right,\" he snarled, \"a criminal! An alcoholic,\n a thief, a derelict! How do you like that?\"\n \n \"Sounds like a rich, full life,\" Martin said wistfully.\n \n What an exciting existence they must have done him out of! But then, he\n couldn't help thinking, he—he and Conrad together, of course—had done\n them out of any kind of existence. It wasn't his responsibility,\n though; he had done nothing but let matters take whatever course was\n destined for them. If only he could be sure that it was the better\n course, perhaps he wouldn't feel that nagging sense of guilt inside\n him. Strange—where, in his hermetic life, could he possibly have\n developed such a queer thing as a conscience?\n \n \"Then we've wasted all this time,\" Ninian sobbed, \"all this energy, all\n this money, for nothing!\"\n \n \"But you were nothing to begin with,\" Martin told them. And then,\n after a pause, he added, \"I only wish I could be sure there had been\n some purpose to this.\"\n \n He didn't know whether it was approaching death that dimmed his sight,\n or whether the frightened crowd that pressed around him was growing\n shadowy.\n \n \"I wish I could feel that some good had been done in letting you be\n wiped out of existence,\" he went on voicing his thoughts. \"But I know\n that the same thing that happened to your worlds and my world will\n happen all over again. To other people, in other times, but again. It's\n bound to happen. There isn't any hope for humanity.\"\n \n One man couldn't really change the course of human history, he told\n himself. Two men, that was—one real, one a shadow.\n \n Conrad came close to the old man's bed. He was almost transparent.\n \n \"No,\" he said, \"there is hope. They didn't know the time transmitter\n works two ways. I used it for going into the past only once—just this\n once. But I've gone into the future with it many times. And—\" he\n pressed Martin's hand—\"believe me, what I did—what we did, you and\n I—serves a purpose. It will change things for the better. Everything\n is going to be all right.\"\n \n \n\n \n Was Conrad telling him the truth, Martin wondered, or was he just\n giving the conventional reassurance to the dying? More than that, was\n he trying to convince himself that what he had done was the right\n thing? Every cousin had assured Martin that things were going to be all\n right.\n \n Was Conrad actually different from the rest?\n \n His plan had worked and the others' hadn't, but then all his plan had\n consisted of was doing nothing. That was all he and Martin had done ...\n nothing. Were they absolved of all responsibility merely because they\n had stood aside and taken advantage of the others' weaknesses?\n \n \"Why,\" Martin said to himself, \"in a sense, it could be said that I\n have fulfilled my original destiny—that I am a criminal.\"\n \n Well, it didn't matter; whatever happened, no one could hold him to\n blame. He held no stake in the future that was to come. It was other\n men's future—other men's problem. He died very peacefully then, and,\n since he was the only one left on the ship, there was nobody to bury\n him.\n \n The unmanned yacht drifted about the seas for years and gave rise to\n many legends, none of them as unbelievable as the truth.",
      "metadata": {
        "title": "The Man Outside",
        "author": "Evelyn E. Smith",
        "passage_id": "51337",
        "uid": "5b6d0e89cde040e28502e8595cfaa883",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "109",
                "uid": "3561073fc40741b88473fc08e7d90fc1",
                "response_text": "This story follows the life of Martin from a young boy living in a rough neighborhood to an old man dying aboard an unmanned ship. We first see Martin following the disappearance of his mother - and lack of a father - which are commonplace in the neighborhood he grows up in where the kids rarely attend school and their living conditions are poor. Martin is taken in by a young woman, Ninian, who instructs him to call her Aunt Ninian despite being identified as his future descendant. Ninian has traveled back in time to her great-great-grandfather - Martin - in order to protect him from his future son Conrad. Conrad, described as an idealist, is dismayed by the future generations exploitation of Earth and destructive social order that casts out anyone and everything that doesn't encompass the privileged and elite. To correct the wrongdoings of the future, Conrad plans to kill Martin. The rest of Conrad’s cousins intercept this plan and instead, all decide to travel into the past to accompany Martin and protect him from an assassination attempt. \n\nMartin’s formative years are accompanied by Ninian, Raymond and Ives where he picks up art as a career, forms impersonal relationships with his descendants and learns more about the past and future quality of life. As years pass with no threat of Conrad in sight, Martin begins to explore his world alongside Ives on a yacht named The Interregnum. Soon though, the cousins that come and go begin to blur together and Martin picks up a detached view of the world as his interest wanes in his sheltered life. Martin lives to a very old age, and on his deathbed aboard the yacht, he is surrounded by all his descendants besides Ives, who passed of sickness earlier before. It is at this moment that Conrad appears, seemingly to finish his murder plot. However, it is revealed that no action was required to be taken by Conrad, as his fellow cousins have already achieved the mission of erasing their lineage. By containing Martin to a sheltered life, the cousins prevented Martin from living his normal life with a wife and kids, thus removing the possibility of their existence in the past, present and future. Furthermore, it is revealed that Martin had come to the same conclusion years ago, and chose instead to keep quiet out of his disdain for his descendants. With the cousins horrified at the knowledge, Conrad reassures Martin that their inaction resulted in hope, and Martin ponders to wonder if the assurance was genuine as he peacefully dies alone on the boat. \n"
              },
              {
                "worker_id": "107",
                "uid": "0784e4f29ffd49f8a1a30aa6951e2062",
                "response_text": "Martin’s mother disappears, but nobody is surprised because mothers usually disappear around these parts. Ninian comes to take care of him, and he has no father because he was born as a war baby. Martin thinks that the story about Ninian being from the future is a gag, and he likes to bait her because she ends up crying. Ninian, however, tells him that she is protecting him from her cousin Conrad who is coming to kill him in the future. His living conditions have improved, but Martin misses his old neighborhood where he could play with the other children. Ninian and her relatives only take care of him as if it is some unpleasant duty; he learns that nobody works with hands anymore in their world because it is all done by machinery. When Martin turns sixteen, Raymond tells him about Conrad and his idealist ideas of making living fairer for the exploited natives on other planets. Conrad blames his great-grandfather for discovering the super drive. Conrad then bribes one of Professor Farka’s assistants to reveal information about a time transmitter, and he plans to go back in time to eliminate the common ancestor. Raymond explains that they got plans from another assistant and a handicrafts enthusiast to build another gadget. They could guard over Martin day and night so Conrad could not attack. Raymond explains that Ninian is leaving, and Martin feels oddly desolate because of their time together. When she leaves, Ninian cries at her inadequacy; Martin and Raymond move to a luxurious mansion in a remote area that protects them from the Second Atomic War. The relatives come back to hold meetings; Martin thinks he wants to be a physicist or engineer, but the relatives insist that he should be a painter. Ives eventually takes over and displays his art in a museum, and he buys a yacht called The Interregnum to go traveling. He lives out the rest of his days on the yacht with the other descendants, but he does not care for them much. Ives explains that the future world is not that much better, and he isn’t even sure if Conrad is wrong. Ives, however, ends up dying from a chill. Eventually, Martin’s work is bought by a museum in Italy; he asks one cousin where Conrad is. He lies dying at one hundred and four as the relatives all come to visit. Conrad comes to visit too, and he explains to the other cousins that they will all disappear because Martin was never allowed to lead a normal life. After realizing that the other man knew all along, Raymond calls Martin a criminal, but Martin does not mind. Conrad tells him that their plan will benefit the future, but Martin is not sure if he is telling the truth or not. As Martin dies, he is the only one left on the ship because everybody else has disappeared. "
              },
              {
                "worker_id": "111",
                "uid": "837518b16e9e4208ad9f984833a2ec42",
                "response_text": "The story describes the life of Martin, a young kid whose mother dies. When this happens, a new woman begins to take care of him. She, called Ninian, tells Martin that she comes from the future, and is there to take care of him. Throughout this, Martin doesn’t question the motives of his caretaker. Later, it is also revealed that she is a descendant of Martin. More and more descendants of Martin come to his time in order to take care of him, taking turns of about 5 years in doing so, and are referred to as cousins. One of the cousins also reveals that the reason that they are protecting him is because one of their cousins wants to kill him. This is because one of Martin’s descendants created a piece of equipment that allowed humans to travel through space, leading to humans taking advantage of native species of other planets for their own economic benefit. Conrad, the descendant who wanted to kill him, wants to stop humans from ever traveling through space. Martin continues this boring life, preparing for the eventual arrival of Conrad who wants to kill him. Throughout his boring and repetitive life, Martin begins to question the actions of his descendants. When eventually Martin is an old man and is going to die, all of his descendants get together to say goodbye. This is where Conrad finally made an appearance, and it is revealed that everything was part of Conrad’s plan, as living his repetitive life Martin never had the chance to have children, therefore stopping his descendant from inventing the equipment necessary for human space travel. "
              },
              {
                "worker_id": "113",
                "uid": "ae0500e6163146dcaa2e25dfb8e7999e",
                "response_text": "The story tells about the life of a boy called Martin. At the beginning, he lives in a poor neighborhood with his mother, who disappears one day. Instead, he is now looked after by Ninian, who claims to be Martin’s descendant from the future who came here to protect him from Conrad - Ninian’s cousin. She hires private tutors for him and soon decides to move to a better neighborhood and live in a big well-furnished house. Occasionally, the other descendants, like Ives or Raymond, also visit them and talk about the future where almost nobody works, and everything is done by machinery. Martin turns sixteen when Raymond finally tells him the full story: Raymond's brother Conrad was disappointed by the fact that the humans of his time exploited the other life forms on the other planets to get food and resources. He decided to eliminate their common ancestor - Martin -  so that no space travel inventions would have existed. The others - cousins as he should call them - went back in time to save him and, consequently, save themselves. Martin also learns about the security system and the collection of weaponry they have to protect him. Soon Ninian leaves, and Martin, together with Raymond, moves into a luxurious mansion in a remote area. They talk about Martin’s future occupation. Though he prefers engineering or physics, they choose art to avoid any accidental premature inventions he can create since he is already familiar with the science of the future. Martin becomes a second-rate artist, and his new guardian - Ives - arrives. He decides to buy a yacht - The Interregnum - and see the rest of the world with Martin. Martin doesn’t develop any special feelings for his ancestors, except for Ives. Martin learns more about the future from him: only an enclave of a couple of million people left on Earth, and representatives of the lower classes got deported to the other planets and are being exploited; several worlds have already been made inhabitable. Ives admits that his brother is not completely wrong, but he still cannot let him destroy his life. \n\nOne winter, Ives rapidly dies from a severe chill in Tierra del Fuego after they stopped there for a bit. Years go by, and Martin loses any interest in life, sometimes painting the sea view from the yacht. They stop in Italy, and he sells two paintings. Wars force them to go to different hemispheres and the Arctic. Eventually, Martin turns a hundred and four when his last illness comes. Finally, Conrad appears. He shocks all the gathered ancestors by explaining that the sheltered life they had created for Martin didn’t allow him to live his own life, or at least, have kids. When he dies, everyone will disappear, too. Martin figured it out years ago. Conrad assures him that his deed leads to a better future because he has been there. Erasing the future all his ancestors came from, Martin peacefully dies on the yacht, which drifts for years about the seas. "
              }
            ]
          },
          {
            "question_text": "What is the relationship between Martin and Ives?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "109",
                "uid": "3561073fc40741b88473fc08e7d90fc1",
                "response_text": "Cousin Ives enters Martin’s life when he is a little older, and is the third descendant to accompany him as his guardian. Out of all his descendants to assume guardianship, Martin forms the closest relationship with Ives. Rather than seeing Martin as a responsibility and duty, Ives sees Martin as an individual and seeks ways to connect and encourage his passions. For one, Ives buys a yacht named The Interregnum to which the pair take upon themselves to explore the current world in. They traveled across the waters and inland to see both the civilized and uncivilized world, with Martin taking it all in. \n\nWhen it was just the two of them, their relationship progressed further. Ives began to open up about the future world that he and his descendants come from and explain the nuances of the social order that rules. Ives is the first to explicitly and honestly describe the feudal and privileged social class that Martin’s descendants take part in, only due to their fortunate ancestry. Additionally, Ives is the only cousin to admit the potential truth in Conrad’s intentions, noting the dilemma between achieving moral good and selfishing maintaining their own good life. Martin even comments his confidence in Ives being able to see the obvious flaw in the cousins’ plans. However, during one winter, Ives fell ill to a severe chill and passed away before his own birth. After Ives’ death, Martin relently voyages across oceans and soon as they and the cousins blur, he begins to live detachedly. \n"
              },
              {
                "worker_id": "107",
                "uid": "0784e4f29ffd49f8a1a30aa6951e2062",
                "response_text": "Martin shares a much better relationship with Ives than with the rest of the cousins. He is told to call Ives his cousin because he is older when Ives takes responsibility. Martin begins to paint more, and Ives arranges to have his works shown in a gallery. When there is little interest in his artwork, Ives reassures him that people will grow to enjoy them. Martin also thinks that Ives is the only one who tries to see him as an individual, even arranging a yacht to be bought so they can see the world. Martin likes spending time with Ives, and Ives also tells him about the world of the future. He explains to Martin that there is no poverty because only a couple million elusive and privileged people are left on the planet. Ives also explains that this system had been deliberately planned, leaving the lower class people and other planets’ natives to suffer. He also is not even sure that Conrad’s thinking is wrong, but he cannot bring himself to watch his way of life change. When Ives dies from his chill, Raymond makes a speech about his death not being in vain. Martin, however, disagrees. When Martin’s paintings are bought later by an Italian museum, he thinks back to what Ives had said before and feels uncomfortable. As Martin lies dying, he thinks about how Ives is lucky to have been spared the same tragedy as the young people surrounding him. "
              },
              {
                "worker_id": "111",
                "uid": "837518b16e9e4208ad9f984833a2ec42",
                "response_text": "Ives is one of Martin's descendants who wants to protect him from the eventual arrival of Conrad to kill Martin. Ives and Martin have a very good relationship, as Ives tries to help Martin in his painting career. Ives also tells Martin of everything that has gone on in the future, and why Conrad wants to kill him. Martin would also contemplate life with Ives, and question the actions of the cousins. Ives also takes the effort to connect emotionally with Martin, which is when Ives dies it makes Martin very sad. "
              },
              {
                "worker_id": "113",
                "uid": "ae0500e6163146dcaa2e25dfb8e7999e",
                "response_text": "Ives is the first so-called cousin who respects Martin and sees an individual in him. Ives seems to be smarter than the other cousins and is also more honest with him. He admits that the future is not as ideal as Raymond and Ninian claim. He says Conrad was not completely wrong about the unfairness of the future’s way of life, but Ives himself still lacks the moral courage to be like him. Martin likes Ives, and even after the cousin dies, he thinks about him when he is older. "
              }
            ]
          },
          {
            "question_text": "What is the role of the ‘cousins’ in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "109",
                "uid": "3561073fc40741b88473fc08e7d90fc1",
                "response_text": "The ‘cousins’ featured in this story are all direct descendants of Martin, identified to be great-great-granddaughters and -sons. Instructed to be called Aunts and Uncles by a young Martin and then later cousins by a mature Martin, they have rallied together to travel into the past in order to protect and guard Martin from an assassination attempt by Conrad. Conrad, a fellow cousin, is thought to be an idealist by his fellow cousins and adamantly wrong in his belief that the right thing to do is to erase their lineage in order to correct injustice in their future society. Despite the heroic protection of Martin, we find out that the cousins’ guardianship of Martin is selfish in nature. Aside from Ives, Martin holds largely impersonal relationships with his cousins, who appear to view Martin as a reluctant duty. Because of Conrad as a looming threat over Martin’s livelihood, a rotation of cousins traveling from the future assume guardianship over Martin and dictates his life in his hobbies or the information he knows - all to protect their own livelihood. \n\nAt Martin’s deathbed, we find out that the cousins have had the wrong idea this entire time. In their insistence at protecting Martin and shaping his life to what they created for him, they signed their own death warrant. In all their planning and supposed intelligence and worthiness, the cousins have failed to observe the flaw in the plan: that if Martin had no wife and no children, then their very existence would be naught. Their forced presence in Martin’s life had rid Martin’s potential exciting existence - and in return - Martin’s lackluster existence had rid the cousins of any kind of existence. \n"
              },
              {
                "worker_id": "107",
                "uid": "0784e4f29ffd49f8a1a30aa6951e2062",
                "response_text": "The role of the ‘cousins’ in the story is to protect Martin from Conrad coming to kill him. When Conrad begins to idealize a better world, the ‘cousins’ realize that this will change their way of life forever. Therefore, they decide to go back in time and protect Martin, so there is no way for Conrad to kill him. They must protect Martin because the ‘cousins’ are Martin’s descendants from the future. The ‘cousins’ begin looking after Martin shortly after he is born, and they make him their responsibility to ensure that Conrad fails in his goals. The ‘cousins’ also use their vast family wealth to move him to a better neighborhood and hire tutors. Later, Raymond uses this money to move them to a remote mansion, where he continues to look after Martin. They even pool their resources to have him become an artist, and Ives later buys The Interregnum to go traveling. The ‘cousins’ are determined to change Martin’s fate from the future without even realizing that they end up destroying themselves because they have controlled his life for so long. "
              },
              {
                "worker_id": "111",
                "uid": "837518b16e9e4208ad9f984833a2ec42",
                "response_text": "The cousins have a very important role in the story, as they took it upon themselves to save Martin’s life, and stop their other cousin from killing him. By doing this, they end up basically ruining Martin's life, as in their efforts to protect him they stopped him from having a normal and happy life. It can also be said that cousin Conrad was in the right, as he was willing to sacrifice his life in order to stop the disastrous actions of humans in the future. "
              },
              {
                "worker_id": "113",
                "uid": "ae0500e6163146dcaa2e25dfb8e7999e",
                "response_text": "After one of the descendants - Conrad - seemingly pans to go back in time and kill his ancestor - Martin, his other relatives decide to defend him from Conrad. They create a sheltered life for him and start taking care of Martin at the very beginning of the story, changing their shifts after some years. They make Martin move to different houses and then to a yacht, where he spends the rest of his life. They choose a profession for him, explain the future to him, and remind him about Conrad. They completely changed his life, erasing the future he was supposed to have. Simultaneously, they unconsciously ruin their own existence because, as we learn at the end, their overprotection didn’t enable Martin to have a real life or a family with kids. Their unkind attitude towards Martin also doesn’t make him emotionally connected to them. And he doesn’t tell them about the mistake they made, eventually deciding that this version of the future probably should not exist."
              }
            ]
          },
          {
            "question_text": "What is the significance of time in this story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "109",
                "uid": "3561073fc40741b88473fc08e7d90fc1",
                "response_text": "First, time is significant in this story as the main plotline to the cousins' interactions with Martin. With the future having time travel as a reality, characters in this story like Ninian are able to jump back and forth between the past - to bring Martin out of poverty and vulgar background - and the future to her present time. Although the characters in this story utilize time as an unchangeable and linear concept, we find out through hints in the story and at the final moment that time here is fluid and flexible. Anything that occurs in the past will affect the reality of the future. This is a startling pocket of truth that the cousins fail to realize until Martin’s deathbed - where they are horrified to find out that their selfish desire to protect their comfortable reality in the future had actually led to their own demise and ridded their entire existence. \n\nAdditionally, time is used to explore the ruling ideologies of the social class both in present and in future. Despite the cousins proclaiming the future world to be free of poverty and highly privileged, Ives reveals that the realities of both worlds are similar in having wars and want and suffering. Only, with the latter future world dealing with these unsavory characters in exiling them and maintaining a feudal class system. \n"
              },
              {
                "worker_id": "107",
                "uid": "0784e4f29ffd49f8a1a30aa6951e2062",
                "response_text": "Time is very significant in this story because it relates to all characters. Conrad uses the time transmitter from Professor Farka to travel to the future to observe different possibilities. He also travels back one last time to see the dying Martin and tell him what they are doing for the universe’s interest. Martin’s descendants travel back in time to protect him from Conrad, but they control most of his life to the point where he has no free will. Martin, however, sees his time as abundant because he spends most of his time with his relatives anyways. They are the only people he ever interacts with, and he finds himself living a purposeless life with all of the free time that he has. However, time is also significant in that it is what eventually erases all of his descendants from the past, present, and future. "
              },
              {
                "worker_id": "111",
                "uid": "837518b16e9e4208ad9f984833a2ec42",
                "response_text": "Time plays a significant role in this story. Time is what allowed Martin's descendant to invent space travel, and is what eventually led to Conrad trying to kill him. Also, the cousins used time travel in order to go back to Martin’s time and to try and protect him from Conrad’s actions. Another important thing about time is that the cousins never aged as they protected Martin, leading to them stuck forever protecting Martin, until Martin dies, after which they never existed. "
              },
              {
                "worker_id": "113",
                "uid": "ae0500e6163146dcaa2e25dfb8e7999e",
                "response_text": "Time in this story becomes a very flexible notion, allowing Martin’s descendants to use time travel to find him in the past and protect Martin from Conrad, who wants to kill him, thus erasing the timeline in which humans use exploitation of other people and life forms. Thanks to time travel, Martin can meet his descendants and learn what the future looks like for humans. Their arrival changes his life, and initially, he becomes anxious and curious but eventually loses interest in everything around him because his sheltered existence deprives him of any real feelings, except for fear of Conrad. Their plan leads to the elimination of the future they came from, showing how changing the past events affects the future. "
              }
            ]
          },
          {
            "question_text": "Does Martin’s attitudes towards the cousins change throughout the story, and why?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "109",
                "uid": "3561073fc40741b88473fc08e7d90fc1",
                "response_text": "When Ninian initially arrives, Martin blatantly considers her to be dumb. Dumb to hire a cleaning maid, dumb to freak out over Martin’s absence at school, and dumb to hire a private tutor. Even with them moving to a different and more privileged neighborhood, he considers her dumb to go through all this effort to still remain conspicuous. \n\nAs the reasons behind the cousins’ presence in the past and guardianship over Martin is revealed, his sentiment towards them remains the same. It seems that Martin is able to catch onto the obvious flaw in the cousins’ plans quite early on, and yet with so many cousins slipping in and out, and despite their proclaimed intelligence, none of them are able to pick up on this flaw. The flaw being: with Martin having no children, their very existence becomes an impossibility. This is revealed at the end of the story where Martin is on his deathbed, noting that he had come to this conclusion many years before and had chosen not to say anything. \n"
              },
              {
                "worker_id": "107",
                "uid": "0784e4f29ffd49f8a1a30aa6951e2062",
                "response_text": "Martin's attitude towards the cousins does not ever really change throughout the story. Initially, he thinks that Ninian is foolish and fun to bait because she wounds up crying. Although Ninian does her best to care for him, he knows that all of his relatives are only doing it out of their interest. They see him as a rather unpleasant duty, while he does not try to get to know them either. When Raymond talks to him, he looks down on Martin and tries to be superior. Even when they move on to the yacht later, Martin only associates with them to not seem rude. The only cousin he becomes fond of is Ives because Ives is the only one who sees Martin as an individual. Martin becomes used to having them around, but it becomes difficult to tell them apart because there are many. Most of them are only interested in fulfilling their responsibility, so he does not get to know them apart from Ives. Even when the cousins realize from Conrad what they have done by controlling Martin, he is not surprised by how inept his descendants are. He does not seem too regretful about what his descendants have done until the end. "
              },
              {
                "worker_id": "111",
                "uid": "837518b16e9e4208ad9f984833a2ec42",
                "response_text": "At the beginning Martin believed the actions of his cousins, and everything they told him. While he got older and older, he started to see the flaws in the plans of his cousins. He understood that if they continued in that cycle then he would never live his life and have children. Even though he knew the flaws, he always followed what the cousins said, and never pointed out the flaws to them. He decided to follow the role that the cousins wanted him to follow. "
              },
              {
                "worker_id": "113",
                "uid": "ae0500e6163146dcaa2e25dfb8e7999e",
                "response_text": "At the beginning of the story, Martin is curious about Ninian. But as other cousins arrive, he becomes less and less interested in them. They do not seem incredibly bright or eager to get to know him. They show that they are carrying out duty and never bother to be more considerate or show excitement. The only cousin that Martin likes is Ives because he tries to see Martin as an individual and is brighter than his other relatives. Martin’s cousins cut him off from the life he got used to and never allow him to make his own decisions. He is trapped in their plan to save their lives, and they don't try to be respectful or care about his desires. Even when he is dying, their faces show a sign of relief. In general, Martin never felt any love or compassion for his descendants."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 6509,
        "document_length_chars": 37913
      }
    }
  ]
}