{
  "item_metadata": {
    "item_id": "51336",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51336",
      "content": "What is POSAT?\n \n \n By PHYLLIS STERLING SMITH\n \n Illustrated by ED ALEXANDER\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction September 1951. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n Of course coming events cast their shadows before, but this shadow was 400 years long!\n \n \n \n The following advertisement appeared in the July 1953 issue of several magazines:\n \n \n MASTERY OF ALL KNOWLEDGE CAN BE YOURS!\n \n \n What is the secret source of those profound principles that can solve the problems of life? Send for our FREE booklet of explanation.\n \n \n Do not be a leaf in the wind! YOU can alter the course of your life!\n \n \n Tap the treasury of Wisdom through the ages!\n \n \n The Perpetual Order of Seekers After Truth\n \n \n POSAT\n \n \n an ancient secret society\n \n Most readers passed it by with scarcely a glance. It was, after all, similar to the many that had appeared through the years under the name of that same society. Other readers, as their eyes slid over the familiar format of the ad, speculated idly about the persistent and mildly mysterious organization behind it. A few even resolved to clip the attached coupon and send for the booklet—sometime—when a pen or pencil was nearer at hand.\n \n Bill Evans, an unemployed pharmacist, saw the ad in a copy of Your Life and Psychology that had been abandoned on his seat in the bus. He filled out the blanks on the coupon with a scrap of stubby pencil.\n\"You can alter the course of your life!\" he read again. He particularly liked that thought, even though he had long since ceased to believe it. He actually took the trouble to mail the coupon. After all, he had, literally, nothing to lose, and nothing else to occupy his time.\n \n Miss Elizabeth Arnable was one of the few to whom the advertisement was unfamiliar. As a matter of fact, she very seldom read a magazine. The radio in her room took the place of reading matter, and she always liked to think that it amused her cats as well as herself. Reading would be so selfish under the circumstances, wouldn't it? Not but what the cats weren't almost smart enough to read, she always said.\n \n It just so happened, however, that she had bought a copy of the Antivivisectionist Gazette the day before. She pounced upon the POSAT ad as a trout might snap at a particularly attractive fly. Having filled out the coupon with violet ink, she invented an errand that would take her past the neighborhood post office so that she could post it as soon as possible.\n \n Donald Alford, research physicist, came across the POSAT ad tucked at the bottom of a column in The Bulletin of Physical Research . He was engrossed in the latest paper by Dr. Crandon, a man whom he admired from the point of view of both a former student and a fellow research worker. Consequently, he was one of the many who passed over the POSAT ad with the disregard accorded to any common object.\n \n He read with interest to the end of the article before he realized that some component of the advertisement had been noted by a region of his brain just beyond consciousness. It teased at him like a tickle that couldn't be scratched until he turned back to the page.\n \n It was the symbol or emblem of POSAT, he realized, that had caught his attention. The perpendicularly crossed ellipses centered with a small black circle might almost be a conventionalized version of the Bohr atom of helium. He smiled with mild skepticism as he read through the printed matter that accompanied it.\n \n \"I wonder what their racket is,\" he mused. Then, because his typewriter was conveniently at hand, he carefully tore out the coupon and inserted it in the machine. The spacing of the typewriter didn't fit the dotted lines on the coupon, of course, but he didn't bother to correct it. He addressed an envelope, laid it with other mail to be posted, and promptly forgot all about it. Since he was a methodical man, it was entrusted to the U.S. mail early the next morning, together with his other letters.\n \n Three identical forms accompanied the booklet which POSAT sent in response to the three inquiries. The booklet gave no more information than had the original advertisement, but with considerable more volubility. It promised the recipient the secrets of the Cosmos and the key that would unlock the hidden knowledge within himself—if he would merely fill out the enclosed form.\n \n Bill Evans, the unemployed pharmacist, let the paper lie unanswered for several days. To be quite honest, he was disappointed. Although he had mentally disclaimed all belief in anything that POSAT might offer, he had watched the return mails with anticipation. His own resources were almost at an end, and he had reached the point where intervention by something supernatural, or at least superhuman, seemed the only hope.\n \n He had hoped, unreasonably, that POSAT had an answer. But time lay heavily upon him, and he used it one evening to write the requested information—about his employment (ha!), his religious beliefs, his reason for inquiring about POSAT, his financial situation. Without quite knowing that he did so, he communicated in his terse answers some of his desperation and sense of futility.\n \n Miss Arnable was delighted with the opportunity for autobiographical composition. It required five extra sheets of paper to convey all the information that she wished to give—all about her poor, dear father who had been a missionary to China, and the kinship that she felt toward the mystic cults of the East, her belief that her cats were reincarnations of her loved ones (which, she stated, derived from a religion of the Persians; or was it the Egyptians?) and in her complete and absolute acceptance of everything that POSAT had stated in their booklet. And what would the dues be? She wished to join immediately. Fortunately, dear father had left her in a comfortable financial situation.\n \n To Donald Alford, the booklet seemed to confirm his suspicion that POSAT was a racket of some sort. Why else would they be interested in his employment or financial position? It also served to increase his curiosity.\n \n \"What do you suppose they're driving at?\" he asked his wife Betty, handing her the booklet and questionnaire.\n \n \"I don't really know what to say,\" she answered, squinting a little as she usually did when puzzled. \"I know one thing, though, and that's that you won't stop until you find out!\"\n \n \"The scientific attitude,\" he acknowledged with a grin.\n \n \"Why don't you fill out this questionnaire incognito, though?\" she suggested. \"Pretend that we're wealthy and see if they try to get our money. Do they have anything yet except your name and address?\"\n \n Don was shocked. \"If I send this back to them, it will have to be with correct answers!\"\n \n \"The scientific attitude again,\" Betty sighed. \"Don't you ever let your imagination run away with the facts a bit? What are you going to give for your reasons for asking about POSAT?\"\n \n \"Curiosity,\" he replied, and, pulling his fountain pen from his vest pocket, he wrote exactly that, in small, neat script.\n \n It was unfortunate for his curiosity that Don could not see the contents of the three envelopes that were mailed from the offices of POSAT the following week. For this time they differed.\n \n Bill Evans was once again disappointed. The pamphlet that was enclosed gave what apparently meant to be final answers to life's problems. They were couched in vaguely metaphysical terms and offered absolutely no help to him.\n \n His disappointment was tempered, however, by the knowledge that he had unexpectedly found a job. Or, rather, it had fallen into his lap. When he had thought that every avenue of employment had been tried, a position had been offered him in a wholesale pharmacy in the older industrial part of the city. It was not a particularly attractive place to work, located as it was next to a large warehouse, but to him it was hope for the future.\n \n It amused him to discover that the offices of POSAT were located on the other side of the same warehouse, at the end of a blind alley. Blind alley indeed! He felt vaguely ashamed for having placed any confidence in them.\n \n Miss Arnable was thrilled to discover that her envelope contained not only several pamphlets, (she scanned the titles rapidly and found that one of them concerned the sacred cats of ancient Egypt), but that it contained also a small pin with the symbol of POSAT wrought in gold and black enamel. The covering letter said that she had been accepted as an active member of POSAT and that the dues were five dollars per month; please remit by return mail. She wrote a check immediately, and settled contentedly into a chair to peruse the article on sacred cats.\n \n After a while she began to read aloud so that her own cats could enjoy it, too.\n \n Don Alford would not have been surprised if his envelope had shown contents similar to the ones that the others received. The folded sheets of paper that he pulled forth, however, made him stiffen with sharp surprise.\n \n \n\n \n \"Come here a minute, Betty,\" he called, spreading them out carefully on the dining room table. \"What do you make of these?\"\n \n She came, dish cloth in hand, and thoughtfully examined them, one by one. \"Multiple choice questions! It looks like a psychological test of some sort.\"\n \n \"This isn't the kind of thing I expected them to send me,\" worried Don. \"Look at the type of thing they ask. 'If you had discovered a new and virulent poison that could be compounded from common household ingredients, would you (1) publish the information in a daily newspaper, (2) manufacture it secretly and sell it as rodent exterminator, (3) give the information to the armed forces for use as a secret weapon, or (4) withhold the information entirely as too dangerous to be passed on?'\"\n \n \"Could they be a spy ring?\" asked Betty. \"Subversive agents? Anxious to find out your scientific secrets like that classified stuff that you're so careful of when you bring it home from the lab?\"\n \n Don scanned the papers quickly. \"There's nothing here that looks like an attempt to get information. Besides, I've told them nothing about my work except that I do research in physics. They don't even know what company I work for. If this is a psychological test, it measures attitudes, nothing else. Why should they want to know my attitudes?\"\n \n \"Do you suppose that POSAT is really what it claims to be—a secret society—and that they actually screen their applicants?\"\n \n He smiled wryly. \"Wouldn't it be interesting if I didn't make the grade after starting out to expose their racket?\"\n \n He pulled out his pen and sat down to the task of resolving the dilemmas before him.\n \n His next communication from POSAT came to his business address and, paradoxically, was more personal than its forerunners.\n \n Dear Doctor Alford:\n \n We have examined with interest the information that you have sent to us. We are happy to inform you that, thus far, you have satisfied the requirements for membership in the Perpetual Order of Seekers After Truth. Before accepting new members into this ancient and honorable secret society, we find it desirable that they have a personal interview with the Grand Chairman of POSAT.\n \n Accordingly, you are cordially invited to an audience with our Grand Chairman on Tuesday, July 10, at 2:30 P.M. Please let us know if this arrangement is acceptable to you. If not, we will attempt to make another appointment for you.\n \n The time specified for the appointment was hardly a convenient one for Don. At 2:30 P.M. on most Tuesdays, he would be at work in the laboratory. And while his employers made no complaint if he took his research problems home with him and worried over them half the night, they were not equally enthusiastic when he used working hours for pursuing unrelated interests. Moreover, the headquarters of POSAT was in a town almost a hundred miles distant. Could he afford to take a whole day off for chasing will-o-wisps?\n \n It hardly seemed worth the trouble. He wondered if Betty would be disappointed if he dropped the whole matter. Since the letter had been sent to the laboratory instead of his home, he couldn't consult her about it without telephoning.\n  Since the letter had been sent to the laboratory instead of his home! But it was impossible!\n \n He searched feverishly through his pile of daily mail for the envelope in which the letter had come. The address stared up at him, unmistakably and fearfully legible. The name of his company. The number of the room he worked in. In short, the address that he had never given them!\n \n \"Get hold of yourself,\" he commanded his frightened mind. \"There's some perfectly logical, easy explanation for this. They looked it up in the directory of the Institute of Physics. Or in the alumni directory of the university. Or—or—\"\n \n But the more he thought about it, the more sinister it seemed. His laboratory address was available, but why should POSAT take the trouble of looking it up? Some prudent impulse had led him to withhold that particular bit of information, yet now, for some reason of their own, POSAT had unearthed the information.\n \n His wife's words echoed in his mind, \"Could they be a spy ring? Subversive agents?\"\n \n Don shook his head as though to clear away the confusion. His conservative habit of thought made him reject that explanation as too melodramatic.\n \n At least one decision was easier to reach because of his doubts. Now he knew he had to keep his appointment with the Grand Chairman of POSAT.\n \n He scribbled a memo to the department office stating that he would not be at work on Tuesday.\n \n \n\n \n At first Don Alford had some trouble locating the POSAT headquarters. It seemed to him that the block in which the street number would fall was occupied entirely by a huge sprawling warehouse, of concrete construction, and almost entirely windowless. It was recessed from the street in several places to make room for the small, shabby buildings of a wholesale pharmacy, a printer's plant, an upholstering shop, and was also indented by alleys lined with loading platforms.\n \n It was at the back of one of the alleys that he finally found a door marked with the now familiar emblem of POSAT.\n \n He opened the frosted glass door with a feeling of misgiving, and faced a dark flight of stairs leading to the upper floor. Somewhere above him a buzzer sounded, evidently indicating his arrival. He picked his way up through the murky stairwell.\n \n The reception room was hardly a cheerful place, with its battered desk facing the view of the empty alley, and a film of dust obscuring the pattern of the gray-looking wallpaper and worn rug. But the light of the summer afternoon filtering through the window scattered the gloom somewhat, enough to help Don doubt that he would find the menace here that he had come to expect.\n \n The girl addressing envelopes at the desk looked very ordinary. Not the Mata-Hari type , thought Don, with an inward chuckle at his own suspicions. He handed her the letter.\n \n She smiled. \"We've been expecting you, Dr. Alford. If you'll just step into the next room—\"\n \n She opened a door opposite the stairwell, and Don stepped through it.\n \n The sight of the luxurious room before him struck his eyes with the shock of a dentist's drill, so great was the contrast between it and the shabby reception room. For a moment Don had difficulty breathing. The rug—Don had seen one like it before, but it had been in a museum. The paintings on the walls, ornately framed in gilt carving, were surely old masters—of the Renaissance period, he guessed. Although he recognized none of the pictures, he felt that he could almost name the artists. That glowing one near the corner would probably be a Titian. Or was it Tintorretto? He regretted for a moment the lost opportunities of his college days, when he had passed up Art History in favor of Operational Circuit Analysis.\n \n The girl opened a filing cabinet, the front of which was set flush with the wall, and, selecting a folder from it, disappeared through another door.\n \n Don sprang to examine the picture near the corner. It was hung at eye level—that is, at the eye level of the average person. Don had to bend over a bit to see it properly. He searched for a signature. Apparently there was none. But did artists sign their pictures back in those days? He wished he knew more about such things.\n \n Each of the paintings was individually lighted by a fluorescent tube held on brackets directly above it. As Don straightened up from his scrutiny of the picture, he inadvertently hit his head against the light. The tube, dislodged from its brackets, fell to the rug with a muffled thud.\n  Now I've done it! thought Don with dismay. But at least the tube hadn't shattered.\n \n In fact—it was still glowing brightly! His eyes registered the fact, even while his mind refused to believe it. He raised his eyes to the brackets. They were simple pieces of solid hardware designed to support the tube.\n \n There were no wires!\n \n Don picked up the slender, glowing cylinder and held it between trembling fingers. Although it was delivering as much light as a two or three hundred watt bulb, it was cool to the touch. He examined it minutely. There was no possibility of concealed batteries.\n \n The thumping of his heart was caused not by the fact that he had never seen a similar tube before, but because he had. He had never held one in his hands, though. The ones which his company had produced as experimental models had been unsuccessful at converting all of the radioactivity into light, and had, of necessity, been heavily shielded.\n \n Right now, two of his colleagues back in the laboratory would still be searching for the right combination of fluorescent material and radioactive salts with which to make the simple, efficient, self-contained lighting unit that he was holding in his hand at this moment!\n  But this is impossible! he thought. We're the only company that's working on this, and it's secret. There can't be any in actual production!\n \n \n And even if one had actually been successfully produced, how would it have fallen into the possession of POSAT, an Ancient Secret Society, The Perpetual Order of Seekers After Truth?\n \n The conviction grew in Don's mind that here was something much deeper and more sinister than he would be able to cope with. He should have asked for help, should have stated his suspicions to the police or the F.B.I. Even now—\n \n With sudden decision, he thrust the lighting tube into his pocket and stepped swiftly to the outer door. He grasped the knob and shook it impatiently when it stuck and refused to turn. He yanked at it. His impatience changed to panic. It was locked!\n \n A soft sound behind him made him whirl about. The secretary had entered again through the inner door. She glanced at the vacant light bracket, then significantly at his bulging pocket. Her gaze was still as bland and innocent as when he had entered, but to Don she no longer seemed ordinary. Her very calmness in the face of his odd actions was distressingly ominous.\n \n \"Our Grand Chairman will see you now,\" she said in a quiet voice.\n \n Don realized that he was half crouched in the position of an animal expecting attack. He straightened up with what dignity he could manage to find.\n \n She opened the inner door again and Don followed her into what he supposed to be the office of the Grand Chairman of POSAT.\n \n Instead he found himself on a balcony along the side of a vast room, which must have been the interior of the warehouse that he had noted outside. The girl motioned him toward the far end of the balcony, where a frosted glass door marked the office of the Grand Chairman.\n \n \n\n \n But Don could not will his legs to move. His heart beat at the sight of the room below him. It was a laboratory, but a laboratory the like of which he had never seen before. Most of the equipment was unfamiliar to him. Whatever he did recognize was of a different design than he had ever used, and there was something about it that convinced him that this was more advanced. The men who bent busily over their instruments did not raise their eyes to the figures on the balcony.\n \n \"Good Lord!\" Don gasped. \"That's an atomic reactor down there!\" There could be no doubt about it, even though he could see it only obscurely through the bluish-green plastic shielding it.\n \n His thoughts were so clamorous that he hardly realized that he had spoken aloud, or that the door at the end of the balcony had opened.\n \n He was only dimly aware of the approaching footsteps as he speculated wildly on the nature of the shielding material. What could be so dense that only an inch would provide adequate shielding and yet remain semitransparent?\n \n His scientist's mind applauded the genius who had developed it, even as the alarming conviction grew that he wouldn't—couldn't—be allowed to leave here any more. Surely no man would be allowed to leave this place alive to tell the fantastic story to the world!\n \n \"Hello, Don,\" said a quiet voice beside him. \"It's good to see you again.\"\n \n \"Dr. Crandon!\" he heard his own voice reply. \" You're the Grand Chairman of POSAT?\"\n \n He felt betrayed and sick at heart. The very voice with which Crandon had spoken conjured up visions of quiet lecture halls and his own youthful excitement at the masterful and orderly disclosure of scientific facts. To find him here in this mad and treacherous place—didn't anything make sense any longer?\n \n \"I think we have rather abused you, Don,\" Dr. Crandon continued. His voice sounded so gentle that Don found it hard to think there was any evil in it. \"I can see that you are suspicious of us, and—yes—afraid.\"\n \n \n\n \n Don stared at the scene below him. After his initial glance to confirm his identification of Crandon, Don could not bear to look at him.\n \n Crandon's voice suddenly hardened, became abrupt. \"You're partly right about us, of course. I hate to think how many laws this organization has broken. Don't condemn us yet, though. You'll be a member yourself before the day is over.\"\n \n Don was shocked by such confidence in his corruptibility.\n \n \"What do you use?\" he asked bitterly. \"Drugs? Hypnosis?\"\n \n Crandon sighed. \"I forgot how little you know, Don. I have a long story to tell you. You'll find it hard to believe at first. But try to trust me. Try to believe me, as you once did. When I say that much of what POSAT does is illegal, I do not mean immoral. We're probably the most moral organization in the world. Get over the idea that you have stumbled into a den of thieves.\"\n \n Crandon paused as though searching for words with which to continue.\n \n \"Did you notice the paintings in the waiting room as you entered?\"\n \n Don nodded, too bewildered to speak.\n \n \"They were donated by the founder of our Organization. They were part of his personal collection—which, incidentally, he bought from the artists themselves. He also designed the atomic reactor we use for power here in the laboratory.\"\n \n \"Then the pictures are modern,\" said Don, aware that his mouth was hanging open foolishly. \"I thought one was a Titian—\"\n \n \"It is,\" said Crandon. \"We have several original Titians, although I really don't know too much about them.\"\n \n \"But how could a man alive today buy paintings from an artist of the Renaissance?\"\n \n \"He is not alive today. POSAT is actually what our advertisements claim—an ancient secret society. Our founder has been dead for over four centuries.\"\n \n \"But you said that he designed your atomic reactor.\"\n \n \"Yes. This particular one has been in use for only twenty years, however.\"\n \n Don's confusion was complete. Crandon looked at him kindly. \"Let's start at the beginning,\" he said, and Don was back again in the classroom with the deep voice of Professor Crandon unfolding the pages of knowledge in clear and logical manner. \"Four hundred years ago, in the time of the Italian Renaissance, a man lived who was a super-genius. His was the kind of incredible mentality that appears not in every generation, or even every century, but once in thousands of years.\n \n \"Probably the man who invented what we call the phonetic alphabet was one like him. That man lived seven thousand years ago in Mesopotamia, and his discovery was so original, so far from the natural course of man's thinking, that not once in the intervening seven thousand years has that device been rediscovered. It still exists only in the civilizations to which it has been passed on directly.\n \n \"The super-genius who was our founder was not a semanticist. He was a physical scientist and mathematician. Starting with the meager heritage that existed in these fields in his time, he began tackling physical puzzles one by one. Sitting in his study, using as his principal tool his own great mind, he invented calculus, developed the quantum theory of light, moved on to electromagnetic radiation and what we call Maxwell's equations—although, of course, he antedated Maxwell by centuries—developed the special and general theories of relativity, the tool of wave mechanics, and finally, toward the end of his life, he mathematically derived the packing fraction that describes the binding energy of nuclei—\"\n \n \"But it can't be done,\" Don objected. \"It's an observed phenomenon. It hasn't been derived.\" Every conservative instinct that he possessed cried out against this impossible fantasy. And yet—there sat the reactor, sheathed in its strange shield. Crandon watched the direction of Don's glance.\n \n \"Yes, the reactor,\" said Crandon. \"He built one like it. It confirmed his theories. His calculations showed him something else too. He saw the destructive potentialities of an atomic explosion. He himself could not have built an atomic bomb; he didn't have the facilities. But his knowledge would have enabled other men to do so. He looked about him. He saw a political setup of warring principalities, rival states, intrigue, and squabbles over political power. Giving the men of his time atomic energy would have been like handing a baby a firecracker with a lighted fuse.\n \n \"What should he have done? Let his secrets die with him? He didn't think so. No one else in his age could have derived the knowledge that he did. But it was an age of brilliant men. Leonardo. Michelangelo. There were men capable of learning his science, even as men can learn it today. He gathered some of them together and founded this society. It served two purposes. It perpetuated his discoveries and at the same time it maintained the greatest secrecy about them. He urged that the secrets be kept until the time when men could use them safely. The other purpose was to make that time come about as soon as possible.\"\n \n Crandon looked at Don's unbelieving face. \"How can I make you see that it is the truth? Think of the eons that man or manlike creatures have walked the Earth. Think what a small fraction of that time is four hundred years. Is it so strange that atomic energy was discovered a little early, by this displacement in time that is so tiny after all?\"\n \n \"But by one man,\" Don argued.\n \n Crandon shrugged. \"Compared with him, Don, you and I are stupid men. So are the scientists who slowly plodded down the same road he had come, stumbling first on one truth and then the succeeding one. We know that inventions and discoveries do not occur at random. Each is based on the one that preceded it. We are all aware of the phenomenon of simultaneous invention. The path to truth is a straight one. It is only our own stupidity that makes it seem slow and tortuous.\n \n \"He merely followed the straight path,\" Crandon finished simply.\n \n \n\n \n Don's incredulity thawed a little. It was not entirely beyond the realm of possibility.\n \n But if it were true! A vast panorama of possible achievements spread before him.\n \n \"Four hundred years!\" he murmured with awe. \"You've had four hundred years head-start on the rest of the world! What wonders you must have uncovered in that time!\"\n \n \"Our technical achievements may disappoint you,\" warned Crandon.\n\"Oh, they're way beyond anything that you are familiar with. You've undoubtedly noticed the shielding material on the reactor. That's a fairly recent development of our metallurgical department. There are other things in the laboratory that I can't even explain to you until you have caught up on the technical basis for understanding them.\n \n \"Our emphasis has not been on physical sciences, however, except as they contribute to our central project. We want to change civilization so that it can use physical science without disaster.\"\n \n For a moment Don had been fired with enthusiasm. But at these words his heart sank.\n \n \"Then you've failed,\" he said bitterly. \"In spite of centuries of advance warning, you've failed to change the rest of us enough to prevent us from trying to blow ourselves off the Earth. Here we are, still snarling and snapping at our neighbors' throats—and we've caught up with you. We have the atomic bomb. What's POSAT been doing all that time? Or have you found that human nature really can't be changed?\"\n \n \"Come with me,\" said Crandon.\n \n He led the way along the narrow balcony to another door, then down a steep flight of stairs. He opened a door at the bottom, and Don saw what must have been the world's largest computing machine.\n \n \"This is our answer,\" said Crandon. \"Oh, rather, it's the tool by which we find our answer. For two centuries we have been working on the newest of the sciences—that of human motivation. Soon we will be ready to put some of our new knowledge to work. But you are right in one respect, we are working now against time. We must hurry if we are to save our civilization. That's why you are here. We have work for you to do. Will you join us, Don?\"\n \n \"But why the hocus-pocus?\" asked Don. \"Why do you hide behind such a weird front as POSAT? Why do you advertise in magazines and invite just anyone to join? Why didn't you approach me directly, if you have work for me to do? And if you really have the answers to our problems, why haven't you gathered together all the scientists in the world to work on this project—before it's too late?\"\n \n Crandon took a sighing breath. \"How I wish that we could do just that! But you forget that one of the prime purposes of our organization is to maintain the secrecy of our discoveries until they can be safely disclosed. We must be absolutely certain that anyone who enters this building will have joined POSAT before he leaves. What if we approached the wrong scientist? Centuries of accomplishment might be wasted if they attempted either to reveal it or to exploit it!\n \n \"Do you recall the questionnaires that you answered before you were invited here? We fed the answers to this machine and, as a result, we know more about how you will react in any given situation than you do yourself. Even if you should fail to join us, our secrets would be safe with you. Of course, we miss a few of the scientists who might be perfect material for our organization. You'd be surprised, though, at how clever our advertisements are at attracting exactly the men we want. With the help of our new science, we have baited our ads well, and we know how to maintain interest. Curiosity is, to the men we want, a powerful motivator.\"\n \n \"But what about the others?\" asked Don. \"There must be hundreds of applicants who would be of no use to you at all.\"\n \n \"Oh, yes,\" replied Crandon. \"There are the mild religious fanatics. We enroll them as members and keep them interested by sending pamphlets in line with their interests. We even let them contribute to our upkeep, if they seem to want to. They never get beyond the reception room if they come to call on us. But they are additional people through whom we can act when the time finally comes.\n \n \"There are also the desperate people who try POSAT as a last resort—lost ones who can't find their direction in life. For them we put into practice some of our newly won knowledge. We rehabilitate them—anonymously, of course. Even find jobs or patch up homes. It's good practice for us.\n \n \"I think I've answered most of your questions, Don. But you haven't answered mine. Will you join us?\"\n \n Don looked solemnly at the orderly array of the computer before him. He had one more question.\n \n \"Will it really work? Can it actually tell you how to motivate the stubborn, quarrelsome, opinionated people one finds on this Earth?\"\n \n Crandon smiled. \"You're here, aren't you?\"\n \n Don nodded, his tense features relaxing.\n \n \"Enroll me as a member,\" he said.",
      "metadata": {
        "title": "What is POSAT?",
        "author": "Phyllis Sterling Smith",
        "passage_id": "51336",
        "uid": "9bbfb0f716f044e7914b3fa952e8cd57",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "1",
                "uid": "f82e99464a664cfaa6f100e4294d6072",
                "response_text": "\nIn 1953, an advertisement for the Perpetual Order of Seekers After Truth appears in magazines. The ad claims that POSAT is an ancient secret society looking for new members. Three individuals send away to receive a free booklet from them. Bill is a pharmacist who is down on his luck and out of a job. Elizabeth is a wealthy woman who lives with cats. Don is a research physicist who has a successful career and a wife, Betty. \n\nPOSAT sends Bill, Elizabeth, and Don three identical forms in the mail and asks for their responses. Bill is initially skeptical, but he hopes that POSAT will be able to turn his life around in some unexpected way. He answers the questions about his employment, religion, and finances. Elizabeth does the same enthusiastically. Although Don believes it’s a scam, he can’t squash his own curiosity, and he sends his answers in.\n\nIn return, Bill receives a pamphlet with vague descriptions for how to solve life’s problems. He finds the material useless, but he isn’t disappointed because he just landed a new job. Elizabeth discovers that she has been accepted into the society, and she must pay $5 a month. Lastly, Don receives a multiple choice exam, which he answers and sends back.\n\n\nDon receives a request to meet with the Grand Chairman at his work, and this surprises him because he never gave them his work address. He finds the warehouse and sees that it is windowless, rundown, and dirty. However, the waiting room contains beautiful rugs and paintings in ornate frames. He realizes that each painting is lit with a glowing tube that does not contain batteries, and he puts one of the lights in his pocket. It shocks him because his workplace is the only laboratory working on this exact product. He no longer trusts what is going on at POSAT and tries to leave, but the door is locked. \nDon is brought upstairs, and his fear increases when he looks into a high tech laboratory and sees scientists working on an atomic reactor. Dr. Crandon, Don’s former professor, appears and introduces himself as the Grand Chairman. He tells Don that POSAT has been around for over four hundred years, and its founder invented the atomic reactor. He did not have the technology to build it, and he realized that humanity was not ready for such a weapon. He decided to share his knowledge with other geniuses and keep it all a secret. Their goal was to get humanity to a point where information could be shared without the threat of violence and death. Crandon shows Don the world’s biggest computer, which is meant to learn humans’ motivation. Don’s test was put into the computer, and his responses indicate that he will join POSAT and be a valuable member. Bill was given a job to improve his life, and Elizabeth feels included and contributes financially. Don decides to join the secret society and work towards a more peaceful planet. \n"
              },
              {
                "worker_id": "3",
                "uid": "4cbf046092bb457fb6ca456c5b47a30f",
                "response_text": "Various advertisements have gone through various magazines for POSAT, the \"Perpetual Order of Seekers After Truth\", offering a booklet that can be requested in the mail. Various people sent for the booklet, including Bill Evans, a pharmacist currently without work, Miss Elizabeth Arnable, an eager woman excited to learn, and Donald Alford, a research physicist driven by curiosity. The three of them received an identical form in return, and each filled out the long questionnaire with a large amount of personal information. Donald's wife tried to convince him to fill the form out with false answers, but he was honest as the others were. A week after these questionnaires were sent, POSAT sent different envelopes to these three people. Bill Evans, for instance, received a standard pamphlet with metaphysical discussion. He was disappointed by this but was pleased to be starting a new job near the POSAT offices soon, which he did not realized was connected. Miss Arnable received several pamphlets and an offer to pay dues, which she did immediately. Donald Alford received a series of multiple choice questions about moral decisions surrounding potentially dangerous events. His answers got him an interview with the Grand Chairman of POSAT, but it would be in the middle of a work day, almost a hundred miles away. Although he was surprised to have received the letter at his lab, because he had only given POSAT his home address, his curiosity drove him to take the interview. It took him some time to find the POSAT headquarters, hidden in the back of an alley, and he was struck by the elegance of the first room he was invited into. He was slightly taller than the people the room was built for, hitting his head on a light and having to bend over to look at paintings. He found an impossible-seeming lightbulb, that resembled a secret project he was working on but in later stages. He was locked in the room, but eventually escorted to see the Grand Chairman, passing over an incredible laboratory with an atomic reactor. It turns out the Grand Chairman was Dr. Crandon, Donald's mentor, which made Donald confused, as he had trusted Dr. Crandon but could not trust what was happening in the laboratory he had seen. Dr. Crandon explained that although most of their work was illegal, he considered it some of the most moral work being done. Dr. Crandon walked Donald through the history of the organization, waxing poetic about the founder's genius as a physical scientist and mathematician. He did not have the technology to act on his theories, but left enough information for people in the future to develop technologies, following what Crandon called the path to truth. The primary goal was for science to be used without disaster, and Donald struggles accepting this knowing that atomic bombs exist. The machine with which they were studying human motivation is what read the entry questionnaires. His curiosity wins and Donald joins the research group."
              },
              {
                "worker_id": "8",
                "uid": "78eac48b0add44a29810a01a98d4025b",
                "response_text": "Three people separately read and react to an advertisement for POSAT, the Perpetual Order of Seekers After Truth, which promises secret truths that can alter the course of one's life. Bill Evans, an unemployed pharmacist, finds hope in the promise of superhuman intervention to help pull him from his desperate financial situation. Miss Elizabeth Arnable, a cat enthusiast who doesn’t read, connects with the advertisement's religious and mystical undertones since she believes her cats to be reincarnated family members. Donald Alford, a research physicist, is the most skeptical among them, and his interest in POSAT is purely scientific; he wants to determine POSAT’s true purpose, and so he completes the autobiographical form all three of them receive in response to their individual inquiries for more information. The impractical, metaphysical pamphlet Bill receives in response to his form disappoints him; however, he also receives a job offer at a pharmacy attached to the very warehouse that also houses POSAT's headquarters. Miss Arnable receives a membership pin, several pamphlets full of hidden truths of ancient wisdom, and information regarding membership fees. Don Alford receives a questionnaire that appears to be some kind of personality test catered to him specifically, despite the fact he has thus far revealed nothing of his life to them. Don's wife, Betty, wonders if POSAT might be some kind of spy society. In response to his questionnaire, POSAT invites Don to their headquarters to meet with their Grand Chairman in order to conduct an interview prior to his membership acceptance. Don struggles to decide whether or not to attend the meeting, considering the headquarters is nearly one-hundred miles from his home, and the lab where he works typically frowns upon using work time for personal matters. However, he decides to go anyway, and he finds the headquarters is part of a massive warehouse that is also home to a printer's plant, upholstering shop, and a pharmacy where Bill Evans now works. A receptionist guides him to a waiting room, where he discovers a number of brightly-lit Renaissance-style paintings. When he accidentally dislodges a light tube, he realizes the technology keeping it lit resembles his own research back at the lab--research that has not yet been released for public consumption. When he meets the Grand Chairman, he begins to make sense of the true purpose of POSAT; the Grand Chairman is actually Dr. Crandon, a physicist whose research Don has admired for several decades. Dr. Crandon explains POSAT is a society started four hundred years ago by a genius mathematician and physical scientist whose knowledge and discoveries were so advanced and powerful, he felt they must be kept secret until the world was ready to handle them in a responsible fashion. He shows Don a large computing machine used to determine human motivations and predict their reactions, which had been used to assess Don's suitability for membership, and which will be used to contribute to the advancement of a peaceful society. Don agrees to join Dr. Crandon's cause."
              },
              {
                "worker_id": "6",
                "uid": "e4620aeb23814f9ca98b4146410dcbcd",
                "response_text": "An ad was placed in the paper and several magazines throughout town, describing POSAT, the Pepetual Order of Seekers After Truth. It speaks vaguely about wisdom, changing your life, and mastering knowledge. Three people look at the ad in interest. The first is Bill Evans, a recently unemployed pharmacist, desperate for a miracle. He needs another job, a better life, so he responds to the ad as a last resort. The second is Miss Elizabeth Arnable, a cat-lady who loves the radio. And finally, Donald Alford, a physicist with a caring wife. He was reading a paper by Dr. Crandon, his former professor when he came across the advertisement. He responded simply because he was curious, and because their symbol piqued his interest. It looked almost like the Bohr atom of helium. \nThey all received identical booklets in the mail, promising the same stuff as the advertisement, but with a new form. All threw filled it out. Bill Evans took a while to do so, but he did so eventually with his desperation in tow. Miss Arnable wrote five pages, including the lives of her cats, and asked how much she would need to pay to be a member of POSAT. \nBut Alford was more skeptical, so he showed the booklet to his wife. She knew he was going to fill it out anyway because his curiosity would not be sated till he had an answer. He did just that.\nThe next mailings were completely different. Bill Evans’ pamphlet was filled with vague and metaphysical realizations. But, the same day, he was miraculously offered a job at a wholesale pharmacy. Miss Arnable was accepted, sent pamphlets about cats, and asked to pay $5/month. After filling out a multiple-choice questionnaire, Alford was asked to come in for an interview with the Grand Master during his workday. The letter was sent to his office; the address he never revealed.  He took off the day to drive there and arrived at a small entrance down an alley near a wholesale pharmacy. He entered and climbed the stairs to the receptionist. She took his information then led him into the waiting room. Beautiful paintings lined the wall, lit up by radioactive, self-contained lights. He was in shock after making this discovery. His lab was working on such an invention, but failing at making the right material. He pocketed the light. \nThe receptionist led him across a balcony into the Grand Master’s office. Below the balcony was a highly advanced laboratory. Equipment that had yet to be invented. When Alford entered the office, he realized the man in front of him was Dr. Crandon, his professor, and fellow scientist. He explains the history of POSAT, how advanced they are, and their current mission: to find out more about human motivation to solve world issues. Dr. Crandon shows him a supercomputer that is on the path to making this huge discovery. Alford joins POSAT. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "1",
                "uid": "f82e99464a664cfaa6f100e4294d6072",
                "response_text": "“What is POSAT?” takes place in an unspecified city. Three of the characters, Bill, Elizabeth, and Don, lead ordinary lives and hold typical jobs. Don is a physicist, and the laboratory he works at is located about 100 miles away from the POSAT headquarters. \n\nThe POSAT headquarters is the main setting described in the story. It is located at the end of an alley in an unassuming warehouse, next to a wholesale pharmacy, an upholstery shop, and a printer’s plant. The building is almost entirely windowless, and the only sign that the secret society is housed there is the organization’s emblem on its door. \n\nVisitors enter a dark room with a staircase. A buzzer goes off to let the employees of POSAT know that someone has arrived. The reception room is dusty and highly unimpressive. The wallpaper and rugs are worn out and gray, and the woman who works at the beat-up reception desk is average looking. \n\nThe next room that some visitors are allowed access to is entirely different from the first. There are gorgeous Renaissance paintings on the walls, framed with ornate gold decoration and lit up with individual lights. The rug is lush, and the room is impeccably clean. \n\nFinally, when visitors are invited to meet with the Grand Chairman, they must enter a balcony area located in the interior of the warehouse. There is a frosted glass door with the Grand Chairman’s name on it. On the lower floor, there is a laboratory that is visible from the balcony. The lab contains advanced equipment that is not available anywhere else in the world. It also houses an atomic reactor that is shielded by a bluish-green invention that is about an inch thick The shield is semi-transparent but also incredibly strong. Beneath the balcony, down a steep flight of stairs, there is a gigantic computing machine. Everything that goes on in the POSAT building must remain confidential, and very few individuals are told the secrets of the ancient society. \n"
              },
              {
                "worker_id": "3",
                "uid": "4cbf046092bb457fb6ca456c5b47a30f",
                "response_text": "The primary setting in this story is that of the POSAT headquarters. Hidden in a back alley in a warehouse district, it proved hard to find for Donald when he was invited for an interview. In this same warehouse are a number of businesses, including a pharmacy where POSAT places Bill with a job. The first room in the POSAT headquarters is a dingy waiting room, which acts as a facade or screening room of sorts so that they do not show their hand to people they are not sure will want to enter the organization. The real waiting room is a gorgeous, ornate room with Renaissance paintings on the walls, part of the personal collection of POSAT's founder. There was a beautiful rug on the floor, some filing cabinets, and some curious fluorescent lights that seemed more advanced that Donald figured possible. Past this room, the Grand Chairman has an office that is also ornate, with a frosted glass door, but between this office and the waiting room there is a balcony. This balcony acts like a bridge between the two rooms over a laboratory. This laboratory is visible from this walkway and is full of extremely advanced technology that Donald is not able to identify by sight, as it is beyond its time. Even the glass-like substance acting as a shielding window between him and the laboratory is too thin to be a substance known by his contemporaries.  "
              },
              {
                "worker_id": "8",
                "uid": "78eac48b0add44a29810a01a98d4025b",
                "response_text": "The story centers on three main characters who separately discover the advertisements of the POSAT in different locations. Bill Evans discovers it while reading through a magazine left on a bus seat. Elizabeth Arnable finds the advertisement in the Antivivisectionist Gazette, which she reads in a room with her many cats and a radio. Don Alford receives his invitation to meet with the Grand Chairman of POSAT, which is located nearly one hundred miles away from his home. The POSAT headquarters calls a giant, sprawling warehouse home. The concrete, windowless warehouse covers an entire city block and also houses a printer's plant, upholstering shop, and a pharmacy where Bill Evans finds new employment. Several alleys make way for loading platforms at various locations around the warehouse as well. Don Alford finds the entrance to POSAT at the back of an alley, and he enters through a frosted glass door and walks up a dark, murky stairwell to a dingy reception room. The room Don enters beyond the reception area, however, is ornately decorated with rugs and paintings from the Renaissance periods. Bright tubes light the paintings from above, which astonishes Don because they are neither battery-powered nor wired to anything. His meeting with the Grand Chairman of POSAT takes place outside the room with the paintings on a balcony overlooking the vast warehouse interior. Looking out upon the warehouse floor, Don observes several men appearing to conduct experiments in some kind of laboratory populated with scientific instruments he has never before seen (except for an atomic reactor obscured by a bluish-green plastic). At the bottom of another flight of stairs, Dr. Crandon shows Don the world's largest computer, which was used to analyze his questionnaire results and may be used to predict and motivate human behavior."
              },
              {
                "worker_id": "6",
                "uid": "e4620aeb23814f9ca98b4146410dcbcd",
                "response_text": "What is POSAT? by Phyllis Sterling Smith takes place in several different settings. However, much of it takes place in the POSAT headquarters itself. A long dark stairway leads to the receptionist’s room. It’s dusty and a little unattractive, but the window that lets in sunlight helps hide that fact. The waiting room is grand and luxurious, filled with ancient, Renaissance paintings and ornate gilding. The paintings were lit up from the bottom by contained radioactive lights. The headquarters has a laboratory in it as well, filled with previously uninvented equipment, such as an atomic reactor. Scientists and worker bees are hard at work, studiously bent over their equipment. In the basement rests a supercomputer equipped with the ability to understand humans based on their answers to multiple-choice questions or the papers they write. "
              }
            ]
          },
          {
            "question_text": "Why is Mr. Crandon an important character in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "1",
                "uid": "f82e99464a664cfaa6f100e4294d6072",
                "response_text": "Mr. Crandon is a member of POSAT, and he is also a professor, published author, and researcher. Don admires Mr. Crandon as an intellectual before he realizes that Crandon is also the Grand Chairman of POSAT. When Don finds out that Crandon is a member of the secret society, he is shocked. Don knows that Crandon is a highly intelligent person, and POSAT seems like a scam. When Crandon explains the truth about the ancient society, its history, its goals, and its ability to pick the finest individuals to join its ranks, Don listens carefully because of his prior connection to Crandon. Had the Grand Chairman been a complete stranger to Don, he might have written the entire experience off as a manipulative scheme or a simply impossible endeavor. After one short conversation and a tour of the building, Don is willing to join POSAT as a member. Crandon is a persuasive salesman and a true believer in the organization and its goal to make a more civil society. "
              },
              {
                "worker_id": "3",
                "uid": "4cbf046092bb457fb6ca456c5b47a30f",
                "response_text": "Dr. Crandon contributes two major things to this story. The first is that he was Donald Alford's mentor as a research scientist, so he was in no small part responsible for Donald's training, giving him the tools he needed to do the research he was doing at work and could be doing with POSAT. The other major role that he plays is that of Grand Chairman of POSAT. Not only is he in charge of the organization as a whole, but he is the one who explains the history and the goals of the organization to the scientists that are recruited. "
              },
              {
                "worker_id": "8",
                "uid": "78eac48b0add44a29810a01a98d4025b",
                "response_text": "Dr. Crandon is a research physicist and former professor of Don Alford. When Don first discovers the POSAT ad, he is reading a research paper by Crandon in The Bulletin of Physical Research. Crandon's instruction grounded Alford in the mastery of and commitment to the scientific process and thereby contributed to his skepticism regarding POSAT's promise of mystical wisdom. Therefore, Don is shocked to discover the Grand Chairman of POSAT is Dr. Crandon himself. Crandon delineates the history of POSAT as a hundreds-of-years-old organization meant to preserve and advance the knowledge and discoveries of its founder. The discoveries run the gamut of technology, mathematics, and physical science and pre-date contemporary discoveries such as atomic reactors by centuries. As Crandon explains, these discoveries have been kept secret because humanity could not be trusted to use them responsibly. In the meantime, POSAT has developed a massive computing machine that can analyze human behavior to determine motivations and predict reactions to certain events and knowledge. Crandon hopes that by joining POSAT, Don can use his knowledge of physics to contribute to their mission and, eventually, peacefully introduce their discoveries to society."
              },
              {
                "worker_id": "6",
                "uid": "e4620aeb23814f9ca98b4146410dcbcd",
                "response_text": "Dr. Crandon was a professor at a university that Donald Alford once attended. As a fellow scientist, he wrote several research papers and was even published in scientific journals. Donald Alford was reading his latest scholarly journal article when he came across the advertisement for POSAT. It’s clear that Alford admires Dr. Crandon both as his former student and as a scientist. It is later revealed that Dr. Crandon is in fact the Grand Master of the Perpetual Order of Seekers After Truth. He is not the founder, however, but he serves his organization with pride. Alford’s curiosity, scientific attitude, and admiration for Dr. Crandon were several factors in his admittance to joining POSAT. "
              }
            ]
          },
          {
            "question_text": "What is the history of POSAT?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "1",
                "uid": "f82e99464a664cfaa6f100e4294d6072",
                "response_text": "The Perpetual Order of Seekers After Truth, POSAT, is an ancient secret society. It was founded by a genius of a man who lived during the Italian Renaissance, roughly 400 years ago. The founder was a mathematician and scientist, and he invented calculus, created the quantum theory of light, and wrote Maxwell’s equations. However, he did not get credit for any of these ideas. He also designed the atomic reactor that Don sees in the laboratory of the building. The founder understood how dangerous the atomic bomb was, and he did not want to give his peers the tools to create such a powerful weapon. He did not trust men who were at war with one another over political power. Still, he did not want his knowledge to vanish when he died, so he created POSAT. He was willing to share his scientific and mathematical secrets, but he did not wish for untrustworthy people to get their hands on the information until it would be safe to do so. The founder also wanted POSAT to work towards a more peaceful society where everyone could be trusted to share knowledge and information without the fear of it leading to catastrophic events. \n\nIn the centuries since the society was founded, the members have invented new tools and technologies that are not available anywhere else in the world, like the atomic reactor shield and the lightbulbs that hang above each Renaissance painting in the waiting room. Yet, the secret society’s main goal is to create a civilized society, not new inventions. In an effort to make that vision a reality, members of POSAT created a very large computer that seeks to decode human motivation. The computer used Don’s multiple choice questionnaire to determine that Don would be a good fit for the society because he is trustworthy. Although it seems like POSAT should involve more renowned scientists and peacekeepers to make sure it accomplishes its mission, it must also guard all of its secrets, and in an increasingly surveilled state, that would be nearly impossible to do while also including great thought leaders. \n"
              },
              {
                "worker_id": "3",
                "uid": "4cbf046092bb457fb6ca456c5b47a30f",
                "response_text": "POSAT, or The Perpetual Order of Seekers After Truth, is a secret society that considers itself \"ancient and honorable\", which has been active since the Renaissance Era. They put ads in magazines to attract new members, stating that anyone can unlock the key to life through their pamphlets. The organization is led by a Grand Chairman, a spot currently filled by Dr. Crandon. When the organization was founded in the Renaissance Era, some four hundred years before the time in which the story takes place, the technology did not exist to act on the founder's theories. For instance, the atomic reactor that powers the headquarters has only been in use for twenty years, but was designed four hundred years ago. This was how the founder operated, well ahead of his time, developing ideas in the physical sciences far past what anyone would have expected, even of a genius. He donated a number of paintings from his personal collection, so much of the contemporary headquarters has his mark on it, even from an aesthetic standpoint. "
              },
              {
                "worker_id": "8",
                "uid": "78eac48b0add44a29810a01a98d4025b",
                "response_text": "POSAT was founded four hundred years prior to the events of the story by a genius mathematician and physical scientist and a group of fellow \"brilliant men\" capable of advancing his scientific discoveries and committing them to secrecy. The founder lived during the Italian Renaissance and used his own mind to invent and discover, among other things, calculus, the quantum theory of light, the theory of relativity, wave mechanics, and nuclear reactions. The founder realized mankind was not able to wield this knowledge responsibly, so POSAT was designed to withhold this information until the time came in history when they could be trusted with it. POSAT operates its headquarters in a large warehouse, in the center of which is a large lab full of researchers where Dr. Crandon oversees the continuing work of the founder. The warehouse also houses businesses like the pharmacy that employs desperate people like Bill Evans, who turns to POSAT as a last resort, and the print shop that publishes advertisements that reach people like Elizabeth Arnable, whose belief in mysticism borders on religious."
              },
              {
                "worker_id": "6",
                "uid": "e4620aeb23814f9ca98b4146410dcbcd",
                "response_text": "The Perpetual Order of Seekers After Truth was founded four centuries ago by a genius. He discovered radioactivity and nuclear bombs hundreds of years before the rest of the world, designed the atomic reactor, invented calculus, and more. Impossible things that have yet to be discovered or invented in the 21st Century. The idea behind POSAT was to keep this man’s inventions a secret from the rest of the world, as well as continue making such amazing technological advances. \nSo, POSAT continued as a secret society, committing members who were dedicated to maintaining secrecy and developing ideas and theories that could be used to save the world, not harm it. They are currently dedicated to discovering more about the human motivation and how it can be used to perpetual world peace. This way all discoveries that are made in the future (however dangerous or wonderful they may be) will not be used to incite war, human disaster, or violence. \n"
              }
            ]
          },
          {
            "question_text": "How do Bill and Elizabeth contribute to the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "1",
                "uid": "f82e99464a664cfaa6f100e4294d6072",
                "response_text": "Bill and Elizabeth are minor characters in the story, but they are key in demonstrating how POSAT’S recruiting efforts work. Bill, Elizabeth, and Don all see the same magazine advertisement and decide to send their coupons in the mail and receive an informational pamphlet in return. Bill is motivated by his desire to change his life. He has lost his job and feels useless and dejected. Elizabeth wants to join the ancient society because she truly believes it can offer her profound wisdom. She also believes that her cats are her family members reincarnated, so she’s clearly a gullible person who hopes to find magic and miracles in her everyday life. Don is curious about the advertisement, and as a naturally skeptical person, he assumes it’s all a hoax.\n\nPOSAT’s correspondence with the three highly different individuals starts out the same, but after gaining a little bit of insight into each person’s background, job, religious beliefs, and motivation for joining the society, the people at POSAT individualize Bill, Elizabeth, and Don’s responses. Bill receives a pamphlet with vague answers to life’s problems, while Elizabeth gets literature about topics like the sacred cats of ancient Egypt. She is also offered an official membership to the group and told to contribute $5 per month. Don, however, is given an in-depth psychological exam. \n\nTowards the end of the story, Mr. Crandon reveals how POSAT’s magazine advertisements work to attract people to the secret society. The new supercomputer they have invented has created the perfect combination of intrigue, symbolism, and promise of knowledge to get the right peoples’ attention. Don, for example, was immediately taken by POSAT’s logo, although he could not explain why. When people like Bill and Elizabeth apply to become members, they are pacified through other means. Elizabeth is an example of a religious fanatic who contributes to the society financially while also feeling deeply satisfied at her inclusion. Bill is an example of someone who is desperate and wants to try to join the society as a way to change his life.  Since POSAT wants a more civilized and peaceful society, they work with those people by finding them new jobs or renovating their homes. \n"
              },
              {
                "worker_id": "3",
                "uid": "4cbf046092bb457fb6ca456c5b47a30f",
                "response_text": "Bill Evans is a pharmacist who does not currently have a job, and is hesitant to fill out the long form he was given in return for his request for a POSAT booklet. Elizabeth Arnable, on the other hand, is overjoyed to have the chance to talk about herself and send in the form, providing much more information than was requested of her. Not only do the two different people allow the reader to see that POSAT sends different responses in the mail to different people, but we learn at the end of the story that these different people play different roles in the organization. Neither Bill nor Elizabeth will contribute scientific knowledge but each have their place in the organization. People like Elizabeth, for instance, are kept interested with various pamphlets, and contribute to the organization if they want to--Elizabeth asks how much dues are, so she is given the chance to contribute financially. Bill, on the other hand, is someone who looks to the organization as a last resort, so POSAT takes advantage of the opportunity to study human motivation, practicing their newly developed theories by providing Bill with a pharmacy job and keeping an eye on him. "
              },
              {
                "worker_id": "8",
                "uid": "78eac48b0add44a29810a01a98d4025b",
                "response_text": "Bill Evans is an unemployed pharmacist, who turns to POSAT as a last-ditch effort to escape the financial ruin of his current situation. He discovers an advertisement for POSAT in a copy of Your Life and Psychology on an empty bus seat, and writes in to get more information on its promise that its secrets can \"alter the course of your life!\" Likewise, Elizabeth Arnable discovers the advertisement in a copy of Antivivisectionist Gazette, a magazine she reads by chance despite the fact that she rarely reads and prefers listening to the radio with her cats. Most likely due to the fact that she believes her cats are reincarnated family members, the vague mysticism of the advertisement attracts her, and she immediately wants to become a POSAT member. Although this same messaging disappoints Bill, he is pleased that around the same time that he receives his information packet from POSAT, he receives a job offer at a pharmacy that shares the same building as their headquarters. Elizabeth receives pamphlets of information about the sacred cats of ancient Egypt, a POSAT membership pin, and details about membership fees. Later, Dr. Crandon explains these fees are collected from people who view their POSAT membership with religious fervor to cover operational expenses. The pharmacy where Bill Evans works was built in an effort to employ those who turn to POSAT out of desperation, and there they become the subjects of covert rehabilitation to help them reenter society using POSAT's knowledge and discoveries."
              },
              {
                "worker_id": "6",
                "uid": "e4620aeb23814f9ca98b4146410dcbcd",
                "response_text": "Bill and Elizabeth are two other people who responded to the POSAT ad in a magazine. They are examples of the two other things that may happen to people who apply to POSAT, but are not the correct person to get in. \nBill was down on his luck and searching for cosmic change. He needed a job, a better life, and he needed it fast. He responded to the advertisement as his last hope and was disappointed to only receive a metaphysical text in return. However, he was also offered a job at a wholesale pharmacy right next to the POSAT headquarters. Dr. Crandon later reveals that they give back to the world by finding housing, jobs, and more for people down on their luck who apply to POSAT in the hopes of a change. \nElizabeth, on the other hand, is a completely different applicant. She was interested and enthralled by the idea of a secret society, but wouldn’t actually be qualified to join or dedicated to the task at hand. So, POSAT enrolled her, but only sends pamphlets that she would be interested in. For example, they sent her a pamphlet about Egyptian cats, since she had mentioned her cats in her original letter to POSAT. Since she asked about dues, they asked her to contribute $5 monthly which she will do happily. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5604,
        "document_length_chars": 32639
      }
    }
  ]
}