{
  "item_metadata": {
    "item_id": "51330",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51330",
      "content": "I am a Nucleus\n \n \n By STEPHEN BARR\n \n Illustrated by GAUGHAN\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction February 1957. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n No doubt whatever about it, I had the Indian sign on me ... my comfortably untidy world had suddenly turned into a monstrosity of order!\n \n \n \n When I got home from the office, I was not so much tired as beaten down, but the effect is similar. I let myself into the apartment, which had an absentee-wife look, and took a cold shower. The present downtown temperature, according to the radio, was eighty-seven degrees, but according to my Greenwich Village thermometer, it was ninety-six. I got dressed and went into the living room, and wished ardently that my wife Molly were here to tell me why the whole place looked so woebegone.\n \n What do they do, I asked myself, that I have left undone? I've vacuumed the carpet, I've dusted and I've straightened the cushions.... Ah! The ashtrays. I emptied them, washed them and put them back, but still the place looked wife-deserted.\n \n It had been a bad day; I had forgotten to wind the alarm clock, so I'd had to hurry to make a story conference at one of the TV studios I write for. I didn't notice the impending rain storm and had no umbrella when I reached the sidewalk, to find myself confronted with an almost tropical downpour. I would have turned back, but a taxi came up and a woman got out, so I dashed through the rain and got in.\n \n \"Madison and Fifty-fourth,\" I said.\n \n \"Right,\" said the driver, and I heard the starter grind, and then go on grinding. After some futile efforts, he turned to me. \"Sorry, Mac. You'll have to find another cab. Good hunting.\"\n \n If possible, it was raining still harder. I opened my newspaper over my hat and ran for the subway: three blocks. Whizzing traffic held me up at each crossing and I was soaked when I reached the platform, just in time to miss the local. After an abnormal delay, I got one which exactly missed the express at Fourteenth Street. The same thing happened at both ends of the crosstown shuttle, but I found the rain had stopped when I got out at Fifty-first and Lexington.\n \n \n\n \n As I walked across to Madison Avenue, I passed a big excavation where they were getting ready to put up a new office building. There was the usual crowd of buffs watching the digging machines and, in particular, a man with a pneumatic drill who was breaking up some hard-packed clay. While I looked, a big lump of it fell away, and for an instant I was able to see something that looked like a chunk of dirty glass, the size of an old-fashioned hatbox. It glittered brilliantly in the sunlight, and then his chattering drill hit it.\n \n There was a faint bang and the thing disintegrated. It knocked him on his back, but he got right up and I realized he was not hurt. At the moment of the explosion—if so feeble a thing can be called one—I felt something sting my face and, on touching it, found blood on my hand. I mopped at it with my handkerchief but, though slight, the bleeding would not stop, so I went into a drugstore and bought some pink adhesive which I put on the tiny cut. When I got to the studio, I found that I had missed the story conference.\n \n During the day, by actual count, I heard the phrase \"I'm just spitballing\" eight times, and another Madison Avenue favorite,\n\"The whole ball of wax,\" twelve times. However, my story had been accepted without change because nobody had noticed my absence from the conference room. There you have what is known as the Advertising World, the Advertising game or the advertising racket, depending upon which rung of the ladder you have achieved.\n \n The subway gave a repeat performance going home, and as I got to the apartment house we live in, the cop on the afternoon beat was standing there talking to the doorman.\n \n He said, \"Hello, Mr. Graham. I guess you must have just have missed it at your office building.\" I looked blank and he explained, \"We just heard it a little while ago: all six elevators in your building jammed at the same time. Sounds crazy. I guess you just missed it.\"\n \n Anything can happen in advertising, I thought. \"That's right, Danny, I just missed it,\" I said, and went on in.\n \n Psychiatry tells us that some people are accident-prone; I, on the other hand, seemed recently to be coincidence-prone, fluke-happy, and except for the alarm clock, I'd had no control over what had been going on.\n \n I went into our little kitchen to make a drink and reread the directions Molly had left, telling me how to get along by myself until she got back from her mother's in Oyster Bay, a matter of ten days. How to make coffee, how to open a can, whom to call if I took sick and such. My wife used to be a trained nurse and she is quite convinced that I cannot take a breath without her. She is right, but not for the reasons she supposes.\n \n I opened the refrigerator to get some ice and saw another notice: \"When you take out the Milk or Butter, Put it Right Back. And Close the Door, too.\"\n \n Intimidated, I took my drink into the living room and sat down in front of the typewriter. As I stared at the novel that was to liberate me from Madison Avenue, I noticed a mistake and picked up a pencil. When I put it down, it rolled off the desk, and with my eyes on the manuscript, I groped under the chair for it. Then I looked down. The pencil was standing on its end.\n \n \n\n \n There, I thought to myself, is that one chance in a million we hear about, and picked up the pencil. I turned back to my novel and drank some of the highball in hopes of inspiration and surcease from the muggy heat, but nothing came. I went back and read the whole chapter to try to get a forward momentum, but came to a dead stop at the last sentence.\n \n Damn the heat, damn the pencil, damn Madison Avenue and advertising. My drink was gone and I went back to the kitchen and read Molly's notes again to see if they would be like a letter from her. I noticed one that I had missed, pinned to the door of the dumbwaiter: \"Garbage picked up at 6:30 AM so the idea is to Put it Here the Night Before. I love you.\" What can you do when the girl loves you?\n \n I made another drink and went and stared out of the living room window at the roof opposite. The Sun was out again and a man with a stick was exercising his flock of pigeons. They wheeled in a circle, hoping to be allowed to perch, but were not allowed to.\n \n Pigeons fly as a rule in formation and turn simultaneously, so that their wings all catch the sunlight at the same time. I was thinking about this decorative fact when I saw that as they were making a turn, they seemed to bunch up together. By some curious chance, they all wanted the same place in the sky to turn in, and several collided and fell.\n \n The man was as surprised as I and went to one of the dazed birds and picked it up. He stood there shaking his head from side to side, stroking its feathers.\n \n My speculations about this peculiar aerial traffic accident were interrupted by loud voices in the hallway. Since our building is usually very well behaved, I was astonished to hear what sounded like an incipient free-for-all, and among the angry voices I recognized that of my neighbor, Nat, a very quiet guy who works on a newspaper and has never, to my knowledge, given wild parties, particularly in the late afternoon.\n \n \"You can't say a thing like that to me!\" I heard him shout. \"I tell you I got that deck this afternoon and they weren't opened till we started to play!\"\n \n Several other loud voices started at the same time.\n \n \"Nobody gets five straight-flushes in a row!\"\n \n \"Yeah, and only when you were dealer!\"\n \n The tone of the argument was beginning to get ugly, and I opened the door to offer Nat help if he needed it. There were four men confronting him, evidently torn between the desire to make an angry exit and the impulse to stay and beat him up. His face was furiously red and he looked stunned.\n \n \"Here!\" he said, holding out a deck of cards, \"For Pete's sake, look at\n'em yourselves if you think they're marked!\"\n \n The nearest man struck them up from his hand. \"Okay, Houdini! So they're not marked! All I know is five straight....\"\n \n His voice trailed away. He and the others stared at the scattered cards on the floor. About half were face down, as might be expected, and the rest face up—all red.\n \n \n\n \n Someone must have rung, because at that moment the elevator arrived and the four men, with half frightened, incredulous looks, and in silence, got in and were taken down. My friend stood looking at the neatly arranged cards.\n \n \"Judas!\" he said, and started to pick them up. \"Will you look at that! My God, what a session....\"\n \n I helped him and said to come in for a drink and tell me all about it, but I had an idea what I would hear.\n \n After a while, he calmed down, but he still seemed dazed.\n \n \"Never seen anything to equal it,\" he said. \"Wouldn't have believed it. Those guys didn't believe it. Every round normal, nothing unusual about the hands—three of a kind, a low straight, that sort of thing and one guy got queens over tens, until it gets to be my deal. Brother! Straight flush to the king—every time! And each time, somebody else has four aces....\"\n \n He started to sweat again, so I got up to fix him another drink. There was one quart of club soda left, but when I tried to open it, the top broke and glass chips got into the bottle.\n \n \"I'll have to go down for more soda,\" I said.\n \n \"I'll come, too. I need air.\"\n \n At the delicatessen on the corner, the man gave me three bottles in what must have been a wet bag, because as he handed them to me over the top of the cold-meat display, the bottom gave and they fell onto the tile floor. None of them broke, although the fall must have been from at least five feet. Nat was too wound up in his thoughts to notice and I was getting used to miracles. We left the proprietor with his mouth open and met Danny, the cop, looking in at the door, also with his mouth open.\n \n \n\n \n On the sidewalk, a man walking in front of Nat stooped suddenly to tie his shoe and Nat, to avoid bumping him, stepped off the curb and a taxi swerved to avoid Nat. The street was still wet and the taxi skidded, its rear end lightly flipping the front of one of those small foreign cars, which was going rather fast. It turned sideways and, without any side-slip, went right up the stoop of a brownstone opposite, coming to rest with its nose inside the front door, which a man opened at that moment.\n \n The sight of this threw another driver into a skid, and when he and the taxi had stopped sliding around, they were face to face, arranged crosswise to the street. This gave them exactly no room to move either forward or backward, for the car had its back to a hydrant and the taxi to a lamp.\n \n Although rather narrow, this is a two-way street, and in no time at all, traffic was stacked up from both directions as far as the avenues. Everyone was honking his horn.\n \n Danny was furious—more so when he tried to put through a call to his station house from the box opposite.\n \n It was out of order.\n \n \n\n \n Upstairs, the wind was blowing into the apartment and I closed the windows, mainly to shut out the tumult and the shouting. Nat had brightened up considerably.\n \n \"I'll stay for one more drink and then I'm due at the office,\" he said.\n\"You know, I think this would make an item for the paper.\" He grinned and nodded toward the pandemonium.\n \n When he was gone, I noticed it was getting dark and turned on the desk lamp. Then I saw the curtains. They were all tied in knots, except one. That was tied in three knots.\n \n All right , I told myself, it was the wind. But I felt the time had come for me to get expert advice, so I went to the phone to call McGill. McGill is an assistant professor of mathematics at a university uptown and lives near us. He is highly imaginative, but we believe he knows everything.\n \n When I picked up the receiver, the line sounded dead and I thought, more trouble. Then I heard a man cough and I said hello. McGill's voice said, \"Alec? You must have picked up the receiver just as we were connected. That's a damn funny coincidence.\"\n \n \"Not in the least,\" I said. \"Come on over here. I've got something for you to work on.\"\n \n \"Well, as a matter of fact, I was calling up to ask you and Molly—\"\n \n \"Molly's away for the week. Can you get over here quick? It's urgent.\"\n \n \"At once,\" he said, and hung up.\n \n While I waited, I thought I might try getting down a few paragraphs of my novel—perhaps something would come now. It did, but as I came to a point where I was about to put down the word \"agurgling,\" I decided it was too reminiscent of Gilbert and Sullivan, and stopped at the letter\n\"R.\" Then I saw that I had unaccountably hit all four keys one step to the side of the correct ones, and tore out the page, with my face red.\n \n This was absolutely not my day.\n \n \n\n \n \"Well,\" McGill said, \"nothing you've told me is impossible or supernatural. Just very, very improbable. In fact, the odds against that poker game alone would lead me to suspect Nat, well as I know him. It's all those other things....\"\n \n He got up and walked over to the window and looked at the hot twilight while I waited. Then he turned around; he had a look of concern.\n \n \"Alec, you're a reasonable guy, so I don't think you'll take offense at what I'm going to say. What you have told me is so impossibly unlikely, and the odds against it so astronomical, that I must take the view that you're either stringing me or you're subject to a delusion.\" I started to get up and expostulate, but he motioned me back. \"I know, but don't you see that that is far more likely than....\" He stopped and shook his head. Then he brightened. \"I have an idea. Maybe we can have a demonstration.\"\n \n He thought for a tense minute and snapped his fingers. \"Have you any change on you?\"\n \n \"Why, yes,\" I said. \"Quite a bit.\" I reached into my pocket. There must have been nearly two dollars in silver and pennies. \"Do you think they'll each have the same date, perhaps?\"\n \n \"Did you accumulate all that change today?\"\n \n \"No. During the week.\"\n \n He shook his head. \"In that case, no. Discounting the fact that you could have prearranged it, if my dim provisional theory is right, that would be actually impossible. It would involve time-reversal. I'll tell you about it later. No, just throw down the change. Let's see if they all come up heads.\"\n \n I moved away from the carpet and tossed the handful of coins onto the floor. They clattered and bounced—and bounced together—and stacked themselves into a neat pile.\n \n I looked at McGill. His eyes were narrowed. Without a word, he took a handful of coins from his own pocket and threw them.\n \n These coins didn't stack. They just fell into an exactly straight line, the adjacent ones touching.\n \n \"Well,\" I said, \"what more do you want?\"\n \n \"Great Scott,\" he said, and sat down. \"I suppose you know that there are two great apparently opposite principles governing the Universe—random and design. The sands on the beach are an example of random distribution and life is an example of design. The motions of the particles of a gas are what we call random, but there are so many of them, we treat them statistically and derive the Second Law of Thermodynamics—quite reliable. It isn't theoretically hard-and-fast; it's just a matter of extreme probability. Now life, on the other hand, seems not to depend on probability at all; actually, it goes against it. Or you might say it is certainly not an accidental manifestation.\"\n \n \"Do you mean,\" I asked in some confusion, \"that some form of life is controlling the coins and—the other things?\"\n \n \n\n \n He shook his head. \"No. All I mean is that improbable things usually have improbable explanations. When I see a natural law being broken, I don't say to myself, 'Here's a miracle.' I revise my version of the book of rules. Something—I don't know what—is going on, and it seems to involve probability, and it seems to center around you. Were you still in that building when the elevators stuck? Or near it?\"\n \n \"I guess I must have been. It happened just after I left.\"\n \n \"Hm. You're the center, all right. But why?\"\n \n \"Center of what?\" I asked. \"I feel as though I were the center of an electrical storm. Something has it in for me!\"\n \n McGill grinned. \"Don't be superstitious. And especially don't be anthropomorphic.\"\n \n \"Well, if it's the opposite of random, it's got to be a form of life.\"\n \n \"On what basis? All we know for certain is that random motions are being rearranged. A crystal, for example, is not life, but it's a non-random arrangement of particles.... I wonder.\" He had a faraway, frowning look.\n \n I was beginning to feel hungry and the drinks had worn off.\n \n \"Let's go out and eat,\" I said, \"There's not a damn thing in the kitchen and I'm not allowed to cook. Only eggs and coffee.\"\n \n We put on our hats and went down to the street. From either end, we could hear wrecking trucks towing away the stalled cars. There were, by this time, a number of harassed cops directing the maneuver and we heard one of them say to Danny, \"I don't know what the hell's going on around here. Every goddam car's got something the matter with it. They can't none of them back out for one reason or another. Never seen anything like it.\"\n \n Near us, two pedestrians were doing a curious little two-step as they tried to pass one another; as soon as one of them moved aside to let the other pass, the other would move to the same side. They both had embarrassed grins on their faces, but before long their grins were replaced by looks of suspicion and then determination.\n \n \"All right, smart guy!\" they shouted in unison, and barged ahead, only to collide. They backed off and threw simultaneous punches which met in mid-air. Then began one of the most remarkable bouts ever witnessed—a fight in which fist hit fist but never anything else, until both champions backed away undefeated, muttering identical excuses and threats.\n \n \n\n \n Danny appeared at that moment. His face was dripping. \"You all right, Mr. Graham?\" he asked. \"I don't know what's going on around here, but ever since I came on this afternoon, things are going crazy. Bartley!\" he shouted—he could succeed as a hog-caller. \"Bring those dames over here!\"\n \n Three women in a confused wrangle, with their half-open umbrellas intertwined, were brought across the street, which meant climbing over fenders. Bartley, a fine young patrolman, seemed self-conscious; the ladies seemed not to be.\n \n \"All right, now, Mrs. Mac-Philip!\" one of them said. \"Leave go of my umbrella and we'll say no more about it!\"\n \n \"And so now it's Missus Mac-Philip, is it?\" said her adversary.\n \n The third, a younger one with her back turned to us, her umbrella also caught in the tangle, pulled at it in a tentative way, at which the other two glared at her. She turned her head away and tried to let go, but the handle was caught in her glove. She looked up and I saw it was Molly. My nurse-wife.\n \n \"Oh, Alec!\" she said, and managed to detach herself. \"Are you all right?\" Was I all right!\n \n \"Molly! What are you doing here?\"\n \n \"I was so worried, and when I saw all this, I didn't know what to think.\" She pointed to the stalled cars. \"Are you really all right?\"\n \n \"Of course I'm all right. But why....\"\n \n \"The Oyster Bay operator said someone kept dialing and dialing Mother's number and there wasn't anyone on the line, so then she had it traced and it came from our phone here. I kept calling up, but I only got a busy signal. Oh, dear, are you sure you're all right?\"\n \n I put my arm around her and glanced at McGill. He had an inward look. Then I caught Danny's eye. It had a thoughtful, almost suspicious cast to it.\n \n \"Trouble does seem to follow you, Mr. Graham,\" was all he said.\n \n When we got upstairs, I turned to McGill. \"Explain to Molly,\" I said.\n\"And incidentally to me. I'm not properly briefed yet.\"\n \n He did so, and when he got to the summing up, I had the feeling she was a jump ahead of him.\n \n \"In other words, you think it's something organic?\"\n \n \"Well,\" McGill said, \"I'm trying to think of anything else it might be. I'm not doing so well,\" he confessed.\n \n \"But so far as I can see,\" Molly answered, \"it's mere probability, and without any over-all pattern.\"\n \n \"Not quite. It has a center. Alec is the center.\"\n \n \n\n \n Molly looked at me with a curious expression for a moment. \"Do you feel all right, darling?\" she asked me. I nodded brightly. \"You'll think this silly of me,\" she went on to McGill, \"but why isn't it something like an overactive poltergeist?\"\n \n \"Pure concept,\" he said. \"No genuine evidence.\"\n \n \"Magnetism?\"\n \n \"Absolutely not. For one thing, most of the objects affected weren't magnetic—and don't forget magnetism is a force, not a form of energy, and a great deal of energy has been involved. I admit the energy has mainly been supplied by the things themselves, but in a magnetic field, all you'd get would be stored kinetic energy, such as when a piece of iron moves to a magnet or a line of force. Then it would just stay there, like a rundown clock weight. These things do a lot more than that—they go on moving.\"\n \n \"Why did you mention a crystal before? Why not a life-form?\"\n \n \"Only an analogy,\" said McGill. \"A crystal resembles life in that it has a definite shape and exhibits growth, but that's all. I'll agree this—thing—has no discernible shape and motion is involved, but plants don't move and amebas have no shape. Then a crystal feeds, but it does not convert what it feeds on; it merely rearranges it into a non-random pattern. In this case, it's rearranging random motions and it has a nucleus and it seems to be growing—at least in what you might call improbability.\"\n \n Molly frowned. \"Then what is it? What's it made of?\"\n \n \"I should say it was made of the motions. There's a similar idea about the atom. Another thing that's like a crystal is that it appears to be forming around a nucleus not of its own material—the way a speck of sand thrown into a supersaturated solution becomes the nucleus of crystallization.\"\n \n \"Sounds like the pearl in an oyster,\" Molly said, and gave me an impertinent look.\n \n \"Why,\" I asked McGill, \"did you say the coins couldn't have the same date? I mean apart from the off chance I got them that way.\"\n \n \"Because I don't think this thing got going before today and everything that's happened can all be described as improbable motions here and now. The dates were already there, and to change them would require retroactive action, reversing time. That's out, in my book. That telephone now—\"\n \n The doorbell rang. We were not surprised to find it was the telephone repairman. He took the set apart and clucked like a hen.\n \n \"I guess you dropped it on the floor, mister,\" he said with strong disapproval.\n \n \"Certainly not,\" I said. \"Is it broken?\"\n \n \"Not exactly broken , but—\" He shook his head and took it apart some more.\n \n \n\n \n McGill went over and they discussed the problem in undertones. Finally the man left and Molly called her mother to reassure her. McGill tried to explain to me what had happened with the phone.\n \n \"You must have joggled something loose. And then you replaced the receiver in such a way that the contact wasn't quite open.\"\n \n \"But for Pete's sake, Molly says the calls were going on for a long time! I phoned you only a short time ago and it must have taken her nearly two hours to get here from Oyster Bay.\"\n \n \"Then you must have done it twice and the vibrations in the floor—something like that—just happened to cause the right induction impulses. Yes, I know how you feel,\" he said, seeing my expression.\n\"It's beginning to bear down.\"\n \n Molly was through telephoning and suggested going out for dinner. I was so pleased to see her that I'd forgotten all about being hungry.\n \n \"I'm in no mood to cook,\" she said. \"Let's get away from all this.\"\n \n McGill raised an eyebrow. \"If all this, as you call it, will let us.\"\n \n In the lobby, we ran into Nat, looking smug in a journalistic way.\n \n \"I've been put on the story—who could be better?—I live here. So far, I don't quite get what's been happening. I've been talking to Danny, but he didn't say much. I got the feeling he thinks you're involved in some mystical, Hibernian way. Hello, McGill, what's with you?\"\n \n \"He's got a theory,\" said Molly. \"Come and eat with us and he'll tell you all about it.\"\n \n Since we decided on an air-conditioned restaurant nearby on Sixth Avenue, we walked. The jam of cars didn't seem to be any less than before and we saw Danny again. He was talking to a police lieutenant, and when he caught sight of us, he said something that made the lieutenant look at us with interest. Particularly at me.\n \n \"If you want your umbrella, Mrs. Graham,\" Danny said, \"it's at the station house. What there's left of it, that is.\"\n \n Molly thanked him and there was a short pause, during which I felt the speculative regard of the lieutenant. I pulled out a packet of cigarettes, which I had opened, as always, by tearing off the top. I happened to have it upside down and all the cigarettes fell out. Before I could move my foot to obliterate what they had spelled out on the sidewalk, the two cops saw it. The lieutenant gave me a hard look, but said nothing. I quickly kicked the insulting cigarettes into the gutter.\n \n When we got to the restaurant, it was crowded but cool—although it didn't stay cool for long. We sat down at a side table near the door and ordered Tom Collinses as we looked at the menu. Sitting at the next table were a fat lady, wearing a very long, brilliant green evening gown, and a dried-up sour-looking man in a tux. When the waiter returned, they preempted him and began ordering dinner fussily: cold cuts for the man, and vichyssoise, lobster salad and strawberry parfait for the fat lady.\n \n I tasted my drink. It was most peculiar; salt seemed to have been used instead of sugar. I mentioned this and my companions tried theirs, and made faces.\n \n \n\n \n The waiter was concerned and apologetic, and took the drinks back to the bar across the room. The bartender looked over at us and tasted one of the drinks. Then he dumped them in his sink with a puzzled expression and made a new batch. After shaking this up, he set out a row of glasses, put ice in them and began to pour.\n \n That is to say he tilted the shaker over the first one, but nothing came out. He bumped it against the side of the bar and tried again. Still nothing. Then he took off the top and pried into it with his pick, his face pink with exasperation.\n \n I had the impression that the shaker had frozen solid. Well, ice is a crystal, I thought to myself.\n \n The other bartender gave him a fresh shaker, but the same thing happened, and I saw no more because the customers sitting at the bar crowded around in front of him, offering advice. Our waiter came back, baffled, saying he'd have the drinks in a moment, and went to the kitchen. When he returned, he had madame's vichyssoise and some rolls, which he put down, and then went to the bar, where the audience had grown larger.\n \n Molly lit a cigarette and said, \"I suppose this is all part of it, Alec. Incidentally, it seems to be getting warmer in here.\"\n \n It was, and I had the feeling the place was quieter—a background noise had stopped. It dawned on me that I no longer heard the faint hum of the air-conditioner over the door, and as I started to say so, I made a gesture toward it. My hand collided with Molly's when she tapped her cigarette over the ashtray, and the cigarette landed in the neighboring vichyssoise.\n \n \"Hey! What's the idea?\" snarled the sour-looking man.\n \n \"I'm terribly sorry,\" I said. \"It was an accident. I—\"\n \n \"Throwing cigarettes at people!\" the fat lady said.\n \n \"I really didn't mean to,\" I began again, getting up. There must have been a hole in the edge of their tablecloth which one of my cuff buttons caught in, because as I stepped out from between the closely set tables, I pulled everything—tablecloth, silver, water glasses, ashtrays and the vichyssoise-à-la-nicotine—onto the floor.\n \n The fat lady surged from the banquette and slapped me meatily. The man licked his thumb and danced as boxers are popularly supposed to do. The owner of the place, a man with thick black eyebrows, hustled toward us with a determined manner. I tried to explain what had happened, but I was outshouted, and the owner frowned darkly.",
      "metadata": {
        "title": "I Am a Nucleus",
        "author": "Stephen Barr",
        "passage_id": "51330",
        "uid": "bf36ebc9c4a34302b907a0e5fa6010eb",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "107",
                "uid": "26b7ab68cba049ae80cd2efc54532e51",
                "response_text": "Alec Graham returns to his home from the office after a long day. His wife Molly has left, and he still feels that it looks wife-deserted even after doing many chores to clean it up. He recounts his bad day, having forgotten to set his alarm and rushing to the TV Studio that he writes for. The taxi driver refuses to take him to Madison and Fifty-fourth, and the rain has gotten worse. His hand continuously bleeds after passing by a big excavation site, and he misses his story conference. After hearing the same phrases numerous times and all six elevators being jammed, he is convinced that he is coincidence prone. Molly leaves him instructions on how to take care of himself, and he works on his novel. More of these events happen with pigeons colliding and somebody getting five straight-flushes in a row. Nat tells Alec about the strange occurrence as they get soda. The three bottles do not break after falling at least five feet, and Danny, the cop, is shocked. Outside, more strange events occur when Nat almost gets caught up with a swerving taxi. Once they return home, he immediately calls McGill, an assistant mathematics professor for some expert advice. Once McGill arrives, he says that all of the events are very improbable, which makes him inclined to believe that Alec is stringing him on or subject to delusion. They do an experiment involving coin-throwing, and all of the coins are arranged in a neat pile when Alec throws them. McGill asks him some more questions about any recent occurrences, but Alec suggests that they go outside to eat. Outside, the cars are being towed away, while two pedestrians are having trouble letting each other pass. Danny is confused by all that is happening. Alec also runs into Molly, stuck in a confused wrangle of umbrellas with two other women. She explains that somebody from their home had kept calling her mother’s number, so she came back to investigate. Back at the apartment, all of this is traced back to Alec as the center. McGill tries to explain what is possibly happening to Alec, but they are interrupted by the telephone repairman. Molly suggests they go out to a restaurant to eat, and Nat comes along. They pass by the car jam again, and the police lieutenant looks at Alec with interest. Even at the restaurant, Alec realizes that his Tom Collins drink is made with salt instead of sugar. When the bartender tries to remake the drink for them, the shaker has frozen solid. It happens again with a new shaker, and the waiter is extremely confused. When Alec’s hand collides with Molly’s cigarette, it goes into the neighboring lady’s vichyssoise. The two of them are displeased, and when Alec stands up, he ends up pulling all of the contents on their entire table onto the floor. The lady and the man are furious at Alec; even the owner has come to fix the situation. "
              },
              {
                "worker_id": "101",
                "uid": "7e1ba8958e1644358e36be7e35c4b140",
                "response_text": "Alec returns to his apartment after a day at the office, feeling worn out and defeated. He recalls the events from earlier that day; he had forgotten to set his alarm clock, making him late for a conference at the advertising studio he works at. He had forgotten an umbrella and found himself in the pouring rain, where he caught a taxi only for it to not start. The subways had suffered delays as well. On his walk to the office, Alec passed by a construction site, where he was nicked by a piece of glass from an explosion. He ended up missing his conference, and on his way home, a cop tells him that the elevators in his office building had all broken down as soon as he left. Alec reflects on these events, perplexed by the accident-prone coincidences. He decides to write at his typewriter when he drops his pencil, finding that it has landed standing on its end. As he continues to be stunned by the events, he fixes a drink for himself, taking note of the several notes that his wife, Molly, had left him while she visits her mother. Alec then witnesses a card game between his neighbor, Nat, and a group of men, in which Nat draws five straight flushes. Alec invites Nat in after the heated game, and after breaking a soda, they go to the corner store to buy more, where the bottles fall through the bottom of the bag. As the two walk back to their apartment, Nat is nearly bumped into and he steps onto the curb, causing a severe accident between multiple cars. Nat later leaves to his office to write an article about the strange events, and Alec calls up McGill, a mathematics professor and friend. McGill comes to Alec's apartment, and he is suspicious that he may be delusional or lying, due to the impossible probability of the events occurring. McGill then tosses some change onto the floor, testing to see if they all land on heads; instead, the coins stack up on top of each other. McGill is also confused, trying to imagine an explanation, and Alec suggests that some form of life is controlling the events. The two go out for food and pass by three women who have their umbrellas tangled up together. One of the women turns out to be Molly, who says she returned after her mother had been receiving constant calls from Alec's phone with no one on the other end. They go back to the apartment and discuss the matter, as the telephone repairman arrives. After, the three go to a restaurant, and face more inconveniences, such as having salt in their drink instead of sugar. Alec then accidentally drops a cigarette onto a neighboring party, and the woman gets angry, as Alec somehow pulls their tablecloth and dinner onto the floor, angering many. "
              },
              {
                "worker_id": "104",
                "uid": "924165d78218453ea3185c34df24497c",
                "response_text": "The story begins with Alec missing his wife’s presence as he feels lost without her aid in his life. He details how his commute to work was heavily hindered by unlucky transportation happenings and awful weather. When Alec leaves work and gets back to his apartment, he attempts to write a bit. In addition, he thinks over the strange coincidences that have happened during the day thus far. Upon hearing a loud commotion in his apartment building hallway, he goes to investigate. He finds his neighbor Nat in an argument with a group of men accusing Nat of cheating. In a fit of rage, one of the men hits the deck of cards that Nat is holding, causing them to be tossed to the floor. In another strange coincidence, half of the cards land face down but all the face-up cards are red. The group of men leave in confusion and Alec invites Nat into his apartment for a drink to cool down. \n\nAfter consuming most of the club soda, the two men leave to grab more club soda in a nearby deli. At the deli, another strange incident occurs. The 3 glasses of club soda fall through a thin plastic bag, 5 feet towards the ground and do not break when they should have broken due to the fall. The storekeeper is shocked but Alec shrugs off the weird incident. Nat and Alec return to his apartment where he notices more strange coincidences. Alec grows frustrated and decides to call his friend McGill to help him make sense of everything. McGill promptly comes over to Alec’s apartment to help. McGill gets to the apartment and Alec tries to explain all of the coincidences. McGill is understandably very skeptical and wants Alec to prove it for his own eyes. \n\nAlec is able to prove that something strange his happening with a demonstration that involves throwing coins to the floor. The coins are thrown and somehow clustered together into a perfectly stacked pile. McGill then begins to believe Alec. He is uncertain about the probability of the coincidences but refuses to attribute it to superstitious happenings and states that it is an unknown force. When the two leave to go get food, they see and meet up with Molly on the street and quickly return to the apartment to catch Molly up on the strange occurrences. After much discussion over what could be causing the day’s incidents, they decide to all go to get food. They order drinks at the restaurant, but mysteriously the shaker is causing the liquids to freeze. Molly notes how the restaurant is continuously becoming warmer, and later Alec mentally notes that he can no longer hear the sound of the air conditioner. While preparing to discuss the issue of the AC, Alec accidentally flips his cigarette onto another occupied table. This causes a heated argument with the other guests and the unapproving look from the owner of the restaurant towards Alec. \n"
              },
              {
                "worker_id": "105",
                "uid": "f9d835c77c914ddb9bc0cfca22c1947d",
                "response_text": "Alec, the narrator, had a very weird and exhausting day. In the morning he overslept work and hurried out. A rain storm started the subway was delayed and there was a huge excavation on his way. The drill working with clay hit something glittering inside and a little explosion happened. The narrator's face was slightly scratched and bleeding. His absence at the conference wasn't noticed. Back home Alec saw his wife's nots with directions all around as she left to attend to her mother. Then he tried to write his novel and came to a dead end, so he poured himself a drink and watched some pigeons being trained outside, when some traffic occurred and a couple birds fell. There were loud voices outside: four men confronted the narrator's neighbor, a shy guy named Nat. Then the man came in for a drink, and told Alec that he had miraculously won in cards a couple times in a row, and his partners believed he had cheated. The narrator and Nat went out for sodas in glass bottles, which fell and miraculously did not break. On the street, a pedestrian, who suddenly stopped in front of Nat, caused a series of accidents leading to a huge traffic jam. Back at Alec's place, the curtain was weirdly tied in three knots and he called his knowledgeable friend McGill to get a consultation. The man came and considered all of the day's weird events very improbable but not impossible. McGill offered to make a demonstration, so Alec threw a handful of coins which bounced together, stacking into a neat pile. McGill's coins created an exactly straight line. McGill stated that Alec was the center of the weird events and there must be some design in that. They went out to eat and the cars were wrecking all along their way, overwhelming the cops. Two people were unable to go past each other, they fought making the same motions and saying identical words. Many similar situations were happening all around. One of the women with intertwined umbrellas was Molly, the wife. Her mother's number was constantly dialed with no one on the line, and Alec's number was always busy, so Molly got worried. At that point Danny, the local policeman, started suspecting Alec. The three went out for dinner eventually and took Nat with them, who wanted to hear the story. Alec dropped his cigarettes out of the pack under the suspicious gaze of Danny and a lieutenant. In the restaurant the whole company got salty drinks which puzzled the bartender. When he tried to do the new ones, nothing came out of the shaker - everything inside turned into ice. The place suddenly started getting warmer and quieter. Alec's hand collided with Molly's and her cigarette fell into the dish of a perturbed lady at the nearby table. While standing up, Alec accidentally pulled everything from that table to the floor and the angry lady slapped him. "
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "107",
                "uid": "26b7ab68cba049ae80cd2efc54532e51",
                "response_text": "The story is initially set in Alec’s home. There is a radio, Greenwich Village thermometer, and a living room. In the home, there is also carpet, cushions, and ashtrays for cigarettes. Alec also owns an alarm clock to help him wake up. In the living room, there is also a typewriter and a telephone. Alec tries to go to his conference in New York, but it is raining heavily, and the cab refuses to take him to his destination. However, the story also mentions the subway, which he takes. Alec’s stop is Fifty-first and Lexington. There is also mention of a big excavation site for a new building. On his way to the studio, he also stops at the drugstore. There are also at least six elevators in his building. Around the corner of the apartment, there is a delicatessen that sells soda. On the streets outside, cars are jamming into each other and have to be towed away. Later, the story is set in a restaurant near Sixth Avenue. The restaurant is crowded but cool, and there is a bar too. There is also background music and the faint hum of the air-conditioner, both that stop shortly after. \n"
              },
              {
                "worker_id": "101",
                "uid": "7e1ba8958e1644358e36be7e35c4b140",
                "response_text": "The story takes place in New York City. Alec lives in Greenwich Village and works at an office on the Upper East Side, on Madison Avenue. Alec lives in an apartment complex in a comfortable home, containing a living room where he keeps his typewriter, a small kitchen, and a bedroom. Alec's living room window offers a view of the roof across from him. Throughout the story, Alec visits many different places. In addition to his office, he goes to a small corner store to purchase soda, as well as a restaurant near Sixth Avenue. "
              },
              {
                "worker_id": "104",
                "uid": "924165d78218453ea3185c34df24497c",
                "response_text": "The main setting of the story is presumed to be in Manhattan in New York City. Alec goes to different parts of the city due to work, where he lives, and for food. His commute on the subway was fraught with troubles and he ends up missing a meeting at work, though his absence goes unnoticed. His wife, Molly, who was visiting her mother, finds him on the street surrounded by a bunch of commotion. Alec, his wife, and McGill return to Alec’s apartment to discuss what has been happening. After much discussion, they go out to eat. As more strange coincidences happen at the restaurant, Molly notes how it keeps getting warmer. "
              },
              {
                "worker_id": "105",
                "uid": "f9d835c77c914ddb9bc0cfca22c1947d",
                "response_text": "The story starts in Alec's apartment which looks wife-deserted as Molly, his wife, is visiting her mother. All around the apartment there are what-to-do notes from Molly. Alec rushes out for his job and it starts raining really bad outside. The cab doesn't move and he gets into the subway. Then he exits near his job, there is a huge excavation nearby, with men drilling clay and some spectators. Inside one piece of clay there is something shiny, like glass. Alec gets to his TV studio and soon takes the subway back home. At home he makes a drink in the kitchen and sits down in the living room with some papers which are supposedly his future novel and a typewriter. Weird events like a pencil standing straight and a tied in three knots curtain keep happening. From the window Alec sees a man exercising a flock of pigeons on the rooftop and a weird traffic occurs among the birds. Alec hears loud voices and opens the door to see his neighbor, Nat, being confronted by four men in the hallway. The two get into Alec's apartment and soon go out for sodas. At the delicatessen on the corner, Alec drops three bottles of water but they don't break. A series of accidents happen on the road outside and create an enormous traffic jam. Soon, Alec is alone in his apartment and invites his friend McGill to figure out the weird happenings. After a couple more very unprovable events they go out for food. The traffic outside is incredible, every car wrecks and pedestrians can't get past one another and fight. Molly appears among the women fighting over umbrellas and the three go back home. After a couple more weird events including the broken phone, they take Nat and go to a restaurant after all. The traffic on the street is still crazy. The restaurant is air-conditioned and noisy. The drinks are salty, and when the bartender tries to redo them, the liquid freezes, gathering many spectators. The air gets warmer and another accident creates a fight between Alec and a lady at the next table.\n"
              }
            ]
          },
          {
            "question_text": "Who is McGill, and what are his traits?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "107",
                "uid": "26b7ab68cba049ae80cd2efc54532e51",
                "response_text": "McGill is an assistant mathematics professor at a nearby university. He is friends with both Alec and Molly, even calling to ask about the both of them. He is considered to be highly imaginative, but they believe that he knows everything. Personality-wise, McGill is a very logical person. He believes that what Alec has told him is normally impossible, and the odds against it are very astronomical as well. Even when Alec shows him what has happened to him, he continues to pursue a logical explanation. However, despite these theories, he tries to approach these findings logically and tells Alec not to be superstitious when they initially discuss why this is happening to him. "
              },
              {
                "worker_id": "101",
                "uid": "7e1ba8958e1644358e36be7e35c4b140",
                "response_text": "McGill works at a university as an assistant professor of mathematics. He is known to be extremely intelligent, as well as imaginative, as Alec describes him. McGill is eager to help Alec explain his improbable luck, both out of friendship and excitement by his passion for science. Though McGill is imaginative, he is also skeptical and not easily gullible, as shown when he is wary of Alec's legitimacy behind his claims. However, he can easily think outside of the box, and uses his knowledge of science to propose unheard possibilities."
              },
              {
                "worker_id": "104",
                "uid": "924165d78218453ea3185c34df24497c",
                "response_text": "McGill is a professor of mathematics at a nearby university. He lives near Alec and is appreciated for his intellectual advice. He is described as being very imaginative, but his advice is held in high regard. He is quick to help Alec after a simple phone call with no explanation of Alec’s need. When Alec explains the strange occurrences throughout the day, McGill is skeptical but willing to give Alec the benefit of the doubt. He routinely measures the likelihood of occurrences in an analytical manner that relies on probability. "
              },
              {
                "worker_id": "105",
                "uid": "f9d835c77c914ddb9bc0cfca22c1947d",
                "response_text": "McGill is an assistant professor of mathematics at a university, who lives near Alec. They have friendly relationship and casually meet. They are close enough for Alec to call and ask McGill to come straight away, who comes immediately. Alec and some other people from his company consider McGill very knowledgeable about all sort of things. He is open to anything and considers every possibility, even the impossible and supernatural as long as he doesn't have any other explanation. However, he believes this case to be very weird and improbable but not impossible - he has scientific approach to everything. He is interested in weird happenings and willing to find the answer. He believes only what he sees, and doesn't believe in miracles. "
              }
            ]
          },
          {
            "question_text": "Who is Molly, and what are her traits?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "107",
                "uid": "26b7ab68cba049ae80cd2efc54532e51",
                "response_text": "Molly Graham is Alec’s wife. She cares a lot about her husband, leaving him notes with instructions on what to do when she is gone. She is also a former nurse and loves Alec greatly to do all of this for him. Molly also has a habit of smoking, which she began doing when they went to the restaurant. When she notices something is wrong at home, she comes back immediately even though her previous plan was to visit her mother at Oyster Bay. Personality-wise, Molly is also a logical thinker. When Alec explains the situation to her, she also tries to find reasoning for it and catches on pretty quickly. Molly is very observant as well, watching the events that involve Alec play out. "
              },
              {
                "worker_id": "101",
                "uid": "7e1ba8958e1644358e36be7e35c4b140",
                "response_text": "Molly is Alec's wife, away in the first half of the story on a trip to her mother's. Molly is depicted as a caring and nurturing wife, shown particularly through the notes that she leaves Alec as he stays home alone. The notes, instructing Alec on housekeeping, also imply that Molly takes on a more dominant role in the household, knowing how to tend to a home and sustain the both of them. Molly is mainly concerned for Alec's well being regarding the unlucky events he is experiencing, asking if he feels alright and supporting him in searching for an explanation. "
              },
              {
                "worker_id": "104",
                "uid": "924165d78218453ea3185c34df24497c",
                "response_text": "Molly is Alec’s wife. From the detailed instruction she leaves for him while she is visiting her mother, it is clear that Molly handles much of Alec’s life. She cooks for him, organizes his schedule, cleans for him, etc. Alec seems lost without Molly’s presence. It can be discerned that Molly has a caregiver type of relationship with Alec. She cares for him deeply and is easily concerned about his well-being. She boards a 2-hour train back to the train when she cannot reach him under unusual circumstances. "
              },
              {
                "worker_id": "105",
                "uid": "f9d835c77c914ddb9bc0cfca22c1947d",
                "response_text": "Molly is Alec's wife and a nurse. She treats Alec as her helpless patient, when she leaves, she places notes with directions for every simple action. So, she is even more attentive and thoughtful than she should be with a grown up man. She is very caring as she comes immediately as Alec's phone is busy. She is very anxious for him. She is clever and organized, she immediately evaluates the situation and shares her thoughts. She is friendly to everyone and they have very good relationship with Alec - he is very happy to see her and he missed her badly even during the ten days."
              }
            ]
          },
          {
            "question_text": "How do the strange coincidences that happen to Alec affect his mood throughout the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "107",
                "uid": "26b7ab68cba049ae80cd2efc54532e51",
                "response_text": "Alec is tired, upset, and confused about the strange coincidences relating to him. When he first goes home, he is extremely tired and compares his day to be the same as being beaten down. Judging from the events throughout his workday, he does not understand how they all relate to him and thinks of them as extremely weird coincidences. He even thinks of himself as being coincidence-prone. After the soda incident, however, he no longer finds it surprising after all that has happened to him. As the events build up, Alec slowly realizes that he is the center of it all, and he knows that he cannot get out of it. No matter how hard he tries, he directly interacts with or is nearby becomes strange coincidences. "
              },
              {
                "worker_id": "101",
                "uid": "7e1ba8958e1644358e36be7e35c4b140",
                "response_text": "As the strange coincidences occur in the story, Alec becomes increasingly frustrated. However, instead of driving him to the point of rage, the frustration drives him to exhaustion. At the beginning of the story, Alec already describes himself as feeling beaten down due to the morning's events. He feels more and more defeated as the day goes on, but also becomes more and more perplexed and fascinated. By the end of the story, Alec feels both helpless due to his uncontrollable bad luck and eager to find an explanation for this rare scenario, seeking other people for help and validation."
              },
              {
                "worker_id": "104",
                "uid": "924165d78218453ea3185c34df24497c",
                "response_text": "For a large portion of the story, Alec is very casual about the strange coincidences that occur. He acknowledges them but does not fuss over them as much as those who also see them. When he is told that he just missed being stuck in his office building’s elevators, he brushes it off as another coincidence. He does the same when his pencil lands on the floor standing on its end. Towards the end of the story, he grows more aware of the coincidences and becomes frustrated with them. The story ends with him getting into a heated argument at a restaurant when it is assumed that he purposefully flew his cigarette at an occupied table. "
              },
              {
                "worker_id": "105",
                "uid": "f9d835c77c914ddb9bc0cfca22c1947d",
                "response_text": "The first coincidences are just some bad luck as Alec thinks. When one oversleeps something important and is in a hurry, series of delaying events can happen as some bad luck. He is simply nervous about missing the conference, and tired of constant failures. It'[s also hard for him to live without his wife, his place looks wife-deserted which upsets him and this is the part of the reasons for his tardiness. When his absence isn't noticed, he returns home in a better mood and tries to write. Nothing helps though and Alec is stuck. Unnatural events start happening which distract him, at first, they simply surprise Alec. Later, they become more strong, often highly improbable - not breaking bottles, traffic, especially the three knots on the curtain. These ones look impossible to Alec and therefore scare him, so he calls McGill for a consultation. Further evidence convinces Alec in him being the center of a huge mess. He is confused and tries to hide his failures from the overseers."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5181,
        "document_length_chars": 28640
      }
    }
  ]
}