{
  "item_metadata": {
    "item_id": "51353",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51353",
      "content": "DR. KOMETEVSKY'S DAY\n \n \n By FRITZ LEIBER\n \n Illustrated by DAVID STONE\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction February 1952. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n Before science, there was superstition. After science, there will be ... what? The biggest, most staggering , most final fact of them all!\n \n\n \n \"But it's all predicted here! It even names this century for the next reshuffling of the planets.\"\n \n Celeste Wolver looked up unwillingly at the book her friend Madge Carnap held aloft like a torch. She made out the ill-stamped title, The Dance of the Planets . There was no mistaking the time of its origin; only paper from the Twentieth Century aged to that particularly nasty shade of brown. Indeed, the book seemed to Celeste a brown old witch resurrected from the Last Age of Madness to confound a world growing sane, and she couldn't help shrinking back a trifle toward her husband Theodor.\n \n He tried to come to her rescue. \"Only predicted in the vaguest way. As I understand it, Kometevsky claimed, on the basis of a lot of evidence drawn from folklore, that the planets and their moons trade positions every so often.\"\n \n \"As if they were playing Going to Jerusalem, or musical chairs,\" Celeste chimed in, but she couldn't make it sound funny.\n \n \"Jupiter was supposed to have started as the outermost planet, and is to end up in the orbit of Mercury,\" Theodor continued. \"Well, nothing at all like that has happened.\"\n \n \"But it's begun,\" Madge said with conviction. \"Phobos and Deimos have disappeared. You can't argue away that stubborn little fact.\"\n \n That was the trouble; you couldn't. Mars' two tiny moons had simply vanished during a period when, as was generally the case, the eyes of astronomy weren't on them. Just some hundred-odd cubic miles of rock—the merest cosmic flyspecks—yet they had carried away with them the security of a whole world.\n \n \n\n \n Looking at the lovely garden landscape around her, Celeste Wolver felt that in a moment the shrubby hills would begin to roll like waves, the charmingly aimless paths twist like snakes and sink in the green sea, the sparsely placed skyscrapers dissolve into the misty clouds they pierced.\n  People must have felt like this , she thought, when Aristarches first hinted and Copernicus told them that the solid Earth under their feet was falling dizzily through space. Only it's worse for us, because they couldn't see that anything had changed. We can.\n \n \n \"You need something to cling to,\" she heard Madge say. \"Dr. Kometevsky was the only person who ever had an inkling that anything like this might happen. I was never a Kometevskyite before. Hadn't even heard of the man.\"\n \n She said it almost apologetically. In fact, standing there so frank and anxious-eyed, Madge looked anything but a fanatic, which made it much worse.\n \n \"Of course, there are several more convincing alternate explanations....\" Theodor began hesitantly, knowing very well that there weren't. If Phobos and Deimos had suddenly disintegrated, surely Mars Base would have noticed something. Of course there was the Disordered Space Hypothesis, even if it was little more than the chance phrase of a prominent physicist pounded upon by an eager journalist. And in any case, what sense of security were you left with if you admitted that moons and planets might explode, or drop through unseen holes in space? So he ended up by taking a different tack: \"Besides, if Phobos and Deimos simply shot off somewhere, surely they'd have been picked up by now by 'scope or radar.\"\n \n \"Two balls of rock just a few miles in diameter?\" Madge questioned.\n\"Aren't they smaller than many of the asteroids? I'm no astronomer, but I think' I'm right.\"\n \n And of course she was.\n \n She swung the book under her arm. \"Whew, it's heavy,\" she observed, adding in slightly scandalized tones, \"Never been microfilmed.\" She smiled nervously and looked them up and down. \"Going to a party?\" she asked.\n \n Theodor's scarlet cloak and Celeste's green culottes and silver jacket justified the question, but they shook their heads.\n \n \"Just the normally flamboyant garb of the family,\" Celeste said, while Theodor explained, \"As it happens, we're bound on business connected with the disappearance. We Wolvers practically constitute a sub-committee of the Congress for the Discovery of New Purposes. And since a lot of varied material comes to our attention, we're going to see if any of it correlates with this bit of astronomical sleight-of-hand.\"\n \n Madge nodded. \"Give you something to do, at any rate. Well, I must be off. The Buddhist temple has lent us their place for a meeting.\" She gave them a woeful grin. \"See you when the Earth jumps.\"\n \n Theodor said to Celeste, \"Come on, dear. We'll be late.\"\n \n But Celeste didn't want to move too fast. \"You know, Teddy,\" she said uncomfortably, \"all this reminds me of those old myths where too much good fortune is a sure sign of coming disaster. It was just too much luck, our great-grandparents missing World III and getting the World Government started a thousand years ahead of schedule. Luck like that couldn't last, evidently. Maybe we've gone too fast with a lot of things, like space-flight and the Deep Shaft and—\" she hesitated a bit—\"complex marriages. I'm a woman. I want complete security. Where am I to find it?\"\n \n \"In me,\" Theodor said promptly.\n \n \"In you?\" Celeste questioned, walking slowly. \"But you're just one-third of my husband. Perhaps I should look for it in Edmund or Ivan.\"\n \n \"You angry with me about something?\"\n \n \"Of course not. But a woman wants her source of security whole. In a crisis like this, it's disturbing to have it divided.\"\n \n \"Well, we are a whole and, I believe, indivisible family,\" Theodor told her warmly. \"You're not suggesting, are you, that we're going to be punished for our polygamous sins by a cosmic catastrophe? Fire from Heaven and all that?\"\n \n \"Don't be silly. I just wanted to give you a picture of my feeling.\" Celeste smiled. \"I guess none of us realized how much we've come to depend on the idea of unchanging scientific law. Knocks the props from under you.\"\n \n Theodor nodded emphatically. \"All the more reason to get a line on what's happening as quickly as possible. You know, it's fantastically far-fetched, but I think the experience of persons with Extra-Sensory Perception may give us a clue. During the past three or four days there's been a remarkable similarity in the dreams of ESPs all over the planet. I'm going to present the evidence at the meeting.\"\n \n Celeste looked up at him. \"So that's why Rosalind's bringing Frieda's daughter?\"\n \n \"Dotty is your daughter, too, and Rosalind's,\" Theodor reminded her.\n \n \"No, just Frieda's,\" Celeste said bitterly. \"Of course you may be the father. One-third of a chance.\"\n \n Theodor looked at her sharply, but didn't comment. \"Anyway, Dotty will be there,\" he said. \"Probably asleep by now. All the ESPs have suddenly seemed to need more sleep.\"\n \n As they talked, it had been growing darker, though the luminescence of the path kept it from being bothersome. And now the cloud rack parted to the east, showing a single red planet low on the horizon.\n \n \"Did you know,\" Theodor said suddenly, \"that in Gulliver's Travels Dean Swift predicted that better telescopes would show Mars to have two moons? He got the sizes and distances and periods damned accurately, too. One of the few really startling coincidences of reality and literature.\"\n \n \"Stop being eerie,\" Celeste said sharply. But then she went on, \"Those names Phobos and Deimos—they're Greek, aren't they? What do they mean?\"\n \n Theodor lost a step. \"Fear and Terror,\" he said unwillingly. \"Now don't go taking that for an omen. Most of the mythological names of major and minor ancient gods had been taken—the bodies in the Solar System are named that way, of course—and these were about all that were available.\"\n \n It was true, but it didn't comfort him much.\n \n \n\n  I am a God , Dotty was dreaming, and I want to be by myself and think. I and my god-friends like to keep some of our thoughts secret, but the other gods have forbidden us to.\n \n \n A little smile flickered across the lips of the sleeping girl, and the woman in gold tights and gold-spangled jacket leaned forward thoughtfully. In her dignity and simplicity and straight-spined grace, she was rather like a circus mother watching her sick child before she went out for the trapeze act.\n  I and my god-friends sail off in our great round silver boats , Dotty went on dreaming. The other gods are angry and scared. They are frightened of the thoughts we may think in secret. They follow us to hunt us down. There are many more of them than of us.\n \n \n \n\n \n As Celeste and Theodor entered the committee room, Rosalind Wolver—a glitter of platinum against darkness—came in through the opposite door and softly shut it behind her. Frieda, a fair woman in blue robes, got up from the round table.\n \n Celeste turned away with outward casualness as Theodor kissed his two other wives. She was pleased to note that Edmund seemed impatient too. A figure in close-fitting black, unrelieved except for two red arrows at the collar, he struck her as embodying very properly the serious, fateful temper of the moment.\n \n He took two briefcases from his vest pocket and tossed them down on the table beside one of the microfilm projectors.\n \n \"I suggest we get started without waiting for Ivan,\" he said.\n \n Frieda frowned anxiously. \"It's ten minutes since he phoned from the Deep Space Bar to say he was starting right away. And that's hardly a two minutes walk.\"\n \n Rosalind instantly started toward the outside door.\n \n \"I'll check,\" she explained. \"Oh, Frieda, I've set the mike so you'll hear if Dotty calls.\"\n \n Edmund threw up his hands. \"Very well, then,\" he said and walked over, switched on the picture and stared out moodily.\n \n Theodor and Frieda got out their briefcases, switched on projectors, and began silently checking through their material.\n \n Celeste fiddled with the TV and got a newscast. But she found her eyes didn't want to absorb the blocks of print that rather swiftly succeeded each other, so, after a few moments, she shrugged impatiently and switched to audio.\n \n At the noise, the others looked around at her with surprise and some irritation, but in a few moments they were also listening.\n \n \"The two rocket ships sent out from Mars Base to explore the orbital positions of Phobos and Deimos—that is, the volume of space they'd be occupying if their positions had remained normal—report finding masses of dust and larger debris. The two masses of fine debris are moving in the same orbits and at the same velocities as the two vanished moons, and occupy roughly the same volumes of space, though the mass of material is hardly a hundredth that of the moons. Physicists have ventured no statements as to whether this constitutes a confirmation of the Disintegration Hypothesis.\n \n \"However, we're mighty pleased at this news here. There's a marked lessening of tension. The finding of the debris—solid, tangible stuff—seems to lift the whole affair out of the supernatural miasma in which some of us have been tempted to plunge it. One-hundredth of the moons has been found.\n \n \"The rest will also be!\"\n \n Edmund had turned his back on the window. Frieda and Theodor had switched off their projectors.\n \n \"Meanwhile, Earthlings are going about their business with a minimum of commotion, meeting with considerable calm the strange threat to the fabric of their Solar System. Many, of course, are assembled in churches and humanist temples. Kometevskyites have staged helicopter processions at Washington, Peking, Pretoria, and Christiana, demanding that instant preparations be made for—and I quote—'Earth's coming leap through space.' They have also formally challenged all astronomers to produce an explanation other than the one contained in that strange book so recently conjured from oblivion, The Dance of the Planets .\n \n \"That about winds up the story for the present. There are no new reports from Interplanetary Radar, Astronomy, or the other rocket ships searching in the extended Mars volume. Nor have any statements been issued by the various groups working on the problem in Astrophysics, Cosmic Ecology, the Congress for the Discovery of New Purposes, and so forth. Meanwhile, however, we can take courage from the words of a poem written even before Dr. Kometevsky's book:\n \n \"This Earth is not the steadfast place\n We landsmen build upon;\n From deep to deep she varies pace,\n And while she comes is gone.\n Beneath my feet I feel\n Her smooth bulk heave and dip;\n With velvet plunge and soft upreel\n She swings and steadies to her keel\n Like a gallant, gallant ship.\"\n \n\n \n While the TV voice intoned the poem, growing richer as emotion caught it up, Celeste looked around her at the others. Frieda, with her touch of feminine helplessness showing more than ever through her business-like poise. Theodor leaning forward from his scarlet cloak thrown back, smiling the half-smile with which he seemed to face even the unknown. Black Edmund, masking a deep uncertainty with a strong show of decisiveness.\n \n In short, her family. She knew their every quirk and foible. And yet now they seemed to her a million miles away, figures seen through the wrong end of a telescope.\n \n Were they really a family? Strong sources of mutual strength and security to each other? Or had they merely been playing family, experimenting with their notions of complex marriage like a bunch of silly adolescents? Butterflies taking advantage of good weather to wing together in a glamorous, artificial dance—until outraged Nature decided to wipe them out?\n \n As the poem was ending, Celeste saw the door open and Rosalind come slowly in. The Golden Woman's face was white as the paths she had been treading.\n \n Just then the TV voice quickened with shock. \"News! Lunar Observatory One reports that, although Jupiter is just about to pass behind the Sun, a good coronagraph of the planet has been obtained. Checked and rechecked, it admits of only one interpretation, which Lunar One feels duty-bound to release. Jupiter's fourteen moons are no longer visible! \"\n \n The chorus of remarks with which the Wolvers would otherwise have received this was checked by one thing: the fact that Rosalind seemed not to hear it. Whatever was on her mind prevented even that incredible statement from penetrating.\n \n She walked shakily to the table and put down a briefcase, one end of which was smudged with dirt.\n \n Without looking at them, she said, \"Ivan left the Deep Space Bar twenty minutes ago, said he was coming straight here. On my way back I searched the path. Midway I found this half-buried in the dirt. I had to tug to get it out—almost as if it had been cemented into the ground. Do you feel how the dirt seems to be in the leather, as if it had lain for years in the grave?\"\n \n By now the others were fingering the small case of microfilms they had seen so many times in Ivan's competent hands. What Rosalind said was true. It had a gritty, unwholesome feel to it. Also, it felt strangely heavy.\n \n \"And see what's written on it,\" she added.\n \n They turned it over. Scrawled with white pencil in big, hasty, frantic letters were two words:\n \n \"Going down!\"\n \n \n\n  The other gods , Dotty dreamt, are combing the whole Universe for us. We have escaped them many times, but now our tricks are almost used up. There are no doors going out of the Universe and our boats are silver beacons to the hunters. So we decide to disguise them in the only way they can be disguised. It is our last chance.\n \n \n \n\n \n Edmund rapped the table to gain the family's attention. \"I'd say we've done everything we can for the moment to find Ivan. We've made a thorough local search. A wider one, which we can't conduct personally, is in progress. All helpful agencies have been alerted and descriptions are being broadcast. I suggest we get on with the business of the evening—which may very well be connected with Ivan's disappearance.\"\n \n One by one the others nodded and took their places at the round table. Celeste made a great effort to throw off the feeling of unreality that had engulfed her and focus attention on her microfilms.\n \n \"I'll take over Ivan's notes,\" she heard Edmund say. \"They're mainly about the Deep Shaft.\"\n \n \"How far have they got with that?\" Frieda asked idly. \"Twenty-five miles?\"\n \n \"Nearer thirty, I believe,\" Edmund answered, \"and still going down.\"\n \n At those last two words they all looked up quickly. Then their eyes went toward Ivan's briefcase.\n \n \n\n  Our trick has succeeded , Dotty dreamt. The other gods have passed our hiding place a dozen times without noticing. They search the Universe for us many times in vain. They finally decide that we have found a door going out of the Universe. Yet they fear us all the more. They think of us as devils who will some day return through the door to destroy them. So they watch everywhere. We lie quietly smiling in our camouflaged boats, yet hardly daring to move or think, for fear that the faintest echoes of our doings will give them a clue. Hundreds of millions of years pass by. They seem to us no more than drugged hours in a prison.\n \n \n \n\n \n Theodor rubbed his eyes and pushed his chair back from the table. \"We need a break.\"\n \n Frieda agreed wearily. \"We've gone through everything.\"\n \n \"Good idea,\" Edmund said briskly. \"I think we've hit on several crucial points along the way and half disentangled them from the great mass of inconsequential material. I'll finish up that part of the job right now and present my case when we're all a bit fresher. Say half an hour?\"\n \n Theodor nodded heavily, pushing up from his chair and hitching his cloak over a shoulder.\n \n \"I'm going out for a drink,\" he informed them.\n \n After several hesitant seconds, Rosalind quietly followed him. Frieda stretched out on a couch and closed her eyes. Edmund scanned microfilms tirelessly, every now and then setting one aside.\n \n Celeste watched him for a minute, then sprang up and started toward the room where Dotty was asleep. But midway she stopped.\n  Not my child , she thought bitterly. Frieda's her mother, Rosalind her nurse. I'm nothing at all. Just one of the husband's girl friends. A lady of uneasy virtue in a dissolving world.\n \n \n But then she straightened her shoulders and went on.\n \n \n\n \n Rosalind didn't catch up with Theodor. Her footsteps were silent and he never looked back along the path whose feeble white glow rose only knee-high, lighting a low strip of shrub and mossy tree trunk to either side, no more.\n \n It was a little chilly. She drew on her gloves, but she didn't hurry. In fact, she fell farther and farther behind the dipping tail of his scarlet cloak and his plodding red shoes, which seemed to move disembodied, like those in the fairy tale.\n \n When she reached the point where she had found Ivan's briefcase, she stopped altogether.\n \n A breeze rustled the leaves, and, moistly brushing her cheek, brought forest scents of rot and mold. After a bit she began to hear the furtive scurryings and scuttlings of forest creatures.\n \n She looked around her half-heartedly, suddenly realizing the futility of her quest. What clues could she hope to find in this knee-high twilight? And they'd thoroughly combed the place earlier in the night.\n \n Without warning, an eerie tingling went through her and she was seized by a horror of the cold, grainy Earth underfoot—an ancestral terror from the days when men shivered at ghost stories about graves and tombs.\n \n A tiny detail persisted in bulking larger and larger in her mind—the unnaturalness of the way the Earth had impregnated the corner of Ivan's briefcase, almost as if dirt and leather co-existed in the same space. She remembered the queer way the partly buried briefcase had resisted her first tug, like a rooted plant.\n \n She felt cowed by the mysterious night about her, and literally dwarfed, as if she had grown several inches shorter. She roused herself and started forward.\n \n Something held her feet.\n \n They were ankle-deep in the path. While she looked in fright and horror, they began to sink still lower into the ground.\n \n She plunged frantically, trying to jerk loose. She couldn't. She had the panicky feeling that the Earth had not only trapped but invaded her; that its molecules were creeping up between the molecules of her flesh; that the two were becoming one.\n \n And she was sinking faster. Now knee-deep, thigh-deep, hip-deep, waist-deep. She beat at the powdery path with her hands and threw her body from side to side in agonized frenzy like some sinner frozen in the ice of the innermost circle of the ancients' hell. And always the sense of the dark, grainy tide rose inside as well as around her.\n \n She thought, he'd just have had time to scribble that note on his briefcase and toss it away. She jerked off a glove, leaned out as far as she could, and made a frantic effort to drive its fingers into the powdery path. Then the Earth mounted to her chin, her nose, and covered her eyes.\n \n She expected blackness, but it was as if the light of the path stayed with her, making a little glow all around. She saw roots, pebbles, black rot, worn tunnels, worms. Tier on tier of them, her vision penetrating the solid ground. And at the same time, the knowledge that these same sorts of things were coursing up through her.\n \n \n\n \n And still she continued to sink at a speed that increased, as if the law of gravitation applied to her in a diminished way. She dropped from black soil through gray clay and into pale limestone.\n \n \n\n \n Her tortured, rock-permeated lungs sucked at rock and drew in air. She wondered madly if a volume of air were falling with her through the stone.\n \n A glitter of quartz. The momentary openness of a foot-high cavern with a trickle of water. And then she was sliding down a black basalt column, half inside it, half inside gold-flecked ore. Then just black basalt. And always faster.\n \n It grew hot, then hotter, as if she were approaching the mythical eternal fires.\n \n \n\n \n At first glance Theodor thought the Deep Space Bar was empty. Then he saw a figure hunched monkeylike on the last stool, almost lost in the blue shadows, while behind the bar, her crystal dress blending with the tiers of sparkling glasses, stood a grave-eyed young girl who could hardly have been fifteen.\n \n The TV was saying, \"... in addition, a number of mysterious disappearances of high-rating individuals have been reported. These are thought to be cases of misunderstanding, illusory apprehension, and impulse traveling—a result of the unusual stresses of the time. Finally, a few suggestible individuals in various parts of the globe, especially the Indian Peninsula, have declared themselves to be 'gods' and in some way responsible for current events.\n \n \"It is thought—\"\n \n The girl switched off the TV and took Theodor's order, explaining casually, \"Joe wanted to go to a Kometevskyite meeting, so I took over for him.\" When she had prepared Theodor's highball, she announced,\n\"I'll have a drink with you gentlemen,\" and squeezed herself a glass of pomegranate juice.\n \n The monkeylike figure muttered, \"Scotch-and-soda,\" then turned toward Edmund and asked, \"And what is your reaction to all this, sir?\"\n \n \n\n \n Theodor recognized the shrunken wrinkle-seamed face. It was Colonel Fortescue, a military antique long retired from the Peace Patrol and reputed to have seen actual fighting in the Last Age of Madness. Now, for some reason, the face sported a knowing smile.\n \n Theodor shrugged. Just then the TV \"big news\" light blinked blue and the girl switched on audio. The Colonel winked at Theodor.\n \n \"... confirming the disappearance of Jupiter's moons. But two other utterly fantastic reports have just been received. First, Lunar Observatory One says that it is visually tracking fourteen small bodies which it believes may be the lost moons of Jupiter. They are moving outward from the Solar System at an incredible velocity and are already beyond the orbit of Saturn!\"\n \n The Colonel said, \"Ah!\"\n \n \"Second, Palomar reports a large number of dark bodies approaching the Solar System at an equally incredible velocity. They are at about twice the distance of Pluto, but closing in fast! We will be on the air with further details as soon as possible.\"\n \n The Colonel said, \"Ah-ha!\"\n \n Theodor stared at him. The old man's self-satisfied poise was almost amusing.\n \n \"Are you a Kometevskyite?\" Theodor asked him.\n \n The Colonel laughed. \"Of course not, my boy. Those poor people are fumbling in the dark. Don't you see what's happened?\"\n \n \"Frankly, no.\"\n \n The Colonel leaned toward Theodor and whispered gruffly, \"The Divine Plan. God is a military strategist, naturally.\"\n \n Then he lifted the scotch-and-soda in his clawlike hand and took a satisfying swallow.\n \n \"I knew it all along, of course,\" he went on musingly, \"but this last news makes it as plain as a rocket blast, at least to anyone who knows military strategy. Look here, my boy, suppose you were commanding a fleet and got wind of the enemy's approach—what would you do? Why, you'd send your scouts and destroyers fanning out toward them. Behind that screen you'd mass your heavy ships. Then—\"\n \n \"You don't mean to imply—\" Theodor interrupted.\n \n The girl behind the bar looked at them both cryptically.\n \n \"Of course I do!\" the Colonel cut in sharply. \"It's a war between the forces of good and evil. The bright suns and planets are on one side, the dark on the other. The moons are the destroyers, Jupiter and Saturn are the big battleships, while we're on a heavy cruiser, I'm proud to say. We'll probably go into action soon. Be a corking fight, what? And all by divine strategy!\"\n \n He chuckled and took another big drink. Theodor looked at him sourly. The girl behind the bar polished a glass and said nothing.\n \n \n\n \n Dotty suddenly began to turn and toss, and a look of terror came over her sleeping face. Celeste leaned forward apprehensively.\n \n The child's lips worked and Celeste made out the sleepy-fuzzy words:\n\"They've found out where we're hiding. They're coming to get us. No! Please, no!\"\n \n Celeste's reactions were mixed. She felt worried about Dotty and at the same time almost in terror of her, as if the little girl were an agent of supernatural forces. She told herself that this fear was an expression of her own hostility, yet she didn't really believe it. She touched the child's hand.\n \n Dotty's eyes opened without making Celeste feel she had quite come awake. After a bit she looked at Celeste and her little lips parted in a smile.\n \n \"Hello,\" she said sleepily. \"I've been having such funny dreams.\" Then, after a pause, frowning, \"I really am a god, you know. It feels very queer.\"\n \n \"Yes, dear?\" Celeste prompted uneasily. \"Shall I call Frieda?\"\n \n The smile left Dotty's lips. \"Why do you act so nervous around me?\" she asked. \"Don't you love me, Mummy?\"\n \n Celeste started at the word. Her throat closed. Then, very slowly, her face broke into a radiant smile. \"Of course I do, darling. I love you very much.\"\n \n Dotty nodded happily, her eyes already closed again.\n \n There was a sudden flurry of excited voices beyond the door. Celeste heard her name called. She stood up.\n \n \"I'm going to have to go out and talk with the others,\" she said. \"If you want me, dear, just call.\"\n \n \"Yes, Mummy.\"\n \n \n\n \n Edmund rapped for attention. Celeste, Frieda, and Theodor glanced around at him. He looked more frightfully strained, they realized, than even they felt. His expression was a study in suppressed excitement, but there were also signs of a knowledge that was almost too overpowering for a human being to bear.\n \n His voice was clipped, rapid. \"I think it's about time we stopped worrying about our own affairs and thought of those of the Solar System, partly because I think they have a direct bearing on the disappearances of Ivan end Rosalind. As I told you, I've been sorting out the crucial items from the material we've been presenting. There are roughly four of those items, as I see it. It's rather like a mystery story. I wonder if, hearing those four clues, you will come to the same conclusion I have.\"\n \n The others nodded.\n \n \"First, there are the latest reports from Deep Shaft, which, as you know, has been sunk to investigate deep-Earth conditions. At approximately twenty-nine miles below the surface, the delvers have encountered a metallic obstruction which they have tentatively named the durasphere. It resists their hardest drills, their strongest corrosives. They have extended a side-tunnel at that level for a quarter of a mile. Delicate measurements, made possible by the mirror-smooth metal surface, show that the durasphere has a slight curvature that is almost exactly equal to the curvature of the Earth itself. The suggestion is that deep borings made anywhere in the world would encounter the durasphere at the same depth.\n \n \"Second, the movements of the moons of Mars and Jupiter, and particularly the debris left behind by the moons of Mars. Granting Phobos and Deimos had duraspheres proportional in size to that of Earth, then the debris would roughly equal in amount the material in those two duraspheres' rocky envelopes. The suggestion is that the two duraspheres suddenly burst from their envelopes with such titanic velocity as to leave those disrupted envelopes behind.\"\n \n It was deadly quiet in the committee room.\n \n \"Thirdly, the disappearances of Ivan and Rosalind, and especially the baffling hint—from Ivan's message in one case and Rosalind's downward-pointing glove in the other—that they were both somehow drawn into the depths of the Earth.\n \n \"Finally, the dreams of the ESPs, which agree overwhelmingly in the following points: A group of beings separate themselves from a godlike and telepathic race because they insist on maintaining a degree of mental privacy. They flee in great boats or ships of some sort. They are pursued on such a scale that there is no hiding place for them anywhere in the universe. In some manner they successfully camouflage their ships. Eons pass and their still-fanatical pursuers do not penetrate their secret. Then, suddenly, they are detected.\"\n \n Edmund waited. \"Do you see what I'm driving at?\" he asked hoarsely.\n \n \n\n \n He could tell from their looks that the others did, but couldn't bring\n themselves to put it into words.\n \n \"I suppose it's the time-scale and the value-scale that are so hard for\n us to accept,\" he said softly. \"Much more, even, than the size-scale.\n The thought that there are creatures in the Universe to whom the whole\n career of Man—in fact, the whole career of life—is no more than a few\n thousand or hundred thousand years. And to whom Man is no more than a\n minor stage property—a trifling part of a clever job of camouflage.\"\n \n This time he went on, \"Fantasy writers have at times hinted all sorts\n of odd things about the Earth—that it might even be a kind of single\n living creature, or honeycombed with inhabited caverns, and so on.\n But I don't know that any of them have ever suggested that the Earth,\n together with all the planets and moons of the Solar System, might\n be....\"\n \n In a whisper, Frieda finished for him, \"... a camouflaged fleet of\n gigantic spherical spaceships.\"\n \n \" Your guess happens to be the precise truth. \"\n \n At that familiar, yet dreadly unfamiliar voice, all four of them swung\n toward the inner door. Dotty was standing there, a sleep-stupefied\n little girl with a blanket caught up around her and dragging behind.\n Their own daughter. But in her eyes was a look from which they cringed.\n \n She said, \"I am a creature somewhat older than what your geologists\n call the Archeozoic Era. I am speaking to you through a number of\n telepathically sensitive individuals among your kind. In each case my\n thoughts suit themselves to your level of comprehension. I inhabit the\n disguised and jetless spaceship which is your Earth.\"\n \n Celeste swayed a step forward. \"Baby....\" she implored.\n \n Dotty went on, without giving her a glance, \"It is true that we planted\n the seeds of life on some of these planets simply as part of our\n camouflage, just as we gave them a suitable environment for each. And\n it is true that now we must let most of that life be destroyed. Our\n hiding place has been discovered, our pursuers are upon us, and we must\n make one last effort to escape or do battle, since we firmly believe\n that the principle of mental privacy to which we have devoted our\n existence is perhaps the greatest good in the whole Universe.\n \n \"But it is not true that we look with contempt upon you. Our whole race\n is deeply devoted to life, wherever it may come into being, and it is\n our rule never to interfere with its development. That was one of\n the reasons we made life a part of our camouflage—it would make our\n pursuers reluctant to examine these planets too closely.\n \n \"Yes, we have always cherished you and watched your evolution with\n interest from our hidden lairs. We may even unconsciously have shaped\n your development in certain ways, trying constantly to educate you away\n from war and finally succeeding—which may have given the betraying\n clue to our pursuers.\n \n \"Your planets must be burst asunder—this particular planet in the\n area of the Pacific—so that we may have our last chance to escape.\n Even if we did not move, our pursuers would destroy you with us. We\n cannot invite you inside our ships—not for lack of space, but because\n you could never survive the vast accelerations to which you would be\n subjected. You would, you see, need very special accommodations, of\n which we have enough only for a few.\n \n \"Those few we will take with us, as the seed from which a new human\n race may—if we ourselves somehow survive—be born.\"\n \n \n\n \n Rosalind and Ivan stared dumbly at each other across the egg-shaped\n silver room, without apparent entrance or exit, in which they were\n sprawled. But their thoughts were no longer of thirty-odd mile\n journeys down through solid earth, or of how cool it was after the\n heat of the passage, or of how grotesque it was to be trapped here,\n the fragment of a marriage. They were both listening to the voice that\n spoke inside their minds.\n \n \"In a few minutes your bodies will be separated into layers one atom\n thick, capable of being shelved or stored in such a way as to endure\n almost infinite accelerations. Single cells will cover acres of space.\n But do not be alarmed. The process will be painless and each particle\n will be catalogued for future assembly. Your consciousness will endure\n throughout the process.\"\n \n Rosalind looked at her gold-shod toes. She was wondering, will they go\n first, or my head? Or will I be peeled like an apple?\n \n \n She looked at Ivan and knew he was thinking the same thing.\n \n \n\n \n Up in the committee room, the other Wolvers slumped around the table.\n Only little Dotty sat straight and staring, speechless and unanswering,\n quite beyond their reach, like a telephone off the hook and with the\n connection open, but no voice from the other end.\n \n They had just switched off the TV after listening to a confused\n medley of denials, prayers, Kometevskyite chatterings, and a few\n astonishingly realistic comments on the possibility of survival.\n \n These last pointed out that, on the side of the Earth opposite the\n Pacific, the convulsions would come slowly when the entombed spaceship\n burst forth—provided, as seemed the case, that it moved without jets\n or reaction.\n \n It would be as if the Earth's vast core simply vanished. Gravity would\n diminish abruptly to a fraction of its former value. The empty envelope\n of rock and water and air would slowly fall together, though at the\n same time the air would begin to escape from the debris because there\n would no longer be the mass required to hold it.\n \n However, there might be definite chances of temporary and even\n prolonged survival for individuals in strong, hermetically sealed\n structures, such as submarines and spaceships. The few spaceships on\n Earth were reported to have blasted off, or be preparing to leave, with\n as many passengers as could be carried.\n \n But most persons, apparently, could not contemplate action of any sort.\n They could only sit and think, like the Wolvers.\n \n A faint smile relaxed Celeste's face. She was thinking, how beautiful!\n It means the death of the Solar System, which is a horrifying\n subjective concept. Objectively, though, it would be a more awesome\n sight than any human being has ever seen or ever could see. It's an\n absurd and even brutal thing to wish—but I wish I could see the whole\n cataclysm from beginning to end. It would make death seem very small, a\n tiny personal event.\n \n \n Dotty's face was losing its blank expression, becoming intent and\n alarmed.\n \n \"We are in contact with our pursuers,\" she said in the\n familiar-unfamiliar voice. \"Negotiations are now going on. There\n seems to be—there is a change in them. Where they were harsh and\n vindictive before, they now are gentle and conciliatory.\" She paused,\n the alarm on her childish features pinching into anxious uncertainty.\n\"Our pursuers have always been shrewd. The change in them may be false,\n intended merely to lull us into allowing them to come close enough to\n destroy us. We must not fall into the trap by growing hopeful....\"\n \n They leaned forward, clutching hands, watching the little face as\n though it were a television screen. Celeste had the wild feeling that\n she was listening to a communique from a war so unthinkably vast and\n violent, between opponents so astronomically huge and nearly immortal,\n that she felt like no more than a reasoning ameba ... and then realized\n with an explosive urge to laugh that that was exactly the situation.\n \n \"No!\" said Dotty. Her eyes began to glow. \"They have changed! During\n the eons in which we lay sealed away and hidden from them, knowing\n nothing of them, they have rebelled against the tyranny of a communal\n mind to which no thoughts are private ... the tyranny that we ourselves\n fled to escape. They come not to destroy us, but to welcome us back to\n a society that we and they can make truly great!\"\n \n \n\n \n Frieda collapsed to a chair, trembling between laughter and hysterical\n weeping. Theodor looked as blank as Dotty had while waiting for words\n to speak. Edmund sprang to the picture window, Celeste toward the TV\n set.\n \n Climbing shakily out of the chair, Frieda stumbled to the picture\n window and peered out beside Edmund. She saw lights bobbing along the\n paths with a wild excitement.\n \n On the TV screen, Celeste watched two brightly lit ships spinning in\n the sky—whether human spaceships or Phobos and Deimos come to help\n Earth rejoice, she couldn't tell.\n \n Dotty spoke again, the joy in her strange voice forcing them to turn.\n\"And you, dear children, creatures of our camouflage, we welcome\n you—whatever your future career on these planets or like ones—into\n the society of enlightened worlds! You need not feel small and alone\n and helpless ever again, for we shall always be with you!\"\n \n The outer door opened. Ivan and Rosalind reeled in, drunkenly smiling,\n arm in arm.\n \n \"Like rockets,\" Rosalind blurted happily. \"We came through the\n durasphere and solid rock ... shot up right to the surface.\"\n \n \"They didn't have to take us along,\" Ivan added with a bleary grin.\n\"But you know that already, don't you? They're too good to let you live\n in fear, so they must have told you by now.\"\n \n \"Yes, we know,\" said Theodor. \"They must be almost godlike in their\n goodness. I feel ... calm.\"\n \n Edmund nodded soberly. \"Calmer than I ever felt before. It's knowing, I\n suppose, that—well, we're not alone.\"\n \n Dotty blinked and looked around and smiled at them all with a wholly\n little-girl smile.\n \n \"Oh, Mummy,\" she said, and it was impossible to tell whether she spoke\n to Frieda or Rosalind or Celeste, \"I've just had the funniest dream.\"\n \n \"No, darling,\" said Rosalind gently, \"it's we who had the dream. We've\n just awakened.\"",
      "metadata": {
        "title": "Dr. Kometevsky's Day",
        "author": "Fritz Leiber",
        "passage_id": "51353",
        "uid": "e96d09e2d41346ffa47c47aa8a7253c3",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "113",
                "uid": "a732a21f8fa248639214e816e1eb10f1",
                "response_text": "The story is set in the future where Mars’ two moons Phobos and Deimos unexpectedly vanished, space travel exists, and monogamous marriages are lawful. Celeste Wolver talks to her friend Madge Carnap, who claims that the old book The Dance of The Planets predicted the moons’ disappearance. Wolver’s husband, one of the three ones she has, Theodor tries to explain that the book predicts only some events, but he and Celeste soon understand they don’t have strong arguments. Then Celeste and Theodor leave for a meeting regarding the recent events. While walking there, she shares her worries with him. Theodor says ESPs around the world have similar dreams. So, Rosalind, one of his wives, will bring their daughter Dotty to the meeting. Celeste, Rosalind, Frieda, Theodor, and Edmund were waiting only for the third husband, Ivan. Rosalind leaves to look for him, and the others start the meeting. They listen to recent news recordings: Mars’ moons disappeared; Kometevskyites - people that believe in the theory of The Dance of The Planets - demand some government's action. The news anchorman declares that Jupiter’s fourteen moons are not visible anymore. Rosalind comes back and says she only found Ivan’s briefcase covered in mud, with the phrase \"Going down” hastily written on it. They alert local agencies and talk about the project - Deep Shaft - Ivan was studying. The family splits up for a thirty-minute break, and Rosalind goes to where she found the briefcase. There the woman soon starts sinking into the ground. Rosalind realizes what happened to Ivan and leaves a glove pointing down as a sign; soon, her body is underground, and she keeps moving down mud and soil. Theodor, who went to the bar for the break, meets a colonel who tells him that there is a war between good and evil, and the planets are battleships controlled by divine power. The stories of these characters get interrupted by small extracts from Dotty’s dreams, where she calls herself a god, and says she and her friends have been found by their enemies and need to flee. Dotty wakes up and tells Celeste she is a god. Celeste goes back to everybody, and Edmund lists all the known facts. He says Deep Shaft found a metallic durasphere inside the Earth and proposes that other moons had it too. Ivan and Rosalind are drawn into the depth of the Earth, and in their dreams, all ESPs say they will leave in some great boats. Everybody understands that their planet is a camouflaged spaceship. Suddenly, Dotty says in an unfamiliar voice that their assumption is correct. The creature uses Dotty to tell them people were part of the camouflage they needed to hide from the enemies who don’t support mental privacy. Now they have to leave and can take only a few people. Suddenly, the creature says that their enemies changed, and now they don’t need to hide or destroy the planet. Rosalind and Ivan return.\n"
              },
              {
                "worker_id": "111",
                "uid": "110ded6512c94b9c85b1fdc4f4f32054",
                "response_text": "The story follows a group of people that are engaged in a polyamorous marriage. They are 3 men and 3 women, who share a child. The story follows how they are reacting to astronomical phenomena. After Phobos and Demios, two of Mar's moons, disappear, Theodore and Celeste meet with another girl that says that everything that is happening was predicted by Dr. Kometevsky, and it was written in a book called “The Dance of the Planets”. When the six of them want to meet, they realize that one of them was missing, and the only thing that was left was his briefcase, with the message: Going Down. During this meeting, their little girl was having dreams in which she dreamed about a separate species. After one of them goes to a bar, the group learn that Earth was in fact created by a separate species that were being hunted, and that within Earth there is a spherical ship where the species reside. The species can communicate with humans that have Extra-Sensory Perception, and their child is one of them. Through their child, the group learn that the species’ hunters found them, and that they have to leave soon. The story ends with the group learning that the species wants to take the humans with them, and they accept that the species wants to help them. "
              },
              {
                "worker_id": "112",
                "uid": "8cb80c750e4c47c88c00c5cdaa54ee5f",
                "response_text": "Madge Carnap shows a book, The Dance of the Planets, which looks old and terrifies Celeste Wolver. Celeste’s husband, Theodor, argues with Madge about the disappearance of Mars’ two moons, Phobos and Deimos. Madge believes the book author’s prediction, Dr. Kometevsky, that the Earth will take a leap in space, but Theodor and Celeste don’t believe her. They separate from each other, Madge goes to a meeting in a Buddist temple, and Theodor and Celeste go to a sub-committee of the Congress for the Discovery of New Purposes to investigate the materials about the phenomenon. Theodor and Celeste talk about the possible omen and their family situation on their way. Theodor also mentions that many people with Extra-Sensory Perception have been dreaming similarly. \n\nWhen Celeste and Theodor go into the committee room, Edmund, one of the husbands, suggests the family to start examining the microfilms without waiting for Ivan, the third husband of the family. Rosalind goes out to check for Ivan. Other people take the projectors out of their suitcases and check the microfilms while Celeste turns on the TV. They start to focus on the audio, which talks about the discovery of the debris of the moons in their original positions and Dr. Kometevsky’s call. When Rosalind returns with Ivan’s suitcase, she doesn’t hear the news that Jupiter’s fourteen moons have become invisible on the TV. They examine the briefcase, finding it eerily muddy with two letters. When they take a break from the examination, Theodor and Rosalind go out to drink. Rosalind is dragged underground to the core of Earth while trying to catch up with Theodor. Meanwhile, Theodor meets Colonel Fortescue in the Deep Space Bar, who tells him that God is a military strategist and the whole phenomenon is the war between the forces of good and evil when listening to the news about the movements of Jupiter’s moons and the unknown bodies in the space. Celeste watches Dotty in sleep. Edmund gathers everyone and starts to explain his discovery from all materials, including the metallic durashpere found in the center of Earth underground, the relation between the moons’ debris and the durashpere of them, Ivan’s and Rosalind’s disappearances, and the godlike creatures in ESPs dreams. After his explanation, the godlike creature communicates with them through Dotty’s body, explaining that Earth is their battleship, and that humans are their camouflage to escape from the pursuers. The pursuers have detected them, so Earth must be destroyed to let them grab the chance to flee. Only a small portion of humans will be saved to serve as the seed of the human race, such as Ivan and Rosalind. While the Wolver family is shocked by the truth, the godlike creatures negotiate with their pursuers. After a while, the godlike creature tells them that they are safe and will be brought to their place as the pursuers have changed to be good. In the end, Rosalind and Ivan are sent to the house, and the family gathers together.\n"
              },
              {
                "worker_id": "107",
                "uid": "99cc52b836ef474489a590e90f79da92",
                "response_text": "Celeste Wolver is listening to her friend Madge Carnap hold a book called The Dance of Planets from the Twentieth Century. Her husband Theordor tries to argue that Kometevsky predicted the reshuffling of planets in a vague way, but Maggie Madge that it is undeniable Phobos and Deimos have disappeared. The story cuts to Celeste staring at a landscape, as Madge comes up to talk to her more about Dr. Kometevsky. Theodor says that the Mars Base would have noticed something, but Madge says that they are smaller than asteroids. Once she leaves, Celeste talks about how this feels like a warning for disaster in terms of complete security. She does not feel at rest because she has three husbands, and Theodor says that they are still family. Theodor talks about presenting evidence of dreams in ESPs at the meeting. The scene cuts to Dotty dreaming about being a God with god-like friends, and there are other gods out to stop them. Celeste and Theodor enter the committee room. Edmund is impatient to start without Ivan, but Rosalind says that she will go check on him. Celeste gets a newscast going, and everyone listens to the news about finding remnants of the two missing moons. There is also news about Kometevskyites staging helicopter processions to prepare for Earth’s leap through space. Rosalind suddenly walks in and shows everybody the microfilms that Ivan has used to handle. Dotty dreams again that the other gods are combing the whole universe to find them. Edmund says that they have done everything they can with finding Ivan, and he offers to take over the notes about the Deep Shaft. Dotty once again dreams about the other gods fearing that the escaped ones have found a door going out of the Universe. As Rosalind and Theodor step out, Celeste goes to see Dotty. As Rosalind goes to investigate Ivan’s briefcase, she notices that something is holding her feet ankle-deep in the path. Rosalind disappears too, as the bartender at the Deep Space Bar makes drinks for Theodor and Edmund. Colonel Fortescue believes that this is a war between good and evil. The scene then cuts to Celeste observing Dotty, as she says she is a god. Dotty asks if Celeste loves her, and she says that she does. Edmund calls everyone back together, piecing together the four clues to come to the conclusion that planets are a camouflaged fleet of gigantic spaceships. Dotty then comes, speaking with the voice of the god as it says that they will be escaping from the pursuers and destroying the planets because they have been found. As everybody contemplates what to do, the voice from Dotty suddenly says that their enemies have changed. They are no longer seeking to destroy them and that the planets are free because there is no need for them to be destroyed. Everybody feels much calmer, and Dotty says that she just had the funniest dream. "
              }
            ]
          },
          {
            "question_text": "What is the significance of the principle of mental privacy?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "113",
                "uid": "a732a21f8fa248639214e816e1eb10f1",
                "response_text": "The incredibly old semi-god creatures escaped the tyranny of a communal mind to which no thoughts were private. These creatures believe in the principle of mental privacy, and that’s why they escaped and planted seeds of life on planets, including the Earth, as part of their camouflage. Humanity exists as a result of these actions, and it also may shrink in numbers since the creatures have been found by their pursuers and are ready to leave again, thus destroying the planet. The belief in this principle also allowed the enemies of these creatures to rebel against the communal mind and welcome them back to the society of enlightened worlds and let humans live. "
              },
              {
                "worker_id": "111",
                "uid": "110ded6512c94b9c85b1fdc4f4f32054",
                "response_text": "Mental privacy is one of the reasons that the species was being hunted. It is said in the story that the species was hunted because they wanted to maintain a degree of mental privacy that the hunters didn’t agree with. The species isn’t willing to compromise with the hunters, as they firmly believe in their mental privacy. At the end it is revealed that the hunters have in fact separated from a hive mind that they had, and that they are now looking for their own mental privacy. Because of this reason, they want to welcome them back into their society without any violence. "
              },
              {
                "worker_id": "112",
                "uid": "8cb80c750e4c47c88c00c5cdaa54ee5f",
                "response_text": "There are superior, godlike creatures living in the core of Earth. Earth and other planets are the superior creatures’ battleships, and humans living on the Earth are their camouflage to escape from the search of their pursuers. The whole race of these superior creatures was under the tyranny of the communal mind that no private thoughts exist, which is why they escaped from it because they devoted themselves to the principle of mental privacy, which they believed is the greatest good in the Universe. Moreover, they have been hiding successfully under the camouflage of humans because the rule of the race is to never interfere with any life forms’ developments, which makes the pursuers reluctant to examine Earth closely for not to interfere with humans living on it. In short, the principle of mental privacy is significant in the story as it is the leading cause for the superior creature to escape from their pursuers and plant life on Earth, their battleship. Therefore, the story cannot develop without the principle."
              },
              {
                "worker_id": "107",
                "uid": "99cc52b836ef474489a590e90f79da92",
                "response_text": "The principle of mental privacy is significant because it is what the group of godlike and telepathic beings have tried to maintain to the point of separating themselves from their race. It is also the reason why the beings must create great boats and ships to flee in, camouflaging themselves in order to throw off the enemy pursuers. Mental privacy is also important because it allows people’s thoughts to remain their own without any other disturbances or possibly being forcefully shared. The godlike beings call it the greatest good in the universe because it is what they have stood for all their lives. It is also significant because without mental privacy, the godlike beings could control more things easily and become an even greater threat. "
              }
            ]
          },
          {
            "question_text": "Who’s Rosalind and what happens to her throughout the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "113",
                "uid": "a732a21f8fa248639214e816e1eb10f1",
                "response_text": "Rosalind is a member of the Wolves family, the wife of Theodor, Edmund, and Ivan. At the beginning of the story, she comes to the meeting of their family sub-committee. When Ivan doesn’t show up, Rosalind decides to go to the Deep Space Bar and try to find him. On her way back, she finds his briefcase half-buried in the dirt. It has a hastily written phrase “Going down” written on it. Shocked, she comes back and shows her findings to everybody. They alert the local agencies and create their family member’s description that is broadcast. They decide to take a small break, and Rosalind leaves right after Theodor. She doesn’t catch up with him and stops at the place where she found the briefcase. Suddenly, her feet get stuck, and her body starts sinking into the ground. She understands that the same thing happened to Ivan and decides to leave her glove to show what happened to her. Soon earth covers her head, and she keeps moving down through different soil levels. The temperature rises, and soon she ends up in a silver egg-shaped room where she meets Ivan. A voice inside their heads explains that their bodies will soon go through a painless process of separation into small atom-thick layers which will enable them to endure almost infinite accelerations, and their consciousness will be intact. They learn more about the Earth and its function. Soon, when the pursuers of the semi-god creatures tell them about the changes they made, Rosalind and Ivan are shot back to the surface. They walk back to their family.\n\n\n"
              },
              {
                "worker_id": "111",
                "uid": "110ded6512c94b9c85b1fdc4f4f32054",
                "response_text": "Rosalind is one of the women who is a part of the Wolver family. She has 3 husbands and shares them with 3 other women. Rosalind is also the nurse of Dotty, the little girl who they all raise together. After they meet for a while, the group decides to have a break. During this break, Rosalind decides to search for more clues about the disappearance of their 6th member. Doing this, she gets sucked down into the Earth. She manages to leave her glove in the dirt facing down, which allows the group to understand what happened to her. At the end she and Ivan come back, and it is revealed that they went into the ship of the other species. "
              },
              {
                "worker_id": "112",
                "uid": "8cb80c750e4c47c88c00c5cdaa54ee5f",
                "response_text": "Rosalind is the wife of Theodor, Ivan, and Edmund. She takes care of Dotty when Dotty is sleeping. She sets the mike so that Frieda, Dotty’s biological mother, can know when Dotty calls. Then, she checks when Ivan will come to the committee room when Edmund suggests starting the meeting without him. She comes back to the committee room with Ivan’s briefcase, finding it weirdly muddy with “Going Down”. When Theodor goes out to grab a drink, Rosalind follows him and ends up being dragged underground to the interior of Earth, leaving one of her gloves on the ground pointing downward. In the core of Earth, the godlike creatures’ battleship, she learns that she will be disintegrated into particles to store while staying alive. After the godlike creatures’ negotiation with their pursuers comes to a peaceful conclusion, Rosalind is sent to the house with her family."
              },
              {
                "worker_id": "107",
                "uid": "99cc52b836ef474489a590e90f79da92",
                "response_text": "Rosalind Wolver is one of the wives alongside Celeste and Frieda. Although she is not the mother of Dotty, she is noted to be the nurse of the little girl. She is described as a glitter of platinum against the darkness. When everyone is concerned as to why Ivan has not yet shown up to the meeting, Rosalind offers to go check on him. She later comes back, pale as a ghost, to show everybody what she has found from what remains of Ivan’s disappearance. After, Rosalind leaves with Theodor, but she goes back to the area where Ivan’s briefcase was. Although she tries to investigate further, something grabs at her feet and pulls her in. Rosalind feels the light of the path stay with her as she feels it grow hotter and hotter. Later, her and Ivan are sitting in an egg-shaped silver room that has no entrance or exit. A voice tells them that their bodies will be separated into layers one atom thick to be stored. However, this is a painless process and their consciousness will remain. Once the planets are no longer being destroyed, she comes back with Ivan through the outer door. Rosalind explains the experience as riding a rocket, and she is last telling Dotty that they have been dreaming instead of her. "
              }
            ]
          },
          {
            "question_text": "What’s the significance of Dotty’s dreams?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "113",
                "uid": "a732a21f8fa248639214e816e1eb10f1",
                "response_text": "Throughout the entire story, the narrative gets interrupted by small parts of Dotty's dreams. She has extrasensory abilities, and the semi-god creatures use her and other ESPs to communicate with people. In her dreams, she tells the story of these creatures' life. She speaks about their belief in mental privacy and says that other gods do not want them to have private thoughts and decide to hunt them down. The creatures that value privacy of thoughts create inhabited planets and manage to hide for millions of years from the others. But now they have been found and need to flee again. Dotty’s dreams conceptually explain the origin of the planets of the Solar System and why those need to be destroyed now. Through her dreams, the creatures tell the Earth is their camouflaged spaceship, and they will soon need to live. \n"
              },
              {
                "worker_id": "111",
                "uid": "110ded6512c94b9c85b1fdc4f4f32054",
                "response_text": "Dotty is one of the humans with Extra-Sensory Perception, which allows her to be a gateway of communication between the species that live within Earth and humans. A side effect of this is that she dreams a lot from the perspective of the other species. Her dreams are a reflection of what the species is feeling and what they are thinking with respect to their hunters. Dotty could understand that the species was being hunted, and could understand what they were thinking. At the end, Dotty wakes up and tells the family that she was dreaming."
              },
              {
                "worker_id": "112",
                "uid": "8cb80c750e4c47c88c00c5cdaa54ee5f",
                "response_text": "Dotty is Frieda’s daughter who has extra-sensory perception. Dotty’s dream shows how the godlike creatures who live on Earth, their boat, escape from their pursuers and use life as camouflage to escape from the search. Her dream also shows what the godlike creatures think. In her dream, the godlike creatures express their desire for mental privacy that is not allowed by their other fellows. The godlike creatures leave their fellows, who are scared by them because of the unknown of their secret thoughts. When they used all their ways to get out of the universe, they had no choice but to hide under the camouflage disguised with life, and they succeeded. Dotty’s dream is significant because it shows how and why the godlike creatures fled from their point of view. It also indicates Dotty’s compatibility with the godlike creatures to allow them to talk with her family through her body."
              },
              {
                "worker_id": "107",
                "uid": "99cc52b836ef474489a590e90f79da92",
                "response_text": "Dotty’s dreams are significant because they tell the life of the god-like beings who have separated themselves from the rest of the group. Dotty’s dreams give insight to how the god-like beings came about, and how the start of the conflict between them and the rest of their race started. The dreams also reveal how the group managed to escape, creating great ships and camouflaging themselves so that their pursuers will not be able to catch up to them. Later, Dotty’s dreams also allow her to be controlled by one of the voices so that she is able to tell the rest of the Wolvers what will happen to the world and them because the pursuers have discovered where the rogue god-like group has been hiding. Dotty’s dreams also allow her to serve as a messenger between the two parties and inform them of what is happening in regards to the current situation. "
              }
            ]
          },
          {
            "question_text": "What is Celeste's attitude towards other members of her family and how does it change?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "113",
                "uid": "a732a21f8fa248639214e816e1eb10f1",
                "response_text": "From the beginning, Celeste seems to struggle with her complex marriage. She finds it hard to find complete security in three men simultaneously. In a crisis, it’s disturbing for her to have her source of security divided into three. She also cannot accept that Dotty is her daughter because the girl was born from Frieda. Celeste points out that the probability of Dotty being Theodor’s daughter is only one-third. She reckons that humanity might have gone too far with some things, including monogamous marriages. While in the committee room, she tries to determine if they are a true family or just experimenting with their relationship. The family members seem both familiar and unfamiliar to her. When she wants to check up on Dotty, she thinks that she is no one to the girl but still goes on. Dotty, after a small chat, makes Celeste say that she loves her. In the end, the reader understands that, no matter what Celeste’s feelings are, Dotty loves all three women and considers them mothers. "
              },
              {
                "worker_id": "111",
                "uid": "110ded6512c94b9c85b1fdc4f4f32054",
                "response_text": "Celeste seems to not be too happy with her marital situation. At the beginning, she tells one of her husbands that she doesn’t like that her happiness lies divided with 3 people, her husbands. She is also jealous that she is the one that has the least connection with their child, as the other women are the biological mother and the nurse of the little girl. Throughout the story, these same feelings are reflected, as Celeste seems to be wary when taking care of Dotty. At the end those feelings seem to take a back seat, as they were more preoccupied with the threat of the other species. "
              },
              {
                "worker_id": "112",
                "uid": "8cb80c750e4c47c88c00c5cdaa54ee5f",
                "response_text": "Celeste shares three husbands, Theodor, Edmund, and Ivan, with the other two women, Rosalind and Frieda. Celeste is uncomfortable with one of her husbands, Theodor, as she talks about her insecurity of facing the unknown catastrophe in the future and having three husbands when she cannot find security from a single whole man who only belongs to her. She also does not see herself as belonging to the family as she separates herself from being the mother of a child, Dotty, born from Frieda’s womb. She feels uneasy and unsecured with the polygamous family as all her husbands share one-third of the chance to be the father or a husband of any child or wife in the family. She also feels distant from her family while knowing all their quirks and habits. When she goes to watch Dotty, she feels bitter and worried. When Dotty asks her whether she is her mother, Celeste smiles with uncertainty, questioning her feeling of separation from the family. After knowing the truth from Dotty’s mouth and experiencing the terror of losing her family, Celeste changes her attitude and feels belonging to her family."
              },
              {
                "worker_id": "107",
                "uid": "99cc52b836ef474489a590e90f79da92",
                "response_text": "Celeste is initially wary about having three husbands. She is aware that as a woman, she needs to find complete security. The complex marriages are stressful because each of her husbands only have one third of a security. She also does not regard Dotty too fondly, claiming that she is just Frieda’s daughter. Although Celeste is quite casual when Theodor kisses the other two wives, she begins to think later whether or not they are actually family. She wonders if they are truly a united group or just a bunch of silly adolescents playing around with marriage. Later, she does begin to warm up to Dotty after the child asks if she loves her. She says that she loves Dotty, despite the earlier feelings, and even tries to call out to her later. Although Celeste does not explicitly admit it, she does begin to grow closer and secure with the other family members. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 6755,
        "document_length_chars": 40235
      }
    }
  ]
}