{
  "item_metadata": {
    "item_id": "51351",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51351",
      "content": "THE SPICY SOUND OF SUCCESS\n \n \n By JIM HARMON\n \n Illustrated by DICK FRANCIS\n \n [Transcriber's Note: This etext was produced from Galaxy Magazine August 1959. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n Now was the captain's chance to prove he knew less than the crew—all their lives hung upon it!\n \n\n \n There was nothing showing on the video screen. That was why we were looking at it so analytically.\n \n \"Transphasia, that's what it is,\" Ordinary Spaceman Quade stated with a definite thrust of his angular jaw in my direction. \"You can take my word on that, Captain Gavin.\"\n \n \"Can't,\" I told him. \"I can't trust your opinion. I can't trust anything . That's why I'm Captain.\"\n \n \"You'll get over feeling like that.\"\n \n \"I know. Then I'll become First Officer.\"\n \n \"But look at that screen, sir,\" Quade said with an emphatic swing of his scarred arm. \"I've seen blank scanning like that before and you haven't—it's your first trip. This always means transphasia—cortex dissolution, motor area feedback, the Aitchell Effect—call it anything you like, it's still transphasia.\"\n \n \"I know what transphasia is,\" I said moderately. \"It means an electrogravitational disturbance of incoming sense data, rechanneling it to the wrong receptive areas. Besides the human brain, it also effects electronic equipment, like radar and television.\"\n \n \"Obviously.\" Quade glanced disgustedly at the screen.\n \n \"Too obvious. This time it might not be a familiar condition of many planetary gravitational fields. On this planet, that blank kinescope may mean our Big Brother kites were knocked down by hostile natives.\"\n \n \"You are plain wrong, Captain. Traditionally, alien races never interfere with our explorations. Generally, they are so alien to us they can't even recognize our existence.\"\n \n \n\n \n I drew myself up to my full height—and noticed in irritation it was still an inch less than Quade's. \"I don't understand you men. Look at yourself, Quade. You've been busted to Ordinary Spaceman for just that kind of thinking, for relying on tradition, on things that have worked before. Not only your thinking is slipshod, you've grown careless about everything else, even your own life.\"\n \n \"Just a minute, Captain. I've never been 'busted.' In the Exploration Service, we regard Ordinary Spaceman as our highest rank. With my hazard pay, I get more hard cash than you do, and I'm closer to retirement.\"\n \n \"That's a shallow excuse for complacency.\"\n \n \"Complacency! I've seen ten thousand wonders in twenty years of space, with a million variations. But the patterns repeat themselves. We learn to know what to expect, so maybe we can't maintain the reactionary caution the service likes in officers.\"\n \n \"I resent the word 'reactionary,' Spaceman! In civilian life, I was a lapidary and I learned the value of deliberation. But I never got too cataleptic to tap a million-dollar gem, which is more than my contemporaries can say, many of 'em.\"\n \n \"Captain Gavin,\" Quade said patiently, \"you must realize that an outsider like you, among a crew of skilled spacemen, can never be more than a figurehead.\"\n \n Was this the way I was to be treated? Why, this man had deliberately insulted me, his captain. I controlled myself, remembering the familiarity that had always existed between members of a crew working under close conditions, from the time of the ancient submarines and the first orbital ships.\n \n \"Quade,\" I said, \"there's only one way for us to find out which of us is right about the cause of our scanning blackout.\"\n \n \"We go out and find the reason.\"\n \n \"Exactly. We go. You and me. I hope you can stand my company.\"\n \n \"I'm not sure I can,\" he answered reluctantly. \"My hazard pay doesn't cover exploring with rookies. With all due respect, Captain.\"\n \n I clapped him on the shoulder. \"But, man, you have just been telling me all we had to worry about was common transphasia. A man with your experience could protect himself and cover even a rookie, under such familiar conditions—right?\"\n \n \"Yes, sir, I suppose I could,\" Quade said, bitterly aware he had lost out somewhere and hoping that it wasn't the start of a trend.\n \n \n\n \n \"Looks okay to me,\" I said. Quade passed a gauntlet over his faceplate.\n\"It's real. I can blur it with a smudged visor. When it blurs, it's solid.\"\n \n The landscape beyond the black corona left by our landing rockets was unimpressive. The rocky desert was made up of silicon and iron oxide, so it looked much the same as a terrestrial location. Yellowish-white sand ran up to and around reddish brown rock clawing into the pink sunlight.\n \n \"I don't understand it,\" Quade admitted. \"Transphasia hits you a foul as soon as you let it into the airlock.\"\n \n \"Apparently, Quade, this thing is going to creep up on us.\"\n \n \"Don't sound smug, Captain. It's pitty-pattying behind you too.\"\n \n The keening call across the surface of consciousness postponed my reply.\n \n The wail was ominously forlorn, defiant of description. I turned my head around slowly inside my helmet, not even sure that I had heard it.\n \n But what else can you do with a wail but hear it?\n \n Quade nodded. \"I've felt this before. It usually hits sooner. Let's trace it.\"\n \n \"I don't like this,\" I admitted. \"It's not at all what I expected from what you said about transphasia. It must be something else.\"\n \n \"It couldn't be anything else. I know what to expect. You don't. You may begin smelling sensations, tasting sounds, hearing sights, seeing tastes, touching odors—or any other combination. Don't let it bother you.\"\n \n \"Of course not. I'll soothe my nerves by counting little shocks of lanolin jumping over a loud fence.\"\n \n Quade grinned behind his faceplate. \"Good idea.\"\n \n \"Then you can have it. I'm going to try keeping my eyes open and staying alive.\"\n \n There was no reply.\n \n His expression was tart and greasy despite all his light talk, and I knew mine was the same. I tested the security rope between our pressure suits. It was a taut and virile bass.\n \n We scaled a staccato of rocks, our suits grinding pepper against our hides.\n \n The musk summit rose before us, a minor-key horizon with a shifting treble for as far as I could smell. It was primitive beauty that made you feel shocking pink inside. The most beautiful vista I had ever tasted, it couldn't be dulled even by the sensation of beef broth under my skin.\n \n \"Is this transphasia?\" I asked in awe.\n \n \"It always has been before,\" Quade remarked. \"Ready to swallow your words about this being something an old hand wouldn't recognize, Captain?\"\n \n \"I'm swallowing no words until I find out precisely how they taste here.\"\n \n \"Not a bad taste. They're pretty. Or haven't you noticed?\"\n \n \"Quade, you're right! About the colors anyway. This reminds me of an illiscope recording from a cybernetic translator.\"\n \n \"It should. I don't suppose we could understand each other if it wasn't for our morphistudy courses in reading cross-sense translations of Centauri blushtalk and the like.\"\n \n It became difficult to understand him, difficult to try talking in the face of such splendor. You never really appreciate colors until you smell them for the first time.\n \n \n\n \n Quade was as conversational as ever, though. \"I can't see irregularities occurring in a gravitational field. We must have compensated for the transphasia while we still had a point of reference, the solid reality of the spaceship. But out here, where all we have to hang onto is each other, our concept of reality goes bang and deflates to a tired joke.\"\n \n Before I could agree with one of his theories for once, a streak of spice shot past us. It bounced back tangily and made a bitter rip between the two of us. There was no time to judge its size, if it had size, or its decibel range, or its caloric count, before a small, sharp pain dug in and dwindled down to nothing in one long second.\n \n The new odor pattern in my head told me Quade was saying something I couldn't quite make out.\n \n Quade then pulled me in the direction of the nasty little pain.\n \n \"Wait a minute, Spaceman!\" I bellowed. \"Where the devil do you think you're dragging me? Halt! That's a direct order.\"\n \n He stopped. \"Don't you want to find out what that was? This is an exploration party, you know, sir.\"\n \n \"I'm not sure I do want to find out what that was just now. I didn't like the feel of it. But the important thing is for us not to get any further from the ship.\"\n \n \"That's important, Captain?\"\n \n \"To the best of my judgment, yes. This—condition—didn't begin until we got so far away from the spacer—in time or distance. I don't want it to get any worse. It's troublesome not to know black from white, but it would be a downright inconvenience not to know which way is up.\"\n \n \"Not for an experienced spaceman,\" Quade griped. \"I'm used to free-fall.\"\n \n But he turned back.\n \n \"Just a minute,\" I said. \"There was something strange up ahead. I want to see if short-range radar can get through our electrogravitational jamming here.\"\n \n I took a sighting. My helmet set projected the pattern on the cornea. Sweetness building up to a stab of pure salt—those were the blips.\n \n Beside me, there was a thin thread of violet. Quade had whistled. He was reading the map too.\n \n The slope fell away sharply in front of us, becoming a deep gorge. There was something broken and twisted at the bottom, something we had known for an instant as a streak of spice.\n \n \"There's one free-fall,\" I said, \"where you wouldn't live long enough to get used to it.\"\n \n He said nothing on the route back to the spacer.\n \n \n\n \n \"I know all about this sort of thing, Gav,\" First Officer Nagurski said expansively. He was rubbing the well-worn ears of our beagle mascot, Bruce. A heavy tail thudded on the steel deck from time to time.\n \n My finger could barely get in the chafing band of my regulation collar. I was hot and tired, fresh—in only the chronological sense—from a pressure suit.\n \n \"What do you know all about, Nagurski? Dogs? Spacemen? Women? Transphasia?\"\n \n \"Yes,\" he answered casually. \"But I had immediate reference to our current psychophysiological phenomenon.\"\n \n I collapsed into the swivel in front of the chart table. \"First off, let's hear what you know about—never mind, make it dogs.\"\n \n \"Take Bruce, for example, then—\"\n \n \"No, thanks. I was wondering why you did.\"\n \n \"I didn't.\" His dark, round face was bland. \"Bruce picked me. Followed me home one night in Chicago Port. The dog or the man who picks his own master is the most content.\"\n \n \"Bruce is content,\" I admitted. \"He couldn't be any more content and still be alive. But I'm not sure that theory works out with men. We'd have anarchy if I tried to let these starbucks pick their own master.\"\n \n \" I had no trouble when I was a captain,\" Nagurski said. \"Ease the reins on the men. Just offer them your advice, your guidance. They will soon see why the service selected you as captain; they will pick you themselves.\"\n \n \"Did your crew voluntarily elect you as their leader?\"\n \n \"Of course they did, Gav. I'm an old hand at controlling crews.\"\n \n \"Then why are you First Officer under me now?\"\n \n He blinked, then decided to laugh. \"I've been in space a good many years. I really wanted to relax a little bit more. Besides, the increase in hazard pay was actually more than my salary as a captain. I'm a notch nearer retirement too.\"\n \n \"Tell me, did you always feel this way about letting the men select their own leader?\"\n \n \n\n \n Nagurski brought out a pipe. He would have a pipe, I decided.\n \n \"No, not always. I was like you at first. Fresh from the cosmic energy test lab, suspicious of everything, trying to tell the old hands what to do. But I learned that they are pretty smart boys; they know what they are doing. You can rely on them absolutely.\"\n \n I leaned forward, elbows on knees. \"Let me tell you a thing, Nagurski. Your trust of these damn-fool spacemen is why you are no longer a captain. You can't trust anything out here in space, much less human nature. Even I know that much!\"\n \n He was pained. \"If you don't trust the men, they won't trust you, Gav.\"\n \n \"They don't have to trust me. All they have to do is obey me or, by Jupiter, get frozen stiff and thawed out just in time for court-marshal back home. Listen,\" I continued earnestly, \"these men aren't going to think of me—of us , the officers, as their leaders. As far as the crew is concerned, Ordinary Spaceman Quade is the best man on this ship.\"\n \n \"He is a good man,\" Nagurski said. \"You mustn't be jealous of his status.\"\n \n The dog growled. He must have sensed what I almost did to Nagurski.\n \n \"Never mind that for now,\" I said wearily. \"What was your idea for getting our exploration parties through this transphasia?\"\n \n \"There's only one idea for that,\" said Quade, ducking his long head and stepping through the connecting hatch. \"With the Captain's permission....\"\n \n \"Go ahead, Quade, tell him,\" Nagurski invited.\n \n \"There's only one way to wade through transphasia with any reliability,\" Quade told me. \"You keep some kind of physical contact with the spaceship. Parties are strung out on guide line, like we were, but the cable has to be run back and made fast to the hull.\"\n \n \"How far can we run it back?\"\n \n Quade shrugged. \"Miles.\"\n \n \"How many?\"\n \n \"We have three miles of cable. As long as you can feel, taste, see, smell or hear that rope anchoring you to home, you aren't lost.\"\n \n \"Three miles isn't good enough. We don't have enough fuel to change sites that often. You can't use the drive in a gravitational field, you know.\"\n \n \"What else can we do, Captain?\" Nagurski asked puzzledly.\n \n \"You've said that the spaceship is our only protection from transphasia. Is that it?\"\n \n Quade gave a curt nod.\n \n \"Then,\" I told them, \"we will have to start tearing apart this ship.\"\n \n \n\n \n Sergeant-Major Hoffman and his team were doing a good job of ripping out the side of the afterhold. Through the portal I could see the suited men expertly guiding the huge curved sections on their ray projectors.\n \n \"Cannibalizing is dangerous.\" Nagurski put his pipe in his teeth and shook his head disapprovingly.\n \n \"Spaceships have parts as interchangeable as Erector sets. We can take apart the tractors and put our ship back together again after we complete the survey.\"\n \n \"You can't assemble a jigsaw puzzle if some of the pieces are missing.\"\n \n \"You can't get a complete picture, but you can get a good idea of what it looks like. We can take off in a reasonable facsimile of a spaceship.\"\n \n \"Not,\" he persisted, \"if too many parts are missing.\"\n \n \"Nagurski, if you are looking for a job safer than space exploration, why don't you go back to testing cosmic bomb shelters?\"\n \n Nagurski flushed. \"Look here, Captain, you are being too damned cautious. There is a way one handles the survey of a planet like this, and this isn't the way.\"\n \n \"It's my way. You heard what Quade said. You know it yourself. The men have to have something tangible to hang onto out there. One slender cable isn't enough of an edge on sensory anarchy. If the product of their own technological civilization can keep them sane, I say let 'em take a part of that environment with them.\"\n \n \"In departing from standard procedure that we have learned to trust, you are risking more than a few men—you risk the whole mission in gambling so much of the ship. A captain doesn't take chances like that!\"\n \n \"I never said I wouldn't take chances. But I'm not going to take stupid chances. I might be doing the wrong thing, but I can see you would be doing it wrong.\"\n \n \"You know nothing about space, Captain! You have to trust us .\"\n \n \"That's it exactly, First Officer Nagurski,\" I said sociably. \"If you lazy, lax, complacent slobs want to do something in a particular way, I know it has to be wrong.\"\n \n I turned and found Wallace, the personnel man, standing in the hatchway.\n \n \"Pardon, Captain, but would you say we also lacked initiative?\"\n \n \"I would,\" I answered levelly.\n \n \"Then you'll be interested to hear that Spaceman Quade took a suit and a cartographer unit. He's out there somewhere, alone.\"\n \n \"The idiot!\" I yelped. \"Everyone needs a partner out there. Send out a team to follow his cable and drag him in here by it.\"\n \n \"He didn't hook on a cable, Captain,\" Wallace said. \"I suppose he intended to go beyond the three-mile limit as you demanded.\"\n \n \"Shut up, Wallace. You don't have to like me, but you can't twist what I said as long as I command this spacer.\"\n \n \"Cool off, Gav,\" Nagurski advised me. \"It's been done before. Anybody else would have been a fool to go out alone, but Quade is the most experienced man we have. He knows transphasia. Trust him.\"\n \n \"I trusted him too far by letting him run around loose. He needs a leash in more ways than one, and I'm going to put one on him.\"\n \n \n\n \n For me, it was a nightmare. I lay down in my cabin and thought. I had to think things through very carefully. One mistake was too many for me. My worst fear had been that someday I would overlook one tiny flaw and ruin a gem. Now I might have ruined an exploration and destroyed a man, not a stone, because I had missed the flaw.\n \n No one but a reckless fool would have gone out alone on a strange planet with a terrifying phenomenon, but I'd had enough evidence to see that space exploration made a man a reckless fool by doing things on one planet he had once found safe and wise on some other world.\n \n The thought intruded itself: why hadn't I recognized this before I let Quade escape to almost certain death? Wasn't it because I wanted him dead, because I resented the crew's resentment of my authority, and recognized in him the leader and symbol of this resentment?\n \n I threw away that idea along with my half-used cigarette. It might very well be true, but how did that help now?\n \n I had to think .\n \n I was going after him, that was certain. Not only for humane reasons—he was the most important member of the crew. With him around, there were only two opinions, his and mine. Without him, I'd have endless opinions to contend with.\n \n But it wouldn't do any good to go out no better equipped than he. There was no time to wait for tractors to be built if we wanted to reach him alive, and we certainly couldn't reach him five or ten miles out with our three miles of safety line. We would have to go in spacesuits.\n \n But how would that leave us any better off than Quade?\n \n Why was Quade vulnerable in his spacesuit, as I knew from experience he would be?\n \n How could we be less vulnerable, or preferably invulnerable?\n \n \n\n \n \"Captain, you got nothing to worry about,\" Quartermaster Farley said. He patted a space helmet paternally. \"You got yourself a self-contained environment. The suit's eye looks into yours at the arteries in the back of your eyeball so it can read your amber corpuscles and feed you your oxygen in the right amounts; you're a bottle-fed baby. If transphasia gets you seeing limburger, turn on the radar and you're air-conditioned as an igloo. Nothing short of a cosmic blast can dent that hide. You got it made.\"\n \n \"You are right,\" I said, \"only transphasia comes right through these air-fast joints.\"\n \n \"Something strange about the trance, Captain,\" Farley said darkly. \"Any spaceman can tell you that. Things we don't understand.\"\n \n \"I'm talking about something we do understand— sound . These suits perfectly soundproof?\"\n \n \"Well, you can pick up sound by conduction. Like putting two helmets together and talking without using radio. You can't insulate enough to block out all sound and still have a man-shaped suit. You have—\"\n \n \"I know. Then you have something like a tractor or a miniature spaceship. There isn't time for that. We will have to live with the sound.\"\n \n \"What do you think he's going to hear out there, Captain? We'd like to find one of those beautiful sirens on some planet, believe me, but—\"\n \n \"I believe you,\" I said quickly. \"Let's leave it at that. I don't know what he will hear; what's worrying me is how he'll hear it, in what sensory medium. I hope the sound doesn't blind him. His radar is his only chance.\"\n \n \"How do you figure on getting a better edge yourself, sir?\"\n \n \"I have the idea, but not the word for it. Tonal compensation, I suppose. If you can't shut out the noise, we'll have to drown it out.\"\n \n Farley nodded. \"Beat like a telephone time signal?\"\n \n \"That would do it.\"\n \n \"It would do something else. It would drive you nuts.\"\n \n \n\n \n I shrugged. \"It might be distracting.\"\n \n \"Captain, take my word for it,\" argued Farley. \"Constant sonic feedback inside a spacesuit will set you rocking against the grain.\"\n \n \"Devise some regular system of interruptions,\" I suggested.\n \n \"Then the pattern will drive you crazy. Maybe in a few months, with luck, I could plan some harmonic scale you could tolerate—\"\n \n \"We don't have a few months,\" I said. \"How about music? There's a harmonic scale for you, and we can endure it, some of it. Figaro and Asleep in the Cradle of the Deep can compensate for high-pitched outside temperatures, and Flight of the Bumble Bee to block bass notes.\"\n \n Farley nodded. \"Might work. I can program the tapes from the library.\"\n \n \"Good. There's one more thing—how are our stores of medicinal liquor?\"\n \n Farley paled. \"Captain, are you implying that I should be running short on alcohol? Where do you get off suggesting a thing like that?\"\n \n \"I'm getting off at the right stop, apparently,\" I sighed. \"Okay, Farley, no evasions. In plain figures, how much drinking alcohol do we have left?\"\n \n The quartermaster slumped a bit. \"Twenty-one liters unbroken. One more about half full.\"\n \n \"Half full? How did that ever happen? I mean you had some left ? We'll take this up later. I want you to run it through the synthesizer to get some light wine....\"\n \n \"Light wine?\" Farley looked in pain. \"Not whiskey, brandy, beer?\"\n \n \"Light wine. Then ration it out to some of the men.\"\n \n \"Ration it to the men!\"\n \n \"That's an accurate interpretation of my orders.\"\n \n \"But, sir,\" Farley protested, \"you don't give alcohol to the crew in the middle of a mission. It's not done. What reason can you have?\"\n \n \"To sharpen their taste and olfactory senses. We can turn up or block out sound. We can use radar to extend our sight, but the Space Service hasn't yet developed anything to make spacemen taste or smell better.\"\n \n \"They are going to smell like a herd of winos,\" Farley said. \"I don't like to think how they would taste.\"\n \n \"It's an entirely practical idea. Tea-tasters used to drink almond-and-barley water to sharpen their senses. I've observed that wine helps you appreciate culinary art more. Considering the mixed-up sensory data under transphasia, wine may help us to see where we are going.\"\n \n \"Yes, sir,\" Farley said obediently. \"I'll give spacemen a few quarts of wine, telling them to use it carefully for scientific purposes only, and then they will be able to see where they are going. Yes, sir.\"\n \n I turned to leave, then paused briefly. \"You can come along, Farley. I'm sure you want to see that we don't waste any of the stuff.\"\n \n \n\n \n \"There they are!\" Nagurski called. \"Quade's footsteps again, just beyond that rocky ridge.\"\n \n The landscape was rich chocolate ice cream smothered with chocolate syrup, caramel, peanuts and maple syrup, eaten while you smoked an old, mellow Havana. The footsteps were faint traces of whipped cream across the dark, rich taste of the planet.\n \n I splashed some wine from my drinking tube against the roof of my mouth to sharpen my taste. It brought out the footsteps sharper. It also made the landscape more of a teen-ager's caloric nightmare.\n \n The four of us pulled ourselves closer together by reeling in more of our safety line. Farley and Hoffman, Nagurski and myself, we were cabled together. It gave us a larger hunk of reality to hold onto. Even so, things wavered for me during a wisp of time.\n \n We stumbled over the ridge, feeling out the territory. It was a sticky job crawling over a melting, chunk-style Hershey bar. I was thankful for the invigorating Sousa march blasting inside my helmet. Before the tape had cut in, kicked on by the decibel gauge, I had heard or felt something dark and ominous in the outside air.\n \n \"Yes, this is definitely the trail of Quail,\" Nagurski said soberly.\n\"This is serious business. I must ask whoever has been giggling on this channel to shut up. Pardon me, Captain. You weren't giggling, sir?\"\n \n \"I have never giggled in my life, Nagurski.\"\n \n \"Yes, sir. That's what we all thought.\"\n \n A moment later, Nagurski added, \"Anyway, I just noticed it was my shelf—my, that is, self.\"\n \n The basso profundo performing Figaro on my headset climbed to a girlish shriek. A sliver of ice. This was the call Quade and I had first heard as we were about to troop over a cliff. I dug in my heels.\n \n \"Take a good look around, boys,\" I said. \"What do you see?\"\n \n \"Quail,\" Nagurski replied. \"That's what I see.\"\n \n \"You,\" I said carefully, \"have been in space a long time. Look again.\"\n \n \"I see our old buddy, Quail.\"\n \n I took another slosh of burgundy and peered up ahead. It was Quade. A man in a spacesuit, faceplate in the dust, two hundred yards ahead.\n \n \n\n \n Grudgingly I stepped forward, out of the shadow of the ridge. A hysterically screaming wind rocked me on my toes. We pushed on sluggishly to Quade's side, moving to the tempo of Pomp and Circumstance .\n \n Farley lugged Quade over on his back and read his gauges.\n \n The Quartermaster rose with grim deliberation, and hiccuped. \"Better get him back to the spaceship fast. I've seen this kind of thing before with transphasia. His body cooled down because of the screaming wind—psychosomatic reaction—and his heating circuits compensated for the cool flesh. The poor devil's got frostbite and heat prostration.\"\n \n \n\n \n The four of us managed to haul Quade back by using the powered joints in our suits. Hoffman suggested that he had once seen an injured man walked back inside his suit like a robot, but it was a delicate adjustment, controlling power circuits from outside a suit. It was too much for us—we were too tired, too numb, too drunk.\n \n At first sight of the spacer in the distance, transphasia left me with only a chocolate-tasting pink after-image on my retina. It was now showing bare skeleton from cannibalization for tractor parts, but it looked good to me, like home.\n \n The wailing call sounded through the amber twilight.\n \n I realized that I was actually hearing it for the first time.\n \n The alien stood between us and the ship. It was a great pot-bellied lizard as tall as a man. Its sound came from a flat, vibrating beaver tail. Others of its kind were coming into view behind it.\n \n \"Stand your ground,\" I warned the others thickly. \"They may be dangerous.\"\n \n Quade sat up on our crisscross litter of arms. \"Aliens can't be hostile. Ethnic impossibility. I'll show you.\"\n \n Quade was delirious and we were drunk. He got away from us and jogged toward the herd.\n \n \"Let's give him a hand!\" Farley shouted. \"We'll take us a specimen!\"\n \n I couldn't stop them. Being in Alpine rope with them, I went along. At the time, it even seemed vaguely like a good idea.\n \n As we lumbered toward them, the aliens fell back in a solid line except for the first curious-looking one. Quade got there ahead of us and made a grab. The creature rose into the air with a screaming vibration of his tail and landed on top of him, flattening him instantly.\n \n \"Sssh, men,\" Nagurski said. \"Leave it to me. I'll surround him.\"\n \n The men followed the First Officer's example, and the rope tying them to him. I went along cheerfully myself, until an enormous rump struck me violently in the face. My leaded boots were driven down into fertile soil, and my helmet was ringing like a bell. I got a jerky picture of the beast jumping up and down on top of the others joyously. Only the stiff space armor was holding up our slack frames.\n \n \"Let's let him escape,\" Hoffman suggested on the audio circuit.\n \n \"I'd like to,\" Nagurski admitted, \"but the other beasts won't let us get past their circle.\"\n \n It was true. The aliens formed a ring around us, and each time a bouncing boy hit the line, he only bounced back on top of us.\n \n \"Flat!\" I yelled. \"Our seams can't take much more of this beating.\"\n \n I followed my own advice and landed in the dirt beside Quade.\n \n The bouncer came to rest and regarded us silently, head on an eighty-degree angle.\n \n I was stone sober.\n \n The others were lying around me quietly, passed out, knocked out, or taking cover.\n \n The ring of aliens drew in about us, closer, tighter, as the bouncer sat on his haunches and waited for us to move.\n \n \n\n \n \"Feeling better?\" I asked Quade in the infirmary.\n \n He punched up his pillow and settled back. \"I guess so. But when I think of all the ways I nearly got myself killed out there.... How far have you got in the tractors?\"\n \n \"I'm having the tractors torn down and the parts put back into the spaceship where they belong. We shouldn't risk losing them and getting stuck here.\"\n \n \"Are you settling for a primary exploration?\"\n \n \"No. I think I had the right idea on your rescue party. You have to meet and fight a planet on its own terms. Fighting confused sounds and tastes with music and wine was crude, but it was on the right track. Out there, we understood language because we were familiar with alien languages changed to other sense mediums by cybernetic translators. Using the translator, we can learn to recognize all confused data as easily. I'm starting indoctrination courses.\"\n \n \"I doubt that that is necessary, sir,\" Quade said. \"Experienced spacemen are experienced with transphasia. You don't have to worry. In the future, I'll be able to resist sensations that tell me I'm freezing to death—if my gauges tell me it's a lie.\"\n \n I examined his bandisprayed hide. \"I think my way of gaining experience is less painful and more efficient.\"\n \n Quade squirmed. \"Yes, sir. One thing, sir—I don't understand how you got me away from those aliens.\"\n \n \"The aliens were trying to help. They knew something was wrong and they were prodding and probing. When the first tractor pulled up and the men got out, they seemed to realize our own people could help us easier than they could.\"\n \n \"I am not quite convinced that those babies just meant to help us all the time.\"\n \n \"But they did! First, that call of theirs—it wasn't to lead us into danger, but to warn us of the cliff, the freezing wind. They saw we were trying to find out things about their world, so they even offered us one of their own kind to study. Unfortunately, he was too much for us. They didn't give us their top man, of course, only the village idiot. It's just as well. We aren't allowed to dissect creatures that far up the intelligence scale.\"\n \n \"But why should they want to help us?\" Quade demanded suspiciously.\n \n \"I think it's like Nagurski's dog. The dog came to him when it wanted somebody to own it, protect it, feed it, love it. These aliens want Earthmen to colonize the planet. We came here, you see, same as the dog came to Nagurski.\"\n \n \"Well, I've learned one thing from all of this,\" Quade said. \"I've been a blind, arrogant, cocksure fool, following courses that were good on some worlds, most worlds, but not good on all worlds. I'm never going to be that foolhardy again.\"\n \n \"But you're losing confidence , Quade! You aren't sure of yourself any more. Isn't confidence a spaceman's most valuable asset?\"\n \n \"The hell it is,\" Quade said grimly. \"It's his deadliest liability.\"\n \n \"In that case, I must inform you that I am demoting you to Acting Executive Officer.\"\n \n \"Huh?\" Quade gawked. \"But dammit, Captain, you can't do that to me! I'll lose hazard pay and be that much further from retirement!\"\n \n \"That's tough,\" I sympathized, \"but in every service a chap gets broken in rank now and then.\"\n \n \"Maybe it's worth it,\" Quade said heavily. \"Now maybe I've learned how to stay alive out here. I just hope I don't forget.\"\n \n I thought about that. I was nearly through with my first mission and I could speak with experience, even if it was the least amount of experience aboard.\n \n \"Quade,\" I said, \"space isn't as dangerous as all that.\" I clapped him on the shoulder fraternally. \"You worry too much!\"",
      "metadata": {
        "title": "The Spicy Sound of Success",
        "author": "Jim Harmon",
        "passage_id": "51351",
        "uid": "ba58d75c003a4653a5b299a75b17ab78",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "105",
                "uid": "6af18f54b2974f7c953a753d59c50217",
                "response_text": "Captain Gavin and Ordinary Spaceman Quade have an argument about the blank video screen during a space exploration mission. Quade claims it is a transphasia and Captain doubts it. When the dispute gets tense, the two of them go out to find the reason for the blackout. There they smell and taste the beauty. Suddenly, a streak of spice shoots and the captain feels pain. After another short fight the two decide to go back to the spacer. There the captain has a chat with First Officer Nagurski, an ex-captain, about making Gavin's relationship with the crew better. Quade joins, and next steps towards transphasia are discussed with the final decision of the captain to tear apart the ship as it is the only protection. Many disagree again, and Quade goes out somewhere alone without a cable. Gavin blames himself for not seeing Quade's intentions and plans to follow. The crew plans on fighting the noise with music outside and increasing smell and taste by drinking wine. After these preparations, a part of the crew moves out following the cable to search for Quade. Soon they find him lying in the dust with frostbite and heat prostration. Near the ship, lizard-like aliens stand in the crew's way. A short beating occurs, and soon the captain is talking to Quade in the infirmary about the past experience. Turns out the aliens were trying to help and desired to be colonized. Quade acknowledges his mistakes and loses his confidence, for which he is demoted by the captain."
              },
              {
                "worker_id": "103",
                "uid": "1b4fb2a620314fa6b387657be902df26",
                "response_text": "Gavin is the Captain of a spaceship that is set to explore planets and aliens. However, Transphasia, an electrogravitational disturbance that rechannels incoming sense data to the wrong receptive areas, is affecting the video screen on their ship. Quade, an Ordinary Spaceman on the spaceship, does not believe Gavin’s assumption that the alien race might be interfering with their exploration. Quade argues that, from experience, aliens generally do not even recognize their existence. Gavin asserts that Quade relies too much on tradition and experience that he is becoming careless. But Quade states that Gavin is an outsider. Not able to persuade the other, they decided to find out the reason that lead to this video screen blackout. \n\nGoing onto the desert at where they landed, Gavin started to experience Transphasia, where he tastes the views and smell the colors; while on the other hand, Quade seems to have accustomed to the strange senses. Suddenly, some kind of spice goes pass the two of them along with a second-long pain, and Quade was so curious that he dragged Gavin toward the direction of the spice, mentioning that they are an exploration party after all when Gavin ordered him to stop. After getting back to the spaceship, Nagurski, a former Captain and currently a First Officer, disputes with Gavin about trusting the Spacemen and arguing over the degree of specificity that an order should be. \n\nAfter informing Gavin their only way to escape from Transphasia, Gavin refuses and mentions another way, which is to take the spaceship apart. Nagurski is shocked and commented Gavin as being too cautious and it should not be done this way. But Gavin continued. He was then informed by Wallace, the personnel man, that Quade has left the spaceship alone by himself. Gavin is enraged and starts to plan the rescue. He asks Wallace to bring some light wine to the Spacemen to improve their taste and smell. Then Nagurski, Gavin and a few others, went to find Quade. On their way back, they came into direct contact with aliens, who tried to help the men; realizing that other men can provide better help, the aliens left. "
              },
              {
                "worker_id": "107",
                "uid": "3cdfa76ff4c94262a3dc69d8739f0374",
                "response_text": "Captain Gavin and Ordinary Spacemen Quade are in an argument over transphasia. Gavin tries to demonstrate his superiority and title when Quade tells him he is wrong about the definition of transphasia. After a couple more jabs regarding experience as a spaceman and title, the two of them investigate the problem together. They begin to experience transphasia, and it turns out that Quade is correct about the color. Quade pulls him to explore further, and streaks of spice go past them only to come back and make a bitter rip. Gavin does not want to go further from the spacer, but Quade does not mind because he is an experienced spaceman. However, he stays silent once he sees how deep the freefall is. Later, Gavin has a conversation with First Officer Naguski, who claims that he has lots of experience with transphasia. Nagurski then offers advice on how a captain should treat his crew. Gavin argues that one cannot trust anything in space, while Nagurski argues that it is essential for trust to go both ways. Quade then comes in with a plan, and he explains how they would need to keep physical contact with the spaceship and suggests using a cable. Gavin decides to rip apart the spaceship instead, which Nagurski believes is terrible because it would be impossible to assemble again if there were too many missing parts. While Gavin stubbornly sticks to his plan, the personnel man Wallace informs him that Quade has already gone past the three-mile limit. He decides to go after him, finally recognizing that Quade is an essential member of the crew. Quartermaster Farley tells Gavin that he has nothing to worry about, and they discuss plans to combat transphasia. Gavin tells Farley to prepare music and give the men alcohol for medical purposes when they set off to find Quade. Once they are in the area where Quade is, they see and try to haul him back to the spaceship as soon as they can. On the way back, they run into an alien herd. Quade begins to jog towards it, and the others agree to lend him a hand to catch a specimen. The herd starts to close in on them, which eventually puts the group at a significant disadvantage. Gavin is the only sober person, as everybody else has either become knocked out, passed out, or forced to take cover. Later, Gavin visits Quade in the infirmary and tells him that he is having the spaceship put together again. Gavin explains that the aliens they encountered earlier were friendly and tried to help the spacemen. Furthermore, the aliens want them to colonize the planet. Quade blames his arrogance for his near-death experience, but Gavin tells him that confidence is a spaceman’s most important asset. He then demotes Quade to Acting Executive Officer and says that Quade worries too much about how dangerous space is to explore."
              },
              {
                "worker_id": "106",
                "uid": "cced4f58e26a4eb9a323f47dc52144eb",
                "response_text": "Captain Gavin and First Officer Quade are on a very strange planet. This planet is very strange and it changes a person's senses, this is known as \"transphasia\" it also affects radar equipment. Gavin and Quade fight over rank, as Quade is more experienced, but Gavin is captain. They go out for a walk on the surface of this strange planet and their senses begin to get muddled. They hear a wailing call that quickly disappears, and then see a flash of light that travels into a canyon. They think this flash is a substance known as \"spice\". They make their way to the canyon to investigate, tasting colours and hearing sight, but once they reach the canyon, they decide they can't go any further. \nBack at the ship, they converse with first officer Naugurski. Gavin can't understand why the crew don't respect him, he explains to Gavin that he would have to earn the crew's respect. Quade mentioned there's only one way to make it through trasplasia, and that's to keep in contact with the ship at all times. They start to break apart the ship, so that they can put it together in a way that the whole crew will be in constant contact with the ship on a second journey together, to make it to the canyon. As they are working, Wallace, one of the personel men, tells Gavin that Quade has gone out on his own. They plan a rescue mission to save him. They think he will go beyond the three mile limit. Gavin comes up with a plan to stay oriented. They will drink wine to sharpen their sense of sight, and they will stay connected to each other through a cable. After some searching on the surface of the planet, and hearing the wailing call again, they find Quade. They haul him back in weak condition. They are met back at the ship by a group of Aliens, one of whom starts to jump on Quade, flattening him. They manage to pull Quade out of there, and when the two men talk about it later in the ship, Gavin says that the Aliens were trying to figure out what was wrong with Quade, and to help him. They let Quade go when they knew that the crew could help him more than they could. Gavin demotes Quade but they build a new sense of comradery. "
              }
            ]
          },
          {
            "question_text": "What is the reason and development of the conflict between the Captain and Quade?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "105",
                "uid": "6af18f54b2974f7c953a753d59c50217",
                "response_text": "Quade holds the captain in low regard, he believes to be much more experienced and knowledgeable and disagrees with Gavin's decisions. Therefore, Quade doesn't want to obey the captain and constantly confronts him. Gavin, in turn, wants to be obeyed and considers his position enough reason to ask for that. The captain is new to the crew and he doesn't try to get closer to it, while all the other members have known each other for a while. Moreover, the captain constantly takes risks and suggests new methods, in which the crew and Quade are not sure. Gavin also feels jealous as the crew respects Quade much more than the captain himself. Quade acts on his own according to what he considers right, and Gavin has to fight him for leadership and make him obey, not to lose charge. Their relationship changes when Gavin starts blaming himself for Quade's leave and possible death, considering his own jealousy the reason of neglect. When he saves Quade, the least also changes his mind because he recognizes the foolishness of his actions and the two come to an agreement. "
              },
              {
                "worker_id": "103",
                "uid": "1b4fb2a620314fa6b387657be902df26",
                "response_text": "The conflict between Captain and Quade started with Quade mentioning that this is the first trip for the Captain and accused of him being wrong at analyzing the reason that lead to the blackout on the video screen. The Captain argues that Quade has been relying too much on the tradition and the past experiences where he started to become careless; he supposed that Quade was busted to Ordinary Spaceman because of it and he is complacent. Quade repudiated that idea and called Captain an outsider. This conflict leads them to find out the reason that lead to this video screen blackout together. During the trip, Quade was so curious about a spice that passed not far from them that he dragged the Captain toward the direction of the spice, mentioning that they are an exploration party after all when the Captain ordered him to stop.\n\nAfterward, the Captain refuses to comply with Quade’s escape plan from Transphasia; he comes up with a much unusual plan. Later, Quade has left the spaceship alone by himself, which gets the Captain enraged and thought about if he wanted him dead. But he still goes to rescue him fearing of more opinions from the spacemen if Quade is gone. Finally, after Quade is found, they meet some aliens who tried to help them by calling and warning them. They even offered one of their kind for the men to study. Then, Quade realizes that he has been arrogant and blind, and he apologize for his actions. The Captain tells Quade to keep up with his confidence even though he demoted him afterward. And he told Quade that the space isn’t that dangerous. "
              },
              {
                "worker_id": "107",
                "uid": "3cdfa76ff4c94262a3dc69d8739f0374",
                "response_text": "The reason behind Captain Gavin and Quade’s conflict is that the Captain does not trust Quade’s opinions. He believes himself superior to Quade and the rest of the crew because of his higher position as Captain, even though he is very inexperienced compared to many other crew members. He also refuses to compromise for the sake of other crew members, which causes him and Quade to clash constantly because of his stubbornness. This conflict initially develops for the worse, and Quade even goes to defy Gavin’s orders because he believes that his experience will ensure his survival. However, Gavin does choose to rescue Quade, which is a turning point in their conflict. After Quade is rescued, Gavin has a much more positive attitude towards him and even offers words of encouragement. "
              },
              {
                "worker_id": "106",
                "uid": "cced4f58e26a4eb9a323f47dc52144eb",
                "response_text": "\nThe reason for the Captain and Quade's conflict is because while it is Captain Gavin's first space expedition, Quade has twenty years of experience under his belt. They argue over who is more knowledgeable, the captain obviously feeling threatened by Quade's experience. Quade hates that Gavin has the power to pull rank over him, and he sees him as a cocky newbie that doesn't have half the knowledge he possesses. They insult each other on a number of occasions. Quade tells the captain that he is nothing more than a figurehead to the men of the crew. When they go onto the planet's surface, they bicker about how to deal with the terrain. Their conflict is put to rest though after the captain saves Quade's life, and a sort of comradery is formed between them. \n"
              }
            ]
          },
          {
            "question_text": "What is the difference in Gavin's and Nagurski's attitudes?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "105",
                "uid": "6af18f54b2974f7c953a753d59c50217",
                "response_text": "Nagurski used to be a captain and Gavin is now, though their methods and thoughts about this position differ. Nagurski believes the crew must elect their leader, and if a captain guides the crew, this will happen. Gavin thinks such attitude will lead to anarchy. Moreover, Nagurski learned to trust his men in order to make them trust him. Gavin does not trust anyone in space and doesn't want his crew to trust him as well, simply obey. Gavin tries to adapt to the new conditions, acting creatively and according to situation, while Nagurski sticks to old patterns and rules. Nagurski is afraid to risk, he opposes taking apart the ship, being afraid to lose too many parts. Nagurski is neither afraid for Quade going out alone as he believes in the least, while the captain heads to save the man. "
              },
              {
                "worker_id": "103",
                "uid": "1b4fb2a620314fa6b387657be902df26",
                "response_text": "Nagurski believes that as Captains, they should ease the reins on the Spacemen. They are very smart and will realize that your advice is the correct one. Thus they will volunteer to have you as their Captain. He trust the men on the ship for making smart decisions, which will in turn make the men trust him as the Captain. On the other hand, this is Gavin’s first mission ever, and he demands the men on the ship to follow his orders. He does not trust anyone in the ship, but only needs them to obey him. Moreover, he believes that the plan Gavin forms to escape the Transphasia is way too cautious, and he is risking the whole party. Gavin sees Nagurski as wanting a safer job. Gavin also thinks that Nagurski is now a First Officer instead of a Captain due to the fact that he trusted his Spacemen. However, Nagurski explains that he wants to relax a bit more and get a better pay than being a captain.  "
              },
              {
                "worker_id": "107",
                "uid": "3cdfa76ff4c94262a3dc69d8739f0374",
                "response_text": "Gavin is much more uptight and suspicious of everyone, whereas Nagurski is more laid back and has considerable trust for his crew. Gavin often says that the rest of the crew must follow his plans, even when they are much riskier and are more of a stupid gamble than the alternative solutions. He also believes that he will always know what's best because he is the captain, no matter his crew's expertise. Gavin and his crew have a lack of trust, and he generally has a much more negative attitude. Even when Nagurski tries to give him advice, he tells the older man that he cannot have lazy, incompetent slobs running the spaceship. On the other hand, Nagurski, due to his experience, has more trust in the crew. Although he says that he was once the same as Gavin, he is now much calmer and more trusting. He believes that the trust between a crew and its captains must go both ways, which ultimately leads to a captain being accepted by his crew."
              },
              {
                "worker_id": "106",
                "uid": "cced4f58e26a4eb9a323f47dc52144eb",
                "response_text": "Gavin believes that to run a ship, you just need a crew to obey you. They don't have to like you, they don't even have to respect you, but they do have to follow the orders in which you give. Nagurski on the other hand believes that respect, a very important part about working as a captain on a spaceship, is won over. He believes that you must treat your crew with kindness and respect. You must make them see you as their friend, so that they pick you to be their leader, instead of you just being appointed theirs. You must trust them, as they trust you. Gavin thinks that you should trust nothing, especially not people. \n"
              }
            ]
          },
          {
            "question_text": "What happens to Quade throughout the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "105",
                "uid": "6af18f54b2974f7c953a753d59c50217",
                "response_text": "In the very beginning, Quade confronts the new captain in a challenging and harsh manner. Quade believes he knows everything better than the captain and neglects the least as he is a rookie. Quade goes out one on one with the captain to prove he was right about transphasia. When the two face it, Quade is trying to drag the captain towards transphasia, but has to follow the orders and return to the ship. He suggests to keep contact with the ship and run back the cable. His idea is declined and he recklessly goes out alone in a suit without the cable. There his senses are deceived and he is found lying in the dust and brought to the ship. Facing the aliens there, Quade approaches them and is beaten. He finds himself in an infirmary then and acknowledges his lack of judgement to the captain. He is demoted after and accepts this punishment. "
              },
              {
                "worker_id": "103",
                "uid": "1b4fb2a620314fa6b387657be902df26",
                "response_text": "Quade first opposes Gavin’s assumption that the alien race might be interfering with their exploration. Quade argues, from experience, aliens generally do not even recognize their existence. Disagreeing with Quade, Gavin asserts he is relying so much on tradition and experience that he is becoming careless. But Quade states that Gavin is an outsider. Tension is created between the two, and they decided to go and find out what lead to the blackout of the screen. Gavin expected to have Transphasia when they are outside of their spaceship, and explained to Gavin about it. When the spice passes the two, Quade gets curious, but he is stopped by Gavin. Later when he proposes an escape plan, it is refused by Gavin, which then leads to Quade going off alone, only bringing with him a suit and a cartographer unit. He is found, having frostbite and heat prostration, by Gavin and his rescue team.\n\nWhen the team and Quade came across aliens on their way back to the spaceship, Quade decides to show them that aliens cannot be harmful to them. However, he was wrong. After hitting Quade with its tail and injuring some others, the aliens finally left. In the infirmary, Quade is told that the aliens were trying to help, in their own ways, and when they realized that men can provide better help, they left. This makes Quade realize that he was a fool being so arrogant and blind. And he also learns that he has been demoted to Acting Executive Officer.  "
              },
              {
                "worker_id": "107",
                "uid": "3cdfa76ff4c94262a3dc69d8739f0374",
                "response_text": "Throughout the story, Quade almost gets himself killed by the transphasia. He initially tries to propose a plan to Gavin, but the captain vehemently rejects it. After he is fed up with Captain Gavin, he decides to take the initiative and leave the spaceship to investigate on his own. He is confident in his own abilities, but this ends up getting him into trouble. Although he has a lot of experience, he admits that his arrogance and foolhardiness get him into trouble. The transphasia is a lot more dangerous than he initially assumes, and the Quartermaster even diagnoses him with frostbite and heat prostration when the team finds him. Later, he is able to recover in the infirmary."
              },
              {
                "worker_id": "106",
                "uid": "cced4f58e26a4eb9a323f47dc52144eb",
                "response_text": "Quade starts off the story by arguing with Captain Gavin. They decide to go out and explore the surface of the mysterious planet together. They make their way through the pyschadellic minefield of the planet, all the way down to a gorge, where they spot \"spice\". They decide to turn back at this moment, as the climb down would be too dangerous. Quade walks in on the conversation between Gavin and Nagurski, where he proposes an idea. He says that the only way to get through transphasia would be to keep in constant contact with the ship. all the men would be tied together on a line. Not long after this conversation, he decides to go out onto the terrain of the planet on his own, taking with him a suit and a cartographer unit. After a long time out in the terrain, he comes down with frostbite and heat prostration, and collapses on the ground. The crew find him and drag him back to base. When they see the aliens outside of the ship, Quade walks over to one to convince the men that they're docile. The alien begins to jump on him, flattening him, until the crew pull him away. He goes back to his bunk, where he and Gavin talk. Gavin demotes him, but they begin to become friends. "
              }
            ]
          },
          {
            "question_text": "What is the significance of cohesion in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "105",
                "uid": "6af18f54b2974f7c953a753d59c50217",
                "response_text": "Every conflict and dangerous mistake throughout the story was caused by the lack of unity among the characters. The confrontation between Gavin and Quade caused the two to go alone towards transphasia and put themselves in danger. Gavin's lack of desire to work on mutual trust with the crew caused their condemnation of his actions and disobedience during such ab dangerous mission. The mutual offenses and tense arguments between the captain and the crew turned the least to Quade's side. All of this led to Quade going out alone and approaching death, for what Gavin and the crew would blame the captain himself. The arguments between the captain and different members of the crew take a lot of time and the job is done unwillingly, making it not as productive as it could be. The final peace and cohesion, on the contrary, lead to saving Quade, dealing with the aliens and coming to an understanding. "
              },
              {
                "worker_id": "103",
                "uid": "1b4fb2a620314fa6b387657be902df26",
                "response_text": "Firstly, Gavin and Quade dispute over transphasia; not much was accomplished during their trip outside to prove their theories correct. Later, Gavin and Nagurski demonstrate their different opinions on the way of being captains. Clearly, they weren’t content and only believed that they are correct. It was only until Gavin forms the rescue team, do they manage to achieve something. They are able to find Quade, who went off alone. Later, they see aliens. It is interesting to note that even the aliens are able to work as a team, forming a circle to enclose the rescue team and prevent them from escaping. In the end, Quade realizes that he has been arrogant and acted like a fool."
              },
              {
                "worker_id": "107",
                "uid": "3cdfa76ff4c94262a3dc69d8739f0374",
                "response_text": "The significance of cohesion is that it brings together the entire crew. Initially, all of the characters are very disconnected from each other, and there is no teamwork on the spaceship. Instead, there are only conflicts, whether between Gavin and Quade or even Nagurski and Gavin. When they form a rescue team for Quade and initiate the plan, there is finally a sense of unity between the characters. The cohesion is significant because it provides Gavin with positive character development. As it played an important factor in his first mission, it also became an opportunity for him to learn how to be a better captain for the future."
              },
              {
                "worker_id": "106",
                "uid": "cced4f58e26a4eb9a323f47dc52144eb",
                "response_text": "Cohesion is perhaps the most important underlying theme of the story. At first, Captain Gavin is opposed to cohesion. He believes that he shouldn't trust anyone. He doesn't need the crew to like him, and he is completely fine separating himself emotionally from the rest of the men. Gavin and Quade are not a cohesive pair at the beginning of the story. They argue and try to pull rank on one another, both from intellect and experience. Nagurski explains why cohesion is so important, using his dog as a metaphor, you must win the respect and love of your crew so THEY choose YOU. The crew decide to work as a cohesive unit, working together to save Quade. It is the first time that the Captain can be seen actually working with the team, and not just giving them orders. They enter onto the planet's surface together, working as a team to save their comrade. It is only through cohesion that they overcome the transphasia, and save Quade. This is why cohesion is so significant in this story. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5589,
        "document_length_chars": 32335
      }
    }
  ]
}