{
  "item_metadata": {
    "item_id": "51361",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51361",
      "content": "Birds of a Feather\n \n \n By ROBERT SILVERBERG\n \n Illustrated by WOOD\n \n [Transcriber's Note: This etext was produced from Galaxy Magazine November 1958. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n Getting specimens for the interstellar zoo was no problem—they battled for the honor—but now I had to fight like a wildcat to keep a display from making a monkey of me!\n \n\n \n It was our first day of recruiting on the planet, and the alien life-forms had lined up for hundreds of feet back from my rented office. As I came down the block from the hotel, I could hear and see and smell them with ease.\n \n My three staff men, Auchinleck, Stebbins and Ludlow, walked shieldwise in front of me. I peered between them to size the crop up. The aliens came in every shape and form, in all colors and textures—and all of them eager for a Corrigan contract. The Galaxy is full of bizarre beings, but there's barely a species anywhere that can resist the old exhibitionist urge.\n \n \"Send them in one at a time,\" I told Stebbins. I ducked into the office, took my place back of the desk and waited for the procession to begin.\n \n The name of the planet was MacTavish IV (if you went by the official Terran listing) or Ghryne (if you called it by what its people were accustomed to calling it). I thought of it privately as MacTavish IV and referred to it publicly as Ghryne. I believe in keeping the locals happy wherever I go.\n \n Through the front window of the office, I could see our big gay tridim sign plastered to a facing wall: WANTED—EXTRATERRESTRIALS! We had saturated MacTavish IV with our promotional poop for a month preceding arrival. Stuff like this:\n  Want to visit Earth—see the Galaxy's most glittering and exclusive world? Want to draw good pay, work short hours, experience the thrills of show business on romantic Terra? If you are a non-terrestrial, there may be a place for you in the Corrigan Institute of Morphological Science. No freaks wanted—normal beings only. J. F. Corrigan will hold interviews in person on Ghryne from Thirdday to Fifthday of Tenmonth. His last visit to the Caledonia Cluster until\n2937, so don't miss your chance! Hurry! A life of wonder and riches can be yours!\n \n \n \n\n \n Broadsides like that, distributed wholesale in half a thousand languages, always bring them running. And the Corrigan Institute really packs in the crowds back on Earth. Why not? It's the best of its kind, the only really decent place where Earthmen can get a gander at the other species of the universe.\n \n The office buzzer sounded. Auchinleck said unctuously, \"The first applicant is ready to see you, sir.\"\n \n \"Send him, her or it in.\"\n \n The door opened and a timid-looking life-form advanced toward me on nervous little legs. He was a globular creature about the size of a big basketball, yellowish-green, with two spindly double-kneed legs and five double-elbowed arms, the latter spaced regularly around his body. There was a lidless eye at the top of his head and five lidded ones, one above each arm. Plus a big, gaping, toothless mouth.\n \n \n\n \n His voice was a surprisingly resounding basso. \"You are Mr. Corrigan?\"\n \n \"That's right.\" I reached for a data blank. \"Before we begin, I'll need certain information about—\"\n \n \"I am a being of Regulus II,\" came the grave, booming reply, even before I had picked up the blank. \"I need no special care and I am not a fugitive from the law of any world.\"\n \n \"Your name?\"\n \n \"Lawrence R. Fitzgerald.\"\n \n I throttled my exclamation of surprise, concealing it behind a quick cough. \"Let me have that again, please?\"\n \n \"Certainly. My name is Lawrence R. Fitzgerald. The 'R' stands for Raymond.\"\n \n \"Of course, that's not the name you were born with.\"\n \n The being closed his eyes and toddled around in a 360-degree rotation, remaining in place. On his world, that gesture is the equivalent of an apologetic smile. \"My Regulan name no longer matters. I am now and shall evermore be Lawrence R. Fitzgerald. I am a Terraphile, you see.\"\n \n \n\n \n The little Regulan was as good as hired. Only the formalities remained.\n\"You understand our terms, Mr. Fitzgerald?\"\n \n \"I'll be placed on exhibition at your Institute on Earth. You'll pay for my services, transportation and expenses. I'll be required to remain on exhibit no more than one-third of each Terran sidereal day.\"\n \n \"And the pay will be—ah—$50 Galactic a week, plus expenses and transportation.\"\n \n The spherical creature clapped his hands in joy, three hands clapping on one side, two on the other. \"Wonderful! I will see Earth at last! I accept the terms!\"\n \n I buzzed for Ludlow and gave him the fast signal that meant we were signing this alien up at half the usual pay, and Ludlow took him into the other office to sign him up.\n \n I grinned, pleased with myself. We needed a green Regulan in our show; the last one had quit four years ago. But just because we needed him didn't mean we had to be extravagant in hiring him. A Terraphile alien who goes to the extent of rechristening himself with a Terran monicker would work for nothing, or even pay us, just so long as we let him get to Earth. My conscience won't let me really exploit a being, but I don't believe in throwing money away, either.\n \n The next applicant was a beefy ursinoid from Aldebaran IX. Our outfit has all the ursinoids it needs or is likely to need in the next few decades, and so I got rid of him in a couple of minutes. He was followed by a roly-poly blue-skinned humanoid from Donovan's Planet, four feet high and five hundred pounds heavy. We already had a couple of his species in the show, but they made good crowd-pleasers, being so plump and cheerful. I passed him along to Auchinleck to sign at anything short of top rate.\n \n Next came a bedraggled Sirian spider who was more interested in a handout than a job. If there's any species we have a real over-supply of, it's those silver-colored spiders, but this seedy specimen gave it a try anyway. He got the gate in half a minute, and he didn't even get the handout he was angling for. I don't approve of begging.\n \n The flora of applicants was steady. Ghryne is in the heart of the Caledonia Cluster, where the interstellar crossroads meet. We had figured to pick up plenty of new exhibits here and we were right.\n \n \n\n \n It was the isolationism of the late 29th century that turned me into the successful proprietor of Corrigan's Institute, after some years as an impoverished carnival man in the Betelgeuse system. Back in\n2903, the World Congress declared Terra off-bounds for non-terrestrial beings, as an offshoot of the Terra for Terrans movement.\n \n Before then, anyone could visit Earth. After the gate clanged down, a non-terrestrial could only get onto Sol III as a specimen in a scientific collection—in short, as an exhibit in a zoo.\n \n That's what the Corrigan Institute of Morphological Science really is, of course. A zoo. But we don't go out and hunt for our specimens; we advertise and they come flocking to us. Every alien wants to see Earth once in his lifetime, and there's only one way he can do it.\n \n We don't keep too big an inventory. At last count, we had 690 specimens before this trip, representing 298 different intelligent life-forms. My goal is at least one member of at least 500 different races. When I reach that, I'll sit back and let the competition catch up—if it can.\n \n After an hour of steady work that morning, we had signed eleven new specimens. At the same time, we had turned away a dozen ursinoids, fifty of the reptilian natives of Ghryne, seven Sirian spiders, and no less than nineteen chlorine-breathing Procyonites wearing gas masks.\n \n It was also my sad duty to nix a Vegan who was negotiating through a Ghrynian agent. A Vegan would be a top-flight attraction, being some\n400 feet long and appropriately fearsome to the eye, but I didn't see how we could take one on. They're gentle and likable beings, but their upkeep runs into literally tons of fresh meat a day, and not just any old kind of meat either. So we had to do without the Vegan.\n \n \"One more specimen before lunch,\" I told Stebbins, \"to make it an even dozen.\"\n \n He looked at me queerly and nodded. A being entered. I took a long close look at the life-form when it came in, and after that I took another one. I wondered what kind of stunt was being pulled. So far as I could tell, the being was quite plainly nothing but an Earthman.\n \n He sat down facing me without being asked and crossed his legs. He was tall and extremely thin, with pale blue eyes and dirty-blond hair, and though he was clean and reasonably well dressed, he had a shabby look about him. He said, in level Terran accents, \"I'm looking for a job with your outfit, Corrigan.\"\n \n \"There's been a mistake. We're interested in non-terrestrials only.\"\n \n \"I'm a non-terrestrial. My name is Ildwar Gorb, of the planet Wazzenazz XIII.\"\n \n \n\n \n I don't mind conning the public from time to time, but I draw the line at getting bilked myself. \"Look, friend, I'm busy, and I'm not known for my sense of humor. Or my generosity.\"\n \n \"I'm not panhandling. I'm looking for a job.\"\n \n \"Then try elsewhere. Suppose you stop wasting my time, bud. You're as Earthborn as I am.\"\n \n \"I've never been within a dozen parsecs of Earth,\" he said smoothly. \"I happen to be a representative of the only Earthlike race that exists anywhere in the Galaxy but on Earth itself. Wazzenazz XIII is a small and little-known planet in the Crab Nebula. Through an evolutionary fluke, my race is identical with yours. Now, don't you want me in your circus?\"\n \n \"No. And it's not a circus. It's—\"\n \n \"A scientific institute. I stand corrected.\"\n \n There was something glib and appealing about this preposterous phony. I guess I recognized a kindred spirit or I would have tossed him out on his ear without another word. Instead I played along. \"If you're from such a distant place, how come you speak English so well?\"\n \n \"I'm not speaking. I'm a telepath—not the kind that reads minds, just the kind that projects. I communicate in symbols that you translate back to colloquial speech.\"\n \n \"Very clever, Mr. Gorb.\" I grinned at him and shook my head. \"You spin a good yarn—but for my money, you're really Sam Jones or Phil Smith from Earth, stranded here and out of cash. You want a free trip back to Earth. No deal. The demand for beings from Wazzenazz XIII is pretty low these days. Zero, in fact. Good-by, Mr. Gorb.\"\n \n He pointed a finger squarely at me and said, \"You're making a big mistake. I'm just what your outfit needs. A representative of a hitherto utterly unknown race identical to humanity in every respect! Look here, examine my teeth. Absolutely like human teeth! And—\"\n \n I pulled away from his yawning mouth. \"Good-by, Mr. Gorb,\" I repeated.\n \n \"All I ask is a contract, Corrigan. It isn't much. I'll be a big attraction. I'll—\"\n \n \" Good-by, Mr. Gorb! \"\n \n He glowered at me reproachfully for a moment, stood up and sauntered to the door. \"I thought you were a man of acumen, Corrigan. Well, think it over. Maybe you'll regret your hastiness. I'll be back to give you another chance.\"\n \n He slammed the door and I let my grim expression relax into a smile. This was the best con switch yet—an Earthman posing as an alien to get a job!\n \n But I wasn't buying it, even if I could appreciate his cleverness intellectually. There's no such place as Wazzenazz XIII and there's only one human race in the Galaxy—on Earth. I was going to need some real good reason before I gave a down-and-out grifter a free ticket home.\n \n I didn't know it then, but before the day was out, I would have that reason. And, with it, plenty of trouble on my hands.\n \n \n\n \n The first harbinger of woe turned up after lunch in the person of a Kallerian. The Kallerian was the sixth applicant that afternoon. I had turned away three more ursinoids, hired a vegetable from Miazan, and said no to a scaly pseudo-armadillo from one of the Delta Worlds. Hardly had the 'dillo scuttled dejectedly out of my office when the Kallerian came striding in, not even waiting for Stebbins to admit him officially.\n \n He was big even for his kind—in the neighborhood of nine feet high, and getting on toward a ton. He planted himself firmly on his three stocky feet, extended his massive arms in a Kallerian greeting-gesture, and growled, \"I am Vallo Heraal, Freeman of Kaller IV. You will sign me immediately to a contract.\"\n \n \"Sit down, Freeman Heraal. I like to make my own decisions, thanks.\"\n \n \"You will grant me a contract!\"\n \n \"Will you please sit down?\"\n \n He said sulkily, \"I will remain standing.\"\n \n \"As you prefer.\" My desk has a few concealed features which are sometimes useful in dealing with belligerent or disappointed life-forms. My fingers roamed to the meshgun trigger, just in case of trouble.\n \n The Kallerian stood motionless before me. They're hairy creatures, and this one had a coarse, thick mat of blue fur completely covering his body. Two fierce eyes glimmered out through the otherwise dense blanket of fur. He was wearing the kilt, girdle and ceremonial blaster of his warlike race.\n \n I said, \"You'll have to understand, Freeman Heraal, that it's not our policy to maintain more than a few members of each species at our Institute. And we're not currently in need of any Kallerian males, because—\"\n \n \"You will hire me or trouble I will make!\"\n \n I opened our inventory chart. I showed him that we were already carrying four Kallerians, and that was more than plenty.\n \n The beady little eyes flashed like beacons in the fur. \"Yes, you have four representatives—of the Clan Verdrokh! None of the Clan Gursdrinn! For three years, I have waited for a chance to avenge this insult to the noble Clan Gursdrinn!\"\n \n At the key-word avenge , I readied myself to ensnarl the Kallerian in a spume of tanglemesh the instant he went for his blaster, but he didn't move. He bellowed, \"I have vowed a vow, Earthman. Take me to Earth, enroll a Gursdrinn, or the consequences will be terrible!\"\n \n \n\n \n I'm a man of principles, like all straightforward double-dealers, and one of the most important of those principles is that I never let myself be bullied by anyone. \"I deeply regret having unintentionally insulted your clan, Freeman Heraal. Will you accept my apologies?\"\n \n He glared at me in silence.\n \n I went on, \"Please be assured that I'll undo the insult at the earliest possible opportunity. It's not feasible for us to hire another Kallerian now, but I'll give preference to the Clan Gursdrinn as soon as a vacancy—\"\n \n \"No. You will hire me now.\"\n \n \"It can't be done, Freeman Heraal. We have a budget, and we stick to it.\"\n \n \"You will rue! I will take drastic measures!\"\n \n \"Threats will get you nowhere, Freeman Heraal. I give you my word I'll get in touch with you as soon as our organization has room for another Kallerian. And now, please, there are many applicants waiting—\"\n \n You'd think it would be sort of humiliating to become a specimen in a zoo, but most of these races take it as an honor. And there's always the chance that, by picking a given member of a race, we're insulting all the others.\n \n I nudged the trouble-button on the side of my desk and Auchinleck and Ludlow appeared simultaneously from the two doors at right and left. They surrounded the towering Kallerian and sweet-talkingly led him away. He wasn't minded to quarrel physically, or he could have knocked them both into the next city with a backhand swipe of his shaggy paw, but he kept up a growling flow of invective and threats until he was out in the hall.\n \n I mopped sweat from my forehead and began to buzz Stebbins for the next applicant. But before my finger touched the button, the door popped open and a small being came scooting in, followed by an angry Stebbins.\n \n \"Come here, you!\"\n \n \"Stebbins?\" I said gently.\n \n \"I'm sorry, Mr. Corrigan. I lost sight of this one for a moment, and he came running in—\"\n \n \"Please, please,\" squeaked the little alien pitifully. \"I must see you, honored sir!\"\n \n \"It isn't his turn in line,\" Stebbins protested. \"There are at least fifty ahead of him.\"\n \n \n\n \n \"All right,\" I said tiredly. \"As long as he's in here already, I might as well see him. Be more careful next time, Stebbins.\"\n \n Stebbins nodded dolefully and backed out.\n \n \n\n \n The alien was a pathetic sight: a Stortulian, a squirrely-looking creature about three feet high. His fur, which should have been a lustrous black, was a dull gray, and his eyes were wet and sad. His tail drooped. His voice was little more than a faint whimper, even at full volume.\n \n \"Begging your most honored pardon most humbly, important sir. I am a being of Stortul XII, having sold my last few possessions to travel to Ghryne for the miserable purpose of obtaining an interview with yourself.\"\n \n I said, \"I'd better tell you right at the outset that we're already carrying our full complement of Stortulians. We have both a male and a female now and—\"\n \n \"This is known to me. The female—is her name perchance Tiress?\"\n \n I glanced down at the inventory chart until I found the Stortulian entry. \"Yes, that's her name.\"\n \n The little being immediately emitted a soul-shaking gasp. \"It is she! It is she!\"\n \n \"I'm afraid we don't have room for any more—\"\n \n \"You are not in full understanding of my plight. The female Tiress, she is—was—my own Fire-sent spouse, my comfort and my warmth, my life and my love.\"\n \n \"Funny,\" I said. \"When we signed her three years ago, she said she was single. It's right here on the chart.\"\n \n \"She lied! She left my burrow because she longed to see the splendors of Earth. And I am alone, bound by our sacred customs never to remarry, languishing in sadness and pining for her return. You must take me to Earth!\"\n \n \"But—\"\n \n \"I must see her—her and this disgrace-bringing lover of hers. I must reason with her. Earthman, can't you see I must appeal to her inner flame? I must bring her back! \"\n \n My face was expressionless. \"You don't really intend to join our organization at all—you just want free passage to Earth?\"\n \n \"Yes, yes!\" wailed the Stortulian. \"Find some other member of my race, if you must! Let me have my wife again, Earthman! Is your heart a dead lump of stone?\"\n \n \n\n \n It isn't, but another of my principles is to refuse to be swayed by sentiment. I felt sorry for this being's domestic troubles, but I wasn't going to break up a good act just to make an alien squirrel happy—not to mention footing the transportation.\n \n I said, \"I don't see how we can manage it. The laws are very strict on the subject of bringing alien life to Earth. It has to be for scientific purposes only. And if I know in advance that your purpose in coming isn't scientific, I can't in all conscience lie for you, can I?\"\n \n \"Well—\"\n \n \"Of course not.\" I took advantage of his pathetic upset to steam right along. \"Now if you had come in here and simply asked me to sign you up, I might conceivably have done it. But no—you had to go unburden your heart to me.\"\n \n \"I thought the truth would move you.\"\n \n \"It did. But in effect you're now asking me to conspire in a fraudulent criminal act. Friend, I can't do it. My reputation means too much to me,\" I said piously.\n \n \"Then you will refuse me?\"\n \n \"My heart melts to nothingness for you. But I can't take you to Earth.\"\n \n \"Perhaps you will send my wife to me here?\"\n \n There's a clause in every contract that allows me to jettison an unwanted specimen. All I have to do is declare it no longer of scientific interest, and the World Government will deport the undesirable alien back to its home world. But I wouldn't pull a low trick like that on our female Stortulian.\n \n I said, \"I'll ask her about coming home. But I won't ship her back against her will. And maybe she's happier where she is.\"\n \n The Stortulian seemed to shrivel. His eyelids closed half-way to mask his tears. He turned and shambled slowly to the door, walking like a living dishrag. In a bleak voice, he said, \"There is no hope then. All is lost. I will never see my soulmate again. Good day, Earthman.\"\n \n He spoke in a drab monotone that almost, but not quite, had me weeping. I watched him shuffle out. I do have some conscience, and I had the uneasy feeling I had just been talking to a being who was about to commit suicide on my account.\n \n \n\n \n About fifty more applicants were processed without a hitch. Then life started to get complicated again.\n \n Nine of the fifty were okay. The rest were unacceptable for one reason or another, and they took the bad news quietly enough. The haul for the day so far was close to two dozen new life-forms under contract.\n \n I had just about begun to forget about the incidents of the Kallerian's outraged pride and the Stortulian's flighty wife when the door opened and the Earthman who called himself Ildwar Gorb of Wazzenazz XIII stepped in.\n \n \"How did you get in here?\" I demanded.\n \n \"Your man happened to be looking the wrong way,\" he said cheerily.\n\"Change your mind about me yet?\"\n \n \"Get out before I have you thrown out.\"\n \n Gorb shrugged. \"I figured you hadn't changed your mind, so I've changed my pitch a bit. If you won't believe I'm from Wazzenazz XIII, suppose I tell you that I am Earthborn, and that I'm looking for a job on your staff.\"\n \n \"I don't care what your story is! Get out or—\"\n \n \"—you'll have me thrown out. Okay, okay. Just give me half a second. Corrigan, you're no fool, and neither am I—but that fellow of yours outside is . He doesn't know how to handle alien beings. How many times today has a life-form come in here unexpectedly?\"\n \n I scowled at him. \"Too damn many.\"\n \n \"You see? He's incompetent. Suppose you fire him, take me on instead. I've been living in the outworlds half my life; I know all there is to know about alien life-forms. You can use me, Corrigan.\"\n \n I took a deep breath and glanced all around the paneled ceiling of the office before I spoke. \"Listen, Gorb, or whatever your name is, I've had a hard day. There's been a Kallerian in here who just about threatened murder, and there's been a Stortulian in here who's about to commit suicide because of me. I have a conscience and it's troubling me. But get this: I just want to finish off my recruiting, pack up and go home to Earth. I don't want you hanging around here bothering me. I'm not looking to hire new staff members, and if you switch back to claiming you're an unknown life-form from Wazzenazz XIII, the answer is that I'm not looking for any of those either. Now will you scram or—\"\n \n The office door crashed open at that point and Heraal, the Kallerian, came thundering in. He was dressed from head to toe in glittering metalfoil, and instead of his ceremonial blaster, he was wielding a sword the length of a human being. Stebbins and Auchinleck came dragging helplessly along in his wake, hanging desperately to his belt.\n \n \"Sorry, Chief,\" Stebbins gasped. \"I tried to keep him out, but—\"\n \n Heraal, who had planted himself in front of my desk, drowned him out with a roar. \"Earthman, you have mortally insulted the Clan Gursdrinn!\"\n \n \n\n \n Sitting with my hands poised near the meshgun trigger, I was ready to let him have it at the first sight of actual violence.\n \n Heraal boomed, \"You are responsible for what is to happen now. I have notified the authorities and you prosecuted will be for causing the death of a life-form! Suffer, Earthborn ape! Suffer!\"\n \n \"Watch it, Chief,\" Stebbins yelled. \"He's going to—\"\n \n An instant before my numb fingers could tighten on the meshgun trigger, Heraal swung that huge sword through the air and plunged it savagely through his body. He toppled forward onto the carpet with the sword projecting a couple of feet out of his back. A few driblets of bluish-purple blood spread from beneath him.\n \n Before I could react to the big life-form's hara-kiri, the office door flew open again and three sleek reptilian beings entered, garbed in the green sashes of the local police force. Their golden eyes goggled down at the figure on the floor, then came to rest on me.\n \n \"You are J. F. Corrigan?\" the leader asked.\n \n \"Y-yes.\"\n \n \"We have received word of a complaint against you. Said complaint being—\"\n \n \"—that your unethical actions have directly contributed to the untimely death of an intelligent life-form,\" filled in the second of the Ghrynian policemen.\n \n \"The evidence lies before us,\" intoned the leader, \"in the cadaver of the unfortunate Kallerian who filed the complaint with us several minutes ago.\"\n \n \"And therefore,\" said the third lizard, \"it is our duty to arrest you for this crime and declare you subject to a fine of no less than\n$100,000 Galactic or two years in prison.\"\n \n \"Hold on!\" I stormed. \"You mean that any being from anywhere in the Universe can come in here and gut himself on my carpet, and I'm responsible?\"\n \n \"This is the law. Do you deny that your stubborn refusal to yield to this late life-form's request lies at the root of his sad demise?\"\n \n \"Well, no, but—\"\n \n \"Failure to deny is admission of guilt. You are guilty, Earthman.\"\n \n \n\n \n Closing my eyes wearily, I tried to wish the whole babbling lot of them away. If I had to, I could pony up the hundred-grand fine, but it was going to put an awful dent in this year's take. And I shuddered when I remembered that any minute that scrawny little Stortulian was likely to come bursting in here to kill himself too. Was it a fine of $100,000 per suicide? At that rate, I could be out of business by nightfall.\n \n I was spared further such morbid thoughts by yet another unannounced arrival.\n \n The small figure of the Stortulian trudged through the open doorway and stationed itself limply near the threshold. The three Ghrynian policemen and my three assistants forgot the dead Kallerian for a moment and turned to eye the newcomer.\n \n I had visions of unending troubles with the law here on Ghryne. I resolved never to come here on a recruiting trip again—or, if I did come, to figure out some more effective way of screening myself against crackpots.\n \n In heart-rending tones, the Stortulian declared, \"Life is no longer worth living. My last hope is gone. There is only one thing left for me to do.\"\n \n I was quivering at the thought of another hundred thousand smackers going down the drain. \"Stop him, somebody! He's going to kill himself! He's—\"\n \n Then somebody sprinted toward me, hit me amidships, and knocked me flying out from behind my desk before I had a chance to fire the meshgun. My head walloped the floor, and for five or six seconds, I guess I wasn't fully aware of what was going on.\n \n Gradually the scene took shape around me. There was a monstrous hole in the wall behind my desk; a smoking blaster lay on the floor, and I saw the three Ghrynian policemen sitting on the raving Stortulian. The man who called himself Ildwar Gorb was getting to his feet and dusting himself off.\n \n He helped me up. \"Sorry to have had to tackle you, Corrigan. But that Stortulian wasn't here to commit suicide, you see. He was out to get you.\"\n \n I weaved dizzily toward my desk and dropped into my chair. A flying fragment of wall had deflated my pneumatic cushion. The smell of ashed plaster was everywhere. The police were effectively cocooning the struggling little alien in an unbreakable tanglemesh.\n \n \"Evidently you don't know as much as you think you do about Stortulian psychology, Corrigan,\" Gorb said lightly. \"Suicide is completely abhorrent to them. When they're troubled, they kill the person who caused their trouble. In this case, you.\"\n \n \n\n \n I began to chuckle—more of a tension-relieving snicker than a full-bodied laugh.\n \n \"Funny,\" I said.\n \n \"What is?\" asked the self-styled Wazzenazzian.\n \n \"These aliens. Big blustery Heraal came in with murder in his eye and killed himself , and the pint-sized Stortulian who looked so meek and pathetic damn near blew my head off.\" I shuddered. \"Thanks for the tackle job.\"\n \n \"Don't mention it,\" Gorb said.\n \n I glared at the Ghrynian police. \"Well? What are you waiting for? Take that murderous little beast out of here! Or isn't murder against the local laws?\"\n \n \"The Stortulian will be duly punished,\" replied the leader of the Ghrynian cops calmly. \"But there is the matter of the dead Kallerian and the fine of—\"\n \n \"—one hundred thousand dollars. I know.\" I groaned and turned to Stebbins. \"Get the Terran Consulate on the phone, Stebbins. Have them send down a legal adviser. Find out if there's any way we can get out of this mess with our skins intact.\"\n \n \"Right, Chief.\" Stebbins moved toward the visiphone.\n \n Gorb stepped forward and put a hand on his chest.\n \n \"Hold it,\" the Wazzenazzian said crisply. \"The Consulate can't help you. I can.\"\n \n \"You?\" I said.\n \n \"I can get you out of this cheap.\"\n \n \" How cheap?\"\n \n Gorb grinned rakishly. \"Five thousand in cash plus a contract as a specimen with your outfit. In advance, of course. That's a heck of a lot better than forking over a hundred grand, isn't it?\"\n \n I eyed Gorb uncertainly. The Terran Consulate people probably wouldn't be much help; they tried to keep out of local squabbles unless they were really serious, and I knew from past experiences that no officials ever worried much about the state of my pocketbook. On the other hand, giving this slyster a contract might be a risky proposition.\n \n \"Tell you what,\" I said finally. \"You've got yourself a deal—but on a contingency basis. Get me out of this and you'll have five grand and the contract. Otherwise, nothing.\"\n \n Gorb shrugged. \"What have I to lose?\"",
      "metadata": {
        "title": "Birds of a Feather",
        "author": "Robert Silverberg",
        "passage_id": "51361",
        "uid": "6ed1a21290a74212ace47a00014d033c",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "10",
                "uid": "a7f565ae5ede4db6983127542cfd1675",
                "response_text": "Sometime after the year 2903, the narrator of the story, Mr. Corrigan, is having a recruiting day on the planet of Ghryne, which he privately calls MacTavish IV. Mr. Corrigan owns a popular zoo on Earth called the Corrigan Institute - the only place where humans can see other species of the universe. He recruits alien life forms to exhibit at the zoo, and relatively quickly signs eleven new specimens onto his current 690 that are under contract at the institute on earth. This is a viable business because the World Congress declared Earth off-bounds to aliens in 2903, and the only way aliens can now go to Earth is as exhibits in this zoo.\n\nAliens make great sacrifices to come interview with Mr. Corrigan, as it seems he offers them a good deal. Those under contract are required to remain on exhibit for less than one-third of each day and get paid $50 Galactic a week, with expenses and transportation included. \n\nHe interviews many different creatures through the day, with some being noteworthy and some not as much, being ushered away quickly by Mr. Corrigan’s assistant Stebbins. \n\nA Stortulian who claims his wife ran away to the Corrigan Institute, leaving him alone and unable to remarry due to his customs, pleads with Corrigan to let him go to Earth or at the very least to send her back. Mr. Corrigan is slightly frazzled by the story, but ultimately asks the Stortulian to leave, feeling sad and that he may commit suicide upon leaving and losing hope for his wife to return.\nVallo Heraal, Freeman of Kaller IV, was another notable interview. He stormed in and demanded to be signed to contract - and Mr. Corrigan preferred to make his own decisions. Herald felt insulted that the only four Kallerians at the institute were from the Clan Verdrokh, with no representation at all from his Clan Gursdrinn. Corrigan insisted he was unable to take another Kallerian, and apologized for insulting Clan Gursdrinn. This was enough to de-escalate physical violence, but Heraal was not pleased, and had to be escorted out of the room by Auchinleck and Ludlow who were summoned when Corrigan pushed a panic button under his desk.\nIn a surprise twist from what Corrigan had expected - the Stortulian to kill himself, and for Heraal to try to kill him - the opposite happens. Heraal storms in and stabs himself with his own sword, killing him instantly. The Stortulian returns and attempts to murder Mr. Corrigan, who is narrowly saved by being tackled by Gorb. The Ghrynian cops attempt to place a $100,000 fine on Corrigan for causing the death of a being (Heraal, who killed himself after being refused a contract). Gorb offers to get Corrigan out of the situation for $5000 and a contract to the institute, which is accepted.\n"
              },
              {
                "worker_id": "6",
                "uid": "011f026b8e7f4821a9cc45e28768dac0",
                "response_text": "Mr. Corrigan, of the Corrigan Institute of Morphological Science, is visiting MacTavish IV (Ghryne) in the Caledonia Cluster for a few days to hold interviews for new specimens to be featured in his zoo. All life forms, aside from Terra, were banned from ever visiting Earth since 2903, so the only way to get in is to be viewed for science, hence the zoo. The Institute has 690 specimens currently, encompassing 298 life-forms. He brings his men with him, Auchinleck, Stebbins, and Ludlow, to help calm the masses. His first applicant of the day walks in: a round creature with five eyed-arms and two legs. He introduces himself as Lawrence R. Fitzgerald of Regulus II, showing himself to be a Terraphile. Corrigan signs him on for half the normal pay and sends him on his way. A urisinoid from Aldebaran IX is next, but Corrigan has no need for another one. He signs a creature from Donovan’s Planet, since they are such crowd-pleasers, and nine more. He also turns down at least 87 other life-forms, only of which, a Vegan, he feels remorse about. \nHis last specimen before lunch seems to be an Earthman pulling a con. He calls himself Ildwar Gorb and claims he’s from Wazzenaxx XIII. Corrigan doesn’t believe his tale and sends him out, though Gorb promises he’ll change his mind before long. \nAfter lunch, trouble starts to arise. A Kallerian comes in and demands a place in his zoo, even though they already have four. Vallo Heraal of Clan Gursdrinn feels Corrigan has insulted his clan by only hiring members of Clan Verdrokh. Corrigan tries to calm him, but nothing can assuage his anger. He presses his trouble button, and his men come in and take Heraal away. \nA small alien runs into the room, sneaking past Stebbins, and begs to be brought to Earth so he can reunite with his soulmate, a previously hired Stortulian. She ran away from him when she got the opportunity to live on Earth, and, per Stortulian customs, the Stortulian was not allowed to remarry. \nCorrigan turns him down and continues on with his day until Gorb arrives again. He snuck past his men and offers himself as staff. Corrigan says no, but just then the Kallerian comes crashing in and commits hara-kiri, killing himself in front of the crowd. The police enter and claim Corrigan was the cause of his death since he had just filed a complaint against him. He can either be arrested or fined $100K. Next, the Stortulian walks back in and claims there is no reason to keep living. Unlike the Kallerian, he attempts to murder Corrigan by shooting his gun. However, Corrigan is shoved out of the way by Gorb. The Stortulian is arrested, and his actions are explained by Gorb. \nCorrigan decides to call his lawyer, but Gorb offers him a deal he can’t refuse. Five thousand dollars as well as a contract, and he’ll get Corrigan out of trouble. Corrigan agrees. \n"
              },
              {
                "worker_id": "8",
                "uid": "e9042ed21496426ca1a5513382b0169f",
                "response_text": "J.F. Corrigan is the proprietor of the Corrigan Institute of Morphological Science, a glorified Terran zoo that offers spectators a glimpse at several hundred species of non-terrestrial life forms from all over the galaxy. Corrigan prides himself on actually employing his exhibits rather than hunting them down. Because Earth had closed its borders in the 29th century to non-terrestrial visitors, getting a job at Corrigan's zoo is a popular way for non-terrestrials to visit the planet and make a decent living at the same time. Corrigan offers good pay, short hours, and cover transportation costs and other expenses. Although he is generous, he is also thrifty and not above conning the public in the name of advancing his business. Corrigan arrives at the planet Ghryne to interview potential new non-terrestrials for his exhibition assisted by his employees Stebbins, Auchinleck, and Ludlow. He interviews dozens of non-terrestrials from planets all over the galaxy, including Mr. Lawrence R. Fitzgerald, a self-described Terraphile from Regulus II who wants to go to Earth so badly he is willing to work for less pay. Next, Corrigan meets Ildwar Gorb, a non-terrestrial from Wazzenazz XIII who looks remarkably like a human and claims to communicate through telepathic projection. Because of this similarity, Corrigan suspects him of actually being an Earthman attempting to con him for a free ride back to Earth. He dismisses Gorb, who implores him to reconsider and promises to return. After Gorb leaves, a Kallerian named Vallo Heraal enters and demands Corrigan hire him immediately or he will cause trouble. Wary of the Kallerian's size and threats, Corrigan fingers the meshgun trigger hidden under his desk in case he needs to protect himself. After Auchinleck and Ludlow escort Heraal out of the room, a small Stortulian enters Corrigan's office and tells him he doesn't want to work for him necessarily, but he is seeking passage to Earth so he can be reunited with his wife, who is currently under Corrigan's employ at the Institute.  When Corrigan refuses, the Stortulian leaves, and Corrigan process several dozen more applicants. When Gorb reenters and offers to replace Stebbins due to his incompetent handling of the non-terrestrials waiting in line, Corrigan threatens to have him thrown out. At that moment, Heraal returns, brandishing a large sword, which he uses to kill himself in front of everyone. As Corrigan processes this turn of events, the Ghrynian police enter and charge Corrigan with Heraal's death which includes a $100,000 Galactic fine. Next, the Stortulian reenters and attempts to shoot Corrigan, who is saved by Gorb. Gorb offers to solve Corrigan's legal liability for the death of Heraal in exchange for $5,000 Galactic and a contract with the Corrigan Institute. Corrigan agrees to the arrangement, so long as Gorb upholds his end of the bargain first."
              },
              {
                "worker_id": "2",
                "uid": "ef88bf683be64fd68c6c988c624f28a9",
                "response_text": "J. F. Corrigan of Earth’s Corrigan Institute of Morphological Science is on the planet MacTavish IV (aka Ghryne by its natives) to recruit alien life forms as specimens for display in what is effectively a zoo. This is the only way aliens can visit Earth because in 2903 the World Congress declared Earth off-limits for non-terrestrials. Throughout the day, Corrigan interviews many colorful, interesting alien life forms, ultimately hiring about two dozen. His goal is to have a collection of at least one member of 500 different races and currently has 298. He rejects some applicants simply because he already has specimens of their type. One applicant, Gorb, looks and sounds like a human but claims to be from a plant named Wazzenazz XIII. Corrigan is convinced he is just a human and sends him on his way, but Gorb says he will be back to give Corrigan another chance. \nLater in the day, Corrigan has two troublesome interviews, the first with a distraught Kallerian named Vallo Heraal who wants to be hired because four other Kallerians have been hired from a different clan than his, and he feels his clan has been insulted. Corrigan apologizes for having unintentionally insulted Heraal’s clan but explains that he doesn’t need any more Kallerians now; he offers to give preference to Heraal’s clan when there is a vacancy. Unappeased, Heraal warns Corrigan that he will be sorry, and Corrigan sends for members of his team to escort him out. Next, a squirrely-looking Stortulian slips in, exclaiming that he must speak with Corrigan. The Stortulian explains that he is there because his wife is on Earth in Corrigan’s display. She left him because she wanted to go to Earth, and now he is lonely but forbidden by his customs to remarry. He doesn’t want to be hired but just wants passage to Earth to persuade his wife to return home. Corrigan patiently tells the Stortulian he can’t take him because it would be illegal. The Stortullian accepts defeat, saying he has no hope at all, and Corrigan has the distinct impression that the fellow is going to commit suicide. \nAt the end of the day, Gorb returns, asking Corrigan to hire him to work with his company. Heraal crashes in and tells Corrigan he has contacted the authorities and accused him of causing the death of a life-form before he kills himself. The police arrive to arrest Corrigan, but the Stortulian returns, again claiming his life isn’t worth living and fires a shot at Corrigan who is saved by the swift action of Gorb who pushes him out of the way.\n"
              }
            ]
          },
          {
            "question_text": "Who is Mr. Fitzgerald and what happens to him in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "10",
                "uid": "a7f565ae5ede4db6983127542cfd1675",
                "response_text": "Lawrence Raymond Fitzgerald is a being of Regulus II, who is a self-procclaimed Terrophile, who changed his name to a famous human’s which pleases Mr. Corrigan.\nMr. Fitzgerald had a very deep voice, and was a yellow-green spherical shape the size of a basketball, with two double-kneed legs and five double-elbowed arms. He had size eyes, one with no eyelid right at the top of his head, and a mouth with no teeth.\nHe was fortunate to be in-demand for the zoo - Mr. Corrigan saying that he needed a Regulan - and is signed extremely quickly onto contract with Mr. Corrigan during his interview. He’ll be paid $50 Galactic per week on Earth, which is very pleasing for him.\n"
              },
              {
                "worker_id": "6",
                "uid": "011f026b8e7f4821a9cc45e28768dac0",
                "response_text": "Mr. Fitzgerald is a Regulan, an alien with two legs, five arms covered with eyes and two elbows, and of a chartreuse-y color. His shape is similar to a basketball, and his face features one eyeball and a large toothless mouth. He introduces himself as Lawrence R. Fitzgerald, the R standing for Raymond, and says he came from Regulus II. He chose a Terra name to show how dedicated he is to Earth. He calls himself a Terraphile. \nMr. Fitzgerald wants to be a member of Corrigan’s Institute so he can live on Earth, and Mr. Corrigan can see that clear as day. He offers him half the pay that everyone else normally receives, and Mr. Fitzgerald accepts it happily. He will be able to see Earth after all, but he was scammed. \n"
              },
              {
                "worker_id": "8",
                "uid": "e9042ed21496426ca1a5513382b0169f",
                "response_text": "Lawrence R. Fitzgerald is a Regulan from the planet Regulus II in the Caledonia Cluster. He is a round, yellowish-green creature about the size of a big basketball. He stands on two spindly double-kneed legs and has five double-elbowed arms spaced around his body. Fitzgerald has a large, toothless mouth and five eyes above each arm. At the top of his head is an eye without an eyelid. He is a little bit shy and nervous and speaks in a deep, respectful voice when Mr. Corrigan interviews him for an exhibition position with his zoo. Fitzgerald demonstrates his knowledge of the requirements and benefits of the position and accepts the lower pay of $50 Galactic per week purely because he considers himself a Terraphile and wants nothing more than to see Earth. In fact, he loves Earth so much that he shed his Regulan name and took on the name of Lawrence Raymond Fitzgerald. The Regulan gesture for an apologetic smile involves closing the eyes and turning around 360-degrees, which Fitzgerald does when he reveals the truth about his name to Mr. Corrigan. Corrigan is so pleased with Mr. Fitzgerald that he hires him immediately for the show, and Fitzgerald claps his many hands in celebration."
              },
              {
                "worker_id": "2",
                "uid": "ef88bf683be64fd68c6c988c624f28a9",
                "response_text": "Lawrence Raymond Fitzgerald is the first alien that Corrigan interviews. He is a creature from Regulus II, a basketball-sized, yellow-green globular being with five double-elbowed arms, two double-kneed legs, five eyes, and a gaping, toothless mouth. Fitzgerald boldly declares that he is a Terraphile and has changed his name for that reason. He also states that he needs no special care and is not a fugitive from any world law, showing that he would not be a burden if he is hired. He says he understands the terms, which involve being placed on exhibition for a maximum of one-third of each sidereal Terran day in exchange for transportation and expenses, terms that he is happy to accept. Corrigan hires him on the spot for $50 Galactic per week, which is half their usual rate. Fitz, of course, doesn’t know this, but is thrilled to be hired and accepts the offer immediately. \n"
              }
            ]
          },
          {
            "question_text": "Who is Gorb and what happens to him in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "10",
                "uid": "a7f565ae5ede4db6983127542cfd1675",
                "response_text": "Ildwar Gorb is a human-looking alien of the planet Wazzenazz XIII in the Crab Nebula. He claims to have never been within “a dozen parsecs of Earth,” but to look so human-like due to an evolutionary fluke. As he is interviewing with Mr. Corrigan, he says he is not actually speaking, but is a telepathic that communicates in symbols that are translated into the colloquial speech of the person he is interacting with.\nHe appeals to Mr. Corrigan to be exhibited as a specimen, but when Corrigan in unconvinced Gorb isn’t just a regular human trying to fool him, he also tries to appeal to him to hire him as a member of his human staff. This is also a no, since Mr. Corrigan would be breaking the law to do so if he was an alien.\nGorb throws himself at Mr. Corrigan to tackle him and save his life from a murder attempt by the Stortulian. This gesture buys him enough goodwill for Corrigan to accept his offer to get him out of the trouble with the Ghrynian cops. He will do the job for $5000 and a contract to the Corrigan Institute - ultimately getting him what he wanted in the first place.\n"
              },
              {
                "worker_id": "6",
                "uid": "011f026b8e7f4821a9cc45e28768dac0",
                "response_text": "Gorb is a tall, thin humanoid or man with blue eyes and sandy hair. Despite being well-dressed and clean, Mr. Corrigan still claims he was shabby-looking. He introduces himself as Ildwar Gorb and claims he’s from the planet Wazzenazz XIII. Mr. Corrigan immediately believes he is simply an Earthman who ran out of money and is trying to find passage home. However, Gorb continues on, claiming Wazzenazz XIII is home to a race of people similar to that of Earth, and that he doesn’t speak English, he’s in fact telepathic. He asks to be a specimen in Corrigan’s zoo, but he refuses and sends him away. \nLater in the story, Gorb arrives again, having sneaked back his guard, and asks to join his staff if he can’t be a specimen. Corrigan admits Stebbins is lack-luster, but still turns him down. After the Kallerian kills himself and Mr. Corrigan is charged guilty, Gorb bides his time and waits for his moment to step in. When the Stortulian arrives and attempts to murder Mr. Corrigan, Gorb saves his life by pushing him out of the way of the blast. Gorb explains the difference between Kallerian and Stortulian cultures to a wide-eyed Mr. Corrigan and once again offers his services. He claims he can get Mr. Corrigan out of the legal mess for only a $5,000 fee and a contract to be a specimen in his zoo. Mr. Corrigan hesitantly agrees. \n"
              },
              {
                "worker_id": "8",
                "uid": "e9042ed21496426ca1a5513382b0169f",
                "response_text": "Ildwar Gorb is a non-terrestrial from the planet Wazzenazz XIII, a small planet in the Crab Nebula. He is tall and thin with pale blue eyes, dirty-blond hair, and he strongly resembles an Earthman; he even speaks in Terran accents and has human-like teeth. When he first meets Corrigan, he is clean and well-dressed, but Corrigan notes he looks a bit shabby. Although he has never been anywhere close to Earth, he tells Corrigan his race is identical to the human race and speaks through telepathic projection, and he is looking for a job with Corrigan's zoo, which he calls a \"circus.\" Corrigan is attracted to his glib personality, but he denies him a job because he believes he is an Earthman attempting to con him for a free trip back to Earth. When Gorb leaves, he implores Corrigan to reconsider and tells him he will be back. After several dozen interviews pass, Gorb returns and asks if Corrigan will give him Stebbins' job considering his incompetence in handling bothersome aliens throughout the day. When Corrigan again refuses, Gorb stays in his office as Heraal kills himself in front of them, the Ghrynian policemen enter and charge Corrigan with his death, and the Stortulian comes back and tries to shoot Corrigan. However, Gorb tackles Corrigan to the floor to prevent him from being shot. He predicted the Stortulian's action as he is familiar with their species, and he offers to help Corrigan out of his liability for the death of Heraal in exchange for $5,000 Galactic and a contract with the Institute. "
              },
              {
                "worker_id": "2",
                "uid": "ef88bf683be64fd68c6c988c624f28a9",
                "response_text": "Gorb is a human who wants to return to Earth but seemingly can’t afford to do so. He knows how to take advantage of situations, so he tries three approaches to get Corrigan to hire him and take him to Earth. First, he poses as an alien species from a planet called Wazzenazz XIII in the Crab Nebula. Gord is tall and slender with blue eyes and dirty blond hair. He is neat and clean, but his appearance is somewhat shabby, suggesting he might be down on his luck. He claims his name is Ildwar Gorb and that he represents the only humanlike race in the galaxy beyond Earth. He tries to con Corrigan, explaining his humanlike appearance as an evolutionary fluke and his English as telepathic symbols that Corrigan translates into English. Corrigan sees through the ruse, though, and refuses to hire Gorb. Gorb leaves Corrigan’s office saying he’ll give Corrigan another chance.\n\tThat afternoon, Gorb returns to Corrigan’s office, this time setting aside his alien story and presenting himself as a human applying for a place on Corrigan’s staff. He points out that he is familiar with alien life-forms, having lived in the outworlds for half of his life. Gorb says that he would have been able to stop the aliens who unexpectedly entered Corrigan’s office and suggests Corrigan fire Stebbins and hire him in his place. \n\tGorb is present when Heraal returns and commits suicide in Corrigan’s office, and when the police arrive telling Corrigan that they are arresting him for contributing to the untimely death of an intelligent life-form, he hears the police pronounce Corrigan’s penalty of either two years in prison or a fine of $100,000 Galactic. When the Stortulian arrives and tries to shoot Corrigan, Gorb anticipates his action and tackles Corrigan, knocking him to the floor, so that the Stortulian’s shot misses. Afterward, Gorb demonstrates his knowledge of alien life when he explains that Stortulians despise suicide, and when a Stortulian believes someone has caused him trouble, he kills the person who caused the trouble. Gorb also tells Corrigan that he can help him get out of his situation for only $5,000 Galactic and a specimen contract. Corrigan decides that Gorb might be able to help him better than the Terran Consulate, so he accepts Gorb’s offer contingent on Gorb’s success of getting him out of his arrest and fine.\n"
              }
            ]
          },
          {
            "question_text": "Who is Mr. Corrigan and what is his personality like?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "10",
                "uid": "a7f565ae5ede4db6983127542cfd1675",
                "response_text": "Mr. Corrigan was an impoverished carnival man in the Betelgeuse system prior to the year 2903, when the World Congress made it illegal for aliens to travel to the planet Earth. He seized a business opportunity to open Corrigan’s Institute and collect aliens as scientific specimens, charging humans money to see them on Earth. This turned out to be a very lucrative business, and the zoo was very popular.\n\nMr. Corrigan tries to be fair to those he is interviewing, but is having an exceptionally hard day that is straining his patience. He does not allow himself to be swayed or pushed around by the sad stories (the Stortulian) or the demands (Heraal) of those in the interviews. He is resolved in his assumptions, and is truly shocked when the outcome of who would commit suicide and who would attempt to kill him is revealed.\n\n"
              },
              {
                "worker_id": "6",
                "uid": "011f026b8e7f4821a9cc45e28768dac0",
                "response_text": "Mr. Corrigan is an Earthman and the presumed founder of the Corrigan Institute of Morphological Science. He travels between planets in order to find rare specimens and bring them back to Earth to showcase in his zoo. He is a businessman at heart and does not feel much or any remorse when turning desperate aliens down. He is also a conman and easily scams Mr. Fitzgerald out of half of his pay after seeing how eager he was to experience Earth. Mr. Corrigan is always looking for the easy way out, but he’s still aware of the dangers he faces. He keeps an array of weapons hidden beneath his desk in case of a violent specimen as well as a distress button if things were to go south. "
              },
              {
                "worker_id": "8",
                "uid": "e9042ed21496426ca1a5513382b0169f",
                "response_text": "Mr. J.F. Corrigan is the proprietor of Corrigan's Institute of Morphological Science, a Terran zoo exhibiting non-terrestrial beings from around the universe. Starting out as an impoverished carnival man working in the Betelgeuse system, Corrigan had taken advantage of the isolationism of the late 29th century to establish his zoo and become a successful businessman. Corrigan claims to not want to exploit the non-terrestrials he employs as displays in his zoo, but he also doesn't want to pay them top dollar for their services. He prides himself on not hunting non-terrestrial and instead prefers to attract them by offering good pay, short hours, expenses, and transportation costs; in addition, he calls himself a \"man of principles\" and advertises about the thrill of show business and romance of life on Earth. Because Corrigan is willing to con the public--he calls himself \"a straightforward double-dealer\"--he believes he understands a con when he sees one, which is why he initially rejects Gorb's interview for a job. Corrigan is used to dealing with species from all over the galaxy, and he is prepared for trouble, so he has a meshgun trigger concealed below his desk and never allows himself to be bullied. In case he needs back up, he also employs Stebbins, who manages the line of non-terrestrials for Corrigan to interview, as well as Auchinleck and Ludlow. One of Corrigan's driving principles in dealing with non-terrestrials is to never make a business decision based upon sentiment as demonstrated by his dealings with the Stortulian. However, this interaction shows that he does feel empathy for those affected by his decisions."
              },
              {
                "worker_id": "2",
                "uid": "ef88bf683be64fd68c6c988c624f28a9",
                "response_text": "J.F. Corrigan is a businessman and owner of the Corrigan Institute of Morphological Science. An astute businessman who also manipulates and uses others, he has built a lucrative “institute” that is really just a zoo that exhibits odd-looking aliens. Before his current position, Corrigan was a lowly carnival man in the Betelgeuse system. After the World Congress ruled Terra off-limits for aliens in 2903, Corrigan concocted his business plan. His goal is to display representatives of 500 extraterrestrial species. Corrigan can “read” his interviewees and take advantage of them for his own benefit. For example, when he realizes how eager Mr. Fitzgerald is to see Earth, he hires him for half of what he usually pays, knowing that Fitzgerald’s eagerness will prevent him from realizing the offer takes advantage of him. \n\tThroughout the day of interviews, Corrigan assesses the applicants in terms of their value to him. While he doesn’t mind taking advantage of them, he doesn’t go so far as to cheat them. He is a bit of a con-man himself, hiring Mr. Fitz for half his going rate and placating Heraal with a less-than-heartfelt apology and promise to give members of his clan preference the next time they need to hire a Kallerian. Yet he won’t do anything that blatantly breaks the law such as transporting a Stortulian to Earth when the alien isn’t one of his hirees. He has a limited conscience; when he fears that the Stortulian will commit suicide, he feels bad about it, but he also doesn’t do anything to prevent it. His pragmatism and business acumen override his emotions, preventing him from caving to the creature’s requests, even if it means the creature will commit suicide. Corrigan is also sharp enough to spot a con; he recognizes Gorb for what he is: an Earthman using any means possible to obtain a paid trip to Earth. When Gorb comes across as glib and appealing despite his preposterous story, Corrigan recognizes the man’s similarity to himself. Corrigan acknowledges that he is a double-dealer yets describes himself as a man of principles. Because he is a con man, he is cynical of others. Corrigan is also a manipulator who says what others want to hear (such as calling the planet Ghryne by its native name) because he knows this is a way to win their trust.\n\tCorrigan likes to think of himself as a man who has principles, but some of those principles are the ones that ensure good business decisions rather than the values regarding what is right or wrong. He also thinks of himself as a man with a conscience who doesn’t exploit beings, but that is exactly what he does. He believes that because he pays his employees and they are volunteering to be placed on exhibit, he isn’t exploiting them.\n\n"
              }
            ]
          },
          {
            "question_text": "Describe the settings the story takes place in.",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "10",
                "uid": "a7f565ae5ede4db6983127542cfd1675",
                "response_text": "The story takes place during a single day in Mr. Corrigan’s rented office on the planet Ghryne some time after the year 2903. His office has a desk, chairs for his interviewees to sit in, and a sign advertising that extraterrestrials are wanted. There is a waiting room outside the office, and applicants are buzzed in by Corrigan’s assistant.\n\nOn this planet, there is a strong desire for aliens to want to go on exhibit on Earth. Mr. Corrigan profits from having them on display, and is willing to go through long and stressful interview days to hand select his specimens. His desire is to have at least 500 different alien races in his collection.\n\nThere is frequent reference to the location of the Corrigan Institute on Earth, though it is never visited in the story. The Institute is very popular with humans, and has 690 specimens, representing 298 different types of aliens.\n"
              },
              {
                "worker_id": "6",
                "uid": "011f026b8e7f4821a9cc45e28768dac0",
                "response_text": "Birds of a Feather by Robert Silverberg takes place on what is commonly called Ghryne, or it’s more formal name MacTavish IV. This planet is in the Caledonia cluster and currently the home of Mr. Corrigan’s interviews. The Caledonia cluster is one of the many crossroads of interstellar travel, so it features many specimens from a variety of planets. The story mostly takes place in Mr. Corrigan’s office, featuring a desk and a few chairs for his specimens to sit in. He hides weapons beneath his desk in case of a scary situation, as well as a distress button. "
              },
              {
                "worker_id": "8",
                "uid": "e9042ed21496426ca1a5513382b0169f",
                "response_text": "The story takes place in the 30th century primarily on Ghryne, whose official Terran name is MacTavish IV, a planet in the Caledonia Cluster, which includes other planets such as Aldebaran IX, Regulus II, Donovan's Planet, Stortul XII, and more. Ghryne is in the heart of the Caledonia Cluster, where the interstellar crossroads meet, and Mr. Corrigan holds his interviews here for his Corrigan Institute from Thirdday to Fifthday of Tenthmonth. Having been declared off-limits for non-terrestrial beings by the World Congress in 2903, Earth is now an exclusive place to be, which heightens the appeal and romance of working and visiting there. The Corrigan Institute of Morphological Science is a Terran zoo that exhibits non-terrestrial beings from all over the universe. With 690 specimens representing 298 different intelligent life-forms, the ultimate goal of the zoo is to present at least one member of at least 500 different races. Corrigan has a desk equipped with a meshgun trigger that keeps him safe in the event a non-terrestrial becomes hostile towards him."
              },
              {
                "worker_id": "2",
                "uid": "ef88bf683be64fd68c6c988c624f28a9",
                "response_text": "The story takes place sometime in the early 30th century as Corrigan’s ad announces this recruiting trip is his last in the Caledonia Cluster until 2937. Days and months are named by their sequence in the week or year, hence, Thirdday, Fifthday, and Tenmonth. In 2903, the World Congress ruled that aliens were forbidden on Earth unless they were there as a specimen of a scientific collection. This exception is what allows Corrigan to conduct his lucrative business. Most of the story is set In the rented Corrigan office on the planet MacTavis (IV), or Ghryne according to its residents. All of the action takes place on this planet, although there are a few references to Earth. MacTavis (IV) is an ideal planet for Corrgan’s interviews since this planet is at the interstellar crossroads, making it easily accessible for aliens from across the Caledonia Cluster to respond to Corrigan’s ad for alien species to be transported to Earth for display. The planet has the features of a civilization, including city districts organized into blocks, office buildings, and hotels. There is a police department that quickly responds to emergencies and has set penalties for infractions against the law. Ghryne uses the Galactic monetary system. Corrigan’s office has a modern executive set-up where he works in an inner office while his assistants manage his appointments. He has a button he can push to alert his team that they need to escort someone away from his office. Corrigan also has a meshgun mounted under his desk that he can fire in the event of an emergency.  \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5164,
        "document_length_chars": 29585
      }
    }
  ]
}