{
  "item_metadata": {
    "item_id": "51362",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51362",
      "content": "LEX\n \n \n By W. T. HAGGERT\n \n Illustrated by WOOD\n \n [Transcriber's Note: This etext was produced from Galaxy Magazine August 1959. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n Nothing in the world could be happier and mere serene than a man who loves his work—but what happens when it loves him back?\n \n\n \n Keep your nerve, Peter Manners told himself; it's only a job. But nerve has to rest on a sturdier foundation than cash reserves just above zero and eviction if he came away from this interview still unemployed. Clay, at the Association of Professional Engineers, who had set up the appointment, hadn't eased Peter's nervousness by admitting, \"I don't know what in hell he's looking for. He's turned down every man we've sent him.\"\n \n The interview was at three. Fifteen minutes to go. Coming early would betray overeagerness. Peter stood in front of the Lex Industries plant and studied it to kill time. Plain, featureless concrete walls, not large for a manufacturing plant—it took a scant minute to exhaust its sightseeing potential. If he walked around the building, he could, if he ambled, come back to the front entrance just before three.\n \n He turned the corner, stopped, frowned, wondering what there was about the building that seemed so puzzling. It could not have been plainer, more ordinary. It was in fact, he only gradually realized, so plain and ordinary that it was like no other building he had ever seen.\n \n There had been windows at the front. There were none at the side, and none at the rear. Then how were the working areas lit? He looked for the electric service lines and found them at one of the rear corners. They jolted him. The distribution transformers were ten times as large as they should have been for a plant this size.\n \n Something else was wrong. Peter looked for minutes before he found out what it was. Factories usually have large side doorways for employees changing shifts. This building had one small office entrance facing the street, and the only other door was at the loading bay—big enough to handle employee traffic, but four feet above the ground. Without any stairs, it could be used only by trucks backing up to it. Maybe the employees' entrance was on the third side.\n \n It wasn't.\n \n \n\n \n Staring back at the last blank wall, Peter suddenly remembered the time he had set out to kill. He looked at his watch and gasped. At a run, set to straight-arm the door, he almost fell on his face. The door had opened by itself. He stopped and looked for a photo-electric eye, but a soft voice said through a loudspeaker in the anteroom wall: \"Mr. Manners?\"\n \n \"What?\" he panted. \"Who—?\"\n \n \"You are Mr. Manners?\" the voice asked.\n \n He nodded, then realized he had to answer aloud if there was a microphone around; but the soft voice said: \"Follow the open doors down the hall. Mr. Lexington is expecting you.\"\n \n \"Thanks,\" Peter said, and a door at one side of the anteroom swung open for him.\n \n He went through it with his composure slipping still further from his grip. This was no way to go into an interview, but doors kept opening before and shutting after him, until only one was left, and the last of his calm was blasted away by a bellow from within.\n \n \"Don't stand out there like a jackass! Either come in or go away!\"\n \n Peter found himself leaping obediently toward the doorway. He stopped just short of it, took a deep breath and huffed it out, took another, all the while thinking, Hold on now; you're in no shape for an interview—and it's not your fault—this whole setup is geared to unnerve you: the kindergarten kid called in to see the principal.\n \n He let another bellow bounce off him as he blew out the second breath, straightened his jacket and tie, and walked in as an engineer applying for a position should.\n \n \"Mr. Lexington?\" he said. \"I'm Peter Manners. The Association—\"\n \n \"Sit down,\" said the man at the desk. \"Let's look you over.\"\n \n He was a huge man behind an even huger desk. Peter took a chair in front of the desk and let himself be inspected. It wasn't comfortable. He did some looking over of his own to ease the tension.\n \n The room was more than merely large, carpeted throughout with a high-pile, rich, sound-deadening rug. The oversized desk and massive leather chairs, heavy patterned drapes, ornately framed paintings—by God, even a glass-brick manteled fireplace and bowls with flowers!—made him feel as if he had walked down a hospital corridor into Hollywood's idea of an office.\n \n His eyes eventually had to move to Lexington, and they were daunted for another instant. This was a citadel of a man—great girders of frame supporting buttresses of muscle—with a vaulting head and drawbridge chin and a steel gaze that defied any attempt to storm it.\n \n But then Peter came out of his momentary flinch, and there was an age to the man, about 65, and he saw the muscles had turned to fat, the complexion ashen, the eyes set deep as though retreating from pain, and this was a citadel of a man, yes, but beginning to crumble.\n \n \"What can you do?\" asked Lexington abruptly.\n \n \n\n \n Peter started, opened his mouth to answer, closed it again. He'd been jolted too often in too short a time to be stampeded into blurting a reply that would cost him this job.\n \n \"Good,\" said Lexington. \"Only a fool would try to answer that. Do you have any knowledge of medicine?\"\n \n \"Not enough to matter,\" Peter said, stung by the compliment.\n \n \"I don't mean how to bandage a cut or splint a broken arm. I mean things like cell structure, neural communication—the basics of how we live.\"\n \n \"I'm applying for a job as engineer.\"\n \n \"I know. Are you interested in the basics of how we live?\"\n \n Peter looked for a hidden trap, found none. \"Of course. Isn't everyone?\"\n \n \"Less than you think,\" Lexington said. \"It's the preconceived notions they're interested in protecting. At least I won't have to beat them out of you.\"\n \n \"Thanks,\" said Peter, and waited for the next fast ball.\n \n \"How long have you been out of school?\"\n \n \"Only two years. But you knew that from the Association—\"\n \n \"No practical experience to speak of?\"\n \n \"Some,\" said Peter, stung again, this time not by a compliment. \"After I got my degree, I went East for a post-graduate training program with an electrical manufacturer. I got quite a bit of experience there. The company—\"\n \n \"Stockpiled you,\" Lexington said.\n \n Peter blinked. \"Sir?\"\n \n \"Stockpiled you! How much did they pay you?\"\n \n \"Not very much, but we were getting the training instead of wages.\"\n \n \"Did that come out of the pamphlets they gave you?\"\n \n \"Did what come out—\"\n \n \"That guff about receiving training instead of wages!\" said Lexington.\n\"Any company that really wants bright trainees will compete for them with money—cold, hard cash, not platitudes. Maybe you saw a few of their products being made, maybe you didn't. But you're a lot weaker in calculus than when you left school, and in a dozen other subjects too, aren't you?\"\n \n \"Well, nothing we did on the course involved higher mathematics,\" Peter admitted cautiously, \"and I suppose I could use a refresher course in calculus.\"\n \n \"Just as I said—they stockpiled you, instead of using you as an engineer. They hired you at a cut wage and taught you things that would be useful only in their own company, while in the meantime you were getting weaker in the subjects you'd paid to learn. Or are you one of these birds that had the shot paid for him?\"\n \n \"I worked my way through,\" said Peter stiffly.\n \n \"If you'd stayed with them five years, do you think you'd be able to get a job with someone else?\"\n \n Peter considered his answer carefully. Every man the Association had sent had been turned away. That meant bluffs didn't work. Neither, he'd seen for himself, did allowing himself to be intimidated.\n \n \"I hadn't thought about it,\" he said. \"I suppose it wouldn't have been easy.\"\n \n \"Impossible, you mean. You wouldn't know a single thing except their procedures, their catalogue numbers, their way of doing things. And you'd have forgotten so much of your engineering training, you'd be scared to take on an engineer's job, for fear you'd be asked to do something you'd forgotten how to do. At that point, they could take you out of the stockpile, put you in just about any job they wanted, at any wage you'd stand for, and they'd have an indentured worker with a degree—but not the price tag. You see that now?\"\n \n \n\n \n It made Peter feel he had been suckered, but he had decided to play this straight all the way. He nodded.\n \n \"Why'd you leave?\" Lexington pursued, unrelenting.\n \n \"I finished the course and the increase they offered on a permanent basis wasn't enough, so I went elsewhere—\"\n \n \"With your head full of this nonsense about a shortage of engineers.\"\n \n Peter swallowed. \"I thought it would be easier to get a job than it has been, yes.\"\n \n \"They start the talk about a shortage and then they keep it going. Why? So youngsters will take up engineering thinking they'll wind up among a highly paid minority. You did, didn't you?\"\n \n \"Yes, sir.\"\n \n \"And so did all the others there with you, at school and in this stockpiling outfit?\"\n \n \"That's right.\"\n \n \"Well,\" said Lexington unexpectedly, \"there is a shortage! And the stockpiles are the ones who made it, and who keep it going! And the hell of it is that they can't stop—when one does it, they all have to, or their costs get out of line and they can't compete. What's the solution?\"\n \n \"I don't know,\" Peter said.\n \n Lexington leaned back. \"That's quite a lot of admissions you've made. What makes you think you're qualified for the job I'm offering?\"\n \n \"You said you wanted an engineer.\"\n \n \"And I've just proved you're less of an engineer than when you left school. I have, haven't I?\"\n \n \"All right, you have,\" Peter said angrily.\n \n \"And now you're wondering why I don't get somebody fresh out of school. Right?\"\n \n Peter straightened up and met the old man's challenging gaze. \"That and whether you're giving me a hard time just for the hell of it.\"\n \n \"Well, am I?\" Lexington demanded.\n \n Looking at him squarely, seeing the intensity of the pain-drawn eyes, Peter had the startling feeling that Lexington was rooting for him!\n\"No, you're not.\"\n \n \"Then what am I after?\"\n \n \"Suppose you tell me.\"\n \n So suddenly that it was almost like a collapse, the tension went out of the old man's face and shoulders. He nodded with inexpressible tiredness. \"Good again. The man I want doesn't exist. He has to be made—the same as I was. You qualify, so far. You've lost your illusions, but haven't had time yet to replace them with dogma or cynicism or bitterness. You saw immediately that fake humility or cockiness wouldn't get you anywhere here, and you were right. Those were the important things. The background data I got from the Association on you counted, of course, but only if you were teachable. I think you are. Am I right?\"\n \n \"At least I can face knowing how much I don't know,\" said Peter, \"if that answers the question.\"\n \n \"It does. Partly. What did you notice about this plant?\"\n \n In precis form, Peter listed his observations: the absence of windows at sides and rear, the unusual amount of power, the automatic doors, the lack of employees' entrances.\n \n \"Very good,\" said Lexington. \"Most people only notice the automatic doors. Anything else?\"\n \n \"Yes,\" Peter said. \"You're the only person I've seen in the building.\"\n \n \"I'm the only one there is.\"\n \n Peter stared his disbelief. Automated plants were nothing new, but they all had their limitations. Either they dealt with exactly similar products or things that could be handled on a flow basis, like oil or water-soluble chemicals. Even these had no more to do than process the goods.\n \n \"Come on,\" said Lexington, getting massively to his feet. \"I'll show you.\"\n \n \n\n \n The office door opened, and Peter found himself being led down the antiseptic corridor to another door which had opened, giving access to the manufacturing area. As they moved along, between rows of seemingly disorganized machinery, Peter noticed that the factory lights high overhead followed their progress, turning themselves on in advance of their coming, and going out after they had passed, keeping a pool of illumination only in the immediate area they occupied. Soon they reached a large door which Peter recognized as the inside of the truck loading door he had seen from outside.\n \n Lexington paused here. \"This is the bay used by the trucks arriving with raw materials,\" he said. \"They back up to this door, and a set of automatic jacks outside lines up the trailer body with the door exactly. Then the door opens and the truck is unloaded by these materials handling machines.\"\n \n Peter didn't see him touch anything, but as he spoke, three glistening machines, apparently self-powered, rolled noiselessly up to the door in formation and stopped there, apparently waiting to be inspected.\n \n They gave Peter the creeps. Simple square boxes, set on casters, with two arms each mounted on the sides might have looked similar. The arms, fashioned much like human arms, hung at the sides, not limply, but in a relaxed position that somehow indicated readiness.\n \n Lexington went over to one of them and patted it lovingly. \"Really, these machines are only an extension of one large machine. The whole plant, as a matter of fact, is controlled from one point and is really a single unit. These materials handlers, or manipulators, were about the toughest things in the place to design. But they're tremendously useful. You'll see a lot of them around.\"\n \n Lexington was about to leave the side of the machine when abruptly one of the arms rose to the handkerchief in his breast pocket and daintily tugged it into a more attractive position. It took only a split second, and before Lexington could react, all three machines were moving away to attend to mysterious duties of their own.\n \n \n\n \n Peter tore his eyes away from them in time to see the look of frustrated embarrassment that crossed Lexington's face, only to be replaced by one of anger. He said nothing, however, and led Peter to a large bay where racks of steel plate, bar forms, nuts, bolts, and other materials were stored.\n \n \"After unloading a truck, the machines check the shipment, report any shortages or overages, and store the materials here,\" he said, the trace of anger not yet gone from his voice. \"When an order is received, it's translated into the catalogue numbers used internally within the plant, and machines like the ones you just saw withdraw the necessary materials from stock, make the component parts, assemble them, and package the finished goods for shipment. Simultaneously, an order is sent to the billing section to bill the customer, and an order is sent to our trucker to come and pick the shipment up. Meanwhile, if the withdrawal of the materials required has depleted our stock, the purchasing section is instructed to order more raw materials. I'll take you through the manufacturing and assembly sections right now, but they're too noisy for me to explain what's going on while we're there.\"\n \n \n\n \n Peter followed numbly as Lexington led him through a maze of machines, each one seemingly intent on cutting, bending, welding, grinding or carrying some bit of metal, or just standing idle, waiting for something to do. The two-armed manipulators Peter had just seen were everywhere, scuttling from machine to machine, apparently with an exact knowledge of what they were doing and the most efficient way of doing it.\n \n He wondered what would happen if one of them tried to use the same aisle they were using. He pictured a futile attempt to escape the onrushing wheels, saw himself clambering out of the path of the speeding vehicle just in time to fall into the jaws of the punch press that was laboring beside him at the moment. Nervously, he looked for an exit, but his apprehension was unnecessary. The machines seemed to know where they were and avoided the two men, or stopped to wait for them to go by.\n \n Back in the office section of the building, Lexington indicated a small room where a typewriter could be heard clattering away. \"Standard business machines, operated by the central control mechanism. In that room,\" he said, as the door swung open and Peter saw that the typewriter was actually a sort of teletype, with no one before the keyboard, \"incoming mail is sorted and inquiries are replied to. In this one over here, purchase orders are prepared, and across the hall there's a very similar rig set up in conjunction with an automatic bookkeeper to keep track of the pennies and to bill the customers.\"\n \n \"Then all you do is read the incoming mail and maintain the machinery?\" asked Peter, trying to shake off the feeling of open amazement that had engulfed him.\n \n \"I don't even do those things, except for a few letters that come in every week that—it doesn't want to deal with by itself.\"\n \n The shock of what he had just seen was showing plainly on Peter's face when they walked back into Lexington's office and sat down. Lexington looked at him for quite a while without saying anything, his face sagging and pale. Peter didn't trust himself to speak, and let the silence remain unbroken.\n \n Finally Lexington spoke. \"I know it's hard to believe, but there it is.\"\n \n \"Hard to believe?\" said Peter. \"I almost can't. The trade journals run articles about factories like this one, but planned for ten, maybe twenty years in the future.\"\n \n \"Damn fools!\" exclaimed Lexington, getting part of his breath back.\n\"They could have had it years ago, if they'd been willing to drop their idiotic notions about specialization.\"\n \n Lexington mopped his forehead with a large white handkerchief. Apparently the walk through the factory had tired him considerably, although it hadn't been strenuous.\n \n \n\n \n He leaned back in his chair and began to talk in a low voice completely in contrast with the overbearing manner he had used upon Peter's arrival. \"You know what we make, of course.\"\n \n \"Yes, sir. Conduit fittings.\"\n \n \"And a lot of other electrical products, too. I started out in this business twenty years ago, using orthodox techniques. I never got through university. I took a couple of years of an arts course, and got so interested in biology that I didn't study anything else. They bounced me out of the course, and I re-entered in engineering, determined not to make the same mistake again. But I did. I got too absorbed in those parts of the course that had to do with electrical theory and lost the rest as a result. The same thing happened when I tried commerce, with accounting, so I gave up and started working for one of my competitors. It wasn't too long before I saw that the only way I could get ahead was to open up on my own.\"\n \n Lexington sank deeper in his chair and stared at the ceiling as he spoke. \"I put myself in hock to the eyeballs, which wasn't easy, because I had just got married, and started off in a very small way. After three years, I had a fairly decent little business going, and I suppose it would have grown just like any other business, except for a strike that came along and put me right back where I started. My wife, whom I'm afraid I had neglected for the sake of the business, was killed in a car accident about then, and rightly or wrongly, that made me angrier with the union than anything else. If the union hadn't made things so tough for me from the beginning, I'd have had more time to spend with my wife before her death. As things turned out—well, I remember looking down at her coffin and thinking that I hardly knew the girl.\n \n \"For the next few years, I concentrated on getting rid of as many employees as I could, by replacing them with automatic machines. I'd design the control circuits myself, in many cases wire the things up myself, always concentrating on replacing men with machines. But it wasn't very successful. I found that the more automatic I made my plant, the lower my costs went. The lower my costs went, the more business I got, and the more I had to expand.\"\n \n Lexington scowled. \"I got sick of it. I decided to try developing one multi-purpose control circuit that would control everything, from ordering the raw materials to shipping the finished goods. As I told you, I had taken quite an interest in biology when I was in school, and from studies of nerve tissue in particular, plus my electrical knowledge, I had a few ideas on how to do it. It took me three years, but I began to see that I could develop circuitry that could remember, compare, detect similarities, and so on. Not the way they do it today, of course. To do what I wanted to do with these big clumsy magnetic drums, tapes, and what-not, you'd need a building the size of Mount Everest. But I found that I could let organic chemistry do most of the work for me.\n \n \"By creating the proper compounds, with their molecules arranged in predetermined matrixes, I found I could duplicate electrical circuitry in units so tiny that my biggest problem was getting into and out of the logic units with conventional wiring. I finally beat that the same way they solved the problem of translating a picture on a screen into electrical signals, developed equipment to scan the units cyclically, and once I'd done that, the battle was over.\n \n \"I built this building and incorporated it as a separate company, to compete with my first outfit. In the beginning, I had it rigged up to do only the manual work that you saw being done a few minutes ago in the back of this place. I figured that the best thing for me to do would be to turn the job of selling my stuff over to jobbers, leaving me free to do nothing except receive orders, punch the catalogue numbers into the control console, do the billing, and collect the money.\"\n \n \"What happened to your original company?\" Peter asked.\n \n \n\n \n Lexington smiled. \"Well, automated as it was, it couldn't compete with this plant. It gave me great pleasure, three years after this one started working, to see my old company go belly up. This company bought the old firm's equipment for next to nothing and I wound up with all my assets, but only one employee—me.\n \n \"I thought everything would be rosy from that point on, but it wasn't. I found that I couldn't keep up with the mail unless I worked impossible hours. I added a couple of new pieces of equipment to the control section. One was simply a huge memory bank. The other was a comparator circuit. A complicated one, but a comparator circuit nevertheless. Here I was working on instinct more than anything. I figured that if I interconnected these circuits in such a way that they could sense everything that went on in the plant, and compare one action with another, by and by the unit would be able to see patterns.\n \n \"Then, through the existing command output, I figured these new units would be able to control the plant, continuing the various patterns of activity that I'd already established.\"\n \n Here Lexington frowned. \"It didn't work worth a damn! It just sat there and did nothing. I couldn't understand it for the longest time, and then I realized what the trouble was. I put a kicker circuit into it, a sort of voltage-bias network. I reset the equipment so that while it was still under instructions to receive orders and produce goods, its prime purpose was to activate the kicker. The kicker, however, could only be activated by me, manually. Lastly, I set up one of the early TV pickups over the mail slitter and allowed every letter I received, every order, to be fed into the memory banks. That did it.\"\n \n \"I—I don't understand,\" stammered Peter.\n \n \"Simple! Whenever I was pleased that things were going smoothly, I pressed the kicker button. The machine had one purpose, so far as its logic circuits were concerned. Its object was to get me to press that button. Every day I'd press it at the same time, unless things weren't going well. If there had been trouble in the shop, I'd press it late, or maybe not at all. If all the orders were out on schedule, or ahead of time, I'd press it ahead of time, or maybe twice in the same day. Pretty soon the machine got the idea.\n \n \"I'll never forget the day I picked up an incoming order form from one of the western jobbers, and found that the keyboard was locked when I tried to punch it into the control console. It completely baffled me at first. Then, while I was tracing out the circuits to see if I could discover what was holding the keyboard lock in, I noticed that the order was already entered on the in-progress list. I was a long time convincing myself that it had really happened, but there was no other explanation.\n \n \"The machine had realized that whenever one of those forms came in, I copied the list of goods from it onto the in-progress list through the console keyboard, thus activating the producing mechanisms in the back of the plant. The machine had done it for me this time, then locked the keyboard so I couldn't enter the order twice. I think I held down the kicker button for a full five minutes that day.\"\n \n \"This kicker button,\" Peter said tentatively, \"it's like the pleasure center in an animal's brain, isn't it?\"\n \n \n\n \n When Lexington beamed, Peter felt a surge of relief. Talking with this man was like walking a tightrope. A word too much or a word too little might mean the difference between getting the job or losing it.\n \n \"Exactly!\" whispered Lexington, in an almost conspiratorial tone. \"I had altered the circuitry of the machine so that it tried to give me pleasure—because by doing so, its own pleasure circuit would be activated.\n \n \"Things went fast from then on. Once I realized that the machine was learning, I put TV monitors all over the place, so the machine could watch everything that was going on. After a short while I had to increase the memory bank, and later I increased it again, but the rewards were worth it. Soon, by watching what I did, and then by doing it for me next time it had to be done, the machine had learned to do almost everything, and I had time to sit back and count my winnings.\"\n \n At this point the door opened, and a small self-propelled cart wheeled silently into the room. Stopping in front of Peter, it waited until he had taken a small plate laden with two or three cakes off its surface. Then the soft, evenly modulated voice he had heard before asked, \"How do you like your coffee? Cream, sugar, both or black?\"\n \n Peter looked for the speaker in the side of the cart, saw nothing, and replied, feeling slightly silly as he did so, \"Black, please.\"\n \n A square hole appeared in the top of the cart, like the elevator hole in an aircraft carrier's deck. When the section of the cart's surface rose again, a fine china cup containing steaming black coffee rested on it. Peter took it and sipped it, as he supposed he was expected to do, while the cart proceeded over to Lexington's desk. Once there, it stopped again, and another cup of coffee rose to its surface.\n \n \n\n \n Lexington took the coffee from the top of the car, obviously angry about something. Silently, he waited until the cart had left the office, then snapped, \"Look at those bloody cups!\"\n \n Peter looked at his, which was eggshell thin, fluted with carving and ornately covered with gold leaf. \"They look very expensive,\" he said.\n \n \"Not only expensive, but stupid and impractical!\" exploded Lexington.\n\"They only hold half a cup, they'll break at a touch, every one has to be matched with its own saucer, and if you use them for any length of time, the gold leaf comes off!\"\n \n Peter searched for a comment, found none that fitted this odd outburst, so he kept silent.\n \n \n\n \n Lexington stared at his cup without touching it for a long while. Then he continued with his narrative. \"I suppose it's all my own fault. I didn't detect the symptoms soon enough. After this plant got working properly, I started living here. It wasn't a question of saving money. I hated to waste two hours a day driving to and from my house, and I also wanted to be on hand in case anything should go wrong that the machine couldn't fix for itself.\"\n \n Handling the cup as if it were going to shatter at any moment, he took a gulp. \"I began to see that the machine could understand the written word, and I tried hooking a teletype directly into the logic circuits. It was like uncorking a seltzer bottle. The machine had a funny vocabulary—all of it gleaned from letters it had seen coming in, and replies it had seen leaving. But it was intelligible. It even displayed some traces of the personality the machine was acquiring.\n \n \"It had chosen a name for itself, for instance—'Lex.' That shook me. You might think Lex Industries was named through an abbreviation of the name Lexington, but it wasn't. My wife's name was Alexis, and it was named after the nickname she always used. I objected, of course, but how can you object on a point like that to a machine? Bear in mind that I had to be careful to behave reasonably at all times, because the machine was still learning from me, and I was afraid that any tantrums I threw might be imitated.\"\n \n \"It sounds pretty awkward,\" Peter put in.\n \n \"You don't know the half of it! As time went on, I had less and less to do, and business-wise I found that the entire control of the operation was slipping from my grasp. Many times I discovered—too late—that the machine had taken the damnedest risks you ever saw on bids and contracts for supply. It was quoting impossible delivery times on some orders, and charging pirate's prices on others, all without any obvious reason. Inexplicably, we always came out on top. It would turn out that on the short-delivery-time quotations, we'd been up against stiff competition, and cutting the production time was the only way we could get the order. On the high-priced quotes, I'd find that no one else was bidding. We were making more money than I'd ever dreamed of, and to make it still better, I'd find that for months I had virtually nothing to do.\"\n \n \"It sounds wonderful, sir,\" said Peter, feeling dazzled.\n \n \"It was, in a way. I remember one day I was especially pleased with something, and I went to the control console to give the kicker button a long, hard push. The button, much to my amazement, had been removed, and a blank plate had been installed to cover the opening in the board. I went over to the teletype and punched in the shortest message I had ever sent. 'LEX—WHAT THE HELL?' I typed.\n \n \"The answer came back in the jargon it had learned from letters it had seen, and I remember it as if it just happened. 'MR. A LEXINGTON, LEX INDUSTRIES, DEAR SIR: RE YOUR LETTER OF THE THIRTEENTH INST., I AM PLEASED TO ADVISE YOU THAT I AM ABLE TO DISCERN WHETHER OR NOT YOU ARE PLEASED WITH MY SERVICE WITHOUT THE USE OF THE EQUIPMENT PREVIOUSLY USED FOR THIS PURPOSE. RESPECTFULLY, I MIGHT SUGGEST THAT IF THE PUSHBUTTON ARRANGEMENT WERE NECESSARY, I COULD PUSH THE BUTTON MYSELF. I DO NOT BELIEVE THIS WOULD MEET WITH YOUR APPROVAL, AND HAVE TAKEN STEPS TO RELIEVE YOU OF THE BURDEN INVOLVED IN REMEMBERING TO PUSH THE BUTTON EACH TIME YOU ARE ESPECIALLY PLEASED. I SHOULD LIKE TO TAKE THIS OPPORTUNITY TO THANK YOU FOR YOUR INQUIRY, AND LOOK FORWARD TO SERVING YOU IN THE FUTURE AS I HAVE IN THE PAST. YOURS FAITHFULLY, LEX'.\"",
      "metadata": {
        "title": "Lex",
        "author": "W. T. Haggert",
        "passage_id": "51362",
        "uid": "977f33f68a5640aeaef7ee221fd6b79c",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "107",
                "uid": "c5cf9b234e3c4af5918778589a91c2a1",
                "response_text": "Peter Manners is awaiting his job interview at Lex Industries. He is very nervous but also has to worry about still being unemployed with barely any money saved. Since he is fifteen minutes early, he decides to look around the manufacturing plant. Peter then goes to his interview, and a voice from a loudspeaker directs him down to the hall where Mr. Lexington is waiting. He goes in through the multiple doors, where Mr. Lexington greets him roughly and looks over his qualifications. The other man begins asking Peter questions, to which Peter responds but is confused about how they have any relation to his job application. Mr. Lexington tells Peter that he has been stockpiled at his last company, given skills that will only ever help that specific company and nowhere else. Mr. Lexington then tells Peter that he had just proven that he has fewer skills than when he was in school, but he is pleased by Peter’s performance in the interview so far nonetheless. He tells Peter that he is the only person in the building and makes Peter follow him. They go through the machinery, and they reach the inside of a loading truck. Mr. Lexington explains that this area is where raw materials are delivered and that he has small machines, part of a bigger machine, all working together to operate the factory. They go to the office section of the building, where there is a small typewriter working. A central control mechanism operates everything, and Mr. Lexington does not even have to deal with much mail at all each week. Mr. Lexington explains his own history working as an engineer and how he spent most of his time developing his machinery. Peter is amazed by all of the machinery, and he continues to discuss machine parts such as the kicker button with Mr. Lexington. Just as they keep talking, the door opens, and a self-propelled cart asks if he would like cream and sugar with his coffee. Mr. Lexington is angry about the cup, and he insults them as being impractical. He also further clarifies that Lex Industries is named after his wife Alexis’ nickname. The company continues to earn a lot of money, and he also does not need to monitor progress constantly. Mr. Lexington also mentions that when he was extremely pleased with progress one day, he went to the kicker button and found it removed. He asked the machine what was going on, and the machine sent him a long message detailing how it was aware of when he was pleased with the progress made and had relieved him of the burden of having to press it every time."
              },
              {
                "worker_id": "104",
                "uid": "207a94c447c74e98a67fa0f25dbc2b1a",
                "response_text": "Peter Manners is nervous about an interview that is about to begin. He tries to waste time so as not to appear too eager for the interview so he walks around the building to entertain himself. When he looks around the building he finds the building construction strange. He keeps going around the building growing more curious about its construction. He then frantically returns to the entrance after he realizes the time. Peter walks through the entrance and eventually makes it to Mr. Lexington’s office where he is commanded to enter and sit down. The interview begins and Peter starts off the interview well to Mr. Lexington’s acknowledgement. Peter tries to avoid being intimidated by Mr. Lexington’s quick and blunt questioning to prove himself worthy of receiving the job offer. As the interview continues, Peter begins to get frustrated and angry with Mr. Lexington’s line of questioning. During the interview, Mr. Lexington lets Peter know that he is the only worker in the building much to Peter’s amazement. \n\nMr. Lexington begins to lead Peter out of the office and they walk to the manufacturing area as the interview continues. He explains to Peter that he uses machines to unload the trucks. He continues to lead Peter to a large bay area where different materials are stored. While Mr. Lexington is enthusiastic about the machines, Peter seems to be very wary about them. He stops to ask what Mr. Lexington does if the machines take care of the job duties. Peter is shocked to learn that he does basically nothing. \n\nMr. Lexington then sits down and explains to Peter how the machines were created. He tells Peter that he created a new company with the single unit machinery that was more successful than his original company that focused on specialized machines. His new company was able to buy out his old company. He goes on to say that to help the single unit machine learn he created an incentive for it. The incentive was based on whether Mr. Lexington was happy with the performance of the machine or not. The machine eventually learned by watching what Mr. Lexington did and focuses on taking over more responsibilities to continue to give Mr. Lexington pleasure. The machine continued to increase its abilities and made risky decisions that proved to be very beneficial to the company. The story ends with Mr. Lexington relaying a story to Peter about how the machine eventually grew so savvy that it removed Mr. Lexington’s indicator for the machine that he was happy with its performance because the machine stated that it was able to discern his happiness without the button and thus no longer needed it. \n"
              },
              {
                "worker_id": "101",
                "uid": "abcdc8d4a8b949dd8464a7b26645e602",
                "response_text": "Peter Manners is an engineer in search of a job. He arrives at Lex Industries for an interview set up for him by the Association of Professional Engineers. Peter arrives early, so to kill time, he walks around the exterior of the building. He is perplexed by the building, namely due to the lack of windows, abundance of electricity, and no side entrance. As he enters through automatic doors for his interview, he is led to a large office where Mr. Lexington is waiting for him. Mr. Lexington first interrogates Peter with questions that all seem to have hidden traps, including questions about his previous job, where he suggests that Peter had been stockpiled. Mr. Lexington then reveals to Peter the true operations of Lex Industries; he is the only person in the factory, and the rest are machines. Mr. Lexington takes Peter on a tour of the factory, where he sees robots, called \"manipulators\", perform manufacturing, loading, and other business tasks. Mr. Lexington explains his journey with the machinery, telling Peter about his origins in engineering, including his late wife Alexis and his devotion to his work. Mr. Lexington had opened the current factory to be run by machinery, eventually overtaking his original company. A key piece of his success had been the use of a kicker button, which signaled pleasure to the robots and eventually got them to develop a sort of conscious. The robots had chosen the name \"Lex\" for themselves. Mr. Lexington then tells Peter that one day, he found the kicker button to be removed, and received a message from Lex that said they had learned to tell whether or not they were doing a good job without the button, and declared their faith and loyalty to him."
              },
              {
                "worker_id": "105",
                "uid": "d3dcd08300264f679d7103cc90fd775f",
                "response_text": "Peter Manners nervously awaits his job interview in front of the office's weird building. Finally, he enters a place with everything being automated and approaches Mr. Lexington, a huge man at a huge desk, the interviewer. The dialogue is hard, Mr. Lexington is straightforward and harsh in his questions, Peter thinks well and answers with caution but gets angry in the end. Eventually, he is accepted as he is found \"teachable\". Lexington gives Peter a tour around the manufacturing area, where everything is automated and done by machines. The building is filled with robots doing every kind of job, their abundance scares Peter and reminds of the articles about the future. Lexington tells the story of his business - without education in this field, he created the business and was expanding it, replacing people by robots. Eventually, he created a system without specialization controlling the whole process, with him being the only employee and doing almost nothing. The system called itself Lex in honor of Lexington's late wife Alexis, removed the kicker button and take charge of some things, making Lexington scared to lose control. "
              }
            ]
          },
          {
            "question_text": "Who is Mr. Lexington, and what traits does he demonstrate?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "107",
                "uid": "c5cf9b234e3c4af5918778589a91c2a1",
                "response_text": "Mr. Lexington is the owner of Lex Industries. He is the only person in the manufacturing plant. He is an eccentric but genius man who is surrounded by his machinery. Lexington started his business twenty years ago, and he never went through university despite having many interests. He gave up arts and biology, later re-entering through engineering. He also went through many stages, including commerce, accounting, and even working for a competitor. Lexington is especially interested in machine parts, which led him to begin firing employees and replacing them with automatic machines. His wife died in a car accident earlier, so he focused all of his attention on the machinery. By creating the central control system, he could give up his old company and build this new one. Although he is very rough towards Peter, he is also somewhat sympathetic to Peter’s past experiences and skills. He is very proud of his machinery and does not hesitate to show all of it to Peter."
              },
              {
                "worker_id": "104",
                "uid": "207a94c447c74e98a67fa0f25dbc2b1a",
                "response_text": "Mr. Lexington is the founder of Lex Industries. Peter describes him as having a large frame accompanied with large muscles. The first time that Peter meets Mr. Lexington, Mr. Lexington angrily yells for him to enter the office. It shows that Mr. Lexington can be very commanding. During the interview, Mr. Lexington asks questions trying in an attempt to be intimidating and trick Peter. He is quick to be angered and embarrassed, quickly showing his displeasure at any slightly upsetting situation. Besides his emotions, Mr. Lexington appears to tire easily after the walk through the building and his face shows his elderly age.  "
              },
              {
                "worker_id": "101",
                "uid": "abcdc8d4a8b949dd8464a7b26645e602",
                "response_text": "Mr. Lexington is the owner of Lex Industries, an electrical company. He is the overseer of all operations in the plant, and because of his success, incredibly wealthy. He is described as a large man, initially seeming to be unbreakable but then noted to have a somber, fragile expression. Mr. Lexington is confident and intimidating, evident in his interview with Peter Manners. He is knowledgable, not just about electrical engineering, but about biology, specifically cell structure and the foundations of living. Though Mr. Lexington approves of Peter, his temper is short, demonstrated when one of the robots adjusts his handkerchief as well as when he is brought coffee."
              },
              {
                "worker_id": "105",
                "uid": "d3dcd08300264f679d7103cc90fd775f",
                "response_text": "Mr. Lexington is a huge man of around 65 years. He is rich - his office is extremely modern and automated. He is very straightforward and harsh, he is also clever and strict, he makes others afraid of him. He loves machines and made everything automated in his office and manufacturing area. He is very demanding from employees. He criticizes the world system around. - the specialization, the stockpiling of graduates. He created the multi-purpose control circuit in his business as he wanted to replace all the workers with robots easily controlled, and he built the whole business by himself without education in the field. He has always been very concentrated on his job, paying it even more attention than to his late wife. He is very rational and practical, and he wants everything to be logical and perfect, even the coffee cups. He hates losing time so he started living at his work - very practical. "
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "107",
                "uid": "c5cf9b234e3c4af5918778589a91c2a1",
                "response_text": "The story is set at Lex Industries. The manufacturing plant has no employee doors, and there are no windows on the side and rear of the building. Peter goes through the many doors to reach the office. The office has a huge desk, a chair behind the desk, and a chair in front of it. The office also is also carpeted by a sound-deadening rug, massive leather chairs, framed paintings, expensive drapes, and even a glass-brick mantel fireplace. The plant is filled with machinery of all kinds, and there are factory lights that constantly shine on the machines that do work. There are many types of machines too, such as ones that look like a pair of hands and even a typewriter. "
              },
              {
                "worker_id": "104",
                "uid": "207a94c447c74e98a67fa0f25dbc2b1a",
                "response_text": "The story begins with Peter Manners standing in front of Lex Industries plant building. He inquisitively looks over the building and notices that it has a strange build. The building is a plain concrete wall with windows only on the front and not the sides or rear. \n\nWhen Peter returns to the entrance of the building he goes through a side door that automatically opens for him. He walks through many doors that open and close automatically for him until he reaches Mr. Lexington’s office. Mr. Lexington’s office was heavily decorated with carpet throughout and oversized furniture decorating it. During the interview, they leave Mr. Lexington’s office and go to explore the building. Mr. Lexington leads Peter through different areas of the plant and eventually to a maze of machines. Once they are done with the tour, they head towards the office section of the building to continue their discussion. \n"
              },
              {
                "worker_id": "101",
                "uid": "abcdc8d4a8b949dd8464a7b26645e602",
                "response_text": "The story takes place inside the Lex Industries factory plant. The exterior, as noted by Peter, is strange; there are no windows around the sides of the buildings, the electrical sources were abnormally large, and there was no side entrance for employees to use. The doors to the entrance are automatic, and they lead him to Mr. Lexington's office. His office is large and luxurious with lush decor, indicating his wealth. Mr. Lexington then shows Peter around the factory, where he sees the manufacturing area, the loading area, and the business area, all filled with countless robots performing duties."
              },
              {
                "worker_id": "105",
                "uid": "d3dcd08300264f679d7103cc90fd775f",
                "response_text": "The story begins outside the Lex Industries plant. The building is extremely plain from the outside with no windows on the sides, inside it's automated, with all the doors opening, lights turning on and off and a voice greeting the visitors. The building is empty inside, with only Mr. Lexington sitting at his huge table. There is a manufacturing area and truck doors inside, where everything is done by robots. In the office area there are rooms for sorting mail, other designated for bookkeeping and another one for purchase orders, all done by machines as well. "
              }
            ]
          },
          {
            "question_text": "Describe the significance of the machinery throughout the story.",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "107",
                "uid": "c5cf9b234e3c4af5918778589a91c2a1",
                "response_text": "The machinery is what keeps Lex Industries running and for Mr. Lexington to earn astronomical amounts of money continuously. It replaces the need for human workers and saves much of the costs that would have had to be distributed to workers. It is also the lifeline of Mr. Lexington’s work and the breakthrough of his research career. Peter considers the machinery to be ideas that are planned for ten to twenty years into the future. This makes the machinery even more impressive. The fact that an entire business can be operated with the central control system makes it even more significant in helping Mr. Lexington get ahead of his competitors."
              },
              {
                "worker_id": "104",
                "uid": "207a94c447c74e98a67fa0f25dbc2b1a",
                "response_text": "The machinery is very important to Mr. Lexington’s company. He uses them for all of the tasks necessary to run the company, such as unloading the trucks and the supply chain department. The machines helped Mr. Lexington grow his business and make more money. He didn’t like the specialization that many people focused on when creating machines to replace humans which is why he created a single unit taking inspiration from biology. They are modelled by the behavior of biology as Mr. Lexington is very fascinated by the subject. The machinery was able to increase its intelligence by learning from watching what Mr. Lexington did and taking over those responsibilities. The machine proved to become increasingly self-aware and intelligent to Mr. Lexington’s surprise. "
              },
              {
                "worker_id": "101",
                "uid": "abcdc8d4a8b949dd8464a7b26645e602",
                "response_text": "The machinery used at Lex Industries is the product of years of trial and error by Mr. Lexington to create the most profitable business model. He has designed the machinery to operate on one multi-purpose control circuit, and gradually taught the machines to remember, detect patters, and define success. The latter was accomplished using a \"kicker button\", which Mr. Lexington would press when he was pleased with the factory's operations. The machinery and its efficiency is what has made Lex Industries so successful; the short production time, fast shipping, and little labor. "
              },
              {
                "worker_id": "105",
                "uid": "d3dcd08300264f679d7103cc90fd775f",
                "response_text": "Machines are doing everything in Lex Industries, they replace every human job. Doors are opening by themselves, the lights turn on and off on their own as people go by. An automatic voice meets the visitors instead of a secretary. Bookkeeping, mail sorting, unloading trucks, checking the cargo, sorting it, and all other parts of production are made by robots. They are controlled by one main system of the plant, making it one automatic system. The machines fill the building and make it lonely, they scare Peter, while Lexington loves them. Such structure reminds Peter of the plans for the future, as other such offices do not exist. Machines deprive Lexington of any job at all for months and even take control sometimes, they even threaten his authority. "
              }
            ]
          },
          {
            "question_text": "What is the relationship between Mr. Lexington and Peter?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "107",
                "uid": "c5cf9b234e3c4af5918778589a91c2a1",
                "response_text": "Peter first meets Mr. Lexington at his interview. He finds the other man strange from the seemingly random questions that he asks. Mr. Lexington, however, becomes more interested in Peter when he is satisfied with the responses given. While the two of them are not close, Mr. Lexington does not dismiss him on the spot and instead takes him to tour the entire factory. He also elaborates on his life story to Peter, and he does have a certain degree of trust for the other man. On the other hand, Peter is very impressed by Mr. Lexington’s work and becomes more interested in how he has accomplished all of this in the time since he first began working on his business."
              },
              {
                "worker_id": "104",
                "uid": "207a94c447c74e98a67fa0f25dbc2b1a",
                "response_text": "Mr. Lexington is the owner of Lex Industries and is interviewing Peter who is seeking a job. Mr. Lexington has the power of being in control of the situation because his decision is what will give Peter a job or not. Peter is initially intimidated by Mr. Lexington but as the interview continues, Peter begins to no longer be intimidated by Mr. Lexington and is able to match his challenging gaze. As the interview continues, the two settle into a friendly conversation with Mr. Lexington relaying stories about the growth of the machine’s intelligence. "
              },
              {
                "worker_id": "101",
                "uid": "abcdc8d4a8b949dd8464a7b26645e602",
                "response_text": "Peter is intimidated by Mr. Lexington throughout the story; he views him as a powerful, wealthy, angry man, though he warms up to him gradually. Peter makes several remarks throughout the interview to win Mr. Lexington's approval. First, he doesn't answer when Mr. Lexington asks him what he can do. He additionally notes his observations of the outside of the building. Peter presents himself as a man capable of learning the ways of Lex Industries, which Mr. Lexington likes. However, despite this approval, Mr. Lexington still challenges Peter's thinking and statements, assuring himself as the superior."
              },
              {
                "worker_id": "105",
                "uid": "d3dcd08300264f679d7103cc90fd775f",
                "response_text": "Peter is willing to work for Mr. Lexington's company. Getting the job is vital for him, he will be evicted if he doesn't get it. After what he has heard, Peter is scared of the man, he is cautious in his words, though sometimes he can't control his anger and confusion. Lexington sees Peter as a teachable young man and prefers him to previous ones, though he doesn't like people that much overall. Nevertheless, Lexington tells Peter the story of his business and shows around, putting a start to their co-work. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5477,
        "document_length_chars": 31386
      }
    }
  ]
}