{
  "item_metadata": {
    "item_id": "51380",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51380",
      "content": "TIME IN THE ROUND\n \n \n By FRITZ LEIBER\n \n Illustrated by DILLON\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction May 1957. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n Poor Butcher suffered more than any dictator in history: everybody gave in to him because he was so puny and they were so impregnable!\n \n\n \n From the other end of the Avenue of Wisdom that led across the Peace Park, a gray, hairless, heavily built dog was barking soundlessly at the towering crystal glory of the Time Theater. For a moment, the effect was almost frightening: a silent picture of the beginning of civilization challenging the end of it. Then a small boy caught up with the dog and it rolled over enthusiastically at his feet and the scene was normal again.\n \n The small boy, however, seemed definitely pre-civilization. He studied the dog coldly and then inserted a thin metal tube under its eyelid and poked. The dog wagged its stumpy tail. The boy frowned, tightened his grip on the tube and jabbed hard. The dog's tail thumped the cushiony pavement and the four paws beat the air. The boy shortened his grip and suddenly jabbed the dog several times in the stomach. The stiff tube rebounded from the gray, hairless hide. The dog's face split in an upside-down grin, revealing formidable ivory fangs across which a long black tongue lolled.\n \n The boy regarded the tongue speculatively and pocketed the metal tube with a grimace of utter disgust. He did not look up when someone called: \"Hi, Butch! Sic 'em, Darter, sic 'em!\"\n \n A larger small boy and a somewhat older one were approaching across the luxurious, neatly cropped grass, preceded by a hurtling shape that, except for a black hide, was a replica of Butch's gray dog.\n \n Butch shrugged his shoulders resignedly and said in a bored voice:\n\"Kill 'em, Brute.\"\n \n \n\n \n The gray dog hurled itself on Darter. Jaws gaped to get a hold on necks so short and thick as to be mere courtesy terms. They whirled like a fanged merry-go-round. Three more dogs, one white, one slate blue and one pink, hurried up and tried to climb aboard.\n \n Butch yawned.\n \n \"What's the matter?\" inquired Darter's master. \"I thought you liked dog fights, Butch.\"\n \n \"I do like dog fights,\" Butch said somberly, without looking around. \"I don't like uninj fights. They're just a pretend, like everything else. Nobody gets hurt. And look here, Joggy—and you, too, Hal—when you talk to me, don't just say Butch. It's the Butcher, see?\"\n \n \"That's not exactly a functional name,\" Hal observed with the judiciousness of budding maturity, while Joggy said agreeably: \"All right, Butcher, I suppose you'd like to have lived way back when people were hurting each other all the time so the blood came out?\"\n \n \"I certainly would,\" the Butcher replied. As Joggy and Hal turned back skeptically to watch the fight, he took out the metal tube, screwed up his face in a dreadful frown and jabbed himself in the hand. He squeaked with pain and whisked the tube out of sight.\n \n \"A kid can't do anything any more,\" he announced dramatically. \"Can't break anything except the breakables they give him to break on purpose. Can't get dirty except in the dirt-pen—and they graduate him from that when he's two. Can't even be bitten by an uninj—it's contraprogrammed.\"\n \n \"Where'd you ever get so fixated on dirt?\" Hal asked in a gentle voice acquired from a robot adolescer.\n \n \"I've been reading a book about a kid called Huckleberry Finn,\" the Butcher replied airily. \"A swell book. That guy got dirtier than anything.\" His eyes became dreamy. \"He even ate out of a garbage pail.\"\n \n \"What's a garbage pail?\"\n \n \"I don't know, but it sounds great.\"\n \n The battling uninjes careened into them. Brute had Darter by the ear and was whirling him around hilariously.\n \n \"Aw, quit it, Brute,\" the Butcher said in annoyance.\n \n Brute obediently loosed his hold and returned to his master, paying no attention to his adversary's efforts to renew the fight.\n \n The Butcher looked Brute squarely in the eyes. \"You're making too much of a rumpus,\" he said. \"I want to think.\"\n \n \n\n \n He kicked Brute in the face. The dog squirmed joyously at his feet.\n \n \"Look,\" Joggy said, \"you wouldn't hurt an uninj, for instance, would you?\"\n \n \"How can you hurt something that's uninjurable?\" the Butcher demanded scathingly. \"An uninj isn't really a dog. It's just a lot of circuits and a micropack bedded in hyperplastic.\" He looked at Brute with guarded wistfulness.\n \n \"I don't know about that,\" Hal put in. \"I've heard an uninj is programmed with so many genuine canine reactions that it practically has racial memory.\"\n \n \"I mean if you could hurt an uninj,\" Joggy amended.\n \n \"Well, maybe I wouldn't,\" the Butcher admitted grudgingly. \"But shut up—I want to think.\"\n \n \"About what?\" Hal asked with saintly reasonableness.\n \n The Butcher achieved a fearful frown. \"When I'm World Director,\" he said slowly, \"I'm going to have warfare again.\"\n \n \"You think so now,\" Hal told him. \"We all do at your age.\"\n \n \"We do not,\" the Butcher retorted. \"I bet you didn't.\"\n \n \"Oh, yes, I was foolish, too,\" the older boy confessed readily. \"All newborn organisms are self-centered and inconsiderate and ruthless. They have to be. That's why we have uninjes to work out on, and death games and fear houses, so that our emotions are cleared for adult conditioning. And it's just the same with newborn civilizations. Why, long after atom power and the space drive were discovered, people kept having wars and revolutions. It took ages to condition them differently. Of course, you can't appreciate it this year, but Man's greatest achievement was when he learned to automatically reject all violent solutions to problems. You'll realize that when you're older.\"\n \n \"I will not!\" the Butcher countered hotly. \"I'm not going to be a sissy.\" Hal and Joggy blinked at the unfamiliar word. \"And what if we were attacked by bloodthirsty monsters from outside the Solar System?\"\n \n \"The Space Fleet would take care of them,\" Hal replied calmly. \"That's what it's for. Adults aren't conditioned to reject violent solutions to problems where non-human enemies are concerned. Look at what we did to viruses.\"\n \n \"But what if somebody got at us through the Time Bubble?\"\n \n \"They can't. It's impossible.\"\n \n \"Yes, but suppose they did all the same.\"\n \n \"You've never been inside the Time Theater—you're not old enough yet—so you just can't know anything about it or about the reasons why it's impossible,\" Hal replied with friendly factuality. \"The Time Bubble is just a viewer. You can only look through it, and just into the past, at that. But you can't travel through it because you can't change the past. Time traveling is a lot of kid stuff.\"\n \n \"I don't care,\" the Butcher asserted obstinately. \"I'm still going to have warfare when I'm World Director.\"\n \n \"They'll condition you out of the idea,\" Hal assured him.\n \n \"They will not. I won't let 'em.\"\n \n \"It doesn't matter what you think now,\" Hal said with finality. \"You'll have an altogether different opinion when you're six.\"\n \n \"Well, what if I will?\" the Butcher snapped back. \"You don't have to keep telling me about it, do you?\"\n \n \n\n \n The others were silent. Joggy began to bounce up and down abstractedly on the resilient pavement. Hal called in his three uninjes and said in soothing tones: \"Joggy and I are going to swim over to the Time Theater. Want to walk us there, Butch?\"\n \n Butch scowled.\n \n \"How about it, Butch?\"\n \n Still Butch did not seem to hear.\n \n The older boy shrugged and said: \"Oh, well, how about it—Butcher?\"\n \n The Butcher swung around. \"They won't let me in the Time Theater. You said so yourself.\"\n \n \"You could walk us over there.\"\n \n \"Well, maybe I will and maybe I won't.\"\n \n \"While you're deciding, we'll get swimming. Come along, Joggy.\"\n \n Still scowling, the Butcher took a white soapy crayon from the bulging pocket in his silver shorts. Pressed into the pavement, it made a black mark. He scrawled pensively: KEEP ON THE GRASS.\n \n He gazed at his handiwork. No, darn it, that was just what grownups wanted you to do. This grass couldn't be hurt. You couldn't pull it up or tear it off; it hurt your fingers to try. A rub with the side of the crayon removed the sign. He thought for a moment, then wrote: KEEP OFF THE GRASS.\n \n With an untroubled countenance, he sprang up and hurried after the others.\n \n Joggy and the older boy were swimming lazily through the air at shoulder height. In the pavement directly under each of them was a wide, saucer-shaped depression which swam along with them. The uninjes avoided the depressions. Darter was strutting on his hind legs, looking up inquiringly at his master.\n \n \"Gimme a ride, Hal, gimme a ride!\" the Butcher called. The older boy ignored him. \"Aw, gimme a ride, Joggy.\"\n \n \"Oh, all right.\" Joggy touched the small box attached to the front of his broad metal harness and dropped lightly to the ground. The Butcher climbed on his back. There was a moment of rocking and pitching, during which each boy accused the other of trying to upset them.\n \n Then the Butcher got his balance and they began to swim along securely, though at a level several inches lower. Brute sprang up after his master and was invisibly rebuffed. He retired baffled, but a few minutes later, he was amusing himself by furious futile efforts to climb the hemispherical repulsor field.\n \n Slowly the little cavalcade of boys and uninjes proceeded down the Avenue of Wisdom. Hal amused himself by stroking toward a tree. When he was about four feet from it, he was gently bounced away.\n \n \n\n \n It was really a more tiring method of transportation than walking and quite useless against the wind. True, by rocking the repulsor hemisphere backward, you could get a brief forward push, but it would be nullified when you rocked forward. A slow swimming stroke was the simplest way to make progress.\n \n The general sensation, however, was delightful and levitators were among the most prized of toys.\n \n \"There's the Theater,\" Joggy announced.\n \n \"I know ,\" the Butcher said irritably.\n \n But even he sounded a little solemn and subdued. From the Great Ramp to the topmost airy finial, the Time Theater was the dream of a god realized in unearthly substance. It imparted the aura of demigods to the adults drifting up and down the ramp.\n \n \"My father remembers when there wasn't a Time Theater,\" Hal said softly as he scanned the facade's glowing charts and maps. \"Say, they're viewing Earth, somewhere in Scandinavia around zero in the B.C.-A.D. time scale. It should be interesting.\"\n \n \"Will it be about Napoleon?\" the Butcher asked eagerly. \"Or Hitler?\" A red-headed adult heard and smiled and paused to watch. A lock of hair had fallen down the middle of the Butcher's forehead, and as he sat Joggy like a charger, he did bear a faint resemblance to one of the grim little egomaniacs of the Dawn Era.\n \n \"Wrong millennium,\" Hal said.\n \n \"Tamerlane then?\" the Butcher pressed. \"He killed cities and piled the skulls. Blood-bath stuff. Oh, yes, and Tamerlane was a Scand of the Navies.\"\n \n Hal looked puzzled and then quickly erased the expression. \"Well, even if it is about Tamerlane, you can't see it. How about it, Joggy?\"\n \n \"They won't let me in, either.\"\n \n \"Yes, they will. You're five years old now.\"\n \n \"But I don't feel any older,\" Joggy replied doubtfully.\n \n \"The feeling comes at six. Don't worry, the usher will notice the difference.\"\n \n Hal and Joggy switched off their levitators and dropped to their feet. The Butcher came down rather hard, twisting an ankle. He opened his mouth to cry, then abruptly closed it hard, bearing his pain in tight-lipped silence like an ancient soldier—like Stalin, maybe, he thought. The red-headed adult's face twitched in half-humorous sympathy.\n \n Hal and Joggy mounted the Ramp and entered a twilit corridor which drank their faint footsteps and returned pulses of light. The Butcher limped manfully after them, but when he got inside, he forgot his battle injury.\n \n \n\n \n Hal looked back. \"Honestly, the usher will stop you.\"\n \n The Butcher shook his head. \"I'm going to think my way in. I'm going to think old.\"\n \n \"You won't be able to fool the usher, Butcher. You under-fives simply aren't allowed in the Time Theater. There's a good reason for it—something dangerous might happen if an under-five got inside.\"\n \n \"Why?\"\n \n \"I don't exactly know, but something.\"\n \n \"Hah! I bet they're scared we'd go traveling in the Time Bubble and have some excitement.\"\n \n \"They are not. I guess they just know you'd get bored and wander away from your seats and maybe disturb the adults or upset the electronics or something. But don't worry about it, Butcher. The usher will take care of you.\"\n \n \"Shut up—I'm thinking I'm World Director,\" the Butcher informed them, contorting his face diabolically.\n \n Hal spoke to the uninjes, pointing to the side of the corridor. Obediently four of them lined up.\n \n But Brute was peering down the corridor toward where it merged into a deeper darkness. His short legs stiffened, his neckless head seemed to retreat even further between his powerful shoulders, his lips writhed back to show his gleaming fangs, and a completely unfamiliar sound issued from his throat. A choked, grating sound. A growl. The other uninjes moved uneasily.\n \n \"Do you suppose something's the matter with his circuits?\" Joggy whispered. \"Maybe he's getting racial memories from the Scands.\"\n \n \"Of course not,\" Hal said irritably.\n \n \"Brute, get over there,\" the Butcher commanded. Unwillingly, eyes still fixed on the blackness ahead, Brute obeyed.\n \n The three boys started on. Hal and Joggy experienced a vaguely electrical tingling that vanished almost immediately. They looked back. The Butcher had been stopped by an invisible wall.\n \n \"I told you you couldn't fool the usher,\" Hal said.\n \n The Butcher hurled himself forward. The wall gave a little, then bounced him back with equal force.\n \n \"I bet it'll be a bum time view anyway,\" the Butcher said, not giving up, but not trying again. \"And I still don't think the usher can tell how old you are. I bet there's an over-age teacher spying on you through a hole, and if he doesn't like your looks, he switches on the usher.\"\n \n \n\n \n But the others had disappeared in the blackness. The Butcher waited and then sat down beside the uninjes. Brute laid his head on his knee and growled faintly down the corridor.\n \n \"Take it easy, Brute,\" the Butcher consoled him. \"I don't think Tamerlane was really a Scand of the Navies anyhow.\"\n \n Two chattering girls hardly bigger than himself stepped through the usher as if it weren't there.\n \n The Butcher grimly slipped out the metal tube and put it to his lips. There were two closely spaced faint plops and a large green stain appeared on the bare back of one girl, while purple fluid dripped from the close-cropped hair of the other.\n \n They glared at him and one of them said: \"A cub!\" But he had his arms folded and wasn't looking at them.\n \n Meanwhile, subordinate ushers had guided Hal and Joggy away from the main entrance to the Time Theater. A sphincter dilated and they found themselves in a small transparent cubicle from which they could watch the show without disturbing the adult audience. They unstrapped their levitators, laid them on the floor and sat down.\n \n \n\n \n The darkened auditorium was circular. Rising from a low central platform was a huge bubble of light, its lower surface somewhat flattened. The audience was seated in concentric rows around the bubble, their keen and compassionate faces dimly revealed by the pale central glow.\n \n But it was the scene within the bubble that riveted the attention of the boys.\n \n Great brooding trees, the trunks of the nearer ones sliced by the bubble's surface, formed the background. Through the dark, wet foliage appeared glimpses of a murky sky, while from the ceiling of the bubble, a ceaseless rain dripped mournfully. A hooded figure crouched beside a little fire partly shielded by a gnarled trunk. Squatting round about were wiry, blue-eyed men with shoulder-length blond hair and full blond beards. They were clothed in furs and metal-studded leather.\n \n Here and there were scattered weapons and armor—long swords glistening with oil to guard them from rust, crudely painted circular shields, and helmets from which curved the horns of beasts. Back and forth, lean, wolflike dogs paced with restless monotony.\n \n \n\n \n Sometimes the men seemed to speak together, or one would rise to peer down the misty forest vistas, but mostly they were motionless. Only the hooded figure, which they seemed to regard with a mingled wonder and fear, swayed incessantly to the rhythm of some unheard chant.\n \n \"The Time Bubble has been brought to rest in one of the barbaric cultures of the Dawn Era,\" a soft voice explained, so casually that Joggy looked around for the speaker, until Hal nudged him sharply, whispering with barely perceptible embarrassment: \"Don't do that, Joggy. It's just the electronic interpreter. It senses our development and hears our questions and then it automats background and answers. But it's no more alive than an adolescer or a kinderobot. Got a billion microtapes, though.\"\n \n The interpreter continued: \"The skin-clad men we are viewing in Time in the Round seem to be a group of warriors of the sort who lived by pillage and rapine. The hooded figure is a most unusual find. We believe it to be that of a sorcerer who pretended to control the forces of nature and see into the future.\"\n \n Joggy whispered: \"How is it that we can't see the audience through the other side of the bubble? We can see through this side, all right.\"\n \n \"The bubble only shines light out,\" Hal told him hurriedly, to show he knew some things as well as the interpreter. \"Nothing, not even light, can get into the bubble from outside. The audience on the other side of the bubble sees into it just as we do, only they're seeing the other way—for instance, they can't see the fire because the tree is in the way. And instead of seeing us beyond, they see more trees and sky.\"\n \n Joggy nodded. \"You mean that whatever way you look at the bubble, it's a kind of hole through time?\"\n \n \"That's right.\" Hal cleared his throat and recited: \"The bubble is the locus of an infinite number of one-way holes, all centering around two points in space-time, one now and one then. The bubble looks completely open, but if you tried to step inside, you'd be stopped—and so would an atom beam. It takes more energy than an atom beam just to maintain the bubble, let alone maneuver it.\"\n \n \"I see, I guess,\" Joggy whispered. \"But if the hole works for light, why can't the people inside the bubble step out of it into our world?\"\n \n \"Why—er—you see, Joggy—\"\n \n The interpreter took over. \"The holes are one-way for light, but no-way for matter. If one of the individuals inside the bubble walked toward you, he would cross-section and disappear. But to the audience on the opposite side of the bubble, it would be obvious that he had walked away along the vista down which they are peering.\"\n \n \n\n \n As if to provide an example, a figure suddenly materialized on their side of the bubble. The wolflike dogs bared their fangs. For an instant, there was only an eerie, distorted, rapidly growing silhouette, changing from blood-red to black as the boundary of the bubble cross-sectioned the intruding figure. Then they recognized the back of another long-haired warrior and realized that the audience on the other side of the bubble had probably seen him approaching for some time.\n \n He bowed to the hooded figure and handed him a small bag.\n \n \"More atavistic cubs, big and little! Hold still, Cynthia,\" a new voice cut in.\n \n Hal turned and saw that two cold-eyed girls had been ushered into the cubicle. One was wiping her close-cropped hair with one hand while mopping a green stain from her friend's back with the other.\n \n Hal nudged Joggy and whispered: \"Butch!\"\n \n But Joggy was still hypnotized by the Time Bubble.\n \n \"Then how is it, Hal,\" he asked, \"that light comes out of the bubble, if the people don't? What I mean is, if one of the people walks toward us, he shrinks to a red blot and disappears. Why doesn't the light coming our way disappear, too?\"\n \n \"Well—you see, Joggy, it isn't real light. It's—\"\n \n Once more the interpreter helped him out.\n \n \"The light that comes from the bubble is an isotope. Like atoms of one element, photons of a single frequency also have isotopes. It's more than a matter of polarization. One of these isotopes of light tends to leak futureward through holes in space-time. Most of the light goes down the vistas visible to the other side of the audience. But one isotope is diverted through the walls of the bubble into the Time Theater. Perhaps, because of the intense darkness of the theater, you haven't realized how dimly lit the scene is. That's because we're getting only a single isotope of the original light. Incidentally, no isotopes have been discovered that leak pastward, though attempts are being made to synthesize them.\"\n \n \"Oh, explanations!\" murmured one of the newly arrived girls. \"The cubs are always angling for them. Apple-polishers!\"\n \n \" I like this show,\" a familiar voice announced serenely. \"They cut anybody yet with those choppers?\"\n \n Hal looked down beside him. \"Butch! How did you manage to get in?\"\n \n \"I don't see any blood. Where's the bodies?\"\n \n \"But how did you get in—Butcher?\"\n \n \n\n \n The Butcher replied airily: \"A red-headed man talked to me and said it certainly was sad for a future dictator not to be able to enjoy scenes of carnage in his youth, so I told him I'd been inside the Time Theater and just come out to get a drink of water and go to the eliminator, but then my sprained ankle had got worse—I kind of tried to get up and fell down again—so he picked me up and carried me right through the usher.\"\n \n \"Butcher, that wasn't honest,\" Hal said a little worriedly. \"You tricked him into thinking you were older and his brain waves blanketed yours, going through the usher. I really have heard it's dangerous for you under-fives to be in here.\"\n \n \"The way those cubs beg for babying and get it!\" one of the girls commented. \"Talk about sex favoritism!\" She and her companion withdrew to the far end of the cubicle.\n \n The Butcher grinned at them briefly and concentrated his attention on the scene in the Time Bubble.\n \n \"Those big dogs—\" he began suddenly. \"Brute must have smelled 'em.\"\n \n \"Don't be silly,\" Hal said. \"Smells can't come out of the Time Bubble. Smells haven't any isotopes and—\"\n \n \"I don't care,\" the Butcher asserted. \"I bet somebody'll figure out someday how to use the bubble for time traveling.\"\n \n \"You can't travel in a point of view,\" Hal contradicted, \"and that's all the bubble is. Besides, some scientists think the bubble isn't real at all, but a—uh—\"\n \n \"I believe,\" the interpreter cut in smoothly, \"that you're thinking of the theory that the Time Bubble operates by hypermemory. Some scientists would have us believe that all memory is time traveling and that the basic location of the bubble is not space-time at all, but ever-present eternity. Some of them go so far as to state that it is only a mental inability that prevents the Time Bubble from being used for time traveling—just as it may be a similar disability that keeps a robot with the same or even more scopeful memories from being a real man or animal.\n \n \"It is because of this minority theory that under-age individuals and other beings with impulsive mentalities are barred from the Time Theater. But do not be alarmed. Even if the minority theory should prove true—and no evidence for it has ever appeared—there are automatically operating safeguards to protect the audience from any harmful consequences of time traveling (almost certainly impossible, remember) in either direction.\"\n \n \"Sissies!\" was the Butcher's comment.\n \n \n\n \n \"You're rather young to be here, aren't you?\" the interpreter inquired.\n \n \n\n \n The Butcher folded his arms and scowled.\n \n The interpreter hesitated almost humanly, probably snatching through a quarter-million microtapes. \"Well, you wouldn't have got in unless a qualified adult had certified you as plus-age. Enjoy yourself.\"\n \n There was no need for the last injunction. The scene within the bubble had acquired a gripping interest. The shaggy warriors were taking up their swords, gathering about the hooded sorcerer. The hood fell back, revealing a face with hawklike, disturbing eyes that seemed to be looking straight out of the bubble at the future.\n \n \"This is getting good,\" the Butcher said, squirming toward the edge of his seat.\n \n \"Stop being an impulsive mentality,\" Hal warned him a little nervously.\n \n \"Hah!\"\n \n The sorcerer emptied the small bag on the fire and a thick cloud of smoke puffed toward the ceiling of the bubble. A clawlike hand waved wildly. The sorcerer appeared to be expostulating, commanding. The warriors stared uncomprehendingly, which seemed to exasperate the sorcerer.\n \n \"That's right,\" the Butcher approved loudly. \"Sock it to 'em!\"\n \n \"Butcher!\" Hal admonished.\n \n Suddenly the bubble grew very bright, as if the Sun had just shone forth in the ancient world, though the rain still dripped down.\n \n \"A viewing anomaly has occurred,\" the interpreter announced. \"It may be necessary to collapse the Time Bubble for a short period.\"\n \n In a frenzy, his ragged robes twisting like smoke, the sorcerer rushed at one of the warriors, pushing him backward so that in a moment he must cross-section.\n \n \"Attaboy!\" the Butcher encouraged.\n \n Then the warrior was standing outside the bubble, blinking toward the shadows, rain dripping from his beard and furs.\n \n \"Oh, boy !\" the Butcher cheered in ecstasy.\n \n \"Butcher, you've done it!\" Hal said, aghast.\n \n \"I sure did,\" the Butcher agreed blandly, \"but that old guy in the bubble helped me. Must take two to work it.\"\n \n \"Keep your seats!\" the interpreter said loudly. \"We are energizing the safeguards!\"\n \n \n\n \n The warriors inside the bubble stared in stupid astonishment after the one who had disappeared from their view. The sorcerer leaped about, pushing them in his direction.\n \n Abrupt light flooded the Time Theater. The warriors who had emerged from the bubble stiffened themselves, baring their teeth.\n \n \"The safeguards are now energized,\" the interpreter said.\n \n A woman in a short golden tunic stood up uncertainly from the front row of the audience.\n \n The first warrior looked her up and down, took one hesitant step forward, then another, then suddenly grabbed her and flung her over his left shoulder, looking around menacingly and swinging his sword in his right hand.\n \n \"I repeat, the safeguards have been fully energized! Keep your seats!\" the interpreter enjoined.\n \n In the cubicle, Hal and Joggy gasped, the two girls squeaked, but the Butcher yelled a \"Hey!\" of disapproval, snatched up something from the floor and darted out through the sphincter.\n \n Here and there in the audience, other adults stood up. The emerged warriors formed a ring of swinging swords and questing eyes. Between their legs their wolfish dogs, emerged with them, crouched and snarled. Then the warriors began to fan out.\n \n \"There has been an unavoidable delay in energizing the safeguards,\" the interpreter said. \"Please be patient.\"\n \n At that moment, the Butcher entered the main auditorium, brandishing a levitator above his head and striding purposefully down the aisle. At his heels, five stocky forms trotted. In a definitely pre-civilization voice, or at least with pre-civilization volume, he bellowed: \"Hey, you! You quit that!\"\n \n The first warrior looked toward him, gave his left shoulder a shake to quiet his wriggling captive, gave his right shoulder one to supple his sword arm, and waited until the dwarfish challenger came into range. Then his sword swished down in a flashing arc.\n \n Next moment, the Butcher was on his knees and the warrior was staring at him open-mouthed. The sword had rebounded from something invisible an arm's length above the gnomelike creature's head. The warrior backed a step.\n \n \n\n \n The Butcher stayed down, crouching half behind an aisle seat and digging for something in his pocket. But he didn't stay quiet. \"Sic\n'em, Brute!\" he shrilled. \"Sic 'em, Darter! Sic 'em, Pinkie and Whitie and Blue!\" Then he stopped shouting and raised his hand to his mouth.\n \n \n\n \n Growling quite unmechanically, the five uninjes hurled themselves forward and closed with the warrior's wolflike dogs. At the first encounter, Brute and Pinkie were grabbed by the throats, shaken, and tossed a dozen feet. The warriors snarled approval and advanced. But then Brute and Pinkie raced back eagerly to the fight—and suddenly the face of the leading warrior was drenched with scarlet. He blinked and touched his fingers to it, then looked at his hand in horror.\n \n The Butcher spared a second to repeat his command to the uninjes. But already the battle was going against the larger dogs. The latter had the advantage of weight and could toss the smaller dogs like so many foxes. But their terrible fangs did no damage, and whenever an uninj clamped on a throat, that throat was torn out.\n \n Meanwhile, great bloody stains had appeared on the bodies of all the warriors. They drew back in a knot, looking at each other fearfully. That was when the Butcher got to his feet and strode forward, hand clenching the levitator above his head.\n \n \"Get back where you belong, you big jerks! And drop that lady!\"\n \n The first warrior pointed toward him and hissed something. Immediately, a half dozen swords were smiting at the Butcher.\n \n \"We are working to energize the safeguards,\" the interpreter said in mechanical panic. \"Remain patient and in your seats.\"\n \n The uninjes leaped into the melee, at first tearing more fur than flesh. Swords caught them and sent them spinning through the air. They came yapping back for more. Brute fixed on the first warrior's ankle. He dropped the woman, stamped unavailingly on the uninj, and let out a screech.\n \n Swords were still rebounding from the invisible shield under which the Butcher crouched, making terrible faces at his attackers. They drew back, looked again at their bloodstains, goggled at the demon dogs. At their leader's screech, they broke and plunged back into the Time Bubble, their leader stumbling limpingly after them. There they wasted no time on their own ragged sorcerer. Their swords rose and fell, and no repulsor field stayed them.\n \n \"Brute, come back!\" the Butcher yelled.\n \n \n\n \n The gray uninj let go his hold on the leader's ankle and scampered out of the Time Bubble, which swiftly dimmed to its original light intensity and then winked out.\n \n For once in their very mature lives, all of the adults in the auditorium began to jabber at each other simultaneously.\n \n \"We are sorry, but the anomaly has made it necessary to collapse the Time Bubble,\" the interpreter said. \"There will be no viewing until further announcement. Thank you for your patience.\"\n \n Hal and Joggy caught up with the Butcher just as Brute jumped into his arms and the woman in gold picked him up and hugged him fiercely. The Butcher started to pull away, then grudgingly submitted.\n \n \"Cubs!\" came a small cold voice from behind Hal and Joggy. \"Always playing hero! Say, what's that awful smell, Cynthia? It must have come from those dirty past men.\"\n \n Hal and Joggy were shouting at the Butcher, but he wasn't listening to them or to the older voices clamoring about \"revised theories of reality\" and other important things. He didn't even squirm as Brute licked his cheek and the woman in gold planted a big kiss practically on his mouth.\n \n He smiled dreamily and stroked Brute's muzzle and murmured softly: \"We came, we saw, we conquered, didn't we, Brute?\"",
      "metadata": {
        "title": "Time in the Round",
        "author": "Fritz Leiber",
        "passage_id": "51380",
        "uid": "1447adba85074bcfb1ade8659e97d343",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "3",
                "uid": "9e0f89730bcc49cda54b41c868e77bae",
                "response_text": "The story starts in a park, where we meet a a young boy who goes by the Butcher (\"Butch\"), and his dog Brute. The boy is trying to do something to the dog with a small metal tube when Hal, another boy, shows up with his own dogs, and another boy named Joggy. It turns out these are not normal dogs, but are \"uninj\", machines created to be like dogs but not able to be hurt. Butch seems bored with these countermeasures against violence, and intent on putting violence back in the world. His interactions with Hal show us that they live in a civilization where the children are given opportunities to work out any violent and angry tendencies or impulses before they are conditioned as adults. They are only allowed to visit the Time Theater to see glimpses into other societies (and thus evidence of violence) after age five, and the change in mentality happens at age six. Butch wants to use Time Bubble to travel through time, but Hal insists that this is impossible. The boys head to this theater, an incredible crystal building with an important place in this society, choosing to fly there with their hover technology. Joggy is five, so he is allowed to enter with Hal, but Butch is blocked from entering by the ushers, which Hal says is for his own protection. Joggy and Hal take a seat in a children's viewing area to look into the glowing orb of light that sits in the middle of the round theater. The orb acts as a viewport into various times and places, and is currently showing a view of Earth, Scandanavia more specifically, around year zero according to Earth calendars. There are a number of warriors in the forest scene, along with some dogs and a sorcerer, and the boys watch in earnest. As the electronic interpreter for the viewing gives the boys more information about cultural context, Butch manages to sneak in to the theater by lying to the ushers. Shortly after Butch and two young girls join the viewing, something happened that no-one thought possible: the sorcerer pushed one of the warriors through the orb of the Time Bubble, throwing him into the theater. Panic falls on the audience, and warriors and dogs continue to enter the theater as Butch and the uninjes start to fight off the time-travelers with their design keeping them from being injured. Hal is convinced that this happened because an under-five (Butch specifically) was in the theater, but the rest of the public does not know he is young and they thank him for saving the day as he fights off the warriors and the Time Bubble collapses. This is the first piece of chaos the adults have experienced in their adult lives, and the Butcher is content with how it all played out, getting to play hero in a violent setting for a day with Brute."
              },
              {
                "worker_id": "1",
                "uid": "62156a7e25a64fc5b923da6bdb072da9",
                "response_text": "Brute, a dog made of hyperplastic, barks without making a noise. He is an uninje. He is programmed to be very similar to a real dog, but he is incapable of being injured. His owner, a boy named Butch, tackles him and pokes him in the eye and hits him. Butch then orders all of the dogs to fight, but becomes bored moments later. He tells his friends, Joggy and Hal that he wishes he lived like Huckleberry Finn, with the ability to get dirty and inflict pain.\n\nButch says that one day he will be the World Director, and he will bring back war. Hal, who is older and more mature, explains that Butch’s desire for violence will be conditioned out of him once he turns six. He says that Butch will understand everything once he’s allowed in the Time Theater to see into the past. \n\nHal and Joggy decide to go to the Time Theater. Butch climbs on Joggy’s back, and they use Joggy’s harness and the repulsor hemisphere to propel them forward. When the boys arrive, they warn Butch that he will be stopped by the usher. Hal explains that something dangerous might happen if a young child is allowed in. The uninjes line up obediently next to Butch. \n\nButch tries to get past the invisible wall keeping him out of the theater, but he can’t. Meanwhile, Hal and Joggy enter a dilated sphincter and sit down in a transparent cubicle. They take their levitators off to enjoy the show in the dark auditorium. In the center of the room is the Time Bubble, which transmits images of the past. They watch Scandinavian warriors holding long swords, surrounded by dogs, listening to a hooded figure chant.\nJoggy has several questions about the show, and the interpreter in the room answers them. He wonders why light can’t escape from the Bubble and why the warriors in the picture can’t step through into the theater.\nButch appears beside his friends after he tricks his way into the theater. The Time Bubble becomes incredibly bright, and suddenly, the warrior appears outside of the Bubble. The interpreter warns the crowd that he’s activating the safeguards in response. Hal blames the anomaly on Butch. \nOne of the warriors grabs a woman in the front row and picks her up. Butch refuses to sit by idly and approaches the warrior with his levitator over his head. When the warrior tries to strike Butch with his sword, he finds that the boy is protected by an invisible shield. Butch commands the uninjes to attack the warriors and their dogs, and they do. The warriors are scared of the uninjes’ strength and their ability to withstand their swords. The warriors’ leader commands them to get back in the Time Bubble. The Interpreter explains that he must collapse the Bubble due to this crisis. The woman who was taken by the warrior hugs and kisses Butch for saving her life. He is very proud of himself. \n"
              },
              {
                "worker_id": "9",
                "uid": "ecfd18c7d8ec4924bc96a7b824b44c32",
                "response_text": "Butch, Hal, and Joggy, are three kids of varying ages: Joggy is five, Butch is under five, and Hal is older. Butch exhibits a lot of frustration toward their non-violent and heavily age-regimented society. He says he’s going to be World Director, and seems to want to be a dictator like those from the time before humanity conditioned out violence. \n\nButch goes with the other boys to Time in the Round, a place where they can see events from the past and have them explained. Because it is carefully curated for specific ages, Hal tells Butch he won’t be able to enter. Butch tries anyway, but an invisible blockade they call an “usher” won’t let him through. \n\nThe other boys watch a sorcerer and some warriors inside the Time Bubble. Before too long, Butch appears, telling them he lied his way in with a sympathetic adult. Hal is upset that he did this, and also by Butch’s behavior once he’s in there. Though they have been told that it would be impossible for the Time Bubble to be used for time travel, Butch yells at the sorcerer to “sock it to ‘em” and he listens; somehow, between Butch and the sorcerer’s willpower, a few of the warriors end up outside the bubble and in the auditorium, along with their wolves. The interpreter and audience start to panic. \n\nButch takes control, order his and his friends’ uninjs to attack the wolves, who are larger but not invincible like the uninjs. He orders a warrior to put down a lady he has slung over his shoulder and his uninj, Brute, bites the warrior in the ankle, causing him to drop her. Butch tells them to go back where they came from and Brute chases them back into the bubble. Butch calls Brute, and as soon as he jumps back out the bubble dims and goes back to normal. \n\nEveryone is relieved, and the adults are more talkative and less “mature” than usual. People discuss “revised theories” and both the formerly captive woman and Brute embrace and kiss Butch, but he is too dazed and happy to notice. He pets Brute and says “we came, we saw, we conquered, didn’t we, Brute?” \n"
              },
              {
                "worker_id": "8",
                "uid": "f5ca4125cd72499884e4854f68f734cd",
                "response_text": "A young boy named Butch plays with his pet--a dog-like, robotic \"uninj\" named Brute--along the Avenue of Wisdom in the Peace Park. Butch is rough with Brute, jabbing and poking him hard with a metal tube, but his friends Joggy and Hal come along and we learn uninjes cannot be harmed nor can they harm. They have been programmed against it. This is just one element in a post-violence world; adults have been systemically programmed against using violence to resolve conflicts between themselves, although they may use it to fight against alien enemies. Butch, however, insists his friends call him \"Butcher\" because he wants to become a dictator when he is older and bring back violence as a means of conflict resolution. His friend Hal assures him that when he is older, he will understand why removing violence from society was \"Man's greatest achievement.\" The boys make their way to the Time Theater at the end of the Avenue of Wisdom by utilizing levitators that help them swim through the air. The Time Theater is home to a large bubble that functions as a one-way viewer into pre-civilization eras. Only people over five years old are allowed into the Time Theater; the Butcher is stopped by an invisible \"usher\", leaving Hal and Joggy to enter the viewing cubicle alone. Once inside, the bubble interpreter and Hal explain to Joggy how the bubble functions. It is essentially a time-hole that allows observation because of light isotopes that leak through. But matter cannot pass through the bubble, which is why it cannot be used for time travel. However, some scientists theorize that people with impulsive minds, such as underage children, might activate a time-traveling capability. The Butcher tricks an adult into carrying him into the Time Theater, and he joins Joggy and Hal in their viewing of a group of barbaric Scandinavian men from the Dawn Era. They watch as a sorcerer conducts some kind of spell with the Butcher egging him on. The Butcher's impulsive behavior combined with the sorcerer's ability to see into the future unlocks the bubble, and the sorcerer pushes the Scandinavian men through into the Time Theater. There, they begin to attack the adults present and attempt to kidnap a woman in the audience. The Butcher commands the uninjes to attack the men, and he stuns them with his use of the levitator to protect his head from the blows of their swords. The uninjes push the men back through the bubble, where they kill the sorcerer and the interpreter closes the bubble. Its automatic safeguards have failed, and the Butcher has saved the day."
              }
            ]
          },
          {
            "question_text": "Who is Hal and what is his role in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "3",
                "uid": "9e0f89730bcc49cda54b41c868e77bae",
                "response_text": "Hal is one of the three boys who drives the narrative of the story; he is the oldest of the three, with the most experience and knowledge. He acts as a mentor to the Butcher and Joggy, the other two boys. Joggy is five, so he is able to go to the Time Theater for the first time, but the Butcher is not yet old enough. Hal tells the Butcher that his violent impulses will pass given time and conditioning, and tries to dissuade him from trying to enter the TIme Theater for the sake of safety. He is the one that wants to go to the theater, and asks the Butcher to walk with him. He scolds the Butcher once he reveals how he snuck into the theater, and is worried about the potential danger. Throughout the time in the theater, it is Hal who explains how the different beings in the society fit together, and the technology (and theories) around the Time Bubble, though the electronic narrator in the viewing box at the theater also helps fill in some details. Throughout the story more broadly, Hal maintains a patient tone with the Butcher, as he tries to be very understanding about his youthful inclinations towards violence, admitting his past urges but pointing towards positive change towards a more calm mindset. "
              },
              {
                "worker_id": "1",
                "uid": "62156a7e25a64fc5b923da6bdb072da9",
                "response_text": "Hal is Butch and Joggy’s older friend. He knows a lot more about the Time Bubble and pre-civilization than his younger friends do. Hal is reasonable, patient, and conditioned by the society he is a part of. He agrees with the rules that govern his existence and understands the key differences between pre-civilization and now. Hal is kind to Butch even when he rebels or tries to act like he knows better than everyone else. When Butch tells his friends that he will start wars when he serves as World Director, Hal responds by telling him that everyone thinks that at his age. Hal is confident in his knowledge of the world and society and does not get frustrated with Butch’s fantastical ideas. \n\nHal enjoys his trips to the Time Theater and it’s his suggestion that convinces Joggy and Butch to go see the Time Bubble. He thinks that the Scandinavian warriors sound interesting. He agrees that Butch should walk him and Joggy there, but he is certain that Butch will not be allowed into the theater. Hal is convinced that an usher will stop Butch from entering, and he believes that allowing someone under the age of five to enter the sacred hall could be dangerous. \n\nHal tries to answer all of Joggy’s questions about the Time Bubble, but the truth is he doesn’t understand a lot of the mechanisms behind the mysterious machine. He is a little bit embarrassed when the interpreter has to keep responding to Joggy throughout the show. Hal is truly alarmed when Butch shows up unexpectedly in the transparent cubicle. He thinks it is immoral and wrong to convince the usher that he is older than he truly is, and he worries that there will be severe consequences for his actions. When the Scandinavian warrior comes out of the Time Bubble and becomes violent, Hal immediately blames Butch for the glitch. He is a rule follower, and regardless of the fact that Butch saved the day, he remains upset and angry at him for breaking protocol in the first place. \n"
              },
              {
                "worker_id": "9",
                "uid": "ecfd18c7d8ec4924bc96a7b824b44c32",
                "response_text": "Hal is an older boy in the story, and he likes to remind his younger friends of his age and wisdom. He is more mature and sees the reasoning behind a lot of the rules that frustrate Butch, but his constant refrain of telling Butch that he’ll feel differently when he’s older only serves to irritate the younger boy and make him want to act out even more. Hal tells Butch that it’s dangerous for under-fives to be in the Time Room, and he grows increasingly frustrated with and anxious about Butch’s behavior when he lies his way in and starts messing with the Time Bubble. \n"
              },
              {
                "worker_id": "8",
                "uid": "f5ca4125cd72499884e4854f68f734cd",
                "response_text": "Hal is the oldest of the three friends, and he seems to understand the most about how the Time Theater functions and how the bubble works. Whereas Butch is impulsive, impatient, and wants to use violence to solve problems, Hal is more adjusted to the standards of the post-violence society. He offers wise counsel to Butch, who resists him at every turn, and he educates Joggy, who is more eager to absorb the lessons he imparts. Hal contrasts pre-civilization with the current world they live in and suggests that with age, Butch will also understand the necessity of removing violence from the equation when it comes to resolving conflict. "
              }
            ]
          },
          {
            "question_text": "What is the role of technology in this society?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "3",
                "uid": "9e0f89730bcc49cda54b41c868e77bae",
                "response_text": "There are two major types of technology highlighted in the story: the first is the mechanical kind that allows for hovering travel, the development of uninjes, and the systems in place in the theater like the ushers and the protective mechanisms. The other major thing that could be categorized as technology is the Time Bubble itself; it acts as a form of entertainment but also as a warning to avoid the habits of people of the past. Focusing on the engineering technology that does not directly relate to potential time-travel, it is strongly hinted that the children in the story might be partly mechanical themselves, though this is not clarified. It is pointed out that there are \"adolescers\" and \"kinderobots\", which could be referring to the age groups of these children, and the dogs that follow the people around are also technological creations. The \"uninjes\" are like dogs, and are built to have canine reactions to be as close to real dogs as possible, but cannot be harmed and in the end are still collections of circuits with a battery and molded plastic. There are a number of pieces of technology in the theater, including forcefields used by ushers to block children who are too young to enter, and a number of safeguards like forcefields to protect people inc ase something went wrong with the Time Bubble. The bubble itself is a marvel of technology but nobody understands exactly how it works. Most of the discourse surrounding this is about the theories of time travel. "
              },
              {
                "worker_id": "1",
                "uid": "62156a7e25a64fc5b923da6bdb072da9",
                "response_text": "The technology in this world helps the children and people from getting injured. The boys use metal harnesses, levitators, and the hemisphere repulsor to keep them from hitting their bodies against trees, the ground, walls, or anything else that could potentially inflict pain. These technologies create an invisible shield around them and gently bounce them away from objects. \n\nThe Time Theater is a very important place that houses the society’s Time Bubble, their most prized possession. It allows the adults to feel like gods because they are able to look back at any time or place and recognize how much their society has improved from simpler times. Upon entering the theater, Hal and Joggy feel a shock of electricity. Butch, however, is repelled by an invisible wall that knows he is not yet of age to enter the sacred space. There is also technology to keep the children separated from the adults in the theater. \n \nThe electronic interpreter in the theater helps the audience members understand what it is they’re seeing and how the machine works. It is capable of hearing the audience members’ questions and it quickly provides answers. \nThe Time Bubble is supposed to keep everything, even light, from entering the theater. It is only supposed to give viewers a look into the past, not a real experience. Some scientists in the society believe that the Time Bubble uses real peoples’ memories to time travel. The Time Bubble malfunctions and allows the Scandinavian warriors in the Bubble to enter the theater. The men from the past are shocked when they see that Butch is protected by an invisible shield and the uninjes are incapable of being injured the way real dogs would. \nThe society’s new technology saves the audience members’ lives from a real attack from people of the past. Even when their technology malfunctions, they are able to protect themselves from the swords and wolvish dogs. \n"
              },
              {
                "worker_id": "9",
                "uid": "ecfd18c7d8ec4924bc96a7b824b44c32",
                "response_text": "Technology is a huge part of this society, as it prevents bloodshed and is central to their way of life. Hal mentions fear houses and death games, as well as the invincible robot dogs known as uninjs. He explains that over time humans have been conditioned to reject violence. He also mentions a Space Fleet that they rely on in case of an outside attack. This society has also created a setting that is difficult or impossible to tarnish or disrupt. The children use levitators to “swim” through the air, and the Time Bubble is used as a source of historical exposure (and possibly propaganda). Until Butch is able to use the Time Bubble for actual space travel, the primary role of technology in this society seems to be to maintain peace, pleasantness, and control. \n"
              },
              {
                "worker_id": "8",
                "uid": "f5ca4125cd72499884e4854f68f734cd",
                "response_text": "Technology plays an important role in the story, particularly as a buffer against violence in the new civilization as well as a window into the pre-civilization era. The boys use special levitation devices to swim through the air; these devices also release a kind of repulsor shield that protects them from running into things while they're swimming such as trees. The Butcher later utilizes this technology to protect himself against the sword attacks of the Scandinavian men when they are pushed through the bubble into the Time Theater. The uninjes are robotic canines that cannot be hurt and are programmed against hurting humans themselves. However, they also protect the humans against the attacks of the Scandinavian men later in the story. The Time Theater utilizes time-hole technology to open windows into previous eras for observation and study, and the interpreter intuits viewers' questions and answers them in real-time. The \"usher\" is a kind of force field as well, which has the ability to determine a person's age as they attempt to pass through it. All of this technology is imperfect, and, as the Butcher later demonstrates, malleable if in the hands of someone with impulsive instincts."
              }
            ]
          },
          {
            "question_text": "Describe the structure of the society in this story",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "3",
                "uid": "9e0f89730bcc49cda54b41c868e77bae",
                "response_text": "This society is organized around a reconditioning of thoughts that happens as children transition into adulthood, starting at age six. Adults who have already been reconditioned are passive and polite members of society, who supposedly do not have traces of violent tendencies anymore. Before this, however, there are a few levels of separation from the rest of the society. Five year olds are allowed to go to the Time Theater to view whatever is showing through the Time Bubble, a view into other societies throughout time, but anyone younger than five is not allowed. This is presumably because of safety concerns--Hal thinks that young children are a nuisance to adults in these settings. The society has a number of systems in place specifically for these younger children who have not yet been conditioned. There are things called death games and fear houses, which we do not see details of in this story, that are meant to clear out the childrens' emotional space. It also seems that uninjes, the robotic dogs that the boys have, are also for this purpose: Hal says that they are part of the society's options for letting kids work out their ruthless and inconsiderate impulses. These impulses are restructured when they are aimed at other people, but violent alien beings and viruses or other medical concerns are still considered threats worth responding to in full force. The particular focus on avoiding violent patterns seen in other civilizations is highlighted by the grand nature of the Time Theater, and its position at the end of a major street in a large public park."
              },
              {
                "worker_id": "1",
                "uid": "62156a7e25a64fc5b923da6bdb072da9",
                "response_text": "In “Time in the Round,” the society is structured around perfection. Small children are given breakables, and those items are the only things that are physically capable of being broken. There are dirt-pens for kids to play in, and besides those areas, children are incapable of becoming dirty. The dirt-pens are only available to children aged 2 and younger. The society’s dogs, uninjes, are programmed not to bite or hurt the people, even when they are hit or stabbed themselves. They do not react like normal canines. \n\nYoung children are considered to be self-centered and ruthless, and they are provided with death games and fear houses to get out their emotions and prepare to be conditioned as adults. When children turn six years old, they feel differently than they did before. They are ready to enter the Time Theater and view the Time Bubble. They are taught about pre-civilization and the important differences between their own society and the past. They learn how to reject violent solutions to problems and live in peace. \n"
              },
              {
                "worker_id": "9",
                "uid": "ecfd18c7d8ec4924bc96a7b824b44c32",
                "response_text": "The structure of society is based on age, and very specific behaviors are allowed and prohibited at different ages. Very young children are allowed to play and get dirty, but after a certain age they are no longer allowed to do so. Certain ages are considered too young for certain ideas, and aren’t allowed in the Time Building or are only allowed in certain parts of it. Younger children are sometimes called “cubs”, and it seems to be commonplace for older members of society to treat younger members with sweet derision. This society puts a strong emphasis on maturity and carefully controls what people are allowed to do at what ages and when they are allowed to learn concepts or do activities. The core principle is nonviolence but the results are near-total uniformity and strict constraints. \n"
              },
              {
                "worker_id": "8",
                "uid": "f5ca4125cd72499884e4854f68f734cd",
                "response_text": "The society the main characters inhabit is post-violence. While children below five are given uninjes, death games, and fear houses in order to clear their emotions, adults are systematically re-programmed to believe that violence has no place in this new society. While violence is never used to resolve conflicts between humans, the Space Fleet will still use violence in defense against alien enemies. There are a number of protections in place to prevent violence upon humans from repulsor shields to the protective uninjes. The bubble at the Time Theater offers adults and those with the appropriate mental facilities a view into the pre-civilization world so that they may learn from the past and understand why a lack of violence became necessary in the new society."
              }
            ]
          },
          {
            "question_text": "Describe what \"pre-civilization\" means in the context of this story",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "3",
                "uid": "9e0f89730bcc49cda54b41c868e77bae",
                "response_text": "The term pre-civilization points to anything that has a sense of violence or chaos in the lives of adults. For instance, raised voices and people talking over each other is considered pre-civilization, but so are violent wars. The society is built to get rid of these tendencies in children and recondition them as adults to be calm and peaceful members of society. When the Butcher is referred to as looking pre-civilization at the beginning of the story, it is because he seems to be up to something he isn't supposed to do, as he is potentially hurting or controlling Brute in some way with the use of a metal tube. "
              },
              {
                "worker_id": "1",
                "uid": "62156a7e25a64fc5b923da6bdb072da9",
                "response_text": "In “Time in the Round,” the society is structured around perfection. Small children are given breakables, and those items are the only things that are physically capable of being broken. There are dirt-pens for kids to play in, and besides those areas, children are incapable of becoming dirty. The dirt-pens are only available to children aged 2 and younger. The society’s dogs, uninjes, are programmed not to bite or hurt the people, even when they are hit or stabbed themselves. They do not react like normal canines. \n\nYoung children are considered to be self-centered and ruthless, and they are provided with death games and fear houses to get out their emotions and prepare to be conditioned as adults. When children turn six years old, they feel differently than they did before. They are ready to enter the Time Theater and view the Time Bubble. They are taught about pre-civilization and the important differences between their own society and the past. They learn how to reject violent solutions to problems and live in peace. Even yelling is considered a pre-civilization act. When Butch enters the Time Theater and tries to get the Scandinavian warrior’s attention, he is using someithing called a “pre-civilization voice”. The Time Bubble is a tool that society uses to remind its current citizens what humans used to act barbarically, and that is not longer appropriate. \n"
              },
              {
                "worker_id": "9",
                "uid": "ecfd18c7d8ec4924bc96a7b824b44c32",
                "response_text": "Pre-civilization seems to refer to the society that we know, and any society that predates the decision to make violence impossible and to control all aspects of societal behavior. Hal describes the process of conditioning humanity to reject violence in all forms, and pre-civilization points to a time before that process was undertaken. For example, Butch is referred to as “pre-civilization” when he continually abuses an uninj at the beginning of the story, because he is behaving in a violent way. He is described this way again at the end of the story when he is shouting battle orders. \n"
              },
              {
                "worker_id": "8",
                "uid": "f5ca4125cd72499884e4854f68f734cd",
                "response_text": "Pre-civilization primarily refers to the time before the post-violent society where the central action of the story takes place. They are able to view this era by using the time-hole technology of the bubble on display at the Time Theater in the Peace Park at the end of the Avenue of Wisdom. \"Pre-civilization\" is characterized by famous historical figures such as Hitler, Stalin, and Tamerlane--individuals that the Butcher idealizes for their use of violence in resolving conflict. The climax of the story revolves around a viewing of Scandinavian men of the Dawn Era gone wrong when the simultaneous workings of a sorcerer and the Butcher's impulsive mind allow the Scandinavian men to pass through the bubble into the Time Theater. The ensuing battle highlights the barbarism of the Dawn Era--they use swords and real dogs in battle; it also demonstrates the Butcher's ability to weaponize technology meant to oppose violence as a way to protect this new society."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5337,
        "document_length_chars": 31954
      }
    }
  ]
}