{
  "item_metadata": {
    "item_id": "51398",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51398",
      "content": "Well, naturally Kaiser would transmit baby talk messages to his mother ship! He was—\n \n \n GROWING UP ON BIG MUDDY\n \n \n By CHARLES V. DE VET\n \n Illustrated by TURPIN\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction July 1957. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Kaiser stared at the tape in his hand for a long uncomprehending minute. How long had the stuff been coming through in this inane baby talk? And why hadn't he noticed it before? Why had he had to read this last communication a third time before he recognized anything unusual about it?\n \n He went over the words again, as though maybe this time they'd read as they should.\n \n OO IS SICK, SMOKY. DO TO BEDDY-BY. KEEP UM WARM. WHEN UM FEELS BETTER, LET USNS KNOW.\n \n \n SS II\n \n Kaiser let himself ease back in the pilot chair and rolled the tape thoughtfully between his fingers. Overhead and to each side, large drops of rain thudded softly against the transparent walls of the scout ship and dripped wearily from the bottom ledge to the ground.\n \n \"Damn this climate!\" Kaiser muttered irrelevantly. \"Doesn't it ever do anything here except rain?\"\n \n His attention returned to the matter at hand. Why the baby talk? And why was his memory so hazy? How long had he been here? What had he been doing during that time?\n \n Listlessly he reached for the towel at his elbow and wiped the moisture from his face and bare shoulders. The air conditioning had gone out when the scout ship cracked up. He'd have to repair the scout or he was stuck here for good. He remembered now that he had gone over the job very carefully and thoroughly, and had found it too big to handle alone—or without better equipment, at least. Yet there was little or no chance of his being able to find either here.\n \n Calmly, deliberately, Kaiser collected his thoughts, his memories, and brought them out where he could look at them:\n \n The mother ship, Soscites II , had been on the last leg of its planet-mapping tour. It had dropped Kaiser in the one remaining scout ship—the other seven had all been lost one way or another during the exploring of new worlds—and set itself into a giant orbit about this planet that Kaiser had named Big Muddy.\n \n The Soscites II had to maintain its constant speed; it had no means of slowing, except to stop, and no way to start again once it did stop. Its limited range of maneuverability made it necessary to set up an orbit that would take it approximately one month, Earth time, to circle a pinpointed planet. And now its fuel was low.\n \n Kaiser had that one month to repair his scout or be stranded here forever.\n \n That was all he could remember. Nothing of what he had been doing recently.\n \n A small shiver passed through his body as he glanced once again at the tape in his hand. Baby talk....\n \n \n\n \n One thing he could find out: how long this had been going on. He turned to the communicator and unhooked the paper receptacle on its bottom. It held about a yard and a half of tape, probably his last several messages—both those sent and those received. He pulled it out impatiently and began reading.\n \n The first was from himself:\n \n YOUR SUGGESTIONS NO HELP. HOW AM I GOING TO REPAIR DAMAGE TO SCOUT WITHOUT PROPER EQUIPMENT? AND WHERE DO I GET IT? DO YOU THINK I FOUND A TOOL SHOP DOWN HERE? FOR GOD'S SAKE, COME UP WITH SOMETHING BETTER.\n \n VISITED SEAL-PEOPLE AGAIN TODAY. STILL HAVE THEIR STINK IN MY NOSE. FOUND HUTS ALONG RIVER BANK, SO I GUESS THEY DON'T LIVE IN WATER. BUT THEY DO SPEND MOST OF THEIR TIME THERE. NO, I HAVE NO WAY OF ESTIMATING THEIR INTELLIGENCE. I WOULD JUDGE IT AVERAGES NO HIGHER THAN SEVEN-YEAR-OLD HUMAN. THEY DEFINITELY DO TALK TO ONE ANOTHER. WILL TRY TO FIND OUT MORE ABOUT THEM, BUT YOU GET TO WORK FAST ON HOW I REPAIR SCOUT.\n \n SWELLING IN ARM WORSE AND AM DEVELOPING A FEVER. TEMPERATURE 102.7 AN HOUR AGO.\n \n \n SMOKY\n \n The ship must have answered immediately, for the return message time was six hours later than his own, the minimum interval necessary for two-way exchange.\n \n DOING OUR BEST, SMOKY. YOUR IMMEDIATE PROBLEM, AS WE SEE IT, IS TO KEEP WELL. WE FED ALL THE INFORMATION YOU GAVE US INTO SAM, BUT YOU DIDN'T HAVE MUCH EXCEPT THE STING IN YOUR ARM. AS EXPECTED, ALL THAT CAME OUT WAS \"DATA INSUFFICIENT.\" TRY TO GIVE US MORE. ALSO DETAIL ALL SYMPTOMS SINCE YOUR LAST REPORT. IN THE MEANTIME, WE'RE DOING EVERYTHING WE CAN AT THIS END. GOOD LUCK.\n \n \n SS II\n \n Sam, Kaiser knew, was the ship's mechanical diagnostician. His report followed:\n \n ARM SWOLLEN. UNABLE TO KEEP DOWN FOOD LAST TWELVE HOURS. ABOUT TWO HOURS AGO, ENTIRE BODY TURNED LIVID RED. BRIEF PERIODS OF BLANKNESS. THINGS KEEP COMING AND GOING. SICK AS HELL. HURRY.\n \n \n SMOKY\n \n The ship's next message read:\n \n INFECTION QUITE DEFINITE. BUT SOMETHING STRANGE THERE. GIVE US ANYTHING MORE YOU HAVE.\n \n \n SS II\n \n His own reply perplexed Kaiser:\n \n LAST LETTER FUNNY. I NOT UNDERSTAND. WHY IS OO SENDING GARBLE TALK? DID USNS MAKE UP SECRET MESSAGES?\n \n \n SMOKY\n \n The expedition, apparently, was as puzzled as he:\n \n WHAT'S THE MATTER, SMOKY? THAT LAST MESSAGE WAS IN PLAIN TERRAN. NO REASON WHY YOU COULDN'T READ IT. AND WHY THE BABY TALK? IF YOU'RE SPOOFING, STOP. GIVE US MORE SYMPTOMS. HOW ARE YOU FEELING NOW?\n \n \n SS II\n \n The baby talk was worse on Kaiser's next:\n \n TWAZY. WHAT FOR OO TENDING TWAZY LETTERS? FINK UM CAN WEAD TWAZY LETTERS? SKIN ALL YELLOW NOW. COLD. COLD. CO\n \n The ship's following communication was three hours late. It was the last on the tape—the one Kaiser had read earlier. Apparently they decided to humor him.\n \n OO IS SICK, SMOKY. DO TO BEDDY-BY. KEEP UM WARM. WHEN UM FEELS BETTER, LET USNS KNOW.\n \n \n SS II\n \n That was not much help. All it told him was that he had been sick.\n \n He felt better now, outside of a muscular weariness, as though convalescing from a long illness. He put the back of his hand to his forehead. Cool. No fever anyway.\n \n He glanced at the clock-calendar on the instrument board and back at the date and time on the tape where he'd started his baby talk. Twenty hours. He hadn't been out of his head too long. He began punching the communicator keys while he nibbled at a biscuit.\n \n SEEM TO BE FULLY RECOVERED. FEELING FINE. ANYTHING NEW FROM SAM? AND HOW ABOUT THE DAMAGE TO SCOUT? GIVE ME ANYTHING YOU HAVE ON EITHER OR BOTH.\n \n \n SMOKY\n \n Kaiser felt suddenly weary. He lay on the scout's bunk and tried to sleep. Soon he was in that phantasm land between sleep and wakefulness—he knew he was not sleeping, yet he did dream.\n \n It was the same dream he had had many times before. In it, he was back home again, the home he had joined the space service to escape. He had realized soon after his marriage that his wife, Helene, did not love him. She had married him for the security his pay check provided. And though it soon became evident that she, too, regretted her bargain, she would not divorce him. Instead, she had her revenge on him by persistent nagging, by letting herself grow fat and querulous, and by caring for their house only in a slovenly way.\n \n Her crippled brother had moved in with them the day they were married. His mind was as crippled as his body and he took an unhealthy delight in helping his sister torment Kaiser.\n \n \n\n \n Kaiser came wide awake in a cold sweat. The clock showed that only an hour had passed since he had sent his last message to the ship. Still five more long hours to wait. He rose and wiped the sweat from his neck and shoulders and restlessly paced the small corridor of the scout.\n \n After a few minutes, he stopped pacing and peered out into the gloom of Big Muddy. The rain seemed to have eased off some. Not much more than a heavy drizzle now.\n \n Kaiser reached impulsively for the slicker he had thrown over a chest against one wall and put it on, then a pair of hip-high plastic boots and a plastic hat. He opened the door. The scout had come to rest with a slight tilt when it crashed, and Kaiser had to sit down and roll over onto his stomach to ease himself to the ground.\n \n The weather outside was normal for Big Muddy: wet, humid, and warm.\n \n Kaiser sank to his ankles in soft mud before his feet reached solid ground. He half walked and half slid to the rear of the scout. Beside the ship, the \"octopus\" was busily at work. Tentacles and antennae, extending from the yard-high box of its body, tested and recorded temperature, atmosphere, soil, and all other pertinent planetary conditions. The octopus was connected to the ship's communicator and all its findings were being transmitted to the mother ship for study.\n \n Kaiser observed that it was working well and turned toward a wide, sluggish river, perhaps two hundred yards from the scout. Once there, he headed upstream. He could hear the pipings, and now and then a higher whistling, of the seal-people before he reached a bend and saw them. As usual, most were swimming in the river.\n \n \n\n \n One old fellow, whose chocolate-brown fur showed a heavy intermixture of gray, was sitting on the bank of the river just at the bend. Perhaps a lookout. He pulled himself to his feet as he spied Kaiser and his toothless, hard-gummed mouth opened and emitted a long whistle that might have been a greeting—or a warning to the others that a stranger approached.\n \n The native stood perhaps five feet tall, with the heavy, blubbery body of a seal, and short, thick arms. Membranes connected the arms to his body from shoulder-pits to mid-biceps. The arms ended in three-fingered, thumbless hands. His legs also were short and thick, with footpads that splayed out at forty-five-degree angles. They gave his legs the appearance of a split tail. About him hung a rank-fish smell that made Kaiser's stomach squirm.\n \n The old fellow sounded a cheerful chirp as Kaiser came near. Feeling slightly ineffectual, Kaiser raised both hands and held them palm forward. The other chirped again and Kaiser went on toward the main group.\n \n \n\n \n They had stopped their play and eating as Kaiser approached and now most of them swam in to shore and stood in the water, staring and piping. They varied in size from small seal-pups to full-grown adults. Some chewed on bunches of water weed, which they manipulated with their lips and drew into their mouths.\n \n They had mammalian characteristics, Kaiser had noted before, so it was not difficult to distinguish the females from the males. The proportion was roughly fifty-fifty.\n \n Several of the bolder males climbed up beside Kaiser and began pawing his plastic clothing. Kaiser stood still and tried to keep his breathing shallow, for their odor was almost more than he could bear. One native smeared Kaiser's face with an exploring paw and Kaiser gagged and pushed him roughly away. He was bound by regulations to display no hostility to newly discovered natives, but he couldn't take much more of this.\n \n A young female splashed water on two young males who stood near and they turned with shrill pipings and chased her into the water. The entire group seemed to lose interest in Kaiser and joined in the chase, or went back to other diversions of their own. Kaiser's inspectors followed.\n \n They were a mindless lot, Kaiser observed. The river supplied them with an easy existence, with food and living space, and apparently they had few natural enemies.\n \n Kaiser walked away, following the long slow bend of the river, and came to a collection of perhaps two hundred dwellings built in three haphazard rows along the river bank. He took time to study their construction more closely this time.\n \n They were all round domes, little more than the height of a man, built of blocks that appeared to be mud, packed with river weed and sand. How they were able to dry these to give them the necessary solidity, Kaiser did not know. He had found no signs that they knew how to use fire, and all apparent evidence was against their having it. They then had to have sunlight. Maybe it rained less during certain seasons.\n \n The domes' construction was based on a series of four arches built in a circle. When the base covering the periphery had been laid, four others were built on and between them, and continued in successive tiers until the top was reached. Each tier thus furnished support for the next above. No other framework was needed. The final tier formed the roof. They made sound shelters, but Kaiser had peered into several and found them dark and dank—and as smelly as the natives themselves.\n \n The few loungers in the village paid little attention to Kaiser and he wandered through the irregular streets until he became bored and returned to the scout.\n \n The Soscites II sent little that helped during the next twelve hours and Kaiser occupied his time trying again to repair the damage to the scout.\n \n The job appeared maddeningly simply. As the scout had glided in for a soft landing, its metal bottom had ridden a concealed rock and bent inward. The bent metal had carried up with it the tube supplying the fuel pump and flattened it against the motor casing.\n \n \n\n \n Opening the tube again would not have been difficult, but first it had to be freed from under the ship. Kaiser had tried forcing the sheet metal back into place with a small crowbar—the best leverage he had on hand—but it resisted his best efforts. He still could think of no way to do the job, simple as it was, though he gave his concentration to it the rest of the day.\n \n That evening, Kaiser received information from the Soscites II that was at least definite:\n \n SET YOURSELF FOR A SHOCK, SMOKY. SAM FINALLY CAME THROUGH. YOU WON'T LIKE WHAT YOU HEAR. AT LEAST NOT AT FIRST. BUT IT COULD BE WORSE. YOU HAVE BEEN INVADED BY A SYMBIOTE—SIMILAR TO THE TYPE FOUND ON THE SAND WORLD, BARTEL-BLEETHERS. GIVE US A FEW MORE HOURS TO WORK WITH SAM AND WE'LL GET YOU ALL THE PARTICULARS HE CAN GIVE US. HANG ON NOW!\n \n \n SOSCITES II\n \n Kaiser's reply was short and succinct:\n \n WHAT THE HELL?\n \n SMOKY\n  Soscites II's next communication followed within twenty minutes and was signed by the ship's doctor:\n \n JUST A FEW WORDS, SMOKY, IN CASE YOU'RE WORRIED. I THOUGHT I'D GET THIS OFF WHILE WE'RE WAITING FOR MORE INFORMATION FROM SAM. REMEMBER THAT A SYMBIOTE IS NOT A PARASITE. IT WILL NOT HARM YOU, EXCEPT INADVERTENTLY. YOUR WELFARE IS AS ESSENTIAL TO IT AS TO YOU. ALMOST CERTAINLY, IF YOU DIE, IT WILL DIE WITH YOU. ANY TROUBLE YOU'VE HAD SO FAR WAS PROBABLY CAUSED BY THE SYMBIOTE'S DIFFICULTY IN ADJUSTING ITSELF TO ITS NEW ENVIRONMENT. IN A WAY, I ENVY YOU. MORE LATER, WHEN WE FINISH WITH SAM.\n \n \n J. G. ZARWELL\n \n Kaiser did not answer. The news was so startling, so unforeseen, that his mind refused to accept the actuality. He lay on the scout's bunk and stared at the ceiling without conscious attention, and with very little clear thought, for several hours—until the next communication came in:\n \n WELL, THIS IS WHAT SAM HAS TO SAY, SMOKY. SYMBIOTE AMICABLE AND APPARENTLY SWIFTLY ADAPTABLE. YOUR CHANGING COLOR, DIFFICULTY IN EATING AND EVEN BABY TALK WERE THE RESULT OF ITS EFFORTS TO GIVE YOU WHAT IT BELIEVED YOU NEEDED OR WANTED.\n \n CHANGING COLOR: PROTECTIVE CAMOUFLAGE. TROUBLE KEEPING FOOD DOWN: IT KEPT YOUR STOMACH EMPTY BECAUSE IT SENSED YOU WERE IN TROUBLE AND MIGHT HAVE NEED FOR SHARP REFLEXES, WITH NO EXCESS WEIGHT TO CARRY. THE BABY TALK WE AREN'T TOO CERTAIN ABOUT, BUT OUR BEST CONCLUSION IS THAT WHEN YOU WERE A CHILD, YOU WERE MOST HAPPY. IT WAS TRYING TO GIVE YOU BACK THAT HAPPY STATE OF MIND. OBVIOUSLY IT QUICKLY RECOGNIZED THE MISTAKES IT MADE AND CORRECTED THEM.\n \n SAM CAME UP WITH A FEW MORE IDEAS, BUT WE WANT TO WORK ON THEM A BIT BEFORE WE SEND THEM THROUGH. SLEEP ON THIS.\n \n \n SS II\n \n \n\n \n Kaiser could imagine that most of the crew were not too concerned about the trouble he was in. He was not the gregarious type and had no close friends on board. He had hoped to find the solitude he liked best in space, but he had been disappointed. True, there were fewer people here, but he was brought into such intimate contact with them that he would have been more contented living in a crowded city.\n \n His naturally unsociable nature was more irksome to the crew because he was more intelligent and efficient than they were. He did his work well and painstakingly and was seldom in error. They would have liked him better had he been more prone to mistakes. He was certain that they respected him, but they did not like him. And he returned the dislike.\n \n The suggestion that he get some sleep might not be a bad idea. He hadn't slept in over eighteen hours, Kaiser realized—and fell instantly asleep.\n \n The communicator had a message waiting for him when he awoke:\n \n SAM COULDN'T HELP US MUCH ON THIS PART, BUT AFTER RESEARCH AND MUCH DISCUSSION, WE ARRIVED AT THE FOLLOWING TWO CONCLUSIONS.\n \n FIRST, PHYSICAL PROPERTY OF SYMBIOTE IS EITHER THAT OF A VERY THIN LIQUID OR, MORE PROBABLY, A VIRUS FORM WITH SWIFT PROPAGATION CHARACTERISTIC. IT UNDOUBTEDLY LIVES IN YOUR BLOOD STREAM AND PERMEATES YOUR SYSTEM.\n \n SECOND, IT SEEMED TO US, AS IT MUST HAVE TO YOU, THAT THE SYMBIOTE COULD ONLY KNOW WHAT YOU WANTED BY READING YOUR MIND. HOWEVER, WE BELIEVE DIFFERENTLY NOW. WE THINK THAT IT HAS SUCH CLOSE CONTACT WITH YOUR GLANDS AND THEIR SECRETIONS, WHICH STIMULATE EMOTION, THAT IT CAN GAUGE YOUR FEELINGS EVEN MORE ACCURATELY THAN YOU YOURSELF CAN. THUS IT CAN JUDGE YOUR LIKES AND DISLIKES QUITE ACCURATELY.\n \n WE WOULD LIKE TO HAVE YOU TEST OUR THEORY. THERE ARE DOZENS OF WAYS. IF YOU ARE STUMPED AND NEED SUGGESTIONS, JUST LET US KNOW. WE AWAIT WORD FROM YOU WITH GREAT INTEREST.\n \n \n SS II\n \n By now, Kaiser had accepted what had happened to him. His distress and anxiety were gone and he was impatient to do what he could to establish better contact with his uninvited tenant. With eager anticipation, he set to thinking how it could be done. After a few minutes, an idea occurred to him.\n \n Taking a small scalpel from a medical kit, he made a shallow cut in his arm, just deep enough to bleed freely. He knew that the pain would supply the necessary glandular reaction. The cut bled a few slow drops—and as Kaiser watched, a shiny film formed and the bleeding stopped.\n \n That checked pretty well with the ship's theory.\n \n Perhaps the symbiote had made his senses more acute. He tried closing his eyes and fingering several objects in the room. It seemed to him that he could determine the texture of each better than before, but the test was inconclusive. Walking to the rear of the scout, he tried reading the printed words on the instrument panel. Each letter stood out sharp and clear!\n \n Kaiser wondered if he might not make an immediate, practical use of the symbiote's apparent desire to help him. Concentrating on the discomfort of the high humidity and exaggerating his own displeasure with it, he waited. The result surprised and pleased him.\n \n The temperature within the scout cabin seemed to lower, the moisture on his body vanished, and he was more comfortable than he had yet been here.\n \n As a double check, he looked at the ship's thermometer. Temperature\n102, humidity 113—just about the same as it had been on earlier readings.\n \n \n\n \n During the next twenty-four hours, Kaiser and the mother ship exchanged messages at regular six-hour intervals. In between, he worked at repairing the damaged scout. He had no more success than before.\n \n He tired easily and lay on the cot often to rest. Each time he seemed to drop off to sleep immediately—and awake at the exact times he had decided on beforehand. At first, despite the lack of success in straightening the bent metal of the scout bottom, there had been a subdued exhilaration in reporting each new discovery concerning the symbiote, but as time passed, his enthusiasm ebbed. His one really important problem was how to repair the scout and he was fast becoming discouraged.\n \n At last Kaiser could bear the futility of his efforts no longer. He sent out a terse message to the Soscites II :\n \n TAKING SHORT TRIP TO ANOTHER LOCATION ON RIVER. HOPE TO FIND MORE INTELLIGENT NATIVES. COULD BE THAT THE SETTLEMENT I FOUND HERE IS ANALOGOUS TO TRIBE OF MONKEYS ON EARTH. I KNOW THE CHANCE IS SMALL, BUT WHAT HAVE I TO LOSE? I CAN'T FIX SCOUT WITHOUT BETTER TOOLS, AND IF MY GUESS IS RIGHT, I MAY BE ABLE TO GET EQUIPMENT. EXPECT TO RETURN IN TEN OR TWELVE HOURS. PLEASE KEEP CONTACT WITH SCOUT.\n \n \n SMOKY\n \n Kaiser packed a mudsled with tent, portable generator and guard wires, a spare sidearm and ammunition, and food for two days. He had noticed that a range of high hills, which caused the bend in the river at the native settlement, seemed to continue its long curve, and he wondered if the hills might not turn the river in the shape of a giant horseshoe. He intended to find out.\n \n Wrapping his equipment in a plastic tarp, Kaiser eased it out the doorway and tied it on the sled. He hooked a towline to a harness on his shoulders and began his journey—in the opposite direction from the first native settlement.\n \n He walked for more than seven hours before he found that his surmise had been correct. And a second cluster of huts, and seal-people in the river, greeted his sight. He received a further pleasant surprise. This group was decidedly more advanced than the first!\n \n They were little different in actual physical appearance; the change was mainly noticeable in their actions and demeanor. And their odor was more subdued, less repugnant.\n \n By signs, Kaiser indicated that he came in peace, and they seemed to understand. A thick-bodied male went solemnly to the river bank and called to a second, who dived and brought up a mouthful of weed. The first male took the weed and brought it to Kaiser. This was obviously a gesture of friendship.\n \n The weed had a white starchy core and looked edible. Kaiser cleaned part of it with his handkerchief, bit and chewed it.\n \n The weed had a slight iron taste, but was not unpalatable. He swallowed the mouthful and tried another. He ate most of what had been given him and waited with some trepidation for a reaction.\n \n \n\n \n As dusk fell, Kaiser set up his tent a few hundred yards back from the native settlement. All apprehension about how his stomach would react to the river weed had left him. Apparently it could be assimilated by his digestive system. Lying on his air mattress, he felt thoroughly at peace with this world.\n \n Once, just before dropping off to sleep, he heard the snuffling noise of some large animal outside his tent and picked up a pistol, just in case. However, the first jolt of the guard-wire charge discouraged the beast and Kaiser heard it shuffle away, making puzzled mewing sounds as it went.\n \n The next morning, Kaiser left off all his clothes except a pair of shorts and went swimming in the river. The seal-people were already in the water when he arrived and were very friendly.\n \n That friendliness nearly resulted in disaster. The natives crowded around as he swam—they maneuvered with an otter-like proficiency—and often nudged him with their bodies when they came too close. He had difficulty keeping afloat and soon turned and started back. As he neared the river edge, a playful female grabbed him by the ankle and pulled him under.\n \n Kaiser tried to break her hold, but she evidently thought he was clowning and wrapped her warm furred arms around him and held him helpless. They sank deeper.\n \n When his breath threatened to burst from his lungs in a stream of bubbles, and he still could not free himself, Kaiser brought his knee up into her stomach and her grip loosened abruptly. He reached the surface, choking and coughing, and swam blindly toward shore until his feet hit the river bottom.\n \n As he stood on the bank, getting his breath, the natives were quiet and seemed to be looking at him reproachfully. He stood for a time, trying to think of a way to explain the necessity of what he had done, but there was none. He shrugged helplessly.\n \n There was no longer anything to be gained by staying here—if they had the tools he needed, he had no way of finding out or asking for them—and he packed and started back to the scout.\n \n Kaiser's good spirits returned on his return journey. He had enjoyed the relief from the tedium of spending day after day in the scout, and now he enjoyed the exercise of pulling the mudsled. Above the waist, he wore only the harness and the large, soft drops of rain against his bare skin were pleasant to feel.\n \n When he reached the scout, Kaiser began to unload the sled. The tarpaulin caught on the edge of a runner and he gave it a tug to free it. To his amazement, the heavy sled turned completely over, spilling the equipment to the ground.\n \n Perplexed, Kaiser stooped and began replacing the spilled articles in the tarp. They felt exceptionally light. He paused again, and suddenly his eyes widened.\n \n \n\n \n Moving quickly to the door of the scout, he shoved his equipment through and crawled in behind it. He did not consult the communicator, as he customarily did on entering, but went directly to the warped place on the floor and picked up the crowbar he had laid there.\n \n Inserting the bar between the metal of the scout bottom and the engine casing, he lifted. Nothing happened. He rested a minute and tried again, this time concentrating on his desire to raise the bar. The metal beneath yielded slightly—but he felt the palms of his hands bruise against the lever.\n \n Only after he dropped the bar did he realize the force he had exerted. His hands ached and tingled. His strength must have been increased tremendously. With his plastic coat wrapped around the lever, he tried again. The metal of the scout bottom gave slowly—until the fuel pump hung free!\n \n Kaiser did not repair the tube immediately. He let the solution rest in his hands, like a package to be opened, the pleasure of its anticipation to be enjoyed as much as the final act.\n \n He transmitted the news of what he had been able to do and sat down to read the two messages waiting for him.\n \n The first was quite routine:\n \n REPORTS FROM THE OCTOPUS INDICATE THAT BIG MUDDY UNDERGOES RADICAL WEATHER-CYCLE CHANGES DURING SPRING AND FALL SEASONS, FROM EXTREME MOISTURE TO EXTREME ARIDITY. AT HEIGHT OF DRY SEASON, PLANET MUST BE COMPLETELY DEVOID OF SURFACE LIQUID.\n \n TO SURVIVE THESE UNUSUAL EXTREMES, SEAL-PEOPLE WOULD NEED EXTREME ADAPTABILITY. THIS VERIFIES OUR EARLIER GUESS THAT NATIVES HAVE SYMBIOSIS WITH THE SAME VIRUS FORM THAT INVADED YOU. WITH SYMBIOTES' AID, SUCH RADICAL PHYSICAL CHANGE COULD BE POSSIBLE. WILL KEEP YOU INFORMED.\n \n GIVE US ANY NEW INFORMATION YOU MIGHT HAVE ON NATIVES.\n \n \n SS II\n \n The second report was not so routine. Kaiser thought he detected a note of uneasiness in it.\n \n SUGGEST YOU DEVOTE ALL TIME AND EFFORT TO REPAIR OF SCOUT. INFORMATION ON SEAL-PEOPLE ADEQUATE FOR OUR PURPOSES.\n \n \n SS II\n \n Kaiser did not answer either communication. His earlier report had covered all that he had learned lately. He lay on his cot and went to sleep.\n \n In the morning, another message was waiting:\n \n VERY PLEASED TO HEAR OF PROGRESS ON REPAIR OF SCOUT. COMPLETE AS QUICKLY AS POSSIBLE AND RETURN HERE IMMEDIATELY.\n \n \n SS II\n \n \n\n \n Kaiser wondered about the abrupt recall. Could the Soscites II be experiencing some difficulty? He shrugged the thought aside. If they were, they would have told him. The last notes had had more than just a suggestion of urgency—there appeared to be a deliberate concealing of information.\n \n Strangely, the messages indicated need for haste did not prod Kaiser. He knew now that the job could be done, perhaps in a few hours' time. And the Soscites II would not complete its orbit of the planet for two weeks yet.\n \n Without putting on more than the shirt and trousers he had grown used to wearing, Kaiser went outside and wandered listlessly about the vicinity of the ship for several hours. When he became hungry, he went back inside.\n \n Another message came in as he finished eating. This one was from the captain himself:\n \n WHY HAVE WE RECEIVED NO VERIFICATION OF LAST INSTRUCTIONS? REPAIR SCOUT IMMEDIATELY AND RETURN WITHOUT FURTHER DELAY. THIS IS AN ORDER!\n \n \n H. A. HESSE, CAPT.\n \n Kaiser pushed the last of his meal—which he had been eating with his fingers—into his mouth, crumpled the tape, wiped the grease from his hands with it and dropped it to the floor.\n \n He pondered mildly, as he packed his equipment, why he was disregarding the captain's message. For some reason, it seemed too trivial for serious consideration. He placated his slightly uneasy conscience only to the extent of packing the communicator in with his other equipment. It was a self-contained unit and he'd be able to receive messages from the ship on his trip.\n \n \n\n \n The tracks of his earlier journey had been erased by the soft rain, and when Kaiser reached the river, he found that he had not returned to the village he had visited the day before. However, there were other seal-people here.\n \n And they were almost human!\n \n The resemblance was still not so much in their physical makeup—that was little changed from the first he had found—as in their obviously greater intelligence.\n \n This was mainly noticeable in their facile expressions as they talked. Kaiser was even certain that he read smiles on their faces when he slipped on a particularly slick mud patch as he hurried toward them. Where the members of the first tribes had all looked almost exactly alike, these had very marked individual characteristics. Also, these had no odor—only a mild, rather pleasing scent. When they came to meet him, Kaiser could detect distinct syllabism in their pipings.\n \n Most of the natives returned to the river after the first ten minutes of curious inspection, but two stayed behind as Kaiser set up his tent.\n \n One was a female.\n \n They made small noises while he went about his work. After a time, he understood that they were trying to give names to his paraphernalia. He tried saying \"tent\" and \"wire\" and \"tarp\" as he handled each object, but their piping voices could not repeat the words. Kaiser amused himself by trying to imitate their sounds for the articles. He was fairly successful. He was certain that he could soon learn enough to carry on a limited conversation.\n \n The male became bored after a time and left, but the girl stayed until Kaiser finished. She motioned to him then to follow. When they reached the river bank, he saw that she wanted him to go into the water.\n \n \n\n \n Before he had time to decide, Kaiser heard the small bell of the communicator from the tent behind him. He stood undecided for a moment, then returned and read the message on the tape:\n \n STILL ANXIOUSLY AWAITING WORD FROM YOU.\n \n IN MEANTIME, GIVE VERY CLOSE ATTENTION TO FOLLOWING.\n \n WE KNOW THAT THE SYMBIOTES MUST BE ABLE TO MAKE RADICAL CHANGES IN THE PHYSIOLOGY OF THE SEAL-PEOPLE. THERE IS EVERY PROBABILITY THAT YOURS WILL ATTEMPT TO DO THE SAME TO YOU—TO BETTER FIT YOUR BODY TO ITS PRESENT ENVIRONMENT.\n \n THE DANGER, WHICH WE HESITATED TO MENTION UNTIL NOW—WHEN YOU HAVE FORCED US BY YOUR OBSTINATE SILENCE—IS THAT IT CAN ALTER YOUR MIND ALSO. YOUR REPORT ON SECOND TRIBE OF SEAL-PEOPLE STRONGLY INDICATES THAT THIS IS ALREADY HAPPENING. THEY WERE PROBABLY NOT MORE INTELLIGENT AND HUMANLIKE THAN THE OTHERS. ON THE CONTRARY, YOU ARE BECOMING MORE LIKE THEM.\n \n DANGER ACUTE. RETURN IMMEDIATELY. REPEAT: IMMEDIATELY!\n \n \n SS II\n \n Kaiser picked up a large rock and slowly, methodically pounded the communicator into a flattened jumble of metal and loose parts.\n \n When he finished, he returned to the waiting girl on the river bank. She pointed at his plastic trousers and made laughing sounds in her throat. Kaiser returned the laugh and stripped off the trousers. They ran, still laughing, into the water.\n \n Already the long pink hair that had been growing on his body during the past week was beginning to turn brown at the roots.",
      "metadata": {
        "title": "Growing Up on Big Muddy",
        "author": "Charles V. De Vet",
        "passage_id": "51398",
        "uid": "2d5944e773f4468b9ff69249488cceb8",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "113",
                "uid": "163c2f9b2a434a38b550e728a7509e88",
                "response_text": "Kaiser is a young man who was unhappily married and decided to join space service to escape his wife and her brother. He was on the mothership, Soscites II, that was finishing its planet-mapping tour. The team put him in a scout ship and sent him to the planet he calls Big Muddy. During the landing, the scout’s bottom bent inward and flattened the fuel tube. At some point, Kaiser finds himself lost because he doesn’t remember what was happening in the last hours, only the fact that he must fix the scout during the next few weeks. He reads the message tape with the mothership and learns that he had a swollen arm, a fever, periods of blankness, and in the middle of the exchange, he started using baby-talk. Now Kaiser feels better and asks for some information on fixing the scout from the mothership’s team. Then, he walks around the scout, looks at the “octopus” testing the environment of Big Muddy, and heads toward a sluggish river and native seal-people. They are short, with the body of a seal, thick arms, and thumbless hands, and have mammalian characteristics. The man spends some time observing them and then looks at their domed buildings. Soon the mothership informs Kaiser that he has probably been invaded by a symbiote, though it is not supposed to harm him. It’s adaptable and tried to give Kaiser what he emotionally desired. Hours later, the team adds that the symbiote can accurately gauge his feelings, and he needs to test this. Kaiser makes a shallow cut - it immediately heels, his sensory perception improves, and now he can control how humidity affects him. He spends a day trying to repair the scout and then leaves for a day walking trip. He meets another group of seal-people. They seem more advanced than the first ones. Kaiser sleeps in a tent and, in the morning, swims with the natives until one of them starts playfully drowning him. He comes back to his ship and realizes that his physical strength has improved. Kaiser manages to partially fix the metal bottom and report the events of the day to the mothership. They tell him that the natives probably have the symbiote and then order him to repair the ship as soon as possible. In the morning, they repeat that he needs to leave very soon, which puzzles Kaiser. The captain sends an angry message with the order to finish repairing the scout. Kaiser goes to the river and takes the communicator with him. The natives look almost human-like now and use syllabism. A female native invites him to the river, but Kaiser hears that the communicator received a message. He walks back and reads that the team has a suspicion the symbiote can alter Kaiser’s mind. The second group of seal-people was not more advanced - he just became more like them. The man destroys the communicator and follows the girl to the river. "
              },
              {
                "worker_id": "107",
                "uid": "21e4a189e19443faa928fe35e8d04519",
                "response_text": "Kaiser is busy trying to figure out the strange communication from the tape in his hand, but he is also annoyed by the rainy climate outside. He tries to think back to the baby talk but finds it hard to even remember what he was doing here. Kaiser knows that he has to repair the scout ship, or else he will be stuck here forever. The mothership, Soscites II, has set itself into orbit around the Big Muddy ship, which is why he only has a month to repair the ship. The message he sends from himself is about the seal-people and repairing the scout ship, and the ship responds with a message about how this information has been given to Sam. He responds with a list of his symptoms, and the ship asks for more information. Kaiser wonders why some of his messages are sending in baby talk, but the ship says that everything is perfectly legible. However, after the last message, he does feel better and sends another one to the ship for more information. Kaiser dreams about his wife Helene and their loveless marriage, waking up in a cold sweat an hour later. He decides to go outside, observing how the octopus part of the scout ship is busy sending everything to the mothership. Kaiser goes to visit the seal-people again, and they chirp when he comes close. Some of the seal-people come up to him, but the smell of fish is too much for him to bear. He finds that they are a mindless lot and decides to explore the round domes. For the rest of the day, Kaiser tries to figure out how to fix his scout ship because the Soscites II sent little to no help. The ship tells him that he has been invaded by a symbiote, but it is not dangerous because the symbiote will die with Kaiser if he dies. It also explains the baby talk, as the symbiote was trying to give him what it thought he needed. It is revealed the crew does not like him much because he is intelligent and not prone to mistakes. Later, he accepts that he will live with the symbiote and goes to observe the seal-people again. This new group seems more advanced than the other, and they even give him seaweed as a gesture of friendship. Kaiser goes to swim the next day, and the locals are extremely friendly as they try to play with him in the water. When he goes back to his ship, he finds equipment and begins to put work into repairing the scout. The mothership sends him messages to come back, but they deliberately conceal information.  He also finds out that the seal-people are becoming more human like now, and a female even stays to watch him repair. During his last communication with the ship, he smashes the communicator and joins the female as they run to the river bank to play. "
              },
              {
                "worker_id": "109",
                "uid": "3ec0f1fa519a4ba0be15084ff10bd240",
                "response_text": "This story follows Kaiser in his scout ship as he is grounded upon Big Muddy. He is temporarily separated from his mother ship, Soscites II, as the mothership takes an orbit around the planet. Kaiser is grounded because his scout is broken, and he does not have the appropriate equipment to fix it. \n\nIn his communications log with the mother ship, it is revealed that Kaiser had fallen ill.  After he recovered, he took a trip to observe the seal-people. They had been swimming and eating by the river bank and paused in curiosity as Kaiser approached.  Alongside the riverbank lay a few hundred dwellings - round domes built with mud bricks. \n\nUpon receiving more information from the ship, Kaiser and the crew find out that the symbiote is harmless to humans. Any of his prior illnesses was perhaps the symbiote adjusting his body to the new environment and correcting any subsequent mistakes it may have made. In addition, the symbiote can only know what Kaiser wants by reading his mind. At this theory, the crew urged Kaiser to perform his own tests to see if it was true. He tested this theory by changing his body temperature and checking that the room temperature stayed the same, and confirmed it to be true. \n\nKaiser then took another trip,  hoping to find more intelligent natives. He found a group of seal-people that seemed more intelligence in their actions and has less of an odor to them. The next morning, he went swimming with the seal-people and they crowded around him in a friendly manner. However, their overeagerness to play nearly caused Kaiser to drown, and so he headed back to the scout. There, he accidentally turned a sled and found the equipment. He was able to concentrate and fix part of the scout using his mind and tools. As he sent off the news to the ship, he read his messages. \n\nIt appears that Big Muddy undergoes two drastic seasonal changes - extreme moisture and aridity. As a result, the seal-people must be able to physically adapt in order to survive. SS II informs Kaiser that it is due to the natives also having symbiosis, and that all efforts should be devoted to fixing the scout and returning home. Though noting the urgency behind the messages, Kaiser still chose to take another trip to the river banks. This time, he noticed that the seal-people looked almost human and he could detect syllabism in their speech. \n\nIn a frantic last message from the ship, Kaiser learned that the symbiotes have already begun altering Kaiser in more sinister ways. His perceptions on finding seal-peole becoming more intelligent and human-like wasn't actually because of that, but because he himself was becoming more seal-like. The symbiote is able to alter his mind and physical state, and already has. After reading the message, Kaiser picked up a rock to destroy the device, and happily returned to the girl on river bank and they swam in the water. "
              },
              {
                "worker_id": "111",
                "uid": "f057c39401214a3e94bc236af890c552",
                "response_text": "The story follows Kaiser, a human who gets stranded on a new planet. He is a part of a space expedition, and after his ship crash lands he only has one month to fix his scout ship and return to the large ship. He can communicate with the large ship using a typing system, and it is revealed that he has been communicating with the crew because he had been feeling sick. Kaiser also interacted with the natives of the planet, which are described to be seal-people. The ship’s doctor informed Kaiser that his symptoms most likely come from a symbiote which inhabited his body, but that there is no reason for concern, as the symbiotic relationship can help both the symbiote and Kaiser. Kaiser struggled with this news for a while, but then realized that it could be a good thing. The symbiote allowed Kaiser to control his feelings better, and even helped him physically. Kaiser then went on a journey to a new village of the natives in order to search for tools that could help him repair the ship. Here, he interacted very well with the natives, and felt happy doing so. After coming back, he realized that the symbiote was giving him extra strength and managed to repair the ship. When the ship told him to immediately come back, he started to doubt his desire to go back. He went back to the original village of the seal-people, taking with him a transportable communication device. He seemed to be very happy with the seal-people, having fun and interacting with females. The ship sent him a message telling him that there is a lot of urgency in his order for Kaiser to go up, as the symbiote was adapting his body and mind to the planet. Kaiser responded to this message by breaking the communication device and going back to the river with the seal-people. "
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "113",
                "uid": "163c2f9b2a434a38b550e728a7509e88",
                "response_text": "Kaiser left Earth on a mothership Soscites II, that soon, finishing its planet-mapping tour, approached a planet that the man named Big Muddy. He left the spacecraft in a small scout ship - which had a pilot chair, a communicator, and a bunk - and landed on the muddy surface. The other seven scouts got lost during the previous exploration of new worlds. It is wet, humid, and warm on Big muddy, constantly raining with different intensity. There is a wide sluggish river, which has the shape of a horseshoe, two hundred yards away from the scout and also a chain of hills. Farther, along the stream, there is a group of several hundred domed dwellings, built of mud blocks, packed with river weed and sand. Another group of seal-people lives near the riverbank in the opposite direction of Kaiser's first observational walk. "
              },
              {
                "worker_id": "107",
                "uid": "21e4a189e19443faa928fe35e8d04519",
                "response_text": "The story is set on a planet that Kaiser has named the Big Muddy. It is extremely wet, warm, and humid. There is also a village of seal-people nearby, and they have huts alongside the river bank. Kaiser’s scout ship has places for controls and also to sleep. In the village, there are also round domes that were based on construction of a series of four arches in a circle. The climate also changes on the planet, which is why the seal-people change as time goes on. Although it rains a lot in general, there are seasons where it rains less than the others. This is evident because the domes are built by river weed, mud, and sand. Even though the seal-people do not know how to use fire, it is evident that there must be times where it rains less in order for them to build these domes. "
              },
              {
                "worker_id": "109",
                "uid": "3ec0f1fa519a4ba0be15084ff10bd240",
                "response_text": "This story takes placed on Big Muddy. The current climate on this planet when Kaiser arrives is wet, humid and warm - and constantly raining. The landscape includes many river banks where the natives spend time, and the ground is often muddy and slippery. \n\nAlongside the riverbank, there are also two hundred dwellings. These dwellings - round domes - are constructed from bricks built from a dried combination of mud, river weed, and sand. The dome was built by constructing four arches ranging in a circle, with the roof forming the final layer. \n\n"
              },
              {
                "worker_id": "111",
                "uid": "f057c39401214a3e94bc236af890c552",
                "response_text": "The story is set on a planet in which there is little human presence. After Kaiser crashes on this planet, he is stuck on a small metal ship trying to fix it. The planet is described to be very rainy and humid, but it is also mentioned that the planet constantly changes weather. The weather can vary from very rainy and humid to very arid and sunny. The planet is inhabited by native seal-people. These natives live in settlements around the bank of a curling river, in small huts made from mud. The planet is also mentioned to have large foothills around the river. \n"
              }
            ]
          },
          {
            "question_text": "What is the importance of the seal-people in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "113",
                "uid": "163c2f9b2a434a38b550e728a7509e88",
                "response_text": "Kaiser’s perception of the native groups of seal-people represents how his body is affected by the symbiote that has invaded his system. The first time the man sees them, he considers them mindless repulsive creatures with an unbearable odor and no proper communication system. The second meeting changes his opinion about them - now they seem more advanced in their demeanor and actions, friendlier, and their smell is less repugnant. This change in perception shows that Kaiser has already started changing, becoming more like them. The last meeting with the seal-people makes the man believe that they have more individualistic characteristics. They don’t have the bad odor anymore, just a pleasant scent. They use distinct syllabism, and, finally, living with them and swimming in the river seems more appealing to him than going back to the Soscites II. These seal-people have the same symbiote, which has altered their appearance and mind. At the end, Kaiser practically becomes one of them. "
              },
              {
                "worker_id": "107",
                "uid": "21e4a189e19443faa928fe35e8d04519",
                "response_text": "The seal-people are the only other signs of life that Kaiser interacts with in the story. Although they are not very intelligent, they are friendly and somewhat harmless. Since Kaiser is trapped anyways, he usually finds time to go visit the seal-people and see any developments in the village. The seal-people are also important because they are infected with the symbiote that Kaiser becomes affected by, changing their appearances to better suit the climate changes that happen on the Big Muddy. As Kaiser spends more time with them, he realizes that they are not as bad as he thinks they are because they can change themselves. As Kaiser eventually chooses to abandon communication with the mother ship and join the seal-people, they have almost become his new family in a sense. "
              },
              {
                "worker_id": "109",
                "uid": "3ec0f1fa519a4ba0be15084ff10bd240",
                "response_text": "The native seal-creatures in the story are important because their very existence unlocks a lot of answers that both Kaiser and those aboard the SS II seek. For one, Big Muddy is said to undergo extreme weather cycle changes between the spring and fall seasons, for which the natives are only able to survive through because of their adaptability. This adaptability is only possible due to the symbiotes that have invaded Kaiser, allowing them such physical change. \n\nThis alludes to what is happening to Kaiser. On his second and third explorations, he supposedly finds seal-people that have become more human-like and intelligence. As we now know by learning about the seal-people, it was less so about the seals being more intelligence but Kaiser becoming more seal-like through this symbiote enacting the physical change. \n"
              },
              {
                "worker_id": "111",
                "uid": "f057c39401214a3e94bc236af890c552",
                "response_text": "The seal-people are the native settlers of the planet in which Kaiser crashes. They are described to be half-seal and half-human. They have short hands with 3 fingers, and fin-like feet that allow them to walk on land. They are also very furry, with their color varying. At the beginning of the story, they are described as being unintelligent but friendly. After Kaiser visits a new village, they begin to be more intelligent and Kaiser can communicate with them better. At the end, Kaiser enjoys spending time with them and is showing signs of becoming one of them. \n"
              }
            ]
          },
          {
            "question_text": "What is the importance of the communication device in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "113",
                "uid": "163c2f9b2a434a38b550e728a7509e88",
                "response_text": "The communicator allows Kaiser to receive messages from the mothership and its team. It’s the only mechanism that connects him to other intelligent human beings. Throughout the story, these messages help him understand why he had a fever, swelling, a brief period of blankness, and why he used baby-talk. Using the communication device, the mothership’s team and scientists explain to Kaiser what kind of symbiote lives in his body and how it can gauge his emotional reactions and adapt to various environmental and mental triggers. They manage to ask Keiser to test their theory and later inform him of their findings regarding the planet's climate. They use the tape to order Kaiser to return as soon as possible and finally tell him that the symbiote is probably changing his mind and turning him into someone equal in intelligence to the seal-people. "
              },
              {
                "worker_id": "107",
                "uid": "21e4a189e19443faa928fe35e8d04519",
                "response_text": "The communication device is what lets Kaiser continue communicating with the mother ship. Without it, he would not have been able to form any form of communication and try to find a solution to his problem. Although the mothership is not helpful in terms of helping him repair the scout ship, he does report to them his symptoms of illness. He gets all of his instructions from them, and they are the ones to diagnose him of having a symbiote in his body. The communication device ties Kaiser to his mission, and he would not be able to receive instructions for the next step if he did not have the communication device. At the end of the story, however, Kaiser sees the communication device as a hindrance because he has no close friends in the crew anyways. He destroys, finally setting himself free from the mothership. "
              },
              {
                "worker_id": "109",
                "uid": "3ec0f1fa519a4ba0be15084ff10bd240",
                "response_text": "The communication device is the only linkage Kaiser has to his crewmates aboard the SS II, and it is the only way Kaiser is able to get verified information (i.e. about his sickness, then later, the seal-creatures). It emphasizes the distance between Kaiser and everybody else. \n\nIt builds tension in the story as communications only come after a period of delivery time. In addition, the messages that come through are often unfinished in the sense that not the full truth of information is provided. "
              },
              {
                "worker_id": "111",
                "uid": "f057c39401214a3e94bc236af890c552",
                "response_text": "The communication device is the only form of communication that Kaiser has with his crew in the large ship. Kaiser was feeling very sick at the beginning of the story, even forgetting parts of what he did. This communication system allowed him to communicate with the ship’s doctor and understand what was going on with him. The communication also allowed Kaiser to understand the implications of his new symbiote. In the end, the communications that the crew sent Kaiser showed the negative effects of the symbiote, and how it would slowly turn Kaiser into a seal-person. "
              }
            ]
          },
          {
            "question_text": "What is the importance of the baby talk in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "113",
                "uid": "163c2f9b2a434a38b550e728a7509e88",
                "response_text": "The fact that Kaiser at some point uses baby-talk helps Sam and other members of the Soscites II team determine what exactly caused Kaiser’s symptoms and how it can analyze his emotions and use them to give his body what it needs. The main reason why the man uses baby-talk seems to be that he was most happy in his childhood which also underscores his alienation from people, that he is a loner. Kaiser went to space to run away from his wife and her brother, his colleagues respect him but do not like him, and none of them is Kaiser’s friend. He’s naturally unsociable and was happier when he was a kid. "
              },
              {
                "worker_id": "107",
                "uid": "21e4a189e19443faa928fe35e8d04519",
                "response_text": "The baby talk that Kaiser experiences is important because it is the effect of the symbiote being in his body. Without the baby talk, the ship would not have accurately determined that there is a symbiote in his body. It also sets off the story, because Kaiser would otherwise believe that he is perfectly fine on the planet. Although he is confused by the baby talk, he does realize that it disappears later. It is an effect of the symbiote, trying to bring him back to a happier time in his life which was childhood. Without the baby talk, it would have been impossible for Kaiser and the rest of the ship to realize the symbiote. It also later directly affects how Kaiser makes the choices regarding the seal-people and how he eventually destroys the communication device to join them. "
              },
              {
                "worker_id": "109",
                "uid": "3ec0f1fa519a4ba0be15084ff10bd240",
                "response_text": "The baby talk is important because it is a clear sign of the symbiote having entered Kaiser's system and adapting him. His other symptoms like changing color or having trouble keeping food down could have been reasoned to a flu or virus, so the baby talk symptom was an important distinction for the doctor and those aboard SS II to identify what was going on. \n\nAdditionally, the reason behind the baby talk appearing hinted at why Kaiser may have more easily given into staying on Big Muddy and transforming into the seal-life creatures. Sam had said the symbiote instilled baby talk back into Kaiser because it believed that Ksier was most happy when he was a child - and wanted to provide Kaiser with this happy state of mind. This, along with Kaiser's feeling lonely and tormented aboard the SS and on Earth respectively, makes sense why Kaiser might choose another way of life for himself and his happiness. "
              },
              {
                "worker_id": "111",
                "uid": "f057c39401214a3e94bc236af890c552",
                "response_text": "The baby talk is one of the symptoms that Kaiser shows at the beginning of the story. While communicating with the ship, he sent the ship weird messages. These messages replicated how babies talk. The ship’s doctor told Kaiser that it was a symptom of the symbiote entering Kaiser’s body, and that the baby talk could be explained. The symbiote wanted Kaiser to feel happy, and it believed that Kaiser had been most happy when he was a baby, so the symbiote tried to replicate those feelings. Overall, the baby talk was the initial sign of the control that the symbiote would have over Kaiser and his body, eventually leading to Kaiser slowly turning into a seal-person."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5555,
        "document_length_chars": 31976
      }
    }
  ]
}