{
  "item_metadata": {
    "item_id": "51433",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51433",
      "content": "HUNT the HUNTER\n \n \n BY KRIS NEVILLE\n \n Illustrated by ELIZABETH MacINTYRE\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction June 1951. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n Of course using live bait is the best way to lure dangerous alien animals ... unless it turns out that you are the bait!\n \n \n \n \"We're somewhat to the south, I think,\" Ri said, bending over the crude field map. \"That ridge,\" he pointed, \"on our left, is right here.\" He drew a finger down the map. \"It was over here,\" he moved the finger,\n\"over the ridge, north of here, that we sighted them.\"\n \n Extrone asked, \"Is there a pass?\"\n \n Ri looked up, studying the terrain. He moved his shoulders. \"I don't know, but maybe they range this far. Maybe they're on this side of the ridge, too.\"\n \n Delicately, Extrone raised a hand to his beard. \"I'd hate to lose a day crossing the ridge,\" he said.\n \n \"Yes, sir,\" Ri said. Suddenly he threw back his head. \"Listen!\"\n \n \"Eh?\" Extrone said.\n \n \"Hear it? That cough? I think that's one, from over there. Right up ahead of us.\"\n \n Extrone raised his eyebrows.\n \n This time, the coughing roar was more distant, but distinct.\n \n \"It is!\" Ri said. \"It's a farn beast, all right!\"\n \n Extrone smiled, almost pointed teeth showing through the beard. \"I'm glad we won't have to cross the ridge.\"\n \n Ri wiped his forehead on the back of his sleeve. \"Yes, sir.\"\n \n \"We'll pitch camp right here, then,\" Extrone said. \"We'll go after it tomorrow.\" He looked at the sky. \"Have the bearers hurry.\"\n \n \"Yes, sir.\"\n \n Ri moved away, his pulse gradually slowing. \"You, there!\" he called.\n\"Pitch camp, here!\"\n \n He crossed to Mia, who, along with him, had been pressed into Extrone's party as guides. Once more, Ri addressed the bearers, \"Be quick, now!\" And to Mia, \"God almighty, he was getting mad.\" He ran a hand under his collar. \"It's a good thing that farn beast sounded off when it did. I'd hate to think of making him climb that ridge.\"\n \n Mia glanced nervously over his shoulder. \"It's that damned pilot's fault for setting us down on this side. I told him it was the other side. I told him so.\"\n \n Ri shrugged hopelessly.\n \n Mia said, \"I don't think he even saw a blast area over here. I think he wanted to get us in trouble.\"\n \n \"There shouldn't be one. There shouldn't be a blast area on this side of the ridge, too.\"\n \n \"That's what I mean. The pilot don't like businessmen. He had it in for us.\"\n \n Ri cleared his throat nervously. \"Maybe you're right.\"\n \n \"It's the Hunting Club he don't like.\"\n \n \"I wish to God I'd never heard of a farn beast,\" Ri said. \"At least, then, I wouldn't be one of his guides. Why didn't he hire somebody else?\"\n \n \n\n \n Mia looked at his companion. He spat. \"What hurts most, he pays us for it. I could buy half this planet, and he makes me his guide—at less than I pay my secretary.\"\n \n \"Well, anyway, we won't have to cross that ridge.\"\n \n \"Hey, you!\" Extrone called.\n \n The two of them turned immediately.\n \n \"You two scout ahead,\" Extrone said. \"See if you can pick up some tracks.\"\n \n \"Yes, sir,\" Ri said, and instantly the two of them readjusted their shoulder straps and started off.\n \n Shortly they were inside of the scrub forest, safe from sight. \"Let's wait here,\" Mia said.\n \n \"No, we better go on. He may have sent a spy in.\"\n \n They pushed on, being careful to blaze the trees, because they were not professional guides.\n \n \"We don't want to get too near,\" Ri said after toiling through the forest for many minutes. \"Without guns, we don't want to get near enough for the farn beast to charge us.\"\n \n They stopped. The forest was dense, the vines clinging.\n \n \"He'll want the bearers to hack a path for him,\" Mia said. \"But we go it alone. Damn him.\"\n \n Ri twisted his mouth into a sour frown. He wiped at his forehead. \"Hot. By God, it's hot. I didn't think it was this hot, the first time we were here.\"\n \n Mia said, \"The first time, we weren't guides. We didn't notice it so much then.\"\n \n They fought a few yards more into the forest.\n \n Then it ended. Or, rather, there was a wide gap. Before them lay a blast area, unmistakable. The grass was beginning to grow again, but the tree stumps were roasted from the rocket breath.\n \n \"This isn't ours!\" Ri said. \"This looks like it was made nearly a year ago!\"\n \n Mia's eyes narrowed. \"The military from Xnile?\"\n \n \"No,\" Ri said. \"They don't have any rockets this small. And I don't think there's another cargo rocket on this planet outside of the one we leased from the Club. Except the one he brought.\"\n \n \"The ones who discovered the farn beasts in the first place?\" Mia asked. \"You think it's their blast?\"\n \n \"So?\" Ri said. \"But who are they?\"\n \n \n\n \n It was Mia's turn to shrug. \"Whoever they were, they couldn't have been hunters. They'd have kept the secret better.\"\n \n \"We didn't do so damned well.\"\n \n \"We didn't have a chance,\" Mia objected. \"Everybody and his brother had heard the rumor that farn beasts were somewhere around here. It wasn't our fault Extrone found out.\"\n \n \"I wish we hadn't shot our guide, then. I wish he was here instead of us.\"\n \n Mia shook perspiration out of his eyes. \"We should have shot our pilot, too. That was our mistake. The pilot must have been the one who told Extrone we'd hunted this area.\"\n \n \"I didn't think a Club pilot would do that.\"\n \n \"After Extrone said he'd hunt farn beasts, even if it meant going to the alien system? Listen, you don't know.... Wait a minute.\"\n \n There was perspiration on Ri's upper lip.\n \n \" I didn't tell Extrone, if that's what you're thinking,\" Mia said.\n \n Ri's mouth twisted. \"I didn't say you did.\"\n \n \"Listen,\" Mia said in a hoarse whisper. \"I just thought. Listen. To hell with how he found out. Here's the point. Maybe he'll shoot us, too, when the hunt's over.\"\n \n Ri licked his lips. \"No. He wouldn't do that. We're not—not just anybody. He couldn't kill us like that. Not even him . And besides, why would he want to do that? It wouldn't do any good to shoot us. Too many people already know about the farn beasts. You said that yourself.\"\n \n Mia said, \"I hope you're right.\" They stood side by side, studying the blast area in silence. Finally, Mia said, \"We better be getting back.\"\n \n \"What'll we tell him?\"\n \n \"That we saw tracks. What else can we tell him?\"\n \n They turned back along their trail, stumbling over vines.\n \n \"It gets hotter at sunset,\" Ri said nervously.\n \n \"The breeze dies down.\"\n \n \"It's screwy. I didn't think farn beasts had this wide a range. There must be a lot of them, to be on both sides of the ridge like this.\"\n \n \"There may be a pass,\" Mia said, pushing a vine away.\n \n Ri wrinkled his brow, panting. \"I guess that's it. If there were a lot of them, we'd have heard something before we did. But even so, it's damned funny, when you think about it.\"\n \n Mia looked up at the darkening sky. \"We better hurry,\" he said.\n \n \n\n \n When it came over the hastily established camp, the rocket was low, obviously looking for a landing site. It was a military craft, from the outpost on the near moon, and forward, near the nose, there was the blazoned emblem of the Ninth Fleet. The rocket roared directly over Extrone's tent, turned slowly, spouting fuel expensively, and settled into the scrub forest, turning the vegetation beneath it sere by its blasts.\n \n Extrone sat on an upholstered stool before his tent and spat disgustedly and combed his beard with his blunt fingers.\n \n Shortly, from the direction of the rocket, a group of four high-ranking officers came out of the forest, heading toward him. They were spruce, the officers, with military discipline holding their waists in and knees almost stiff.\n \n \"What in hell do you want?\" Extrone asked.\n \n They stopped a respectful distance away. \"Sir....\" one began.\n \n \"Haven't I told you gentlemen that rockets frighten the game?\" Extrone demanded, ominously not raising his voice.\n \n \"Sir,\" the lead officer said, \"it's another alien ship. It was sighted a few hours ago, off this very planet, sir.\"\n \n Extrone's face looked much too innocent. \"How did it get there, gentlemen? Why wasn't it destroyed?\"\n \n \"We lost it again, sir. Temporarily, sir.\"\n \n \"So?\" Extrone mocked.\n \n \"We thought you ought to return to a safer planet, sir. Until we could locate and destroy it.\"\n \n Extrone stared at them for a space. Then, indifferently, he turned away, in the direction of a resting bearer. \"You!\" he said. \"Hey! Bring me a drink!\" He faced the officers again. He smiled maliciously. \"I'm staying here.\"\n \n The lead officer licked his firm lower lip. \"But, sir....\"\n \n Extrone toyed with his beard. \"About a year ago, gentlemen, there was an alien ship around here then, wasn't there? And you destroyed it, didn't you?\"\n \n \"Yes, sir. When we located it, sir.\"\n \n \"You'll destroy this one, too,\" Extrone said.\n \n \"We have a tight patrol, sir. It can't slip through. But it might try a long range bombardment, sir.\"\n \n \n\n \n Extrone said, \"To begin with, they probably don't even know I'm here. And they probably couldn't hit this area if they did know. And you can't afford to let them get a shot at me, anyway.\"\n \n \"That's why we'd like you to return to an inner planet, sir.\"\n \n Extrone plucked at his right ear lobe, half closing his eyes. \"You'll lose a fleet before you'll dare let anything happen to me, gentlemen. I'm quite safe here, I think.\"\n \n The bearer brought Extrone his drink.\n \n \"Get off,\" Extrone said quietly to the four officers.\n \n Again they turned reluctantly. This time, he did not call them back. Instead, with amusement, he watched until they disappeared into the tangle of forest.\n \n Dusk was falling. The takeoff blast of the rocket illuminated the area, casting weird shadows on the gently swaying grasses; there was a hot breath of dry air and the rocket dwindled toward the stars.\n \n Extrone stood up lazily, stretching. He tossed the empty glass away, listened for it to shatter. He reached out, parted the heavy flap to his tent.\n \n \"Sir?\" Ri said, hurrying toward him in the gathering darkness.\n \n \"Eh?\" Extrone said, turning, startled. \"Oh, you. Well?\"\n \n \"We ... located signs of the farn beast, sir. To the east.\"\n \n Extrone nodded. After a moment he said, \"You killed one, I believe, on your trip?\"\n \n Ri shifted. \"Yes, sir.\"\n \n Extrone held back the flap of the tent. \"Won't you come in?\" he asked without any politeness whatever.\n \n Ri obeyed the order.\n \n The inside of the tent was luxurious. The bed was of bulky feathers, costly of transport space, the sleep curtains of silken gauze. The floor, heavy, portable tile blocks, not the hollow kind, were neatly and smoothly inset into the ground. Hanging from the center, to the left of the slender, hand-carved center pole, was a chain of crystals. They tinkled lightly when Extrone dropped the flap. The light was electric from a portable dynamo. Extrone flipped it on. He crossed to the bed, sat down.\n \n \"You were, I believe, the first ever to kill a farn beast?\" he said.\n \n \"I.... No, sir. There must have been previous hunters, sir.\"\n \n \n\n \n Extrone narrowed his eyes. \"I see by your eyes that you are envious—that is the word, isn't it?—of my tent.\"\n \n Ri looked away from his face.\n \n \"Perhaps I'm envious of your reputation as a hunter. You see, I have never killed a farn beast. In fact, I haven't seen a farn beast.\"\n \n Ri glanced nervously around the tent, his sharp eyes avoiding Extrone's glittering ones. \"Few people have seen them, sir.\"\n \n \"Oh?\" Extrone questioned mildly. \"I wouldn't say that. I understand that the aliens hunt them quite extensively ... on some of their planets.\"\n \n \"I meant in our system, sir.\"\n \n \"Of course you did,\" Extrone said, lazily tracing the crease of his sleeve with his forefinger. \"I imagine these are the only farn beasts in our system.\"\n \n Ri waited uneasily, not answering.\n \n \"Yes,\" Extrone said, \"I imagine they are. It would have been a shame if you had killed the last one. Don't you think so?\"\n \n Ri's hands worried the sides of his outer garment. \"Yes, sir. It would have been.\"\n \n Extrone pursed his lips. \"It wouldn't have been very considerate of you to—But, still, you gained valuable experience. I'm glad you agreed to come along as my guide.\"\n \n \"It was an honor, sir.\"\n \n Extrone's lip twisted in wry amusement. \"If I had waited until it was safe for me to hunt on an alien planet, I would not have been able to find such an illustrious guide.\"\n \n \"... I'm flattered, sir.\"\n \n \"Of course,\" Extrone said. \"But you should have spoken to me about it, when you discovered the farn beast in our own system.\"\n \n \"I realize that, sir. That is, I had intended at the first opportunity, sir....\"\n \n \"Of course,\" Extrone said dryly. \"Like all of my subjects,\" he waved his hand in a broad gesture, \"the highest as well as the lowest slave, know me and love me. I know your intentions were the best.\"\n \n Ri squirmed, his face pale. \"We do indeed love you, sir.\"\n \n Extrone bent forward. \" Know me and love me.\"\n \n \"Yes, sir. Know you and love you, sir,\" Ri said.\n \n \"Get out!\" Extrone said.\n \n \n\n \n \"It's frightening,\" Ri said, \"to be that close to him.\"\n \n Mia nodded.\n \n The two of them, beneath the leaf-swollen branches of the gnarled tree, were seated on their sleeping bags. The moon was clear and cold and bright in a cloudless sky; a small moon, smooth-surfaced, except for a central mountain ridge that bisected it into almost twin hemispheres.\n \n \"To think of him. As flesh and blood. Not like the—well; that—what we've read about.\"\n \n Mia glanced suspiciously around him at the shadows. \"You begin to understand a lot of things, after seeing him.\"\n \n Ri picked nervously at the cover of his sleeping bag.\n \n \"It makes you think,\" Mia added. He twitched. \"I'm afraid. I'm afraid he'll.... Listen, we'll talk. When we get back to civilization. You, me, the bearers. About him. He can't let that happen. He'll kill us first.\"\n \n Ri looked up at the moon, shivering. \"No. We have friends. We have influence. He couldn't just like that—\"\n \n \"He could say it was an accident.\"\n \n \"No,\" Ri said stubbornly.\n \n \"He can say anything,\" Mia insisted. \"He can make people believe anything. Whatever he says. There's no way to check on it.\"\n \n \"It's getting cold,\" Ri said.\n \n \"Listen,\" Mia pleaded.\n \n \"No,\" Ri said. \"Even if we tried to tell them, they wouldn't listen. Everybody would know we were lying. Everything they've come to believe would tell them we were lying. Everything they've read, every picture they've seen. They wouldn't believe us. He knows that.\"\n \n \"Listen,\" Mia repeated intently. \"This is important. Right now he couldn't afford to let us talk. Not right now. Because the Army is not against him. Some officers were here, just before we came back. A bearer overheard them talking. They don't want to overthrow him!\"\n \n Ri's teeth, suddenly, were chattering.\n \n \"That's another lie,\" Mia continued. \"That he protects the people from the Army. That's a lie. I don't believe they were ever plotting against him. Not even at first. I think they helped him, don't you see?\"\n \n Ri whined nervously.\n \n \"It's like this,\" Mia said. \"I see it like this. The Army put him in power when the people were in rebellion against military rule.\"\n \n \n\n \n Ri swallowed. \"We couldn't make the people believe that.\"\n \n \"No?\" Mia challenged. \"Couldn't we? Not today, but what about tomorrow? You'll see. Because I think the Army is getting ready to invade the alien system!\"\n \n \"The people won't support them,\" Ri answered woodenly.\n \n \" Think. If he tells them to, they will. They trust him.\"\n \n Ri looked around at the shadows.\n \n \"That explains a lot of things,\" Mia said. \"I think the Army's been preparing for this for a long time. From the first, maybe. That's why Extrone cut off our trade with the aliens. Partly to keep them from learning that he was getting ready to invade them, but more to keep them from exposing him to the people. The aliens wouldn't be fooled like we were, so easy.\"\n \n \"No!\" Ri snapped. \"It was to keep the natural economic balance.\"\n \n \"You know that's not right.\"\n \n Ri lay down on his bed roll. \"Don't talk about it. It's not good to talk like this. I don't even want to listen.\"\n \n \"When the invasion starts, he'll have to command all their loyalties. To keep them from revolt again. They'd be ready to believe us, then. He'll have a hard enough time without people running around trying to tell the truth.\"\n \n \"You're wrong. He's not like that. I know you're wrong.\"\n \n Mia smiled twistedly. \"How many has he already killed? How can we even guess?\"\n \n Ri swallowed sickly.\n \n \"Remember our guide? To keep our hunting territory a secret?\"\n \n Ri shuddered. \"That's different. Don't you see? This is not at all like that.\"\n \n \n\n \n With morning came birds' songs, came dew, came breakfast smells. The air was sweet with cooking and it was nostalgic, childhoodlike, uncontaminated.\n \n And Extrone stepped out of the tent, fully dressed, surly, letting the flap slap loudly behind him. He stretched hungrily and stared around the camp, his eyes still vacant-mean with sleep.\n \n \"Breakfast!\" he shouted, and two bearers came running with a folding table and chair. Behind them, a third bearer, carrying a tray of various foods; and yet behind him, a fourth, with a steaming pitcher and a drinking mug.\n \n Extrone ate hugely, with none of the delicacy sometimes affected in his conversational gestures. When he had finished, he washed his mouth with water and spat on the ground.\n \n \"Lin!\" he said.\n \n His personal bearer came loping toward him.\n \n \"Have you read that manual I gave you?\"\n \n Lin nodded. \"Yes.\"\n \n Extrone pushed the table away. He smacked his lips wetly. \"Very ludicrous, Lin. Have you noticed that I have two businessmen for guides? It occurred to me when I got up. They would have spat on me, twenty years ago, damn them.\"\n \n Lin waited.\n \n \"Now I can spit on them, which pleases me.\"\n \n \"The farn beasts are dangerous, sir,\" Lin said.\n \n \"Eh? Oh, yes. Those. What did the manual say about them?\"\n \n \"I believe they're carnivorous, sir.\"\n \n \"An alien manual. That's ludicrous, too. That we have the only information on our newly discovered fauna from an alien manual—and, of course, two businessmen.\"\n \n \"They have very long, sharp fangs, and, when enraged, are capable of tearing a man—\"\n \n \"An alien?\" Extrone corrected.\n \n \"There's not enough difference between us to matter, sir. Of tearing an alien to pieces, sir.\"\n \n Extrone laughed harshly. \"It's 'sir' whenever you contradict me?\"\n \n Lin's face remained impassive. \"I guess it seems that way. Sir.\"\n \n \"Damned few people would dare go as far as you do,\" Extrone said. \"But you're afraid of me, too, in your own way, aren't you?\"\n \n Lin shrugged. \"Maybe.\"\n \n \"I can see you are. Even my wives are. I wonder if anyone can know how wonderful it feels to have people all afraid of you.\"\n \n \"The farn beasts, according to the manual....\"\n \n \"You are very insistent on one subject.\"\n \n \"... It's the only thing I know anything about. The farn beast, as I was saying, sir, is the particular enemy of men. Or if you like, of aliens. Sir.\"\n \n \"All right,\" Extrone said, annoyed. \"I'll be careful.\"\n \n In the distance, a farn beast coughed.\n \n Instantly alert, Extrone said, \"Get the bearers! Have some of them cut a path through that damn thicket! And tell those two businessmen to get the hell over here!\"\n \n Lin smiled, his eyes suddenly afire with the excitement of the hunt.\n \n \n\n \n Four hours later, they were well into the scrub forest. Extrone walked leisurely, well back of the cutters, who hacked away, methodically, at the vines and branches which might impede his forward progress. Their sharp, awkward knives snickered rhythmically to the rasp of their heavy breathing.\n \n Occasionally, Extrone halted, motioned for his water carrier, and drank deeply of the icy water to allay the heat of the forest, a heat made oppressive by the press of foliage against the outside air.\n \n Ranging out, on both sides of the central body, the two businessmen fought independently against the wild growth, each scouting the flanks for farn beasts, and ahead, beyond the cutters, Lin flittered among the tree trunks, sometimes far, sometimes near.\n \n Extrone carried the only weapon, slung easily over his shoulder, a powerful blast rifle, capable of piercing medium armor in sustained fire. To his rear, the water carrier was trailed by a man bearing a folding stool, and behind him, a man carrying the heavy, high-powered two-way communication set.\n \n Once Extrone unslung his blast rifle and triggered a burst at a tiny, arboreal mammal, which, upon the impact, shattered asunder, to Extrone's satisfied chuckle, in a burst of blood and fur.\n \n When the sun stood high and heat exhaustion made the near-naked bearers slump, Extrone permitted a rest. While waiting for the march to resume, he sat on the stool with his back against an ancient tree and patted, reflectively, the blast rifle, lying across his legs.\n \n \"For you, sir,\" the communications man said, interrupting his reverie.\n \n \"Damn,\" Extrone muttered. His face twisted in anger. \"It better be important.\" He took the head-set and mike and nodded to the bearer. The bearer twiddled the dials.\n \n \"Extrone. Eh?... Oh, you got their ship. Well, why in hell bother me?... All right, so they found out I was here. You got them, didn't you?\"\n \n \"Blasted them right out of space,\" the voice crackled excitedly. \"Right in the middle of a radio broadcast, sir.\"\n \n \"I don't want to listen to your gabbling when I'm hunting!\" Extrone tore off the head-set and handed it to the bearer. \"If they call back, find out what they want, first. I don't want to be bothered unless it's important.\"\n \n \"Yes, sir.\"\n \n Extrone squinted up at the sun; his eyes crinkled under the glare, and perspiration stood in little droplets on the back of his hands.\n \n Lin, returning to the column, threaded his way among reclining bearers. He stopped before Extrone and tossed his hair out of his eyes.\n\"I located a spoor,\" he said, suppressed eagerness in his voice. \"About a quarter ahead. It looks fresh.\"\n \n Extrone's eyes lit with passion.\n \n Lin's face was red with heat and grimy with sweat. \"There were two, I think.\"\n \n \"Two?\" Extrone grinned, petting the rifle. \"You and I better go forward and look at the spoor.\"\n \n Lin said, \"We ought to take protection, if you're going, too.\"\n \n Extrone laughed. \"This is enough.\" He gestured with the rifle and stood up.\n \n \"I wish you had let me bring a gun along, sir,\" Lin said.\n \n \"One is enough in my camp.\"\n \n \n\n \n The two of them went forward, alone, into the forest. Extrone moved agilely through the tangle, following Lin closely. When they came to the tracks, heavily pressed into drying mud around a small watering hole, Extrone nodded his head in satisfaction.\n \n \"This way,\" Lin said, pointing, and once more the two of them started off.\n \n They went a good distance through the forest, Extrone becoming more alert with each additional foot. Finally, Lin stopped him with a restraining hand. \"They may be quite a way ahead. Hadn't we ought to bring up the column?\"\n \n The farn beast, somewhere beyond a ragged clump of bushes, coughed. Extrone clenched the blast rifle convulsively.\n \n The farn beast coughed again, more distant this time.\n \n \"They're moving away,\" Lin said.\n \n \"Damn!\" Extrone said.\n \n \"It's a good thing the wind's right, or they'd be coming back, and fast, too.\"\n \n \"Eh?\" Extrone said.\n \n \"They charge on scent, sight, or sound. I understand they will track down a man for as long as a day.\"\n \n \"Wait,\" Extrone said, combing his beard. \"Wait a minute.\"\n \n \"Yes?\"\n \n \"Look,\" Extrone said. \"If that's the case, why do we bother tracking them? Why not make them come to us?\"\n \n \"They're too unpredictable. It wouldn't be safe. I'd rather have surprise on our side.\"\n \n \"You don't seem to see what I mean,\" Extrone said. \" We won't be the—ah—the bait.\"\n \n \"Oh?\"\n \n \"Let's get back to the column.\"\n \n \n\n \n \"Extrone wants to see you,\" Lin said.\n \n Ri twisted at the grass shoot, broke it off, worried and unhappy.\n\"What's he want to see me for?\"\n \n \"I don't know,\" Lin said curtly.\n \n Ri got to his feet. One of his hands reached out, plucked nervously at Lin's bare forearm. \"Look,\" he whispered. \"You know him. I have—a little money. If you were able to ... if he wants,\" Ri gulped, \"to do anything to me—I'd pay you, if you could....\"\n \n \"You better come along,\" Lin said, turning.\n \n Ri rubbed his hands along his thighs; he sighed, a tiny sound, ineffectual. He followed Lin beyond an outcropping of shale to where Extrone was seated, petting his rifle.\n \n Extrone nodded genially. \"The farn beast hunter, eh?\"\n \n \"Yes, sir.\"\n \n Extrone drummed his fingers on the stock of the blast rifle. \"Tell me what they look like,\" he said suddenly.\n \n \"Well, sir, they're ... uh....\"\n \n \"Pretty frightening?\"\n \n \"No, sir.... Well, in a way, sir.\"\n \n \"But you weren't afraid of them, were you?\"\n \n \"No, sir. No, because....\"\n \n Extrone was smiling innocently. \"Good. I want you to do something for me.\"\n \n \"I ... I....\" Ri glanced nervously at Lin out of the tail of his eye. Lin's face was impassive.\n \n \"Of course you will,\" Extrone said genially. \"Get me a rope, Lin. A good, long, strong rope.\"\n \n \"What are you going to do?\" Ri asked, terrified.\n \n \"Why, I'm going to tie the rope around your waist and stake you out as bait.\"\n \n \"No!\"\n \n \"Oh, come now. When the farn beast hears you scream—you can scream, by the way?\"\n \n Ri swallowed.\n \n \"We could find a way to make you.\"\n \n There was perspiration trickling down Ri's forehead, a single drop, creeping toward his nose.\n \n \"You'll be safe,\" Extrone said, studying his face with amusement. \"I'll shoot the animal before it reaches you.\"\n \n Ri gulped for air. \"But ... if there should be more than one?\"\n \n Extrone shrugged.\n \n \"I—Look, sir. Listen to me.\" Ri's lips were bloodless and his hands were trembling. \"It's not me you want to do this to. It's Mia, sir. He killed a farn beast before I did, sir. And last night—last night, he—\"\n \n \"He what?\" Extrone demanded, leaning forward intently.\n \n Ri breathed with a gurgling sound. \"He said he ought to kill you, sir. That's what he said. I heard him, sir. He said he ought to kill you. He's the one you ought to use for bait. Then if there was an accident, sir, it wouldn't matter, because he said he ought to kill you. I wouldn't....\"\n \n Extrone said, \"Which one is he?\"\n \n \"That one. Right over there.\"\n \n \"The one with his back to me?\"\n \n \"Yes, sir. That's him. That's him, sir.\"\n \n Extrone aimed carefully and fired, full charge, then lowered the rifle and said, \"Here comes Lin with the rope, I see.\"\n \n Ri was greenish. \"You ... you....\"\n \n Extrone turned to Lin. \"Tie one end around his waist.\"\n \n \"Wait,\" Ri begged, fighting off the rope with his hands. \"You don't want to use me, sir. Not after I told you.... Please, sir. If anything should happen to me.... Please, sir. Don't do it.\"\n \n \"Tie it,\" Extrone ordered.\n \n \"No, sir. Please. Oh, please don't, sir.\"\n \n \"Tie it,\" Extrone said inexorably.\n \n Lin bent with the rope; his face was colorless.\n \n \n\n \n They were at the watering hole—Extrone, Lin, two bearers, and Ri.\n \n Since the hole was drying, the left, partially exposed bank was steep toward the muddy water. Upon it was green, new grass, tender-tuffed, half mashed in places by heavy animal treads. It was there that they staked him out, tying the free end of the rope tightly around the base of a scaling tree.\n \n \"You will scream,\" Extrone instructed. With his rifle, he pointed across the water hole. \"The farn beast will come from this direction, I imagine.\"\n \n Ri was almost slobbering in fear.\n \n \"Let me hear you scream,\" Extrone said.\n \n Ri moaned weakly.\n \n \"You'll have to do better than that.\" Extrone inclined his head toward a bearer, who used something Ri couldn't see.\n \n \n\n \n Ri screamed.\n \n \"See that you keep it up that way,\" Extrone said. \"That's the way I want you to sound.\" He turned toward Lin. \"We can climb this tree, I think.\"\n \n Slowly, aided by the bearers, the two men climbed the tree, bark peeling away from under their rough boots. Ri watched them hopelessly.\n \n Once at the crotch, Extrone settled down, holding the rifle at alert. Lin moved to the left, out on the main branch, rested in a smaller crotch.\n \n Looking down, Extrone said, \"Scream!\" Then, to Lin, \"You feel the excitement? It's always in the air like this at a hunt.\"\n \n \"I feel it,\" Lin said.\n \n Extrone chuckled. \"You were with me on Meizque?\"\n \n \"Yes.\"\n \n \"That was something, that time.\" He ran his hand along the stock of the weapon.\n \n The sun headed west, veiling itself with trees; a large insect circled Extrone's head. He slapped at it, angry. The forest was quiet, underlined by an occasional piping call, something like a whistle. Ri's screams were shrill, echoing away, shiveringly. Lin sat quiet, hunched.\n \n Extrone's eyes narrowed, and he began to pet the gun stock with quick, jerky movements. Lin licked his lips, keeping his eyes on Extrone's face. The sun seemed stuck in the sky, and the heat squeezed against them, sucking at their breath like a vacuum. The insect went away. Still, endless, hopeless, monotonous, Ri screamed.\n \n \n\n \n A farn beast coughed, far in the matted forest.\n \n Extrone laughed nervously. \"He must have heard.\"\n \n \"We're lucky to rouse one so fast,\" Lin said.\n \n Extrone dug his boot cleats into the tree, braced himself. \"I like this. There's more excitement in waiting like this than in anything I know.\"\n \n Lin nodded.\n \n \"The waiting, itself, is a lot. The suspense. It's not only the killing that matters.\"\n \n \"It's not only the killing,\" Lin echoed.\n \n \"You understand?\" Extrone said. \"How it is to wait, knowing in just a minute something is going to come out of the forest, and you're going to kill it?\"\n \n \"I know,\" Lin said.\n \n \"But it's not only the killing. It's the waiting, too.\"\n \n The farn beast coughed again; nearer.\n \n \"It's a different one,\" Lin said.\n \n \"How do you know?\"\n \n \"Hear the lower pitch, the more of a roar?\"\n \n \"Hey!\" Extrone shouted. \"You, down there. There are two coming. Now let's hear you really scream!\"\n \n Ri, below, whimpered childishly and began to retreat toward the tether tree, his eyes wide.\n \n \"There's a lot of satisfaction in fooling them, too,\" Extrone said.\n\"Making them come to your bait, where you can get at them.\" He opened his right hand. \"Choose your ground, set your trap. Bait it.\" He snapped his hand into a fist, held the fist up before his eyes, imprisoning the idea. \"Spring the trap when the quarry is inside. Clever. That makes the waiting more interesting. Waiting to see if they really will come to your bait.\"\n \n Lin shifted, staring toward the forest.\n \n \"I've always liked to hunt,\" Extrone said. \"More than anything else, I think.\"\n \n Lin spat toward the ground. \"People should hunt because they have to. For food. For safety.\"\n \n \"No,\" Extrone argued. \"People should hunt for the love of hunting.\"\n \n \"Killing?\"\n \n \"Hunting,\" Extrone repeated harshly.\n \n \n\n \n The farn beast coughed. Another answered. They were very near, and there was a noise of crackling underbrush.\n \n \"He's good bait,\" Extrone said. \"He's fat enough and he knows how to scream good.\"\n \n Ri had stopped screaming; he was huddled against the tree, fearfully eying the forest across from the watering hole.\n \n Extrone began to tremble with excitement. \"Here they come!\"\n \n The forest sprang apart. Extrone bent forward, the gun still across his lap.\n \n The farn beast, its tiny eyes red with hate, stepped out on the bank, swinging its head wildly, its nostrils flaring in anger. It coughed. Its mate appeared beside it. Their tails thrashed against the scrubs behind them, rattling leaves.\n \n \n\n \n \"Shoot!\" Lin hissed. \"For God's sake, shoot!\"\n \n \"Wait,\" Extrone said. \"Let's see what they do.\" He had not moved the rifle. He was tense, bent forward, his eyes slitted, his breath beginning to sound like an asthmatic pump.\n \n The lead farn beast sighted Ri. It lowered its head.\n \n \"Look!\" Extrone cried excitedly. \"Here it comes!\"\n \n Ri began to scream again.\n \n Still Extrone did not lift his blast rifle. He was laughing. Lin waited, frozen, his eyes staring at the farn beast in fascination.\n \n The farn beast plunged into the water, which was shallow, and, throwing a sheet of it to either side, headed across toward Ri.\n \n \"Watch! Watch!\" Extrone cried gleefully.\n \n And then the aliens sprang their trap.",
      "metadata": {
        "title": "Hunt the Hunter",
        "author": "Kris Neville",
        "passage_id": "51433",
        "uid": "c7ce7d77c1894e59818b0fab604bcd88",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "10",
                "uid": "8a68260d2a234888b35af9093329711a",
                "response_text": "\nExtrone is a very important person of influence who is on a hunting trip looking for farn beasts on an outer planet. He has hired guides, Ri and Mia, who are businessmen who have successfully shot a farn beast on a prior private trip. They attempted to conceal their killing of a farn beast on that trip, however, the word got out and now Extrone has forced them (seemingly against their will) to be the guides for his own trip. Ri and Mia do not turn out to be very good guides. Mia is unsupportive of Extrone and suspicious of his activities and potential plans to violently attack the aliens, and Ri is fearful of that talk and of Extrone himself causing him to be unhelpful as a guide.\n\nExtrone refers to being loved by his “subjects” suggesting he has a position of royalty or power. The military is at his disposal and seem eager to please him. He is highly focused on finding and killing a farn beast any way possible - and attempts sacrificing his guide Ri as bait for the animal to do it. He kills Mia by shooting him in the back after Ri accuses him of intent to kill Extrone, suggesting Extrone is a violent ruler.\n\nExtrone’s focus is on killing a farn beast and this blinds him to the existence of an alien trap on the planet. It is heavily implied that the aliens have intentions to do harm to Extrone, and it is revealed that his fixation on the farn beast led him directly into a trap set by the aliens to capture him.\n"
              },
              {
                "worker_id": "6",
                "uid": "0395d05d059e4283a7caaacb0f52006a",
                "response_text": "Extrone, a prominent leader of the humans, has taken his hunting party to track down a farn beast, a newly-discovered creature. His guides are two businessman, Ri and Mia, who were the first to come across and kill a farn beast. They are there begrdugingly, but their fear of Extrone is clear. They arrive on the wrong side of the ridge and are searching for a way to cross it to reach the farn beasts. Ri hears the cough of a farn beast on their side, and Extrone is pleased they won’t have to waste time crossing the ridge. They set up camp there, and Extrone asks Mia and Ri to scout ahead and find farn beast tracks. No one is armed, except for Extrone, so Mia and Ri are extremely cautious not to get too far into the beasts’ territory. They’re sweating as they come across land marred by a rocket’s blast off probably from a year ago. They theorize that it’s the people who discovered the beasts, though they don’t know who. \nRi reveals that they shot their guide after finding the farn beast, but not their pilot. They bicker a little, scared of Extrone and the possibility of him killing them afterward. They agree to hide the blast area from him, but inform him they found tracks instead. A rocket flies over the camp, looking for Extrone. They land near and tell Extrone that an alien ship was spotted on this planet. They were unable to destroy it at the time. Extrone gives out orders to destroy it and then sends them away. Extrone asserts his dominance over Ri after they return. Ri and Mia rest in their sleeping bags, discussing what they need to do about Extrone. \nThe next morning, Extrone’s personal bearer, Lin, presents alien information about the farn beasts. They begin their trek into the forest, people cutting the way for Extrone who managed to kill one small animal with his weapon. Extrone’s men were able to shoot down the alien ship. Lin finds a spoor and leads Extrone to it, revealing on the way that the farn beasts are great hunters. Extrone decides to use Ri as bait to draw the beasts to him. \nWhen he informs Ri of his decision, Ri betrays Mia in a way to guarantee his safety. So, Extrone kills Mia and then uses Ri as bait anyway. After stringing him up and torturing him, his screams eventually draw the farn beast near. A farn beast and its mate appear and charge Ri. The story ends with Extrone holding fire as the farn beast nears, and the alien trap being sprung. \n"
              },
              {
                "worker_id": "2",
                "uid": "4848b3dbb4134ced83d4cb936c6e26f5",
                "response_text": "General Extrone is on a hunting trip to kill a farn. To help him track the farn, he has hired two businessmen, Ri and Mia, who actually killed the first farn, which Extrone resents; he wanted to kill the first one. While Ri and Mia are out tracking the farn beast, they talk about how much they hate working for Extrone since he is a self-centered, egotist who cares nothing about anyone except himself. After Ri and Mia killed their farn, they killed their guide to keep word from getting out about it. Now they wonder if their pilot was the one who told others about it. Mia points out to Ri that Extrone might just shoot them after the hunt is over, but Ri says Extrone wouldn’t do that because they aren’t a couple of nobodies. Meanwhile, a low-flying rocket passes overhead and lands; it is part of Extrone’s Ninth Fleet with news that an alien ship has been sighted near the planet where the general is hunting. Extrone refuses to leave with them for someplace safer, instead making it clear he expects them to take care of the problem. Ri and Mia return to camp, and Extrone has Ri give him an update. Extrone makes it clear that the two businessmen had better not have killed the last farn beast and then make Ri say he knows and loves Extrone. Later than night, Mia tells Ri he is afraid Extrone will kill them before he lets them return to civilization. Mia points out lies that Extrone has told, such as that the army tried to plot against him; Mia figured out that the army was helping him. He also thinks Extrone cut off trade with the aliens because he is getting ready to invade them. The next day, Extrone talks with his personal bearer, Lin, who has read an alien manual about the farn beast. When Extrone complains about Ri and Mia, Lin keeps telling him facts about the farn beast. Extrone allows Lin to disagree with him, but Lin always follows his statement with “Sir.” Hunting later that day, Lin spies a spoor and shows it to Extrone. When they hear the farn cough, Lin says it’s a good thing they are downwind; otherwise the farn beast would track them down. This gives Extrone the idea of using a human for bait and chooses Ri. When Ri realizes what is planned, he tells Extrone that Mia has been talking about killing Extrone. Extrone shoots Mia and still uses Ri for bait, which does lure two farn beasts. Instead of killing them, Extrone waits to see what they will do. The the aliens spring their trap.\n"
              },
              {
                "worker_id": "8",
                "uid": "762ce2d879c84a76b4a406608924a4f9",
                "response_text": "Ri and Mia are two businessmen hired as guides by Extrone, a violent, though popular leader, on his mission to hunt farn beasts. They were hired because of their success killing a farn beast during one of their Hunting Club missions. Soon after their arrival on the planet where the hunt takes place, Ri hears a farn beast cough while plotting their course with Extrone, and Extrone sends him and Mia into the forest to track it. Ri and Mia bemoan the fact that they have been hired for this purpose in spite of the fact that neither of them is a professional guide; they merely have hunted a farn beast in the past. As they track the beast, they discover a blast area and cannot identify the source of it, although they do know it wasn't created by one of the Hunting Club's rockets. When they make their way back to camp, they worry about if Extrone will kill them after the hunt in order to keep the discovery of the farn beasts a secret despite the fact that rumors of their existence had already spread. Extrone has killed others in the past. Back at camp, a group of high-ranking officers from the Ninth Fleet visit Extrone to warn him about the presence of a nearby alien spacecraft, fearing it is seeking him out to exterminate him. Extrone orders them to destroy it and scoffs at the idea that he might not be safe on this planet. After the officers leave, Extrone calls Ri into his tent and admits he needs him because he has never seen a farn beast and would have hunted them on alien planets (where he has heard they hunt them frequently) had it been safe for him to do so. It is clear from his conversation with Ri that Extrone is loved by his constituents and hated by his alien enemies. When Ri joins Mia later, they again discuss their fear of being killed after the hunt, and Mia suggests the army purposefully installed Extrone as puppet leader during the anti-military rebellion in order to gain popular support for their eventual attack on the alien system. Ri refuses to believe Mia's theories whether out of fear or denial; either way, Ri and Mia guides Extrone's hunt the next morning, joined by Extrone's personal bearer Lin and several other attendants. Lin warns a dismissive Extrone of the dangers of the farn beasts, and Extrone decides to use Ri as bait to lure them to their spot. In a panic, Ri tells Extrone to use Mia instead, since he had plotted to kill Extrone. Without missing a beat, Extrone kills Mia and continues to use Ri as bait. Lin and Extrone hideaway as Ri screams and draws the farn beasts to their location. Suddenly, the aliens the Ninth Fleet officers had warned Extrone about spring their trap. They had been using Extrone as bait to catch the farn beasts themselves."
              }
            ]
          },
          {
            "question_text": "What is the farn beast and its significance?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "10",
                "uid": "8a68260d2a234888b35af9093329711a",
                "response_text": "The farn beast is capable of killing humans and aliens. It resides on alien planets, but is rare within the human-occupied system. It is thought by Extrone that Ri may have been one of the only humans to ever see and shoot one.\n\nThey are described as having long fangs and being carnivorous. Their main sound is a coughing noise, which can be used to locate how far away they are. They do indeed seem attracted to humans, as they are drawn to Ri screaming when he is placed as bait at the watering hole.\n\nThe farn beast is significant, because as Extrone and his party are focused on hunting them, it is revealed that the beast itself is being used as bait by aliens to lure Extrone to the planet. \n"
              },
              {
                "worker_id": "6",
                "uid": "0395d05d059e4283a7caaacb0f52006a",
                "response_text": "The farn beast is a newly-discovered creature. Although they are newly discovered by humans, aliens have known about them for some time. They are a dangerous and terrifying animal with long fangs and red beady eyes. After two businessman discovered and killed the beast on their hunting trip, it soon became the new adventure each man must attempt. The farn beasts in this story are being hunted by a party led by Extrone, an extremely powerful man. The hunt for the farn beast reveals Extrone’s true colors as he kills Mia, one of his guides, and uses the other guide, Ri, as bait to kill a farn beast. The farn beasts also act as a great plot progressor and keep the characters moving forward. "
              },
              {
                "worker_id": "2",
                "uid": "4848b3dbb4134ced83d4cb936c6e26f5",
                "response_text": "The farn beast is the whole reason for the expedition in the story, and it is Extrone’s obsession, so much so that he pays no attention to his army intelligence about aliens in the area near the planet where he is hunting. The farn beast is a rare creature that has only been seen by a few humans and only recently been killed by humans. They wanted to keep it a secret, so they killed their guide before returning home. Now General Extrone wants to kill a farn beast, and he is forcing the two men who killed the last one to be his guides to find one. He is angry that the two men didn’t tell him about finding and killing one. The farn beast is distinguishable by its coughing roar and is known to be dangerous to humans. They are carnivorous, have long, sharp fangs, and when angered, can tear a man apart. They charge when they detect the scent, sight, or sound of prey and will track and hunt down a man even if it takes all day. After Extrone uses one of his guides as bait, two farn beasts are drawn to it. They have tiny eyes that are red and full of hatred; they swing their heads wildly and flare their nostrils in anger. Their tails thrash against the flora of the forest. When Ri screams, the farn cross the watering hole directly toward him. The story says this is when the aliens spring their trap."
              },
              {
                "worker_id": "8",
                "uid": "762ce2d879c84a76b4a406608924a4f9",
                "response_text": "The farn beasts are dangerous, carnivorous creatures with small, red eyes, long, sharp fangs, and tails. Although their behavior is largely unpredictable, they are able to dismember men and aliens alike when they are angry. They also have excellent tracking skills and will pursue the scene, sight, or sound of their prey for as long as a day. Lin calls them the \"particular enemy of men\" although they are also frequently hunted by aliens. As members of the Hunting Club, Ri and Mia hunt a farn beast, and this successful kill draws the attention of Extrone, who hires them as his guides to hunt farn beasts himself. Farn beasts emit loud coughs, which is how Ri determines one of them is nearby in the first place. Later, Lin and Extrone realize there are multiple farn beasts nearby on their hunt when they hear multiple coughs. Extrone's alien enemies not only hunt the farn beasts, but they have also developed a manual for identifying and understanding them; they clearly understand the beasts much better than Extrone. This works to their advantage later as they use Extrone and Lin as bait to spring a trap to catch the farn beasts they were hunting.\n"
              }
            ]
          },
          {
            "question_text": "What is the relationship like between Lin and Extrone?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "10",
                "uid": "8a68260d2a234888b35af9093329711a",
                "response_text": "Lin is Extrone’s personal bearer who does anything that is asked of him by Extrone. Extrone is pleased when people are fearful of him, but it appears that Lin may not have a fear or may be suppressing it. \n\nLin appears very loyal to Extrone, which is proven when he rejects an attempt of bribery by Ri who wants to know if he is in danger by Extrone’s plan. Lin does Extrone’s bidding by tying up Ri and staking him out for bait to lure the farn beast.\nHowever, when Lin and Extrone hide in a nearby tree to shoot the farn beast when they come after Ri, Lin’s actions become more sinister and it is revealed that he may have different beliefs from Extrone. Lin says hunting animals should be done for reasons like survival, not just for killing - which is the opposite of what Extrone believes - that the waiting and then the killing is the appeal. It is never clear if Lin is part of the alien trapping of Extrone that results, or whether he was as blind to it as Extrone.\n"
              },
              {
                "worker_id": "6",
                "uid": "0395d05d059e4283a7caaacb0f52006a",
                "response_text": "Extrone is the head hunter and hotshot of this particular expedition. It seems as though he holds a monopoly over humanity through his control of the Army. Lin is his right-hand man and personal bearer. Lin is one of the few in the camp who will challenge Extrone, but not in an obvious way. He presents information to him in a way that is subtle and not demeaning, usually aided by his addition of the word “Sir,” at the end of a sentence. Extrone respects what Lin has to say, possibly through him proving himself over and over, and even chooses not to kill him when he says something contradictory. Lin presents the manual on farn beasts to Extrone, who hates that it’s developed by aliens. Lin explains how dangerous and fast these beasts are and remains calm and impassive when Extrone tries to challenge him. \nLater on, Lin discovers a spoor close to where the farn beasts are living. He races back to tell Extrone, and the two of them journey together alone. On this trip, Lin reveals that the farn beasts are excellent trackers and hunters, which inspires Extrone to set up bait for the beasts. \nIn the end, however, there seems to be a change in Lin’s composure. While discussing Extrone’s love for hunting, Lin claims that no one should hunt for fun, only out of necessity. He argues a little with Extrone, until the farn beasts arrive. Perhaps this signals that Lin is not as loyal to Extrone as we are led to believe. \n"
              },
              {
                "worker_id": "2",
                "uid": "4848b3dbb4134ced83d4cb936c6e26f5",
                "response_text": "While the two men don’t completely accept each other, they seem to be more accepting of each other than the other characters. In a position of authority, a leader cannot afford to be too friendly with those under him; however, Extrone takes this concept to the extreme and is downright hateful and hard to tolerate. The only person he is somewhat civil to is Lin, and even then, his civility is limited. Extrone treats other people in a very arrogant manner, barking orders at them (“You! Hey! Bring me a drink!”), making veiled threats (“It would be a shame if you had killed the last one. Don’t you think?”), and treating them as if they are utterly useless. With Lin, however, Extrone allows him to respectfully disagree with him or contradict him. Extrone acknowledges that very few people will stand up to him like Lin does, and yet it may be Lin’s manner of doing so that enables him to get away with this. Lin does not act afraid of Extrone, and when Extrone drones on about the way people disrespect him, Lin focuses on the topic at hand, the farn beast. When Extrone confronts him about contradicting him, Lin affects an impassive response rather than kowtowing to him. And when Lin says people should only hunt when they have to for food, Extrone says people should hunt for the love of hunting. Lin names it “killing,” but Extrone corrects him with “hunting.” Lin drops the topic as if he knows better than to debate Extrone.\n"
              },
              {
                "worker_id": "8",
                "uid": "762ce2d879c84a76b4a406608924a4f9",
                "response_text": "Lin has been Extrone's personal bearer for a while, having accompanied him on several expeditions such as the one on Meizque, and he does Extrone's bidding. However, he is also intelligent and clever and understands how to say the right thing to Extrone to get the reaction he wants; he appears emotionally unaffected by Extrone's bombastic behavior and is matter-of-fact in most of his actions. Lin does his best to educate Extrone about the characteristics and known behavior of the farn beasts and their potential danger to humans. Lin is practical and encourages proper precautions when they get closer to the farn beasts; he guides Extrone to the farn beasts more effectively than Ri and Mia. Lin wrangles Ri when Extrone orders him to be used as bait to catch the farn beasts. For his part, Extrone treats Lin with the same dismissiveness and condescension that he treats any of his associates. However, he does have some amount of deference for Lin and, although he does not absorb much of the information Lin tries to give him, he does listen to much of his practical advice when pursuing the farn beasts."
              }
            ]
          },
          {
            "question_text": "What settings does the story take place in?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "10",
                "uid": "8a68260d2a234888b35af9093329711a",
                "response_text": "On the surface of a planet which is wooded in scrub forest and one of the few places known to have farn beasts. The hunting party is next to a ridge that would be a significant effort to cross, and there are “blast sites” around the woods. The hunting party also uses a nearby water hole location to lure farn beasts while hiding up in a tree.\n\nExtrone’s camp set up by “bearers” and his tent, which is extravagantly decorated, are also scenes used throughout the story.\n"
              },
              {
                "worker_id": "6",
                "uid": "0395d05d059e4283a7caaacb0f52006a",
                "response_text": "Hunt the Hunter by Kris Neville takes place on a mostly unexplored planet inhibited by the farn beast and other creatures. The coughing roar of the farn beast can often be heard in the distance. Great sprawling vines, trees, and bushes cover the land, and the heat is oppressive in its thickness. It only gets hotter, too. Once the sun goes down, the breeze dies off too, leaving just stale heat in its wake. There is a ridge separating the humans and the farn beasts, and the humans spend their time searching for the pass. \nRocket blast-off marks cover the ground in some places. Other spots are watering holes, lakes, and rivers, perfect for the creatures living on this land.  \nRi and Mia sleep in sleeping bags on the ground when they pitch camp. However, Extrone has a luxurious tent equipped with electric lights, tiled floors, and a feather bed. A crystal chain hangs from the front opening too. \n"
              },
              {
                "worker_id": "2",
                "uid": "4848b3dbb4134ced83d4cb936c6e26f5",
                "response_text": "The story takes place on an unnamed outer planet where the characters are involved in hunting for the farn beast. At the same time, alien space ships are seen nearby, and the military wants Extrone to return to an inner planet where he will be safer. The unnamed planet has many features that support wildlife and include land features such as ridges. We know that, in addition to farn beasts, there are birds and arboreal creatures in the forest. The forests are thick with many trees, and it is sweltering, especially in the forest where the foliage stops outside air from entering. There are dense thickets that the men have to hack in order for Extrone to pass through the area. There are gently swaying grasses in some areas, and in the mornings, they can hear the birds singing. While Extrone sleeps in a luxurious tent, the other men sleep under the sky where a smooth-surfaced moon hangs, bisected into twin hemispheres by a central mountain range. The drinking hole is where they see the farns’ prints and where Extrone has Ri tied to a tree to serve as bait.\n\tAnother setting within this setting is Extrone’s tent. Inside it is absolutely luxurious. The bedding is composed of feathers and is surrounded by silk curtains. The flooring is made of tile blocks that have been transported to the planet and laid neatly and smoothly in the ground to create an even floor. There is a chain of crystals hanging from the top of the tent, and the electric lights are powered by a portable dynamo. Extrone seems to have every luxury available to him.\n"
              },
              {
                "worker_id": "8",
                "uid": "762ce2d879c84a76b4a406608924a4f9",
                "response_text": "The primary action of the story takes place on an unnamed planet, where Extrone and his entourage travel to hunt farn beasts. They make camp in a field of grass next to a scrub forest somewhere in the southern region and there is a ridge to their north over which they previously sighted farn beasts. The forest is hot and dense and filled with trees and vines. Military officers from the Ninth Fleet visit Extrone to provide a warning about the sighting of an alien spacecraft; the officers come from the military outpost on a nearby moon. When Extrone invites Ri inside of his tent, the luxuriousness of his lifestyle highlights not only Extrone's wealth but also the glee with which he shows it off: His bed is expensive, full of heavy feathers, and flanked by silken sleep curtains. Solid tile blocks form the base of his floor, and a chain of crystals hangs in the middle of the tent to the left of a thin, hand-carved pole. Electric light brightens the space. Juxtaposed with Extrone's extravagancies, Mia and Ri sleep in sleeping bags under a gnarled tree. During the hunt for the farn beast, Extrone and Lin discover farn beast tracks in a muddy waterhole, and this is where they tie Ri to the base of a scaling tree."
              }
            ]
          },
          {
            "question_text": "What is the relationship like between Ri and Mia?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "10",
                "uid": "8a68260d2a234888b35af9093329711a",
                "response_text": "They are businessmen that have been recruited (seemingly against their will) as guides for Extrone on a hunting trip seeking to kill farn beasts. They had come to the same location once before on a hunting trip together in good relations, and killed their guide to keep their finding of the farn beasts a secret. Initially, they seem to be bonded in their misery about being forced into this situation by Extrone. However, this relationship changes and deteriorates over the story.\n\nMia is highly suspicious of Extrone, his possible appointment by the Army, and what he thinks is an impending invasion of the alien system to be led by Extrone. \n\nRi has had several personal meetings with Extrone and is completely terrified of him and what he is capable of. Ri rejects the notions suggested by Mia and is scared to be caught speaking of them. When Extrone threatens to put Ri out for bait to lure the farn beasts, he rats Mia out as having intention to kill Extrone in order to avoid his own death. The plan fails when Extrone kills Mia on the spot by shooting him in the back, thus ending their relationship.\n"
              },
              {
                "worker_id": "6",
                "uid": "0395d05d059e4283a7caaacb0f52006a",
                "response_text": "Ri and Mia are two businessmen who were on a hunting trip before this current expedition. There, with their guide and pilot, they discovered the farn beast and killed at least one. Extrone hired them to be his guides on his own expedition, seeing as they found the beast in the first place. \nAfter their discovery, Ri and Mia shot their guide but left the pilot alive. This meant that the word about farn beasts spread and soon became a hot topic. Now, Ri and Mia are trapped on this planet with Extrone, a scary and powerful man, and their relationship begins to crack under the weight of all this pressure. \nMia firmly believes that Extrone will kill both of them once this expedition is over. Ri disagrees, choosing to remain optimistic. On one of their guide trips, they discover blast tracks, a sign that others have been here. They choose to not tell Extrone out of fear. \nAfter Mia divulges his plans to expose Extreone for what he really is when they return to civilization. Ri feels nervous about the prospect and tries to shut the conversation down. Later on, when Extrone calls Ri into his tent to use him as bait, Ri betrays Mia and reveals his treacherous plans. Extrone kills Mia quickly and efficiently but uses Ri as bait anyway. Despite their history as hunters and friends, Ri still betrays Mia in order to save his own skin. \n"
              },
              {
                "worker_id": "2",
                "uid": "4848b3dbb4134ced83d4cb936c6e26f5",
                "response_text": "Ri and Mia have a friendly camaraderie until the end of the story when Ri lies and tries to convince Extrone to use Mia as live bait for the farn beast rather than himself. Ri and Mia killed the first farn beast in their world, and when Extrone heard this, he hired them for a pittance to be his guides on a hunting expedition for the farn beast. Neither man wants to be there, but they have no choice. When Ri and Mia killed a farn beast, they killed their guide to prevent news of it from leaking, but other people still found out. Mia worries that Extrone will kill them, too, when the hunt is over, but Ri insists that they are too important for that to happen. Ri insists their friends and influence will prevent Extrone from doing that, but Mia counters that Extrone can always claim it was an accident. The two men are suspicious about how Extrone came to power, and Mia suspects that he is planning to invade the aliens and, for that reason, cut off trade with them. Ri disagrees and says the trade discontinuation was to keep an economic balance. While the two men disagree about Extrone’s methods, they both agree that he is a scary guy. At the end of the story, however, when Extrone’s plan to use Ri as live bait for the farn beast becomes clear to him, Ri lies and says Extrone should use Mia as bait because Mia has been talking about killing Extrone. Extrone has Ri point out Mia to him and then shoots him and still uses Ri for bait. So Ri gains nothing and causes his friend’s death. \n"
              },
              {
                "worker_id": "8",
                "uid": "762ce2d879c84a76b4a406608924a4f9",
                "response_text": "Ri and Mia are two businessmen who are hired by Extrone to serve as guides on his hunting trip because of their association with the Hunting Club and their success in killing one during a recent mission. Although they successfully hunted a farn beast in the past, they are not professional guides by any means. Despite this and the low pay that they receive for their efforts, they feel compelled to meet Extrone's demands out of fear of reprisal. Mia is more assertive and confident than Ri, and he strongly believes that Extrone is a puppet leader installed by the military to ensure the people will support future military action against the aliens. Ri, fearful and timid, does not want to believe Mia's conspiracies and espouses faith in Extrone. Mia further fears that Extrone will kill them once the hunt is over because he does not want them to reveal the location of the farn beasts. Ri's fear of Extrone takes over when Extrone wants to use him as bait to catch the farn beasts, and he throws Mia under the bus by claiming Mia has suggested assassinating Extrone. Extrone immediately kills Mia and uses Ri as bait anyway."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5539,
        "document_length_chars": 32544
      }
    }
  ]
}