{
  "item_metadata": {
    "item_id": "51494",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51494",
      "content": "BEACH SCENE\n \n \n By MARSHALL KING\n \n Illustrated by WOOD\n \n [Transcriber's Note: This etext was produced from Galaxy Magazine October 1960. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n It was a fine day at the beach for Purnie's game—but his new friends played very rough!\n \n\n \n Purnie ran laughing and shouting through the forest until he could run no more. He fell headlong into a patch of blue moss and whooped with delight in having this day free for exploring. He was free to see the ocean at last.\n \n When he had caught his breath, he looked back through the forest. No sign of the village; he had left it far behind. Safe from the scrutiny of brothers and parents, there was nothing now to stop him from going to the ocean. This was the moment to stop time.\n \n \"On your mark!\" he shouted to the rippling stream and its orange whirlpools. He glanced furtively from side to side, pretending that some object might try to get a head start. \"Get set!\" he challenged the thin-winged bees that hovered over the abundant foliage. \"Stop!\" He shrieked this command upward toward the dense, low-hanging purple clouds that perennially raced across the treetops, making one wonder how tall the trees really were.\n \n His eyes took quick inventory. It was exactly as he knew it would be: the milky-orange stream had become motionless and its minute whirlpools had stopped whirling; a nearby bee hung suspended over a paka plant, its transparent wings frozen in position for a downward stroke; and the heavy purple fluid overhead held fast in its manufacture of whorls and nimbi.\n \n With everything around him in a state of perfect tableau, Purnie hurried toward the ocean.\n \n If only the days weren't so short! he thought. There was so much to see and so little time. It seemed that everyone except him had seen the wonders of the beach country. The stories he had heard from his brothers and their friends had taunted him for as long as he could remember. So many times had he heard these thrilling tales that now, as he ran along, he could clearly picture the wonderland as though he were already there. There would be a rockslide of petrified logs to play on, the ocean itself with waves higher than a house, the comical three-legged tripons who never stopped munching on seaweed, and many kinds of other wonderful creatures found only at the ocean.\n \n He bounced through the forest as though the world was reserved this day just for him. And who could say it wasn't? he thought. Wasn't this his fifth birthday? He ran along feeling sorry for four-year-olds, and even for those who were only four and a half, for they were babies and wouldn't dare try slipping away to the ocean alone. But five!\n \n \"I'll set you free, Mr. Bee—just wait and see!\" As he passed one of the many motionless pollen-gathering insects he met on the way, he took care not to brush against it or disturb its interrupted task. When Purnie had stopped time, the bees—like all the other creatures he met—had been arrested in their native activities, and he knew that as soon as he resumed time, everything would pick up where it had left off.\n \n \n\n \n When he smelled an acid sweetness that told him the ocean was not far off, his pulse quickened in anticipation. Rather than spoil what was clearly going to be a perfect day, he chose to ignore the fact that he had been forbidden to use time-stopping as a convenience for journeying far from home. He chose to ignore the oft-repeated statement that an hour of time-stopping consumed more energy than a week of foot-racing. He chose to ignore the negative maxim that \"small children who stop time without an adult being present, may not live to regret it.\"\n \n He chose, instead, to picture the beaming praise of family and friends when they learned of his brave journey.\n \n The journey was long, the clock stood still. He stopped long enough to gather some fruit that grew along the path. It would serve as his lunch during this day of promise. With it under his arm he bounded along a dozen more steps, then stopped abruptly in his tracks.\n \n He found himself atop a rocky knoll, overlooking the mighty sea!\n \n He was so overpowered by the vista before him that his \"Hurrah!\" came out as a weak squeak. The ocean lay at the ready, its stilled waves awaiting his command to resume their tidal sweep. The breakers along the shoreline hung in varying stages of disarray, some having already exploded into towering white spray while others were poised in smooth orange curls waiting to start that action.\n \n And there were new friends everywhere! Overhead, a flock of spora were frozen in a steep glide, preparatory to a beach landing. Purnie had heard of these playful creatures many times. Today, with his brothers in school, he would have the pets all to himself. Further down the beach was a pair of two-legged animals poised in mid-step, facing the spot where Purnie now stood. Some distance behind them were eight more, each of whom were motionless in a curious pose of interrupted animation. And down in the water, where the ocean ran itself into thin nothingness upon the sand, he saw standing here and there the comical tripons, those three-legged marine buffoons who made handsome careers of munching seaweed.\n \n \"Hi there!\" Purnie called. When he got no reaction, he remembered that he himself was \"dead\" to the living world: he was still in a zone of time-stopping, on the inside looking out. For him, the world would continue to be a tableau of mannikins until he resumed time.\n \n \n\n \n \"Hi there!\" he called again; but now his mental attitude was that he expected time to resume. It did! Immediately he was surrounded by activity. He heard the roar of the crashing orange breakers, he tasted the dew of acid that floated from the spray, and he saw his new friends continue the actions which he had stopped while back in the forest.\n \n He knew, too, that at this moment, in the forest, the little brook picked up its flow where it had left off, the purple clouds resumed their leeward journey up the valley, and the bees continued their pollen-gathering without having missed a single stroke of their delicate wings. The brook, the clouds, and the insects had not been interrupted in the least; their respective tasks had been performed with continuing sureness. It was time itself that Purnie had stopped, not the world around him.\n \n He scampered around the rockpile and down the sandy cliff to meet the tripons who, to him, had just come to life.\n \n \"I can stand on my head!\" He set down his lunch and balanced himself bottoms-up while his legs pawed the air in an effort to hold him in position. He knew it was probably the worst head-stand he had ever done, for he felt weak and dizzy. Already time-stopping had left its mark on his strength. But his spirits ran on unchecked.\n \n The tripon thought Purnie's feat was superb. It stopped munching long enough to give him a salutory wag of its rump before returning to its repast.\n \n Purnie ran from pillar to post, trying to see and do everything at once. He looked around to greet the flock of spora, but they had glided to a spot further along the shore. Then, bouncing up to the first of the two-legged animals, he started to burst forth with his habitual \"Hi there!\" when he heard them making sounds of their own.\n \n \"... will be no limit to my operations now, Benson. This planet makes seventeen. Seventeen planets I can claim as my own!\"\n \n \"My, my. Seventeen planets. And tell me, Forbes, just what the hell are you going to do with them—mount them on the wall of your den back in San Diego?\"\n \n \"Hi there, wanna play?\" Purnie's invitation got nothing more than startled glance from the animals who quickly returned to their chatter. He scampered up the beach, picked up his lunch, and ran back to them, tagging along at their heels. \"I've got my lunch, want some?\"\n \n \"Benson, you'd better tell your men back there to stop gawking at the scenery and get to work. Time is money. I didn't pay for this expedition just to give your flunkies a vacation.\"\n \n \n\n \n The animals stopped so suddenly that Purnie nearly tangled himself in their heels.\n \n \"All right, Forbes, just hold it a minute. Listen to me. Sure, it's your money that put us here; it's your expedition all the way. But you hired me to get you here with the best crew on earth, and that's just what I've done. My job isn't over yet. I'm responsible for the safety of the men while we're here, and for the safe trip home.\"\n \n \"Precisely. And since you're responsible, get 'em working. Tell 'em to bring along the flag. Look at the damn fools back there, playing in the ocean with a three-legged ostrich!\"\n \n \"Good God, man, aren't you human? We've only been on this planet twenty minutes! Naturally they want to look around. They half expected to find wild animals or worse, and here we are surrounded by quaint little creatures that run up to us like we're long-lost brothers. Let the men look around a minute or two before we stake out your claim.\"\n \n \"Bah! Bunch of damn children.\"\n \n As Purnie followed along, a leg shot out at him and missed. \"Benson, will you get this bug-eyed kangaroo away from me!\" Purnie shrieked with joy at this new frolic and promptly stood on his head. In this position he got an upside down view of them walking away.\n \n He gave up trying to stay with them. Why did they move so fast, anyway? What was the hurry? As he sat down and began eating his lunch, three more of the creatures came along making excited noises, apparently trying to catch up to the first two. As they passed him, he held out his lunch. \"Want some?\" No response.\n \n Playing held more promise than eating. He left his lunch half eaten and went down to where they had stopped further along the beach.\n \n \"Captain Benson, sir! Miles has detected strong radiation in the vicinity. He's trying to locate it now.\"\n \n \"There you are, Forbes. Your new piece of real estate is going to make you so rich that you can buy your next planet. That'll make eighteen, I believe.\"\n \n \"Radiation, bah! We've found low-grade ore on every planet I've discovered so far, and this one'll be no different. Now how about that flag? Let's get it up, Benson. And the cornerstone, and the plaque.\"\n \n \"All right, lads. The sooner we get Mr. Forbes's pennant raised and his claim staked out, the sooner we can take time to look around. Lively now!\"\n \n \n\n \n When the three animals went back to join the rest of their group, the first two resumed walking. Purnie followed along.\n \n \"Well, Benson, you won't have to look far for materials to use for the base of the flag pole. Look at that rockpile up there.\n \n \"Can't use them. They're petrified logs. The ones on top are too high to carry down, and if we move those on the bottom, the whole works will slide down on top of us.\"\n \n \"Well—that's your problem. Just remember, I want this flag pole to be solid. It's got to stand at least—\"\n \n \"Don't worry, Forbes, we'll get your monument erected. What's this with the flag? There must be more to staking a claim than just putting up a flag.\"\n \n \"There is, there is. Much more. I've taken care of all requirements set down by law to make my claim. But the flag? Well, you might say it represents an empire, Benson. The Forbes Empire. On each of my flags is the word FORBES, a symbol of development and progress. Call it sentiment if you will.\"\n \n \"Don't worry, I won't. I've seen real-estate flags before.\"\n \n \"Damn it all, will you stop referring to this as a real-estate deal? What I'm doing is big, man. Big! This is pioneering.\"\n \n \"Of course. And if I'm not mistaken, you've set up a neat little escrow system so that you not only own the planets, but you will virtually own the people who are foolish enough to buy land on them.\"\n \n \"I could have your hide for talking to me like this. Damn you, man! It's people like me who pay your way. It's people like me who give your space ships some place to go. It's people like me who pour good money into a chancey job like this, so that people like you can get away from thirteen-story tenement houses. Did you ever think of that?\"\n \n \"I imagine you'll triple your money in six months.\"\n \n When they stopped, Purnie stopped. At first he had been interested in the strange sounds they were making, but as he grew used to them, and as they in turn ignored his presence, he hopped alongside chattering to himself, content to be in their company.\n \n He heard more of these sounds coming from behind, and he turned to see the remainder of the group running toward them.\n \n \"Captain Benson! Here's the flag, sir. And here's Miles with the scintillometer. He says the radiation's getting stronger over this way!\"\n \n \"How about that, Miles?\"\n \n \"This thing's going wild, Captain. It's almost off scale.\"\n \n \n\n \n Purnie saw one of the animals hovering around him with a little box. Thankful for the attention, he stood on his head. \"Can you do this?\" He was overjoyed at the reaction. They all started making wonderful noises, and he felt most satisfied.\n \n \"Stand back, Captain! Here's the source right here! This little chuck-walla's hotter than a plutonium pile!\"\n \n \"Let me see that, Miles. Well, I'll be damned! Now what do you suppose—\"\n \n By now they had formed a widening circle around him, and he was hard put to think of an encore. He gambled on trying a brand new trick: he stood on one leg.\n \n \"Benson, I must have that animal! Put him in a box.\"\n \n \"Now wait a minute, Forbes. Universal Law forbids—\"\n \n \"This is my planet and I am the law. Put him in a box!\"\n \n \"With my crew as witness, I officially protest—\"\n \n \"Good God, what a specimen to take back. Radio-active animals! Why, they can reproduce themselves, of course! There must be thousands of these creatures around here someplace. And to think of those damn fools on Earth with their plutonium piles! Hah! Now I'll have investors flocking to me. How about it, Benson—does pioneering pay off or doesn't it?\"\n \n \"Not so fast. Since this little fellow is radioactive, there may be great danger to the crew—\"\n \n \"Now look here! You had planned to put mineral specimens in a lead box, so what's the difference? Put him in a box.\"\n \n \"He'll die.\"\n \n \"I have you under contract, Benson! You are responsible to me, and what's more, you are on my property. Put him in a box.\"\n \n Purnie was tired. First the time-stopping, then this. While this day had brought more fun and excitement than he could have hoped for, the strain was beginning to tell. He lay in the center of the circle happily exhausted, hoping that his friends would show him some of their own tricks.\n \n He didn't have to wait long. The animals forming the circle stepped back and made way for two others who came through carrying a box. Purnie sat up to watch the show.\n \n \"Hell, Captain, why don't I just pick him up? Looks like he has no intention of running away.\"\n \n \"Better not, Cabot. Even though you're shielded, no telling what powers the little fella has. Play it safe and use the rope.\"\n \n \"I swear he knows what we're saying. Look at those eyes.\"\n \n \"All right, careful now with that line.\"\n \n \"Come on, baby. Here you go. That's a boy!\"\n \n \n\n \n Purnie took in these sounds with perplexed concern. He sensed the imploring quality of the creature with the rope, but he didn't know what he was supposed to do. He cocked his head to one side as he wiggled in anticipation.\n \n He saw the noose spinning down toward his head, and, before he knew it, he had scooted out of the circle and up the sandy beach. He was surprised at himself for running away. Why had he done it? He wondered. Never before had he felt this fleeting twinge that made him want to protect himself.\n \n He watched the animals huddle around the box on the beach, their attention apparently diverted to something else. He wished now that he had not run away; he felt he had lost his chance to join in their fun.\n \n \"Wait!\" He ran over to his half-eaten lunch, picked it up, and ran back into the little crowd. \"I've got my lunch, want some?\"\n \n The party came to life once more. His friends ran this way and that, and at last Purnie knew that the idea was to get him into the box. He picked up the spirit of the tease, and deliberately ran within a few feet of the lead box, then, just as the nearest pursuer was about to push him in, he sidestepped onto safer ground. Then he heard a deafening roar and felt a warm, wet sting in one of his legs.\n \n \"Forbes, you fool! Put away that gun!\"\n \n \"There you are, boys. It's all in knowing how. Just winged him, that's all. Now pick him up.\"\n \n The pang in his leg was nothing: Purnie's misery lay in his confusion. What had he done wrong? When he saw the noose spinning toward him again, he involuntarily stopped time. He knew better than to use this power carelessly, but his action now was reflex. In that split second following the sharp sting in his leg, his mind had grasped in all directions to find an acceptable course of action. Finding none, it had ordered the stoppage of time.\n \n The scene around him became a tableau once more. The noose hung motionless over his head while the rest of the rope snaked its way in transverse waves back to one of the two-legged animals. Purnie dragged himself through the congregation, whimpering from his inability to understand.\n \n As he worked his way past one creature after another, he tried at first to not look them in the eye, for he felt sure he had done something wrong. Then he thought that by sneaking a glance at them as he passed, he might see a sign pointing to their purpose. He limped by one who had in his hand a small shiny object that had been emitting smoke from one end; the smoke now billowed in lifeless curls about the animal's head. He hobbled by another who held a small box that had previously made a hissing sound whenever Purnie was near. These things told him nothing. Before starting his climb up the knoll, he passed a tripon which, true to its reputation, was comical even in fright. Startled by the loud explosion, it had jumped four feet into the air before Purnie had stopped time. Now it hung there, its beak stuffed with seaweed and its three legs drawn up into a squatting position.\n \n Leaving the assorted statues behind, he limped his way up the knoll, torn between leaving and staying. What an odd place, this ocean country! He wondered why he had not heard more detail about the beach animals.\n \n Reaching the top of the bluff, he looked down upon his silent friends with a feeling of deep sorrow. How he wished he were down there playing with them. But he knew at last that theirs was a game he didn't fit into. Now there was nothing left but to resume time and start the long walk home. Even though the short day was nearly over, he knew he didn't dare use time-stopping to get himself home in nothing flat. His fatigued body and clouded mind were strong signals that he had already abused this faculty.\n \n \n\n \n When Purnie started time again, the animal with the noose stood in open-mouthed disbelief as the rope fell harmlessly to the sand—on the spot where Purnie had been standing.\n \n \"My God, he's—he's gone.\"\n \n Then another of the animals, the one with the smoking thing in his hand, ran a few steps toward the noose, stopped and gaped at the rope.\n\"All right, you people, what's going on here? Get him in that box. What did you do with him?\"\n \n The resumption of time meant nothing at all to those on the beach, for to them time had never stopped. The only thing they could be sure of was that at one moment there had been a fuzzy creature hopping around in front of them, and the next moment he was gone.\n \n \"Is he invisible, Captain? Where is he?\"\n \n \"Up there, Captain! On those rocks. Isn't that him?\"\n \n \"Well, I'll be damned!\"\n \n \"Benson, I'm holding you personally responsible for this! Now that you've botched it up, I'll bring him down my own way.\"\n \n \"Just a minute, Forbes, let me think. There's something about that fuzzy little devil that we should.... Forbes! I warned you about that gun!\"\n \n Purnie moved across the top of the rockpile for a last look at his friends. His weight on the end of the first log started the slide. Slowly at first, the giant pencils began cascading down the short distance to the sand. Purnie fell back onto solid ground, horrified at the spectacle before him. The agonizing screams of the animals below filled him with hysteria.\n \n The boulders caught most of them as they stood ankle-deep in the surf. Others were pinned down on the sand.\n \n \"I didn't mean it!\" Purnie screamed. \"I'm sorry! Can't you hear?\" He hopped back and forth near the edge of the rise, torn with panic and shame. \"Get up! Please get up!\" He was horrified by the moans reaching his ears from the beach. \"You're getting all wet! Did you hear me? Please get up.\" He was choked with rage and sorrow. How could he have done this? He wanted his friends to get up and shake themselves off, tell him it was all right. But it was beyond his power to bring it about.\n \n The lapping tide threatened to cover those in the orange surf.\n \n \n\n \n Purnie worked his way down the hill, imploring them to save themselves. The sounds they made carried a new tone, a desperate foreboding of death.\n \n \"Rhodes! Cabot! Can you hear me?\"\n \n \"I—I can't move, Captain. My leg, it's.... My God, we're going to drown!\"\n \n \"Look around you, Cabot. Can you see anyone moving?\"\n \n \"The men on the beach are nearly buried, Captain. And the rest of us here in the water—\"\n \n \"Forbes. Can you see Forbes? Maybe he's—\" His sounds were cut off by a wavelet gently rolling over his head.\n \n Purnie could wait no longer. The tides were all but covering one of the animals, and soon the others would be in the same plight. Disregarding the consequences, he ordered time to stop.\n \n Wading down into the surf, he worked a log off one victim, then he tugged the animal up to the sand. Through blinding tears, Purnie worked slowly and carefully. He knew there was no hurry—at least, not as far as his friends' safety was concerned. No matter what their condition of life or death was at this moment, it would stay the same way until he started time again. He made his way deeper into the orange liquid, where a raised hand signalled the location of a submerged body. The hand was clutching a large white banner that was tangled among the logs. Purnie worked the animal free and pulled it ashore.\n \n It was the one who had been carrying the shiny object that spit smoke.\n \n Scarcely noticing his own injured leg, he ferried one victim after another until there were no more in the surf. Up on the beach, he started unraveling the logs that pinned down the animals caught there. He removed a log from the lap of one, who then remained in a sitting position, his face contorted into a frozen mask of agony and shock. Another, with the weight removed, rolled over like an iron statue into a new position. Purnie whimpered in black misery as he surveyed the chaotic scene before him.\n \n At last he could do no more; he felt consciousness slipping away from him.\n \n He instinctively knew that if he lost his senses during a period of time-stopping, events would pick up where they had left off ... without him. For Purnie, this would be death. If he had to lose consciousness, he knew he must first resume time.\n \n Step by step he plodded up the little hill, pausing every now and then to consider if this were the moment to start time before it was too late. With his energy fast draining away, he reached the top of the knoll, and he turned to look down once more on the group below.\n \n Then he knew how much his mind and body had suffered: when he ordered time to resume, nothing happened.\n \n His heart sank. He wasn't afraid of death, and he knew that if he died the oceans would roll again and his friends would move about. But he wanted to see them safe.\n \n He tried to clear his mind for supreme effort. There was no urging time to start. He knew he couldn't persuade it by bits and pieces, first slowly then full ahead. Time either progressed or it didn't. He had to take one viewpoint or the other.\n \n Then, without knowing exactly when it happened, his mind took command....\n \n \n\n \n His friends came to life. The first one he saw stir lay on his stomach and pounded his fists on the beach. A flood of relief settled over Purnie as sounds came from the animal.\n \n \"What's the matter with me? Somebody tell me! Am I nuts? Miles! Schick! What's happening?\"\n \n \"I'm coming, Rhodes! Heaven help us, man—I saw it, too. We're either crazy or those damn logs are alive!\"\n \n \"It's not the logs. How about us? How'd we get out of the water? Miles, we're both cracking.\"\n \n \"I'm telling you, man, it's the logs, or rocks or whatever they are. I was looking right at them. First they're on top of me, then they're piled up over there!\"\n \n \"Damnit, the logs didn't pick us up out of the ocean, did they? Captain Benson!\"\n \n \"Are you men all right?\"\n \n \"Yes sir, but—\"\n \n \"Who saw exactly what happened?\"\n \n \"I'm afraid we're not seeing right, Captain. Those logs—\"\n \n \"I know, I know. Now get hold of yourselves. We've got to round up the others and get out of here while time is on our side.\"\n \n \"But what happened, Captain?\"\n \n \"Hell, Rhodes, don't you think I'd like to know? Those logs are so old they're petrified. The whole bunch of us couldn't lift one. It would take super-human energy to move one of those things.\"\n \n \"I haven't seen anything super-human. Those ostriches down there are so busy eating seaweed—\"\n \n \"All right, let's bear a hand here with the others. Some of them can't walk. Where's Forbes?\"\n \n \"He's sitting down there in the water, Captain, crying like a baby. Or laughing. I can't tell which.\"\n \n \"We'll have to get him. Miles, Schick, come along. Forbes! You all right?\"\n \n \"Ho-ho-ho! Seventeen! Seventeen! Seventeen planets, Benson, and they'll do anything I say! This one's got a mind of its own. Did you see that little trick with the rocks? Ho-ho!\"\n \n \"See if you can find his gun, Schick; he'll either kill himself or one of us. Tie his hands and take him back to the ship. We'll be along shortly.\"\n \n \"Hah-hah-hah! Seventeen! Benson, I'm holding you personally responsible for this. Hee-hee!\"\n \n \n\n \n Purnie opened his eyes as consciousness returned. Had his friends gone?\n \n He pulled himself along on his stomach to a position between two rocks, where he could see without being seen. By the light of the twin moons he saw that they were leaving, marching away in groups of two and three, the weak helping the weaker. As they disappeared around the curving shoreline, the voices of the last two, bringing up the rear far behind the others, fell faintly on his ears over the sound of the surf.\n \n \"Is it possible that we're all crazy, Captain?\"\n \n \"It's possible, but we're not.\"\n \n \"I wish I could be sure.\"\n \n \"See Forbes up ahead there? What do you think of him?\"\n \n \"I still can't believe it.\"\n \n \"He'll never be the same.\"\n \n \"Tell me something. What was the most unusual thing you noticed back there?\"\n \n \"You must be kidding, sir. Why, the way those logs were off of us suddenly—\"\n \n \"Yes, of course. But I mean beside that.\"\n \n \"Well, I guess I was kind of busy. You know, scared and mixed up.\"\n \n \"But didn't you notice our little pop-eyed friend?\"\n \n \"Oh, him. I'm afraid not, Captain. I—I guess I was thinking mostly of myself.\"\n \n \"Hmmm. If I could only be sure I saw him. If only someone else saw him too.\"\n \n \"I'm afraid I don't follow you, sir.\"\n \n \"Well, damn it all, you know that Forbes took a pot shot at him. Got him in the leg. That being the case, why would the fuzzy little devil come back to his tormentors—back to us—when we were trapped under those logs?\"\n \n \"Well, I guess as long as we were trapped, he figured we couldn't do him any more harm.... I'm sorry, that was a stupid answer. I guess I'm still a little shaky.\"\n \n \"Forget it. Look, you go ahead to the ship and make ready for take-off. I'll join you in a few minutes. I think I'll go back and look around. You know. Make sure we haven't left anyone.\"\n \n \"No need to do that. They're all ahead of us. I've checked.\"\n \n \"That's my responsibility, Cabot, not yours. Now go on.\"\n \n \n\n \n As Purnie lay gathering strength for the long trek home, he saw through glazed eyes one of the animals coming back along the beach. When it was nearly directly below him, he could hear it making sounds that by now had become familiar.\n \n \"Where are you?\"\n \n Purnie paid little attention to the antics of his friend; he was beyond understanding. He wondered what they would say at home when he returned.\n \n \"We've made a terrible mistake. We—\" The sounds faded in and out on Purnie's ears as the creature turned slowly and called in different directions. He watched the animal walk over to the pile of scattered logs and peer around and under them.\n \n \"If you're hurt I'd like to help!\" The twin moons were high in the sky now, and where their light broke through the swirling clouds a double shadow was cast around the animal. With foggy awareness, Purnie watched the creature shake its head slowly, then walk away in the direction of the others.\n \n Purnie's eyes stared, without seeing, at the panorama before him. The beach was deserted now, and his gaze was transfixed on a shimmering white square floating on the ocean. Across it, the last thing Purnie ever saw, was emblazoned the word FORBES.",
      "metadata": {
        "title": "Beach Scene",
        "author": "Marshall King",
        "passage_id": "51494",
        "uid": "98c5691766924463ade6a3406e9f9bc0",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "1",
                "uid": "854530e8f8534a138e1789433cc58ac3",
                "response_text": "Purnie, an animal, is going to see the ocean on his fifth birthday. He has heard stories about this place, and experiencing it firsthand is surreal for him. Purnie is careful not to disturb the animals he sees along the way because he has frozen time, and everything must resume normally when he unfreezes it. He knows that time-stopping is forbidden for animals his age, but he chooses to believe that his family will be proud of his bravery. \n\nFinally, he sees the ocean in front of him, and he resumes time. He does a head-stand and feels weak and dizzy. These feelings are a result of the time-stop, and he knows it. Purnie approaches some humans on the beach. A man named Forbes is in the middle of explaining to his captain, Benson, that he has found 17 planets to claim as his own. Forbes is hellbent on raising his FORBES flag as soon as possible. He is eager to stake his claim to the land and says that his mission is much bigger than real estate alone. Benson retorts that yes, his mission is bigger than just real estate because his paperwork says that Forbes will own all of the inhabitants of the planets he claims as well as the land. \n\nThe crew members use a special machine and  find radiation emanating from Purnie. Forbes demands that they put the animal in a box. Benson protests and reminds Forbes that it’s against Universal Law, but Forbes insists. Purnie experiences his first-ever impulse to run away with fear when a noose comes towards him. He goes back to pick up his fruit, and Forbes shoots him in the leg. When the man throws the noose again, Purnie involuntarily stops time. He drags himself up the knoll where he originally came from. \n\nThe humans are astonished when time resumes and Purnie is not where he was a split second ago. They spot him up on top of a pile of petrified logs, and suddenly the logs fall down the hill and pin the men down. Purnie is shocked and regretful. The whole thing was an accident. He deliberately stops time and uses all of his remaining strength to lift the logs off of the humans. Purnie begins to lose consciousness, and he knows that he must resume time or he will die. After pouring all of his strength into this action, time does begin again. The humans resume life and feel as though they have gone mad. They know that they were just facing death by drowning, and now they are free. The logs were so heavy that it would have taken superhuman strength to move them. Forbes, in particular, has really gone mad, and he laughs to himself uncontrollably. Benson believes that Purnie was responsible for moving the logs, but of course that seems physically impossible. \n \nPurnie stares off at the beautiful ocean views and watches the men leave in their vehicle as he dies. \n"
              },
              {
                "worker_id": "8",
                "uid": "402b2fdd91eb4c30ab476be31fe34319",
                "response_text": "On his fifth birthday, Purnie--a small, kangaroo-like creature with large eyes--runs through the forest as he goes to see the beach for the first time. Bemoaning the fact that days are so short, he triggers his ability to stop time. He marvels at the bees frozen in mid-air and reminds himself to not abuse his time-stopping power or it could drain all of his energy and kill him. Before arriving at the beach, he gathers some fruit for lunch and then pauses atop a small, rocky hill from where he takes in his first view of the ocean. Purnie is overwhelmed and thrilled at the idea of making friends with the new animals he sees: three-legged tripons, a flock of spora, and, further down, a group of ten humans making their way onto the beach. When he unfreezes time, Purnie climbs down the rockpile and runs around the beach, showing his new animal friends his headstand technique. Next, he visits two humans, who barely notice his presence. Captain Benson is the hired leader of the expedition; Forbes is a wealthy real estate investor who owns seventeen planets and considers himself a \"pioneer\". Forbes explains to Benson that coming to the planet is a mere formality as he has already staked his claim to make this planet his eighteenth; planting a flag emblazoned with his name is a symbolic gesture. Benson's men wish to explore the new planet and its native species, but Forbes is impatient to build his flagpole and leave. He has no interest in learning about the creatures there, only in owning their land and tripling his investment over time. Purnie wants to play with the humans, and Forbes expresses his annoyance and tries to get a crewmember to take him away. One of the crew members, Miles, checks the planet's surface for radiation while Benson and Forbes investigate the rockpile where Purnie had perched earlier to see if the rocks may be used to support Forbes' flagpole. After they determine the rocks are extremely heavy petrified logs and cannot be moved, Miles alerts them that Purnie is emitting a large amount of radiation. Forbes orders the crew to capture Purnie so he can take him home, reproduce him, and profit off of his radiation resource. As Purnie evades capture, thinking he is playing with the men, Forbes grows impatient and shoots him, causing Purnie to instinctively stop time. Injured, Purnie takes shelter atop the petrified logs, which fall under him and crush the humans below. Panicked, Purnie rushes to remove the logs, using up his own energy. When he unfreezes time again, the men are astonished. In one moment, they were crushed by logs, and in the next, the logs had disappeared. This drives Forbes insane, and he laughs as they take him away to the ship. Having exhausted all of his energy saving the men, Purnie watches them leave, succumbs to his wounds, and dies."
              },
              {
                "worker_id": "2",
                "uid": "88f4f4cbafc945e2a7c83a1804a4799a",
                "response_text": "Purnie, a five-year-old creature, is off from school for his birthday and takes a secret trip to see the ocean. When he is near enough to smell the ocean, Purnie freezes time even though he has been warned about the amount of energy this takes, and there is a maxim that small children who stop time without an adult may not live to regret it. When he reaches the shore, he recognizes the petrified logs, spora, and tripons from his brothers’ descriptions and is delighted to find two-legged animals there as well. Purnie approaches the two-legged animals who are actually humans and speaks to them but is ignored. The humans discuss the men who are curiously looking at the animals around them, and Forbes, the leader, orders Captain Benson to have the men work right away. Purnie follows the men closely, and Forbes gets annoyed and kicks at him. They talk about this being Forbes's eighteenth planet, and Forbes wants his flag planted and a cornerstone and plaque installed. One of the men gets a strong reading on his scintillometer, a device that detects radiation. Tracing the reading, they find it is coming from Purnie. Forbes orders Purnie put into a lead box, thinking radioactive animals can reproduce and provide an endless supply of radioactive materials. Benson is reluctant because putting Purnie in the box will kill him, and it goes against Universal Law. Forbes reminds him of their contract, and Benson has his men try to rope Purnie, who thinks it is a game and playfully comes near the box before running away. When Forbes loses patience, he shoots at Purnie to wound him. Stunned, he stops and sees the noose coming toward him. Purnie freezes time again, limps away, and climbs to the top of the bluff. When he restarts time, the men are shocked he is no longer there on the beach with them. Spying Purnie on the bluff, they approach him; Purnie shifts, causing the logs to slide down and hit the men. Purnie is shocked and saddened at their suffering and feels awful he caused it. He realizes some of the men will drown because they can’t move and the tide is coming in, so he freezes time again, pulls the logs off the men, and drags them onto the beach. At the top of the hill, he restarts time, and the men are puzzled to be back on the beach with the logs off them. They question their sanity, and Forbes really has gone insane. The men help those who are seriously wounded, disarm Forbes and tie his hands together, and return him to the ship. Benson wonders why Purnie would come back to the humans who tormented him and goes back to the beach looking for him. He calls out for Purnie, tells him they made a mistake, and he would like to help Purnie if he is hurt. When he doesn’t see him, Benson leaves."
              },
              {
                "worker_id": "10",
                "uid": "c0ec7220fdbd43dd9fadab6237f73640",
                "response_text": "On an alien planet, a small non-human creature named Purnie is turning five years old. Purnie is precocious and adventurous, with the amazing ability to stop and start time with its mind. However, the super power comes with consequences. It tires Purnie to use time-stopping, and if done too much it can kill the user.\n\nPurnie leaves brothers and parents in a village in the forest and stops time while venturing beside a stream towards the ocean. Upon reaching a cliff overlooking the orange colored ocean, Purnie restarts time and discovers a group of human space explorers that are attempting to claim the planet and have only been onshore for 20 minutes musing at the strange creatures they are finding.\n\nForbes is from San Diego and has a history of claiming planets, this current one being the 17th if successfully staked with his flag, cornerstone, and plaque. He orders around Captain Benson and the rest of the crew, in a hurry to claim the planet upon their arrival.\n\nPurnie thinks the humans are friends to play with and tries to interact with them on multiple occasions. When the crew discovers that Purnie is radioactive, Forbes orders them to capture it and place it in a lead box to bring to Earth, which Forbes thinks will make him very rich. Purnie’s confusion about their hostility leads to an involuntary stopping of time which is used to return to the top of the cliff. Accidentally, Purnie sets off a rock slide after restarting time from the location on the top of the cliff and sets off a rock slide while peering over the edge that traps most of the humans under rocks and petrified logs along the beach and in the ocean. Deep horror causes Pernie to once again stop time, go down to the beach, and move all the debris off the humans - saving their lives.\n\nWhen time restarts once again, the humans are completely baffled as to how they were rescued, and Forbes loses his grip on reality entirely - having to be tied up by the crew for their return trip. Captain Benson wonders why a creature they tried to capture and kill would have come back to their rescue from their almost certain deaths and goes looking for Pernie as the crew prepares to leave. Not finding Purnie, the spaceship takes off, and the final sight of Purnie’s life before dying of exhaustion from using the superpower is a floating wet flag of Forbes' in the ocean.\n"
              }
            ]
          },
          {
            "question_text": "Describe Forbes' relationship with Benson.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "1",
                "uid": "854530e8f8534a138e1789433cc58ac3",
                "response_text": "Forbes is the head of the expedition to claim planets, and Benson is the Captain of the crew. Forbes provides all of the money to make the trips possible, and he pays Benson’s and the other mens’ salaries. Captain Benson is responsible for keeping all of the men safe and making sure the trip goes smoothly. \n\nAlthough Forbes is Benson’s superior, Benson does feel the need to speak his mind to Forbes. When Forbes demands that Benson’s crew stop dawdling and hurry up and put his FORBES flag up, Benson tells Forbes that they are only humans. Of course they are interested in the new environment and want to take a moment to look around. He is not afraid to tell Forbes that capturing Purnie or injuring him is against Universal Laws. Benson does not want to take part in illegal activities, and he scoffs at Forbes’ remarks that he is a pioneer and not a real estate developer. He openly tells Forbes that he knows he will triple his money after claiming these planets, so it’s not like he’s doing it for the greater good of humanity. Benson also asks Forbes if he’s going to take his 17 new planets back home with him to San Diego. It’s clear that Benson has little respect for Forbes and the way he conducts his business, but at the same time, he needs a job and Forbes is providing him with an incredible opportunity to survey all sorts of different planets.\n\nBenson has to face Forbes’ wrath when Purnie goes missing after Forbes shoots him and they attempt to put a noose around his neck. After Purnie unfreezes time, the men are confused as to what they just saw. Forbes turns to Benson and tells him that he is holding him responsible for this mishap even though there is zero evidence that Benson did anything wrong.\n\nAfter the logs fall on the men and Purnie uses all of his remaining strength to save their lives, Forbes is completely out of his mind. Benson finds it a bit humorous, especially since he has an inkling that Purnie, the bug-eyed creature, was behind the whole thing. He does not respect Forbes and thinks his disconnect to reality and repetitive laughter is what he deserves for the way he treated Purnie, himself, and the crew. \n"
              },
              {
                "worker_id": "8",
                "uid": "402b2fdd91eb4c30ab476be31fe34319",
                "response_text": "As a wealthy real estate investor who hires Captain Benson to lead the expedition to the new planet, Forbes treats Benson with a great amount of flippancy and disrespect. He disregards Benson's request to let the crew explore the planet before rushing to build his flagpole to symbolically stake his claim there. He completely ignores Benson when he shows concern for Purnie's well-being when Forbes wants to capture Purnie and take him home to profit off of the radiation in his body. While Benson cares for the safety of his crew and the lives of the new species they discover on this new planet, Forbes only sees ways in which he can personally profit and build his real estate empire. Forbes infuriates Benson when he shoots Purnie, and he goes so far as to call him a fool in spite of Forbes' warnings against talking to him with disrespect. While Benson attempts to understand how Purnie was able to evade capture, Forbes simply wants to maim Purnie and blame Benson for his own mistakes. When the crew gets pinned by the logs dislodged accidentally by Purnie, Benson's instincts are to find and help as many people as he can, including Forbes. "
              },
              {
                "worker_id": "2",
                "uid": "88f4f4cbafc945e2a7c83a1804a4799a",
                "response_text": "For the most part, the two men seem to tolerate each other. Forbes has employed Benson to hire men to explore the eighteenth planet that Forbes intends to claim as his own. As the employer, Forbes uses his position to order Benson to carry out his demands, although sometimes Benson questions Forbes's orders and resists carrying them out. Benson also questions Forbes's right to claim all the planets he is claiming and pokes a little fun at him at times. When Forbes wants Benson to order his men right to work after they arrive, Benson counters by asking if Forbes is human since they’ve only been there twenty minutes, and the men are curious about the new planet. Benson also needles Forbes when the men discover radiation, pointing out that he will make enough money to buy his next planet. Forbes is unimpressed with the discovery of radiation since they’ve found some on each of his other planets so far, but not in significant quantities. Forbes is most concerned about staking his claim by installing his flag, a cornerstone, and a plaque. When Benson questions the importance of the flag, Forbes tells him it signifies an empire, development, and progress. When Benson says Forbes will practically own the people who buy real estate on Forbes's planets, Forbes angrily replies that it is he and other people like him who risk their own money to give Benson and others space ships and places to go so they can get away from their thirteen-story tenement houses. Once it becomes clear that Purnie is the source of the large amount of radiation their equipment is detecting, Forbes orders Benson to have the animal put in one of their lead boxes meant to hold radioactive minerals. When Benson starts to remind him that this is forbidden by Universal Law, Forbes asserts his authority, reminding Benson the planet is his, and he is the law. After Purnie avoids capture and Forbes wounds him, Benson calls Forbes a fool and tells him to put his gun away, but Forbes claims he just nicked the animal. When Purnie escapes their attempts to rope him, Forbes blames Benson for ruining everything and is determined to capture Purnie himself. Benson tries to stop him, but Purnie shifts on the pile of petrified logs, sending them onto the men. When Forbes goes mad at the end of the story, Benson orders his men to take his gun from him and tie his hands together as they take him to the ship. \n"
              },
              {
                "worker_id": "10",
                "uid": "c0ec7220fdbd43dd9fadab6237f73640",
                "response_text": "Benson is the captain of Forbes’ expedition spaceship that has landed on the ocean shore of an alien planet. Forbes is very much in charge and makes repeated orders to Benson throughout the story that he obeys. Benson attempts to keep the peace by following and acquiescing to Forbes’ sometimes unethical orders (like placing the creature, Purnie, in a sealed lead box that would kill him). Benson has a sensitive reasoning that Forbes does not possess, like when he thinks it possible Purnie may just come along without being sealed in the box, and when he wonders why Purnie would return to rescue the men that had tried to capture him.\n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "1",
                "uid": "854530e8f8534a138e1789433cc58ac3",
                "response_text": "The unnamed planet where the story takes place is breathtaking, colorful, and lively with all sorts of fauna and flora unknown to Earth. There is blue moss on the forest floors, bubbling streams, and orange pools of water. There are also bees, purple clouds, petrified logs by the ocean, and three-legged animals who eat seaweed. The orange ocean waves crash against the sand, and two moons hover in the sky. Humans have never touched this land, so Purnie is surprised that he has never heard his brothers or parents talk about the two-legged animals who make strange sounds. He does not understand that they have just landed their ship here and are experiencing the land for the first time. "
              },
              {
                "worker_id": "8",
                "uid": "402b2fdd91eb4c30ab476be31fe34319",
                "response_text": "The story takes place on an unnamed planet home to a great amount of biodiversity. Purnie is a small, kangaroo-like creature with large, bugged-out eyes; there seem to be several of his kind on this planet as well. There are forests with plentiful foliage, tall trees, and blue moss. The sky above has two moons and makes the trees seem endlessly tall with its low, dense, purple clouds. Throughout the forest flow milky-orange streams and whirlpools; bees buzz about pollinating paka plants. Purnie runs through this environment filled with the joy of life and makes his way to the ocean, driven towards it by its acid-sweet smell, and gathers fruit along the way. When Purnie arrives at the ocean, he stands atop a large rock pile, which turns out to be comprised of heavy petrified logs. He has stopped time, so everything he sees is frozen mid-action: The orange-and-white waves of the ocean tower mid-break, and he sees a flock of spora flying overhead, three-legged tripons chewing on seaweed, and a group of humans. According to the human crew member, Miles, there appears to be a great amount of radiation present on the surface of the planet as well as its creatures. "
              },
              {
                "worker_id": "2",
                "uid": "88f4f4cbafc945e2a7c83a1804a4799a",
                "response_text": "The setting is on a planet similar to Earth, with a varied landscape featuring forests, oceans, and valleys. Purnie lives in a village where there is a school that he and his brothers attend. There is a nearby ocean on the other side of the forest that separates it from the village. The forest is colorful with patches of blue moss and a stream with milky-orange water with little whirlpools, bees and other creatures, and low-hanging purple clouds. The forest extends for quite a distance because Purnie has never been to the ocean before. It is lush with foliage, including paka plants, plants that produce pollen and fruit, and tall trees that seem to reach as high as the clouds. From his brothers’ descriptions, Purnie knows what to expect at the beach, but he is still amazed when he sees everything for himself. The forest ends at a rocky knoll formed by petrified logs that overlooks the sea with its orange waves higher than a house and breakers coming onto the shore. There is a flock of birds called spora who land on the beach in a deep glide and humorous three-legged tripons that stand in the water and eat seaweed. As day ends, two moons appear in the sky, and their light is bright enough that Purnie can see the men leaving to return to their ship. \n"
              },
              {
                "worker_id": "10",
                "uid": "c0ec7220fdbd43dd9fadab6237f73640",
                "response_text": "On an unnamed Earth-like planet with orange water and purple clouds, there are creatures with spoken language that communicate amongst themselves, but are not able to communicate with humans when they speak.\n\nPurnie adventures away from his family village, along a small stream in the forest to a cliff by the sea, where it innocently tries playing along the water’s edge with human explorers attempting to make a claim to the planet. Most of the story takes place in this beach location where the ocean is orange colored, there is a tall cliff with petrified logs piled up along its edge, and many hiding places. \n\nThe creatures on the planet are all very different to what humans are used to seeing, which creates a distracting setting for the crew through the story.\n"
              }
            ]
          },
          {
            "question_text": "What is Purnie's role in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "1",
                "uid": "854530e8f8534a138e1789433cc58ac3",
                "response_text": "Although Purnie is an animal and not a human, he plays a very important role in the story. Through his understanding of the world, we learn that he has never felt real fear before. This makes sense because although he has been warned about stopping time, and he has explicitly been told that it could lead to his death, he decides to go ahead with his birthday plan anyway and stop time and see the ocean. When the humans throw a noose at him in an attempt to capture him, he is shocked to find that his body instinctively runs from it. He doesn’t really experience the fear because he wants to play with them and has no interest in leaving the fun, but his natural impulses as an animal save his life at this moment. Humans have never before visited his planet, so this means that no other animal Purnie has come in contact with has made his body react this way. \nPurnie also demonstrates how evil Forbes is for trying to capture and kill such an innocent and caring animal. When Benson reminds Forbes that it’s illegal to shoot or capture Purnie, Forbes does not care at all. He wants the animal that is emitting radiation because he believes he can make a profit off of him. The value of Purnie’s life means nothing to him. However, as soon as Purnie feels as though his “friends” are in danger, he is willing to risk his own life by stopping time to help them. Purnie feels guilt, regret, and sorrow when he accidentally causes the petrified logs to fall on the men, yet Forbes has none of those feelings when he shoots Purnie in the leg and causes him pain. \n"
              },
              {
                "worker_id": "8",
                "uid": "402b2fdd91eb4c30ab476be31fe34319",
                "response_text": "Purnie celebrates his fifth birthday by taking his first-ever trip to the beach to take in the sights and meet new friends with the animals his brothers have told him about. Purnie is a small, kangaroo-like creature with the ability to stop time and an extremely upbeat and friendly attitude. Not only does he want to be friends with every animal he encounters, but he also wants to share his lunch with them and show them his ability to do a headstand. Purnie lives in harmony with the forest and its creatures and contrasts with the human explorers who come to lay claim to his planet. Purnie uses his time-stopping ability to extend his birthday because he feels there is not enough time in the day to enjoy all the wonders life has to offer. When he encounters the humans, he is curious because he has never seen their kind before. He listens to the funny sounds they make and follows them persistently, trying to share his lunch with them and demonstrate his headstand. When Forbes orders the men to capture him, Purnie believes they are simply playing a game, and he obliges by evading them. Even after Forbes shoots him, Purnie maintains his positive view of the humans and is more confused by what he did wrong than he is hurt by his actions. This further demonstrates Purnie's naivete and purity of heart. Although his family had warned him about the fatal danger of using his time-stopping powers for too long, Purnie cares more about the survival of the humans he perceives to be his friends and therefore sacrifices his own life to save them when they are crushed by the petrified logs."
              },
              {
                "worker_id": "2",
                "uid": "88f4f4cbafc945e2a7c83a1804a4799a",
                "response_text": "Purnie is a mischievous creature with the ability to stop and restart time who innocently causes a tragedy that he then tries to set right. Purnie is out for a day of exploration for his birthday when he comes across the humans on the beach. The humans have no interest in him until they discover Purnie is radioactive; then Forbes, the man financing the expedition and claiming the planet as his, orders them to put Purnie in one of their lead boxes. He is excited that animals are radioactive because they can reproduce and provide him with an endless supply of radioactive material to make him extremely wealthy. Purnie doesn’t know this, of course, and tries to engage the men in play with him. When he realizes they want him near the box, he teasingly runs close to it then away again. When Forbes shoots Purnie, Purnie sees the noose coming toward his head and instinctively stops times. This allows him to evade capture, make his way atop the bluff, and watch from a safe distance once he restarts time. The men are puzzled at Purnie’s sudden disappearance but plan to catch him when they see him on the bluff. As they approach, Purnie accidentally triggers a rockslide of the petrified logs that spill onto the men, trapping them where they are. Purnie is horrified at what he has caused as he hears the men’s cries of pain. He also notices that the tide is coming in, and the men will drown, so he stops time again, removes the logs from the men, and drags them onto the beach where they will be safe. After everyone is safe, Purnie restarts time, and men are incredulous to find themselves suddenly freed from the logs and on the beach. Forbes goes insane. Before they leave, Benson goes back to look for Purnie and offers to help him if he is wounded.\n"
              },
              {
                "worker_id": "10",
                "uid": "c0ec7220fdbd43dd9fadab6237f73640",
                "response_text": "Purnie creates the juxtaposition of innocent youth against corrupted power in adults. Purnie’s role is of childlike wonder in trying to interact with what it thinks are new friends along the shoreline - while those very friends attempt to capture and kill it. \n\nBecause Purnie is unable to communicate with humans, it also acts as a mime-like guide to the story, providing many physical actions that convey its emotions rather than language. Purnie’s ability to start and stop time creates pause for the reader to exist in the moments of great emotion that Purnie experiences - joy adventuring to the beach, confusion in trying to be captured, horror in thinking it has killed the humans. Ultimately, this superpower drains Purnie to the point of death.\n"
              }
            ]
          },
          {
            "question_text": "What causes Forbes to go mad?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "1",
                "uid": "854530e8f8534a138e1789433cc58ac3",
                "response_text": "Forbes believes he can control anyone and anything he comes in contact with. His first order of business upon landing on the gorgeous planet is to put up his flag emblazoned with his name. When Benson reminds him that the crew members are interested in taking a moment to look around, Forbes reprimands him for suggesting that they have the right to waste his money. He believes that putting up his flag is a symbol of defeat, and he is incredibly eager to take over a planet he literally just landed on and knows almost nothing about. He incessantly talks about the 17 other planets he has already conquered, and he calls himself a pioneer. Although Forbes definitely makes a lot of money by claiming these planets, he is more interested in the control and fame it brings him than the money he will inevitably make. \nThe first time that Purnie freezes time to escape the noose after Forbes shoots him in the leg, Forbes is incredibly confused but willing to blame the glitch on Benson. He shot Purnie after explicitly being told not to, so he assumes that Benson secretly managed to aid Purnie in getting away. He is furious at this act because capturing the animal emitting radiation is very important to him. He doesn't care if it’s illegal or immoral. He wants control of the planet, the animal, and the crew. \nThe second time that Purnie freezes time, Forbes cannot simply ignore it. He knows that he saw the petrified logs falling down the hill, he knows that he saw several crew members pinned under the logs, about to drown, and he knows that he himself was in a near-death situation one second and saved in the next. There is simply no explanation in his mind for what occurred, and his brain can’t compute the mysterious event. He laughs hysterically because he can’t process the information that his brain receives. He was about to die, and now he is perfectly fine, and he has no explanation for the chain of events. \n"
              },
              {
                "worker_id": "8",
                "uid": "402b2fdd91eb4c30ab476be31fe34319",
                "response_text": "When Forbes shoots Purnie in an effort to try to capture him and bring him back to Earth to exploit his radiation for profit, Purnie instinctively triggers his ability to stop time. He uses this opportunity to retreat back to his perch atop the pile of petrified logs. When he unfreezes time again, Forbes and the rest of the crew are astonished as it appears he has disappeared right before their eyes and reappeared atop the logs. As Purnie moves across the log pile, the logs begin to slip and roll down toward the beach, crushing the men and pinning them to the beach. As the surf begins to cover them, Purnie fears they will drown, pauses time, and begins to save them one-by-one as he slowly bleeds out and expends his energy. Once he has removed the logs from all of the crew members, including Forbes, he once more retreats to the top of the hill and collapses, exhausted. His mind un-freezes time, and the men are once more flabbergasted as it appears the logs have disappeared from their bodies in the blink of an eye. Purnie has saved them, but the experience is too baffling and too overwhelming for Forbes to process. He goes mad, and the men carry him away back to the ship."
              },
              {
                "worker_id": "2",
                "uid": "88f4f4cbafc945e2a7c83a1804a4799a",
                "response_text": "Forbes goes mad after Purnie stops time, removes the petrified logs from the men, and moves them up to the beach out of reach of the water so they won't drown. All of the men knew that the logs were so heavy they could not have moved them. And because the men don't know that time can be stopped, they have no idea how they moved from where they were or how the logs were pulled off them. After time resumes, Forbes is seen sitting in the water, talking about his seventeen planets that will do anything that he says. However, he says this planet has a mind of its own. Forbes is astonished that the rocks seemingly moved on their own. Forbes laughs continually and comments that he will hold Benson personally responsible. The men speculate that Forbes will never be the same after this experience. In fact, they take his gun so he can’t shoot any of them, and they tie his hands before they take him back to the ship. \n"
              },
              {
                "worker_id": "10",
                "uid": "c0ec7220fdbd43dd9fadab6237f73640",
                "response_text": "When Purnie stops time on two occasions - escaping from being put in the lead box, and saving the crew from death under fallen rocks - it creates a disappearing act that Forbes cannot wrap his head around. Forbes thinks he is rooted in reality, and then all of a sudden Purnie no longer exists, or the entire crew has been saved by what must have been superhuman strength to move petrified logs off their bodies.\n\nWhen Forbes can’t make sense of mysteriously being rescued from near-death in the ocean, he doesn’t know what is real any more. He goes mad into a giddiness of having done what he considers capturing this strange and wonderful planet for himself.\n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5252,
        "document_length_chars": 29449
      }
    }
  ]
}