{
  "item_metadata": {
    "item_id": "51609",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51609",
      "content": "A FALL OF GLASS\n \n \n By STANLEY R. LEE\n \n Illustrated by DILLON\n \n [Transcriber's Note: This etext was produced from Galaxy Magazine October 1960. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n The weatherman was always right: Temperature, 59; humidity, 47%; occasional light showers—but of what?\n \n\n \n The pockets of Mr. Humphrey Fownes were being picked outrageously.\n \n It was a splendid day. The temperature was a crisp 59 degrees, the humidity a mildly dessicated 47%. The sun was a flaming orange ball in a cloudless blue sky.\n \n His pockets were picked eleven times.\n \n It should have been difficult. Under the circumstances it was a masterpiece of pocket picking. What made it possible was Humphrey Fownes' abstraction; he was an uncommonly preoccupied individual. He was strolling along a quiet residential avenue: small private houses, one after another, a place of little traffic and minimum distractions. But he was thinking about weather, which was an unusual subject to begin with for a person living in a domed city. He was thinking so deeply about it that it never occurred to him that entirely too many people were bumping into him. He was thinking about Optimum Dome Conditions (a crisp 59 degrees, a mildly dessicated 47%) when a bogus postman, who pretended to be reading a postal card, jostled him. In the confusion of spilled letters and apologies from both sides, the postman rifled Fownes's handkerchief and inside jacket pockets.\n \n \n\n \n He was still thinking about temperature and humidity when a pretty girl happened along with something in her eye. They collided. She got his right and left jacket pockets. It was much too much for coincidence. The sidewalk was wide enough to allow four people to pass at one time. He should surely have become suspicious when two men engaged in a heated argument came along. In the ensuing contretemps they emptied his rear pants pockets, got his wristwatch and restored the contents of the handkerchief pocket. It all went off very smoothly, like a game of put and take—the sole difference being that Humphrey Fownes had no idea he was playing.\n \n There was an occasional tinkle of falling glass.\n \n It fell on the streets and houses, making small geysers of shiny mist, hitting with a gentle musical sound, like the ephemeral droppings of a celesta. It was precipitation peculiar to a dome: feather-light fragments showering harmlessly on the city from time to time. Dome weevils, their metal arms reaching out with molten glass, roamed the huge casserole, ceaselessly patching and repairing.\n \n Humphrey Fownes strode through the puffs of falling glass still intrigued by a temperature that was always 59 degrees, by a humidity that was always 47%, by weather that was always Optimum. It was this rather than skill that enabled the police to maintain such a tight surveillance on him, a surveillance that went to the extent of getting his fingerprints off the postman's bag, and which photographed, X-rayed and chemically analyzed the contents of his pockets before returning them. Two blocks away from his home a careless housewife spilled a five-pound bag of flour as he was passing. It was really plaster of Paris. He left his shoe prints, stride measurement, height, weight and handedness behind.\n \n By the time Fownes reached his front door an entire dossier complete with photographs had been prepared and was being read by two men in an orange patrol car parked down the street.\n \n \n\n \n Lanfierre had undoubtedly been affected by his job.\n \n Sitting behind the wheel of the orange car, he watched Humphrey Fownes approach with a distinct feeling of admiration, although it was an odd, objective kind of admiration, clinical in nature. It was similar to that of a pathologist observing for the first time a new and particularly virulent strain of pneumococcus under his microscope.\n \n Lanfierre's job was to ferret out aberration. It couldn't be tolerated within the confines of a dome. Conformity had become more than a social force; it was a physical necessity. And, after years of working at it, Lanfierre had become an admirer of eccentricity. He came to see that genuine quirks were rare and, as time went on, due partly to his own small efforts, rarer.\n \n Fownes was a masterpiece of queerness. He was utterly inexplicable. Lanfierre was almost proud of Humphrey Fownes.\n \n \"Sometimes his house shakes ,\" Lanfierre said.\n \n \"House shakes,\" Lieutenant MacBride wrote in his notebook. Then he stopped and frowned. He reread what he'd just written.\n \n \"You heard right. The house shakes ,\" Lanfierre said, savoring it.\n \n MacBride looked at the Fownes house through the magnifying glass of the windshield. \"Like from ... side to side ?\" he asked in a somewhat patronizing tone of voice.\n \n \"And up and down.\"\n \n MacBride returned the notebook to the breast pocket of his orange uniform. \"Go on,\" he said, amused. \"It sounds interesting.\" He tossed the dossier carelessly on the back seat.\n \n Lanfierre sat stiffly behind the wheel, affronted. The cynical MacBride couldn't really appreciate fine aberrations. In some ways MacBride was a barbarian. Lanfierre had held out on Fownes for months. He had even contrived to engage him in conversation once, a pleasantly absurd, irrational little chat that titillated him for weeks. It was only with the greatest reluctance that he finally mentioned Fownes to MacBride. After years of searching for differences Lanfierre had seen how extraordinarily repetitious people were, echoes really, dimly resounding echoes, each believing itself whole and separate. They spoke in an incessant chatter of cliches, and their actions were unbelievably trite.\n \n Then a fine robust freak came along and the others—the echoes—refused to believe it. The lieutenant was probably on the point of suggesting a vacation.\n \n \"Why don't you take a vacation?\" Lieutenant MacBride suggested.\n \n \"It's like this, MacBride. Do you know what a wind is? A breeze? A zephyr?\"\n \n \"I've heard some.\"\n \n \"They say there are mountain-tops where winds blow all the time. Strong winds, MacBride. Winds like you and I can't imagine. And if there was a house sitting on such a mountain and if winds did blow, it would shake exactly the way that one does. Sometimes I get the feeling the whole place is going to slide off its foundation and go sailing down the avenue.\"\n \n \n\n \n Lieutenant MacBride pursed his lips.\n \n \"I'll tell you something else,\" Lanfierre went on. \"The windows all close at the same time. You'll be watching and all of a sudden every single window in the place will drop to its sill.\" Lanfierre leaned back in the seat, his eyes still on the house. \"Sometimes I think there's a whole crowd of people in there waiting for a signal—as if they all had something important to say but had to close the windows first so no one could hear. Why else close the windows in a domed city? And then as soon as the place is buttoned up they all explode into conversation—and that's why the house shakes.\"\n \n MacBride whistled.\n \n \"No, I don't need a vacation.\"\n \n A falling piece of glass dissolved into a puff of gossamer against the windshield. Lanfierre started and bumped his knee on the steering wheel.\n \n \"No, you don't need a rest,\" MacBride said. \"You're starting to see flying houses, hear loud babbling voices. You've got winds in your brain, Lanfierre, breezes of fatigue, zephyrs of irrationality—\"\n \n At that moment, all at once, every last window in the house slammed shut.\n \n The street was deserted and quiet, not a movement, not a sound. MacBride and Lanfierre both leaned forward, as if waiting for the ghostly babble of voices to commence.\n \n The house began to shake.\n \n It rocked from side to side, it pitched forward and back, it yawed and dipped and twisted, straining at the mooring of its foundation. The house could have been preparing to take off and sail down the....\n \n MacBride looked at Lanfierre and Lanfierre looked at MacBride and then they both looked back at the dancing house.\n \n \"And the water ,\" Lanfierre said. \"The water he uses! He could be the thirstiest and cleanest man in the city. He could have a whole family of thirsty and clean kids, and he still wouldn't need all that water.\"\n \n The lieutenant had picked up the dossier. He thumbed through the pages now in amazement. \"Where do you get a guy like this?\" he asked. \"Did you see what he carries in his pockets?\"\n \n \"And compasses won't work on this street.\"\n \n The lieutenant lit a cigarette and sighed.\n \n He usually sighed when making the decision to raid a dwelling. It expressed his weariness and distaste for people who went off and got neurotic when they could be enjoying a happy, normal existence. There was something implacable about his sighs.\n \n \"He'll be coming out soon,\" Lanfierre said. \"He eats supper next door with a widow. Then he goes to the library. Always the same. Supper at the widow's next door and then the library.\"\n \n MacBride's eyebrows went up a fraction of an inch. \"The library?\" he said. \"Is he in with that bunch?\"\n \n Lanfierre nodded.\n \n \"Should be very interesting,\" MacBride said slowly.\n \n \"I can't wait to see what he's got in there,\" Lanfierre murmured, watching the house with a consuming interest.\n \n They sat there smoking in silence and every now and then their eyes widened as the house danced a new step.\n \n \n\n \n Fownes stopped on the porch to brush the plaster of paris off his shoes. He hadn't seen the patrol car and this intense preoccupation of his was also responsible for the dancing house—he simply hadn't noticed. There was a certain amount of vibration, of course. He had a bootleg pipe connected into the dome blower system, and the high-pressure air caused some buffeting against the thin walls of the house. At least, he called it buffeting; he'd never thought to watch from outside.\n \n He went in and threw his jacket on the sofa, there being no room left in the closets. Crossing the living room he stopped to twist a draw-pull.\n \n Every window slammed shut.\n \n \"Tight as a kite,\" he thought, satisfied. He continued on toward the closet at the foot of the stairs and then stopped again. Was that right? No, snug as a hug in a rug . He went on, thinking: The old devils.\n \n \n The downstairs closet was like a great watch case, a profusion of wheels surrounding the Master Mechanism, which was a miniature see-saw that went back and forth 365-1/4 times an hour. The wheels had a curious stateliness about them. They were all quite old, salvaged from grandfather's clocks and music boxes and they went around in graceful circles at the rate of 30 and 31 times an hour ... although there was one slightly eccentric cam that vacillated between 28 and 29. He watched as they spun and flashed in the darkness, and then set them for seven o'clock in the evening, April seventh, any year.\n \n Outside, the domed city vanished.\n \n It was replaced by an illusion. Or, as Fownes hoped it might appear, the illusion of the domed city vanished and was replaced by a more satisfactory, and, for his specific purpose, more functional, illusion. Looking through the window he saw only a garden.\n \n Instead of an orange sun at perpetual high noon, there was a red sun setting brilliantly, marred only by an occasional arcover which left the smell of ozone in the air. There was also a gigantic moon. It hid a huge area of sky, and it sang. The sun and moon both looked down upon a garden that was itself scintillant, composed largely of neon roses.\n \n Moonlight, he thought, and roses. Satisfactory. And cocktails for two. Blast, he'd never be able to figure that one out! He watched as the moon played, Oh, You Beautiful Doll and the neon roses flashed slowly from red to violet, then went back to the closet and turned on the scent. The house began to smell like an immensely concentrated rose as the moon shifted to People Will Say We're In Love .\n \n \n\n \n He rubbed his chin critically. It seemed all right. A dreamy sunset, an enchanted moon, flowers, scent.\n \n They were all purely speculative of course. He had no idea how a rose really smelled—or looked for that matter. Not to mention a moon. But then, neither did the widow. He'd have to be confident, assertive. Insist on it. I tell you, my dear, this is a genuine realistic romantic moon. Now, does it do anything to your pulse? Do you feel icy fingers marching up and down your spine?\n \n His own spine didn't seem to be affected. But then he hadn't read that book on ancient mores and courtship customs.\n \n How really odd the ancients were. Seduction seemed to be an incredibly long and drawn-out process, accompanied by a considerable amount of falsification. Communication seemed virtually impossible. \"No\" meant any number of things, depending on the tone of voice and the circumstances. It could mean yes, it could mean ask me again later on this evening.\n \n He went up the stairs to the bedroom closet and tried the rain-maker, thinking roguishly: Thou shalt not inundate. The risks he was taking! A shower fell gently on the garden and a male chorus began to chant Singing in the Rain . Undiminished, the yellow moon and the red sun continued to be brilliant, although the sun occasionally arced over and demolished several of the neon roses.\n \n The last wheel in the bedroom closet was a rather elegant steering wheel from an old 1995 Studebaker. This was on the bootleg pipe; he gingerly turned it.\n \n Far below in the cellar there was a rumble and then the soft whistle of winds came to him.\n \n He went downstairs to watch out the living room window. This was important; the window had a really fixed attitude about air currents. The neon roses bent and tinkled against each other as the wind rose and the moon shook a trifle as it whispered Cuddle Up a Little Closer .\n \n He watched with folded arms, considering how he would start. My dear Mrs. Deshazaway. Too formal. They'd be looking out at the romantic garden; time to be a bit forward. My very dear Mrs. Deshazaway. No. Contrived. How about a simple, Dear Mrs. Deshazaway . That might be it. I was wondering, seeing as how it's so late, if you wouldn't rather stay over instead of going home....\n \n \n Preoccupied, he hadn't noticed the winds building up, didn't hear the shaking and rattling of the pipes. There were attic pipes connected to wall pipes and wall pipes connected to cellar pipes, and they made one gigantic skeleton that began to rattle its bones and dance as high-pressure air from the dome blower rushed in, slowly opening the Studebaker valve wider and wider....\n \n The neon roses thrashed about, extinguishing each other. The red sun shot off a mass of sparks and then quickly sank out of sight. The moon fell on the garden and rolled ponderously along, crooning When the Blue of the Night Meets the Gold of the Day .\n \n The shaking house finally woke him up. He scrambled upstairs to the Studebaker wheel and shut it off.\n \n At the window again, he sighed. Repairs were in order. And it wasn't the first time the winds got out of line.\n \n Why didn't she marry him and save all this bother? He shut it all down and went out the front door, wondering about the rhyme of the months, about stately August and eccentric February and romantic April. April. Its days were thirty and it followed September. And all the rest have thirty-one. What a strange people, the ancients!\n \n He still didn't see the orange car parked down the street.\n \n \n\n \n \"Men are too perishable,\" Mrs. Deshazaway said over dinner. \"For all practical purposes I'm never going to marry again. All my husbands die.\"\n \n \"Would you pass the beets, please?\" Humphrey Fownes said.\n \n She handed him a platter of steaming red beets. \"And don't look at me that way,\" she said. \"I'm not going to marry you and if you want reasons I'll give you four of them. Andrew. Curt. Norman. And Alphonse.\"\n \n The widow was a passionate woman. She did everything passionately—talking, cooking, dressing. Her beets were passionately red. Her clothes rustled and her high heels clicked and her jewelry tinkled. She was possessed by an uncontrollable dynamism. Fownes had never known anyone like her. \"You forgot to put salt on the potatoes,\" she said passionately, then went on as calmly as it was possible for her to be, to explain why she couldn't marry him. \"Do you have any idea what people are saying? They're all saying I'm a cannibal! I rob my husbands of their life force and when they're empty I carry their bodies outside on my way to the justice of the peace.\"\n \n \"As long as there are people,\" he said philosophically, \"there'll be talk.\"\n \n \"But it's the air! Why don't they talk about that? The air is stale, I'm positive. It's not nourishing. The air is stale and Andrew, Curt, Norman and Alphonse couldn't stand it. Poor Alphonse. He was never so healthy as on the day he was born. From then on things got steadily worse for him.\"\n \n \"I don't seem to mind the air.\"\n \n She threw up her hands. \"You'd be the worst of the lot!\" She left the table, rustling and tinkling about the room. \"I can just hear them. Try some of the asparagus. Five. That's what they'd say. That woman did it again. And the plain fact is I don't want you on my record.\"\n \n \"Really,\" Fownes protested. \"I feel splendid. Never better.\"\n \n He could hear her moving about and then felt her hands on his shoulders. \"And what about those very elaborate plans you've been making to seduce me?\"\n \n Fownes froze with three asparagus hanging from his fork.\n \n \"Don't you think they'll find out? I found out and you can bet they will. It's my fault, I guess. I talk too much. And I don't always tell the truth. To be completely honest with you, Mr. Fownes, it wasn't the old customs at all standing between us, it was air. I can't have another man die on me, it's bad for my self-esteem. And now you've gone and done something good and criminal, something peculiar.\"\n \n \n\n \n Fownes put his fork down. \"Dear Mrs. Deshazaway,\" he started to say.\n \n \"And of course when they do find out and they ask you why, Mr. Fownes, you'll tell them. No, no heroics, please! When they ask a man a question he always answers and you will too. You'll tell them I wanted to be courted and when they hear that they'll be around to ask me a few questions. You see, we're both a bit queer.\"\n \n \"I hadn't thought of that,\" Fownes said quietly.\n \n \"Oh, it doesn't really matter. I'll join Andrew, Curt, Norman—\"\n \n \"That won't be necessary,\" Fownes said with unusual force. \"With all due respect to Andrew, Curt, Norman and Alphonse, I might as well state here and now I have other plans for you, Mrs. Deshazaway.\"\n \n \"But my dear Mr. Fownes,\" she said, leaning across the table. \"We're lost, you and I.\"\n \n \"Not if we could leave the dome,\" Fownes said quietly.\n \n \"That's impossible! How?\"\n \n In no hurry, now that he had the widow's complete attention, Fownes leaned across the table and whispered: \"Fresh air, Mrs. Deshazaway? Space? Miles and miles of space where the real-estate monopoly has no control whatever? Where the wind blows across prairies ; or is it the other way around? No matter. How would you like that , Mrs. Deshazaway?\"\n \n Breathing somewhat faster than usual, the widow rested her chin on her two hands. \"Pray continue,\" she said.\n \n \"Endless vistas of moonlight and roses? April showers, Mrs. Deshazaway. And June, which as you may know follows directly upon April and is supposed to be the month of brides, of marrying. June also lies beyond the dome.\"\n \n \"I see.\"\n \n \" And ,\" Mr. Fownes added, his voice a honeyed whisper, \"they say that somewhere out in the space and the roses and the moonlight, the sleeping equinox yawns and rises because on a certain day it's vernal and that's when it roams the Open Country where geigers no longer scintillate.\"\n \n \" My. \" Mrs. Deshazaway rose, paced slowly to the window and then came back to the table, standing directly over Fownes. \"If you can get us outside the dome,\" she said, \"out where a man stays warm long enough for his wife to get to know him ... if you can do that, Mr. Fownes ... you may call me Agnes.\"\n \n \n\n \n When Humphrey Fownes stepped out of the widow's house, there was a look of such intense abstraction on his features that Lanfierre felt a wistful desire to get out of the car and walk along with the man. It would be such a deliciously insane experience. (\"April has thirty days,\" Fownes mumbled, passing them, \"because thirty is the largest number such that all smaller numbers not having a common divisor with it are primes .\" MacBride frowned and added it to the dossier. Lanfierre sighed.)\n \n Pinning his hopes on the Movement, Fownes went straight to the library several blocks away, a shattered depressing place given over to government publications and censored old books with holes in them. It was used so infrequently that the Movement was able to meet there undisturbed. The librarian was a yellowed, dog-eared woman of eighty. She spent her days reading ancient library cards and, like the books around her, had been rendered by time's own censor into near unintelligibility.\n \n \"Here's one,\" she said to him as he entered. \" Gulliver's Travels. Loaned to John Wesley Davidson on March 14, 1979 for five days. What do you make of it?\"\n \n In the litter of books and cards and dried out ink pads that surrounded the librarian, Fownes noticed a torn dust jacket with a curious illustration. \"What's that?\" he said.\n \n \"A twister,\" she replied quickly. \"Now listen to this . Seven years later on March 21, 1986, Ella Marshall Davidson took out the same book. What do you make of that ?\"\n \n \"I'd say,\" Humphrey Fownes said, \"that he ... that he recommended it to her, that one day they met in the street and he told her about this book and then they ... they went to the library together and she borrowed it and eventually, why eventually they got married.\"\n \n \"Hah! They were brother and sister!\" the librarian shouted in her parched voice, her old buckram eyes laughing with cunning.\n \n Fownes smiled weakly and looked again at the dust jacket. The twister was unquestionably a meteorological phenomenon. It spun ominously, like a malevolent top, and coursed the countryside destructively, carrying a Dorothy to an Oz. He couldn't help wondering if twisters did anything to feminine pulses, if they could possibly be a part of a moonlit night, with cocktails and roses. He absently stuffed the dust jacket in his pocket and went on into the other rooms, the librarian mumbling after him: \"Edna Murdoch Featherstone, April 21, 1991,\" as though reading inscriptions on a tombstone.\n \n \n\n \n The Movement met in what had been the children's room, where unpaid ladies of the afternoon had once upon a time read stories to other people's offspring. The members sat around at the miniature tables looking oddly like giants fled from their fairy tales, protesting.\n \n \"Where did the old society fail?\" the leader was demanding of them. He stood in the center of the room, leaning on a heavy knobbed cane. He glanced around at the group almost complacently, and waited as Humphrey Fownes squeezed into an empty chair. \"We live in a dome,\" the leader said, \"for lack of something. An invention! What is the one thing that the great technological societies before ours could not invent, notwithstanding their various giant brains, electronic and otherwise?\"\n \n Fownes was the kind of man who never answered a rhetorical question. He waited, uncomfortable in the tight chair, while the others struggled with this problem in revolutionary dialectics.\n \n \" A sound foreign policy ,\" the leader said, aware that no one else had obtained the insight. \"If a sound foreign policy can't be created the only alternative is not to have any foreign policy at all. Thus the movement into domes began— by common consent of the governments . This is known as self-containment.\"\n \n Dialectically out in left field, Humphrey Fownes waited for a lull in the ensuing discussion and then politely inquired how it might be arranged for him to get out.\n \n \"Out?\" the leader said, frowning. \"Out? Out where?\"\n \n \"Outside the dome.\"\n \n \"Oh. All in good time, my friend. One day we shall all pick up and leave.\"\n \n \"And that day I'll await impatiently,\" Fownes replied with marvelous tact, \"because it will be lonely out there for the two of us. My future wife and I have to leave now .\"\n \n \"Nonsense. Ridiculous! You have to be prepared for the Open Country. You can't just up and leave, it would be suicide, Fownes. And dialectically very poor.\"\n \n \"Then you have discussed preparations, the practical necessities of life in the Open Country. Food, clothing, a weapon perhaps? What else? Have I left anything out?\"\n \n The leader sighed. \"The gentleman wants to know if he's left anything out,\" he said to the group.\n \n Fownes looked around at them, at some dozen pained expressions.\n \n \"Tell the man what he's forgotten,\" the leader said, walking to the far window and turning his back quite pointedly on them.\n \n Everyone spoke at the same moment. \" A sound foreign policy ,\" they all said, it being almost too obvious for words.\n \n \n\n \n On his way out the librarian shouted at him: \" A Tale of a Tub , thirty-five years overdue!\" She was calculating the fine as he closed the door.\n \n Humphrey Fownes' preoccupation finally came to an end when he was one block away from his house. It was then that he realized something unusual must have occurred. An orange patrol car of the security police was parked at his front door. And something else was happening too.\n \n His house was dancing.\n \n It was disconcerting, and at the same time enchanting, to watch one's residence frisking about on its foundation. It was such a strange sight that for the moment he didn't give a thought to what might be causing it. But when he stepped gingerly onto the porch, which was doing its own independent gavotte, he reached for the doorknob with an immense curiosity.\n \n The door flung itself open and knocked him back off the porch.\n \n From a prone position on his miniscule front lawn, Fownes watched as his favorite easy chair sailed out of the living room on a blast of cold air and went pinwheeling down the avenue in the bright sunshine. A wild wind and a thick fog poured out of the house. It brought chairs, suits, small tables, lamps trailing their cords, ashtrays, sofa cushions. The house was emptying itself fiercely, as if disgorging an old, spoiled meal. From deep inside he could hear the rumble of his ancient upright piano as it rolled ponderously from room to room.\n \n He stood up; a wet wind swept over him, whipping at his face, toying with his hair. It was a whistling in his ears, and a tingle on his cheeks. He got hit by a shoe.\n \n As he forced his way back to the doorway needles of rain played over his face and he heard a voice cry out from somewhere in the living room.\n \n \"Help!\" Lieutenant MacBride called.\n \n Standing in the doorway with his wet hair plastered down on his dripping scalp, the wind roaring about him, the piano rumbling in the distance like thunder, Humphrey Fownes suddenly saw it all very clearly.\n \n \" Winds ,\" he said in a whisper.\n \n \"What's happening?\" MacBride yelled, crouching behind the sofa.\n \n \" March winds,\" he said.\n \n \"What?!\"\n \n \"April showers!\"\n \n The winds roared for a moment and then MacBride's lost voice emerged from the blackness of the living room. \"These are not Optimum Dome Conditions!\" the voice wailed. \"The temperature is not 59 degrees. The humidity is not 47%!\"\n \n \n\n \n Fownes held his face up to let the rain fall on it. \"Moonlight!\" he shouted. \"Roses! My soul for a cocktail for two!\" He grasped the doorway to keep from being blown out of the house.\n \n \"Are you going to make it stop or aren't you!\" MacBride yelled.\n \n \"You'll have to tell me what you did first!\"\n \n \"I told him not to touch that wheel! Lanfierre. He's in the upstairs bedroom!\"\n \n When he heard this Fownes plunged into the house and fought his way up the stairs. He found Lanfierre standing outside the bedroom with a wheel in his hand.\n \n \n\n \n \"What have I done?\" Lanfierre asked in the monotone of shock.\n \n Fownes took the wheel. It was off a 1995 Studebaker.\n \n \"I'm not sure what's going to come of this,\" he said to Lanfierre with an astonishing amount of objectivity, \"but the entire dome air supply is now coming through my bedroom.\"\n \n The wind screamed.\n \n \"Is there something I can turn?\" Lanfierre asked.\n \n \"Not any more there isn't.\"\n \n They started down the stairs carefully, but the wind caught them and they quickly reached the bottom in a wet heap.\n \n Recruiting Lieutenant MacBride from behind his sofa, the men carefully edged out of the house and forced the front door shut.\n \n The wind died. The fog dispersed. They stood dripping in the Optimum Dome Conditions of the bright avenue.\n \n \"I never figured on this ,\" Lanfierre said, shaking his head.\n \n With the front door closed the wind quickly built up inside the house. They could see the furnishing whirl past the windows. The house did a wild, elated jig.\n \n \"What kind of a place is this?\" MacBride said, his courage beginning to return. He took out his notebook but it was a soggy mess. He tossed it away.\n \n \"Sure, he was different ,\" Lanfierre murmured. \"I knew that much.\"\n \n When the roof blew off they weren't really surprised. With a certain amount of equanimity they watched it lift off almost gracefully, standing on end for a moment before toppling to the ground. It was strangely slow motion, as was the black twirling cloud that now rose out of the master bedroom, spewing shorts and socks and cases every which way.\n \n \" Now what?\" MacBride said, thoroughly exasperated, as this strange black cloud began to accelerate, whirling about like some malevolent top....\n \n \n\n \n Humphrey Fownes took out the dust jacket he'd found in the library. He held it up and carefully compared the spinning cloud in his bedroom with the illustration. The cloud rose and spun, assuming the identical shape of the illustration.\n \n \"It's a twister,\" he said softly. \"A Kansas twister!\"\n \n \"What,\" MacBride asked, his bravado slipping away again, \"what ... is a twister?\"\n \n The twister roared and moved out of the bedroom, out over the rear of the house toward the side of the dome. \"It says here,\" Fownes shouted over the roaring, \"that Dorothy traveled from Kansas to Oz in a twister and that ... and that Oz is a wonderful and mysterious land beyond the confines of everyday living .\"\n \n MacBride's eyes and mouth were great zeros.\n \n \"Is there something I can turn?\" Lanfierre asked.\n \n Huge chunks of glass began to fall around them.\n \n \"Fownes!\" MacBride shouted. \"This is a direct order! Make it go back!\"\n \n But Fownes had already begun to run on toward the next house, dodging mountainous puffs of glass as he went. \"Mrs. Deshazaway!\" he shouted.\n\"Yoo-hoo, Mrs. Deshazaway!\"\n \n The dome weevils were going berserk trying to keep up with the precipitation. They whirred back and forth at frightful speed, then, emptied of molten glass, rushed to the Trough which they quickly emptied and then rushed about empty-handed. \"Yoo-hoo!\" he yelled, running. The artificial sun vanished behind the mushrooming twister. Optimum temperature collapsed. \"Mrs. Deshazaway! Agnes , will you marry me? Yoo-hoo!\"\n \n Lanfierre and Lieutenant MacBride leaned against their car and waited, dazed.\n \n There was quite a large fall of glass.",
      "metadata": {
        "title": "A Fall of Glass",
        "author": "Stanley R. Lee",
        "passage_id": "51609",
        "uid": "0b57d70b507c4a158b1bdffea0bedc18",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "107",
                "uid": "af2277cc377c4fe0a323b1470d434367",
                "response_text": "Mr. Humphrey Fownes has been pickpocketed eleven times despite the weather being good. This is because he is an uncommonly preoccupied individual and has constantly been thinking about the weather for the entire day. The first person who pickpockets him is a bogus postman who jostles him while pretending to read a postal card. The next person who pickpockets him is a pretty girl who collides with him. The next people are two men who pretend to be in a heated argument. Humphrey continuously thinks about the weather outside; this allows the police to maintain tight surveillance of him. Lanfierre is one of the people in the orange car and thinks about Humphrey Fownes being unique. He tells Lieutenant MacBride that Fownes’ house sometimes shakes, which makes the other man frown. Lanfierre considers MacBride to be a barbarian because he is cynical and cannot appreciate the peculiar nature of Fownes. He goes on to tell him that the windows all close at the same time in the house. MacBride refuses to believe him and tells him to take a rest, but all of the windows close, and the house suddenly begins to shake. They continue to observe the man; Fownes goes into his house and begins to think about his dinner with Mrs. Deshazaway. The house begins to shake more, and he decides that repairs are a must. During his dinner, Mrs. Deshazaway explains how she will never marry again. The widow is a passionate woman, and she passionately tells him he forgot salt on his potatoes during the explanation of why they cannot marry because of the air. When she continues to refuse him, Fownes brings up the idea of leaving the dome city for freedom. She tells him that if they can leave, then she will let him call her by her first name. After the date, he goes to the library, where the old librarian tries to test him with old library cards. The story then cuts to a movement meeting, where the members discuss how the old society failed and the lack of a sound foreign policy. Fownes impatiently explains that he and his future wife must leave now, to which the leader explains that it is impossible because there is no sound foreign policy. When Fownes returns to the house, he finds MacBride in the doorway with dripping hair. MacBride yells that these are not optimum dome conditions, explaining that Lanfierre is in the upstairs bedroom. The entire dome air supply is going through his bedroom, and a strange black cloud appears. Fownes recognizes this as a Kansas twister and runs towards the next house for Mrs. Deshazaway. The dome glass has begun to fall, destroying the artificial sun and optimum temperature. "
              },
              {
                "worker_id": "113",
                "uid": "58a9b41ec2f6485cb991b213fe2e5bc8",
                "response_text": "The story is set in a nameless domed city in the future: it has perfect temperature conditions, its citizens never leave the city's borders and must be conformists, i.e lack any signs of aberration. Mr. Humphrey Fownes is a rather eccentric citizen that caught the attention of the police lieutenants whose job is to maintain normality within the dome’s society. Lanfierre, Dome’s police lieutenant, has been following Fownes for months and is truly impressed by his queerness and eccentricity. \nAt the beginning, together with lieutenant MacBride he collects personal information about Fownes, his parameters, the content of his pockets, etc. While sitting in a car parked near Fownes’ house, Lanfierre tells MacBride about the other strange things that he has witnessed while studying Fownes’ life, for example, that his house is shaking occasionally or that his windows always close at the same moment. MacBride is skeptical but unexpectedly all the windows actually slam shut in one second and the walls start wobbling. At the same time, Fownes is inside the house: after closing the windows he goes down to his closet mechanism that creates an illusion of a sunset with flowers, then adding the rain and wind - the things he believed ancients had. Using that mechanism, he wants to seduce Mrs. Deshazaway, a widow whose four ex-husbands died. During their supper, she states that she won’t marry Mr.Fownes but hints at changing her mind if he gets them both outside the dome. Later, he goes to a library meeting of people that criticize the existence of the dome but they cannot provide Fownes with any useful information regarding leaving the city and going outside. \n\nWhile Fownes is away, the police lieutenants decide to enter his house, and  Lanfierre out of curiosity turns the wheel that switches the closet mechanism and opens the valve of the bootleg pipe connected to the dome air system. Walking back, Fownes sees his house shaking. Desperate, MacBride and Lanfierre ask him if they can stop the wind but Humphrey realizes that there is nothing they can do to stop the entire dome air supply from coming through his room. The wind blows off the roof and creates a twister. MacBride orders Humphrey to stop everything immediately, but Fownes leaves the shocked police and runs happily to Mrs. Deshazaway, screaming and asking for her hand, hoping the twister will get them to the outside world, just like it did in The Wonderful Wizard of Oz.\n"
              },
              {
                "worker_id": "111",
                "uid": "9a6f730f11514f06936266ea3bbf91d1",
                "response_text": "The story follows an eccentric man named Humphrey Fownes that lives inside of a domed city. As Fownes is walking around the neighborhood, it is revealed that he is being tracked by the police for his eccentric nature. The police sent undercover people to pickpocket him and steal anything they could find in his pockets. After this walk and while the police wait outside his car, it is revealed that Fownes built a machine that creates different environments inside his house. Fownes then meets with his neighbor and it is said that he is in love with her, and the environments created in his house are meant to replicate romantic scenarios and get her to marry him. After she says that she will only marry Fownes if they leave the dome together, he goes to the library to find ways to escape the dome. There, he meets with members of the Movement, a group of people that got together in order to protest the reality in which they lived. Here he finds an old book jacket of The Wizard of Oz, which had a twister on the front. After going home, he finds that his house is shaking and his machine is creating a storm of water and wind. He realizes that in his absence the police had entered and broken his machines. After rescuing the two policemen, the storm gets worse and worse and eventually turns into a twister. Fownes realizes that the twister is destroying the dome and eagerly calls to his neighbor to join him in following the twister outside the dome. "
              },
              {
                "worker_id": "112",
                "uid": "e908ea1084bf4892a5bddc53a5455f4b",
                "response_text": "Humphrey Fownes has been pick-pocketed by the police disguised as the ordinary. He does not notice all the intended bumping because he is weirdly preoccupied with the question of the always optimum weather in the dome. The police target him because his house often shakes heavily, and he is considered a weird person. \n\nHis house shakes because he connects pipes between the dome blower system and his cellar, letting the winds build up in his house, which causes the dancing of the house. He never notices the phenomenon of his home because it always happens when he is in the place and preoccupied with his plan of getting Mrs. Deshazaway, a widow, to marry him. He builds all this mechanism to create an illusion of imaginary ancient romance, hoping to get a slight chance to let Mrs. Deshazaway nod her head. But he constantly fails because she is so scared that the fifth man will die in the marriage with her. Nonetheless, when Humphrey tells her his plan of leaving the dome, she promises him that she will marry him if they can go and live somewhere else with fresher air.\n\nHumphrey goes to the Movement, an organization that wants to protest the lack of a sound foreign policy in the dome. This organization informs members of the goodness of living in the Open Country. Humphrey tries to know how to leave the dome through the Movement, but the leader disappoints him. When he returns home, he sees his house shaking. The two officials are in his place, and one of them turns on the wheel in the bedroom, which leads to the constant winds blowing from the blower system. The winds build up to a certain point that it becomes a twister, which eventually breaks the dome apart. Humphrey’s dream has come true. He runs away to find Mrs. Deshazaway because he can finally marry her.\n"
              }
            ]
          },
          {
            "question_text": "Who is Mrs. Deshazaway, and what are her characteristics?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "107",
                "uid": "af2277cc377c4fe0a323b1470d434367",
                "response_text": "Mrs. Agnes Deshazaway is a widow who had previously married four men. All of her four husbands died; she claims that she will never marry again. However, she is also considered to be a passionate woman who does everything passionately. Whether it be talking, cooking, dressing, everything about her is passionate. She also has uncontrollable dynamism, and Fownes remarks that he has never known anyone like her. Despite her passion, she is also self-conscious of what other people think of her, telling Fownes that there is a rumor that she is a cannibal. She blames her husbands’ deaths on the air and gets angry when Fownes says that he does not mind. Despite how reluctant she is to marry Fownes, Mrs. Deshazaway also has a hopeful side to her. She is quite attentive when Fownes tells her the possibility of leaving the dome, telling him that she will allow him to marry her if the both of them can leave. "
              },
              {
                "worker_id": "113",
                "uid": "58a9b41ec2f6485cb991b213fe2e5bc8",
                "response_text": "Mrs. Deshazaway is a citizen of the domed city and a widow whose four ex-husbands died while being married to her. She’s the love interest of Mr. Humphrey Fownes - he tries to seduce her by making a mechanism that recreates the outside world and later by promising her to get them both outside the dome. She’s a passionate woman who doesn’t like when people gossip about her, fearing that if Humphrey marries her and dies the neighbors will resent her even more. She’s dreaming of going to the open world and breathing fresh air that will allow her new husband to live long"
              },
              {
                "worker_id": "111",
                "uid": "9a6f730f11514f06936266ea3bbf91d1",
                "response_text": "Mrs. Deshazaway is Fownes' neighbor and love interest. They have supper every night together at her house. She is a widow of 4 husbands, who she believes all died due to the bad quality of air inside the dome. Because of this, she rejects Fownes’ various proposals, and ultimately says that they will only get married if Fownes finds a way to get them out of the dome. She is described as a very passionate and practical woman. She is a very smart woman and she knows of the love that Fownes has for her. "
              },
              {
                "worker_id": "112",
                "uid": "e908ea1084bf4892a5bddc53a5455f4b",
                "response_text": "Mrs. Deshazaway is a widow who lost her four husbands: Andrew, Curt, Norman, and Alphonse. She is a passionate woman who talks, cooks, and does everything passionately. She is always energetic. She keeps refusing Humphrey Fownes's proposal, a man who falls in love with her ardently. All of her husbands died, and their deaths are blamed on her by the rumors. She believes the cause of their deaths is the bad air in the dome. But she told Humphrey that she refused him because of the ancient custom, which is a lie. The reason is the rumor, not the ancient traditions. She finds out about Humphrey's secret closet of the Master Mechanism, and she is afraid that the official will come to inspect her because of it. When Humphrey told her his plan of leaving the dome with her, she promised him that if he could make it comes true, she would marry him and let him call her \"Agnes.\""
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "107",
                "uid": "af2277cc377c4fe0a323b1470d434367",
                "response_text": "The story is set inside a dome city with an artificial sun and optimal weather conditions. Fownes first strolls down a quiet residential avenue lined with private houses. Although the weather is generally cloudless, there are light showers that make small geysers of shiny mist. His house is also noted to be located right next to Mrs. Deshazaway’s house. Inside of an orange car, Lanfierre and MacBride watch him. Fownes’ house has a porch and a bootleg pipe connected into the dome blower system. His downstairs closet contains the Master Mechanism. The illusion he sees is of a red sun setting brightly, marred by an occasional arcover that leaves the scent of ozone. There is a garden outside as well, and a gigantic moon hidden in a large area of the sky. Neon large roses are found in the garden, and their colors change from red to violet. Inside of his bedroom closet upstairs, there is a rainmaker. The outside world that Fownes describes to Mrs. Deshazaway, outside of the dome, is one with miles and miles of space. The real-estate monopoly has no control, and the windows blow across prairies. When Fownes goes to the library, the place is described as a shattered and depressing place. It is used very infrequently, filled with given over government publications and censored old books with holes in them. The librarian's desk has ancient library cards that are almost impossible to read. "
              },
              {
                "worker_id": "113",
                "uid": "58a9b41ec2f6485cb991b213fe2e5bc8",
                "response_text": "The story takes place in the future where people live in a domed city. It has perfect climate conditions and its citizens are required to have regulated, non-aberrative lives - this order is maintained by the police. The story starts from a short walk that Mr. Humphrey, an eccentric citizen, takes while coming back to his house. There he again looks at his mechanism, parts of which are connected to the water and air systems of the dome, that creates an illusion of a sunset, strong wind, or rain. He leaves for dinner with Mrs. Deshazaway, a widow with a bad reputation - Humphrey created the mechanism to seduce and marry her. Later, he goes to a meeting of some nonconformists in a library where they talk about the prehistory of the domed society. Walking back, he notices that his building is shaking and soon learns that while he was away the police decided to search his house and one of them switched on the mechanism letting all the dome air supply go through his bedroom. Realizing that nothing can be done and seeing his roof fly off, Humphrey runs to Mrs. Deshazaway, hoping that the appearing twister will take them outside the dome, to some unique new world, like it did in The Wonderful Wizard of Oz. \n\n"
              },
              {
                "worker_id": "111",
                "uid": "9a6f730f11514f06936266ea3bbf91d1",
                "response_text": "The story is set in a dystopian city, where everything seems to be controlled perfectly, including the weather. The city is also inside of a large, glass dome that has robots that constantly fix it as pieces of class constantly fall onto the city below. Fownes’ home is located on a very quiet and residential street, but his house was everything but that. His home is described as an old and large house, with a machine that can change the environment of the house and constantly makes it shake. Part of the story also takes place in a library, which is old and unkempt. "
              },
              {
                "worker_id": "112",
                "uid": "e908ea1084bf4892a5bddc53a5455f4b",
                "response_text": "People live in the dome where the weather is always optimum, with 59 degrees and 47% humidity. Everyone who lives in the dome must be normal and not act weird. Otherwise, the officials will inspect the queerness and conduct some necessary actions to protect the normality in the dome. A sound foreign policy cannot be formed before, resulting in a confined dome society with no foreign policy. The dome citizens cannot go outside of the dome due to the lack of a sound foreign policy."
              }
            ]
          },
          {
            "question_text": "Who is Humphrey Fownes, and what are his characteristics?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "107",
                "uid": "af2277cc377c4fe0a323b1470d434367",
                "response_text": "Humphrey Fownes is an interesting man who always seems to be preoccupied with the weather. Despite it being optimal conditions, he does not seem to notice anything around him even when he is being pickpocketed. He owns an assortment of machinery, capable of creating his ideal illusions and even affecting the weather outside. It is revealed that most of this is part of his plan to leave the dome. Fownes is a very persistent person as well, trying his very hardest to convince Mrs. Deshazaway to marry him even after she rejects his offer. He is stubborn, too, especially when the leader of The Movement explains that they cannot just leave the dome without a sound foreign policy. No matter what, he is determined to leave the dome and marry the widow. However, his plans seem to finally come together when MacBride and Lanfierre mess with the wheel in his house. When the dome begins to break, Fownes sees this as an opportunity and becomes excited at the thought of finally leaving this dome and living in the outside world with his future wife. "
              },
              {
                "worker_id": "113",
                "uid": "58a9b41ec2f6485cb991b213fe2e5bc8",
                "response_text": "Humphrey Fownes is an eccentric citizen of a domed city. He’s in love with a widow, Mrs. Deshazaway, who has a peculiar reputation, and builds a complex mechanism, which can recreate wind, rain, and smells, in his closet to impress and seduce her. Police lieutenants are watching him because his queer, nonconforming behavior goes against the rules of the dome. He is happy to see a twister that is appearing near his house after the wind and rain mechanisms in his closet go out of control, not realizing its danger and meaning. Humphrey is silly, gullible, passionate, he is a dreamer who wants to get outside the dome and marry Mrs. Deshazaway.\n"
              },
              {
                "worker_id": "111",
                "uid": "9a6f730f11514f06936266ea3bbf91d1",
                "response_text": "Humphrey Fownes is the main character of the story. He is described as being very eccentric and preoccupied. He is always in his thoughts, but he is very smart as he was able to make a machine that harnesses water and wind from the city inside his home. He is motivated by his love for his neighbor, and is looking to find ways to get her to marry him. He seems very different from the other people of the city, which is why the police are investigating him. He also is a very determined individual, as even though he has been rejected many times by his neighbor, he continues pursuing her. "
              },
              {
                "worker_id": "112",
                "uid": "e908ea1084bf4892a5bddc53a5455f4b",
                "response_text": "Humphrey Fownes is a weird man targeted by the officials in the dome. He never sees the weather that is different from the dome’s optimum one, but he admires it. He never perceives the roses and twisters, but he wants to see them in real life. He is weirdly attracted to April in ancient customs because it has thirty days. He wants to marry Mrs. Deshazaway, a widow refusing his proposal because of her four dead husbands. Humphrey is so uncommonly preoccupied that he cannot notice the change and nonnormality of his surroundings even when he has been pick-pocketed many times on the street. He is so weirdly passionate about ancient life that he often goes to the library to study them. He thinks the ancient people are strange as he digs into their lives and customs. Humphrey fiercely falls in love with Mrs. Deshazaway. He creates all the possible romantic settings he can imagine from the ancient documents to marry her. He is also a member of Movement, an organization that gathers people who want to leave the dome."
              }
            ]
          },
          {
            "question_text": "What are the features and significance of the Master Mechanism in the downstairs closet that Fownes owns?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "107",
                "uid": "af2277cc377c4fe0a323b1470d434367",
                "response_text": "The Master Mechanism in the downstairs closet is similar to a watch being inside of a great watch case. There is a profusion of wheels surrounding it, and the Mechanism itself is a miniature see-saw that goes back and forth 365-1/4 times an hour. The wheels are salvaged from grandfather’s clocks and music boxes, going around in graceful circles at a rate of 30 to 31 times an hour. However, there is one eccentric cam that goes between 28 and 29. Fownes also sets the time to seven o’clock on April 7th of any year. This Master Mechanism is significant because it is capable of showing the ideal illusion to Fownes. He uses this Mechanism to envision his ideal life outside of the dome, and it gives him the home that he hopes to see instead of the one that he is currently living inside of the dome. These illusions also motivate him to try and find a way to leave the dome with the widow. The Master Mechanism serves as a motivator for Fownes, and it allows him to envision his dreams into a form of reality. "
              },
              {
                "worker_id": "113",
                "uid": "58a9b41ec2f6485cb991b213fe2e5bc8",
                "response_text": "Humphrey Fownes has a complex Master Mechanism in his downstairs closet. It consists of various wheels surrounding a miniature see-saw and allows him to choose a date and a time of the day and experience the weather conditions at this very moment. Together with the bedroom wheels, he can create an illusion of a rainy, windy April evening, he can smell roses and listen to a romantic song about love. He wants to use this mechanism to make Mrs. Deshazaway, a passionate widow living next door, fall in love with him and get married. At the end of the story, when the police officer unknowingly switches the mechanism, making the wind and water work in the full-power mode, which soon makes the wind currents uncontrollable, this mechanism destroys Fownes’ roof and creates a twister that jeopardizes the infrastructure of the entire city and the dome’s integrity. "
              },
              {
                "worker_id": "111",
                "uid": "9a6f730f11514f06936266ea3bbf91d1",
                "response_text": "The Master Mechanism is a machine inside of Fownes’ house. The machine was made by Fownes himself, and is made from wheels, gears and tubes. The machines allow Fownes to harness the water and wind from the city and create different environments inside of the house. Fownes made this machine in order to create romantic scenarios and get Mrs. Deshazaway to marry him. At the end, the two policemen destroy the machine and it ends up destroying Fownes’ home by creating a twister. This twister also ends up destroying the dome and allows Fownes and Mrs. Deshazaway a way out. "
              },
              {
                "worker_id": "112",
                "uid": "e908ea1084bf4892a5bddc53a5455f4b",
                "response_text": "The closet is like a big watch case. Many wheels inside surround a miniature see-saw that goes back and forth 365-4/1 times an hour, the Master Mechanism. The wheels are old, coming from old grandfather’s clocks or music boxes and moving gracefully at the same speed, except for one that moves eccentrically slower than the others. This machine enables Fownes to create an illusion that depicts his imaginary ancient nature. In addition, this closet connects to a pipe in the bedroom, equipped with a wheel that adjusts the flow of winds from the dome blower system. So whenever he turns on the wheel in the bedroom upstairs, the winds will blow through the pipes towards the downstairs closet, building up the air pressure in the room. This connection between the wheel mechanism and the dome blower system is the cause of the house shaking, which eventually creates an artificial twister that breaks the dome, enabling Fownes to go outside of the dome, which has been his wish from the beginning of the story."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5373,
        "document_length_chars": 31448
      }
    }
  ]
}