{
  "item_metadata": {
    "item_id": "51650",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51650",
      "content": "INNOCENT AT LARGE\n \n \n By POUL AND KAREN ANDERSON\n \n Illustrated by WOOD\n \n [Transcriber's Note: This etext was produced from Galaxy Science Fiction July 1958. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n A hayseed Martian among big-planet slickers ... of course he would get into trouble. But that was nothing compared to the trouble he would be in if he did not get into trouble!\n \n\n \n The visiphone chimed when Peri had just gotten into her dinner gown. She peeled it off again and slipped on a casual bathrobe: a wisp of translucence which had set the president of Antarctic Enterprise—or had it been the chairman of the board?—back several thousand dollars. Then she pulled a lock of lion-colored hair down over one eye, checked with a mirror, rumpled it a tiny bit more and wrapped the robe loosely on top and tight around the hips.\n \n After all, some of the men who knew her private number were important.\n \n She undulated to the phone and pressed its Accept. \"Hello-o, there,\" she said automatically. \"So sorry to keep you waiting. I was just taking a bath and—Oh. It's you.\"\n \n Gus Doran's prawnlike eyes popped at her. \"Holy Success,\" he whispered in awe. \"You sure the wires can carry that much voltage?\"\n \n \n\n \n \"Well, hurry up with whatever it is,\" snapped Peri. \"I got a date tonight.\"\n \n \"I'll say you do! With a Martian!\"\n \n \n\n \n Peri narrowed her silver-blue gaze and looked icily at him. \"You must have heard wrong, Gus. He's the heir apparent of Indonesia, Inc., that's who, and if you called up to ask for a piece of him, you can just blank right out again. I saw him first!\"\n \n Doran's thin sharp face grinned. \"You break that date, Peri. Put it off or something. I got this Martian for you, see?\"\n \n \"So? Since when has all Mars had as much spending money as one big-time marijuana rancher? Not to mention the heir ap—\"\n \n \"Sure, sure. But how much are those boys going to spend on any girl, even a high-level type like you? Listen, I need you just for tonight, see? This Martian is strictly from gone. He is here on official business, but he is a yokel and I do mean hayseed. Like he asked me what the Christmas decorations in all the stores were! And here is the solar nexus of it, Peri, kid.\"\n \n Doran leaned forward as if to climb out of the screen. \"He has got a hundred million dollars expense money, and they are not going to audit his accounts at home. One hundred million good green certificates, legal tender anywhere in the United Protectorates. And he has about as much backbone as a piece of steak alga. Kid, if I did not happen to have experience otherwise with a small nephew, I would say this will be like taking candy from a baby.\"\n \n Peri's peaches-and-cream countenance began to resemble peaches and cream left overnight on Pluto. \"Badger?\" she asked.\n \n \"Sure. You and Sam Wendt handle the routine. I will take the go-between angle, so he will think of me as still his friend, because I have other plans for him too. But if we can't shake a million out of him for this one night's work, there is something akilter. And your share of a million is three hundred thirty-three—\"\n \n \"Is five hundred thousand flat,\" said Peri. \"Too bad I just got an awful headache and can't see Mr. Sastro tonight. Where you at, Gus?\"\n \n \n\n \n The gravity was not as hard to take as Peter Matheny had expected. Three generations on Mars might lengthen the legs and expand the chest a trifle, but the genes had come from Earth and the organism readjusts. What set him gasping was the air. It weighed like a ton of wool and had apparently sopped up half the Atlantic Ocean. Ears trained to listen through the Martian atmosphere shuddered from the racket conducted by Earth's. The passport official seemed to bellow at him.\n \n \"Pardon me for asking this. The United Protectorates welcome all visitors to Earth and I assure you, sir, an ordinary five-year visa provokes no questions. But since you came on an official courier boat of your planet, Mr. Matheny, regulations force me to ask your business.\"\n \n \"Well—recruiting.\"\n \n The official patted his comfortable stomach, iridescent in neolon, and chuckled patronizingly. \"I am afraid, sir, you won't find many people who wish to leave. They wouldn't be able to see the Teamsters Hour on Mars, would they?\"\n \n \"Oh, we don't expect immigration,\" said Matheny shyly. He was a fairly young man, but small, with a dark-thatched, snub-nosed, gray-eyed head that seemed too large for his slender body. \"We learned long ago that no one is interested any more in giving up even second-class citizenship on Earth to live in the Republic. But we only wanted to hire——uh, I mean engage—an, an advisor. We're not businessmen. We know our export trade hasn't a chance among all your corporations unless we get some—a five-year contract...?\"\n \n He heard his words trailing off idiotically, and swore at himself.\n \n \"Well, good luck.\" The official's tone was skeptical. He stamped the passport and handed it back. \"There, now, you are free to travel anywhere in the Protectorates. But I would advise you to leave the capital and get into the sticks—um, I mean the provinces. I am sure there must be tolerably competent sales executives in Russia or Congolese Belgium or such regions. Frankly, sir, I do not believe you can attract anyone out of Newer York.\"\n \n \"Thanks,\" said Matheny, \"but, you see, I—we need—that is.... Oh, well. Thanks. Good-by.\"\n \n He backed out of the office.\n \n \n\n \n A dropshaft deposited him on a walkway. The crowd, a rainbow of men in pajamas and robes, women in Neo-Sino dresses and goldleaf hats, swept him against the rail. For a moment, squashed to the wire, he stared a hundred feet down at the river of automobiles. Phobos! he thought wildly. If the barrier gives, I'll be sliced in two by a dorsal fin before I hit the pavement!\n \n \n The August twilight wrapped him in heat and stickiness. He could see neither stars nor even moon through the city's blaze. The forest of multi-colored towers, cataracting half a mile skyward across more acreage than his eyes reached, was impressive and all that, but—he used to stroll out in the rock garden behind his cottage and smoke a pipe in company with Orion. On summer evenings, that is, when the temperature wasn't too far below zero.\n  Why did they tap me for this job? he asked himself in a surge of homesickness. What the hell is the Martian Embassy here for?\n \n \n He, Peter Matheny, was no more than a peaceful professor of sociodynamics at Devil's Kettle University. Of course, he had advised his government before now—in fact, the Red Ankh Society had been his idea—but still he was at ease only with his books and his chess and his mineral collection, a faculty poker party on Tenthday night and an occasional trip to Swindletown—\n  My God , thought Matheny, here I am, one solitary outlander in the greatest commercial empire the human race has ever seen, and I'm supposed to find my planet a con man!\n \n \n He began walking, disconsolately, at random. His lizardskin shirt and black culottes drew glances, but derisive ones: their cut was forty years out of date. He should find himself a hotel, he thought drearily, but he wasn't tired; the spaceport would pneumo his baggage to him whenever he did check in. The few Martians who had been to Earth had gone into ecstasies over the automation which put any service you could name on a twenty-four-hour basis. But it would be a long time before Mars had such machines. If ever.\n \n The city roared at him.\n \n He fumbled after his pipe. Of course , he told himself, that's why the Embassy can't act. I may find it advisable to go outside the law. Please, sir, where can I contact the underworld?\n \n \n He wished gambling were legal on Earth. The Constitution of the Martian Republic forbade sumptuary and moral legislation; quite apart from the rambunctious individualism which that document formulated, the article was a practical necessity. Life was bleak enough on the deserts, without being denied the pleasure of trying to bottom-deal some friend who was happily trying to mark the cards. Matheny would have found a few spins of roulette soothing: it was always an intellectual challenge to work out the system by which the management operated a wheel. But more, he would have been among people he understood.\n \n The frightful thing about the Earthman was the way he seemed to exist only in organized masses. A gypsy snake oil peddler, plodding his syrtosaur wagon across Martian sands, just didn't have a prayer against, say, the Grant, Harding & Adams Public Relations Agency.\n \n \n\n \n Matheny puffed smoke and looked around. His feet ached from the weight on them. Where could a man sit down? It was hard to make out any individual sign through all that flimmering neon. His eye fell on one that was distinguished by relative austerity.\n \n \n THE CHURCH OF CHOICE\n   Enter, Play, Pray\n \n \n That would do. He took an upward slideramp through several hundred feet of altitude, stepped past an aurora curtain, and found himself in a marble lobby next to an inspirational newsstand.\n \n \"Ah, brother, welcome,\" said a red-haired usherette in demure black leotards. \"The peace that passeth all understanding be with you. The restaurant is right up those stairs.\"\n \n \"I—I'm not hungry,\" stammered Matheny. \"I just wanted to sit in—\"\n \n \"To your left, sir.\"\n \n The Martian crossed the lobby. His pipe went out in the breeze from an animated angel. Organ music sighed through an open doorway. The series of rooms beyond was dim, Gothic, interminable.\n \n \"Get your chips right here, sir,\" said the girl in the booth.\n \n \"Hm?\" said Matheny.\n \n She explained. He bought a few hundred-dollar tokens, dropped a fifty-buck coin down a slot marked CONTRIBUTIONS, and sipped the martini he got back while he strolled around studying the games. He stopped, frowned. Bingo? No, he didn't want to bother learning something new. He decided that the roulette wheels were either honest or too deep for him. He'd have to relax with a crap game instead.\n \n He had been standing at the table for some time before the rest of the congregation really noticed him. Then it was with awe. The first few passes he had made were unsuccessful. Earth gravity threw him off. But when he got the rhythm of it, he tossed a row of sevens. It was a customary form of challenge on Mars. Here, though, they simply pushed chips toward him. He missed a throw, as anyone would at home: simple courtesy. The next time around, he threw for a seven just to get the feel. He got a seven. The dice had not been substituted on him.\n \n \"I say!\" he exclaimed. He looked up into eyes and eyes, all around the green table. \"I'm sorry. I guess I don't know your rules.\"\n \n \"You did all right, brother,\" said a middle-aged lady with an obviously surgical bodice.\n \n \"But—I mean—when do we start actually playing ? What happened to the cocked dice?\"\n \n \n\n \n The lady drew herself up and jutted an indignant brow at him. \"Sir! This is a church!\"\n \n \"Oh—I see—excuse me, I, I, I—\" Matheny backed out of the crowd, shuddering. He looked around for some place to hide his burning ears.\n \n \"You forgot your chips, pal,\" said a voice.\n \n \"Oh. Thanks. Thanks ever so much. I, I, that is—\" Matheny cursed his knotting tongue. Damn it, just because they're so much more sophisticated than I, do I have to talk like a leaky boiler?\n \n \n The helpful Earthman was not tall. He was dark and chisel-faced and sleekly pomaded, dapper in blue pajamas with a red zigzag, a sleighbell cloak and curly-toed slippers.\n \n \"You're from Mars, aren't you?\" he asked in the friendliest tone Matheny had yet heard.\n \n \"Yes. Yes, I am. M-my name's Peter Matheny. I, I—\" He stuck out his hand to shake and chips rolled over the floor. \"Damn! Oh, excuse me, I forgot this was a church. Never mind the chips. No, please. I just want to g-g-get the hell out of here.\"\n \n \"Good idea. How about a drink? I know a bar downshaft.\"\n \n Matheny sighed. \"A drink is what I need the very most.\"\n \n \"My name's Doran. Gus Doran. Call me Gus.\"\n \n They walked back to the deaconette's booth and Matheny cashed what remained of his winnings.\n \n \"I don't want to—I mean if you're busy tonight, Mr. Doran—\"\n \n \"Nah. I am not doing one thing in particular. Besides, I have never met a Martian. I am very interested.\"\n \n \"There aren't many of us on Earth,\" agreed Matheny. \"Just a small embassy staff and an occasional like me.\"\n \n \"I should think you would do a lot of traveling here. The old mother planet and so on.\"\n \n \"We can't afford it,\" said Matheny. \"What with gravitation and distance, such voyages are much too expensive for us to make them for pleasure. Not to mention our dollar shortage.\" As they entered the shaft, he added wistfully: \"You Earth people have that kind of money, at least in your more prosperous brackets. Why don't you send a few tourists to us?\"\n \n \"I always wanted to,\" said Doran. \"I would like to see the what they call City of Time, and so on. As a matter of fact, I have given my girl one of those Old Martian rings last Ike's Birthday and she was just gazoo about it. A jewel dug out of the City of Time, like, made a million years ago by a, uh, extinct race ... I tell you, she appreciated me for it!\" He winked and nudged.\n \n \"Oh,\" said Matheny.\n \n \n\n \n He felt a certain guilt. Doran was too pleasant a little man to deserve—\n \n \"Of course,\" Matheny said ritually, \"I agree with all the archeologists it's a crime to sell such scientifically priceless artifacts, but what can we do? We must live, and the tourist trade is almost nonexistent.\"\n \n \"Trouble with it is, I hear Mars is not so comfortable,\" said Doran. \"I mean, do not get me wrong, I don't want to insult you or anything, but people come back saying you have given the planet just barely enough air to keep a man alive. And there are no cities, just little towns and villages and ranches out in the bush. I mean you are being pioneers and making a new nation and all that, but people paying half a megabuck for their ticket expect some comfort and, uh, you know.\"\n \n \"I do know,\" said Matheny. \"But we're poor—a handful of people trying to make a world of dust and sand and scrub thorn into fields and woods and seas. We can't do it without substantial help from Earth, equipment and supplies—which can only be paid for in Earth dollars—and we can't export enough to Earth to earn those dollars.\"\n \n By that time, they were entering the Paul Bunyan Knotty Pine Bar & Grill, on the 73rd Level. Matheny's jaw clanked down.\n \n \"Whassa matter?\" asked Doran. \"Ain't you ever seen a ecdysiastic technician before?\"\n \n \"Uh, yes, but—well, not in a 3-D image under ten magnifications.\"\n \n Matheny followed Doran past a sign announcing that this show was for purely artistic purposes, into a booth. There a soundproof curtain reduced the noise level enough so they could talk in normal voices.\n \n \"What'll you have?\" asked Doran. \"It's on me.\"\n \n \"Oh, I couldn't let you. I mean—\"\n \n \"Nonsense. Welcome to Earth! Care for a thyle and vermouth?\"\n \n Matheny shuddered. \"Good Lord, no!\"\n \n \"Huh? But they make thyle right on Mars, don't they?\"\n \n \"Yes. And it all goes to Earth and sells at 2000 dollars a fifth. But you don't think we'd drink it, do you? I mean—well, I imagine it doesn't absolutely ruin vermouth. But we don't see those Earthside commercials about how sophisticated people like it so much.\"\n \n \n\n \n \"Well, I'll be a socialist creeper!\" Doran's face split in a grin. \"You know, all my life I've hated the stuff and never dared admit it!\" He raised a hand. \"Don't worry, I won't blabbo. But I am wondering, if you control the thyle industry and sell all those relics at fancy prices, why do you call yourselves poor?\"\n \n \"Because we are,\" said Matheny. \"By the time the shipping costs have been paid on a bottle, and the Earth wholesaler and jobber and sales engineer and so on, down to the retailer, have taken their percentage, and the advertising agency has been paid, and about fifty separate Earth taxes—there's very little profit going back to the distillery on Mars. The same principle is what's strangling us on everything. Old Martian artifacts aren't really rare, for instance, but freight charges and the middlemen here put them out of the mass market.\"\n \n \"Have you not got some other business?\"\n \n \"Well, we do sell a lot of color slides, postcards, baggage labels and so on to people who like to act cosmopolitan, and I understand our travel posters are quite popular as wall decoration. But all that has to be printed on Earth, and the printer and distributor keep most of the money. We've sold some books and show tapes, of course, but only one has been really successful— I Was a Slave Girl on Mars .\n \n \"Our most prominent novelist was co-opted to ghostwrite that one. Again, though, local income taxes took most of the money; authors never have been protected the way a businessman is. We do make a high percentage of profit on those little certificates you see around—you know, the title deeds to one square inch of Mars—but expressed absolutely, in dollars, it doesn't amount to much when we start shopping for bulldozers and thermonuclear power plants.\"\n \n \"How about postage stamps?\" inquired Doran. \"Philately is a big business, I have heard.\"\n \n \"It was our mainstay,\" admitted Matheny, \"but it's been overworked. Martian stamps are a drug on the market. What we'd like to operate is a sweepstakes, but the anti-gambling laws on Earth forbid that.\"\n \n \n\n \n Doran whistled. \"I got to give your people credit for enterprise, anyway!\" He fingered his mustache. \"Uh, pardon me, but have you tried to, well, attract capital from Earth?\"\n \n \"Of course,\" said Matheny bitterly. \"We offer the most liberal concessions in the Solar System. Any little mining company or transport firm or—or anybody—who wanted to come and actually invest a few dollars in Mars—why, we'd probably give him the President's daughter as security. No, the Minister of Ecology has a better-looking one. But who's interested? We haven't a thing that Earth hasn't got more of. We're only the descendants of a few scientists, a few political malcontents, oddballs who happen to prefer elbow room and a bill of liberties to the incorporated state—what could General Nucleonics hope to get from Mars?\"\n \n \"I see. Well, what are you having to drink?\"\n \n \"Beer,\" said Matheny without hesitation.\n \n \"Huh? Look, pal, this is on me.\"\n \n \"The only beer on Mars comes forty million miles, with interplanetary freight charges tacked on,\" said Matheny. \"Heineken's!\"\n \n Doran shrugged, dialed the dispenser and fed it coins.\n \n \"This is a real interesting talk, Pete,\" he said. \"You are being very frank with me. I like a man that is frank.\"\n \n Matheny shrugged. \"I haven't told you anything that isn't known to every economist.\"\n  Of course I haven't. I've not so much as mentioned the Red Ankh, for instance. But, in principle, I have told him the truth, told him of our need; for even the secret operations do not yield us enough.\n \n \n The beer arrived. Matheny engulfed himself in it. Doran sipped at a whiskey sour and unobtrusively set another full bottle in front of the Martian.\n \n \"Ahhh!\" said Matheny. \"Bless you, my friend.\"\n \n \"A pleasure.\"\n \n \"But now you must let me buy you one.\"\n \n \"That is not necessary. After all,\" said Doran with great tact, \"with the situation as you have been describing—\"\n \n \"Oh, we're not that poor! My expense allowance assumes I will entertain quite a bit.\"\n \n Doran's brows lifted a few minutes of arc. \"You're here on business, then?\"\n \n \"Yes. I told you we haven't any tourists. I was sent to hire a business manager for the Martian export trade.\"\n \n \"What's wrong with your own people? I mean, Pete, it is not your fault there are so many rackets—uh, taxes—and middlemen and agencies and et cetera. That is just the way Earth is set up these days.\"\n \n \n\n \n Matheny's finger stabbed in the general direction of Doran's pajama top. \"Exactly. And who set it up that way? Earthmen. We Martians are babes in the desert. What chance do we have to earn dollars on the scale we need them, in competition with corporations which could buy and sell our whole planet before breakfast? Why, we couldn't afford three seconds of commercial time on a Lullaby Pillow 'cast. What we need, what we have to hire, is an executive who knows Earth, who's an Earthman himself. Let him tell us what will appeal to your people, and how to dodge the tax bite and—and—well, you see how it goes, that sort of, uh, thing.\"\n \n Matheny felt his eloquence running down and grabbed for the second bottle of beer.\n \n \"But where do I start?\" he asked plaintively, for his loneliness smote him anew. \"I'm just a college professor at home. How would I even get to see—\"\n \n \"It might be arranged,\" said Doran in a thoughtful tone. \"It just might. How much could you pay this fellow?\"\n \n \"A hundred megabucks a year, if he'll sign a five-year contract. That's Earth years, mind you.\"\n \n \"I'm sorry to tell you this, Pete,\" said Doran, \"but while that is not bad money, it is not what a high-powered sales scientist gets in Newer York. Plus his retirement benefits, which he would lose if he quit where he is now at. And I am sure he would not want to settle on Mars permanently.\"\n \n \"I could offer a certain amount of, uh, lagniappe,\" said Matheny. \"That is, well, I can draw up to a hundred megabucks myself for, uh, expenses and, well ... let me buy you a drink!\"\n \n Doran's black eyes frogged at him. \"You might at that,\" said the Earthman very softly. \"Yes, you might at that.\"\n \n Matheny found himself warming. Gus Doran was an authentic bobber. A hell of a swell chap. He explained modestly that he was a free-lance business consultant and it was barely possible that he could arrange some contacts....\n \n \"No, no, no commission, all done in the interest of interplanetary friendship ... well, anyhow, let's not talk business now. If you have got to stick to beer, Pete, make it a chaser to akvavit. What is akvavit? Well, I will just take and show you.\"\n \n A hell of a good bloke. He knew some very funny stories, too, and he laughed at Matheny's, though they were probably too rustic for a big-city taste like his.\n \n \"What I really want,\" said Matheny, \"what I really want—I mean what Mars really needs, get me?—is a confidence man.\"\n \n \"A what?\"\n \n \"The best and slickest one on Earth, to operate a world-size con game for us and make us some real money.\"\n \n \"Con man? Oh. A slipstring.\"\n \n \"A con by any other name,\" said Matheny, pouring down an akvavit.\n \n \n\n \n Doran squinted through cigarette smoke. \"You are interesting me strangely, my friend. Say on.\"\n \n \"No.\" Matheny realized his head was a bit smoky. The walls of the booth seemed odd, somehow. They were just leatheroid walls, but they had an odd quality.\n \n \"No, sorry, Gus,\" he said. \"I spoke too much.\"\n \n \"Okay. Forget it. I do not like a man that pries. But look, let's bomb out of here, how about it? Go have a little fun.\"\n \n \"By all means.\" Matheny disposed of his last beer. \"I could use some gaiety.\"\n \n \"You have come to the right town then. But let us get you a hotel room first and some more up-to-date clothes.\"\n \n \" Allez ,\" said Matheny. \"If I don't mean allons , or maybe alors .\"\n \n The drop down to cab-ramp level and the short ride afterward sobered him; the room rate at the Jupiter-Astoria sobered him still more.\n  Oh, well , he thought, if I succeed in this job, no one at home will quibble.\n \n \n And the chamber to which he and Doran were shown was spectacular enough, with a pneumo direct to the bar and a full-wall transparency to show the vertical incandescence of the towers.\n \n \"Whoof!\" Matheny sat down. The chair slithered sensuously about his contours. He jumped. \"What the dusty hell—Oh.\" He tried to grin, but his face burned. \"I see.\"\n \n \"That is a sexy type of furniture, all right,\" agreed Doran. He lowered himself into another chair, cocked his feet on the 3-D and waved a cigarette. \"Which speaking of, what say we get some girls? It is not too late to catch them at home. A date here will usually start around\n2100 hours earliest.\"\n \n \"What?\"\n \n \"You know. Dames. Like a certain blonde warhead with twin radar and swivel mounting, and she just loves exotics. Such as you.\"\n \n \"Me?\" Matheny heard his voice climb to a schoolboy squeak. \"Me? Exotic? Why, I'm just a little college professor. I g-g-g, that is—\" His tongue got stuck on his palate. He pulled it loose and moistened uncertain lips.\n \n \"You are from Mars. Okay? So you fought bushcats barehanded in an abandoned canal.\"\n \n \"What's a bushcat? And we don't have canals. The evaporation rate—\"\n \n \"Look, Pete,\" said Doran patiently. \"She don't have to know that, does she?\"\n \n \"Well—well, no. I guess not No.\"\n \n \"Let's order you some clothes on the pneumo,\" said Doran. \"I recommend you buy from Schwartzherz. Everybody knows he is expensive.\"\n \n \n\n \n While Matheny jittered about, shaving and showering and struggling with his new raiment, Doran kept him supplied with akvavit and beer.\n \n \"You said one thing, Pete,\" Doran remarked. \"About needing a slipstring. A con man, you would call it.\"\n \n \"Forget that. Please. I spoke out of turn.\"\n \n \"Well, you see, maybe a man like that is just what Mars does need. And maybe I have got a few contacts.\"\n \n \"What?\" Matheny gaped out of the bathroom.\n \n Doran cupped his hands around a fresh cigarette, not looking at him.\n\"I am not that man,\" he said frankly. \"But in my line I get a lot of contacts, and not all of them go topside. See what I mean? Like if, say, you wanted somebody terminated and could pay for it, I could not do it. I would not want to know anything about it. But I could tell you a phone number.\"\n \n He shrugged and gave the Martian a sidelong glance. \"Sure, you may not be interested. But if you are, well, Pete, I was not born yesterday. I got tolerance. Like the book says, if you want to get ahead, you have got to think positively.\"\n \n Matheny hesitated. If only he hadn't taken that last shot! It made him want to say yes, immediately, without reservations. And therefore maybe he became overcautious.\n \n They had instructed him on Mars to take chances if he must.\n \n \"I could tell you a thing or two that might give you a better idea,\" he said slowly. \"But it would have to be under security.\"\n \n \"Okay by me. Room service can send us up an oath box right now.\"\n \n \"What? But—but—\" Matheny hung onto himself and tried to believe that he had landed on Earth less than six hours ago.\n \n In the end, he did call room service and the machine was trundled in. Doran swallowed the pill and donned the conditioner helmet without an instant's hesitation.\n \n \"I shall never reveal to any person unauthorized by yourself whatever you may tell me under security, now or at any other time,\" he recited. Then, cheerfully: \"And that formula, Pete, happens to be the honest-to-zebra truth.\"\n \n \"I know.\" Matheny stared, embarrassed, at the carpet. \"I'm sorry to—to—I mean of course I trust you, but—\"\n \n \"Forget it. I take a hundred security oaths a year, in my line of work. Maybe I can help you. I like you, Pete, damn if I don't. And, sure, I might stand to get an agent's cut, if I arrange—Go ahead, boy, go ahead.\" Doran crossed his legs and leaned back.\n \n \"Oh, it's simple enough,\" said Matheny. \"It's only that we already are operating con games.\"\n \n \"On Mars, you mean?\"\n \n \"Yes. There never were any Old Martians. We erected the ruins fifty years ago for the Billingsworth Expedition to find. We've been manufacturing relics ever since.\"\n \n \" Huh? Well, why, but—\"\n \n \"In this case, it helps to be at the far end of an interplanetary haul,\" said Matheny. \"Not many Terrestrial archeologists get to Mars and they depend on our people to—Well, anyhow—\"\n \n \"I will be clopped! Good for you!\"\n \n \n\n \n Doran blew up in laughter. \"That is one thing I would never spill, even without security. I told you about my girl friend, didn't I?\"\n \n \"Yes, and that calls to mind the Little Girl,\" said Matheny apologetically. \"She was another official project.\"\n \n \"Who?\"\n \n \"Remember Junie O'Brien? The little golden-haired girl on Mars, a mathematical prodigy, but dying of an incurable disease? She collected Earth coins.\"\n \n \"Oh, that. Sure, I remember—Hey! You didn't!\"\n \n \"Yes. We made about a billion dollars on that one.\"\n \n \"I will be double damned. You know, Pete, I sent her a hundred-buck piece myself. Say, how is Junie O'Brien?\"\n \n \"Oh, fine. Under a different name, she's now our finance minister.\" Matheny stared out the wall, his hands twisting nervously behind his back. \"There were no lies involved. She really does have a fatal disease. So do you and I. Every day we grow older.\"\n \n \"Uh!\" exclaimed Doran.\n \n \"And then the Red Ankh Society. You must have seen or heard their ads.\n'What mysterious knowledge did the Old Martians possess? What was the secret wisdom of the Ancient Aliens? Now the incredibly powerful semantics of the Red Ankh (not a religious organization) is available to a select few—' That's our largest dollar-earning enterprise.\"\n \n He would have liked to say it was his suggestion originally, but it would have been too presumptuous. He was talking to an Earthman, who had heard everything already.\n \n Doran whistled.\n \n \"That's about all, so far,\" confessed Matheny. \"Perhaps a con is our only hope. I've been wondering, maybe we could organize a Martian bucket shop, handling Martian securities, but—well, I don't know.\"\n \n \"I think—\" Doran removed the helmet and stood up.\n \n \"Yes?\" Matheny faced around, shivering with his own tension.\n \n \"I may be able to find the man you want,\" said Doran. \"I just may. It will take a few days and might get a little expensive.\"\n \n \"You mean.... Mr. Doran—Gus—you could actually—\"\n \n \"I cannot promise anything yet except that I will try. Now you finish dressing. I will be down in the bar. And I will call up this girl I know. We deserve a celebration!\"",
      "metadata": {
        "title": "Innocent at Large",
        "author": "Poul and Karen Anderson",
        "passage_id": "51650",
        "uid": "529e2159da3b47f9a4d61d9d76d68145",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "8",
                "uid": "233c7980b9e241c8a76f35cc2eba25fe",
                "response_text": "Peter Matheny is a Martian sociodynamics professor sent to Earth on behalf of the Martian government under the guise of hiring an Earthman who can help manage and improve their export business. Armed with a hundred million dollars, his real mission is to find and enlist the service of a con man who can help the Martians concoct a securities scheme that will net greater profits than their current exports yield (the government hired him because of his experience formulating the Red Ankh Society scheme, which offered to sell bogus wisdom of the Old Martians). Peter is accustomed to the largely-empty deserts of Mars and enjoys the serenity of smoking a pipe while stargazing behind his small home in addition to other quiet hobbies such as reading, playing chess, and collecting minerals. When he arrives on Earth, he feels out of his element and uncomfortable due to the heavy, humid air and massive towers and neon lights he encounters in the crowded city, so he seeks a place where he can sit. He finds a place called \"The Church of Choice,\" where, to his delight, he discovers a number of gambling games in progress despite the ban on such activities on Earth. Because the Martian Constitution specifically allows for gambling, Peter partakes and shoots a successful game of craps. However, he expresses confusion about Earth rules for craps, since the Martian version employs a number of tricks and cheats. After the game, Peter feels uncomfortable again and tries to leave, but he is stopped by a man named Gus Doran, who takes him out for drinks. During their conversation, Peter tells Gus about the struggles of the Martian economy and explains how high Earth taxes and greedy middlemen have cut into the profits from their exports. Over the course of a few more drinks, Peter tells Gus about several frauds the Martians developed in an effort to bolster their economy and accidentally reveals his true intentions for visiting Earth to Gus. This information intrigues Gus who informs Peter that he has contacts that may be able to help. To ensure Peter's trust, Gus uses an oath box and promises not to tell anyone what he learned from Peter that night. Gus then suggests they celebrate by inviting some women to their hotel, and he leaves to make a phone call. He calls his business partner Peri, who is preparing to go on a date with a wealthy marijuana rancher. Gus convinces her to cancel the date and join him at the hotel so that together they can take advantage of Peter's amenability and hustle him out of a million dollars."
              },
              {
                "worker_id": "1",
                "uid": "14fe04effbd74a1795dfdbf89b2db7ec",
                "response_text": "Peri tries to look sexy as she answers the visiphone and realizes it’s Gus Doran on the other end. Gus is unhappy to hear that Peri has a date scheduled with a wealthy Indonesian man, and he tries to convince her to go out with a Martian instead. The Martian has a hundred million dollars available to freely spend, and Gus wants Peri to get some of that cash. She agrees.\n\nPeter Matheny arrives at the United Protectorates on Earth and shows his paperwork to enter the country. He is there on a recruiting mission, and the official advises him to head to the rural areas because no one in the cities would ever leave Earth. Peter walks through the city and wonders why he has been given this assignment. He’s a professor of sociodynamics, and although he has advised the Martian government before, he’s not sure he’s equipped for the gig. He is supposed to find a con man that will work on Mars.\n\nPeter enters the Church of Choice and begins to gamble even though it’s illegal on Earth. When he tries to pick his chips up, he is reminded that he’s not really gambling. He’s at church! Peter is embarrassed and relieved when Gus comes up to him and asks him to have a drink. Gus asks Peter about his background as an Earthman on Mars, and Peter provides Gus with information about why the Martians are so poor and all of the rackets and taxes that make living there and making a livable wage difficult. He explains that he’s on Earth to find someone that can help the Martian people figure out how to appeal to Earthmen to bring in some capital to the red planet. After a few alcoholic drinks, Peter admits that Mars needs a true con-man that can make them lots of money. Gus offers to give Peter some of his acquaintances’ contact information so that he may make some connections. \n \nGus suggests that the two men go get a hotel room, and they book a room at the Jupiter-Astoria. While there, Peter confesses that he wants to tell Gus more about his mission, but he can’t unless Gus promises to keep everything a secret. They call room service for an oath box, and Gus agrees to keep everything hush-hush. Afterwards, Peter admits that the only way the Martians currently make money is through cons. Instead of selling precious Martian relics, they actually just manufacture them at scale and lie to consumers about their value. He also confesses that Junie O’Brien, a little Martian girl who was dying, was a ploy to get Earthmen to send them money. Finally, he reveals that the Red Ankh Society, a group that claims to have knowledge handed down from the Old Martians, is also a con. Gus says that he may have just the right person for this job, but first they need to call the girls and celebrate. \n"
              },
              {
                "worker_id": "2",
                "uid": "47bb458a99a94b6e950965c4ff4ec1a5",
                "response_text": "Peter Matheny is a college professor on Mars who is sent to Earth on a diplomatic mission to find a con man to run a con game for the planet so that it can make a lot of money, but his cover story is that he is looking for a business manager for Martian trade. Unbeknownst to him, an Earth con man, Gus Doran, has learned of his arrival and his expense budget of one hundred million dollars and plans to get at least one million dollars from him. He contacts his associate, Peri, a sultry blonde who has luxurious gifts from men she dates, and makes plans for her to be Peter’s date that evening. Matheny first enters The Church of Choice where parishoners can “Enter, Play, and Pray.” It offers gambling, a restaurant, and a bar. He plays a crap game and draws attention when he continually rolls a seven; he thinks the game hasn’t started but has been winning over and over. When Matheny leaves the table, Gus Doran introduces himself and reminds Matheny he left his chips on the table, then invites him for a drink. Matheny appreciates Doran’s company, and the two discuss tourism between Earth and Mars. Matheny focuses on the Martian economy and the need to build it up by attracting more Earth dollars. Mars makes very little money on its exports due to taxes, shipping fees, and so forth, and few tourists from Earth go there because they know the air is harder to breathe, and there are no big cities with entertainment venues, just small towns, villages, and ranches amidst scrub and desert. Mars has dabbled in multiple business ventures to make money, but most have yielded little profit. Matheny tells Doran that what Mars really wants is to operate a sweepstakes. Doran keeps Matheny drinking beer and wins his confidence until Matheny tells him his real purpose, to find someone to run a world-size con game. Doran checks Matheny into the Jupiter-Astoria and arranges for Peri to come to the room, and he tells Matheny he has some contacts who can help him find the person he needs. He even orders an oath box from room service, takes the pill, and puts on the conditioner helmet; then he states the oath that he will not tell anyone what Matheny tells him. Matheny tells him that the current Martians are already running a con game; they built their “ancient” ruins for the Billingsworth Expedition to find and manufacture the relics they sell. He also tells Matheny about another con, a little girl on Mars who was a mathematical prodigy but dying of an incurable disease. She collected Earth coins, and sympathetic people sent a billion dollars. The “little girl” is now their finance minister, and her incurable disease was aging. He also admits the Red Ankh Society is a modern creation. Doran says he thinks he can help Matheny find his con man. \n\n"
              },
              {
                "worker_id": "6",
                "uid": "77956a1fd5e342569e5686680bbd35c2",
                "response_text": "Esteemed-escort, Peri, is dressing for a date with Mr. Sastro when she receives a call from Gus Doran. He informs her of a Martian who will pay even more than this heir may and who’s a little unfamiliar with Earth terms. After some bickering, she agrees on 500,000 for payment and calls off the date. Moving backward in time, Peter Matheny arrives on Earth and is questioned by the passport official. He gives him a half-truth and quickly moves on. Matheny was sent to Earth to hire a conman for Mars. Mars has been struggling financially for years now, and their biggest economic ploys are all schemes. \nMatheny stands out on Earth, unaccustomed to the gravity and air here. As well, his clothes are 40-years out of style and mark him as a Martian. Being a professor, Matheny isn’t entirely sure why sent him, but he did devise the Red Ankh Society, one of their schemes. He enters the Church of Choice and decided to play a game of crap. He wants to play for money, but the other churchgoers ward him off. He leaves embarrassed and runs into Gus Doran who brought him his chips. They grab a drink at Paul Bunyan Knotty Pine Bar & Grill, but not before Matheny had already blabbed about half his business. Doran covers the drinks: a beer for Matheny and a whiskey sour for himself. They drink and talk about the Martian economy and how their goods may be pricey, but the real profit is nowhere near as high. Matheny, a little tipsy, tells Doran that they’re looking for an Earth executive, someone who’d make a hundred megabucks a year on a five-year contract. He mentions as well that he has extra money for expenses on Earth, which draws Doran in. Doran reveals he has connections, so Matheny tells him they need a con man. \nThey leave for the Jupiter-Astoria where they encounter sexual chairs. Doran suggests they get a girl, most likely with Peri in mind, and he tells Matheny to get some new clothes. Doran tells Matheny again he has contacts, so Matheny makes him swear under an oath box before he will reveal their true secrets. After, Matheny tells him about their schemes, from the Red Ankh Society to Junie O’Brien. Doran thinks he has the man for Matheny, but first, he suggests going to the bar to celebrate with a girl. \n"
              }
            ]
          },
          {
            "question_text": "What is the setting of the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "8",
                "uid": "233c7980b9e241c8a76f35cc2eba25fe",
                "response_text": "There are several locations where key events in the story take place including Peri's residence, the immigration office, the Earth city, the Church of Choice, Paul Bunyan Knotty Pine Bar & Grill, and the Jupiter-Astoria hotel. In addition, at various points throughout the narrative, Peter recalls life on Mars, which is covered with deserts and scrub thorn and an atmosphere with drier air and lesser gravity compared to Earth's humidity and strong gravitation. Martian society is largely rural with very small towns and villages, and their weeks are different than those on Earth; they have a day called \"Tenthday\" when Peter likes to play poker with his coworkers, and he sometimes visits a place called Swindletown. Peter often notes the differences between Earth's commercialism and reliance upon automation and Mars' more calm, individualistic society. Peter is overwhelmed by the bright, neon lights, massive towers, and sheer amount of vehicles and people in the city where he arrives on Earth and longs for his small cottage and rock garden back on Mars. To navigate the city, Peter takes cabs, and to access the different levels of the towers, he utilizes the ramp system. Looking for a place to sit, Peter finds The Church of Choice, which seems to be an establishment where people can drink and gamble, although gambling is illegal on Earth. The Church of Choice features craps tables, roulette wheels, and even Bingo and has a large, marble lobby at its entrance that leads into a number of dim rooms with Gothic architecture. After meeting Gus there, the two leave and share drinks at Paul Bunyan Knotty Pine Bar & Grill, a place where diners can talk in private sitting at soundproof booths while enjoying a strip show. The carpeted hotel room he shares with Gus at the Jupiter-Astoria has a pneumatic device that can deliver drinks straight from the bar along with anything else someone may require, such as the oath box Gus uses to cement Peter's trust in him. There is also a bathroom and a \"sexy type of furniture\" that operates like a massage chair."
              },
              {
                "worker_id": "1",
                "uid": "14fe04effbd74a1795dfdbf89b2db7ec",
                "response_text": "The story is set on a city on Earth. Peter Matheny, a college professor, arrives from Mars to find a con-man that can help make Mars a more economically viable place to live. The city on Earth is a shock to Peter. It has neon lights, enormous crowds, and people wearing brightly colored pajamas on the streets. The sky is impossible to see because of the pollution, and the hundreds of buildings are incredibly tall. \n\nPeter refers to Earth as the \"greatest commercial empire the human race has ever seen,\" and everywhere he turns he sees businesses that make loads of money and people opening up their wallets for a good time. People appear only in groups, and they are very organized as if their only true purpose is to band together and collect capital. \n\nPeter goes to the Church of Choice hoping to gamble, but he quickly learns that although the place sells chips like a true gambling parlor, it's all for fun. Later, Peter checks into the Jupiter-Astoria hotel and is impressed by the sexy furniture and expensive-looking fixtures. \n\nEarth is essentially the exact opposite of Mars, where people live in small cottages and have a difficult time making money. There are no major businesses other than the cons that the embassy creates like children with fake diseases that need to collect money for their medical services and mass manufactured Martian relics. \n\n\n"
              },
              {
                "worker_id": "2",
                "uid": "47bb458a99a94b6e950965c4ff4ec1a5",
                "response_text": "The story takes place on Earth in the hot, humid month of August. Men wear colorful clothes and are described as looking like“a rainbow” dressed in pajamas and the women as wearing Neo-Sino dresses and goldleaf hats. There is a lot of traffic, and in larger cities, there are multi-colored towers half a mile high that block the stars and moon. Gambling is illegal, but churches make gambling available. There is a lively entertainment industry with nightclubs, bars, strip clubs, etc., in large cities like Newer York. There are provincial, less industrialized regions as well, such as Russia and Congolese Belgium, which some people refer to as the sticks.   \t\nOn Mars, life is more peaceful. Matheny enjoys the quiet rock garden behind his cottage where he can smoke his pipe with Orion for company—when the temperature isn’t too far below zero. People who live there have changed to have longer legs and an expanded chest as a result of the gravity, and the atmosphere makes it harder to hear sounds. Mars has a civilized society with universities, a central government, and specialized organizations such as the Red Ankh Society. Mars lacks much of the technology that exists on Earth, specifically the automation to bring any service you want to you on a twenty-four-hour basis. On Mars, gambling is legal, in part because it relieves the sheer boredom of the deserts. People cheat, and organizations offering gambling have systems that astute players can figure out. Matheny frequently mentions that Mars has a dollar shortage or is poor and suggests that Earth should send tourists to Mars, but Doran points out that the people who do go to Mars come back and complain that there is barely enough air to survive there and that there are no cities, just small towns, villages, and ranches. The landscape is mainly dust, sand, and thorn scrub. Mars needs equipment and supplies from Earth. Whatever Mars exports to Earth requires enormous costs to ship, and after wholesalers and retailers, salespeople, advertisers, and taxes are paid, there is very little profit left. The planet is able to produce paper products, such as postcards, travel posters, and books. It has resorted to con schemes to make more money.\n"
              },
              {
                "worker_id": "6",
                "uid": "77956a1fd5e342569e5686680bbd35c2",
                "response_text": "The story takes place on Earth, far into the future where some humans have already begun to colonize Mars. This new Earth is outfitted with modern technology and some Martian goods, like thyle. Gambling and other immoral acts are illegal, though they are not on Mars. The air is much heavier on Earth than Mars, and people tend to travel in packs. Busy and crowded, the city never sleeps and is filled to the brim with stylish people. \nOne scene takes place in the Church of Choice, which has a restaurant upstairs and play-gambling to the left. All chips purchased are contributions to the church, and the games feature crap, bingo, and other card games. At the bar, Doran and Matheny are seated in a noise-controlled section, where curtains block out most other sounds, ensuring their privacy. The Jupiter Astoria faces beautiful tall towers, and it houses chairs that are designed to wrap around those sitting in them. \n"
              }
            ]
          },
          {
            "question_text": "Who is Gus Doran and what is his role in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "8",
                "uid": "233c7980b9e241c8a76f35cc2eba25fe",
                "response_text": "Gus is a con artist who works with Peri and Sam Wendt to primarily target wealthy, powerful men and extort money from them. He is short, chisel-faced, has slicked-back hair, and wears blue pajamas with a red zigzag, a sleighbell cloak, and slippers. When the story begins, Peri is preparing to go on a date with the heir apparent of Indonesia, Inc. who is also a wealthy marijuana rancher, supposedly to use him for money. Gus convinces her to change her plans to help him swindle Peter since he has discovered Peter has a hundred million dollars at his disposal and appears to be susceptible to Gus's charming and manipulative ways. Gus goads Peter into confessing his secret by providing him with beer and akvavit and gains his trust by wearing the helmet attached to the oath box. At the end of the story, Gus agrees to help Peter find his confidence man by utilizing his network of underworld contacts, but instead calls Peri to begin implementing his con."
              },
              {
                "worker_id": "1",
                "uid": "14fe04effbd74a1795dfdbf89b2db7ec",
                "response_text": "Gus is a con-man who works with a woman named Peri. He uses his natural charisma to speak to men with money and try to get them to call Peri to have a little fun with her. His research and his ability to talk to all kinds of people puts her in touch with wealthy individuals that spend a lot of money on her. She then splits the profits with Gus. Gus introduces himself to Peter because he seems out of place at the Church of Choice. He can tell by his old clothes and height that he is a Martian, and he acts as though he is genuinely interested in learning about Peter's life on Mars and his business mission. The reality is that Gus sees that Peter is an oddball and decides to learn more about him in case he would make a good victim. Through his conversations with Peter, he learns that he is working for the Martian government, and he decides to hook Peter up with Peri so that they can take advantage of Peter's naivety. "
              },
              {
                "worker_id": "2",
                "uid": "47bb458a99a94b6e950965c4ff4ec1a5",
                "response_text": "Gus Doran is a confidence man on Earth. He knows Peri and uses her “services” for individuals with a lot of money whom he thinks he can use for his own personal gains. He interacts directly with the “mark” to gain the man’s confidence, lower his defenses, and trick him into giving part of his money to Doran. At the story’s beginning, Doran arranges for Peri to be available for the Martian diplomat with the hundred million dollar expense account. Doran intends to win the man’s confidence and then bilk him of one million dollars. Gus “meets” Peter Matheny, the diplomat from Mars, at the gaming tables of the church and invites him to have a drink. Gus wins Matheny’s confidence so that Matheny reveals the dollar deficit that Mars is experiencing and the planet’s desire to hire a manager to help it build up its tourist industry. One way Gus builds this confidence is through empathetic responses. Matheny reveals that while Mars produces vermouth that is bought and served on Earth, he can’t stand the stuff. Gus responds that he can’t stand the stuff either but has always been afraid to admit it. Matheny explains that Mars has very little profit after paying the engineers, salespeople, advertisers, and Earth taxes on its exports, and Gus acts as if he is a small-time business consultant and says maybe he can help Matheny, all the while planning to take Matheny’s money. When Matheny suggests there is more he could tell him, Gus offers to use an oath box, swallows the pill, and dons the helmet to confirm that he is honest and trustworthy. When Matheny eventually admits that Mars wants a con man to run a worldwide con, Gus indicates he can help him find someone to do it.\n"
              },
              {
                "worker_id": "6",
                "uid": "77956a1fd5e342569e5686680bbd35c2",
                "response_text": "Gus Doran is an Earthman who just happens to know a lot of Earthmen. He runs into Peter Matheny, a visiting Martian, and soon realizes that he can have a hell of a time with this guy. Doran serves as Matheny’s tour guide and takes him to a bar and a hotel where he can stay. When he realizes that Matheny is looking for an Earthman to serve as an executive for Mars (essentially a conman), he sees potential there. Once he realizes that Matheny has millions of dollars to spend on expenses here, he sees even more potential there. Doran propels Matheny forward and takes this slightly lost Martian on a wild journey. As well, he promises Matheny that he knows someone who could be the perfect person for this position. Doran also knows Peri, an escort, who will presumably make an entrance later on in the story. "
              }
            ]
          },
          {
            "question_text": "What is the significance of the Red Ankh Society?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "8",
                "uid": "233c7980b9e241c8a76f35cc2eba25fe",
                "response_text": "The Red Ankh Society is a con devised by Peter for the Martian government as a way to boost their economy. People paid for the exclusive privilege of access to the secrets and ancient wisdom of the Old Martians; in reality, these were just bogus semantics compiled for the sake of earning large amounts of money. However, the existence of the Red Ankh Society reveals quite a bit about Mars, the role of cons in the story, and even Peter himself. During Peter's discussion with Gus, we learn the Martians are descended from Earthmen who preferred greater freedom than was offered by the United Protectorate and moved to Mars to establish a life there. They work to make the planet habitable and attractive to tourists, but the process is slow because they cannot afford the equipment and power plants required to build on a scale that will attract the necessary amount of visitors needed to turn a profit. This leads the government to resort to drastic measures; they wield their skills at playing tricks and cheating at gambling (they even have a city called Swindletown) to implement a number of schemes meant to draw in vast amounts of cash such as the Red Ankh Society, the construction and sale of phony ancient relics and ruins, and the saga of Junie O'Brien (a little girl whose fake illness raised a billion dollars for the planet). This leads the government to send Peter to Earth in order to purchase the services of a con man who can help implement a new scheme to sell Martian securities. This trip introduces Peter to Gus, who begins work on a plan to swindle Peter out of a million dollars."
              },
              {
                "worker_id": "1",
                "uid": "14fe04effbd74a1795dfdbf89b2db7ec",
                "response_text": "The Red Ankh society is one of may cons that Peter has come up with to help the Martian government make money. The Society claims to have secret knowledge from ancient aliens, and people who purchase a membership into the Society can get their hands on the information that the old Martians had. Peter admits that he himself came up with this con, and although it has made some money for the planet, it just isn't enough. The Martian embassy is looking for an Earthman who can help the Martians trick the other Earthmen into investing in Mars or perhaps creating a tourist industry there, although there's really nothing worth seeing. The Red Ankh Society is emblematic of the way the Martians make money: by tricking Earthmen into believing that Mars is mysterious and interesting and purchasing items that truly hold no value. "
              },
              {
                "worker_id": "2",
                "uid": "47bb458a99a94b6e950965c4ff4ec1a5",
                "response_text": "Peter Matheny, a sociodynamics professor at Devil’s Kettle University, is the person who came up with the idea for the Red Ankh Society, which was established as a money-making venture for Mars, and he was selected for the mission to Earth because of this idea. The Society advertises that it can pass on the “mysterious knowledge” of the Old Martians and possesses the “secret wisdom of the Ancient Aliens.” The organization is a fake, but it has become the top dollar-earning business on Mars. While Mars lags behind Earth in its earning capacity, this organization generates more money for Mars than any other business. This scam is just one of several that Mars has used to make money.\n"
              },
              {
                "worker_id": "6",
                "uid": "77956a1fd5e342569e5686680bbd35c2",
                "response_text": "The Red Ankh Society was a ploy developed by Peter Matheny to bring more capital to the Martian Nation. This scheme involved producing advertisements, both visual and auditory, that told stories of the Ancient Aliens of Mars. This older generation supposedly had lots of wisdom to share with a select audience. The Red Ankh Society was only available to the few people willing to pay the steep price for it to uncover more secrets about the ancient Martians. This Society is significant because it is one of the reasons the Martian government chose creator Peter Matheny for this job on Earth, and it shows what schemes and ploys the Martians must come up with in order to make money. "
              }
            ]
          },
          {
            "question_text": "Who is Peri and what is her role in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "8",
                "uid": "233c7980b9e241c8a76f35cc2eba25fe",
                "response_text": "Peri is Gus Doran's business associate along with someone named Sam Wendt. The three of them operate an enterprise centering on Peri's ability to attract rich and powerful men and swindle them for cash. Peri has golden blonde hair and silver-blue eyes and a light complexion, and she has a private phone number she gives to men involved in the group's schemes. At the beginning of the story, she wears a dinner gown as she prepares to go on a date with a marijuana rancher, who is also the heir apparent to Indonesia, Inc. When she receives a phone call, she changes from her gown into a more casual bathrobe, thinking one of her many suitors is calling her and wants to make him feel special. However, the casualness of the bathrobe is misleading as it is worth thousands of dollars and was given to her by a representative of the Antarctic Enterprise. She even tousles up her coiffed hair to complete the image. When she realizes it is only Gus Doran calling, she grows impatient and drops her facade. On the call with Gus, she learns of his introduction to Peter Matheny, and together they agree on a scheme to extort a million dollars from him. Gus wants to split the cash evenly between the three of them, but Peri insists on fifty percent for her share. She cancels the date with the marijuana rancher and prepares to go meet Gus and Peter at the Jupiter-Astoria."
              },
              {
                "worker_id": "1",
                "uid": "14fe04effbd74a1795dfdbf89b2db7ec",
                "response_text": "Peri is Gus's girl, and she makes money for herself and for him by making rich men feel important and worthy of her time. When she first enters the story, she is barely dressed in a robe and purposefully places some blond hair in front of her eyes to look demure for a video call. Although she already has a date with a wealthy man scheduled for that evening, she changes her mind when Gus tells her that he has a Martian who's holding millions of dollars and wants to see her. Gus originally offers Peri one-third of the takeaway, but she insists that she gets half of the pot of money. Gus makes the connections with the wealthy guys, but it's Peri who ultimately takes advantage of them and gets them to fork over their money. "
              },
              {
                "worker_id": "2",
                "uid": "47bb458a99a94b6e950965c4ff4ec1a5",
                "response_text": "Peri seems to be a high-class call girl who collaborates with others to scam men out of their money. She has a casual bathrobe which cost several thousand dollars and was given to her by either the president of Antarctic Enterprise or the chairman of the board; she has had so many “dates” that she has difficulty keeping them straight. When her visiphone chimes, she preps herself to look sultry, slipping out of her dinner gown and into the robe, fixing her hair just so, and making sure the robe is loose around the top and tight around the hips. When she answers the call, she says she is sorry to keep the caller waiting but that she was just taking a bath; this suggestive information is meant to lure in her caller. The caller is Gus Doran, who is her scam associate. He tells her that she has a date that night with a backwoods Martian, a man who lacks sophistication but who has come to Earth as a Martian diplomat with a large expense budget of one hundred million dollars. Peri tells Gus that she is having dinner with the heir apparent of Indonesia, Inc. Gus tells Peri he thinks they can get one million dollars from the Martian and states Peri’s cut will be one-third of that. Peri interrupts him and states that her share will be half a million dollars and that she has a headache that will prevent her from seeing the heir apparent of Indonesia, Inc. After Gus “befriends” the Martian diplomat and earns his trust, he gets the Martian drunk and suggests inviting a girl he knows to help them celebrate their upcoming business arrangement of a con man to work for Mars; the girl is Peri. We can assume she will help Gus make his deal that will provide a million-dollar payout that they will split. \n"
              },
              {
                "worker_id": "6",
                "uid": "77956a1fd5e342569e5686680bbd35c2",
                "response_text": "Peri is a highly-esteemed and very expensive escort, based on her clothing alone. The casual bathrobe she puts on to answer a call probably cost several thousand dollars. Although she was supposed to meet with Mr. Sastro tonight, the heir apparent of Indonesia, Inc. and marijuana rancher, Doran persuades her to meet with Matheny instead. She is drawn in by Matheny’s excessive funds for his visit to Mars. She and Doran come up with a plan called “Badger,” which involves another fellow called Sam Wendt, presumably to steal all of Matheny’s money. Peri is the escort promised to Matheny by Doran, and presumably a con-woman herself. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5202,
        "document_length_chars": 30005
      }
    }
  ]
}