{
  "item_metadata": {
    "item_id": "51662",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51662",
      "content": "BREAKDOWN\n \n \n By HERBERT D. KASTLE\n \n Illustrated by COWLES\n \n [Transcriber's Note: This etext was produced from Galaxy Magazine June 1961. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n \n He didn't know exactly when it had started, but it had been going on for weeks. Edna begged him to see the doctor living in that new house two miles past Dugan's farm, but he refused. He point-blank refused to admit he was sick that way—in the head!\n \n Of course, a man could grow forgetful. He had to admit there were moments when he had all sorts of mixed-up memories and thoughts in his mind. And sometimes—like right now, lying in bed beside Edna, watching the first hint of light touch the windows—he began sweating with fear. A horrible, gut-wrenching fear, all the more horrible because it was based on nothing.\n \n The chicken-run came alive; the barn followed minutes later. There were chores to do, the same chores he'd done all his forty-one years. Except that now, with the new regulations about wheat and corn, he had only a vegetable patch to farm. Sure, he got paid for letting the fields remain empty. But it just didn't seem right, all that land going to waste....\n  Davie. Blond hair and a round, tanned face and strong arms growing stronger each day from helping out after school.\n \n \n He turned and shook Edna. \"What happened to Davie?\"\n \n She cleared her throat, mumbled, \"Huh? What happened to who?\"\n \n \"I said, what....\" But then it slipped away. Davie? No, that was part of a dream he'd had last week. He and Edna had no children.\n \n He felt the fear again, and got up fast to escape it. Edna opened her eyes as soon as his weight left the bed. \"Like hotcakes for breakfast?\"\n \n \"Eggs,\" he said. \"Bacon.\" And then, seeing her face change, he remembered. \"Course,\" he muttered. \"Can't have bacon. Rationed.\"\n \n She was fully awake now. \"If you'd only go see Dr. Hamming, Harry. Just for a checkup. Or let me call him so he could—\"\n \n \"You stop that! You stop that right now, and for good! I don't want to hear no more about doctors. I get laid up, I'll call one. And it won't be that Hamming who I ain't never seen in my life! It'll be Timkins, who took care'n us and brought our son into the world and....\"\n \n She began to cry, and he realized he'd said something crazy again. They had no son, never had a son. And Timkins—he'd died and they'd gone to his funeral. Or so Edna said.\n \n He himself just couldn't remember it.\n \n He went to the bed and sat down beside her. \"Sorry. That was just a dream I had. I'm still half asleep this morning. Couldn't fall off last night, not till real late. Guess I'm a little nervous, what with all the new regulations and not working regular. I never meant we had a son.\" He waited then, hoping she'd say they had had a son, and he'd died or gone away. But of course she didn't.\n \n \n\n \n He went to the bathroom and washed. By the time he came to the kitchen, Edna had hotcakes on a plate and coffee in a cup. He sat down and ate. Part way through the meal, he paused. \"Got an awful craving for meat,\" he said. \"Goddam those rations! Man can't even butcher his own stock for his own table!\"\n \n \"We're having meat for lunch,\" she said placatingly. \"Nice cut of multi-pro.\"\n \n \"Multi-pro,\" he scoffed. \"God knows what's in it. Like spam put through a grinder a hundred times and then baked into slabs. Can't hardly taste any meat there.\"\n \n \"Well, we got no choice. Country's on emergency rations. The current crisis, you know.\"\n \n The way she said it irritated him. Like it was Scripture; like no one could question one word of it without being damned to Hell. He finished quickly and without speaking went on out to the barn.\n \n He milked and curried and fed and cleaned, and still was done inside of two hours. Then he walked slowly, head down, across the hay-strewn floor. He stopped, put out his hand as if to find a pole or beam that was too familiar to require raising his eyes, and almost fell as he leaned in that direction. Regaining his balance after a sideward staggering shuffle, he looked around, startled. \"Why, this ain't the way I had my barn....\"\n \n He heard his own voice, and stopped. He fought the flash of senseless panic. Of course this was the way he'd had his barn built, because it was his barn!\n \n He rubbed his hard hands together and said aloud, \"Get down to the patch. Them tomatoes need fertilizer for tang.\" He walked outside and took a deep breath. Air was different, wasn't it? Sweet and pure and clean, like country air always was and always would be; but still, different somehow. Maybe sharper. Or was sharp the word? Maybe....\n \n He went quickly across the yard, past the pig-pen—he'd had twelve pigs, hadn't he? Now he had four—behind the house to where the half-acre truck farm lay greening in the sun. He got to work. Sometime later, Edna called to him. \"Delivery last night, Harry. I took some. Pick up rest?\"\n \n \"Yes,\" he shouted.\n \n She disappeared.\n \n He walked slowly back to the house. As he came into the front yard, moving toward the road and the supply bin, something occurred to him. The car. He hadn't seen the old Chevvy in ... how long? It'd be nice to take a ride to town, see a movie, maybe have a few beers.\n \n No. It was against the travel regulations. He couldn't go further than Walt and Gloria Shanks' place. They couldn't go further than his. And the gas rationing. Besides, he'd sold the car, hadn't he? Because it was no use to him lying in the tractor shed.\n \n \n\n \n He whirled, staring out across the fields to his left. Why, the tractor shed had stood just fifty feet from the house!\n \n No, he'd torn it down. The tractor was in town, being overhauled and all. He was leaving it there until he had use for it.\n \n He went on toward the road, his head beginning to throb. Why should a man his age, hardly sick at all since he was a kid, suddenly start losing hold this way? Edna was worried. The Shanks had noticed it too.\n \n He was at the supply bin—like an old-fashioned wood bin; a box with a sloping flap lid. Deliveries of food and clothing and home medicines and other things were left here. You wrote down what you needed, and they left it—or whatever they allowed you—with a bill. You paid the bill by leaving money in the bin, and the next week you found a receipt and your new stuff and your new bill. And almost always you found some money from the government, for not planting wheat or not planting corn. It came out just about even.\n \n He hauled out a sack of flour, half the amount of sugar Edna had ordered, some dried fruit, a new Homekit Medicine Shelf. He carried it into the house, and noticed a slip of paper pinned to the sugar bag. A television program guide.\n \n Edna hustled over excitedly. \"Anything good on this week, Harry?\"\n \n He looked down the listings, and frowned. \"All old movies. Still only one channel. Still only from nine to eleven at night.\" He gave it to her, turned away; then stopped and waited. He'd said the same thing last week. And she had said the films were all new to her.\n \n She said it now. \"Why Harry, I've never seen this movie with Clark Gable. Nor the comedy with Red Skeleton. Nor the other five neither.\"\n \n \"I'm gonna lie down,\" he said flatly. He turned and stepped forward, and found himself facing the stove. Not the door to the hall; the stove. \"But the door....\" he began. He cut himself short. He turned and saw the door a few feet to the left, beside the table. He went there and out and up the stairs (they too had moved; they too weren't right) and into the bedroom and lay down. The bedroom was wrong. The bed was wrong. The windows were wrong.\n \n The world was wrong! Lord, the whole damned world was wrong!\n \n \n\n \n Edna didn't wake him, so they had a late lunch. Then he went back to the barn and let the four cows and four sheep and two horses into the pastures. Then he checked to see that Edna had fed the chickens right. They had only a dozen or so now.\n \n When had he sold the rest? And when had he sold his other livestock?\n \n Or had they died somehow? A rough winter? Disease?\n \n He stood in the yard, a tall, husky man with pale brown hair and a face that had once been long, lean and strong and was now only long and lean. He blinked gray eyes and tried hard to remember, then turned and went to the house. Edna was soaking dishes in the sink, according to regulations—one sinkful of dishwater a day. And one tub of bath water twice a week.\n \n She was looking at him. He realized his anger and confusion must be showing. He managed a smile. \"You remember how much we got for our livestock, Edna?\"\n \n \"Same as everyone else,\" she said. \"Government agents paid flat rates.\"\n \n He remembered then, or thought he did. The headache was back. He went upstairs and slept again, but this time he had dreams, many of them, and all confused and all frightening. He was glad to get up. And he was glad to hear Walt and Gloria talking to Edna downstairs.\n \n He washed his face, combed his hair and went down. Walt and Gloria were sitting on the sofa, Edna in the blue armchair. Walt was saying he'd gotten the new TV picture tube he'd ordered. \"Found it in the supply bin this morning. Spent the whole day installing it according to the book of directions.\"\n \n Harry said hi and they all said hi and he sat down and they talked about TV and gardens and livestock. Then Harry said, \"How's Penny?\"\n \n \"Fine,\" Gloria answered. \"I'm starting her on the kindergarten book next week.\"\n \n \"She's five already?\" Harry asked.\n \n \"Almost six,\" Walt said. \"Emergency Education Regulations state that the child should be five years nine months old before embarking on kindergarten book.\"\n \n \"And Frances?\" Harry asked. \"Your oldest? She must be starting high....\" He stopped, because they were all staring at him, and because he couldn't remember Frances clearly. \"Just a joke,\" he said, laughing and rising. \"Let's eat. I'm starved.\"\n \n \n\n \n They ate in the kitchen. They talked—or rather Edna, Gloria and Walt did. Harry nodded and said uh-huh and used his mouth for chewing.\n \n Walt and Gloria went home at ten-fifteen. They said goodbye at the door and Harry walked away. He heard Gloria whispering something about Doctor Hamming.\n \n He was sitting in the living room when Edna came in. She was crying.\n\"Harry, please see the doctor.\"\n \n He got up. \"I'm going out. I might even sleep out!\"\n \n \"But why, Harry, why?\"\n \n He couldn't stand to see her crying. He went to her, kissed her wet cheek, spoke more softly. \"It'll do me good, like when I was a kid.\"\n \n \"If you say so, Harry.\"\n \n He left quickly. He went outside and across the yard to the road. He looked up it and down it, to the north and to the south. It was a bright night with moon and stars, but he saw nothing, no one. The road was empty. It was always empty, except when Walt and Gloria walked over from their place a mile or so south. But once it hadn't been empty. Once there'd been cars, people....\n \n He had to do something. Just sitting and looking at the sky wouldn't help him. He had to go somewhere, see someone.\n \n He went to the barn and looked for his saddle. There was no saddle. But he'd had one hanging right behind the door. Or had he?\n \n He threw a blanket over Plum, the big mare, and tied it with a piece of wash line. He used another piece for a bridle, since he couldn't find that either, and didn't bother making a bit. He mounted, and Plum moved out of the barn and onto the road. He headed north, toward town.\n \n Then he realized he couldn't go along the road this way. He'd be reported. Breaking travel regulations was a serious offense. He didn't know what they did to you, but it wasn't anything easy like a fine.\n \n He cut into an unfenced, unplanted field.\n \n His headache was back, worse now than it had ever been. His entire head throbbed, and he leaned forward and put his cheek against Plum's mane. The mare whinnied uneasily, but he kicked her sides and she moved forward. He lay there, just wanting to go somewhere, just wanting to leave his headache and confusion behind.\n \n He didn't know how long it was, but Plum was moving cautiously now. He raised his head. They were approaching a fence. He noticed a gate off to the right, and pulled the rope so Plum went that way. They reached the gate and he got down to open it, and saw the sign. \"Phineas Grotton Farm.\" He looked up at the sky, found the constellations, turned his head, and nodded. He'd started north, and Plum had continued north. He'd crossed land belonging both to himself and the Franklins. Now he was leaving the Franklin farm. North of the Franklins were the Bessers. Who was this Phineas Grotton? Had he bought out Lon Besser? But anything like that would've gotten around.\n \n Was he forgetting again?\n \n \n\n \n Well, no matter. Mr. Grotton would have to excuse his trespass. He opened the gate, led Plum through it, closed the gate. He mounted and rode forward, still north, toward the small Pangborn place and after the Pangborns the biggest farm in the county—old Wallace Elverton's place. The fields here, as everywhere in the county, lay fallow. Seemed as if the government had so much grain stored up they'd be able to get along without crops for years more.\n \n He looked around. Somehow, the country bothered him. He wasn't sure why, but ... everything was wrong.\n \n His head weighed an agonized ton. He put it down again. Plum went sedately forward. After a while she stopped. Harry looked up. Another fence. And what a fence! About ten feet of heavy steel mesh, topped by three feet of barbed-wire—five separate strands. What in the world had Sam Pangborn been thinking of to put up a monster like this?\n \n He looked around. The gate should be further west. He rode that way. He found no gate. He turned back, heading east. No gate. Nothing but fence. And wasn't the fence gradually curving inward? He looked back. Yes, there was a slight inward curve.\n \n He dismounted and tied Plum to the fence, then stepped back and figured the best way to get to the other side.\n \n The best way, the only way, was to claw, clutch and clamber, as they used to say back when he was a kid.\n \n \n\n \n It took some doing. He tore his shirt on the barbed wire, but he got over and began walking, straight ahead, due north. The earth changed beneath his feet. He stooped and touched it. Sand. Hard-packed sand. He'd never seen the like of it in this county.\n \n He walked on. A sound came to him; a rising-falling whisper. He listened to it, and looked up every so often at the sky, to make sure he was heading in the right direction.\n \n And the sand ended. His shoes plunked over flooring.\n \n Flooring!\n \n He knelt to make sure, and his hand felt wooden planks. He rose, and glanced up to see if he was still outdoors. Then he laughed. It was a sick laugh, so he stopped it.\n \n He took another step. His shoes sounded against the wood. He walked. More wood. Wood that went on, as the sand had. And the roaring sound growing louder. And the air changing, smelling like air never had before in Cultwait County.\n \n \n\n \n His entire body trembled. His mind trembled too. He walked, and came to a waist-high metal railing, and made a tiny sound deep in his throat. He looked out over water, endless water rolling in endless waves under the night sky. Crashing water, topped with reflected silver from the moon. Pounding water, filling the air with spray.\n \n He put out his hands and grasped the railing. It was wet. He raised damp fingers to his mouth. Salt.\n \n He stepped back, back, and turned and ran. He ran wildly, blindly, until he could run no more. Then he fell, feeling the sand beneath him, and shut his eyes and mind to everything.\n \n Much later, he got up and went to the fence and climbed it. He came down on the other side and looked around and saw Plum. He walked to her, mounted her, sat still. The thoughts, or dreams, or whatever they were which had been torturing him these past few weeks began torturing him again.\n \n It was getting light. His head was splitting.\n \n Davie. His son Davie. Fourteen years old. Going to high school in town....\n  Town! He should've gone there in the first place! He would ride east, to the road, then head south, back toward home. That would bring him right down Main Street. Regulations or not, he'd talk to people, find out what was happening.\n \n He kicked Plum's sides. The mare began to move. He kept kicking until she broke into a brisk canter. He held on with hands and legs.\n \n Why hadn't he seen the Pangborns and Elvertons lately—a long time lately?\n  The ocean. He'd seen the ocean. Not a reservoir or lake made by flooding and by damming, but salt water and enormous. An ocean, where there could be no ocean. The Pangborns and Elvertons had been where that ocean was now. And after the Elvertons had come the Dobsons. And after them the new plastics plant. And after that the city of Crossville. And after that....\n \n \n He was passing his own farm. He hadn't come through town, and yet here he was at his own farm. Could he have forgotten where town was? Could it be north of his home, not south? Could a man get so confused as to forget things he'd known all his life?\n \n He reached the Shanks' place, and passed it at a trot. Then he was beyond their boundaries and breaking regulations again. He stayed on the road. He went by a small house and saw colored folks in the yard. There'd been no colored folks here. There'd been Eli Bergen and his family and his mother, in a bigger, newer house. The colored folks heard Plum's hooves and looked up and stared. Then a man raised his voice. \"Mistah, you breakin' regulations! Mistah, the police gonnah get you!\"\n \n \n\n \n He rode on. He came to another house, neat and white, with three children playing on a grassy lawn. They saw him and ran inside. A moment later, adult voices yelled after him:\n \n \"You theah! Stop!\"\n \n \"Call the sheriff! He's headin' foah Piney Woods!\"\n \n There was no place called Piney Woods in this county.\n \n Was this how a man's mind went?\n \n He came to another house, and another. He passed ten all told, and people shouted at him for breaking regulations, and the last three or four sounded like Easterners. And their houses looked like pictures of New England he'd seen in magazines.\n \n He rode on. He never did come to town. He came to a ten-foot fence with a three-foot barbed-wire extension. He got off Plum and ripped his clothing climbing. He walked over hard-packed sand, and then wood, and came to a low metal railing. He looked out at the ocean, gleaming in bright sunlight, surging and seething endlessly. He felt the earth sway beneath him. He staggered, and dropped to his hands and knees, and shook his head like a fighter hit too many times. Then he got up and went back to the fence and heard a sound. It was a familiar sound, yet strange too. He shaded his eyes against the climbing sun. Then he saw it—a car. A car!\n \n \n \n\n \n It was one of those tiny foreign jobs that run on practically no gas at all. It stopped beside him and two men got out. Young men with lined, tired faces; they wore policemen's uniforms. \"You broke regulations, Mr. Burr. You'll have to come with us.\"\n \n He nodded. He wanted to. He wanted to be taken care of. He turned toward Plum.\n \n The other officer was walking around the horse. \"Rode her hard,\" he said, and he sounded real worried. \"Shouldn't have done that, Mr. Burr. We have so very few now....\"\n \n The officer holding Harry's arm said, \"Pete.\"\n \n The officer examining Plum said, \"It won't make any difference in a while.\"\n \n Harry looked at both of them, and felt sharp, personal fear.\n \n \"Take the horse back to his farm,\" the officer holding Harry said. He opened the door of the little car and pushed Harry inside. He went around to the driver's side and got behind the wheel and drove away. Harry looked back. Pete was leading Plum after them; not riding him, walking him. \"He sure must like horses,\" he said.\n \n \"Yes.\"\n \n \"Am I going to jail?\"\n \n \"No.\"\n \n \"Where then?\"\n \n \"The doctor's place.\"\n \n They stopped in front of the new house two miles past Dugan's farm. Except he'd never seen it before. Or had he? Everyone seemed to know about it—or was everyone only Edna and the Shanks?\n \n He got out of the car. The officer took his arm and led him up the path. Harry noticed that the new house was big.\n \n When they came inside, he knew it wasn't like any house he'd ever seen or heard of. There was this long central passageway, and dozens of doors branched off it on both sides, and stairways went down from it in at least three places that he could see, and at the far end—a good two hundred yards away—a big ramp led upward. And it was all gray plaster walls and dull black floors and cold white lighting, like a hospital, or a modern factory, or maybe a government building. Except that he didn't see or hear people.\n \n He did hear something ; a low, rumbling noise. The further they came along the hall, the louder the rumbling grew. It seemed to be deep down somewhere.\n \n \n\n \n They went through one of the doors on the right, into a windowless room. A thin little man with bald head and frameless glasses was there, putting on a white coat. His veiny hands shook. He looked a hundred years old. \"Where's Petey?\" he asked.\n \n \"Pete's all right, Dad. Just leading a horse back to Burr's farm.\"\n \n The old man sighed. \"I didn't know what form it would take. I expected one or two cases, but I couldn't predict whether it would be gradual or sudden, whether or not it would lead to violence.\"\n \n \"No violence, Dad.\"\n \n \"Fine, Stan.\" He looked at Harry. \"I'm going to give you a little treatment, Mr. Burr. It'll settle your nerves and make everything....\"\n \n \"What happened to Davie?\" Harry asked, things pushing at his brain again.\n \n Stan helped him up. \"Just step this way, Mr. Burr.\"\n \n He didn't resist. He went through the second door into the room with the big chair. He sat down and let them strap his arms and legs and let them lower the metal thing over his head. He felt needles pierce his scalp and the back of his neck. He let them do what they wanted; he would let them kill him if they wanted. All he asked was one answer so as to know whether or not he was insane.\n \n \"What happened to my son Davie?\"\n \n The old man walked across the room and examined what looked like the insides of a dozen big radios. He turned, his hand on a switch.\n \n \"Please,\" Harry whispered. \"Just tell me about my son.\"\n \n The doctor blinked behind his glasses, and then his hand left the switch. \"Dead,\" he said, his voice a rustling of dried leaves. \"Like so many millions of others. Dead, when the bombs fell. Dead, as everyone knew they would be and no one did anything to prevent. Dead. Perhaps the whole world is dead—except for us.\"\n \n Harry stared at him.\n \n \n\n \n \"I can't take the time to explain it all. I have too much to do. Just three of us—myself and my two sons. My wife lost her mind. I should have helped her as I'm helping you.\"\n \n \"I don't understand,\" Harry said. \"I remember people, and things, and where are they now? Dead? People can die, but farms, cities....\"\n \n \"I haven't the time,\" the doctor repeated, voice rising. \"I have to run a world. Three of us, to run a world! I built it as best I could, but how large could I make it? The money. The years and years of work. The people calling me insane when they found out ... but a few giving me more money, and the work going on. And those few caught like everyone else, unprepared when the holocaust started, unprepared and unable to reach my world. So they died. As I knew they would. As they should have known they would.\"\n \n Harry felt the rumbling beneath him. Engines?\n \n \"You survived,\" the doctor said. \"Your wife. A few hundred others in the rural areas. One other family in your area. I survived because I lived for survival, like a mole deep in the earth, expecting the catastrophe every minute. I survived because I gave up living to survive.\" He laughed, high and thin.\n \n His son said, \"Please, Dad....\"\n \n \"No! I want to talk to someone sane ! You and Petey and I—we're all insane, you know. Three years now, playing God, waiting for some land, any land, to become habitable. And knowing everything, and surrounded by people who are sane only because I made sure they would know nothing.\" He stepped forward, glaring at Harry. \"Now do you understand? I went across the country, picking up a few of the few left alive. Most were farmers, and even where some weren't I picked the farmers anyway. Because farmers are what we'll need, and all the rest can evolve later. I put you and the others, eighty-six all told, from every section of the country, on my world, the only uncontaminated land left. I gave you back your old lives. I couldn't give you big crops because we don't need big crops. We would only exhaust our limited soil with big crops. But I gave you vegetable gardens and livestock and, best of all, sanity ! I wiped the insane moments from your minds. I gave you peace and consigned myself, my sons, my own wife....\"\n \n He choked and stopped.\n \n Stan ran across the room to the switch. Harry watched him, and his brain struggled with an impossible concept. He heard the engines and remembered the ocean on two sides; on four sides had he bothered to check south and east; on all sides if that fence continued to curve inward. Ocean, and there was no ocean in Iowa.\n \n And this wasn't Iowa.\n  The explosions had ripped the world, and he'd tried to get to town to save Davie, and there'd been no town and there'd been no people and there'd been only death and poison in the air and even those few people left had begun to die, and then the truck with the huge trailer had come, the gleaming trailer with the little man and his trembling wife and his two sons....\n \n \n \n\n \n Suddenly, he understood. And understanding brought not peace but the greatest terror he'd ever known. He screamed, \"We're on....\" but the switch was thrown and there was no more speech. For an hour. Then he got out of the chair and said, \"Sure glad I took my wife's advice and came to see you, Doctor Hamming. I feel better already, and after only one.... What do you call these treatments?\"\n \n \"Diathermy,\" the little doctor muttered.\n \n Harry gave him a five-dollar bill. The doctor gave him two singles in change. \"That's certainly reasonable enough,\" Harry said.\n \n The doctor nodded. \"There's a police officer in the hall. He'll drive you home so there won't be any trouble with the travel regulations.\"\n \n Harry said, \"Thanks. Think we'll ever see the end of travel regulations and rationing and all the rest of the emergency?\"\n \n \"You will, Mr. Burr.\"\n \n Harry walked to the door.\n \n \"We're on an ark,\" the doctor said.\n \n Harry turned around, smiling. \"What?\"\n \n \"A test, Mr. Burr. You passed it. Goodbye.\"\n \n Harry went home. He told Edna he felt just great! She said she'd been worried when an officer found Plum wandering on the road; she thought maybe Harry had gone off somewhere and broken travel regulations.\n \n \"Me?\" he exclaimed, amazed. \"Break travel regulations? I'd as soon kill a pig!\"",
      "metadata": {
        "title": "Breakdown",
        "author": "Herbert D. Kastle",
        "passage_id": "51662",
        "uid": "54d005fe7b11450888d0d8902b0eade9",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "107",
                "uid": "a5b10cd324924559a7a364706d1618eb",
                "response_text": "Harry Burr is begged by his wife Edna to go see a doctor because she believes that he is sick in the head. He refuses to believe that anything is wrong, but he does admit that there are times where he lies in fear over nothing and mixes up his memories. The story then jumps to the present, where he begins to think about a blond boy named Davie. Edna is confused because they have no children. Edna brings up seeing a doctor again, he angrily responds that it will only be Timkins who brought their son into the world. Edna tells him they had no son, and Timkins died a while ago. The scene cuts to breakfast, where Harry complains about a lack of meat. Edna explains that there is only multi-pro because of the current crisis in the country. Harry begins to go walk outside, but he experiences more strange memories that don’t add up. He picks up the delivery that Edna ordered. Edna asks if there is anything good on television this week because there is only one channel. After a late lunch, Harry goes to check on the animals again and wonders what happened to the rest of the livestock. Edna tells him that they got the same as everyone else, and he goes upstairs again. When he awakes again, Gloria and Walt have arrived. He asks about Penny and Frances. After they leave, He takes his mare Plum out for a ride, and they arrive at a barbed wire fence area up north. He gets over the wire and continues to walk north, until the earth changes to sand. Then, the sand becomes wooden flooring; there is also a loud roaring sound. When he reaches a waist-high metal railing, he runs back to Plum again. Harry has the idea to ride to town, even if the other neighbors tell him to stop and for somebody to call the police. Soon, two policemen come out to escort him to the doctor. Harry asks the doctor where his son is, and the doctor explains that he is dead like so many millions of others. The doctor tells him he has so many things to do, and he says there are a few remaining people who are still alive. Harry’s brain struggles with the impossible concept, and he thinks about how this is not Iowa. Just as Harry realizes what they are on, the switch is thrown, and he finds himself feeling better from the diathermy treatment. Before Harry leaves, the doctor tests him one last time by telling him that they are on an ark. Harry is confused, which means that the treatment works. He goes home to Edna and is happier than ever. "
              },
              {
                "worker_id": "109",
                "uid": "002a1770011b49468bafff9ae55da261",
                "response_text": "This story follows Harry, a farmer living in Iowa. He and his wife, Edna, live in a time of crisis and so there are many government regulations to follow. Some of these regulations include food rationing, being restricting to farming vegetables, only being able to travel to the neighbors house, etc. While going about his day, Harry often has visions of a young boy named Davie, someone he understands to be his and Edna's son. He is also constantly discombobulated by the placement of things in the house as well as events that supposedly did or did not happen. This confusion leads Edna to be very worried about him, and she insists for him to visit Dr. Hamming, which he refuses. \n\nOne night, their neighbors Walt and Gloria visit. Harry mistakenly asks about their older daughter - who doesn't exist - and spends the rest of the dinner quiet. After the neighbors leave, Edna is furthermore distraught which prompts Harry to leave the house in hopes of clearing his mind. Outside, he creates a makeshift saddle over his horse, Plum, and rides off into the unplanted fields. After travelling for a while, he and Plum approach a fenced off property labelled \"Phineas Grotton Farm\". Trespassing nonetheless, he rides Plum forwards before pausing; he felt as if everything around him was wrong, including his supposed friend Pangborn putting up a massive fence. \n\nGoing over the fence, he noticed a roaring sound growing louder and the smell of the air changing. As he walked, the ground underneath him changed from earth to sand to wood. He came over to a metal railing and found that it overlooked an endless crashing water and salty air - the ocean. After a while, he rode Plum back to his farm, only to note that he had arrived without even needing to go through town. On the way back, he was spotted breaking travel regulations and was pulled over by the police, who take him to the doctor's office. \n\nAt the doctor's office, his confusion is finally explained away. While being prepped for treatment, Dr. Hamming reveals that his supposed son, Davie, and friend Pangborn, were indeed real and alive, but killed by the bombs. Only a few remain amongst the uninhabitable land, and so it was Dr. Hamming who brought them along to his inhabitable world. Dr. Hamming, his two sons, and his now late wife work together to wipe the bad memories from the townspeople and keep the community going as they, on board an ark, continually search for inhabitable land. As Harry begins to form his own conclusions, Dr. Hammings injects him with the treatment and his sane mind is restored. \n\nAt the end, Harry returns home to his wife. She expresses a worry that he may have taken Plum and broken regulations, to which he insists he would never do. "
              },
              {
                "worker_id": "112",
                "uid": "20d3bb17f533492799af849ff19c3e6e",
                "response_text": "Harry seems to have a memory problem. His wife, Edna, often begs him to see the doctor in the town, but he refuses. He often remembers memories that are mismatched with reality. For example, he thinks he has a son, Davie, but all the people, including Edna, deny the fact. He remembers that his fields were planted fully with crops such as wheat and corn, not wasting the land, but now he can only plant a patch of vegetables with all the other fields remaining fallow. He thinks Timkins, the doctor he used to go for, is still alive, but Timkins died a long while ago, based on Edna’s testimony. After eating the rationed food supplied by the government for breakfast, he checks his barn and farms around his house, which seem unfamiliar to him compared to his memory. He picks up the delivery of living supplies and sees the listed movies provided, having the same conversation with Edna as last week. The more he sees, the more he realizes that everything is wrong. When their neighbors visit them and eat with them, Harry has more mistakes in his memory and does not talk while eating. When Edna begs him to see the doctor again, he goes out to ride a mare called Plum.\n\nAt night, Harry rides Plum towards the north on the empty road. Soon after realizing he may be reported for breaking travel regulations, he cuts into an unplanted field. He faces a fenced farm where the owner’s name is unfamiliar with what he remembered to be; he opens it and keeps going northwards. When he reaches the end, he sees a tall metal mesh with barbed wire fence with no gates and climbs to the other side of the fence, seeing nothing but the ocean while standing on the wooden floor. He goes back to the fence, climbs it, and mounts Plum. He tries to find the town but fails. He rides on the road, passing his and his neighbor's houses. People living next to the road shout at him for breaking the regulation, but Harry gives no care to those unfamiliar faces and goes to the southern tip, seeing the extension of the metal fence, climbing through it, and the ocean is there again. When he returns to the fence, two men in police uniforms from a car catch him. He gets in the car, letting one man lead his horse back to his house. They arrive at the doctor’s house, where Harry is told by Doctor Hamming the truth that the people on the ark are the remaining humans in the world. All the other humans might have already died from the bombs, including his son Davie. Harry has those memory problems because his real memory is coming. As soon as Harry realizes what is going on, he forgets it again as the treatment is already applied to him. After the treatment, he returns home and chats with his wife carefreely.\n"
              },
              {
                "worker_id": "113",
                "uid": "269763cdcd3b4c869e40b5e31281774d",
                "response_text": "Harry has mixed memories and forgets facts from his life. He wakes up in the morning, asking his wife about their son Davie but momentarily remembers that they have no children. He then suggests that he cooks bacon for breakfast but once again recalls that there is a meat ration. His wife Edna asks him to see Dr.Hamming, but Harry is adamant. During breakfast, Harry complains about rations. Edna tells him they will have multi-pro meat for dinner - he is not satisfied. While doing the chores, Harry realizes his barn seems different and unfamiliar. After picking up the delivery, he says that the TV program guide has old moves, but Edna has never seen them. Harry decides to take a nap and feels that everything around him is wrong. After lunch, he goes back to the barn and sees that they have fewer chickens than he remembers. Their neighbors, Walt and Gloria, come over. Harry makes some strange comments about the neighbors' children - he keeps silent for the rest of the evening. Walt and Gloria leave, and Edna asks Harry to go to the doctor again. He leaves for a walk, harnesses his horse, Plum, and heads north towards the town. He soon reaches Phineas Grotton Farm, which he has never seen before. He goes through the gate and continues riding to the north. The countryside seems wrong to him. Soon, he stumbles upon a ten-foot-high fence with a slight inward curve. He ties Plum to the fence, climbs over it, and walks on. The earth beneath his feet turns into the sand and then into wood flooring. He finally sees a metallic railing covered in saltwater. He sees waves beyond the railing - an ocean - and nervously runs back to Plum. He disregards the traveling regulations and rides along the road in the opposite direction - the citizens scream that he is breaking the law. Soon, he reaches the same high fence, railing, and ocean. A police car pulls over: one officer takes Plum, and the other drives Harry to Doctor Hamming. When entering the house, Harry hears some rumbling sound. The doctor, the officers' father, asks about the second son and starts working on Harry, who keeps asking about Davie. The doctor reveals that Harry’s son, just like millions of others, died during a bombing. The doctor claims that he, together with his two sons, is now running the world for the few hundred who survived after putting them on his world with the only uncontaminated soil left. He has to control the crops and livestock. He says he erased all the knowledge about these events to help people remain sane. Harry realizes Davie is dead, and he isn’t in Iowa. The doctor turns off the radio switch, and Harry immediately forgets this. He thanks Hamming for the treatment. Harry hears the doctor say that they are on an ark, but he doesn’t understand what it means and goes home in peace. \n\n\n"
              }
            ]
          },
          {
            "question_text": "Who is Doctor Hamming, and what are his traits?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "107",
                "uid": "a5b10cd324924559a7a364706d1618eb",
                "response_text": "Doctor Hamming is first described by Edna as someone who can treat Harry’s so-called “mental problems”. She insists for Harry to go see him multiple times, but Harry refuses every time. Finally, when Harry is escorted by the policemen does he go meet Doctor Hamming in person. In person, Doctor Hamming is a thin little man with a bald head and framed glasses. He also wears a white coat and looks about one hundred years old. He lives with his two sons, and his wife is not around anymore. His son’s names are Pete and Stan. Doctor Hamming is a very stressed person, constantly trying to manage the ark. He is also impatient as well, raising his voice when Harry asks him about his dead son. However, although the doctor is impatient, he is very knowledgeable in his field as well. He predicted that people will begin to die from a disaster and invested a lot of his money to build the ark. He has exceptional planning skills, picking out the farmers in the rural areas as people to continue living on the ark because he knows how important the farmers are. The doctor’s treatments are very successful as well, capable of completely erasing Harry Burr’s conflicting memories and making him forget that they are on an ark. "
              },
              {
                "worker_id": "109",
                "uid": "002a1770011b49468bafff9ae55da261",
                "response_text": "Dr. Hamming is the only doctor in the town, as the other Dr. Timkins had previously died. He is described to be a thin little man, bald, wearing frameless glasses and overall looking to be frail and at least a hundred years old. \n\nHe is weary and tired as he and his two sons are seemingly in charge of up-keeping the entire health, wealth and charade of the townspeople. He is compassionate as a doctor and has a deep passion for survival. He is generous, for he had saved a few of the remaining people alive after the bomb to try and find uncontaminated land to rebuild life on. \n\nHe describes himself as insane. Insane to be playing God, to be plagued with the memories of what actually happened, and to have been searching for habitable land for years on end. "
              },
              {
                "worker_id": "112",
                "uid": "20d3bb17f533492799af849ff19c3e6e",
                "response_text": "Doctor Hamming is the only doctor on the ark who is on the duty of maintaining the ark, finding the habitable land, and brainwashing the farmers on the ark. He lives in the new house two miles away from Dugan’s farm. He is thin, bald, and little, wearing frameless glasses and a white coat. He looks very old. He has two sons, Petey and Stan. His wife lost her mind a long time ago before he had the technique to help her. He is stressed because of the enormous pressures of running a world by himself and his sons without much financial support. He is insane because he and his sons have been playing god to maintain good social conditions on the ark for three years, searching for habitable lands desperately, and surrounded by people who know nothing. He is careful as he makes sure everyone on the ark knows nothing about the truth but he and his sons only to prevent possible chaos and terror. He is thoughtful of his plan as he knows what humans need to survive on a single ark and organize things in a necessary order. After the explosion, he picks up the remaining alive farmers to sustain the human race. He is desperate as they cannot find any pure habitable land for years."
              },
              {
                "worker_id": "113",
                "uid": "269763cdcd3b4c869e40b5e31281774d",
                "response_text": "Doctor Hamming is a medical specialist and a scientist. He saves several hundred people by relocating them to his ark with uncontaminated soil. He is resilient and responsible because he managed to gather the survivors and build a self-sustaining community that lives after the bombing. The doctor is lonely: he tries to talk to Harry, the only sane person besides him and his two sons, while the man’s memory is not under any influence. He is pragmatic and cautious - the doctor started building his ark before the Holocaust started. He was planning the construction, ready for the following catastrophe. He wants to live and to let people live - that's why he spent the last three years managing his mini-world and waiting for some land to become habitable again. "
              }
            ]
          },
          {
            "question_text": "What is the relationship between Edna and Harry?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "107",
                "uid": "a5b10cd324924559a7a364706d1618eb",
                "response_text": "Harry and Edna Burr are married. Initially, Edna is very concerned about Harry because of the strange memories that he experiences. She tries to plead with him to see a doctor, but he refuses to believe it. Harry is seen getting impatient with Edna, mainly because she is confused about the questions or people that he talks about. Even though she is concerned, Edna is good at comforting Harry. When he complains about the lack of meat, she tells him that they will have some multi-pro for lunch. The two of them split their duties as well, with Edna doing a lot of the housework and Harry doing the more manual labor. She also tries to suggest activities to do, such as asking what’s on the channel for this week. Edna loves Harry very much, but she does encourage him to seek a doctor to help his mental health. At the end, when Harry returns from his treatment, she asks if he has gone out to break any regulations. He only laughs and says he would rather kill a pig than do that. "
              },
              {
                "worker_id": "109",
                "uid": "002a1770011b49468bafff9ae55da261",
                "response_text": "Harry and Edna are husband and wife who both live on their farm, next to their neighbours Walt and Gloria. Harry appears to be increasing confused and distorted in his memory of the places, people and things around. Because of this, Edna is worried about him and wishes for him to visit the doctor's office. Harry constantly refuses her request, for he is unwilling to admit anything is wrong with him and that he does not want to see an unfamiliar doctor. Supposedly the two of them have a son together named Davie. However, when Harry accidentally mentions him as a figment of his dream, Edna doesn't correct him that he passed or of his existence, and so Harry assumes from her that Davie was not real. \n\nWhen the neighbors come over for dinner, Harry slips up again and Edna begins to cry. He decides to go out for a walk and potentially sleep there like he had done as a kid as to not further worry her. \n\nAt the end of the story after his visit to his doctor, Edna is relieved. She expresses that she thought Harry may have gone off somewhere - but after gone to the doctors - Harry would never have dreamt to do such a thing. "
              },
              {
                "worker_id": "112",
                "uid": "20d3bb17f533492799af849ff19c3e6e",
                "response_text": "Harry and Edna are in a marital relationship. Harry is Edna’s husband, and Edna is Harry’s wife. Edna cares for Harry a lot. Whenever Harry behaves as if he forgets the reality and sinks into the seemingly fake memory, she always asks him to see the doctor even though he never accepts her advice. Harry gains a lot of information about the present from Edna as he cannot remembers a lot of things, or to say, his memory is mismatched with what Edna has told him. Harry cherishes Edna so much that he can’t bear to see her cry. When Edna was crying, he would speak softly and kiss her."
              },
              {
                "worker_id": "113",
                "uid": "269763cdcd3b4c869e40b5e31281774d",
                "response_text": "Throughout the story, Edna becomes more and more upset because of Harry’s strange behavior. At the beginning, after Harry mentions their non-existent son, meat, and their dead family doctor, she starts crying and asks him to see a doctor. He tells her he’s still half-asleep. During breakfast, he gets irritated by how she calmly accepts the rations and the state limitations on food and travel. He makes several unordinary remarks during the day and makes seemingly strange comments about their neighbors' children. After their friends leave, she starts crying and asking Harry to see a doctor. Harry cannot stand her crying and goes for a walk. In the end, their relationship is supposed to get better since doctor Hamming improved his mental state."
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "107",
                "uid": "a5b10cd324924559a7a364706d1618eb",
                "response_text": "The story is set on an ark that Doctor Hamming put money into creating. Although it resembles Iowa, the residents are fooled to believe that it is indeed Iowa. Each of the residents have their own farm and land area, and they are restricted to only staying inside a certain area. For the Burrs, they cannot go beyond the Shanks’ place. Harry’s farm area has his house, an area for the livestock, and a tractor shed that was supposed to be torn off. Their area also has a supply bin that is shaped like an old-fashioned wood bin for deliveries from the government.  The land they live on is also shared with the Franklins. When Harry takes Plum out for a ride, they go up north past the Franklins to where the Bessers should be.  Then, they reach a small Pangborn farm.  Beyond Pangborn, there lies old Wallace Elverton’s place, which is known as the biggest farm in the country. There is barbed wire in this area, and he walks past it. Slowly, the earth becomes sand and then wood. There are also colored folks living here, when there shouldn’t have been, and a place called Piney Woods exists as well. The place where Doctor Hamming  lives is two miles past Dugan’s farm. It resembles a hospital, but there is nobody else inside of it. "
              },
              {
                "worker_id": "109",
                "uid": "002a1770011b49468bafff9ae55da261",
                "response_text": "This story is set in Iowa, perhaps a town, specifically, the farmhouse of Edna and Harry. This farmhouse had fields of land, a thriving vegetable patch, and a barn. Towards the road, there is a wooden supply in for deliveries and payment by the government. \n\nWhile on the horse, Harry encounters a farm fenced off with barbed wire. As he walked, the ground changed from beneath him. It went from earth to sand to wood. Here, he found a waist-high metal that when overlooked, revealed endless salty water - the ocean. \n\nAt the end of the story, Harry visits the doctor's place which is located in a new house past Dugan's farm. The house had long passageways and many. stairways, with gray walls and cold lighting. In there, there were windowless rooms. "
              },
              {
                "worker_id": "112",
                "uid": "20d3bb17f533492799af849ff19c3e6e",
                "response_text": "The story happens on a wooden ark floating on the ocean. The first scene is in Harry’s two-floor house. There are bedrooms, a kitchen, and a bathroom in his house. There is a blue armchair, a sofa, and a TV in the living room. Outside the house is the barn with the floor strewn with hay. Across the yard, there is a pigpen with four pigs inside. Behind the house, there is a half-acre truck farm. Across the front yard, there lies a wooden supply bin by the road. The road is empty, along which are unplanted fields. Ten-foot heavy steel mesh on top with three-foot barbed wire surrounds all the houses on the wooden ark. Near the edge of the ark, the floor is covered with hard-packed sand. On the edge of the ark is a metal railing circling the ark. The doctor’s house is big. Inside the house, at the end of a central passage and dozens of doors on both sides, a stairway downwards to at least two hundred yards depth, where the end leads to a ramp going upward. The grey plaster walls, black floors, and white lighting set a dull tone. An engine for the ark to move lies in the most central and deepest part of the house."
              },
              {
                "worker_id": "113",
                "uid": "269763cdcd3b4c869e40b5e31281774d",
                "response_text": "Harry and Edna think that they live in Iowa’s countryside. In the morning, they have a small conversation in the bedroom. Then Harry goes to the bathroom to wash, then to the kitchen. After eating, he spends some time in the barn and goes to the truck behind the house. Later, harry picks up a delivery in the front yard. He takes a nap and then eats in the kitchen. In the evening, their guests are seated on the sofa, and Edna is in the blue armchair. Later, Harry rides to the north. He trespasses on Phineas Grotton Farm. Then, he climbs over a high fence, and soon notices sand and later wood flooring beneath his feet. Finally, he sees the ocean. He runs back to his horse and decides to ride in the opposite direction along a residential road. He again reaches the railing and the ocean. The police officer gets him to doctor Hamming. This building is big: they go along the central passageway and see dozens of doors branched off it on both sides, and stairways go down from it in at least three places that Harry can see, and at the far end—a good two hundred yards away—a big ramp led upward. And it was all gray plaster walls, black floors, and cold white lighting, like a hospital, or a modern factory, or maybe a government building. He comes into a windowless room with a medical chair and a set of radios. At the end, after learning that he lives on an ark and immediately forgetting this, Harry comes back home.\n\n\n "
              }
            ]
          },
          {
            "question_text": "What are some of the government regulations that are imposed in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "107",
                "uid": "a5b10cd324924559a7a364706d1618eb",
                "response_text": "One of the government restrictions that Edna reminds Harry about is the rationing of meat. Due to the crisis in the country, there is a shortage of meat. Instead of actual meat, most people eat multi-pro, which is similar to spam. The government also sets up boundaries for the residents to stay inside of, and they are not allowed to go past these regulations or else the police will come. The government also takes care of supplies, and most residents just have to write down what they want and pay a bill. In terms of money, the government takes care of it as well each week. Each farm receives the same number of animals because government agents paid flat rates. When Harry finds the stock of grain, he notes that the government has enough to keep going for a few years. Television is also restricted to old movies, playing only on one channel from nine to eleven at night. Later, it is revealed that these restrictions are imposed to keep the people alive on the ark long enough until they can begin to expand civilization again. "
              },
              {
                "worker_id": "109",
                "uid": "002a1770011b49468bafff9ae55da261",
                "response_text": "Some of the government regulations included rationing the food. This included not being able to butcher their own meat,  but rather, having multi-pro. There was also a regulation about the type of farming allowed. Despite all the land, the government would pay the farmers for letting the fields remain empty as long as they only farm vegetables, and not wheat or corn. \n\nAdditionally, there are regulations on travel and gas. You were not able to go further than your neighbor's house. There is also an education regulation that says children should be at least 5 years and 9 months old before beginning to learn and read through a kindergarten book. "
              },
              {
                "worker_id": "112",
                "uid": "20d3bb17f533492799af849ff19c3e6e",
                "response_text": "The travel regulation restricts the area that people can travel to, which means their own houses and the closest neighbor's house. Whoever breaks the travel regulation will be sent to see the doctor. People buy their living necessities through delivery weekly by the rationing regulation. The farming regulations prohibit the plantation of wheat and corn, only allowing vegetables to be grown, resulting in many fields fallow. People would get compensated by the government for not planting wheat or corn. The rationing regulation allocates foods and living necessities for each family, regulates the supplies people can get, and prohibits people from butchering their livestock. Everyone has the same amount of livestock. Gas and water are also rationed that each family can only have a sink of water for dishes each day and a tub of bath water twice a week. The television regulation limits the channel to one, restricts the watching time to only nine to eleven at night, and constrains the audience to watch the listed movies only. Emergency Education Regulations claim that children should be at least five years nine months old to learn kindergarten books."
              },
              {
                "worker_id": "113",
                "uid": "269763cdcd3b4c869e40b5e31281774d",
                "response_text": "They cannot cultivate wheat and corn, and these fields are not in use. There are meat rations that significantly limit the amount of meat one household can consume. Harry also thinks about the travel regulations - he can't go further than Walt and Gloria Shanks' place. They live a little more than a mile away from Harry and Edna. There is gas rationing. The livestock is controlled by the government, too -  every household has the same number of chickens, sheep, cows, etc. We learn about the Emergency Education Regulations - every child should be five years nine months old before embarking on a kindergarten book. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4904,
        "document_length_chars": 27154
      }
    }
  ]
}