{
  "item_metadata": {
    "item_id": "51687",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "51687",
      "content": "THE SPY IN THE ELEVATOR\n \n \n By DONALD E. WESTLAKE\n \n Illustrated by WEST\n \n [Transcriber's Note: This etext was produced from Galaxy Magazine October 1961. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n He was dangerously insane. He threatened to destroy everything that was noble and decent—including my date with my girl!\n \n\n \n When the elevator didn't come, that just made the day perfect. A broken egg yolk, a stuck zipper, a feedback in the aircon exhaust, the window sticking at full transparency—well, I won't go through the whole sorry list. Suffice it to say that when the elevator didn't come, that put the roof on the city, as they say.\n \n It was just one of those days. Everybody gets them. Days when you're lucky in you make it to nightfall with no bones broken.\n \n But of all times for it to happen! For literally months I'd been building my courage up. And finally, just today, I had made up my mind to do it—to propose to Linda. I'd called her second thing this morning—right after the egg yolk—and invited myself down to her place. \"Ten o'clock,\" she'd said, smiling sweetly at me out of the phone. She knew why I wanted to talk to her. And when Linda said ten o'clock, she meant ten o'clock.\n \n Don't get me wrong. I don't mean that Linda's a perfectionist or a harridan or anything like that. Far from it. But she does have a fixation on that one subject of punctuality. The result of her job, of course. She was an ore-sled dispatcher. Ore-sleds, being robots, were invariably punctual. If an ore-sled didn't return on time, no one waited for it. They simply knew that it had been captured by some other Project and had blown itself up.\n \n Well, of course, after working as an ore-sled dispatcher for three years, Linda quite naturally was a bit obsessed. I remember one time, shortly after we'd started dating, when I arrived at her place five minutes late and found her having hysterics. She thought I'd been killed. She couldn't visualize anything less than that keeping me from arriving at the designated moment. When I told her what actually had happened—I'd broken a shoe lace—she refused to speak to me for four days.\n \n And then the elevator didn't come.\n \n \n\n \n Until then, I'd managed somehow to keep the day's minor disasters from ruining my mood. Even while eating that horrible egg—I couldn't very well throw it away, broken yolk or no; it was my breakfast allotment and I was hungry—and while hurriedly jury-rigging drapery across that gaspingly transparent window—one hundred and fifty-three stories straight down to slag—I kept going over and over my prepared proposal speeches, trying to select the most effective one.\n \n I had a Whimsical Approach: \"Honey, I see there's a nice little Non-P apartment available up on one seventy-three.\" And I had a Romantic Approach: \"Darling, I can't live without you at the moment. Temporarily, I'm madly in love with you. I want to share my life with you for a while. Will you be provisionally mine?\" I even had a Straightforward Approach: \"Linda, I'm going to be needing a wife for at least a year or two, and I can't think of anyone I would rather spend that time with than you.\"\n \n Actually, though I wouldn't even have admitted this to Linda, much less to anyone else, I loved her in more than a Non-P way. But even if we both had been genetically desirable (neither of us were) I knew that Linda relished her freedom and independence too much to ever contract for any kind of marriage other than Non-P—Non-Permanent, No Progeny.\n \n So I rehearsed my various approaches, realizing that when the time came I would probably be so tongue-tied I'd be capable of no more than a blurted, \"Will you marry me?\" and I struggled with zippers and malfunctioning air-cons, and I managed somehow to leave the apartment at five minutes to ten.\n \n Linda lived down on the hundred fortieth floor, thirteen stories away. It never took more than two or three minutes to get to her place, so I was giving myself plenty of time.\n \n But then the elevator didn't come.\n \n I pushed the button, waited, and nothing happened. I couldn't understand it.\n \n The elevator had always arrived before, within thirty seconds of the button being pushed. This was a local stop, with an elevator that traveled between the hundred thirty-third floor and the hundred sixty-seventh floor, where it was possible to make connections for either the next local or for the express. So it couldn't be more than twenty stories away. And this was a non-rush hour.\n \n I pushed the button again, and then I waited some more. I looked at my watch and it was three minutes to ten. Two minutes, and no elevator! If it didn't arrive this instant, this second, I would be late.\n \n It didn't arrive.\n \n I vacillated, not knowing what to do next. Stay, hoping the elevator would come after all? Or hurry back to the apartment and call Linda, to give her advance warning that I would be late?\n \n Ten more seconds, and still no elevator. I chose the second alternative, raced back down the hall, and thumbed my way into my apartment. I dialed Linda's number, and the screen lit up with white letters on black: PRIVACY DISCONNECTION.\n \n Of course! Linda expected me at any moment. And she knew what I wanted to say to her, so quite naturally she had disconnected the phone, to keep us from being interrupted.\n \n Frantic, I dashed from the apartment again, back down the hall to the elevator, and leaned on that blasted button with all my weight. Even if the elevator should arrive right now, I would still be almost a minute late.\n \n No matter. It didn't arrive.\n \n I would have been in a howling rage anyway, but this impossibility piled on top of all the other annoyances and breakdowns of the day was just too much. I went into a frenzy, and kicked the elevator door three times before I realized I was hurting myself more than I was hurting the door. I limped back to the apartment, fuming, slammed the door behind me, grabbed the phone book and looked up the number of the Transit Staff. I dialed, prepared to register a complaint so loud they'd be able to hear me in sub-basement three.\n \n I got some more letters that spelled: BUSY.\n \n \n\n \n It took three tries before I got through to a hurried-looking female receptionist \"My name is Rice!\" I bellowed. \"Edmund Rice! I live on the hundred and fifty-third floor! I just rang for the elevator and——\"\n \n \"The-elevator-is-disconnected.\" She said it very rapidly, as though she were growing very used to saying it.\n \n It only stopped me for a second. \"Disconnected? What do you mean disconnected? Elevators don't get disconnected!\" I told her.\n \n \"We-will-resume-service-as-soon-as-possible,\" she rattled. My bellowing was bouncing off her like radiation off the Project force-screen.\n \n I changed tactics. First I inhaled, making a production out of it, giving myself a chance to calm down a bit. And then I asked, as rationally as you could please, \"Would you mind terribly telling me why the elevator is disconnected?\"\n \n \"I-am-sorry-sir-but-that——\"\n \n \"Stop,\" I said. I said it quietly, too, but she stopped. I saw her looking at me. She hadn't done that before, she'd merely gazed blankly at her screen and parroted her responses.\n \n But now she was actually looking at me .\n \n I took advantage of the fact. Calmly, rationally, I said to her, \"I would like to tell you something, Miss. I would like to tell you just what you people have done to me by disconnecting the elevator. You have ruined my life.\"\n \n She blinked, open-mouthed. \"Ruined your life?\"\n \n \"Precisely.\" I found it necessary to inhale again, even more slowly than before. \"I was on my way,\" I explained, \"to propose to a girl whom I dearly love. In every way but one, she is the perfect woman. Do you understand me?\"\n \n She nodded, wide-eyed. I had stumbled on a romantic, though I was too preoccupied to notice it at the time.\n \n \"In every way but one,\" I continued. \"She has one small imperfection, a fixation about punctuality. And I was supposed to meet her at ten o'clock. I'm late! \" I shook my fist at the screen. \"Do you realize what you've done , disconnecting the elevator? Not only won't she marry me, she won't even speak to me! Not now! Not after this!\"\n \n \"Sir,\" she said tremulously, \"please don't shout.\"\n \n \"I'm not shouting!\"\n \n \"Sir, I'm terribly sorry. I understand your—\"\n \n \"You understand ?\" I trembled with speechless fury.\n \n She looked all about her, and then leaned closer to the screen, revealing a cleavage that I was too distraught at the moment to pay any attention to. \"We're not supposed to give this information out, sir,\" she said, her voice low, \"but I'm going to tell you, so you'll understand why we had to do it. I think it's perfectly awful that it had to ruin things for you this way. But the fact of the matter is—\" she leaned even closer to the screen—\"there's a spy in the elevator.\"\n \n \n\n II\n \n It was my turn to be stunned.\n \n I just gaped at her. \"A—a what?\"\n \n \"A spy. He was discovered on the hundred forty-seventh floor, and managed to get into the elevator before the Army could catch him. He jammed it between floors. But the Army is doing everything it can think of to get him out.\"\n \n \"Well—but why should there be any problem about getting him out?\"\n \n \"He plugged in the manual controls. We can't control the elevator from outside at all. And when anyone tries to get into the shaft, he aims the elevator at them.\"\n \n That sounded impossible. \"He aims the elevator?\"\n \n \"He runs it up and down the shaft,\" she explained, \"trying to crush anybody who goes after him.\"\n \n \"Oh,\" I said. \"So it might take a while.\"\n \n She leaned so close this time that even I, distracted as I was, could hardly help but take note of her cleavage. She whispered, \"They're afraid they'll have to starve him out.\"\n \n \"Oh, no!\"\n \n She nodded solemnly. \"I'm terribly sorry, sir,\" she said. Then she glanced to her right, suddenly straightened up again, and said,\n\"We-will-resume-service-as-soon-as-possible.\" Click. Blank screen.\n \n For a minute or two, all I could do was sit and absorb what I'd been told. A spy in the elevator! A spy who had managed to work his way all the way up to the hundred forty-seventh floor before being unmasked!\n \n What in the world was the matter with the Army? If things were getting that lax, the Project was doomed, force-screen or no. Who knew how many more spies there were in the Project, still unsuspected?\n \n Until that moment, the state of siege in which we all lived had had no reality for me. The Project, after all, was self-sufficient and completely enclosed. No one ever left, no one ever entered. Under our roof, we were a nation, two hundred stories high. The ever-present threat of other projects had never been more for me—or for most other people either, I suspected—than occasional ore-sleds that didn't return, occasional spies shot down as they tried to sneak into the building, occasional spies of our own leaving the Project in tiny radiation-proof cars, hoping to get safely within another project and bring back news of any immediate threats and dangers that project might be planning for us. Most spies didn't return; most ore-sleds did. And within the Project life was full, the knowledge of external dangers merely lurking at the backs of our minds. After all, those external dangers had been no more than potential for decades, since what Dr. Kilbillie called the Ungentlemanly Gentleman's War.\n \n Dr. Kilbillie—Intermediate Project History, when I was fifteen years old—had private names for every major war of the twentieth century. There was the Ignoble Nobleman's War, the Racial Non-Racial War, and the Ungentlemanly Gentleman's War, known to the textbooks of course as World Wars One, Two, and Three.\n \n The rise of the Projects, according to Dr. Kilbillie, was the result of many many factors, but two of the most important were the population explosion and the Treaty of Oslo. The population explosion, of course, meant that there was continuously more and more people but never any more space. So that housing, in the historically short time of one century, made a complete transformation from horizontal expansion to vertical. Before 1900, the vast majority of human beings lived in tiny huts of from one to five stories. By 2000, everybody lived in Projects. From the very beginning, small attempts were made to make these Projects more than dwelling places. By mid-century, Projects\n(also called apartments and co-ops) already included restaurants, shopping centers, baby-sitting services, dry cleaners and a host of other adjuncts. By the end of the century, the Projects were completely self-sufficient, with food grown hydroponically in the sub-basements, separate floors set aside for schools and churches and factories, robot ore-sleds capable of seeking out raw materials unavailable within the Projects themselves and so on. And all because of, among other things, the population explosion.\n \n And the Treaty of Oslo.\n \n It seems there was a power-struggle between two sets of then-existing nations (they were something like Projects, only horizontal instead of vertical) and both sets were equipped with atomic weapons. The Treaty of Oslo began by stating that atomic war was unthinkable, and added that just in case anyone happened to think of it only tactical atomic weapons could be used. No strategic atomic weapons. (A tactical weapon is something you use on the soldiers, and a strategic weapons is something you use on the folks at home.) Oddly enough, when somebody did think of the war, both sides adhered to the Treaty of Oslo, which meant that no Projects were bombed.\n \n Of course, they made up for this as best they could by using tactical atomic weapons all over the place. After the war almost the whole world was quite dangerously radioactive. Except for the Projects. Or at least those of them which had in time installed the force screens which had been invented on the very eve of battle, and which deflected radioactive particles.\n \n However, what with all of the other treaties which were broken during the Ungentlemanly Gentleman's War, by the time it was finished nobody was quite sure any more who was on whose side. That project over there on the horizon might be an ally. And then again it might not. Since they weren't sure either, it was risky to expose yourself in order to ask.\n \n And so life went on, with little to remind us of the dangers lurking Outside. The basic policy of Eternal Vigilance and Instant Preparedness was left to the Army. The rest of us simply lived our lives and let it go at that.\n \n \n\n \n But now there was a spy in the elevator.\n \n When I thought of how deeply he had penetrated our defenses, and of how many others there might be, still penetrating, I shuddered. The walls were our safeguards only so long as all potential enemies were on the other side of them.\n \n I sat shaken, digesting this news, until suddenly I remembered Linda.\n \n I leaped to my feet, reading from my watch that it was now ten-fifteen. I dashed once more from the apartment and down the hall to the elevator, praying that the spy had been captured by now and that Linda would agree with me that a spy in the elevator was good and sufficient reason for me to be late.\n \n He was still there. At least, the elevator was still out.\n \n I sagged against the wall, thinking dismal thoughts. Then I noticed the door to the right of the elevator. Through that door was the stairway.\n \n I hadn't paid any attention to it before. No one ever uses the stairs except adventurous young boys playing cops and robbers, running up and down from landing to landing. I myself hadn't set foot on a flight of stairs since I was twelve years old.\n \n Actually, the whole idea of stairs was ridiculous. We had elevators, didn't we? Usually, I mean, when they didn't contain spies. So what was the use of stairs?\n \n Well, according to Dr. Kilbillie (a walking library of unnecessary information), the Project had been built when there still had been such things as municipal governments (something to do with cities, which were more or less grouped Projects), and the local municipal government had had on its books a fire ordinance, anachronistic even then, which required a complete set of stairs in every building constructed in the city. Ergo, the Project had stairs, thirty-two hundred of them.\n \n And now, after all these years, the stairs might prove useful after all. It was only thirteen flights to Linda's floor. At sixteen steps a flight, that meant two hundred and eight steps.\n \n Could I descend two hundred and eight steps for my true love? I could. If the door would open.\n \n It would, though reluctantly. Who knew how many years it had been since last this door had been opened? It squeaked and wailed and groaned and finally opened half way. I stepped through to the musty, dusty landing, took a deep breath, and started down. Eight steps and a landing, eight steps and a floor. Eight steps and a landing, eight steps and a floor.\n \n On the landing between one fifty and one forty-nine, there was a smallish door. I paused, looking curiously at it, and saw that at one time letters had been painted on it. The letters had long since flaked away, but they left a lighter residue of dust than that which covered the rest of the door. And so the words could still be read, if with difficulty.\n \n I read them. They said:\n \n \n EMERGENCY ENTRANCE ELEVATOR SHAFT AUTHORIZED PERSONNEL ONLY KEEP LOCKED\n \n I frowned, wondering immediately why this door wasn't being firmly guarded by at least a platoon of Army men. Half a dozen possible answers flashed through my mind. The more recent maps might simply have omitted this discarded and unnecessary door. It might be sealed shut on the other side. The Army might have caught the spy already. Somebody in authority might simply have goofed.\n \n As I stood there, pondering these possibilities, the door opened and the spy came out, waving a gun.\n \n \n\n III\n \n He couldn't have been anyone else but the spy. The gun, in the first place. The fact that he looked harried and upset and terribly nervous, in the second place. And, of course, the fact that he came from the elevator shaft.\n \n Looking back, I think he must have been just as startled as I when we came face to face like that. We formed a brief tableau, both of us open-mouthed and wide-eyed.\n \n Unfortunately, he recovered first.\n \n He closed the emergency door behind him, quickly but quietly. His gun stopped waving around and instead pointed directly at my middle. \"Don't move!\" he whispered harshly. \"Don't make a sound!\"\n \n I did exactly as I was told. I didn't move and I didn't make a sound. Which left me quite free to study him.\n \n He was rather short, perhaps three inches shorter than me, with a bony high-cheekboned face featuring deepset eyes and a thin-lipped mouth. He wore gray slacks and shirt, with brown slippers on his feet. He looked exactly like a spy ... which is to say that he didn't look like a spy, he looked overpoweringly ordinary. More than anything else, he reminded me of a rather taciturn milkman who used to make deliveries to my parents' apartment.\n \n His gaze darted this way and that. Then he motioned with his free hand at the descending stairs and whispered, \"Where do they go?\"\n \n I had to clear my throat before I could speak. \"All the way down,\" I said.\n \n \"Good,\" he said—just as we both heard a sudden raucous squealing from perhaps four flights down, a squealing which could be nothing but the opening of a hall door. It was followed by the heavy thud of ascending boots. The Army!\n \n But if I had any visions of imminent rescue, the spy dashed them. He said, \"Where do you live?\"\n \n \"One fifty-three,\" I said. This was a desperate and dangerous man. I knew my only slim chance of safety lay in answering his questions promptly, cooperating with him until and unless I saw a chance to either escape or capture him.\n \n \"All right,\" he whispered. \"Go on.\" He prodded me with the gun.\n \n And so we went back up the stairs to one fifty-three, and stopped at the door. He stood close behind me, the gun pressed against my back, and grated in my ear, \"I'll have this gun in my pocket. If you make one false move I'll kill you. Now, we're going to your apartment. We're friends, just strolling along together. You got that?\"\n \n I nodded.\n \n \"All right. Let's go.\"\n \n We went. I have never in my life seen that long hall quite so empty as it was right then. No one came out of any of the apartments, no one emerged from any of the branch halls. We walked to my apartment. I thumbed the door open and we went inside.\n \n Once the door was closed behind us, he visibly relaxed, sagging against the door, his gun hand hanging limp at his side, a nervous smile playing across his lips.\n \n I looked at him, judging the distance between us, wondering if I could leap at him before he could bring the gun up again. But he must have read my intentions on my face. He straightened, shaking his head. He said, \"Don't try it. I don't want to kill you. I don't want to kill anybody, but I will if I have to. We'll just wait here together until the hue and cry passes us. Then I'll tie you up, so you won't be able to sic your Army on me too soon, and I'll leave. If you don't try any silly heroics, nothing will happen to you.\"\n \n \"You'll never get away,\" I told him. \"The whole Project is alerted.\"\n \n \"You let me worry about that,\" he said. He licked his lips. \"You got any chico coffee?\"\n \n \"Yes.\"\n \n \"Make me a cup. And don't get any bright ideas about dousing me with boiling water.\"\n \n \"I only have my day's allotment,\" I protested. \"Just enough for two cups, lunch and dinner.\"\n \n \"Two cups is fine,\" he said. \"One for each of us.\"\n \n \n\n \n And now I had yet another grudge against this blasted spy. Which reminded me again of Linda. From the looks of things, I wasn't ever going to get to her place. By now she was probably in mourning for me and might even have the Sanitation Staff searching for my remains.\n \n As I made the chico, he asked me questions. My name first, and then,\n\"What do you do for a living?\"\n \n I thought fast. \"I'm an ore-sled dispatcher,\" I said. That was a lie, of course, but I'd heard enough about ore-sled dispatching from Linda to be able to maintain the fiction should he question me further about it.\n \n Actually, I was a gymnast instructor. The subjects I taught included wrestling, judo and karati—talents I would prefer to disclose to him in my own fashion, when the time came.\n \n He was quiet for a moment. \"What about radiation level on the ore-sleds?\"\n \n I had no idea what he was talking about, and admitted as much.\n \n \"When they come back,\" he said. \"How much radiation do they pick up? Don't you people ever test them?\"\n \n \"Of course not,\" I told him. I was on secure ground now, with Linda's information to guide me. \"All radiation is cleared from the sleds and their cargo before they're brought into the building.\"\n \n \"I know that,\" he said impatiently. \"But don't you ever check them before de-radiating them?\"\n \n \n\n \n \"No. Why should we?\"\n \n \"To find out how far the radiation level outside has dropped.\"\n \n \"For what? Who cares about that?\"\n \n He frowned bitterly. \"The same answer,\" he muttered, more to himself than to me. \"The same answer every time. You people have crawled into your caves and you're ready to stay in them forever.\"\n \n I looked around at my apartment. \"Rather a well-appointed cave,\" I told him.\n \n \"But a cave nevertheless.\" He leaned toward me, his eyes gleaming with a fanatical flame. \"Don't you ever wish to get Outside?\"\n \n Incredible! I nearly poured boiling water all over myself. \"Outside? Of course not!\"\n \n \"The same thing,\" he grumbled, \"over and over again. Always the same stupidity. Listen, you! Do you realize how long it took man to get out of the caves? The long slow painful creep of progress, for millennia, before he ever made that first step from the cave?\"\n \n \"I have no idea,\" I told him.\n \n \"I'll tell you this,\" he said belligerently. \"A lot longer than it took for him to turn around and go right back into the cave again.\" He started pacing the floor, waving the gun around in an agitated fashion as he talked. \"Is this the natural life of man? It is not. Is this even a desirable life for man? It is definitely not.\" He spun back to face me, pointing the gun at me again, but this time he pointed it as though it were a finger, not a gun. \"Listen, you,\" he snapped.\n\"Man was progressing. For all his stupidities and excesses, he was growing up. His dreams were getting bigger and grander and better all the time. He was planning to tackle space ! The moon first, and then the planets, and finally the stars. The whole universe was out there, waiting to be plucked like an apple from a tank. And Man was reaching out for it.\" He glared as though daring me to doubt it.\n \n \n\n \n I decided that this man was doubly dangerous. Not only was he a spy, he was also a lunatic. So I had two reasons for humoring him. I nodded politely.\n \n \"So what happened?\" he demanded, and immediately answered himself.\n\"I'll tell you what happened! Just as he was about to make that first giant step, Man got a hotfoot. That's all it was, just a little hotfoot. So what did Man do? I'll tell you what he did. He turned around and he ran all the way back to the cave he started from, his tail between his legs. That's what he did!\"\n \n To say that all of this was incomprehensible would be an extreme understatement. I fulfilled my obligation to this insane dialogue by saying, \"Here's your coffee.\"\n \n \"Put it on the table,\" he said, switching instantly from raving maniac to watchful spy.\n \n I put it on the table. He drank deep, then carried the cup across the room and sat down in my favorite chair. He studied me narrowly, and suddenly said, \"What did they tell you I was? A spy?\"\n \n \"Of course,\" I said.\n \n He grinned bitterly, with one side of his mouth. \"Of course. The damn fools! Spy! What do you suppose I'm going to spy on?\"\n \n He asked the question so violently and urgently that I knew I had to answer quickly and well, or the maniac would return. \"I—I wouldn't know, exactly,\" I stammered. \"Military equipment, I suppose.\"\n \n \"Military equipment? What military equipment? Your Army is supplied with uniforms, whistles and hand guns, and that's about it.\"\n \n \"The defenses—\" I started.\n \n \"The defenses,\" he interrupted me, \"are non-existent. If you mean the rocket launchers on the roof, they're rusted through with age. And what other defenses are there? None.\"\n \n \"If you say so,\" I replied stiffly. The Army claimed that we had adequate defense equipment. I chose to believe the Army over an enemy spy.\n \n \"Your people send out spies, too, don't they?\" he demanded.\n \n \"Well, of course.\"\n \n \"And what are they supposed to spy on?\"\n \n \"Well—\" It was such a pointless question, it seemed silly to even answer it. \"They're supposed to look for indications of an attack by one of the other projects.\"\n \n \"And do they find any indications, ever?\"\n \n \"I'm sure I don't know,\" I told him frostily. \"That would be classified information.\"\n \n \"You bet it would,\" he said, with malicious glee. \"All right, if that's what your spies are doing, and if I'm a spy, then it follows that I'm doing the same thing, right?\"\n \n \"I don't follow you,\" I admitted.\n \n \"If I'm a spy,\" he said impatiently, \"then I'm supposed to look for indications of an attack by you people on my Project.\"\n \n I shrugged. \"If that's your job,\" I said, \"then that's your job.\"\n \n He got suddenly red-faced, and jumped to his feet. \"That's not my job, you blatant idiot!\" he shouted. \"I'm not a spy! If I were a spy, then that would be my job!\"\n \n \n\n \n The maniac had returned, in full force. \"All right,\" I said hastily.\n\"All right, whatever you say.\"\n \n He glowered at me a moment longer, then shouted, \"Bah!\" and dropped back into the chair.\n \n He breathed rather heavily for a while, glaring at the floor, then looked at me again. \"All right, listen. What if I were to tell you that I had found indications that you people were planning to attack my Project?\"\n \n I stared at him. \"That's impossible!\" I cried. \"We aren't planning to attack anybody! We just want to be left in peace!\"\n \n \"How do I know that?\" he demanded.\n \n \"It's the truth! What would we want to attack anybody for?\"\n \n \"Ah hah!\" He sat forward, tensed, pointing the gun at me like a finger again. \"Now, then,\" he said. \"If you know it doesn't make any sense for this Project to attack any other project, then why in the world should you think they might see some advantage in attacking you ?\"\n \n I shook my head, dumbfounded. \"I can't answer a question like that,\" I said. \"How do I know what they're thinking?\"\n \n \"They're human beings, aren't they?\" he cried. \"Like you? Like me? Like all the other people in this mausoleum?\"\n \n \"Now, wait a minute—\"\n \n \"No!\" he shouted. \"You wait a minute! I want to tell you something. You think I'm a spy. That blundering Army of yours thinks I'm a spy. That fathead who turned me in thinks I'm a spy. But I'm not a spy, and I'm going to tell you what I am.\"\n \n I waited, looking as attentive as possible.\n \n \"I come,\" he said, \"from a Project about eighty miles north of here. I came here by foot, without any sort of radiation shield at all to protect me.\"\n \n The maniac was back. I didn't say a word. I didn't want to set off the violence that was so obviously in this lunatic.\n \n \"The radiation level,\" he went on, \"is way down. It's practically as low as it was before the Atom War. I don't know how long it's been that low, but I would guess about ten years, at the very least.\" He leaned forward again, urgent and serious. \"The world is safe out there now. Man can come back out of the cave again. He can start building the dreams again. And this time he can build better, because he has the horrible example of the recent past to guide him away from the pitfalls. There's no need any longer for the Projects.\"\n \n And that was like saying there's no need any longer for stomachs, but I didn't say so. I didn't say anything at all.\n \n \"I'm a trained atomic engineer,\" he went on. \"In my project, I worked on the reactor. Theoretically, I believed that there was a chance the radiation Outside was lessening by now, though we had no idea exactly how much radiation had been released by the Atom War. But I wanted to test the theory, and the Commission wouldn't let me. They claimed public safety, but I knew better. If the Outside were safe and the Projects were no longer needed, then the Commission was out of a job, and they knew it.",
      "metadata": {
        "title": "The Spy in the Elevator",
        "author": "Donald E. Westlake",
        "passage_id": "51687",
        "uid": "d66eb3f2a6ba492a999110101fcc9b07",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "2",
                "uid": "5ba05cf019a04334ad6d71a38d6de78d",
                "response_text": "      It was one of those days when everything that could go wrong, goes wrong. Edmund Rice, the main character, has decided to propose to his girlfriend, Linda on the day when the story takes place, but at breakfast, he broke his egg yolk; he had a stuck zipper; he had feedback in the aircon exhaust; and his window stuck at full transparency. On top of all that, the elevator is late. Edmund’s girlfriend is a dispatcher for ore-sled robots; when one doesn’t return on time, they know that the robot has been been captured and therefore blown itself up. As a result, Linda is a real stickler for punctuality because if Edmund is late, as he was once before, she goes into hysterics thinking that something horrible has happened to him. \n     When the elevator doesn’t come, Edmund goes back to his apartment to call Linda to let her know why he will be late, but she has set her phone not to accept calls since she was expecting Edmund to come propose to her. Edmund decides to complain to the Transit Staff, who give him the official statement that the elevator is disconnected, but when Edmund explains that the late elevator is ruining his life, the operator takes pity on him and secretly tells him there is a spy on the elevator who won’t get off, and the Army might have to starve him to make him exit. Finally, at 10:15, Edmund thinks of taking the stairs, but when he does, the spy intercepts him, forcing him at gunpoint back to Edmund’s apartment. At this point, Edmund gives up on reaching Linda.\n     The spy tells Edmund he doesn’t want to hurt him and begins a conversation, asking what Edmund does for a living. Because Edmund doesn’t want the spy to know that he teaches gymnastics and knows wrestling, judo, and karati, he lies and tells him he is an ore-sled operator, figuring he can pull off the ruse since he knows a lot about Linda’s job. This piques the spy’s interest, and he asks what Edmund knows about the radiation level of the ore-sleds when they return. Edmund says they don’t check for radiation before de-radiating the sled; there’s no point. The spy is irritated that Edmund doesn’t even care about the radiation level outside the Project and compares the Projects to caves. \nThe spy goes on to tell Edmund he isn’t a spy, that he is an atomic engineer from a Project 80 miles north. He traveled to Edmund’s Project on foot without any kind of radiation shield to prove that the radiation level is so low that it is safe for people to leaves the Projects. He is trying to get the word out, but people don’t believe him because their Commissions tell them the radiation level is still high and that it isn’t safe to go outside. Edmund thinks the man is a lunatic and doesn’t believe any of the ludicrous claims he makes.\n"
              },
              {
                "worker_id": "6",
                "uid": "3f46b95abb434ddf8e25a29d51c53dea",
                "response_text": "Edmund Rice lives in one of the Projects and has finally decided to propose to his girlfriend for a Non-P marriage. He set the time with her before, 10 o’clock sharp, and prepared himself that morning. He steps outside his apartment with a few minutes to spare but soon realizes that the elevator isn’t working. He waits for a minute or two, starting to freak out, then rushes inside to call Linda and warn her. She hates tardiness because of her job as an ore-sled dispatcher, and he didn’t want to upset her on the big day. Her landline was disconnected for privacy’s sake, so he couldn’t let her know. He runs back to the elevator and keeps trying, but to no avail. Officially late, he goes back to his apartment and calls the Transit Staff. A young woman picks up and robotically tells him that the elevator will be back in service soon. He yells at her, eventually explaining why she has ruined his life, and she responds sympathetically, clearly a romantic. She leans forward and tells him the truth: there’s a spy in the elevator. He is in shock, but she explains the whole situation and how they’re worried they’ll have to starve him out. Finished, she hangs up, and Edmund runs back to the elevator in the hopes that they successfully removed him. \nHe is saddened to find it still not working, so he decides to take the stairs, which no one does. A few landings down, he sees a door with faint lettering on it, explaining that this once led to the elevator shaft. He wonders briefly why no one is guarding it, and then suddenly the spy comes out of the door. The spy holds a gun up to his head and tells him to stay quiet and take him back to his room. They return to the 153rd floor, and Edmund harbors him in his apartment. The spy asks for a cup of Chico coffee, which saddens Edmund as he only gets two cups a day. Edmund lies about his identity and pretends he’s an ore-sled dispatcher, like Linda. He is, in fact, a gymnast instructor with martial arts abilities, but he wants to have the advantage of surprise should the situation take a violent turn. \nThey chat while Edmund makes him the coffee, and the spy grows agitated and manic. He tries to explain to Edmund that he’s not really a spy. He actually came from another Project 80 miles away on foot. He is the proof that the radiation levels outside have dramatically decreased, making it safe for humans to go outside again. However, the Commission doesn’t want the world to know that as then they would quickly go out of business. The spy reveals he’s an atomic engineer, and the story ends on a slight cliffhanger. \n"
              },
              {
                "worker_id": "8",
                "uid": "4f3b0ec4861841e5aabff37228fe5716",
                "response_text": "In the years following World War III, atomic radiation and rapid population growth had led nations to develop vertically rather than horizontally, and people lived together in massive high-rises called Projects where they could live, work, and play while never having to go Outside and face the dangers of radiation. Only ore-sleds and spies leave the buildings--the ore-sleds to gather essential raw materials impossible to produce in the Projects, and the spies to visit other Projects to learn about potential attacks on their home Project. Edmund Rice is a gymnast instructor who lives on the hundred fifty-third floor of one of these Projects. He plans to propose Non-Permanent marriage to his girlfriend Linda, who is an ore-sled dispatcher obsessed with punctuality. The morning of his planned proposal, set for 10:00 sharp, Edmund goes to the elevator to travel down to Linda's hundred fortieth floor and discovers the elevator is unresponsive. He continues pressing the button to no avail. He runs back to his apartment to alert Linda and discovers her phone has a \"privacy disconnection\" notice, probably placed because Linda expected Edmund's proposal. When the elevator continuously fails to arrive, Edmund calls the Transit Staff to inquire what is going wrong. The staff person informs him that a spy has penetrated the Project force-screen and is barricading himself in the elevator. Using manual controls, the spy wields the elevator like a projectile weapon against any soldier that approaches. Stunned, Edmund makes a last-ditch effort to reach Linda. He uses the stairs, an option he hasn't taken since he was a young child. A few flights down, he sees an emergency exit from the elevator, and the spy emerges from it. The spy holds him at gun point and leads him back to his apartment, where the two men share a coffee. The spy reveals he is not a spy at all; rather, he is a trained atomic engineer who claims radiation levels have reduced to such an extent that people may now safely venture Outside. The reason this is not common knowledge is because the Commission suppresses the truth so that is may keep making money from the continued operation of the Projects."
              },
              {
                "worker_id": "10",
                "uid": "a25db6ceb09b4ed688b823115f72c336",
                "response_text": "Some time after the year 2100, humans live in vertical buildings called Projects that are completely isolated from each other and nations unto themselves. Decades ago, the Ungentlemanly Gentleman's War involved so much atomic bombing that the radiation levels outside are said to be too unsafe for humans. The Projects are all suspicious of each other, supposedly sending spies out to see whether attacks are being planned. There hasn’t been an attack in decades, and the external threats largely just exist as fears in the minds of the people.\nEdmund Rice leaves his 153rd floor apartment in his Project at five minutes to ten to propose to an ore-sled dispatcher who lives on the 144th floor that he is deeply in love with named Linda. He plans to propose a Non-P marriage (Non-Permanent, No Progeny) since neither of them are genetically desirable enough to have children in their society, and he knows that Linda wants to keep her independence. The ten o’clock time of the appointment is significant because Linda is so punctual that Edmund believes she will not marry him if he is late. However, the elevator is not working and does not respond to pressing the button and kicking the door. Becoming frantic, he runs back to his apartment and calls Linda, but she does not answer. She likely disconnected her phone because she wanted to have no interruptions when Edmund arrived. He furiously calls the Transit Staff to file a complaint, and tells the woman that his life has been ruined. She feels bad for him and tells him secret information that there is a spy in the elevator and that the Army thinks they may have to starve him out. Edmund then realizes he can take an ancient thing called the stairs. He rushes to the staircase even though it is already quarter past ten and races down. He spots a door to the elevator shaft on the landing between the 150th and 149th floors, and a man -the spy- bursts out of it. The spy uses a gun to threaten Edmund and forces him to take them both back to hide in Edmund’s apartment to lose the Army that had been racing up the stairs behind them. In the apartment, the spy asks Edmund to make him a cup of coffee and begins a conversation, acting like a maniac in Edmund’s perception at times. The spy reveals he is an atomic engineer who worked on the reactor in his own Project. He calculated that the radiation from the war decades ago must have subsided, and it would be safe for humans to leave the Projects and resume progress on other advances like space travel. The Commission would not let him test the theory, so he risked his life by traveling outside to determine if it was indeed true. His survival of the crossing is proof that the radiation is low enough for humans to survive outside, and Edmund can hardly believe what he is hearing."
              }
            ]
          },
          {
            "question_text": "Who is Linda, and what is her significance in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "2",
                "uid": "5ba05cf019a04334ad6d71a38d6de78d",
                "response_text": "     Linda is the woman to whom Edmund intends to propose. She is the reason Edmund is trying to get on the elevator and why he ultimately decides to take the stairs, leading him to meet the spy. Linda’s job as an ore-sled operator has left her high-strung when it comes to punctuality. She sends robots out with ore-sleds, and when they don’t return on time, they know that the robot has been captured and has blown itself up to prevent other Projects from learning their technology secrets. Once when Edmund was late for a date with her, Linda worked herself into hysterics, and when he did show up, she refused to speak to Edmund for four days. \n\tEdmund has spent months building up the courage to propose to Linda, and the day he plans to do it, everything goes awry, making him run late. But he still reaches the elevator in time to reach Linda’s place thirteen stories below his level on time, except the elevator doesn’t come. The longer he waits for the elevator car, the more anxious Edmund grows, knowing that Linda will be so upset if he is late he won’t get to propose.\n\tEdmund loves Linda and would like to have a permanent marriage, but he realizes that Linda enjoys her freedom and independence too much to agree to a permanent marriage. Edmund will settle for a Non-P marriage with her: Non-Permanent, No Progeny. \n\tLinda anticipates Edmund’s proposal when he calls that morning to invite himself to her apartment. He can tell by her smile on the phone. In preparation for the proposal, Linda has set her phone to PRIVACY DISCONNECTION to prevent their proposal from being interrupted, but this also means that Edmund cannot reach her to let her know he is running late and why. Edmund is convinced that she won’t speak to him again after being late for the proposal and certainly will not accept his proposal. In a last-ditch effort to reach Linda, Edmund decides he can take 208 stairs to reach her, even though he hasn’t taken the stairs since he was 12 years old. This decision, of course, puts him in the path to run into the spy.\n\tFinally, Linda’s job helps Edmund believe he can overtake the spy if he can catch him off guard. Edmund knows enough about her job to talk about it with the spy, keeping his knowledge of wrestling, judo, and karate secret until he can make his move.\n"
              },
              {
                "worker_id": "6",
                "uid": "3f46b95abb434ddf8e25a29d51c53dea",
                "response_text": "Linda is Edmund Rice’s fianceé-to-be and current girlfriend. They have been together presumably for quite some time, as he knows quite a bit about her. Her one flaw, as he likes to say, is her absolute adherence to punctuality. Edmund recalls when he was late to meet her by a few minutes, and she broke down in tears thinking he had died. Her adherence comes from her job as an ore-sled dispatcher; when an ore-sled doesn’t return, it means the sled has been captured or destroyed. Linda is a very independent woman and, according to Edmund, would never into a long-term marriage, only a Non-P marriage (Non-Permanent and No Progeny). \nLinda is significant to the story because she provides the basis for conflict. Edmund is on his way to propose to Linda when he realizes the elevator is stuck. He realizes he will be late and freaks out, which leads him on the path to running into the so-called spy. \n"
              },
              {
                "worker_id": "8",
                "uid": "4f3b0ec4861841e5aabff37228fe5716",
                "response_text": "Linda is Edmund Rice's girlfriend who works as an ore-dispatcher at the same Project where Edmund lives. She lives on Floor 140 while Edmund lives on 153, and he frequently visits her using the local elevator. Due to the nature of her work, Linda has developed an obsession with punctuality, and she cannot handle the smallest deviation from set appointment times. Once, she and Edmund had first started dating, Edmund arrived at her apartment five minutes late to find Linda in complete hysterics; she thought Edmund had been killed. When Edmund explained he had simply been late, she didn't speak to him for four days. This explains Edmund's panic when the elevator fails to arrive the morning he plans to propose to Linda at 10:00 precisely. Linda anticipates the proposal, so she switches her phone to \"privacy disconnection\" mode in order to prevent them from being disturbed when Edmunds pops the question. Although Edmund will not admit that he loves Linda in more than a Non-Permanent way, he understands that Linda cherishes her freedom and independence, so he plans for his proposal to be of the Non-Permanent, No Progeny variety."
              },
              {
                "worker_id": "10",
                "uid": "a25db6ceb09b4ed688b823115f72c336",
                "response_text": "Linda is an ore-sled dispatcher, and after three years working in the profession has become quite obsessed with punctuality. If the ore-sleds aren’t on time, nobody waits for them. They are assumed to be blown up or captured by other Projects. She does not accept tardiness with ease, and once gave Edmund Rice the silent treatment for four days when he was late to meet her. She is in a relationship with Edmund, and expects that he will propose marriage to her when he tells her he has something important to talk about. \nShe is significant to the story because her punctuality places great stress on Edmund when he knows he will be late. This causes him to frantically panic when the elevator is not working, and resort to using the stairwell to attempt to meet with her before their relationship deteriorates beyond repair. Linda’s reaction to tardiness is very strict, evidenced when Edmund describes to the Transit Staff when he files a complaint about the elevator that they have ruined his life and that Linda will no longer speak to him or even consider marrying him. Because Linda means so much to Edmund, he continues to try to get to her even when he knows he is over 15 minutes late. Trying the stairwell as his final effort to be with Linda causes him to run into the spy escaping the elevator shaft, which is the climax of the story. It is not revealed what happens between Linda and Edmund in the end.\n"
              }
            ]
          },
          {
            "question_text": "Describe the physical and social settings of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "2",
                "uid": "5ba05cf019a04334ad6d71a38d6de78d",
                "response_text": "The story takes place some time after the year 2100, after World Wars I, II, and III have been fought. Due to the population explosion, by 2000, everyone lived in Projects. These Projects are vertically expanded buildings housing people on floors numbering up to two hundred; the Projects are self-contained and self-sufficient. The people in them do not have to go outside where they fear radiation from atomic bombs used in the wars still exists. The Projects provide restaurants, shopping centers, baby-sitting services, dry cleaners, schools, churches, factories, etc. Food is grown hydroponically. The Projects are protected by force screens that deflect the radiation and all have their own armies that are supposed to protect them from spies from other Projects.\n\tThe Projects have advanced technology. Telephones have visual capability that allows callers to see each other; this is how Edmund knows that Linda anticipates his proposal. They have robots that mine and collect ore using ore-sleds. The robots are equipped to self-detonate if they are captured. \n\tThe Projects are suspicious of each other because so many treaties were broken during the Ungentlemanly Gentleman’s War, so Projects aren’t willing to expose themself to the possible dangers of reaching out or allying with other Projects. The Army practices Eternal Vigilance and Instant Preparedness in case of danger, allowing the people in the Projects to just live their lives.The Treaty of Oslo provides a sense of safety because it means that Projects will not be bombed in case of war.\n\tSocially, not all marriages are intended to be permanent, especially if the couple is not genetically desirable. There is a Non-P marriage option in this case: Non-Permanent and No Progeny. In Non-P marriages, people contract to marry for a short term, such as one or two years. People are also scared of strangers; hence, the man in the elevator is deemed a spy before anyone even speaks with him.\n"
              },
              {
                "worker_id": "6",
                "uid": "3f46b95abb434ddf8e25a29d51c53dea",
                "response_text": "The Spy in the Elevator by Donald E. Westlake takes place in the century after the year 2000. After the third of the Ungentelamnly Wars, AKA World War III, Earth was scorched and full of radiation. The remaining population moved into self-sustaining Projects that feature 200+ floors of residential housing, churches, gyms, cafés, and even a hydroponic farm in the basement. Humans were locked away due to the deadly levels of radiation outside due to the tactical atomic bombings. Each Project defends itself with an Army and various equipment as no one is sure whether or not another Project will attack. \nThe Project that Edmund Rice and Linda live in has 200 floors and features all the normal amenities. The elevator, however, is the main source of travel, and no one uses the stairs anymore. Edmund’s room is modest, and he receives a small supply of food daily to prevent any waste. \n"
              },
              {
                "worker_id": "8",
                "uid": "4f3b0ec4861841e5aabff37228fe5716",
                "response_text": "The Projects had been developed as a result of population booms and the Treaty of Oslo following Word War III, cheekily called the Ungentlemanly Gentleman's War by Edmunds Intermediate Project History teacher Dr. Kilbillie. Prior to 1900, everyone lived in small, one-to-five-story homes. By the year 2000, everyone lived in the giant high-rises called Projects, also known as apartments or co-ops. The Projects were several hundred stories tall and were essential compact nations that included restaurants, shopping centers, baby-sitting services, dry cleaners, etc. Eventually, the Projects became self-sustaining and added schools, churches, factories, robot ore-sleds, etc. The Treaty of Oslo disallowed deployment of strategic atomic weapons and only permitted the use of tactical weapons, which resulted in the world's current state of omnipresent radiation. In the years since, no one has left the buildings to go Outside, except the ore-sleds that seek out raw materials and the spies that invade the protective force-screens to seek out information about potential attacks from other Projects. The residents have developed a level of comfort with life in the Projects, even though they are only allotted a certain amount of food each day and can never leave. Later, the \"spy\" posits that the residents are being fed lies by the Commission, which runs the Projects and profits from their operation.\n"
              },
              {
                "worker_id": "10",
                "uid": "a25db6ceb09b4ed688b823115f72c336",
                "response_text": "After the year 2100, humans live in Projects, which are self-sufficient vertical buildings that essentially govern themselves. Raw materials come in and out on ore-sleds and the humans in the Projects have no contact with the outside world. Vertical living became the norm because population explosion meant there was no more horizontal space for people to expand into. Then, with the onset of nuclear warfare in the Ungentlemanly Gentleman's War, the only safety for the public was to stay inside their residence in the Projects because of the Treaty of Oslo, which stipulates that in this era of atomic weapons, civilians are not to be targeted.\nThere has been so much atomic bombing that the radiation levels outside are said to be too unsafe for humans to endure. The Projects are suspicious of each other planning attacks, and there is high alert for spies from nearby projects infiltrating the building. The people within the Projects live in fear of atomic attacks, though they do not question the accuracy of what they have been told. There hasn’t been an attack in decades, and this threat is largely now just a fear in the minds of the people. They go on with their daily lives, not checking to see if the radiation from the outside remains too high to go outdoors, but just believing what they are told. \nIn one Project, on the 153rd floor lives Edmund Rice in a nicely appointed apartment building, with a video calling service he can use to dial other residents and the building Transit Staff, and he receives allotted rations of food just as all of the other residents do. The love of his life that he wishes to propose Non-P marriage to, Linda, lives on the 144th floor of the same building. There is a local elevator that serves the higher floors that Edmund frequently uses, though it is out of order due to a spy jamming its controls and hiding inside it. There is a stairwell next to the elevator, and on a landing between the 150th and 149th floor there is a small door to the elevator shaft. \nThe spy - an atomic engineer from a neighboring Project - has discovered that the radiation is actually low outside and it is now safe for humans to venture out. However, for Edmund and many others, the Project is all that they know, and the idea of going outside is radically against what they have been conditioned to believe.\n"
              }
            ]
          },
          {
            "question_text": "What is the significance of the spy in the elevator?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "2",
                "uid": "5ba05cf019a04334ad6d71a38d6de78d",
                "response_text": "The spy thwarts Edmund’s planned proposal to Linda, but on a larger scale, he threatens the entire way of life in the Projects. The spy in the elevator isn’t really a spy, but the Army claims he is. It is in the interest of the Army and the Commissions of the Projects for people to believe that the radiation level outside the Projects is too high for people to survive because keeping people fearful keeps them in the Projects and needful of the Army and Commission. The people in the Projects are taught to be fearful of other Projects who might come and try to learn their secrets, military, technology, or otherwise. The Army is trying to capture the spy who has holed himself up in the elevator and is planning to starve him out if necessary. The spy uses logic to try to convince Edmund that he isn’t really a spy, that the Projects don’t really need to worry about spies, and that the Projects aren’t really needed at all.\n\tThe spy is actually an atomic engineer from a Project about 80 miles north of Edmund’s. He suspected that the radiation levels after the atomic war have dropped low enough to be safe for people to go outside the Projects. When he asks his Commission to be allowed to study this, he is refused. The Commission knows that if people can leave the Projects, there would be no need for the Commission. To secretly test his theory, the spy left his Project and walked all the way to Edmund’s project without a radiation shield. He is fine, and he is trying to convince the people in the Projects that it is safe to go outside; he compares the Projects to caves and the people to cavemen. He claims that the Projects are stunting society’s progress by keeping everyone “locked down.”\n\n"
              },
              {
                "worker_id": "6",
                "uid": "3f46b95abb434ddf8e25a29d51c53dea",
                "response_text": "The first conflict is caused by the spy in the elevator, as he prevents Edmund from visiting and therefore proposing to Linda on time. This causes a chain of events that leads to their eventual meeting and Edmund’s partial captivity. While he harbors the alleged spy in his room after running into him on the stairwell, the spy reveals that he is not a spy at all. He came from a Project 80 miles away and walked to this one on foot. He claims the radiation levels are back to a healthy level and that they have been for years. He believes that the Commission is hiding the truth from people, because, if they knew, the Projects would go out of business, as people are not allowed to leave them for their own health and safety. "
              },
              {
                "worker_id": "8",
                "uid": "4f3b0ec4861841e5aabff37228fe5716",
                "response_text": "When Edmund realizes the unmoving elevator is going to make him late for his proposal to Linda, he calls the Transit Staff. The staff person reveals to Edmund that a spy has barricaded himself in the elevator and with the help of manual controls is using it as a projectile against anyone who tries to get near him. Edmund had heard of spies going between Projects to try to learn information about any planned attacks, but he is surprised and scared to discover that a spy has managed to penetrate his Project's force-screen. He wonders what this will mean for the overall safety of the Project, but he doesn't dwell on this too long because he still needs to get to Linda. He makes his way down the stairs and encounters a small door, which turns out to be an emergency exit from the elevator shaft. The spy opens the shaft and orders Edmund to lead him back to his apartment at gunpoint. In the apartment, the spy demands coffee, and the two men talk. Edmund claims to be an ore-sled dispatcher, and the spy inquires if the dispatchers check radiation levels when the sleds return from a supply run. Edmund scoffs at this idea, claiming that there would be no point in doing so since the radiation is purged prior to entering the force-screen. The spy reveals himself to be an atomic engineer and tells Edmund that the Project defenses, as well as the claims of toxic radiation levels Outside, are nothing more than a smokescreen, a way to keep the residents of the Projects content to live inside and never venture out. He posits the Commission is responsible for this deception because they want to continue profiting from the operation of the Projects."
              },
              {
                "worker_id": "10",
                "uid": "a25db6ceb09b4ed688b823115f72c336",
                "response_text": "The spy is discovered on the 147th floor of Edmund’s building, and runs into the elevator before the Army can catch him. The spy plugs the manual controls of the elevator so that he can’t be caught, and runs the elevator up and down the shaft if anyone tries to enter the car through the shaft. After he bursts out of the elevator shaft door into the stairwell and forces Edmund to take him back to his apartment to hide, we learn the real story of the spy. He is actually an atomic engineer from another Project where he was in charge of their reactor. He thought the radiation from the war decades ago would likely be so low now that it would be safe for humans to leave the Projects and go outside. However, the Commission would not let him test the theory, so he risked his life to travel to a nearby Project to find out for himself. Because he survived the crossing outside, it is now safe for humans to resume activities outside. This is very significant, because Edmund’s conditioning has him believe that there is no reason to question why they can’t go outside and that there is not going to be a life outside the Project. The spy gives Edmund a reason to believe that what he has been told by the Commission is untrue. Also, the ability of the spy to penetrate so deeply into the project undetected is a significant concern to Edmund, who considers the reliability of the safeguards to keep the people safe from outside enemies.\n"
              }
            ]
          },
          {
            "question_text": "Who is Edmund Rice, and what happens to him in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "2",
                "uid": "5ba05cf019a04334ad6d71a38d6de78d",
                "response_text": "Edmund is eager to propose to his girlfriend. He truly loves her and would like a long marriage, but he is willing to settle for a Non-P marriage since he knows she values her freedom and independence. After gathering the courage to propose, he makes a date with her one morning, but multiple minor calamities make him run late. Linda is a stickler for punctuality, so on this morning, it is especially important to be on time. When he makes it to the elevator with five minutes to spare, his proposal is thwarted because a spy is holding it up. When he tries to call Linda to let her know he is running late, he can’t get the call through because she has set her phone not to be disturbed. When he learns that a spy is holding up the elevator and might be in there until the Army can starve him out, he decides to brave the 208 stairs down to Linda’s apartment, only to run into the spy there. The spy forces Edmund back to his apartment, where he explains he is not really a spy and that the radiation levels outside are so low it is safe for everyone to leave the projects. Edmund is sure the man is a lunatic despite the logic of his argument. He realizes that his chance to marry Linda is gone; she will never forgive him for being late."
              },
              {
                "worker_id": "6",
                "uid": "3f46b95abb434ddf8e25a29d51c53dea",
                "response_text": "Edmund Rice is a gymnast and martial arts instructor living on the 153rd floor of one of the many Projects. He is in love with Linda, an ore-sled dispatcher who lives a few floors down from him, and wants to ask her to marry him. After eating his egg, he prepares himself to propose to Linda, reviewing his three speeches. He leaves with a few minutes to spare, but the elevator won’t work. He watches hopefully as time ticks by and finally accepts that he’s going to be late. He dashes back to his apartment to call Linda and warn her of his tardiness, but she has disconnected her landline. He goes back to the elevator, but still nothing. He storms home and calls the Transit Staff, yelling at the woman who picks up. After he shares his sob story, she reveals that the elevator isn’t working because there’s a spy in it who’s taken over the control system. Realizing just how late he is, Edmund runs back out, tries the elevator again, and then decides to take the stairs. On one of the landings, he notices a door with faint letters on it. This door connects to the elevator shaft. Suddenly, the spy bursts through the door and holds Edmund at gunpoint. Edmund hides him in his room and is forced to make the spy a cup of Chico coffee as he tells his tale. Edmund disguises his identity and pretends he’s an ore-sled dispatcher like Linda, so, if the time should come, he can take the so-called spy by surprise. "
              },
              {
                "worker_id": "8",
                "uid": "4f3b0ec4861841e5aabff37228fe5716",
                "response_text": "Edmund Rice is a gymnast instructor specializing in wrestling, judo, and karati. He lives on the 153rd floor of a Project high-rise building and is preparing to propose to his girlfriend, Linda. Although he loves Linda and wants more than a Non-Permanent, No Progeny arrangement, he realizes she values her independence and plans to respect that. He has found a suitable Non-P apartment for them to share. Edmund's day is not going right. The egg yolk breaks when he prepares breakfast, his zipper sticks, the window is stuck open at full transparency. All of these minor problems are enhanced because he knows if he is even a minute late to his appointment with Linda, she will possibly think he is dead. Edmund gives himself plenty of time to get to the elevator, even though he knows the local and express elevators have a thirty-second arrival time, and it takes less than two minutes to get down to Linda's floor in the same building. When the elevator fails to arrive, Edmund panics. He tries to call Linda, but she has set the phone to private in anticipation of his proposal. Then, he calls the Transit Staff who tells him that the elevator is occupied by a spy, who has barricaded himself inside and is using the elevator as a projectile against anyone who might try to get him out. When Edmund tries to take the stairs to get to Linda, the spy stops him and leads him back to his apartment. Edmund attempts to mislead the spy by pretending to be an ore-sled dispatcher, but this only leads to the spy launching into a long diatribe against the existence of the Projects as smokescreens for the Commission wanting to maintain profits."
              },
              {
                "worker_id": "10",
                "uid": "a25db6ceb09b4ed688b823115f72c336",
                "response_text": "Edmund Rice is the narrating voice of the story, and so the events that occur to him in the story closely mirror the plot since it is all told from his perspective. Edmund is a gymnast instructor, skilled in wrestling, judo and karati. He lives on the 153rd floor of a self-sufficient vertical city building in which no one is supposed to enter or leave. There are many like it in the world, all called “Projects”. The world outside is said to be too dangerous to set foot in for humans because of the radiation from atomic bombs during the Ungentlemanly Gentleman's War. \nHe is deeply in love with an ore-sled dispatcher on the 144th floor, Linda, and wants to propose a Non-P marriage to her (Non-Permanent, No Progeny). Neither of them are genetically desirable enough to have children, and he knows that Linda likes her independence too much to have a permanent marriage, even though he would like to have one with her. He makes an appointment to meet with her at ten o’clock and propose. The time of the appointment is important because Linda is so critical of punctuality that Edmund thinks she will not marry him or even talk to him again if he is late. When he exits his apartment to take the elevator at five minutes before ten, the elevator is not working. He returns to his apartment to call Linda, but she does not answer. He assumes she shut off her phone because he would be there soon and she wanted to have no interruptions. Edmund calls the Transit Staff to file a complaint that they have ruined his life, and the woman at the Transit center says there is a spy in the elevator and it will be some time before it can be fixed because the Army thinks they may have to starve him out. Edmund is crestfallen, then realizes that there are also stairs. It is 10:15, but he rushes to the staircase to try to get to Linda. As he races down, he notices a door to the elevator shaft between the 150th and 149th floors. He pauses to contemplate it, and suddenly a man (the “spy”) bursts out. He threatens Edmund with a gun, forcing him to escort them both back to Edmund’s 153rd floor room without alerting anyone. He does this. Edmund is forced to make him a cup of coffee, taking one of his two coffee rations for the day. Edmund fears that the spy is a maniac, and does as he asks while they wait for the Army to lose the trail so the spy will leave. The spy reveals to Edmund that he is actually an atomic engineer testing his theory that it is now safe for humans to go outside the Projects by risking his life since the Commission would not let him run experiments on it. Edmund is stunned since this is contrary to what he has been conditioned to believe. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5392,
        "document_length_chars": 30678
      }
    }
  ]
}