{
  "item_metadata": {
    "item_id": "52844",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "52844",
      "content": "THE LONG REMEMBERED THUNDER\n \n \n BY KEITH LAUMER\n \n [Transcriber's Note: This etext was produced from Worlds of Tomorrow April 1963 Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n He was as ancient as time—and as strange as his own frightful battle against incredible odds!\n \n \n\n I\n \n In his room at the Elsby Commercial Hotel, Tremaine opened his luggage and took out a small tool kit, used a screwdriver to remove the bottom cover plate from the telephone. He inserted a tiny aluminum cylinder, crimped wires and replaced the cover. Then he dialed a long-distance Washington number and waited half a minute for the connection.\n \n \"Fred, Tremaine here. Put the buzzer on.\" A thin hum sounded on the wire as the scrambler went into operation.\n \n \"Okay, can you read me all right? I'm set up in Elsby. Grammond's boys are supposed to keep me informed. Meantime, I'm not sitting in this damned room crouched over a dial. I'll be out and around for the rest of the afternoon.\"\n \n \"I want to see results,\" the thin voice came back over the filtered hum of the jamming device. \"You spent a week with Grammond—I can't wait another. I don't mind telling you certain quarters are pressing me.\"\n \n \"Fred, when will you learn to sit on your news breaks until you've got some answers to go with the questions?\"\n \n \"I'm an appointive official,\" Fred said sharply. \"But never mind that. This fellow Margrave—General Margrave. Project Officer for the hyperwave program—he's been on my neck day and night. I can't say I blame him. An unauthorized transmitter interfering with a Top Secret project, progress slowing to a halt, and this Bureau—\"\n \n \"Look, Fred. I was happy in the lab. Headaches, nightmares and all. Hyperwave is my baby, remember? You elected me to be a leg-man: now let me do it my way.\"\n \n \"I felt a technical man might succeed where a trained investigator could be misled. And since it seems to be pinpointed in your home area—\"\n \n \"You don't have to justify yourself. Just don't hold out on me. I sometimes wonder if I've seen the complete files on this—\"\n \n \"You've seen all the files! Now I want answers, not questions! I'm warning you, Tremaine. Get that transmitter. I need someone to hang!\"\n \n \n\n \n Tremaine left the hotel, walked two blocks west along Commerce Street and turned in at a yellow brick building with the words ELSBY MUNICIPAL POLICE cut in the stone lintel above the door. Inside, a heavy man with a creased face and thick gray hair looked up from behind an ancient Underwood. He studied Tremaine, shifted a toothpick to the opposite corner of his mouth.\n \n \"Don't I know you, mister?\" he said. His soft voice carried a note of authority.\n \n Tremaine took off his hat. \"Sure you do, Jess. It's been a while, though.\"\n \n The policeman got to his feet. \"Jimmy,\" he said, \"Jimmy Tremaine.\" He came to the counter and put out his hand. \"How are you, Jimmy? What brings you back to the boondocks?\"\n \n \"Let's go somewhere and sit down, Jess.\"\n \n In a back room Tremaine said, \"To everybody but you this is just a visit to the old home town. Between us, there's more.\"\n \n Jess nodded. \"I heard you were with the guv'ment.\"\n \n \"It won't take long to tell; we don't know much yet.\" Tremaine covered the discovery of the powerful unidentified interference on the high-security hyperwave band, the discovery that each transmission produced not one but a pattern of \"fixes\" on the point of origin. He passed a sheet of paper across the table. It showed a set of concentric circles, overlapped by a similar group of rings.\n \n \"I think what we're getting is an echo effect from each of these points of intersection. The rings themselves represent the diffraction pattern—\"\n \n \"Hold it, Jimmy. To me it just looks like a beer ad. I'll take your word for it.\"\n \n \"The point is this, Jess: we think we've got it narrowed down to this section. I'm not sure of a damn thing, but I think that transmitter's near here. Now, have you got any ideas?\"\n \n \"That's a tough one, Jimmy. This is where I should come up with the news that Old Man Whatchamacallit's got an attic full of gear he says is a time machine. Trouble is, folks around here haven't even taken to TV. They figure we should be content with radio, like the Lord intended.\"\n \n \"I didn't expect any easy answers, Jess. But I was hoping maybe you had something ...\"\n \n \"Course,\" said Jess, \"there's always Mr. Bram ...\"\n \n \"Mr. Bram,\" repeated Tremaine. \"Is he still around? I remember him as a hundred years old when I was kid.\"\n \n \"Still just the same, Jimmy. Comes in town maybe once a week, buys his groceries and hikes back out to his place by the river.\"\n \n \"Well, what about him?\"\n \n \"Nothing. But he's the town's mystery man. You know that. A little touched in the head.\"\n \n \"There were a lot of funny stories about him, I remember,\" Tremaine said. \"I always liked him. One time he tried to teach me something I've forgotten. Wanted me to come out to his place and he'd teach me. I never did go. We kids used to play in the caves near his place, and sometimes he gave us apples.\"\n \n \n\n \n \"I've never seen any harm in Bram,\" said Jess. \"But you know how this town is about foreigners, especially when they're a mite addled. Bram has blue eyes and blond hair—or did before it turned white—and he talks just like everybody else. From a distance he seems just like an ordinary American. But up close, you feel it. He's foreign, all right. But we never did know where he came from.\"\n \n \"How long's he lived here in Elsby?\"\n \n \"Beats me, Jimmy. You remember old Aunt Tress, used to know all about ancestors and such as that? She couldn't remember about Mr. Bram. She was kind of senile, I guess. She used to say he'd lived in that same old place out on the Concord road when she was a girl. Well, she died five years ago ... in her seventies. He still walks in town every Wednesday ... or he did up till yesterday anyway.\"\n \n \"Oh?\" Tremaine stubbed out his cigarette, lit another. \"What happened then?\"\n \n \"You remember Soup Gaskin? He's got a boy, name of Hull. He's Soup all over again.\"\n \n \"I remember Soup,\" Tremaine said. \"He and his bunch used to come in the drug store where I worked and perch on the stools and kid around with me, and Mr. Hempleman would watch them from over back of the prescription counter and look nervous. They used to raise cain in the other drug store....\"\n \n \"Soup's been in the pen since then. His boy Hull's the same kind. Him and a bunch of his pals went out to Bram's place one night and set it on fire.\"\n \n \"What was the idea of that?\"\n \n \"Dunno. Just meanness, I reckon. Not much damage done. A car was passing by and called it in. I had the whole caboodle locked up here for six hours. Then the sob sisters went to work: poor little tyke routine, high spirits, you know the line. All of 'em but Hull are back in the streets playin' with matches by now. I'm waiting for the day they'll make jail age.\"\n \n \"Why Bram?\" Tremaine persisted. \"As far as I know, he never had any dealings to speak of with anybody here in town.\"\n \n \"Oh hoh, you're a little young, Jimmy,\" Jess chuckled. \"You never knew about Mr. Bram—the young Mr. Bram—and Linda Carroll.\"\n \n Tremaine shook his head.\n \n \"Old Miss Carroll. School teacher here for years; guess she was retired by the time you were playing hookey. But her dad had money, and in her day she was a beauty. Too good for the fellers in these parts. I remember her ridin by in a high-wheeled shay, when I was just a nipper. Sitting up proud and tall, with that red hair piled up high. I used to think she was some kind of princess....\"\n \n \"What about her and Bram? A romance?\"\n \n \n\n \n Jess rocked his chair back on two legs, looked at the ceiling, frowning. \"This would ha' been about nineteen-oh-one. I was no more'n eight years old. Miss Linda was maybe in her twenties—and that made her an old maid, in those times. The word got out she was setting her cap for Bram. He was a good-looking young feller then, over six foot, of course, broad backed, curly yellow hair—and a stranger to boot. Like I said, Linda Carroll wanted nothin to do with the local bucks. There was a big shindy planned. Now, you know Bram was funny about any kind of socializing; never would go any place at night. But this was a Sunday afternoon and someways or other they got Bram down there; and Miss Linda made her play, right there in front of the town, practically. Just before sundown they went off together in that fancy shay. And the next day, she was home again—alone. That finished off her reputation, as far as the biddies in Elsby was concerned. It was ten years 'fore she even landed the teaching job. By that time, she was already old. And nobody was ever fool enough to mention the name Bram in front of her.\"\n \n Tremaine got to his feet. \"I'd appreciate it if you'd keep your ears and eyes open for anything that might build into a lead on this, Jess. Meantime, I'm just a tourist, seeing the sights.\"\n \n \"What about that gear of yours? Didn't you say you had some kind of detector you were going to set up?\"\n \n \"I've got an oversized suitcase,\" Tremaine said. \"I'll be setting it up in my room over at the hotel.\"\n \n \"When's this bootleg station supposed to broadcast again?\"\n \n \"After dark. I'm working on a few ideas. It might be an infinitely repeating logarithmic sequence, based on—\"\n \n \"Hold it, Jimmy. You're over my head.\" Jess got to his feet. \"Let me know if you want anything. And by the way—\" he winked broadly—\"I always did know who busted Soup Gaskin's nose and took out his front teeth.\"\n \n \n\n II\n \n Back in the street, Tremaine headed south toward the Elsby Town Hall, a squat structure of brownish-red brick, crouched under yellow autumn trees at the end of Sheridan Street. Tremaine went up the steps and past heavy double doors. Ten yards along the dim corridor, a hand-lettered cardboard sign over a black-varnished door said\n\"MUNICIPAL OFFICE OF RECORD.\" Tremaine opened the door and went in.\n \n A thin man with garters above the elbow looked over his shoulder at Tremaine.\n \n \"We're closed,\" he said.\n \n \"I won't be a minute,\" Tremaine said. \"Just want to check on when the Bram property changed hands last.\"\n \n The man turned to Tremaine, pushing a drawer shut with his hip. \"Bram? He dead?\"\n \n \"Nothing like that. I just want to know when he bought the place.\"\n \n The man came over to the counter, eyeing Tremaine. \"He ain't going to sell, mister, if that's what you want to know.\"\n \n \"I want to know when he bought.\"\n \n The man hesitated, closed his jaw hard. \"Come back tomorrow,\" he said.\n \n Tremaine put a hand on the counter, looked thoughtful. \"I was hoping to save a trip.\" He lifted his hand and scratched the side of his jaw. A folded bill opened on the counter. The thin man's eyes darted toward it. His hand eased out, covered the bill. He grinned quickly.\n \n \"See what I can do,\" he said.\n \n It was ten minutes before he beckoned Tremaine over to the table where a two-foot-square book lay open. An untrimmed fingernail indicated a line written in faded ink:\n \n \"May 19. Acreage sold, One Dollar and other G&V consid. NW Quarter Section 24, Township Elsby. Bram. (see Vol. 9 & cet.)\"\n \n \"Translated, what does that mean?\" said Tremaine.\n \n \"That's the ledger for 1901; means Bram bought a quarter section on the nineteenth of May. You want me to look up the deed?\"\n \n \"No, thanks,\" Tremaine said. \"That's all I needed.\" He turned back to the door.\n \n \"What's up, mister?\" the clerk called after him. \"Bram in some kind of trouble?\"\n \n \"No. No trouble.\"\n \n The man was looking at the book with pursed lips. \"Nineteen-oh-one,\" he said. \"I never thought of it before, but you know, old Bram must be dern near to ninety years old. Spry for that age.\"\n \n \"I guess you're right.\"\n \n The clerk looked sideways at Tremaine. \"Lots of funny stories about old Bram. Useta say his place was haunted. You know; funny noises and lights. And they used to say there was money buried out at his place.\"\n \n \"I've heard those stories. Just superstition, wouldn't you say?\"\n \n \"Maybe so.\" The clerk leaned on the counter, assumed a knowing look.\n\"There's one story that's not superstition....\"\n \n Tremaine waited.\n \n \"You—uh—paying anything for information?\"\n \n \"Now why would I do that?\" Tremaine reached for the door knob.\n \n The clerk shrugged. \"Thought I'd ask. Anyway—I can swear to this. Nobody in this town's ever seen Bram between sundown and sunup.\"\n \n \n\n \n Untrimmed sumacs threw late-afternoon shadows on the discolored stucco facade of the Elsby Public Library. Inside, Tremaine followed a paper-dry woman of indeterminate age to a rack of yellowed newsprint.\n \n \"You'll find back to nineteen-forty here,\" the librarian said. \"The older are there in the shelves.\"\n \n \"I want nineteen-oh-one, if they go back that far.\"\n \n The woman darted a suspicious look at Tremaine. \"You have to handle these old papers carefully.\"\n \n \"I'll be extremely careful.\" The woman sniffed, opened a drawer, leafed through it, muttering.\n \n \"What date was it you wanted?\"\n \n \"Nineteen-oh-one; the week of May nineteenth.\"\n \n The librarian pulled out a folded paper, placed it on the table, adjusted her glasses, squinted at the front page. \"That's it,\" she said. \"These papers keep pretty well, provided they're stored in the dark. But they're still flimsy, mind you.\"\n \n \"I'll remember.\" The woman stood by as Tremaine looked over the front page. The lead article concerned the opening of the Pan-American Exposition at Buffalo. Vice-President Roosevelt had made a speech. Tremaine leafed over, reading slowly.\n \n On page four, under a column headed County Notes he saw the name Bram:\n \n Mr. Bram has purchased a quarter section of fine grazing land, north of town, together with a sturdy house, from J. P. Spivey of Elsby. Mr. Bram will occupy the home and will continue to graze a few head of stock. Mr. Bram, who is a newcomer to the county, has been a resident of Mrs. Stoate's Guest Home in Elsby for the past months.\n \n \"May I see some earlier issues; from about the first of the year?\"\n \n The librarian produced the papers. Tremaine turned the pages, read the heads, skimmed an article here and there. The librarian went back to her desk. An hour later, in the issue for July 7, 1900, an item caught his eye:\n \n A Severe Thunderstorm. Citizens of Elsby and the country were much alarmed by a violent cloudburst, accompanied by lightning and thunder, during the night of the fifth. A fire set in the pine woods north of Spivey's farm destroyed a considerable amount of timber and threatened the house before burning itself out along the river.\n \n The librarian was at Tremaine's side. \"I have to close the library now. You'll have to come back tomorrow.\"\n \n Outside, the sky was sallow in the west: lights were coming on in windows along the side streets. Tremaine turned up his collar against a cold wind that had risen, started along the street toward the hotel.\n \n A block away a black late-model sedan rounded a corner with a faint squeal of tires and gunned past him, a heavy antenna mounted forward of the left rear tail fin whipping in the slipstream. Tremaine stopped short, stared after the car.\n \n \"Damn!\" he said aloud. An elderly man veered, eyeing him sharply. Tremaine set off at a run, covered the two blocks to the hotel, yanked open the door to his car, slid into the seat, made a U-turn, and headed north after the police car.\n \n \n\n \n Two miles into the dark hills north of the Elsby city limits, Tremaine rounded a curve. The police car was parked on the shoulder beside the highway just ahead. He pulled off the road ahead of it and walked back. The door opened. A tall figure stepped out.\n \n \"What's your problem, mister?\" a harsh voice drawled.\n \n \"What's the matter? Run out of signal?\"\n \n \"What's it to you, mister?\"\n \n \"Are you boys in touch with Grammond on the car set?\"\n \n \"We could be.\"\n \n \"Mind if I have a word with him? My name's Tremaine.\"\n \n \"Oh,\" said the cop, \"you're the big shot from Washington.\" He shifted chewing tobacco to the other side of his jaw. \"Sure, you can talk to him.\" He turned and spoke to the other cop, who muttered into the mike before handing it to Tremaine.\n \n The heavy voice of the State Police chief crackled. \"What's your beef, Tremaine?\"\n \n \"I thought you were going to keep your men away from Elsby until I gave the word, Grammond.\"\n \n \"That was before I knew your Washington stuffed shirts were holding out on me.\"\n \n \"It's nothing we can go to court with, Grammond. And the job you were doing might have been influenced if I'd told you about the Elsby angle.\"\n \n Grammond cursed. \"I could have put my men in the town and taken it apart brick by brick in the time—\"\n \n \"That's just what I don't want. If our bird sees cops cruising, he'll go underground.\"\n \n \"You've got it all figured, I see. I'm just the dumb hick you boys use for the spade work, that it?\"\n \n \"Pull your lip back in. You've given me the confirmation I needed.\"\n \n \"Confirmation, hell! All I know is that somebody somewhere is punching out a signal. For all I know, it's forty midgets on bicycles, pedalling all over the damned state. I've got fixes in every county—\"\n \n \"The smallest hyperwave transmitter Uncle Sam knows how to build weighs three tons,\" said Tremaine. \"Bicycles are out.\"\n \n Grammond snorted. \"Okay, Tremaine,\" he said. \"You're the boy with all the answers. But if you get in trouble, don't call me; call Washington.\"\n \n \n\n \n Back in his room, Tremaine put through a call.\n \n \"It looks like Grammond's not willing to be left out in the cold, Fred. Tell him if he queers this—\"\n \n \"I don't know but what he might have something,\" the voice came back over the filtered hum. \"Suppose he smokes them out—\"\n \n \"Don't go dumb on me, Fred. We're not dealing with West Virginia moonshiners.\"\n \n \"Don't tell me my job, Tremaine!\" the voice snapped. \"And don't try out your famous temper on me. I'm still in charge of this investigation.\"\n \n \"Sure. Just don't get stuck in some senator's hip pocket.\" Tremaine hung up the telephone, went to the dresser and poured two fingers of Scotch into a water glass. He tossed it down, then pulled on his coat and left the hotel.\n \n He walked south two blocks, turned left down a twilit side street. He walked slowly, looking at the weathered frame houses. Number 89 was a once-stately three-storied mansion overgrown with untrimmed vines, its windows squares of sad yellow light. He pushed through the gate in the ancient picket fence, mounted the porch steps and pushed the button beside the door, a dark panel of cracked varnish. It was a long minute before the door opened. A tall woman with white hair and a fine-boned face looked at him coolly.\n \n \"Miss Carroll,\" Tremaine said. \"You won't remember me, but I—\"\n \n \"There is nothing whatever wrong with my faculties, James,\" Miss Carroll said calmly. Her voice was still resonant, a deep contralto. Only a faint quaver reflected her age—close to eighty, Tremaine thought, startled.\n \n \"I'm flattered you remember me, Miss Carroll,\" he said.\n \n \"Come in.\" She led the way to a pleasant parlor set out with the furnishings of another era. She motioned Tremaine to a seat and took a straight chair across the room from him.\n \n \"You look very well, James,\" she said, nodding. \"I'm pleased to see that you've amounted to something.\"\n \n \"Just another bureaucrat, I'm afraid.\"\n \n \"You were wise to leave Elsby. There is no future here for a young man.\"\n \n \"I often wondered why you didn't leave, Miss Carroll. I thought, even as a boy, that you were a woman of great ability.\"\n \n \"Why did you come today, James?\" asked Miss Carroll.\n \n \"I....\" Tremaine started. He looked at the old lady. \"I want some information. This is an important matter. May I rely on your discretion?\"\n \n \"Of course.\"\n \n \"How long has Mr. Bram lived in Elsby?\"\n \n \n\n \n Miss Carroll looked at him for a long moment. \"Will what I tell you be used against him?\"\n \n \"There'll be nothing done against him, Miss Carroll ... unless it needs to be in the national interest.\"\n \n \"I'm not at all sure I know what the term 'national interest' means, James. I distrust these glib phrases.\"\n \n \"I always liked Mr. Bram,\" said Tremaine. \"I'm not out to hurt him.\"\n \n \"Mr. Bram came here when I was a young woman. I'm not certain of the year.\"\n \n \"What does he do for a living?\"\n \n \"I have no idea.\"\n \n \"Why did a healthy young fellow like Bram settle out in that isolated piece of country? What's his story?\"\n \n \"I'm ... not sure that anyone truly knows Bram's story.\"\n \n \"You called him 'Bram', Miss Carroll. Is that his first name ... or his last?\"\n \n \"That is his only name. Just ... Bram.\"\n \n \"You knew him well once, Miss Carroll. Is there anything—\"\n \n A tear rolled down Miss Carroll's faded cheek. She wiped it away impatiently.\n \n \"I'm an unfulfilled old maid, James,\" she said. \"You must forgive me.\"\n \n Tremaine stood up. \"I'm sorry. Really sorry. I didn't mean to grill you. Miss Carroll. You've been very kind. I had no right....\"\n \n Miss Carroll shook her head. \"I knew you as a boy, James. I have complete confidence in you. If anything I can tell you about Bram will be helpful to you, it is my duty to oblige you; and it may help him.\" She paused. Tremaine waited.\n \n \"Many years ago I was courted by Bram. One day he asked me to go with him to his house. On the way he told me a terrible and pathetic tale. He said that each night he fought a battle with evil beings, alone, in a cave beneath his house.\"\n \n Miss Carroll drew a deep breath and went on. \"I was torn between pity and horror. I begged him to take me back. He refused.\" Miss Carroll twisted her fingers together, her eyes fixed on the long past. \"When we reached the house, he ran to the kitchen. He lit a lamp and threw open a concealed panel. There were stairs. He went down ... and left me there alone.\n \n \"I waited all that night in the carriage. At dawn he emerged. He tried to speak to me but I would not listen.\n \n \"He took a locket from his neck and put it into my hand. He told me to keep it and, if ever I should need him, to press it between my fingers in a secret way ... and he would come. I told him that until he would consent to see a doctor, I did not wish him to call. He drove me home. He never called again.\"\n \n \"This locket,\" said Tremaine, \"do you still have it?\"\n \n Miss Carroll hesitated, then put her hand to her throat, lifted a silver disc on a fine golden chain. \"You see what a foolish old woman I am, James.\"\n \n \"May I see it?\"\n \n She handed the locket to him. It was heavy, smooth. \"I'd like to examine this more closely,\" he said. \"May I take it with me?\"\n \n Miss Carroll nodded.\n \n \"There is one other thing,\" she said, \"perhaps quite meaningless....\"\n \n \"I'd be grateful for any lead.\"\n \n \"Bram fears the thunder.\"\n \n \n\n III\n \n As Tremaine walked slowly toward the lighted main street of Elsby a car pulled to a stop beside him. Jess leaned out, peered at Tremaine and asked:\n \n \"Any luck, Jimmy?\"\n \n Tremaine shook his head. \"I'm getting nowhere fast. The Bram idea's a dud, I'm afraid.\"\n \n \"Funny thing about Bram. You know, he hasn't showed up yet. I'm getting a little worried. Want to run out there with me and take a look around?\"\n \n \"Sure. Just so I'm back by full dark.\"\n \n As they pulled away from the curb Jess said, \"Jimmy, what's this about State Police nosing around here? I thought you were playing a lone hand from what you were saying to me.\"\n \n \"I thought so too, Jess. But it looks like Grammond's a jump ahead of me. He smells headlines in this; he doesn't want to be left out.\"\n \n \"Well, the State cops could be mighty handy to have around. I'm wondering why you don't want 'em in. If there's some kind of spy ring working—\"\n \n \"We're up against an unknown quantity. I don't know what's behind this and neither does anybody else. Maybe it's a ring of Bolsheviks ... and maybe it's something bigger. I have the feeling we've made enough mistakes in the last few years; I don't want to see this botched.\"\n \n The last pink light of sunset was fading from the clouds to the west as Jess swung the car through the open gate, pulled up under the old trees before the square-built house. The windows were dark. The two men got out, circled the house once, then mounted the steps and rapped on the door. There was a black patch of charred flooring under the window, and the paint on the wall above it was bubbled. Somewhere a cricket set up a strident chirrup, suddenly cut off. Jess leaned down, picked up an empty shotgun shell. He looked at Tremaine. \"This don't look good,\" he said. \"You suppose those fool boys...?\"\n \n He tried the door. It opened. A broken hasp dangled. He turned to Tremaine. \"Maybe this is more than kid stuff,\" he said. \"You carry a gun?\"\n \n \"In the car.\"\n \n \"Better get it.\"\n \n Tremaine went to the car, dropped the pistol in his coat pocket, rejoined Jess inside the house. It was silent, deserted. In the kitchen Jess flicked the beam of his flashlight around the room. An empty plate lay on the oilcloth-covered table.\n \n \"This place is empty,\" he said. \"Anybody'd think he'd been gone a week.\"\n \n \"Not a very cozy—\" Tremaine broke off. A thin yelp sounded in the distance.\n \n \"I'm getting jumpy,\" said Jess. \"Dern hounddog, I guess.\"\n \n A low growl seemed to rumble distantly. \"What the devil's that?\" Tremaine said.\n \n Jess shone the light on the floor. \"Look here,\" he said. The ring of light showed a spatter of dark droplets all across the plank floor.\n \n \"That's blood, Jess....\" Tremaine scanned the floor. It was of broad slabs, closely laid, scrubbed clean but for the dark stains.\n \n \"Maybe he cleaned a chicken. This is the kitchen.\"\n \n \"It's a trail.\" Tremaine followed the line of drops across the floor. It ended suddenly near the wall.\n \n \"What do you make of it. Jimmy?\"\n \n A wail sounded, a thin forlorn cry, trailing off into silence. Jess stared at Tremaine. \"I'm too damned old to start believing in spooks,\" he said. \"You suppose those damn-fool boys are hiding here, playing tricks?\"\n \n \"I think.\" Tremaine said, \"that we'd better go ask Hull Gaskin a few questions.\"\n \n \n\n \n At the station Jess led Tremaine to a cell where a lanky teen-age boy lounged on a steel-framed cot, blinking up at the visitor under a mop of greased hair.\n \n \"Hull, this is Mr. Tremaine,\" said Jess. He took out a heavy key, swung the cell door open. \"He wants to talk to you.\"\n \n \"I ain't done nothin,\" Hull said sullenly. \"There ain't nothin wrong with burnin out a Commie, is there?\"\n \n \"Bram's a Commie, is he?\" Tremaine said softly. \"How'd you find that out, Hull?\"\n \n \"He's a foreigner, ain't he?\" the youth shot back. \"Besides, we heard....\"\n \n \"What did you hear?\"\n \n \"They're lookin for the spies.\"\n \n \"Who's looking for spies?\"\n \n \"Cops.\"\n \n \"Who says so?\"\n \n The boy looked directly at Tremaine for an instant, flicked his eyes to the corner of the cell. \"Cops was talkin about 'em,\" he said.\n \n \"Spill it, Hull,\" the policeman said. \"Mr. Tremaine hasn't got all night.\"\n \n \"They parked out east of town, on 302, back of the woodlot. They called me over and asked me a bunch of questions. Said I could help 'em get them spies. Wanted to know all about any funny-actin people around hers.\"\n \n \"And you mentioned Bram?\"\n \n The boy darted another look at Tremaine. \"They said they figured the spies was out north of town. Well, Bram's a foreigner, and he's out that way, ain't he?\"\n \n \"Anything else?\"\n \n The boy looked at his feet.",
      "metadata": {
        "title": "The Long Remembered Thunder",
        "author": "Keith Laumer",
        "passage_id": "52844",
        "uid": "85f1cb3284c1463d817896a25e15e073",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "103",
                "uid": "ca6954aa341f44a4ad84599dcfa6aa19",
                "response_text": "With pressure coming from Fred, who elected him into this investigation, Tremaine first goes to the police station to meet his friend who works here so that he can get familiar with the town and learn about unusual activities and strange events if there are any. Jess, the police officer, is surprised to see Tremaine coming back to this town. Tremaine asks Jess if he has any idea of a transmitter in this area, however, Jess does not seem really interested in the transmitters as he think drawing is a beer advertisement. Afterwards, Jess tells Tremaine about the old man Bram who seems to have lived in this town forever. He is the mystery man of the town. As a foreigner who no one knows much about, he seems strange. Knowing that Bram has lived on the same property since as long as anyone could remember, he goes to the Municipal Office of Records to check the last time that there was a change of hands on Bram’s property.  \n\nThen Tremaine goes to the Elsby Public Library, checking for the newspapers around the time when Bram bought the property. On his way back to the hotel that he is staying at, he notices Grammond’s men. But Tremaine has told Grammond to keep his men away from this town for now. Apparently, Grammond didn’t listen, Tremaine is afraid that with the police searching around the town, the person they are looking for will sense that something is off, and will hide before they are able to find him/her.\n\nDesiring to learn more about this old man, Jess has also mentioned to Tremaine that Linda Carroll had been with Bram for a while when Carroll was in her twenties, which is a few decades ago. So then Tremaine goes to Carroll’s house hoping to learn more about the mysterious man Bram. Then after he left Carroll’s house, he goes to Bram’s house together with Jess. Shots were fired, the house is empty, but Bram is not there. They go straight to Hull Gaskin to ask questions since he did set fire on Bram’s place before. \n"
              },
              {
                "worker_id": "105",
                "uid": "26cb4561eac9454ea8f98fac0a8ddd55",
                "response_text": "Tremaine, a former hyperwave lab worker, dials Washington from a hotel room in his old hometown. On the other end Fred, an appointive official, is impatiently waiting for Tremaine to catch the transmitter who intervened with their Top Secret project. Jimmy Tremaine visits an old acquaintance Jess in a local police department, the former shares details of his secret mission and asks whether Jess has any idea who can be the transmitter. Jess says everyone around is bad with technologies, but Mr. Bram is a mystery man, so it could be him. The man is a foreigner but he has been living in the town for so long that no one knows when and where he came from. Not long ago his house was set on fire by a bunch of kids, nothing serious. Jess tells a story about the past: a local beauty by then, Miss Carol, wanted nothing to do with locals and set her trap for Mr. Bram. They left a party together and the next morning she was back alone. Her reputation was destroyed, she never married and now works as a teacher. Tremaine heads towards the Elsby Town Hall, he learns that Bram bought his property in 1901. Then in the local public library he finds an article concerning this purchase, then he sees an article of July 7, 1900 regarding a severe thunderstorm. Near the hotel he notices a car and heads after the police to ask Grammond, the chief, to keep the police away from the hotel so as not to scare off the intermitter. Grammond is offended by being kept ignorant. Further, Jimmy heads to Miss Carol's and asks questions about Mr. Bram, she can't answer them for sure and a tear drops from her eye. Soon, she decides to tell about the night at Bram's place back in the years : he told he fought evil every night, went downstairs for the whole night and left her alone. Then he gave her a locket and said to press in a particular way if he is ever needed. Miss Carol considered him crazy and never met me again. She says Bram fears thunder and gives Jimmy the locket. Jess picks Jimmy up to look for Bram who hasn't shown up recently. The two enter the deserted house with Tremaine's gun, they see blood in the kitchen making up a trail. They go back to talk to Hull, a boy who set Bram's house on fire recently. Turns out he considered Bram a spy as he is a foreigner and a communist, and the boy heard the boys were looking for spies. \n"
              },
              {
                "worker_id": "101",
                "uid": "791b2b3c348249568498c852f8fa1ce1",
                "response_text": "Jimmy Tremaine works for the government, conducting a secret operation about implementing hyperwaves in the military. An interfering transmission had recently been detected tampering with the hyperwaves, and when tracked down, the source seems to come from Elsby, Tremaine's hometown. Fred, Tremaine's superior, orders Tremaine to figure out where the transmission is coming from before he interferes his own way. Tremaine visits Elsby's police station, where he meets Jess. Tremaine tells Jess about the transmission and asks if he has any ideas or leads on the situation. Jess is stumped, but notes that Mr. Bram is an odd character at Elsby, who has been there for an unusually long amount of time. Curious about Mr. Bram, Tremaine goes to the Office of Record, where he bribes the man at the counter to tell him the year that Mr. Bram purchased his home, which is revealed to be 1901. The clerk also tells Tremaine that no one has seen Bram between sundown and sunup. Tremaine then visits the library, where he finds an article about Bram purchasing the house, as well as an account of a thunderstorm that occurred there a year before the purchase. On his way back from the library, Tremaine sees a police car speeding off, and he follows. He gets in contact with the State Police Chief, who does not approve of being left out of Tremaine's investigation. Tremaine speaks to Miss Carroll, known to have had a history with Bram. She tells Tremaine about her encounter with Bram and how he kept her in a cave under his house for the night, and she never spoke to him again. She also tells Tremaine that Bram is afraid of thunder. As Tremaine walks back to his room, Jess finds him and asks how the investigation is going, and Tremaine replies that he is stumped. Jess suggests that they visit Bram's house together, and the two enter and see an empty gun shell. They find blood in the kitchen. Jess and Tremaine then visit a police station where they find Hull Gaskin, who admits to shooting Bram after some cops prompted him to help catch spies. "
              },
              {
                "worker_id": "104",
                "uid": "c45c051fb4aa4e1dbde23868e9f6dc2b",
                "response_text": "Tremaine calls Fred from his hotel room and gives him an update on his progress. Fred expresses his frustration with the progress and complains that General Margrave has been breathing down his neck about the case. Tremaine tells Fred to be confident in him and Fred ends by yelling that he wants the transmitter and for someone to pay. Tremaine eventually leaves his hotel room and heads towards the local police station. At the station, Tremaine greets Jess once he enters the building. The two go to have a private conversation where Tremaine tries to get Jess’s help with a case. Jess tells Tremaine what he knows about Bram from what he’s heard and what he’s seen. It is clear that Bram lives a very private life. \n\nOnce his conversation with Jess finishes, Tremaine goes to the Municipal office of Records at the town hall. He has to bribe a reluctant man in the office to let him look for the information that he needs. He is able to find out information about Bram’s property and then leaves to go to the library to gather more information. At the library, Tremaine looks through old newspapers. He learns from one newspaper about a severe thunderstorm that affected the Bram property.  \n\nBack at his hotel room, Tremaine has a tense phone call with Fred. When it ends, he pours himself a glass of scotch. After finishing his drink, he goes to Miss Carroll’s nearby house Tremaine asks her about Bram. She is unable to give him many details about Bram. However, Miss Carroll does willingly detail her personal relationship with Bram. Carroll mentions that Bram gave her a locket and to use it to contact him if she ever needed his help. Tremaine asks for the locket and she hands it over to him. She mentions that she remembers how Bram was afraid of thunder. With all the information that he could gather from Miss Carroll, Tremaine leaves her house.\n\nUpon leaving Miss Carroll’s house, Jess pulls up to Tremaine on the street in his car and they decide to go check on Bram as he hasn’t been seen in a while. The two get out of their car once they reach the property and inspect the outside of the house. They become alert by the suspicious state of the house, especially because of the empty shotgun shell that they find, so they retrieve a gun from the car for their safety. They start hearing strange noises once they enter the house, causing them both to become uneasy. Inside the kitchen, they spot a suspicious trail of blood and hear another strange sound. They decide to go to the police station to ask Hull Gaskin – one of the teens arrested for setting fire to Bram’s property- some questions. Hull says that he was approached by cops asking him to help them find spies. He says he told them about Bram because he’s a foreigner.  \n"
              }
            ]
          },
          {
            "question_text": "What information has Tremaine gathered about Bram?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "103",
                "uid": "ca6954aa341f44a4ad84599dcfa6aa19",
                "response_text": "Tremaine learns from Jess that Bram is the mystery man of the Elsby town. He is a foreigner to the town despite the fact that he has similar appearances as the rest of the town. People do not know where he is from, when he started living in the town, and not even his full name, but there are still many conspiracies about him. The clerk at the Municipal Office of Record is confident that Bram has never been seen between sundown and sunup. He also tells Tremaine that the property that Bram currently lives on was purchased by him in 1901. Tremaine learns from the newspapers that the same property was accidentally caught on fire from a thunderstorm about a year before the transaction was made between Bram and J. P. Spivey. Interestingly, from Jess, Tremaine also learns that Hull and his friends started a fire on Bram’s place some time ago. \n\nTremaine acknowledged the relationship between the young Bram and young Linda Carroll. Carroll explains to Tremaine how he told her that there is a cave beneath his house. And every night he has to fight evil beings that are right below his house. He went downstairs for the night and by the time he came up, it was dawn. Later, he handed her a locket which allows her to ask him to come simply by pressing it in a certain way. Moreover, Carroll tells Tremaine that he is afraid of thunder. Furthermore, after Bram has gone missing, Tremaine learns from Hull that Bram is a Commie. "
              },
              {
                "worker_id": "105",
                "uid": "26cb4561eac9454ea8f98fac0a8ddd55",
                "response_text": "Mr. Bram is a foreigner which is rare in the town. He came such a long time ago that no one knows when and where from. From the record, Tremaine finds out Bram bought his house soon after his arrival in the year 1901, so he should be in his nineties now. A year before the purchase a severe thunderstorm took place. Bram is never seen at night. He is a mystic figure and there are legends about his house. He courted Miss Carol, who is an unmarried old lady. He told her he fought evil every night in his house downstairs. She also says he is afraid of thunder. He gave her a locket to touch in a particular way to call him and she considers him crazy. Local boys consider him a spy and a communist. Now he disappeared. "
              },
              {
                "worker_id": "101",
                "uid": "791b2b3c348249568498c852f8fa1ce1",
                "response_text": "Bram remains a mystery is Elsby, but Tremaine has gathered some information about him. Jess tells him that Bram has been at Elsby for a long time, and has outlived some residents abnormally. The clerk at the Record Office helps Tremaine gather more information about Bram's house, and tells Tremaine that Bram has never been spotted overnight. Miss Carroll tells Tremaine about her encounter with Bram, and also tells him that he is afraid of thunder."
              },
              {
                "worker_id": "104",
                "uid": "c45c051fb4aa4e1dbde23868e9f6dc2b",
                "response_text": "Tremaine gathers different information from different people throughout the story. From Jess, Tremaine gathers information about Bram’s routines. According to Jess, Bram comes into town about once a week to buy his groceries, specifically on Wednesdays. It’s not known where Bram is from but it is assumed that he is a foreigner. Jess tells Tremaine that recently some delinquent kids set Bram’s place on fire and Bram has not been seen since the incident. \n\nFrom the worker at the Municipal Office of Record, he finds out when Bram bought his property. The clerk continues to tell him some rumors about Bram, such as Bram’s place supposedly being haunted and having money buried on the property. \n\nAt the library, Tremaine is able to learn more information about Bram from old newspapers. He learns who originally owned the property and how Bram was a newcomer to the area. \n"
              }
            ]
          },
          {
            "question_text": "What is the relationship between Bram and Carroll?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "103",
                "uid": "ca6954aa341f44a4ad84599dcfa6aa19",
                "response_text": "From Jess, Tremaine learns that the school teacher, Linda Carroll had a relationship with Bram while they were young. Carroll’s family is quite wealthy and she was very beautiful. People in the town was not really up to her standards. Bram is a foreigner and does not really like social events. However, apparently, Carroll went off together with Bram one day afternoon with almost the whole town there. Then the next day Bram was not by her side, she came back by herself. This made her reputation really bad and she could not even be hired as a teacher for 10 years afterwards. From Carroll, Tremaine learns another story. She seems to not know Bram well. She confirms that she and Bram was in a relationship. And after Bram invited her to his place one day, he explains that he has to fight evil beings below his house every night. After they arrived at his house, she was left in the carriage for the whole night while he was below the house until dawn. Thus she decided to not talk to him when him came to see her in the carriage again. He gave her a locket where a pattern of tapping would allow him to get to her if she ever needs him. Interestingly, she also tells Tremaine that Bram is afraid of the thunder."
              },
              {
                "worker_id": "105",
                "uid": "26cb4561eac9454ea8f98fac0a8ddd55",
                "response_text": "Back in the years, when Carol was in her twenties and Bram a couple years older, he courted her. She was the prettiest young lady in town, unmarried as all locals were too good for her. She was determined to get this foreigner and even made a plan. He was a handsome young man, not a social type of a person, but he was somehow dragged to a shiny. He left together with Carol in the evening, took her to his house and scared her on the way. He talked about fighting evil every night and some other crazy things and disappeared downstairs. She waited outside the whole night and was scared of his madness, she had no intention of listening to him. He gave her a locket which would summon him if used in the right way. They never met again. The memories are still painful for Carol, her reputation was destroyed and she stayed unmarried. "
              },
              {
                "worker_id": "101",
                "uid": "791b2b3c348249568498c852f8fa1ce1",
                "response_text": "In the past, Bram and Carroll had pursued a romantic relationship. He had courted her and taken her to his house, where he scared her by telling her that he fights with evil beings in his house and then locking her beneath the kitchen. The next morning, Bram gave Carroll a locket to keep. Carroll refused to speak to Bram again, telling him that he needed to seek a doctor. The two had not spoken since, but it is revealed that Carroll kept the locket Bram had given her since. "
              },
              {
                "worker_id": "104",
                "uid": "c45c051fb4aa4e1dbde23868e9f6dc2b",
                "response_text": "Jess tells Tremaine how something romantic happened between Carroll and Bram. However, from his knowledge, it did not end well and Carroll’s reputation was ruined from the events. \n\nFrom Miss Carroll’s own words, she says that her experience with Bram was a bad one. He took her out on a date but began to act strange and talking as if he was crazy. He disappeared, running down a set of stays. Meanwhile, she stayed alone in the car all night. In the morning when he reappeared, she refused to speak with him and told him she would not associate with him until he got help. \n"
              }
            ]
          },
          {
            "question_text": "What is the relationship between Tremaine and Jess?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "103",
                "uid": "ca6954aa341f44a4ad84599dcfa6aa19",
                "response_text": "Jess is a police officer at the Elsby town where both Jess and Tremaine grew up. They have not seen each other in a very long time. Jess is surprised to see Tremaine showing up at Elsby again after being away for such a long time. Tremaine has explained to Jess that he is here to figure out the location of a transmitter. While Jess does not seem to be interested in the transmitters, he tells Tremaine about Bram. He explains to him that Bram is quite mysterious, which lead Tremaine to investigate on Bram’s properties. He informs Tremaine about Bram’s relationship with Linda Carroll, and then Tremaine pays her a visit and asks about Bram. Tremaine asks Jess to not tell anyone what they’ve discussed, but pretend that he is a tourist. Later, Jess asks Tremaine to find Bram together after pulling a car next to him on the street. Realizing that Bram is not home and the house seemed suspicious with blood and shotgun shell, they go to question Hull who is being held at the police station. Since Jess works at the police station, he can easily have Tremaine ask Hull questions. "
              },
              {
                "worker_id": "105",
                "uid": "26cb4561eac9454ea8f98fac0a8ddd55",
                "response_text": "The two used to live in the same town - Elsby. They share some childhood memories. They haven't seen each other for so long that Jess doesn't even recognize Jimmy at first. Their communication is friendly though they don't seem to have been close friends. Jess is older and he still lives in the town so he knows much more about it. Jimmy trusts him enough to tell about his secret mission, he believes Jess. can help. They cooperate throughout the story and help each other - Jess tells curious stories that may help, Jimmy accompanies him to the dark house with a gun. Jess has being hearing about Jimmy's work for the government these years. "
              },
              {
                "worker_id": "101",
                "uid": "791b2b3c348249568498c852f8fa1ce1",
                "response_text": "Tremaine, having grown up in Elsby, has a history with Jess, but Jess does not recognize him right away due to the amount of time that has passed. However, the two hit it off again automatically, and have a trusting relationship to each other. They act as partners, and Tremaine fills Jess in on his mission. Jess gives Tremaine any possible information, eager to help him. The two also have a candid relationship, shown when Jess asks Tremaine why the state police is not allowed to interfere with the investigation. "
              },
              {
                "worker_id": "104",
                "uid": "c45c051fb4aa4e1dbde23868e9f6dc2b",
                "response_text": "Jess is a police officer. When Jess reminds him who he is, it appears that the two have a friendly relationship where they have known each other for a while. They appear to be familiar with each other. They are probably friends as Jesses uses the nickname Jimmy when referring to Tremaine. Later in the story, Jess helps Tremaine search Bram’s property. It shows that they have a close relationship and that Tremaine trusts Jess. Tremaine is very private about the case and does not want many people to know his intentions in town, but he willingly tells Jess because he trusts him. "
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "103",
                "uid": "ca6954aa341f44a4ad84599dcfa6aa19",
                "response_text": "The story takes place in the late twentieth century in a town in America named Elsby. It starts out in Tremaine’s hotel room, after he is pressured, he goes to Elsby Municipal Police to find Jess. We follow Tremaine to the Municipal Office of Record and the Elsby Public Library to find out more information regarding the property that Bram owns currently, the mystery man in the town. Then he visits Linda Carroll’s house to learn more about Bram, but she does not seem to know much either. Later we follow Jess and Tremaine to Bram’s house since Jess is concerned that he still have not seen Bram. At Bram’s house, they do not find him, but there is blood and other suspicious objects. They believe that they have to find Hull in the police station. The story ends with Hull, Jess and Tremaine inside the police station at where Hull is being held. "
              },
              {
                "worker_id": "105",
                "uid": "26cb4561eac9454ea8f98fac0a8ddd55",
                "response_text": "The story begins in a room at the Elsby Commercial Town. A secret phone call takes place there. From the hotel Tremaine goes to the nearby municipal police. A huge policeman is sitting there behind the counter. The two move to the back room to talk. From there the main character heads toward the Elsby Town Hall, a squat brick building. Up the steps and behind the double-doors there is a dim corridor leading to \"municipal office of record\". There is a man over the counter who finds the data in a huge old book put on the table. In the late-afternoon Tremaine goes to the Public Library, where a paper-dry woman shows him the requested old newspapers from the shelves, they are to be handled carefully. Jimmy returns to the hotel, takes his car and follows the police past the Elsby city limits. He returns to his room and makes a call. Then he pays a visit to Miss Carol in her old mansion. Tremaine enters a pleasant parlor with old furniture. Jess picks him up and they drive to Mr. Bram's house. The place looks dark and dangerous, it looks as if it was empty for a week or so. Yelps and wails are heard from time to time, there is a trace of blood in the kitchen. The two return to the station and visit Hull's cell."
              },
              {
                "worker_id": "101",
                "uid": "791b2b3c348249568498c852f8fa1ce1",
                "response_text": "The story takes place in Elsby, a small, old town where a mysterious transmission has been detected. The story opens at Elsby Commercial Hotel, where Tremaine stays. Then, he visits multiple buildings throughout. The first place Tremaine visits is the police station, then the office of record, then the library. The buildings are described as run-down and discolored, indicative of their age. Tremaine then visits Miss Carroll's place, a large mansion with overgrown vines. Finally, Jess and Tremaine investigate Bram's house, a dark, abandoned-looking house."
              },
              {
                "worker_id": "104",
                "uid": "c45c051fb4aa4e1dbde23868e9f6dc2b",
                "response_text": "The story begins with Tremaine in his hotel room at the Elsby Commercial hotel. Tremaine leaves the hotel room and walks along Commerce Street towards the Elsby Municipal Police building. After talking with Jess at the police station, Tremaine leaves and heads towards the Municipal Office of Record. \n\nAfter finding out some information about Bram’s property at the Municipal Office of Record, Tremaine leaves to go to the library. It is not late in the afternoon. Once the library is closing, Tremaine leaves the building. When he’s outside, he bundles himself up in reaction to the cold weather. He heads back to his hotel but suddenly stops when a car speeds past him. He begins to run after the car until he gets to his own and then chases after the car in his car. After catching up with the car and finding out its purpose, he returns to his hotel room. \n\nAfter having a tense conversation with Fred on the phone, he again leaves his hotel room and walks outside. He walks through old houses until he comes upon a large, three-stories structure and enters its front gate. It’s Miss Carroll’s house. She lets him in and invites him to sit down in her leaving room. \n\nTremaine gathered as much information as he could about Bram from Miss Carroll and then leaves her house. When he walks outside, he notices a car pulling up and it stops by him. It’s Jess driving the car. They both then go to Bram’s property to inspect it themselves. They get to Bram’s property and when inspecting the outside of the house, they find an empty shotgun shell. After retrieving a gun from Jess’s car, they enter Bram’s house. They spot a trail of blood in the kitchen. While inspecting the house, they hear a lot of strange noises. Wanting to learn more information, they go to the jail to talk with one of the teenagers arrested for setting fire on Bram’s property. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4843,
        "document_length_chars": 27497
      }
    }
  ]
}