{
  "item_metadata": {
    "item_id": "52855",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "52855",
      "content": "THE STAR-SENT KNAVES\n \n\n \n BY KEITH LAUMER\n \n Illustrated by Gaughan\n \n [Transcriber's Note: This etext was produced from Worlds of Tomorrow June 1963 Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n When the Great Galactic Union first encounters Earth ... is this what is going to happen?\n \n \n\n I\n \n Clyde W. Snithian was a bald eagle of a man, dark-eyed, pot-bellied, with the large, expressive hands of a rug merchant. Round-shouldered in a loose cloak, he blinked small reddish eyes at Dan Slane's travel-stained six foot one.\n \n \"Kelly here tells me you've been demanding to see me.\" He nodded toward the florid man at his side. He had a high, thin voice, like something that needed oiling. \"Something about important information regarding safeguarding my paintings.\"\n \n \"That's right, Mr. Snithian,\" Dan said. \"I believe I can be of great help to you.\"\n \n \"Help how? If you've got ideas of bilking me....\" The red eyes bored into Dan like hot pokers.\n \n \"Nothing like that, sir. Now, I know you have quite a system of guards here—the papers are full of it—\"\n \n \"Damned busybodies! Sensation-mongers! If it wasn't for the press, I'd have no concern for my paintings today!\"\n \n \"Yes sir. But my point is, the one really important spot has been left unguarded.\"\n \n \"Now, wait a minute—\" Kelly started.\n \n \"What's that?\" Snithian cut in.\n \n \"You have a hundred and fifty men guarding the house and grounds day and night—\"\n \n \"Two hundred and twenty-five,\" Kelly snapped.\n \n \"—but no one at all in the vault with the paintings,\" Slane finished.\n \n \"Of course not,\" Snithian shrilled. \"Why should I post a man in the vault? It's under constant surveillance from the corridor outside.\"\n \n \"The Harriman paintings were removed from a locked vault,\" Dan said.\n\"There was a special seal on the door. It wasn't broken.\"\n \n \"By the saints, he's right,\" Kelly exclaimed. \"Maybe we ought to have a man in that vault.\"\n \n \"Another idiotic scheme to waste my money,\" Snithian snapped. \"I've made you responsible for security here, Kelly! Let's have no more nonsense. And throw this nincompoop out!\" Snithian turned and stalked away, his cloak flapping at his knees.\n \n \"I'll work cheap,\" Dan called after him as Kelly took his arm. \"I'm an art lover.\"\n \n \"Never mind that,\" Kelly said, escorting Dan along the corridor. He turned in at an office and closed the door.\n \n \"Now, as the old buzzard said, I'm responsible for security here. If those pictures go, my job goes with them. Your vault idea's not bad. Just how cheap would you work?\"\n \n \"A hundred dollars a week,\" Dan said promptly. \"Plus expenses,\" he added.\n \n Kelly nodded. \"I'll fingerprint you and run a fast agency check. If you're clean, I'll put you on, starting tonight. But keep it quiet.\"\n \n \n\n \n Dan looked around at the gray walls, with shelves stacked to the low ceiling with wrapped paintings. Two three-hundred-watt bulbs shed a white glare over the tile floor, a neat white refrigerator, a bunk, an arm-chair, a bookshelf and a small table set with paper plates, plastic utensils and a portable radio—all hastily installed at Kelly's order. Dan opened the refrigerator, looked over the stock of salami, liverwurst, cheese and beer. He opened a loaf of bread, built up a well-filled sandwich, keyed open a can of beer.\n \n It wasn't fancy, but it would do. Phase one of the plan had gone off without a hitch.\n \n Basically, his idea was simple. Art collections had been disappearing from closely guarded galleries and homes all over the world. It was obvious that no one could enter a locked vault, remove a stack of large canvases and leave, unnoticed by watchful guards—and leaving the locks undamaged.\n \n Yet the paintings were gone. Someone had been in those vaults—someone who hadn't entered in the usual way.\n \n Theory failed at that point; that left the experimental method. The Snithian collection was the largest west of the Mississippi. With such a target, the thieves were bound to show up. If Dan sat in the vault—day and night—waiting—he would see for himself how they operated.\n \n He finished his sandwich, went to the shelves and pulled down one of the brown-paper bundles. Loosening the string binding the package, he slid a painting into view. It was a gaily colored view of an open-air cafe, with a group of men and women in gay-ninetyish costumes gathered at a table. He seemed to remember reading something about it in a magazine. It was a cheerful scene; Dan liked it. Still, it hardly seemed worth all the effort....\n \n He went to the wall switch and turned off the lights. The orange glow of the filaments died, leaving only a faint illumination from the night-light over the door. When the thieves arrived, it might give him a momentary advantage if his eyes were adjusted to the dark. He groped his way to the bunk.\n \n So far, so good, he reflected, stretching out. When they showed up, he'd have to handle everything just right. If he scared them off there'd be no second chance. He would have lost his crack at—whatever his discovery might mean to him.\n \n But he was ready. Let them come.\n \n \n\n \n Eight hours, three sandwiches and six beers later, Dan roused suddenly from a light doze and sat up on the cot. Between him and the crowded shelving, a palely luminous framework was materializing in mid-air.\n \n The apparition was an open-work cage—about the size and shape of an out-house minus the sheathing, Dan estimated breathlessly. Two figures were visible within the structure, sitting stiffly in contoured chairs. They glowed, if anything, more brightly than the framework.\n \n A faint sound cut into the stillness—a descending whine. The cage moved jerkily, settling toward the floor. Long blue sparks jumped, crackling, to span the closing gap; with a grate of metal, the cage settled against the floor. The spectral men reached for ghostly switches....\n \n The glow died.\n \n Dan was aware of his heart thumping painfully under his ribs. His mouth was dry. This was the moment he'd been planning for, but now that it was here—\n \n Never mind. He took a deep breath, ran over the speeches he had prepared for the occasion:\n  Greeting, visitors from the Future....\n \n \n Hopelessly corny. What about: Welcome to the Twentieth Century....\n \n \n No good; it lacked spontaneity. The men were rising, their backs to Dan, stepping out of the skeletal frame. In the dim light it now looked like nothing more than a rough frame built of steel pipe, with a cluster of levers in a console before the two seats. And the thieves looked ordinary enough: Two men in gray coveralls, one slender and balding, the other shorter and round-faced. Neither of them noticed Dan, sitting rigid on the cot. The thin man placed a lantern on the table, twiddled a knob. A warm light sprang up. The visitors looked at the stacked shelves.\n \n \"Looks like the old boy's been doing all right,\" the shorter man said.\n\"Fathead's gonna be pleased.\"\n \n \"A very gratifying consignment,\" his companion said. \"However, we'd best hurry, Manny. How much time have we left on this charge?\"\n \n \"Plenty. Fifteen minutes anyway.\"\n \n The thin man opened a package, glanced at a painting.\n \n \"Ah, magnificent. Almost the equal of Picasso in his puce period.\"\n \n Manny shuffled through the other pictures in the stack.\n \n \"Like always,\" he grumbled. \"No nood dames. I like nood dames.\"\n \n \"Look at this, Manny! The textures alone—\"\n \n Manny looked. \"Yeah, nice use of values,\" he conceded. \"But I still prefer nood dames, Fiorello.\"\n \n \"And this!\" Fiorello lifted the next painting. \"Look at that gay play of rich browns!\"\n \n \"I seen richer browns on Thirty-third Street,\" Manny said. \"They was popular with the sparrows.\"\n \n \"Manny, sometimes I think your aspirations—\"\n \n \"Whatta ya talkin? I use a roll-on.\" Manny, turning to place a painting in the cage, stopped dead as he caught sight of Dan. The painting clattered to the floor. Dan stood, cleared his throat. \"Uh....\"\n \n \"Oh-oh,\" Manny said. \"A double-cross.\"\n \n \"I've—ah—been expecting you gentlemen,\" Dan said. \"I—\"\n \n \"I told you we couldn't trust no guy with nine fingers on each hand,\" Manny whispered hoarsely. He moved toward the cage. \"Let's blow, Fiorello.\"\n \n \"Wait a minute,\" Dan said. \"Before you do anything hasty—\"\n \n \"Don't start nothing, Buster,\" Manny said cautiously. \"We're plenty tough guys when aroused.\"\n \n \"I want to talk to you,\" Dan insisted. \"You see, these paintings—\"\n \n \"Paintings? Look, it was all a mistake. Like, we figured this was the gent's room—\"\n \n \"Never mind, Manny,\" Fiorello cut in. \"It appears there's been a leak.\"\n \n Dan shook his head. \"No leak. I simply deduced—\"\n \n \"Look, Fiorello,\" Manny said. \"You chin if you want to; I'm doing a fast fade.\"\n \n \"Don't act hastily, Manny. You know where you'll end.\"\n \n \"Wait a minute!\" Dan shouted. \"I'd like to make a deal with you fellows.\"\n \n \"Ah-hah!\" Kelly's voice blared from somewhere. \"I knew it! Slane, you crook!\"\n \n \n\n \n Dan looked about wildly. The voice seemed to be issuing from a speaker. It appeared Kelly hedged his bets.\n \n \"Mr. Kelly, I can explain everything!\" Dan called. He turned back to Fiorello. \"Listen, I figured out—\"\n \n \"Pretty clever!\" Kelly's voice barked. \"Inside job. But it takes more than the likes of you to out-fox an old-timer like Eddie Kelly.\"\n \n \"Perhaps you were right, Manny,\" Fiorello said. \"Complications are arising. We'd best depart with all deliberate haste.\" He edged toward the cage.\n \n \"What about this ginzo?\" Manny jerked a thumb toward Dan. \"He's on to us.\"\n \n \"Can't be helped.\"\n \n \"Look—I want to go with you!\" Dan shouted.\n \n \"I'll bet you do!\" Kelly's voice roared. \"One more minute and I'll have the door open and collar the lot of you! Came up through a tunnel, did you?\"\n \n \"You can't go, my dear fellow,\" Fiorello said. \"Room for two, no more.\"\n \n Dan whirled to the cot, grabbed up the pistol Kelly had supplied. He aimed it at Manny. \"You stay here, Manny! I'm going with Fiorello in the time machine.\"\n \n \"Are you nuts?\" Manny demanded.\n \n \"I'm flattered, dear boy,\" Fiorello said, \"but—\"\n \n \"Let's get moving. Kelly will have that lock open in a minute.\"\n \n \"You can't leave me here!\" Manny spluttered, watching Dan crowd into the cage beside Fiorello.\n \n \"We'll send for you,\" Dan said. \"Let's go, Fiorello.\"\n \n The balding man snatched suddenly for the gun. Dan wrestled with him. The pistol fell, bounced on the floor of the cage, skidded into the far corner of the vault. Manny charged, reaching for Dan as he twisted aside; Fiorello's elbow caught him in the mouth. Manny staggered back into the arms of Kelly, bursting red-faced into the vault.\n \n \"Manny!\" Fiorello released his grip on Dan, lunged to aid his companion. Kelly passed Manny to one of three cops crowding in on his heels. Dan clung to the framework as Fiorello grappled with Kelly. A cop pushed past them, spotted Dan, moved in briskly for the pinch. Dan grabbed a lever at random and pulled.\n \n Sudden silence fell as the walls of the room glowed blue. A spectral Kelly capered before the cage, fluorescing in the blue-violet. Dan swallowed hard and nudged a second lever. The cage sank like an elevator into the floor, vivid blue washing up its sides.\n \n Hastily he reversed the control. Operating a time machine was tricky business. One little slip, and the Slane molecules would be squeezing in among brick and mortar particles....\n \n But this was no time to be cautious. Things hadn't turned out just the way he'd planned, but after all, this was what he'd wanted—in a way. The time machine was his to command. And if he gave up now and crawled back into the vault, Kelly would gather him in and pin every art theft of the past decade on him.\n \n It couldn't be too hard. He'd take it slowly, figure out the controls....\n \n \n\n \n Dan took a deep breath and tried another lever. The cage rose gently, in eerie silence. It reached the ceiling and kept going. Dan gritted his teeth as an eight-inch band of luminescence passed down the cage. Then he was emerging into a spacious kitchen. A blue-haloed cook waddled to a luminous refrigerator, caught sight of Dan rising slowly from the floor, stumbled back, mouth open. The cage rose, penetrated a second ceiling. Dan looked around at a carpeted hall.\n \n Cautiously he neutralized the control lever. The cage came to rest an inch above the floor. As far as Dan could tell, he hadn't traveled so much as a minute into the past or future.\n \n He looked over the controls. There should be one labeled \"Forward\" and another labeled \"Back\", but all the levers were plain, unadorned black. They looked, Dan decided, like ordinary circuit-breaker type knife-switches. In fact, the whole apparatus had the appearance of something thrown together hastily from common materials. Still, it worked. So far he had only found the controls for maneuvering in the usual three dimensions, but the time switch was bound to be here somewhere....\n \n Dan looked up at a movement at the far end of the hall.\n \n A girl's head and shoulders appeared, coming up a spiral staircase. In another second she would see him, and give the alarm—and Dan needed a few moments of peace and quiet in which to figure out the controls. He moved a lever. The cage drifted smoothly sideways, sliced through the wall with a flurry of vivid blue light. Dan pushed the lever back. He was in a bedroom now, a wide chamber with flouncy curtains, a four-poster under a flowered canopy, a dressing table—\n \n The door opened and the girl stepped into the room. She was young. Not over eighteen, Dan thought—as nearly as he could tell with the blue light playing around her face. She had long hair tied with a ribbon, and long legs, neatly curved. She wore shorts and carried a tennis racquet in her left hand and an apple in her right. Her back to Dan and the cage, she tossed the racquet on a table, took a bite of the apple, and began briskly unbuttoning her shirt.\n \n Dan tried moving a lever. The cage edged toward the girl. Another; he rose gently. The girl tossed the shirt onto a chair and undid the zipper down the side of the shorts. Another lever; the cage shot toward the outer wall as the girl reached behind her back....\n \n Dan blinked at the flash of blue and looked down. He was hovering twenty feet above a clipped lawn.\n \n He looked at the levers. Wasn't it the first one in line that moved the cage ahead? He tried it, shot forward ten feet. Below, a man stepped out on the terrace, lit a cigarette, paused, started to turn his face up—\n \n Dan jabbed at a lever. The cage shot back through the wall. He was in a plain room with a depression in the floor, a wide window with a planter filled with glowing blue plants—\n \n The door opened. Even blue, the girl looked graceful as a deer as she took a last bite of the apple and stepped into the ten-foot-square sunken tub. Dan held his breath. The girl tossed the apple core aside, seemed to suddenly become aware of eyes on her, whirled—\n \n With a sudden lurch that threw Dan against the steel bars, the cage shot through the wall into the open air and hurtled off with an acceleration that kept him pinned, helpless. He groped for the controls, hauled at a lever. There was no change. The cage rushed on, rising higher. In the distance, Dan saw the skyline of a town, approaching with frightful speed. A tall office building reared up fifteen stories high. He was headed dead for it—\n \n He covered his ears, braced himself—\n \n With an abruptness that flung him against the opposite side of the cage, the machine braked, shot through the wall and slammed to a stop. Dan sank to the floor of the cage, breathing hard. There was a loud click! and the glow faded.\n \n With a lunge, Dan scrambled out of the cage. He stood looking around at a simple brown-painted office, dimly lit by sunlight filtered through elaborate venetian blinds. There were posters on the wall, a potted plant by the door, a heap of framed paintings beside it, and at the far side of the room a desk. And behind the desk—Something.\n \n \n\n II\n \n Dan gaped at a head the size of a beachball, mounted on a torso like a hundred-gallon bag of water. Two large brown eyes blinked at him from points eight inches apart. Immense hands with too many fingers unfolded and reached to open a brown paper carton, dip in, then toss three peanuts, deliberately, one by one, into a gaping mouth that opened just above the brown eyes.\n \n \"Who're you?\" a bass voice demanded from somewhere near the floor.\n \n \"I'm ... I'm ... Dan Slane ... your honor.\"\n \n \"What happened to Manny and Fiorello?\"\n \n \"They—I—There was this cop. Kelly—\"\n \n \"Oh-oh.\" The brown eyes blinked deliberately. The many-fingered hands closed the peanut carton and tucked it into a drawer.\n \n \"Well, it was a sweet racket while it lasted,\" the basso voice said. \"A pity to terminate so happy an enterprise. Still....\" A noise like an amplified Bronx cheer issued from the wide mouth.\n \n \"How ... what...?\"\n \n \"The carrier returns here automatically when the charge drops below a critical value,\" the voice said. \"A necessary measure to discourage big ideas on the part of wisenheimers in my employ. May I ask how you happen to be aboard the carrier, by the way?\"\n \n \"I just wanted—I mean, after I figured out—that is, the police ... I went for help,\" Dan finished lamely.\n \n \"Help? Out of the picture, unfortunately. One must maintain one's anonymity, you'll appreciate. My operation here is under wraps at present. Ah, I don't suppose you brought any paintings?\"\n \n Dan shook his head. He was staring at the posters. His eyes, accustoming themselves to the gloom of the office, could now make out the vividly drawn outline of a creature resembling an alligator-headed giraffe rearing up above scarlet foliage. The next poster showed a face similar to the beachball behind the desk, with red circles painted around the eyes. The next was a view of a yellow volcano spouting fire into a black sky.\n \n \"Too bad.\" The words seemed to come from under the desk. Dan squinted, caught a glimpse of coiled purplish tentacles. He gulped and looked up to catch a brown eye upon him. Only one. The other seemed to be busily at work studying the ceiling.\n \n \"I hope,\" the voice said, \"that you ain't harboring no reactionary racial prejudices.\"\n \n \n\n \n \"Gosh, no,\" Dan reassured the eye. \"I'm crazy about—uh—\"\n \n \"Vorplischers,\" the voice said. \"From Vorplisch, or Vega, as you call it.\" The Bronx cheer sounded again. \"How I long to glimpse once more my native fens! Wherever one wanders, there's no pad like home.\"\n \n \"That reminds me,\" Dan said. \"I have to be running along now.\" He sidled toward the door.\n \n \"Stick around, Dan,\" the voice rumbled. \"How about a drink? I can offer you Chateau Neuf du Pape, '59, Romance Conte, '32, goat's milk, Pepsi—\"\n \n \"No, thanks.\"\n \n \"If you don't mind, I believe I'll have a Big Orange.\" The Vorplischer swiveled to a small refrigerator, removed an immense bottle fitted with a nipple and turned back to Dan. \"Now, I got a proposition which may be of some interest to you. The loss of Manny and Fiorello is a serious blow, but we may yet recoup the situation. You made the scene at a most opportune time. What I got in mind is, with those two clowns out of the picture, a vacancy exists on my staff, which you might well fill. How does that grab you?\"\n \n \"You mean you want me to take over operating the time machine?\"\n \n \"Time machine?\" The brown eyes blinked alternately. \"I fear some confusion exists. I don't quite dig the significance of the term.\"\n \n \"That thing,\" Dan jabbed a thumb toward the cage. \"The machine I came here in. You want me—\"\n \n \"Time machine,\" the voice repeated. \"Some sort of chronometer, perhaps?\"\n \n \"Huh?\"\n \n \"I pride myself on my command of the local idiom, yet I confess the implied concept snows me.\" The nine-fingered hands folded on the desk. The beachball head leaned forward interestedly. \"Clue me, Dan. What's a time machine?\"\n \n \"Well, it's what you use to travel through time.\"\n \n The brown eyes blinked in agitated alternation. \"Apparently I've loused up my investigation of the local cultural background. I had no idea you were capable of that sort of thing.\" The immense head leaned back, the wide mouth opening and closing rapidly. \"And to think I've been spinning my wheels collecting primitive 2-D art!\"\n \n \"But—don't you have a time machine? I mean, isn't that one?\"\n \n \"That? That's merely a carrier. Now tell me more about your time machines. A fascinating concept! My superiors will be delighted at this development—and astonished as well. They regard this planet as Endsville.\"\n \n \n\n \n \"Your superiors?\" Dan eyed the window; much too far to jump. Maybe he could reach the machine and try a getaway—\n \n \"I hope you're not thinking of leaving suddenly,\" the beachball said, following Dan's glance. One of the eighteen fingers touched a six-inch yellow cylinder lying on the desk. \"Until the carrier is fueled, I'm afraid it's quite useless. But, to put you in the picture, I'd best introduce myself and explain my mission here. I'm Blote, Trader Fourth Class, in the employ of the Vegan Confederation. My job is to develop new sources of novelty items for the impulse-emporiums of the entire Secondary Quadrant.\"\n \n \"But the way Manny and Fiorello came sailing in through the wall! That has to be a time machine they were riding in. Nothing else could just materialize out of thin air like that.\"\n \n \"You seem to have a time-machine fixation, Dan,\" Blote said. \"You shouldn't assume, just because you people have developed time travel, that everyone has. Now—\" Blote's voice sank to a bass whisper—\"I'll make a deal with you, Dan. You'll secure a small time machine in good condition for me. And in return—\"\n \n \" I'm supposed to supply you with a time machine?\"\n \n Blote waggled a stubby forefinger at Dan. \"I dislike pointing it out, Dan, but you are in a rather awkward position at the moment. Illegal entry, illegal possession of property, trespass—then doubtless some embarrassment exists back at the Snithian residence. I daresay Mr. Kelly would have a warm welcome for you. And, of course, I myself would deal rather harshly with any attempt on your part to take a powder.\" The Vegan flexed all eighteen fingers, drummed his tentacles under the desk, and rolled one eye, bugging the other at Dan.\n \n \"Whereas, on the other hand,\" Blote's bass voice went on, \"you and me got the basis of a sweet deal. You supply the machine, and I fix you up with an abundance of the local medium of exchange. Equitable enough, I should say. What about it, Dan?\"\n \n \"Ah, let me see,\" Dan temporized. \"Time machine. Time machine—\"\n \n \"Don't attempt to weasel on me, Dan,\" Blote rumbled ominously.\n \n \"I'd better look in the phone book,\" Dan suggested.\n \n Silently, Blote produced a dog-eared directory. Dan opened it.\n \n \"Time, time. Let's see....\" He brightened. \"Time, Incorporated; local branch office. Two twenty-one Maple Street.\"\n \n \"A sales center?\" Blote inquired. \"Or a manufacturing complex?\"\n \n \"Both,\" Dan said. \"I'll just nip over and—\"\n \n \"That won't be necessary, Dan,\" Blote said. \"I'll accompany you.\" He took the directory, studied it.\n \n \"Remarkable! A common commodity, openly on sale, and I failed to notice it. Still, a ripe nut can fall from a small tree as well as from a large.\" He went to his desk, rummaged, came up with a handful of fuel cells. \"Now, off to gather in the time machine.\" He took his place in the carrier, patted the seat beside him with a wide hand. \"Come, Dan. Get a wiggle on.\"\n \n \n\n \n Hesitantly, Dan moved to the carrier. The bluff was all right up to a point—but the point had just about been reached. He took his seat. Blote moved a lever. The familiar blue glow sprang up. \"Kindly direct me, Dan,\" Blote demanded. \"Two twenty-one Maple Street, I believe you said.\"\n \n \"I don't know the town very well,\" Dan said, \"but Maple's over that way.\"\n \n Blote worked levers. The carrier shot out into a ghostly afternoon sky. Faint outlines of buildings, like faded negatives, spread below. Dan looked around, spotted lettering on a square five-story structure.\n \n \"Over there,\" he said. Blote directed the machine as it swooped smoothly toward the flat roof Dan indicated.\n \n \"Better let me take over now,\" Dan suggested. \"I want to be sure to get us to the right place.\"\n \n \"Very well, Dan.\"\n \n Dan dropped the carrier through the roof, passed down through a dimly seen office. Blote twiddled a small knob. The scene around the cage grew even fainter. \"Best we remain unnoticed,\" he explained.\n \n The cage descended steadily. Dan peered out, searching for identifying landmarks. He leveled off at the second floor, cruised along a barely visible corridor. Blote's eyes rolled, studying the small chambers along both sides of the passage at once.\n \n \"Ah, this must be the assembly area,\" he exclaimed. \"I see the machines employ a bar-type construction, not unlike our carriers.\"\n \n \"That's right,\" Dan said, staring through the haziness. \"This is where they do time....\" He tugged at a lever suddenly; the machine veered left, flickered through a barred door, came to a halt. Two nebulous figures loomed beside the cage. Dan cut the switch. If he'd guessed wrong—\n \n The scene fluoresced, sparks crackling, then popped into sharp focus. Blote scrambled out, brown eyes swivelling to take in the concrete walls, the barred door and—\n \n \"You!\" a hoarse voice bellowed.\n \n \"Grab him!\" someone yelled.\n \n Blote recoiled, threshing his ambulatory members in a fruitless attempt to regain the carrier as Manny and Fiorello closed in. Dan hauled at a lever. He caught a last glimpse of three struggling, blue-lit figures as the carrier shot away through the cell wall.\n \n \n\n III\n \n Dan slumped back against the seat with a sigh. Now that he was in the clear, he would have to decide on his next move—fast. There was no telling what other resources Blote might have. He would have to hide the carrier, then—\n \n A low growling was coming from somewhere, rising in pitch and volume. Dan sat up, alarmed. This was no time for a malfunction.\n \n The sound rose higher, into a penetrating wail. There was no sign of mechanical trouble. The carrier glided on, swooping now over a nebulous landscape of trees and houses. Dan covered his ears against the deafening shriek, like all the police sirens in town blaring at once. If the carrier stopped it would be a long fall from here. Dan worked the controls, dropping toward the distant earth.\n \n The noise seemed to lessen, descending the scale. Dan slowed, brought the carrier in to the corner of a wide park. He dropped the last few inches and cut the switch.\n \n As the glow died, the siren faded into silence.\n \n Dan stepped from the carrier and looked around. Whatever the noise was, it hadn't attracted any attention from the scattered pedestrians in the park. Perhaps it was some sort of burglar alarm. But if so, why hadn't it gone into action earlier? Dan took a deep breath. Sound or no sound, he would have to get back into the carrier and transfer it to a secluded spot where he could study it at leisure. He stepped back in, reached for the controls—\n \n There was a sudden chill in the air. The bright surface of the dials before him frosted over. There was a loud pop! like a flashbulb exploding. Dan stared from the seat at an iridescent rectangle which hung suspended near the carrier. Its surface rippled, faded to blankness. In a swirl of frosty air, a tall figure dressed in a tight-fitting white uniform stepped through.\n \n Dan gaped at the small rounded head, the dark-skinned long-nosed face, the long, muscular arms, the hands, their backs tufted with curly red-brown hair, the strange long-heeled feet in soft boots. A neat pillbox cap with a short visor was strapped low over the deep-set yellowish eyes, which turned in his direction. The wide mouth opened in a smile which showed square yellowish teeth.\n \n \" Alors, monsieur ,\" the new-comer said, bending his knees and back in a quick bow. \" Vous ete une indigine, n'est ce pas? \"\n \n \"No compree,\" Dan choked out \"Uh ... juh no parlay Fransay....\"\n \n \"My error. This is the Anglic colonial sector, isn't it? Stupid of me. Permit me to introduce myself. I'm Dzhackoon, Field Agent of Class five, Inter-dimensional Monitor Service.\"\n \n \"That siren,\" Dan said. \"Was that you?\"\n \n Dzhackoon nodded. \"For a moment, it appeared you were disinclined to stop. I'm glad you decided to be reasonable.\"\n \n \"What outfit did you say you were with?\" Dan asked.\n \n \"The Inter-dimensional Monitor Service.\"\n \n \"Inter-what?\"\n \n \"Dimensional. The word is imprecise, of course, but it's the best our language coder can do, using the Anglic vocabulary.\"\n \n \"What do you want with me?\"",
      "metadata": {
        "title": "The Star-Sent Knaves",
        "author": "Keith Laumer",
        "passage_id": "52855",
        "uid": "a1f43a9489d9444f8b3f27efd935d5b3",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "101",
                "uid": "5dd4584b64cd4013a05f1a25d0fb5c3b",
                "response_text": "Dan Slane is in Clyde Snithian's office; he proposes that, in response to a recent slew of art thefts, he guard Snithian's art vault overnight in addition to the external security he has. Dan is suspicious about the thefts and has a theory that the crooks are entering from within the vaults, perhaps through time travel. Snithian refuses to hire Dan, but Kelly, head of security, hires him in secret. That night, Dan guards from within the vault, keeping himself occupied with sleep and food, when a strange, cage like contraption appears out of thin air. Two men emerge, named Manny and Fiorello, and Dan hesitantly confronts them. While Dan speaks to them, Kelly's voice suddenly booms from a hidden speaker in the room, under the impression that Dan had been in on the thefts. Dan wrestles Manny and Fiorello off and manages to take control of the carrier and escape. Not knowing how to control it, Dan finds himself passing through many rooms and settings, until the carrier finally settles in an office room of a skyscraper. There, Dan meets Blote, a strange, giant-like creature, who asks him what happened to Manny and Fiorello. Blote, the apparent head of the art schemes, requests that Dan join the team to replace them. Dan refuses, and asks about the carrier, referring to it as a time machine; Blote is perplexed, unaware of the concept of a time machine, and demands that Dan find one in exchange for a reward, and for avoiding trouble for trespassing. Dan, unsure of where to retrieve a time machine, bluffs and manages to take Blote back to Snithian's, where he abandons him. Suddenly, Dan hears a siren, and the carrier travels to a park. The carrier becomes frosted over as a man emerges to confront him. The man introduces himself as an agent of the Inter-Dimensional Monitor Service."
              },
              {
                "worker_id": "105",
                "uid": "0908baab3d9e4c83a9be168b643c07d6",
                "response_text": "Dan Slane approaches Clyde Snithian to tell about a flaw in the guarding system for paintings. There are more than two hundred bodyguards across the house but none in the vault, which is dangerous, because recently art collections were disappearing from locked vaults all over the world. Clyde refuses to waste more money on security and walks away, while Kelly, who is responsible for security, agrees to hire Dan for cheap. Dan makes himself comfortable at the new workplace and waits for the thieves to find out how they break in, which is his real goal. After eight hours, a framework appears in the air with two figures from the future sitting within, who soon step out into the vault. The two men, Manny and Fiorello, open and admire the paintings from the shelves without noticing Dan. When they realize his presence, the men try to back off and pretend to confuse the rooms. When Dan starts proposing a deal, Kelly's voice proclaims Dan a crook. Dan wants to join the departing men, and as there is only room for two, he aims the pistol at Manny. A fight for place happens and Kelly enters, grabbing Manny. Fiorello rushes to help his friend, another cop moves towards Dan, who enters the time machine and pulls a lever at random. Dan's plan goes wrong but he has the machine for himself as he wanted and he needs to figure out the controls. He emerges into a kitchen and then moves through the house to avoid being seen, unable to travel in time. Dan nearly crashes into a building but suddenly finds himself in an office with a weird creature at the desk. The boss asks about his two employees and Dan's coming. The creature comes from Vorplisch and proposes to Dan to take the place of Manny and Fiorello. When Dan mentions the time-machine, it turns out that the framework is a simple carrier, but a time-machine intrigues the creature who believes the humans have developed one. The creature introduces himself as Blote and warns Dan against trying to leave. He also tasks Dan with securing a time-machine for Blote, otherwise, Dan will be dealt harshly with. Dan points at the first name in the phone book and Blote decides to accompany him to the office to buy a time-machine. Blote is surprised he missed this development. The two drive towards the pointed building and get into it in secret. Inside, someone catches Blote for the break-in and Dan leaves in the carrier. Some noise appears from the machine and Dan finds himself in a park, where another creature named Dzhackoon appears, he is from Inter-dimensional Monitor Service. \n"
              },
              {
                "worker_id": "107",
                "uid": "606a6489aa824107a87203bd52f29b0b",
                "response_text": "Clyde W. Snithian is meeting with Dan Slane. Dan has told Eddie Kelly that he to see Snithian regarding the safeguarding of his paintings. Although Snithian has stationed two hundred and twenty-five guards working at all times, nobody is in the vault with the paintings. Snithian thinks it is unnecessary, but Kelly finds that Dan has a point. Snithian thinks it is unnecessary, but he is hired secretly anyway because he is willing to work cheaply. His purpose of doing this job is to see whoever has been stealing art from collections without entering the usual way. Since the Snithian collection is the largest west of the Mississippi, he waits inside and sees how the thieves operate. Eight hours later, Dan wakes up from his light doze when an apparition in the shape of an open-work cage with two figures inside suddenly materializes. Two men rise out of the cage, and they are pleased that the collection is fully-stocked. The shorter man, named Manny, complains that there are no nood dames. The taller man, named Fiorello, remarks on the artistic techniques of the paintings. Dan suddenly interrupts their conversation, and the two try to come up with excuses. Suddenly, Mr. Kelly’s voice interrupts them as he assumes that Dan is working with the two. Dan points a pistol at Manny and tells him to stay because he will go with Fiorello; Kelly and three cops suddenly appear to confront them. As they struggle, Dan gets into the machine and tries to get a grip on the controls. He neutralizes the control lever to rest an inch above the floor, and a young girl appears at the end of the hallway. The girl gets ready to get into a tub, and as she whirls to see if there is anybody, the cage shoots with great acceleration. He scrambles out of the cage once he reaches his destination and sees a large man with too many hands behind a desk. The man is a Vorplischer, and he is confused when Dan calls the contraption a time machine. It is simply a carrier, and beachball says that his superiors will be delighted with any knowledge of a time machine. He introduces himself as Blote and tells Dan to bring back a small time machine. Dan pretends to bluff, and Blote says that he will go with him to the location he has picked. As Dan leads him through the building area in the cage, Manny and Fiorello come back for revenge. The carrier, with Dan in it, shoots away again; he begins to hear sirens as it goes to a new location. Although it does not catch the attention of anyone, Dan steps out to investigate as a dark-skinned, long-nosed, and  tall figure in a white uniform approaches him. The man, named Dzhackoon, introduces himself as a member of the Inter-dimensional Monitor Service and tells him that he is glad Dan stopped. Dan is confused and asks what Dzhackoon wants from him. "
              },
              {
                "worker_id": "104",
                "uid": "67b2102064a84a55a17285dc33d447ba",
                "response_text": "The story begins with Dan Slane in Clyde W. Snithian’s office. Dan is trying to convince Clyde that he has a deficiency in his security details and he would be the perfect person to fix the issuer. He is dismissed by the man, but Kelly, Clyde’s head of security pulls him aside and informs him that he will hire him. Dan agrees to the conditions and is quickly put to work to monitor the vault by staying inside of it. \n\nDan’s plan is to catch the thieves that are entering vaults and successfully stealing artwork. He has a suspicion that there is time travel involved in the plan. He suddenly wakes up and notices two frames in the vault with him. They are discussing their mission and the paintings that they spot in the vault. One of them eventually notices Dan, and he tries to stammer out a reply. He tells the two men, Fiorella and Manny, that he wants to join them. Kelly, who is listening into the fault, overhears Dan betraying him and shouts as such over a speaker installed in the vault. Dan gets into the carrier and successfully steals it. He figures out how to operate it and eventually ends up at the office of Blote. Blote, a Fourth Class Trader employed by the Vegan Confederation, is the boss of Manny and Fiorello. He’s not mad at Dan and is willing to allow Dan to join his operations. During their discussions, Dan keeps insisting that a carrier is a time machine. Blote misunderstands Dan’s assertions and believes him to not be referring to the carrier as he has never heard of someone successfully inventing the time machine. Blote then insists that Dan immediately take him to a time machine. Dan agrees to do so, and Blote controls the carrier to take both of them there. However, it is a trap and they end up in the vault where Manny and Fiorello still are trapped. Manny, Fiorello, and Blote are all angry with Dan and try to take control of the carrier. Dan is able to get away and he quickly moves the carrier into a different location. When the carrier settles again, he is greeted by a strange-looking figure that speaks to him in French. After some slight discussion between the two, Dan is told that he is in a place called the Anglic colonial sector and that the man is with the Inter-dimensional Monitor Service. It is clear that Dan has ended up in another strange and unknown location and is confused by his predicament. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "101",
                "uid": "5dd4584b64cd4013a05f1a25d0fb5c3b",
                "response_text": "The first part of the story takes place in Snithian's headquarters, where he speaks to Dan in his office. Later that night, Dan sleeps in the art vault, a small room with gray walls that support paintings wrapped in brown paper. The room contains a bunk, fridge, and bookshelf. Once Dan escapes through the carrier, he finds himself passing through different rooms, including a kitchen, hallway, and bedroom. The carrier then takes him to an office in a skyscraper, with posters, framed paintings, and a desk, where he finds Blote. After returning back to Snithian's, the carrier takes him to a large park."
              },
              {
                "worker_id": "105",
                "uid": "0908baab3d9e4c83a9be168b643c07d6",
                "response_text": "The story starts on Snithian's property. Dan is hired to guard his art collection. The vault has gray walls, shelves stacked with wrapped paintings, a refrigerator with some snacks, a radio, an armchair bunk, a bookshelf and a small table. Soon a framework appears in the air with two people in armchairs. A mess takes place and Dan enters the framework alone. There are a lot of controls and levers, so Dan moves into some spacious kitchen with a cook. Then he travels through the house with a carpeted hall, a spiral staircase, a wide bedroom with flouncy curtains, a dressing table and a flowered canopy. Outside there is a clipped lawn an d a terrace, inside Dan appears in a plain room with a planter and a wide window. Suddenly, he heads towards some building wall and finds himself in a simple brown office with dim light, posters, paintings and a weird creature at the table, Blote. The two then travel in the framework to a corporation building. Trough a flat roof the carrier enters the dim office with some machines. When Blote is caught, Dan takes the carrier to the park, accompanied bosom siren-like noise. In the park he faces a tall man reminding Blote. "
              },
              {
                "worker_id": "107",
                "uid": "606a6489aa824107a87203bd52f29b0b",
                "response_text": "The story is initially set at Clyde W. Snithian’s home. There is a vault full of paintings that is unguarded until Dan offers to become a guard. In the vault, there are shelves stacked with wrapped paintings under a low ceiling. Two three-hundred-watt bulbs also light the place up. To prepare Dan, Kelly has also ordered a neat-white refrigerator, a bunk, an arm-chair, a bookshelf, and a small table. The table is set with paper plates, plastic utensils, and a radio. Inside the fridge, Dan finds salami, liverwurst, cheese, and beer. The carrier that arrives in is an open-work cage about the size and shape of an outhouse minus the sheathing. There are two contoured chairs too. When Dan grabs the lever, he finds himself in a room with walls that glow blue. There is also a second lever present too. There is a third lever that causes the carrier to rise. The levers themselves do not have any controls written by them, and they are all plain, unadorned black. They look like ordinary circuit-breaker type knife-switches, and even the entire carrier looks hastily thrown together. He reaches an area with a hallway and goes into a bedroom shortly after. It is a wide chamber with flouncy curtains, a four-poster bed with a flowered canopy, and a dressing table. The area he is in has a terrace. Then, he steers the machine to a plain room with a depression in the floor, a wide window, and a planter filled with glowing blue plants. In the room, there is also a ten-foot-square sunken tub. The office that Blote is in is painted a simple brown, dimly lit by sunlight filtered through elaborate Venetian blinds. There is also a potted plant by the door, a heap of framed paintings beside it, and a desk on the far side of the room. Posters also line the walls of the office. The Time office that they go to is a square, five-story structure with lettering. The location is two twenty-one Maple Street. There is a dimly seen office, a second floor, and a barely visible corridor. Finally, when he gets into the carrier again, it takes him to an area where there is a landscape of trees and houses. He stops at the corner of a wide park. \n"
              },
              {
                "worker_id": "104",
                "uid": "67b2102064a84a55a17285dc33d447ba",
                "response_text": "The story begins in Clyde W. Snithian’s office. After being hired by the head of security, Kelly, Dan settles into living within the vault. The vault is described as having grey walls with a low ceiling. Shelves are stacked against the walls and wrapped paintings are adorned upon them. There is a refrigerator, a bed, an armchair, a table, and a bookshelf along with other useful supplies for Dan to live in the vault. After taking the travel apparatus from the two art thieves, Fiorello and Manny, Dan ends up at the office of Blote. Under false pretences, Dan and Blote both end up traveling back to the vault where Manny and Fiorello still are trapped. Dan successfully is able to maneuver the three away from the carrier and he navigates it to a different location away from the vault. When Dan steps out of the carrier, he meets a strange-looking man. Through small talk, the man informs Dan that he is in the Anglic colonial sector speaking to a Field Agent of Class five with the Inter-dimensional Monitor Service.  "
              }
            ]
          },
          {
            "question_text": "What is the relationship between Dan and Blote?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "101",
                "uid": "5dd4584b64cd4013a05f1a25d0fb5c3b",
                "response_text": "Dan first meets Blote when he finally stops the carrier. Blote is a giant, strange man with a beachball-like head and many fingers, with a mouth above his eyes. Dan is immediately intimidated and fascinated by Blote, and Blote, aware of his superiority, requests that Dan replace Manny and Fiorello in the art stealing scheme. When Dan refuses, Blote orders that he find him a time machine and threatens to punish him for trespassing. Dan manages to fool Blote, but the two have an imbalanced power relationship, where Blote is much more powerful than Dan. "
              },
              {
                "worker_id": "105",
                "uid": "0908baab3d9e4c83a9be168b643c07d6",
                "response_text": "Dan is mistaken and he believes the carrier to be a time-machine, so he doesn't expect to meet Blote, especially considering the fact that the least is an alien. Dan basically spoils Blote's mission by preventing his two employees' escape. This mistake makes Blote to be seeking for the new employees and as Dan has seen him and knows about his crimes, he offers the job to the man. Dan is afraid and has no means to escape. Blote believes humans to develop a time-machine due to Dan's mistake and now he wants Dan to get it. So, their relationship is based on confusion and dangerous fo Dan. For that reason, the least leaves Blote behind and escapes, stealing the carrier. "
              },
              {
                "worker_id": "107",
                "uid": "606a6489aa824107a87203bd52f29b0b",
                "response_text": "Blote is very interested after seeing Dan arrive from the carrier. He asks who Dan is and what he did to the other two men. He also supposes that Dan did not bring any paintings back after finding out how he got on the carrier. When Blote catches Dan looking at him, he says that he hopes Dan does not harbor any racial prejudices against him. He offers Dan something to drink after revealing what species he is from. Although Manny and Fiorello are gone, Blote is interested in hiring Dan as one of the staff. When Dan asks him about the time machine, however, he assumes that Dan is talking about how he knows where to get one. Dan is confused since he thinks that a carrier is a time machine. However, he becomes shocked once he realizes what Blote wants him to do for him to pay back for taking the carrier. To escape, he bluffs Blote into taking him to the fake Time location. Although Blote trusts him, Dan betrays this trust once Manny and Fiorello appear, leaving the three of them behind. "
              },
              {
                "worker_id": "104",
                "uid": "67b2102064a84a55a17285dc33d447ba",
                "response_text": "Dan and Blote meet after Dan takes the apparatus from Fiorello and Manny after their tussle in the vault. Blote is the boss of Fiorello and Manny. Blote does not appear to be mad at Dan and even tries to recruit Dan to join his operations. He speaks very matter of fact to Dan and appears to try to answer his questions even though he does become confused at some of them. He trusts Dan to show him where to find a time machine and they both get on the carrier to go to the supposed location. However, Dan eventually betrays this trust and leads him into a trap. Then Dan ultimately takes the carrier again and goes to another unknown location. "
              }
            ]
          },
          {
            "question_text": "What happens to Dan throughout the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "101",
                "uid": "5dd4584b64cd4013a05f1a25d0fb5c3b",
                "response_text": "Dan first proposes to Snithian that he take on the job of guarding his art vault at night in order to catch the mysterious,  serial art thieves. Snithian declines, but Kelly, head of security, accepts, and that night Dan is settled into the vault. After a few hours, Dan is shocked to see a machine appear out of thin air, where two men appear to steal the art. Dan believes this is a time machine, but Kelly suddenly arrives and threatens to arrest Dan, believing he is part of an inside job. Dan attempts to escape with the carrier, and after a few detours, he ends up in the office of a large man named Blote. He asks Blote about the carrier, implying that it is a time machine, but Blote demands that Dan supply him with a time machine, as his people have never seen one. Dan leads Blote back to the Snithian office, where Manny and Fiorello see him, but he manages to escape once again. Then, Dan hears a siren as the carrier hurdles through the air, and he is met by a man who says he is from the Inter-dimensional Monitor Service. "
              },
              {
                "worker_id": "105",
                "uid": "0908baab3d9e4c83a9be168b643c07d6",
                "response_text": "Dan has heard about painting being stolen from locked vaults and he has some guesses, which he wants to confirm. So he gets a job as a vault guard for cheap at Snithian's vault, where the collection is read and must attract the thieves. He faces two men exiting from a framework and believes them to come in a time-machine from the future. He asks to join them and as they don't have space for him, he attacks them and leaves alone. The plan goes wrong when Dan can't figure out how to control the machine and finds himself in a house full of people, He moves from one room to another trying not to be seen. Eventually, the carrier takes him to Blote's office who is a weirdly looking creature and who makes Dan scared. Dan is in danger and has to bluff, as Blote wants him to get a time-machine. So, the two enter an office where Dan leaves Blote behind and escapes the guard. On the way, he hears loud siren-like noise and stepson a park, where he meets another creature reminding Blote. "
              },
              {
                "worker_id": "107",
                "uid": "606a6489aa824107a87203bd52f29b0b",
                "response_text": "Throughout the story, Dan goes to a variety of places via the carrier. He is initially hired as a guard, but he eventually escapes with the carrier. He is able to outsmart Manny and Fiorello, taking the carrier and going to a variety of rooms nearby. After, the carrier takes him to Blote, who then demands him to go retrieve a small time machine for further analysis. Not trusting that Dan won’t escape on his own, Blote decides to go with him to see the time machines himself. Dan is once again traveling on the carrier by himself when he leaves Blote behind with the other two men who have come back for revenge. Then, he has an encounter with Dzhackoon, who sounds the alarm that causes him to land the carrier once again."
              },
              {
                "worker_id": "104",
                "uid": "67b2102064a84a55a17285dc33d447ba",
                "response_text": "The story begins with Dan trying to convince a wealthy man to hire him onto the security detail for his valuable art collection. Dan has heard that valuable art has been stolen and he has his suspicions as to how. He does get hired by the head of security, Kelly, to live in the vault to guard it against potential thieves. Dan’s predictions are somewhat accurate as two men do suddenly appear in the vault to steal the art. He then proceeds to try to convince them to take him with them as he believes that it is a time machine they are using to complete their heists. Kelly overhears this through the microphones he had installed in the vault and tells Dan that when he gets inside he will be punished. Dan becomes frantic and in a tussle with the two art thieves, Manny and Fiorello, he steals their apparatus and activates it to the best of his abilities. The following sequence of events has Dan transported to different locations that cause more confusion. The owner of the apparatus, or the carrier, does not confirm Dan’s suspicion that it is a time machine and even seems confused by the question. Dan continues to travel to unknown locations without a clear way of returning to his proper location. "
              }
            ]
          },
          {
            "question_text": "What equipment is used in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "101",
                "uid": "5dd4584b64cd4013a05f1a25d0fb5c3b",
                "response_text": "The main piece of equipment used in the story is the carrier that Manny and Fiorello arrive in. The carrier contains lots of different levers and controls that make it difficult to navigate. It is able to appear out of thin air, a cage-like structure that has a blue luminous glow to it. Despite the futuristic abilities of the carrier, it is made up of common parts and is not the sturdiest. The carrier is able to appear in random places, but it is also used by Blote to travel to Maple Street."
              },
              {
                "worker_id": "105",
                "uid": "0908baab3d9e4c83a9be168b643c07d6",
                "response_text": "The vault is locked and guarded by armed people, Dan himself is supplied with a pistol. The two men appear in a glowing framework in the air, which Dan believes to be a time machine. Indeed, it's an inter-dimensional carrier which can travel rapidly through walls but not through time. It's equipped with multiple levers and controls, which are hard to figure. Siren-like sound is used by inter-dimensional Monitor Service to make the carriers stop. "
              },
              {
                "worker_id": "107",
                "uid": "606a6489aa824107a87203bd52f29b0b",
                "response_text": "The carrier is the main piece of equipment used throughout the story. It is capable of taking its passengers to a variety of different places by using specific controls and can pass through walls undetected. It is how the art thieves were capable of stealing many pieces of art, despite the vaults often being heavily guarded or sealed. Another piece of equipment is the pistol that Dan points at Manny. It is supplied by Kelly, and Dan does not fire it but uses it to threaten the other man into staying so he can go aboard the carrier. Another piece of equipment used is the siren that Dzhackoon sounds. It sounds like a typical police siren, but nobody else hears it except for Dan. "
              },
              {
                "worker_id": "104",
                "uid": "67b2102064a84a55a17285dc33d447ba",
                "response_text": "The main equipment that is used in the story is a travel apparatus that is used by Manny and Fiorello to get into the vault to steal valuable artwork. Dan believes it to be a time machine. He takes the apparatus from the two thieves and uses it to go to a different location where he meets Blote, the two thieves’ boss. While on his journey, he figures out how to use the different levels on the machine to control the direction of travel. When he implies to Blote that it is a time machine, Blote is confused and shows that he does not know of the existence of a time machine. Blote calls the travel apparatus a carrier.  "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4881,
        "document_length_chars": 28761
      }
    }
  ]
}