{
  "item_metadata": {
    "item_id": "55801",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "55801",
      "content": "THE FIRST MAN INTO SPACE\n \n \n Cadet Marshall Farnsworth woke from a nightmare of exploding novae and fouling rockets. After recovering from his fright, he laughed contemptuously at himself. “Here I was picked as the most stable of a group of two hundred cadets,” he thought, “and chosen to make man’s first trip into space, yet I’m shaking like a leaf.”\n \n He got out of bed and went over to the window. From his father’s temporary apartment, he could see distant Skyharbor, the scene of the plunge into space tomorrow night. He had been awarded the frightening honor of making that trip.\n \n 10\n \n As he watched teardrop cars whip along Phoenix, Arizona’s, double-decked streets, elevated over one another to avoid dangerous intersections and delaying stop lights, he thought back over the years; to the 1950’s, when mice and monkeys were sent up in Vikings to launch mankind’s first probing of the mysterious space beyond Earth, and the first satellites were launched; to the 1960’s, when huger, multiple-stage rockets finally conquered the problem of escape velocity; to 1975—today—when man was finally ready to send one of his own kind into the uninhabited deeps.\n \n Marsh climbed back into bed, but sleep would not come.\n \n In the adjoining room, he could hear the footsteps of mother and father. By their sound he knew they were the footsteps of worried people. This hurt Marsh more than his own uneasiness.\n \n The anxiety had begun for them, he knew, when he had first signed up for space-cadet training. They had known there was an extremely high percentage of washouts, and after each test he passed, they had pretended to be glad. But Marsh knew that inwardly they had hoped he would fail, for they were aware of the ultimate goal that the space scientists were working for—the goal that had just now been reached.\n \n Marsh finally fell into a troubled sleep that lasted until morning.\n \n He woke early, before the alarm rang. He got up, showered, pulled on his blue-corded cadet uniform, and tugged on the polished gray boots. He took one final look around his room as though in farewell, then went out to the kitchen.\n \n 11\n \n His folks were up ahead of time too, trying to act as though it were just another day. Dad was pretending to enjoy his morning paper, nodding only casually to Marsh as he came in. Mom was stirring scrambled eggs in the skillet, but she wasn’t a very good actor, Marsh noticed, for she furtively wiped her eyes with her free hand.\n \n The eggs were cooked too hard and the toast had to be scraped, but no one seemed to care. The three of them sat down at the table, still speaking in monosyllables and of unimportant things. They made a pretense of eating.\n \n “Well, Mom,” Dad suddenly said with a forced jollity that was intended to break the tension, “the Farnsworth family has finally got a celebrity in it.”\n \n “I don’t see why they don’t send an older man!” Mom burst out, as though she had been holding it in as long as she could. “Sending a boy who isn’t even twenty-two—”\n \n “Things are different nowadays, Mom,” Dad explained, still with the assumed calmness that masked his real feelings. “These days, men grow up faster and mature quicker. They’re stronger and more alert than older men—” His voice trailed off as if he were unable to convince himself.\n \n “ Some body has to go,” Marsh said. “Why not a younger man without family and responsibility? That’s why they’re giving younger men more opportunities today than they used to.”\n \n “It’s not younger men I’m talking about!” Mom blurted. “It’s you, Marsh!”\n \n 12\n \n Dad leaned over and patted Mom on the shoulder.\n“Now, Ruth, we promised not to get excited this morning.”\n \n “I’m sorry,” Mom said weakly. “But Marsh is too young to—” She caught herself and put her hand over her mouth.\n \n “Stop talking like that!” Dad said. “Marsh is coming back. There’ve been thousands of rockets sent aloft. The space engineers have made sure that every bug has been ironed out before risking a man’s life. Why, that rocket which Marsh is going up in is as safe as our auto in the garage, isn’t it, Marsh?”\n \n “I hope so, Dad,” Marsh murmured.\n \n \n\n Later, as Dad drove Marsh to the field, each brooded silently. Every scene along the way seemed to take on a new look for Marsh. He saw things that he had never noticed before. It was an uncomfortable feeling, almost as if he were seeing these things for the last as well as the first time.\n \n Finally the airport came into view. The guards at the gate recognized Marsh and ushered the Farnsworth car through ahead of scores of others that crowded the entrance. Some eager news photographers slipped up close and shot off flash bulbs in Marsh’s eyes.\n \n Skyharbor, once a small commercial field, had been taken over by the Air Force in recent years and converted into the largest rocket experimental center in the United States.\n \n 13\n \n Dad drove up to the building that would be the scene of Marsh’s first exhaustive tests and briefings. He stopped the car, and Marsh jumped out. Their good-by was brief. Marsh saw his father’s mouth quiver. There was a tightness in his own throat. He had gone through any number of grueling tests to prove that he could take the rigors of space, but not one of them had prepared him for the hardest moments of parting.\n \n When Dad had driven off, Marsh reported first to the psychiatrist who checked his condition.\n \n “Pulse fast, a rise in blood pressure,” he said.\n“You’re excited, aren’t you, son?”\n \n “Yes, sir,” Marsh admitted. “Maybe they’ve got the wrong man, sir. I might fail them.”\n \n The doctor grinned. “They don’t have the wrong man,” he said. “They might have, with a so-called iron-nerved fellow. He could contain his tension and fears until later, until maybe the moment of blast-off. Then he’d let go, and when he needed his calmest judgment he wouldn’t have it. No, Marshall, there isn’t a man alive who could make this history-making flight without some anxiety. Forget it. You’ll feel better as the day goes on. I’ll see you once more before the blast-off.”\n \n Marsh felt more at ease already. He went on to the space surgeon, was given a complete physical examination, and was pronounced in perfect condition. Then began his review briefing on everything he would encounter during the flight.\n \n 14\n \n Blast-off time was for 2230, an hour and a half before midnight. Since at night, in the Western Hemisphere, Earth was masking the sun, the complications of excessive temperatures in the outer reaches were avoided during the time Marsh would be outside the ship. Marsh would occupy the small upper third section of a three-stage rocket. The first two parts would be jettisoned after reaching their peak velocities. Top speed of the third stage would carry Marsh into a perpetual-flight orbit around Earth, along the route that a permanent space station was to be built after the results of the flight were studied. After spending a little while in this orbit, Marsh would begin the precarious journey back to Earth, in gliding flight.\n \n He got a few hours of sleep after sunset. When an officer shook him, he rose from the cot he had been lying on in a private room of General Forsythe, Chief of Space Operations.\n \n “It’s almost time, son,” the officer said. “Your CO wants to see you in the outside office.”\n \n Marsh went into the adjoining room and found his cadet chief awaiting him. The youth detected an unusual warmth about the severe gentleman who previously had shown only a firm, uncompromising attitude. Colonel Tregasker was past middle age, and his white, sparse hair was smoothed down close to his head in regulation neatness.\n \n 15\n \n “Well, this is it, Marshall,” the colonel said.\n“How I envy you this honor of being the first human to enter space. However, I do feel that a part of me is going along too, since I had a small share in preparing you for the trip. If the training was harsh at times, I believe that shortly you will understand the reason for it.”\n \n “I didn’t feel that the Colonel was either too soft or strict, sir,” Marsh said diplomatically.\n \n A speaker out on the brilliantly lit field blared loudly in the cool desert night: “X minus forty minutes.”\n \n “We can’t talk all night, Marshall,” the colonel said briskly. “You’ve got a job to do. But first, a few of your friends want to wish you luck.” He called into the anteroom, “You may come in, gentlemen!”\n \n There filed smartly into the room ten youths who had survived the hard prespace course with Marsh and would be his successors in case he failed tonight. They formed a line and shook hands with Marsh. The first was Armen Norton who had gotten sick in the rugged centrifuge at a force of 9 G’s, then had rallied to pass the test.\n \n “Good luck, Marsh,” he said.\n \n Next was lanky Lawrence Egan who had been certain he would wash out during navigation phase in the planetarium. “All the luck in the world, Marsh,” he added.\n \n Each cadet brought back a special memory of his training as they passed before him, wishing him success.\n \n 16\n \n When they had gone and the speaker outside had announced: “X minus thirty minutes,” the colonel said that he and Marsh had better be leaving. Colonel Tregasker was to be Marsh’s escort to the ship.\n \n Photographers and newspapermen swarmed about them as they climbed into the jeep that was to take them to the launching site farther out on the field. Questions were flung at the two from all sides, but the colonel deftly maneuvered the jeep through the mob and sped off over the asphalt.\n \n At the blast-off site, Marsh could see that the police had their hands full keeping out thousands of spectators who were trying to get into the closed-off area. The field was choked with a tide of humanity milling about in wild confusion. Giant searchlights, both at the airport and in other parts of Phoenix, directed spears of light on the towering rocket that held the interest of all the world tonight. There was one light, far larger than the rest, with powerful condensing lenses and connected to a giant radar screen, which would guide Marsh home from his trip among the stars.\n \n A high wire fence surrounded the launching ramp and blockhouses. International scientists and dignitaries with priorities formed a ring around the fence, but even they were not allowed inside the small circle of important activity. The guards waved the colonel and Marsh through the gate.\n \n 17\n \n Marsh had spent many weeks in a mock-up of the tiny third stage in which he was to spend his time aloft, but he had never been close to the completely assembled ship until this moment. The three stages had been nicknamed, “Tom,” “Dick,” and “Harry.” Marsh swallowed as his eyes roved up the side of the great vessel, part of a project that had cost millions to perfect and was as high as a four-story building.\n \n The gigantic base, “Big Tom,” was the section that would have the hardest job to do, that of thrusting the rocket through the densest part of the atmosphere, and this was a great deal larger than the other sections. Marsh knew that most of the ship’s bulk was made up of the propellant fuel of hydrazine hydrate and its oxidizer, nitric acid.\n \n “We’re going into that blockhouse over there,” Colonel Tregasker said. “You’ll don your space gear in there.”\n \n First a multitude of gadgets with wires were fastened to the cadet’s wrists, ankles, nose, and head. Marsh knew this to be one of the most important phases of the flight—to find out a man’s reaction to space flight under actual rocketing conditions. Each wire would telemeter certain information by radio back to the airport. After a tight inner G suit had been put on to prevent blackout, the plastic and rubber outer garment was zipped up around Marsh, and then he was ready except for his helmet, which would not be donned until later.\n \n 18\n \n Marsh and the colonel went back outside. The open-cage elevator was lowered from the top of the big latticed platform that surrounded the rocket. The two got into the cage, and it rose with them. Marsh had lost most of his anxiety and tension during the activities of the day, but his knees felt rubbery in these final moments as the elevator carried him high above the noisy confusion of the airport. This was it.\n \n \n As they stepped from the cage onto the platform of the third stage, Marsh heard the speaker below call out: “X minus twenty minutes.”\n \n There were eleven engineers and workmen on the platform readying the compartment that Marsh would occupy. Marsh suddenly felt helpless and alone as he faced the small chamber that might very well be his death cell. Its intricate dials and wires were staggering in their complexity.\n \n Marsh turned and shook hands with Colonel Tregasker.\n“Good-by, sir,” he said in a quavering voice.\n“I hope I remember everything the Corps taught me.” He tried to smile, but his facial muscles twitched uncontrollably.\n \n “Good luck, son—lots of it,” the officer said huskily. Suddenly he leaned forward and embraced the youth with a firm, fatherly hug. “This is not regulations,” he mumbled gruffly, “but hang regulations!” He turned quickly and asked to be carried down to the ground.\n \n A man brought Marsh’s helmet and placed it over his head, then clamped it to the suit. Knobs on the suit were twisted, and Marsh felt a warm, pressurized helium-oxygen mixture fill his suit and headpiece.\n \n 19\n \n Marsh stepped through the hatch into the small compartment. He reclined in the soft contour chair, and the straps were fastened by one of the engineers over his chest, waist, and legs. The wires connected to various parts of his body had been brought together into a single unit in the helmet. A wire cable leading from the panel was plugged into the outside of the helmet to complete the circuit.\n \n Final tests were run off to make sure everything was in proper working order, including the two-way short-wave radio that would have to penetrate the electrical ocean of the ionosphere. Then the double-hatch air lock was closed. Through his helmet receiver, Marsh could hear the final minutes and seconds being called off from inside the blockhouse.\n \n “Everything O.K.?” Marsh was asked by someone on the platform.\n \n “Yes, sir,” Marsh replied.\n \n “Then you’re on your own,” were the final ominous words.\n \n “X minus five minutes,” called the speaker.\n \n 20\n \n It was the longest five minutes that Marsh could remember. He was painfully aware of his cramped quarters. He thought of the tons of explosive beneath him that presently would literally blow him sky-high. And he thought of the millions of people the world over who, at this moment, were hovering at radios and TV’s anxiously awaiting the dawn of the space age. Finally he thought of Dad and Mom, lost in that multitude of night watchers, and among the few who were not primarily concerned with the scientific aspect of the experiment. He wondered if he would ever see them again.\n \n “X minus sixty seconds!”\n \n Marsh knew that a warning flare was being sent up, to be followed by a whistle and a cloud of smoke from one of the blockhouses. As he felt fear trying to master him, he began reviewing all the things he must remember and, above all, what to do in an emergency.\n \n “X minus ten seconds—five—four—three—two—one—FIRE!”\n \n There was a mighty explosion at Skyharbor.\n \n The initial jolt which Marsh felt was much fiercer than the gradually built up speed of the whirling centrifuge in training. He was crushed deeply into his contour chair. It felt as though someone were pressing on his eyeballs; indeed, as if every organ in his body were clinging to his backbone. But these first moments would be the worst. A gauge showed a force of 7 G’s on him—equal to half a ton.\n \n He watched the Mach numbers rise on the dial in front of his eyes on an overhead panel. Each Mach number represented that much times the speed of sound, 1,090 feet per second, 740 miles an hour.\n \n Marsh knew “Big Tom” would blast for about a minute and a half under control of the automatic pilot, at which time it would drop free at an altitude of twenty-five miles and sink Earthward in a metal mesh ’chute.\n \n 21\n \n Marsh’s hurting eyes flicked to the outside temperature gauge. It was on a steady 67 degrees below zero Fahrenheit, and would be until he reached twenty miles. A reflecting prism gave him a square of view of the sky outside. The clear deep blue of the cloud-free stratosphere met his eyes.\n \n Mach 5, Mach 6, Mach 7 passed very quickly. He heard a rumble and felt a jerk. “Big Tom” was breaking free. The first hurdle had been successfully overcome, and the ship had already begun tilting into its trajectory.\n \n There was a new surge of agony on his body as the second stage picked up the acceleration at a force of 7 G’s again. Marsh clamped his jaws as the force pulled his lips back from his teeth and dragged his cheek muscles down. The Mach numbers continued to rise—11, 12, 13—to altitude 200 miles, the outer fringe of the earth’s atmosphere. There was a slight lifting of the pressure on his body. The rocket was still in the stratosphere, but the sky was getting purple.\n \n Mach 14—10,000 miles an hour.\n \n “Dick” would jettison any moment. Marsh had been aloft only about four minutes, but it had seemed an age, every tortured second of it.\n \n 22\n \n There was another rumble as the second stage broke free. Marsh felt a new surge directly beneath him as his own occupied section, “Harry,” began blasting. It was comforting to realize he had successfully weathered those tons of exploding hydrazine and acid that could have reduced him to nothing if something had gone wrong. Although his speed was still building up, the weight on him began to ease steadily as his body’s inertia finally yielded to the sickeningly swift acceleration.\n \n The speedometer needle climbed to Mach 21, the peak velocity of the rocket, 16,000 miles per hour. His altitude was 350 miles—man’s highest ascent. Slowly then, the speedometer began to drop back. Marsh heard the turbo pumps and jets go silent as the “lift” fuel was spent and rocket “Harry” began its free-flight orbit around Earth.\n \n The ship had reached a speed which exactly counterbalanced the pull of gravity, and it could, theoretically, travel this way forever, provided no other outside force acted upon it. The effect on Marsh now was as if he had stopped moving. Relieved of the viselike pressure, his stomach and chest for a few seconds felt like inflated balloons.\n \n “Cadet Farnsworth,” the voice of General Forsythe spoke into his helmet receiver, “are you all right?”\n \n “Yes, sir,” Marsh replied. “That is, I think so.”\n \n It was good to hear a human voice again, something to hold onto in this crazy unreal world into which he had been hurtled.\n \n “We’re getting the electronic readings from your gauges O.K.,” the voice went on. “The doctor says your pulse is satisfactory under the circumstances.”\n \n It was queer having your pulse read from 350 miles up in the air.\n \n 23\n \n Marsh realized, of course, that he was not truly in the “air.” A glance at his air-pressure gauge confirmed this. He was virtually in a vacuum. The temperature and wind velocity outside might have astounded him if he were not prepared for the readings. The heat was over 2000 degrees Fahrenheit, and the wind velocity was of hurricane force! But these figures meant nothing because of the sparseness of air molecules. Temperature and wind applied only to the individual particles, which were thousands of feet apart.\n \n “How is your cosmic-ray count?” asked the general.\n \n Marsh checked the C-ray counter on the panel from which clicking sounds were coming. “It’s low, sir. Nothing to worry about.”\n \n Cosmic rays, the most powerful emanations known, were the only radiation in space that could not be protected against. But in small doses they had been found not to be dangerous.\n \n “As soon as our recorders get more of the figures your telemeter is giving us,” the operations chief said, “you can leave the rocket.”\n \n When Marsh got the O.K. a few minutes later, he eagerly unstrapped the belts around his body. He could hardly contain his excitement at being the first person to view the globe of Earth from space. As he struggled to his feet, the lightness of zero gravity made him momentarily giddy, and it took some minutes for him to adjust to the terribly strange sensation.\n \n 24\n \n He had disconnected the cable leading from his helmet to the ship’s transmitter and switched on the ship’s fast-lens movie camera that would photograph the area covered by “Harry.” Then he was ready to go outside. He pressed a button on the wall, and the first air-lock hatch opened. He floated into the narrow alcove and closed the door in the cramped chamber behind him. He watched a gauge, and when it showed normal pressure and temperature again, he opened the outside hatch, closing it behind him. Had Marsh permitted the vacuum of space to contact the interior of the ship’s quarters, delicate instruments would have been ruined by the sudden decompression and loss of heat. Marsh fastened his safety line to the ship so that there was no chance of his becoming separated from it.\n \n Then he looked “downward,” to experience the thrill of his life. Like a gigantic relief map, the panorama of Earth stretched across his vision. A downy blanket of gray atmosphere spread over the whole of it, and patches of clouds were seen floating like phantom shapes beneath the clear vastness of the stratosphere. It was a stunning sight for Marsh, seeing the pinpoint lights of the night cities extending from horizon to horizon. It gave him an exhilarating feeling of being a king over it all.\n \n 25\n \n Earth appeared to be rotating, but Marsh knew it was largely his own and the rocket’s fast speed that was responsible for the illusion. As he hung in this region of the exosphere, he was thankful for his cadet training in zero gravity. A special machine, developed only in recent years, simulated the weightlessness of space and trained the cadets for endurance in such artificial conditions.\n \n “Describe some of the things you see, Marshall,” General Forsythe said over Marsh’s helmet receiver.\n“I’ve just cut in a recorder.”\n \n “It’s a scene almost beyond description, sir,” Marsh said into the helmet mike. “The sky is thickly powdered with stars. The Milky Way is very distinct, and I can make out lots of fuzzy spots that must be star clusters and nebulae and comets. Mars is like an extremely bright taillight, and the moon is so strong it hurts my eyes as much as the direct sun does on earth.”\n \n Marsh saw a faintly luminous blur pass beyond the ship. It had been almost too sudden to catch. He believed it to be a meteor diving Earthward at a speed around forty-five miles a second. He reported this to the general.\n \n As he brought his eyes down from the more distant fixtures of space to those closer by on Earth, a strange thing happened. He was suddenly seized with a fear of falling, although his zero-gravity training had been intended to prepare him against this very thing. A cold sweat come out over his body, and an uncontrollable panic threatened to take hold of him.\n \n 26\n \n He made a sudden movement as though to catch himself. Forgetting the magnification of motion in frictionless space and his own weightlessness, he was shot quickly to the end of his safety line like a cracked whip. His body jerked at the taut end and then sped swiftly back in reaction toward the ship, head foremost. A collision could crack his helmet, exposing his body to decompression, causing him to swell like a balloon and finally explode.\n \n In the grip of numbing fear, only at the last moment did he have the presence of mind to flip his body in a half-cartwheel and bring his boots up in front of him for protection. His feet bumped against the rocket’s side, and the motion sent him hurtling back out to the end of the safety line again. This back-and-forth action occurred several times before he could stop completely.\n \n “I’ve got to be careful,” he panted to himself, as he thought of how close his space career had come to being ended scarcely before it had begun.\n \n General Forsythe cut in with great concern, wondering what had happened. When Marsh had explained and the general seemed satisfied that Marsh had recovered himself, he had Marsh go on with his description.\n \n His senseless fear having gone now, Marsh looked down calmly, entranced as the features of the United States passed below his gaze. He named the cities he could identify, also the mountain ranges, lakes, and rivers, explaining just how they looked from 350 miles up. In only a fraction of an hour’s time, the rocket had traversed the entire country and was approaching the twinkling phosphorescence of the Atlantic.\n \n 27\n \n Marsh asked if “Tom” and “Dick” had landed safely.\n \n “‘Tom’ landed near Roswell, New Mexico,” General Forsythe told him, “and the ’chute of the second section has been reported seen north of Dallas. I think you’d better start back now, Marshall. It’ll take us many months to analyze all the information we’ve gotten. We can’t contact you very well on the other side of the world either, and thirdly, I don’t want you exposed to the sun’s rays outside the atmosphere in the Eastern Hemisphere any longer than can be helped.”\n \n Marsh tugged carefully on his safety line and floated slowly back toward the ship. He entered the air lock. Then, inside, he raised the angle of his contour chair to upright position, facing the console of the ship’s manual controls for the glide Earthward. He plugged in his telemeter helmet cable and buckled one of the straps across his waist.\n \n Since he was still moving at many thousands of miles an hour, it would be suicide to plunge straight downward. He and the glider would be turned into a meteoric torch. Rather, he would have to spend considerable time soaring in and out of the atmosphere in braking ellipses until he reached much lower speed. Then the Earth’s gravitational pull would do the rest.\n \n 28\n \n This was going to be the trickiest part of the operation, and the most dangerous. Where before, Marsh had depended on automatic controls to guide him, now much of the responsibility was on his own judgment. He remembered the many hours he had sweated through to log his flying time. Now he could look back on that period in his training and thank his lucky stars for it.\n \n He took the manual controls and angled into the atmosphere. He carefully watched the AHF dial—the atmospheric heat friction gauge. When he had neared the dangerous incendiary point, with the ship having literally become red-hot, he soared into the frictionless vacuum again. He had to keep this up a long time in order to reduce his devastating speed.\n \n It was something of a shock to him to leave the black midnight of Earth’s slumbering side for the brilliant hemisphere where the people of Europe and Asia were going about their daytime tasks. He would have liked to study this other half of the world which he had glimpsed only a few times before in his supersonic test flights, but he knew this would have to wait for future flights.\n \n Finally, after a long time, his velocity was slowed enough so that the tug of gravity was stronger than the rocket’s ability to pull up out of the atmosphere. At this point, Marsh cut in “Harry’s” forward braking jets to check his falling speed.\n \n “There’s something else to worry about,” he thought to himself. “Will old Harry hold together or will he fly apart in the crushing atmosphere?”\n \n 29\n \n The directional radio signals from the powerful Skyharbor transmitter were growing stronger as Marsh neared the shores of California. He could see the winking lights of San Diego and Los Angeles, and farther inland the swinging thread that was the beacon at Skyharbor. All planes in his path of flight had been grounded for the past few hours because of the space flight. The only ground light scanning the skies was the gigantic space beacon in Phoenix.\n \n When Marsh reached Arizona, he began spiraling downward over the state to kill the rest of his altitude and air speed. Even now the plane was a hurtling supersonic metal sliver streaking through the night skies like a comet. He topped the snow-capped summits of the towering San Francisco Peaks on the drive southward, and he recognized the sprawling serpent of the Grand Canyon. Then he was in the lower desert regions of moon-splashed sand and cactus. Although the fire-hot temperature of the outer skin had subsided, there had been damage done to the walls and instruments, and possibly to other parts, too. Marsh was worried lest his outside controls might be too warped to give him a good touchdown, if indeed he could get down safely at all.\n \n A few thousand feet up, Marsh lowered his landing gear. Now the only problem left was to land himself and the valuable ship safely inside the narrow parallels of the airstrip. He circled the airport several times as his altitude continued to plummet.\n \n 30\n \n The meter fell rapidly. His braking rocket fuel was gone now. From here on in, he would be on gliding power alone.\n \n “Easy does it, Marshall,” the general said quietly into his ear. “You’re lining up fine. Level it out a little and keep straight with the approach lights. That’s fine. You’re just about in.”\n \n The lights of the airport seeming to rush up at him, Marsh felt a jolt as the wheels touched ground on the west end of the runway. He kept the ship steady as it scurried along the smooth asphalt, losing the last of its once tremendous velocity. The plane hit the restraining wire across the strip and came to a sudden stop, shoving Marsh hard against the single safety belt he wore. Finally, incredibly, the ship was still and he was safe.\n \n He unfastened his strap and removed his space helmet. The heat of the compartment brought the sweat out on his face. He rose on wobbly legs and pressed the buttons to the hatches. The last door flew open to admit the cool, bracing air of Earth which he had wondered if he would ever inhale again.\n \n His aloneness was over then, suddenly and boisterously, as men swarmed over him with congratulations, eager questions, and looks of respect. Reporters’ flash bulbs popped, and he felt like a new Lindbergh as he was pulled down to the ground and mobbed. Finally the police came to his rescue and pushed back the curiosity seekers and newspapermen. Then only three men were allowed through the cordon.",
      "metadata": {
        "title": "The First Man into Space",
        "author": "Richard M. Elam, Jr.",
        "passage_id": "55801",
        "uid": "7355746b048d404cb698cbc2eeb5f047",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "105",
                "uid": "65bbde9020f0492b92481e5fce854187",
                "response_text": "Cadet Marshall Farnsworth wakes up at night, frightened by the sound of rockets. He looks in the window and thinks about his upcoming trip to space, as a first man, reflecting upon the history of mankind and space interaction. The next morning he has a short but difficult talk with his anxious parents. Marsh's dad takes him to the Skyharbor, the young man feels uneasy. Then he goes through a check up at psychiatrist's and space surgeon's, revises the route, and takes a nap. Then his Colonel gives him a brief speech, and his cadet friends wish him luck. Thousands of spectators and reporters try to see Marsh on his way to the rocket. Various gadgets are put on Marsh, he rises to the platform, says warm goodbye to the Colonel, and puts the helmet on. Inside the ship Marsh is fastened and final tests take place before he is left alone with his nerves. The last five minutes are long, Marsh thinks about his planet and parents, and then the ship sets off. Minutes seem an eternity, the first phase is behind, and upon reaching the peak velocity the speed starts to drop back. The free-flight orbit is reached and Marsh hears General Forsythe's earthly and calming voice. All the indicators are good and Marsh gets excited to be the first one to leave the rocket and look at the globe from space. He takes all the precautions and the first glance \"downward\" makes him feel like the king of the universe. Suddenly, he feels like he is falling and makes a forbidden movement, which leads to him bouncing from and back to the rocket a couple times, when he has to try hard to stop. When he calms down after the fright, he starts describing what he sees. General orders Marsh to go back and he returns to his cabin. The hardest part begins, as the speed of the ship is high and needs to be reduced. When Marsh succeeds in doing so, the ship heads back to Earth. Marsh has to make a couple spirals and near the airport the braking fuel is gone. Eventually, he manages to exit and breathe the air of Earth and is attacked by the reporters, until he is left with only three men. \n"
              },
              {
                "worker_id": "107",
                "uid": "190d881635c94b1eafc193fab9f65874",
                "response_text": "Cadet Marshall Farnsworth is chosen out of two hundred cadets to make man's first trip into space. He is considered one of the most stable, but he is still nervous after waking up from a nightmare. Marsh tries to sleep again, but he is unable to because of the anxious footsteps of his mother and father. He finally falls asleep until the alarm goes off in the morning and prepares himself for the big day. Marsh's parents pretend to be happy the next day, but he knows that they do not want him to go. They try to convince themselves that he will be the Farnsworth family celebrity and completely safe in the rocket. When his father drops him off, they share a brief goodbye, and he begins to go through his pre-flight examinations. Further instructions regarding Marsh's take-off time and position are given to him. He manages to sleep for a few more hours before he talks to Colonel Tregasker. The Colonel wishes him luck and brings in ten more cadets who would be Marsh's replacement should he fail the trip. He then escorts Mash to the ship once the speaker announces that there are less than thirty minutes. There are crowds of photographers and newspapermen in the area, looking for a chance to interview Marsh. However, the Colonel leads him to a blockhouse where he puts on his space gear. He puts on a multitude of gadgets, and the two of them get into the cage that takes them to the platform of the third stage. Marsh begins to feel fear, even though there are workmen and engineers preparing the compartment because he also thinks that this may be his death chamber. He says his goodbye to the Colonel, and a man hands him his helmet. He waits inside the compartment, and the rocket launches soon after. The rocket then fires, and Marsh begins to see the mach numbers rise. After seeing the other parts rise, the voice of General Forsythe speaks to him and tells him that everything is going fine so far. When Marsh gets the O.K. signal, he exits the rocket and begins eagerly describing what he sees in space, such as the rotating Earth and the Milky Way. Marsh no longer feels any fear anymore as he observes space. The General then tells him to go back to avoid further danger, and he prepares himself to return to Earth's atmosphere. He comes back safely, sees many familiar sights along the way, and prepares to land the valuable ship. The General reassures him, and he safely returns to the ground again after gliding. Many reporters come to greet him, but the police safely escort him. Only three men are allowed to follow through the cordon."
              },
              {
                "worker_id": "106",
                "uid": "723b2678aca9400b9259e6fccb381d3f",
                "response_text": "Cadet Marshall Farnsworth is to be the first man to ever go into space. He wakes up the morning of the day he is meant to take off, and has breakfast with his parents. His Dad drives him to the airport \"Skyharbour\" where the rocket is waiting to launch. Marsh goes through various checks with doctors to make sure he is in shape for flying. Blast off is set for 22:30. As the day goes on he becomes more calm, and goes for a nap in the general's office. He is awoken and goes to met with his CO, Colonel Tregasker. They talk for a while and then are met by Marshall's comrades, who wish him luck. The Colonel and Marshall make their way to the blockhouse, where Marshall changes into his space suit. He is plastered with different wires to convey information back to the station about his state. They move to the elevator that takes them to the door hatch of the rocket. They say their goodbyes and Marsh steps into the compartment. Some final tests are done and then the countdown begins. The rocket blasts off, Marsh being thrown back in his seat in agony. The first part of the rocket breaks off, then the second, until he is left with just his compartment outside of the atmosphere, just as planned. When Marsh gets into a steady orbit, he exits the cabin, attached to the ship by his tether. He talks to the general about what he can see of Earth. He then looks under his feet and gets the sense of falling and becomes panicked, pushing himself to the end of his tether, and then knocking against the ship, back and forth. He eventually regains himself and re-enters the cabin. After that he starts his initial descent, swerving in and out of the atmosphere to avoid burning up on re-entry. Slowly, he makes it down to the surface, using his training. He makes it back in one piece, and is greeted by crowds of people. "
              },
              {
                "worker_id": "103",
                "uid": "993690eabb81489fab79ff40ace8e0f3",
                "response_text": "The Air Force is getting ready for a rocket blast off the next day. And the rocket is scheduled to blast off at 10:30 PM in the evening. It will go into the orbit around Earth, and once it is stable cadet Marshall Farnsworth, the trained astronaut, will go take a trip to the outside of the rocket, in space, then it would return, carrying Marsh back to Earth. The rocket consists of three parts, where two of them will fall off after the fuel are used and before entering into the orbit. \n\nThe story starts with Marsh having a bad dream about not able to make it to space and back. Apparently, he is not the only one worried, so are his parents. The next morning, his parents tries to act as if they are glad for him, but later his mom was not able to hold it anymore, luckily Dad is able to stop her so that the morning will not be filled with sadness. After Dad drives Marsh to Skyharbor, where the rocket will be blasting, they quickly said goodbye to each other, and Marsh goes to get a physical examination and a briefing. After a quick nap, he is woken up by the colonel and greets his classmates whom he went through the trainings with. \n\nWhen it was thirty minutes until the blast off, the colonel escorts Marsh to the ship to have his gears put on except his helmet. Then, he takes the lift that gets him to the platform surrounding the rocket, where he puts on his helmet and steps into the ship to make sure everything works fine. The countdown goes to zero and the rocket rises into the sky. \n\nAs he keeps on rising, the two parts of the rocket drop as they are supposed to. Then he successfully goes into the orbit as predicted. After a few minutes, he gets the order to leave the rocket. Where he sees the stunning view of Earth from space. Despite a small accident with no injuries, his trip outside the rocket goes well. Then he is ready to get back to Earth. He uses his skills and talents, after a long time, he finally lands safely. After a few seconds of aloneness, men come running and congratulating him. "
              }
            ]
          },
          {
            "question_text": "How do Marsh's emotions change throughout the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "105",
                "uid": "65bbde9020f0492b92481e5fce854187",
                "response_text": "During his last night on Earth, Marsh appears to be tense and scared, blaming himself for not being as strong as he wishes to be. He also feels the anxiety of his parents and is sad to see them like that. All the day before the trip, Marsh looks at everything around as if it is the last time he sees it. He feels unprepared and uneasy about parting. At the same time, he is excited, and his pulse goes up, which makes him feel unworthy of the honor. Then Marsh eases a little and even takes a nap. The atmosphere of goodbyes with his team is warm and full of good memories. When Marsh is left alone in the cabin, he becomes scared and thinks about the spectators and his parents, wondering if he sees his home ever again The countdown adds to his anxiety and the last seconds before departure seem an eternity. Marsh tries to concentrate and distract himself from the thoughts. The voice of the general brings ease and seeing how well things go, Marsh gets excited. He feels proud and extremely impressed with the view, forgetting about caution. Suddenly he is afraid to fall and makes a wrong move, which scares him a lot. Calming down after that, Marsh is able to manage himself and complete the mission. When he gets back to Earth he is full of disbelief that he made it, and he is extremely happy to smell the air of home. "
              },
              {
                "worker_id": "107",
                "uid": "190d881635c94b1eafc193fab9f65874",
                "response_text": "Marsh is initially nervous before his trip. He feels even worse by his parents' reactions but understands that he must not miss this opportunity. When he sees the doctor briefly after arriving, he cannot help but admit that he is excited to go to space. He begins to feel more at ease after the doctor reassures him and continues to do so up until he sees the rocket. Marsh's helpless feeling and anxiety come back here since he will be going to space. Once he reaches space, however, he is excited by the entirely new perspective of the galaxy he sees in front of him. There is a brief moment where he panics in the frictionless space, but he manages to control himself and becomes more careful. He then continues to try and remain calm for the remainder of the journey back home, knowing that many of the operations required to safely land must be done calmly. "
              },
              {
                "worker_id": "106",
                "uid": "723b2678aca9400b9259e6fccb381d3f",
                "response_text": "In the beginning of the story, Marsh is nervous and has anxiety for the journey ahead. He is sad when talking with his parents at breakfast, not knowing if they'll see them again. As he gets to the Skyharbour, he becomes trepidation, wondering if he was the right man for the job. His nerves calm after he talks with the psychiatrist, and then more as the day progresses. He gets nervous again as the rocket takes off, fearing for his life. He is overcome with joy when he gets to exit the cabin, and see the Earth from above. He is once again stricken with fear when he looks down below, floating in space. His fear starts to creep back in on re-entry, as he could burn up. Once he makes it to the ground, he is filled with a sense of relief, breathing the air he didn't know if he'd ever breathe again. \n"
              },
              {
                "worker_id": "103",
                "uid": "993690eabb81489fab79ff40ace8e0f3",
                "response_text": "At first, he was frightened since he even got a nightmare about it. \nWhen the psychiatrist checks for his blood pressure, he confirms with Marsh if he is excited. But he was also scared and wondered if they have the wrong man; he might fail them. After the doctor tells him that he is not the wrong man, he felt more at ease. \nAs he takes the lift to get to the platform surrounding the rocket, Marsh is not as anxious as he was during the day, but his knees felt rubbery. When he talks to the officer up there, his facial expression is twitching uncontrollably despite his effort to smile. \n\nInside the rocket, he thinks of the explosives below him that can literally blow him into nothing; he thinks of being watched by millions of people; and he thinks of his parents. It fells very long before finally getting to the 10 seconds countdown. Then he feels fear. \n\nAfter getting into the designated orbit in space, Marsh feels great to hear a human voice again. \nIt was a stunning view to see Earth from outside his rocket in space. But he suddenly has a uncontrollable panic which hits him on the rocket’s side. He bounces a few times, but did not get hurt. And he becomes calm again. He gets a little worried about the touchdown that his outside controls can provide. In the end, he lands safely. "
              }
            ]
          },
          {
            "question_text": "What is the impact of the first flight on all the characters in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "105",
                "uid": "65bbde9020f0492b92481e5fce854187",
                "response_text": "Marsh, the only person who is to fly, is excited and scared at the same time. He can not believe he is to be the first to exit in space, but he thinks himself not brave and worthy enough, and is afraid to fail everyone. He feels the burden of responsibility for being chosen, which is increased by his duty before his parents to come back and the attention of the huge amount of spectators. Marsh's parents are extremely anxious. The mom struggles to understand why such a young boy is sent, the dad tries to joke and calm down the mom, but they are both afraid Marsh won't come back. The spectators and journalists are excited and interested. The whole team working on the project is also excited and anxious, they try to support Marsh. The Colonel is worried for Marsh, all of them take caution, check everything, and cheer Marsh up. They work on detecting every data, controlling every detail. The whole planet watches closely, while Marsh is the only one to really feel like the king of the universe. "
              },
              {
                "worker_id": "107",
                "uid": "190d881635c94b1eafc193fab9f65874",
                "response_text": "For Marsh’s parents, the first flight has a negative impact. While they are proud of him, they are scared that he will get injured or even potentially die during the flight. For Colonel Tregasker, the first flight gives him a sense of accomplishment because he is the one who oversaw Marsh’s training. He is very proud of Marsh for how far he has come. For Marsh himself, this first flight is the result of his hard work in training and a once-in-a-lifetime opportunity. He has prepared long for this moment, and the view that he sees from space makes all of it worthwhile."
              },
              {
                "worker_id": "106",
                "uid": "723b2678aca9400b9259e6fccb381d3f",
                "response_text": "There is a different impact of the first flight on all the characters in the story. For Marsh, the impact is seen the most. He is overcome with a range of emotions, fear, excitement, happiness, sadness at the prospect of never seeing his parents again. This is the chance of a lifetime for him. This is the journey of his career; to be the first ever man in space. \nThe impact on Mom and Dad is one of fear, worry and anger. They question why the program couldn't have gotten an older person to pilot the rocket, with Mom being particularly ticked off by this. It is mentioned that they always appeared to be happy when Marsh passed various exams, but secretly wished that he had failed, so he could escape the danger. \nColonel Tregasker is proud of Marsh. He is very happy with his Cadet and his achievement. It is clear that the colonel cares deeply for Marsh, hugging him, showing his fear and anxiety for what might happen. This is a great moment for him, but also a moment of great worry. \nThere is a great impact on every character in this story, including the general and Marsh's cadet friends. It is the first flight in which a man has ever gone into space, changing space exploration forever. "
              },
              {
                "worker_id": "103",
                "uid": "993690eabb81489fab79ff40ace8e0f3",
                "response_text": "Marsh’s parents are worried and does not want him to go since he is still very young. The doctor encourages him before his first flight. The other classmates that he trained with was going to be his successor if he has failed the trip today. The Air Force are able to study the data for month, which are brought back by Marth. The people watching was at first worried about the successfulness of the flight, but they and the reporters congratulates him once he lands. "
              }
            ]
          },
          {
            "question_text": "What is the setting of the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "105",
                "uid": "65bbde9020f0492b92481e5fce854187",
                "response_text": "The night before the flight Marsh is in his father's temporary apartment with the view of distant Skyharbor. Next morning he leaves the house in his dad's car and gets to the airport. There he visits the doctors and goes to take a nap. Then he enters a room where he says goodbye to his friends. Then he goes to put on all the devices and takes an elevator to the platform. From there he enters the cabin of his spaceship and sets off to space. He moves through the Hemisphere to the Earth orbit. There he stops and exits, finding himself in space. He looks at the globe from there. Marsh heads back then, making circles around the United States and gets back to Sky Harbor. There he exits the ship and goes out.\n"
              },
              {
                "worker_id": "107",
                "uid": "190d881635c94b1eafc193fab9f65874",
                "response_text": "The beginning of the story is set at his father’s temporary apartment. He can see the Skyharbor from his bedroom window. There is also a room next door for his parents. The apartment also has a kitchen, where his father reads the morning paper and his mother grills eggs in the skillet. \n\nWhen they drive to the airport, some guards surround the premises. Skyharbor is the biggest rocket experimental center in the United States, and there are many amenities dedicated to the preparation of space travel. There is a building for exhaustive checks and briefings, and there is a private room with a cot for General Forsythe. There is also an outside office connecting to the room. Apart from the center itself, a launch site is located further out in the field. Giant searchlights are set up to direct attention to the rocket. There is also a high wire fence that surrounds the launching ramp and blockhouses. The colonel and Marsh go through an open-cage elevator that takes them to a platform on one of the upper stages. \n\nThe rocket has a small compartment for him to sit in, with a contour chair, straps, wires, and cables connecting to a complete circuit. There is also a double hatch and a radio to ensure that Marsh can remain in communication with the authorities on Earth. Once Marsh is in space, he sees a panorama of Earth below him with patches of clouds, a gray atmosphere, and pinpoint lights of night cities. He can also see the stars, the Milky Way, and even Mars."
              },
              {
                "worker_id": "106",
                "uid": "723b2678aca9400b9259e6fccb381d3f",
                "response_text": "\nThe setting changes as the story progresses. The story begins in Marsh's home, in his bedroom. He then moves into the kitchen. Marsh and his father drive to the small airport known as skyharbour, where the rocket waits. In the airport there are various stations where Marsh is examined. In the general's office at the station is a cot. Marsh and the Colonel then move to the blockhouse. From there, they go into a mesh elevator that takes them to the top of the rocket. The rocket is broken into three parts: Tom, Dick and Harry. The first two break off at different points in Marsh's journey, to allow for maximum propulsion. The cabin that Marsh sits in on his journey is small and cramped. There is a comfy lounging chair which he sits at, and a radio system which allows him to communicate with mission control. Below the rocket, one half of the Earth can be seen in darkness. Marsh notices different American cities and mountain ranges. The rocket then moves to the other side of the planet, where it is daytime. He sees Europe and Asia. On his final descent, Marsh notices different parts of California: the grand canyon, the mountains in san francisco and deserts. He finally touches down in a vast desert in Arizona. "
              },
              {
                "worker_id": "103",
                "uid": "993690eabb81489fab79ff40ace8e0f3",
                "response_text": "The story takes place on Earth, and it is their first trip to the space. It starts in Marsh’s room where there is a window and he can see his father’s temporary apartment as well as the Skyharbor. Then later at Skyharbor, he was first checked with a doctor and then went to outside of the office which has an adjoining room. There is a lift next to the platform of the surrounding of the rocket. The rocket has a small compartment in Harry; Dick and Tom are two parts of the rocket that will fall. There is a soft contour chair and straps to be fastened. The Mach shows the speed of the rocket, and the speedometer shows the force pressing on him, as well as an atmospheric heat friction gauge; there is also a temperature gauge on the rocket, and a reflecting prism to see the outside. The rocket has a cramped chamber which can lead him to the outside of the rocket. "
              }
            ]
          },
          {
            "question_text": "How is the theme of responsibility explored in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "105",
                "uid": "65bbde9020f0492b92481e5fce854187",
                "response_text": "Being the first man to go to space is a task of extreme responsibility. For years, the flight was worked through to make it as safe and well-organized as possible. Due to the need to choose only one man, long training and checkouts took place, and Marsh was decided to be the best. His success is the reason his friends are not able to go and their years of training were in vain. The generals and other higher standing participants trained and chose Marsh, so he has to meet their expectations. The whole globe is watching him with interest and attention, which is an additional pressure. He has to complete the mission successfully, because he was chosen and he can’t fail, he needs to be brave, calm and concentrated. Moreover, he is responsible before his parents to come back, not to make them lose their only son. Detailed instructions were given to him and failing to follow them means proving not good enough. This flight was prepared for too long, and if he fails, he moves the exploration years back. Understanding all of that, Marsh tries to calm him down every time and reminds himself of what has to be done. He does everything with caution, and when he loses control in space, he rapidly recovers and reminds himself to be careful. Under the burden of this responsibility, Marsh doesn’t let himself to get nervous. \n"
              },
              {
                "worker_id": "107",
                "uid": "190d881635c94b1eafc193fab9f65874",
                "response_text": "The theme of responsibility is explored through the story via Marsh’s own experience in space. Although he undergoes training, Marsh is still given the responsibility of being the person who makes man’s first journey into space. He is responsible when piloting the rocket, too, and can execute all of the instructions that the general gives him. Marsh can safely disconnect the cables and prevent the ship’s delicate instruments from becoming damaged when he goes out to observe. Even during the trickiest part of the operation, Marsh can manually pilot the ship back to Earth. He demonstrates excellent responsibility here, as he manages to safely land and successfully fulfills the mission. "
              },
              {
                "worker_id": "106",
                "uid": "723b2678aca9400b9259e6fccb381d3f",
                "response_text": "The theme of responsibility features heavily in this story. Marsh feels the responsibility of the world to succeed in this flight. He doubts whether he was the right man for the job. He feels the responsibility to have the mission be a success for not only his team, but also himself, and his own life. The weight of the world is on his shoulders, and the future of space travel depends on him. \nMom and Dad feel the responsibility to keep their child safe. They are angered by the fact that he was chosen, and wish the space program had picked a grown man. \nThe entire team at the Skyharbour have the responsibility of keeping Marsh safe. They give him a full medical check, and wire him up to know the status of his vitals. \nThe Colonel has the responsibility of keeping a boy safe that he has known for a very long time. He is his CO, and as such, is the main person responsible for him at the station. \nThe general has the responsibility to make sure everything about the mission goes smoothly. \nThere is definitely a very clear theme of responsibility throughout the story. "
              },
              {
                "worker_id": "103",
                "uid": "993690eabb81489fab79ff40ace8e0f3",
                "response_text": "We learn that even though Marsh’s Mom and Dad does not want him to go to space, his exploration to the space can bring valuable finding to Earth. Firstly, he was able to spot a meteor that is heading towards Earth. He reports this back. He is also able to bring data back for months of analysis. While his parents hoped he would fail the exams, he passed and becomes the first pilot going into space. It is such an honor for him. Even Marsh himself was thrilled to see Earth from space, especially since he is the first man ever. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5274,
        "document_length_chars": 30491
      }
    }
  ]
}