{
  "item_metadata": {
    "item_id": "60747",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "60747",
      "content": "Nuts to wild talents! Mine was no satisfaction, never earned me a penny—and now it had me fighting for my life in ...\n \n \n THE LITTLE RED BAG\n \n\n By JERRY SOHL\n \n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, January 1960. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n About an hour out of San Francisco on the flight to Los Angeles, I made\n the discovery. I had finished reading the Chronicle , folded and put\n it beside me, turned and looked out the window, expecting to see the\n San Joaquin Valley but finding only a sea of clouds instead. So I\n returned my attention to the inside of the plane, to the overstuffed\n gray-haired woman asleep beside me, to the backs of heads in seats\n before me, across the aisle to other heads, and down to the blonde.\n \n I had seen her in the concourse and at the gate, a shapely thing. Now\n she had crossed her legs and I was privileged to view a trim ankle and\n calf, and her profile as she stared moodily across the aisle and out a\n window where there was nothing to see.\n \n I slid my eyes past her to others. A crossword-puzzle worker, a\n togetherness-type-magazine reader.\n \n Inventory completed, I went back to looking at the clouds, knowing I\n should be thinking about the printing order I was going to Los Angeles\n for, and not wanting to.\n \n So I started going through the purse of the woman next to me. Perhaps\n that sounds bad. It wasn't. I'd been doing it for years and nobody ever\n complained.\n \n It started when I was a kid, this business of being able to explore\n the insides of things like purses and sealed boxes and locked drawers\n and—well, human beings. But human beings aren't worth the trouble.\n It's like swimming through spaghetti. And I've got to stay away from\n electric wires. They hurt. Now don't ask me how they hurt.\n \n Maybe you think it's fun. For the most part, it really isn't. I always\n knew what was in Christmas presents before I unwrapped them, and\n therefore Christmas was always spoiled for me as a kid. I can't feel\n the color of anything, just its consistency. An apple senses about the\n same as a potato, except for the core and the stem. I can't even tell\n if there's writing on a piece of paper. So you see it isn't much. Just\n the feel of shapes, the hardnesses and softnesses. But I've learned to\n become pretty good at guessing.\n \n Like this woman next to me. She had a short, cylindrical metal object\n in her purse with waxlike stuff inside it—a lipstick. A round, hard\n object with dust inside—a compact. Handkerchief, chewing gum, a small\n book, probably an address book, money in a change purse—a few bills\n and coins. Not much else.\n \n I was a little disappointed. I've run across a gun or two in my time.\n But I never say anything.\n \n \n\n \n I learned the wisdom of keeping my mouth shut in the fourth grade when\n Miss Winters, a stern, white-haired disciplinarian, ordered me to eat\n my sack lunch in the classroom with her instead of outside with some\n of the other kids. This was the punishment for some minor infraction.\n Lunchtime was nearly over and we'd both finished eating; she said she'd\n be gone for a few moments and that I was to erase the blackboard during\n her absence, which I dutifully did.\n \n Class had hardly resumed when she started looking around the desk for\n her favorite mechanical pencil, asking if any of us had seen it, and\n looking straight at me. I didn't want her to think I had taken it while\n she was out of the room, so I probed the contents of her purse, which\n she always kept in the upper right drawer of her desk.\n \n \"It's in your purse,\" I blurted out.\n \n I was sent home with a stinging note.\n \n Since then I've kept quiet. At one time I assumed everybody was able\n to sense. I've known better for years. Still, I wonder how many other\n people are as close-mouthed about their special gift as I am about mine.\n \n I used to think that some day I'd make a lot of money out of it, but\n how? I can't read thoughts. I can't even be sure what some of the\n things I sense in probing really are.\n \n But I've learned to move things. Ever so little. A piece of paper. A\n feather. Once I stopped one of those little glass-enclosed light or\n heat-powered devices with vanes you see now and then in a jeweler's\n window. And I can stop clocks.\n \n Take this morning, for example. I had set my alarm for five-thirty\n because I had to catch the seven o'clock plane at San Francisco\n International Airport. This being earlier than I usually get up, it\n seems all I did during the night was feel my way past the escapement\n and balance wheel to see where the notch for the alarm was. The last\n time I did it there was just the merest fraction of an inch between the\n pawl and the notch. So I sighed and moved to the balance wheel and its\n delicate ribbon of spiraling steel. I hung onto the wheel, exerting\n influence to decrease the restoring torque.\n \n The wheel slowed down until there was no more ticking. It took quite\n a bit of effort, as it always does, but I did it, as I usually do. I\n can't stand the alarm.\n \n When I first learned to do this, I thought I had it made. I even went\n to Las Vegas to try my hand, so to speak, with the ratchets and pawls\n and cams and springs on the slot machines. But there's nothing delicate\n about a slot machine, and the spring tensions are too strong. I dropped\n quite a lot of nickels before I finally gave up.\n \n So I'm stuck with a talent I've found little real use for. Except that\n it amuses me. Sometimes. Not like this time on the plane.\n \n The woman beside me stirred, sat up suddenly and looked across me out\n the window. \"Where are we?\" she asked in a surprised voice. I told her\n we were probably a little north of Bakersfield. She said, \"Oh,\" glanced\n at her wristwatch and sank back again.\n \n Soon the stewardesses would bring coffee and doughnuts around, so I\n contented myself with looking at the clouds and trying to think about\n Amos Magaffey, who was purchasing agent for a Los Angeles amusement\n chain, and how I was going to convince him our printing prices were\n maybe a little higher but the quality and service were better. My mind\n wandered below where I was sitting, idly moving from one piece of\n luggage to another, looking for my beat-up suitcase. I went through\n slips and slippers, lingerie and laundry, a jig saw puzzle and a\n ukulele.\n \n I never did find my suitcase because I found the bomb first.\n \n \n\n \n The bomb was in a small bag—a woman's bag judging by the soft,\n flimsy things you'd never find in a man's—and I didn't know it was a\n bomb right away. I thought it was just a clock, one of those small,\n quiet alarms. I was going to pass it by and go on, but what held me\n was that something was taped to it. By the feel, I knew it must be\n electrician's tape. Interested and curious, I explored the clock more\n closely, found two wires. One went to a battery and the other to hard\n round cylinders taped together. The hairs stood up at the base of my\n neck when I suddenly realized what it was.\n \n The clock's balance wheel was rocking merrily. Quickly I went up past\n the train of gears to the alarm wheel. If this was anything like my own\n alarm clock, this one had something like ten minutes to go.\n \n It was forty minutes to Burbank and Lockheed Air Terminal.\n \n My mind was churning when I turned from the window to look around\n at the unconcerned passengers, the woman at my side asleep again. I\n thought: Which one of these.... No, none of them would know it was\n there. I glanced out the window again; clouds were still in the way.\n We'd be leaving the valley for the mountain range north of Los Angeles\n soon, if we hadn't left it already. No place to land the plane there.\n \n But of course that had been the plan!\n \n My heart was beating in jackhammer rhythm; my mouth was dry and my mind\n was numb. Tell somebody about the bomb before it's too late! No, they'd\n think I put it there. Besides, what good would it do? There would be\n panic and they'd never get the plane down in time—if they believed me.\n \n \"Sir.\" My head jerked around. The stewardess stood in the aisle,\n smiling, extending a tray to me, a brown plastic tray bearing a small\n paper cup of tomato juice, a cup of coffee, a cellophane-wrapped\n doughnut, paper spoon, sugar and dehydrated cream envelopes, and a\n napkin.\n \n I goggled at her, managed to croak, \"No, thanks.\" She gave me an odd\n look and moved along. My seatmate had accepted hers and was tearing at\n the cellophane. I couldn't bear to watch her.\n \n I closed my eyes, forced my mind back to the luggage compartment, spent\n a frantic moment before I found the bag again. I had to stop that\n balance wheel, just as I stopped my alarm clock every morning. I tried\n to close everything off—the throb of engines, the rush of air, the\n woman sipping coffee noisily beside me—and I went into the clock and\n surrounded the seesawing wheel. When it went forward, I pulled it back;\n when it went back, I pulled it forward. I struggled with it, and it was\n like trying to work with greasy hands, and I was afraid I wasn't going\n to be able to stop it.\n \n Then, little by little, it started to slow its beat. But I could not\n afford to relax. I pushed and pulled and didn't dare release my hold\n until it came to a dead stop.\n \n \"Anything the matter?\"\n \n My eyelids flew open and I looked into the eyes of the woman next to\n me. There was sugar from the doughnut around her mouth and she was\n still chewing.\n \n \"No,\" I said, letting out my breath. \"I'm all right.\"\n \n \"You were moaning, it sounded like. And you kept moving your head back\n and forth.\"\n \n \"Must have been dreaming,\" I said as I rang for the stewardess. When\n she came I told her I'd take some of that coffee now. No, nothing else,\n just coffee. I didn't tell her how much I needed it. I sat there clammy\n with sweat until she returned. Coffee never tasted so good.\n \n \n\n \n All right, so I had stopped the bomb's timer. My mind raced ahead to\n the landing. When they unloaded the luggage, the balance wheel would\n start again. I wouldn't be able to stay with it, keeping it still.\n I considered telling the authorities as soon as we landed, or maybe\n calling in ahead, but wouldn't that just bring suspicion, questions.\n Maybe I could convince them I could stop a clock—but not before the\n bomb exploded. And then what? My secret would be out and my life would\n be changed. I'd be a man not to be trusted, a prying man, a man\n literally with gimlet eyes.\n \n Mountain crags jutted through the clouds. We were in the range north of\n the city. Here and there were clear spots and I could see roads below,\n but there were also clouds far above us. It was very beautiful, but it\n was also very bumpy, and we started to slip and slide.\n \n To my horror I found that the balance wheel was rocking again. Closing\n my eyes and gritting my teeth, I forced my senses to the wheel, tugging\n and pulling and shoving and pushing until it finally stopped.\n \n A jab in the shoulder. I jumped, startled.\n \n \"Your cup,\" my seat partner said, pointing.\n \n I looked down at the coffee cup I had crushed in my hands. Then I\n looked up into the eyes of the stewardess. I handed it to her. She took\n it without a word and went away.\n \n \"Were you really asleep that time?\"\n \n \"Not really,\" I said. I was tempted to tell the woman I was subject to\n fits, but I didn't.\n \n It was only a few minutes to landing, but they became the longest\n minutes of my life as time after time I stopped the rocking wheel when\n the plane dipped and bumped to a landing.\n \n Leaving the apron with the other passengers, I tried to walk as\n unconcernedly as they through the exit gate. I would have liked walking\n through the terminal and out the entrance and away, but I could not. I\n had my suitcase to get, for one thing. The damned bomb was the other.\n So I strolled out into the concourse again to look at the plane and\n watch the baggagemen at work, transferring the luggage to two airfield\n carts. They weren't as careful as I would have been.\n \n It was impossible to tell from this distance just which bag contained\n the bomb; I could hardly identify my own scarred suitcase. The\n assortment of bags—a strange conglomeration of sizes and colors—was\n packed in some places six deep, and it rolled toward the gate where\n I was standing. I didn't know whether to stay or run, imagining the\n balance wheel now happily rocking again. The load went past me down a\n ramp to the front of the air terminal where the luggage was unloaded\n and placed in a long rack. I went with it.\n \n There was a flurry of ticket matching, hands grabbing for suitcases,\n and a general exodus on the part of my fellow passengers, too fast to\n determine who had got the one with the bomb. Now all that was left was\n the attendant and I had two bags—my own battered veteran of years, and\n a fine new red overnight case, small enough to be the one.\n \n I lit a cigarette, reached out. Inside were a woman's things and—a\n clock. The escapement was clicking vigorously.\n \n I didn't moan this time. I just closed my eyes, stretched toward\n and grabbed the balance wheel I was getting to know like my own. I\n entered into a union with it so strong that after I had reduced it to\n immobility, it was like waking when I opened my eyes.\n \n \n\n \n The baggage claim attendant was staring at me. For only a moment I\n stared back. Then I quickly reached for my baggage check and presented\n it to him. His hand hovered over the handle of the little red bag and I\n was ready to yell at him. But then, matching numbers on the tags with\n his eyes, his hand grasped the handle of my own suitcase and pushed it\n toward me.\n \n \"Thanks,\" I said, taking it. I glanced ever so casually toward the\n remaining bag. \"One left over, eh?\"\n \n \"Yeah.\" He was so bored I was tempted to tell him what was in it. But\n he was eying me with a \"well-why-don't-you-get-along?\" look.\n \n I said, \"What happens if nobody claims it?\"\n \n \"Take it inside. Why?\"\n \n He was getting too curious. \"Oh, I just wondered, that's all.\"\n \n I stepped on my cigarette and walked toward the air terminal entrance\n and put my suitcase on the stone steps there. A redcap came hurrying\n over.\n \n \"Cab?\"\n \n I shook my head. \"Just waiting.\"\n \n Just waiting for somebody to pick up a bomb.\n \n I lit another cigarette and glanced now and then toward the baggage\n claim area. The red bag was still there. All sorts of theories ran\n through my head as to why it should still be there, and none satisfied\n me.\n \n I should not have been there, that much I knew; I should be with a\n man named Amos Magaffey on Sixth Street at ten o'clock, discussing\n something very mundane, the matter of a printing order. But what could\n I do? If I left the airport, the attendant would eventually take the\n bag inside and there would be an explosion, and I wouldn't be able to\n live with myself.\n \n No. I had to stay to keep the balance wheel stationary until—until\n what?\n \n A man in tan gabardine, wearing a police cap and badge, walked out of\n the entrance to stand on the stone steps beside me while he put on a\n pair of dark glasses. A member of the airport police detail. I could\n tell him. I could take him down to the little red bag and explain the\n whole thing. Then it would be his baby and I would be off on my own\n business.\n \n But he moved on down the steps, nodded at the redcap, and started\n across the street to the parking area. I could have called to him,\n\"Hey, officer, let me tell you about a bomb in a little red bag.\" But\n I didn't. I didn't because I caught a movement at the baggage claim\n counter out of the side of my eye.\n \n The attendant had picked up the bag and was walking with it up the ramp\n to the rear of the air terminal. Picking up my own suitcase, I went\n inside in time to see him enter through a side door and deposit the bag\n on the scales at the airline desk and say something to the clerk. The\n clerk nodded and moved the bag to the rear room.\n \n I could visualize the balance wheel once again rocking like crazy. How\n many minutes—or seconds—were left? I was sweating when I moved to the\n counter, and it wasn't because of the sunshine I'd been soaking in. I\n had to get as close to the bag as I could if I was going to stop the\n clock again.\n \n \"Can I help you?\" the clerk asked.\n \n \"No. I'm waiting for someone.\"\n \n I turned my back to him, put down my suitcase, leaned against the\n counter and reached out for the wheel. I found I could reach the\n device, but it was far away. When I tried to dampen it, the wheel\n escaped my grasp.\n \n \"Do you have my suitcase?\"\n \n I blinked my eyes open and looked around. The blonde in the plane stood\n there looking very fresh and bright and unconcerned. In her right hand\n she had a green baggage claim check.\n \n The clerk took it, nodded, and in a moment brought out the overnight\n case and set it on the scales. The girl thanked him, picked it up,\n glanced at me indifferently, and then started for the entrance with it.\n \n \"Just a moment,\" I found myself saying, grabbing my bag and hurrying\n after her.\n \n \n\n \n At her side and a little ahead of her, I said, \"Listen to me.\"\n \n She looked annoyed and increased her stride toward the door.\n \n \"It's a matter of life or death,\" I said. I wanted to wrest the bag\n from her and hurl it out through the doorway into the street, but I\n restrained myself.\n \n She stopped and stared. I noticed a short, fat man in a rumpled\n suitcoat and unpressed pants staring, too. Ignoring him, I said,\n\"Please put the bag down. Over there.\" I indicated a spot beside a\n telephone booth where it would be out of the way.\n \n She didn't move. She just said, \"Why?\"\n \n \"For God's sake!\" I took the case. She offered no resistance. I put her\n bag and mine next to the booth. When I turned around she was standing\n there looking at me as if I had gone out of my mind. Her eyes were blue\n and brown-flecked, very pretty eyes, and my thought at the moment was,\n I'm glad the bomb didn't go off; these eyes wouldn't be looking at me\n or anything else right now if it had.\n \n \"I've got to talk to you. It's very important.\"\n \n The girl said, \"Why?\" I was beginning to think it was the only word she\n knew. At the same time I was wondering why anyone would want to kill\n someone so lovely.\n \n \"I'll explain in a moment. Please stand right here while I make a\n telephone call.\" I moved toward the phone booth, paused and said, \"And\n don't ask me why.\"\n \n She gave me a speculative look.\n \n I must not have seemed a complete idiot because she said, \"All right,\n but—\"\n \n I didn't listen for the rest. I went into the booth, closed the door,\n pretended to drop a coin and dial a number. But all the time I was in\n there, I was reaching out through the glass for the clock. At this\n range it wasn't difficult to stop the balance wheel.\n \n Just the same, when I came out I was wringing wet.\n \n \"Now will you please tell me what this is all about?\" she said stiffly.\n \n \"Gladly. Let me buy you a cup of coffee and I'll explain.\"\n \n She glanced at the bags. I told her they'd be all right. We followed\n the short, fat man into the coffee shop.\n \n Over coffee I explained it all to her, how I had this extrasensory\n ability, how she was the first person I had ever revealed it to, and\n how I had discovered what was in her overnight bag.\n \n During the telling, her untouched coffee grew a skin, her face grew\n pale, her eyes grew less curious and more troubled. There were tears\n there when I finished. I asked her who put the bomb in her bag.\n \n \"Joe did,\" she said in a toneless voice, not looking at me any more but\n staring vacantly across the room. \"Joe put it there.\" Behind her eyes\n she was reliving some recent scene.\n \n \"Who is Joe?\"\n \n \"My husband.\" I thought she was going to really bawl, but she got\n control again. \"This trip was his idea, my coming down here to visit my\n sister.\" Her smile was bleak. \"I see now why he wanted to put in those\n books. I'd finished packing and was in the bathroom. He said he'd put\n in some books we'd both finished reading—for my sister. That's when he\n must have put the—put it in there.\"\n \n I said gently, \"Why would he want to do a thing like that?\"\n \n \"I don't know.\" She shook her head. \"I just don't know.\" And she was\n close to bawling again. Then she recovered and said, \"I'm not sure I\n want to know.\" I admired her for saying it. Joe must have been crazy.\n \n \"It's all right now?\" she asked.\n \n I nodded. \"As long as we don't move it.\"\n \n I told her I didn't know how much more time there was, that I'd been\n thinking it over and that the only way out seemed to be to tell the\n airport policeman. After I explained it to her, the girl—she said her\n name was Julia Claremont—agreed to tell him she thought there was a\n bomb in her bag, that she had noticed a ticking and had become worried\n because she knew she hadn't packed a clock. It wasn't good, but it\n would have to do.\n \n \"We've got to get it deactivated,\" I said, watching the fat man pay for\n his coffee and leave. \"The sooner the better.\"\n \n \n\n \n I finished my coffee in one gulp and went to pay the bill with her.\n I asked her why she didn't claim the bag at the same time the other\n people had. She said she had called her sister and the phone was busy\n for a long while.\n \n \"She was supposed to meet me, and when she wasn't here, I got worried.\n She said she isn't feeling well and asked me to take a cab.\" She smiled\n a little. It was a bright, cheery thing. I had the feeling it was all\n for me. \"That's where I was going when you caught up with me.\"\n \n It had become a very nice day. But the bottom dropped out of it again\n when we reached the lobby.\n \n The two bags weren't there.\n \n I ran to the entrance and nearly collided with the redcap.\n \n \"See anybody go out of here with a little red bag and an old battered\n suitcase?\"\n \n \"Bag? Suitcase?\" he mumbled. Then he became excited. \"Why, a man just\n stepped out of here—\" He turned to look down the street. \"That's him.\"\n \n The dumpy man I'd seen was walking off; Julia's bag in his right hand,\n mine in his left. He seemed in no hurry.\n \n \"Hey!\" I shouted, starting toward him.\n \n The man turned, took one look at me, and started to run. He came\n abreast an old gray, mud-spattered coupe, ran around, opened the door\n and threw both bags into the rear seat as he got in.\n \n The car was a hundred feet away and gathering speed by the time I\n reached where it had been parked. I watched it for a moment, then\n walked back to the entranceway where Julia was standing with the\n redcap, who said, \"That man steal them suitcases?\"\n \n \"That he did,\" I said.\n \n Just then the airport policeman started across the street from the\n parking lot. Redcap said, \"Better tell him about it.\"\n \n The policeman was sympathetic and concerned. He said, \"We'd better get\n over to the office.\"\n \n But we never left the spot because an explosion some blocks distant\n shattered the air. Julia's hand grasped my arm. Hard.\n \n \"Jets,\" the redcap said, eying the sky.\n \n \"I don't know,\" the policeman said. \"Didn't sound much like a jet to\n me.\"\n \n We stood there. I could visualize the wreckage of an old gray coupe\n in the middle of a street, but I couldn't visualize the driver. That\n was all right. I didn't want to see him. I didn't know what Julia was\n thinking.\n \n She said, \"About those bags,\" and looked at me.\n \n The officer said, \"Yes, miss?\"\n \n \"I—I don't care about mine. I didn't have much of anything in it.\"\n \n \"I feel the same way,\" I said. \"Would it be all right if we didn't\n bother to report it?\"\n \n \"Well,\" the policeman said, \"I can't make you report it.\"\n \n \"I'd rather not then,\" Julia said. She turned to me. \"I'd like some\n air. Can't we walk a little?\"\n \n \"Sure,\" I said.\n \n We started down the street, her arm in mine, as the air began to fill\n with the distant sounds of sirens.",
      "metadata": {
        "title": "The Little Red Bag",
        "author": "Jerry Sohl",
        "passage_id": "60747",
        "uid": "afc7d0b8ab9b44e499bf68cf3c9465e0",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "109",
                "uid": "d951e09dfc734bc08b8758b2dfbe6dd2",
                "response_text": "On a seemingly normal flight from San Francisco to Los Angeles sits our protagonist, on his way to complete a printing order. In his initial musings, we find out that his curiosity and intuition about his fellow passengers come out of his extrasensory ability to see inside objects and human beings. The protagonist is also revealed to be able to manipulate time by stopping clocks, which he uses to his benefit with early wake-up calls. Despite his unique abilities, he laments that it renders largely useless and mundane as it often ruins surprises like Christmas gifts, requires a bit of guessing, and fails to work as gimmicks in manipulating games like Vegas slot machines. \n\nAnd so with his seemingly useless but curious gaze, the protagonist ponders about his seat-mate’s purse, Amos Magaffey the purchasing agent, and rifling through luggages and identifying his own. All of sudden, his musings are halted by the discovery of a bomb in one of the luggages, with a countdown timer ticking with 10 minutes or less. The flight is still 40 minutes away from its destination and so with great effort and increasing suspicion from his seat-mate, the protagonist uses his ability to stop the ticking bomb. The flight lands safely with the bomb remaining inactivated, but the protgaonist now worries between alerting authorities - which may cast suspicion upon himself - or follow the luggage and identify who picks it up. With no one initially picking up the luggage with the bomb - the little red bag - it is delivered by the flight attendant to the rear room. Soon, a young lady arrives to pick it up. It is then that the protagonist hurries over to her in hopes of warning her of the ticking time bomb. It turns out that the likely culprit of planting the bomb is the young lady’s - Julia Claremont - husband, whose motives are unknown but nevertheless unhinged. Armed with this information and a false story about the bag’s suspicion, the pair decides to approach an airport policeman and inform them of the bomb. However, as they return to where they left their bags, they find that both his and Julia’s luggages have been stolen by a strange man entering his grey vehicle. Turning to the airport policeman in reporting this stolen luggage, they are interrupted by an explosion in a grey vehicle. Shocked and somber, Julia and the protagonist inform the policeman that they no longer wish to report the stolen luggage, and the two begin to walk away from the airport. \n"
              },
              {
                "worker_id": "113",
                "uid": "0a53b3c2f9524b75926a004ea5aba4dd",
                "response_text": "The protagonist and narrator of the story is a man who long ago discovered that he had an extraordinary ability: sensing the contents of different objects, like boxes and bags, and moving light things, like feathers or a watch balance wheel, without touching them. He got in trouble for naively using his gift in the fourth grade and has kept quiet about it ever since. At the beginning of the story, he is on a plane from San Francisco to Los Angeles for a business meeting with an amusement chain owner. After studying the passengers around him, checking the window view, and mentally looking through the purse of a woman next to him, he decides to find his suitcase in the luggage compartment of the plane. The narrator is going through the content of other people’s suitcases when he feels something resembling a bomb. It seems to be inside a small woman’s bag and is about to go off in ten minutes, but the plane is supposed to land only in forty. Anxious and hectic, he refuses the cup of coffee from a stewardess and decides that he has to stop the clock mechanism, at least for the duration of the flight. He does it every morning with his alarm, so it doesn’t seem impossible. After temporarily stopping it, his thoughts race ahead to the landing, realizing that he wouldn’t be able to control the mechanism forever or tell the truth to the police. But his thinking process is disturbed by turbulence - he realizes that the balance wheel is moving again. After some tugging, pulling, and shoving, it finally becomes immovable. When the plane lands, the protagonist goes to the baggage claim and tries to find the owner of the bag. After picking up his suitcase and watching how the claim employees take the bag with the bomb to the storage room, he finally sees a blond woman called Julia Claremont - he saw her on the flight - approaching the counter. He convinces her to put the bag down and pretends that he is speaking to someone in a telephone booth while deactivating the mechanism once again. When she asks for an explanation, he invites her to an airport coffee shop and tells her everything. At the end of his monologue, she starts crying and says that her husband Joe probably put it in her bag after she had finished packing the day before. That trip was Joe’s idea, but she doesn’t know why her husband would do something like that. They go back to the gate to realize that the bags they had left there are gone. The protagonist sees the thief throw their bags into his car’s rear seat and rapidly drive off. When they are ready to go to the police office to file a report, a loud explosion occurs somewhere near the airport. Julia and the narrator don’t report luggage theft and walk away. \n\n\n"
              },
              {
                "worker_id": "107",
                "uid": "82d4aff5b2c4454ab8640054a18ca313",
                "response_text": "The protagonist finishes reading the Chronicle an hour into his flight when he sees a sea of clouds where the San Joaquin Valley should be. He observes a few passengers and sees a familiar blonde from the gate. He thinks about the printing order in Los Angeles and begins exploring the old lady’s purse next to them. The protagonist's powers allow him to explore the inside of anything, but he remarks that it is not any fun because all he does is feel the shapes and guess. He goes through the lady’s belongings and becomes disappointed when nothing is of interest. The scene cuts to the fourth-grade protagonist eating lunch with Miss Winters for a minor infraction. Miss Winters leaves for a moment and tells the protagonist to erase the blackboard. She cannot find her favorite mechanical pencil when she comes back, and the protagonist probes her purse to find it. He generally keeps quiet about their special gift but can move certain objects. The old lady wakes up again, and the protagonist begins to think about securing a printing deal with Amos Magaffey. He probes through belongings and finds a bomb in a woman’s bag. He begins to panic and thinks about what to do when a stewardess offers him a tray full of food; the protagonist cannot bring himself to accept it. The lady next to him is concerned, but he insists that he is okay and asks for a cup of coffee. The protagonist has temporarily stopped the timer, and he thinks about what will happen once the luggage begins to move because the timer will start again. As he concentrates, the old woman notices again and asks if he is sleeping. Once the plane stops, the protagonist leaves and observes the baggage being transported from the plane to find the bag with the bomb. Once the protagonist claims his baggage, he waits to see who will claim the bag with the bomb. Although he should be meeting with Amos Magaffey, he knows that he will be unable to live with himself if he lets the bomb explode. The blonde from earlier appears to claim her bag, and the protagonist stops her by saying that he has something important to tell her. He manages to stop the bomb timer again by pretending to dial a number in the telephone booth. He and the woman then go grab a coffee, where he explains the situation; she is horrified to realize that her husband Joe is the one who put the bomb in. She introduces herself as Julia Claremont, and the both of them pay the tab to leave. They realize that their bags are stolen by the dumpy man from earlier in the lobby. The redcap tells them to tell the policeman, while a loud explosion suddenly happens. The two of them decide to forego their luggage because of the bomb and walk down the street arm in arm. "
              },
              {
                "worker_id": "112",
                "uid": "e2b12bad8974425591557512915a9ebb",
                "response_text": "A man with extrasensory ability finds a bomb on the plane. He doesn’t want to tell the stewardess that there is a bomb because he cannot explain how he knows it without exposing his ability. His unwillingness to reveal his ability also originates from his childhood memory that his teacher doubts him as a thief when he tells her where her pencil is. During the whole flight, he uses his ability to move the wheel in the bomb not to let it count down to explosion. \n\nAfter the plane lands, he goes to pick up his baggage. When he grabs his bag, he also sees the one with a bomb in the baggage claim area in the airport. He waits and hesitates to tell the truth to the airport officer. When he sees the baggage claim attendant trying to move the bag with the bomb to the rear room in the airport, he almost tells the truth, but he sees a woman come and try to find her bag. After the woman takes the bag, he approaches the woman, tells her to put the bag away, and goes to grab a coffee with her. He explains everything to her, including his extrasensory ability. The woman is startled. When they decide to tell the police to deactivate the bomb and walk out of the coffee shop, they see a thief grab both of their baggage and drive away. The police come and try to help them, but they all hear a massive explosion sound. They tell the police not to report the property stolen, and they leave.\n"
              }
            ]
          },
          {
            "question_text": "Who is Julia Claremont and what happens to her in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "109",
                "uid": "d951e09dfc734bc08b8758b2dfbe6dd2",
                "response_text": "Julia Claremont is a young blonde in the plane that initially peaks the protagonist's interest with her attractive profile, who later is identified as the owner of the little red bag that houses the ticking bomb. Flying from San Francisco to Los Angeles to visit her sister on her husband’s suggestion, she is the first person that the protagonist reveals his extrasensory abilities to. Despite the extraordinary tale, Claremont believes him and reveals herself that the likely culprit of the bomb to be her husband. Under the guise of putting in books for her sister to read, she surmises that her husband likely used that opportunity to plant the bomb. However, she is unable to identify the motives of her husband or more likely, she would rather not to. \n\nDespite this shock, Claremont and the protagonist devise a somewhat likely story to alert the airport policeman of her suspicious of a bomb in her luggage in order to quickly deactivate it as well as divert attention from how the protgaonist was able to sense it. On their way over to where they left their bags, they noticed them to be stolen and identified a dumpy man as the thief, heading over to his grey vehicle to take off with them. As they approach an airport policeman to report this theft instead, they are interrupted by an explosion - the bomb having gone off. Seemingly on the same page, Claremont turns to the policeman as she retracts her desire to report the theft - with the protagonist doing the same - and turns to walk away, leaving the mayhem of the explosion at the airport behind them. \n"
              },
              {
                "worker_id": "113",
                "uid": "0a53b3c2f9524b75926a004ea5aba4dd",
                "response_text": "The narrator feels that there is a bomb in the luggage compartment of the plane he is on, and Julia Claremont is one of the passengers of this flight. She is visiting her sister after her husband Joe suggested it some time ago. After leaving the plane, she tries to call her sister, and it takes a while before she can go to the baggage claim. After picking up her bag, the narrator convinces her to put it down and, after some time, invites Julia to a cafe. He tells her about his gift and that there is a bomb in her bag. She cries and realizes that after she had finished packing, her husband said he would put some books in her bag as a gift to the sister. She understands that he must’ve put the bomb in her luggage, but she doesn’t know why. They walk back to the airport lobby and see that their suitcases got stolen. The protagonist chases the thief, but the man throws the bags into his car and quickly leaves. When they approach a police officer ready to file a report, a loud explosion somewhere near the airport shatters the air, apparently killing the thief and wrecking his car. They quickly lose the desire to report the theft and walk away from the airport. \n"
              },
              {
                "worker_id": "107",
                "uid": "82d4aff5b2c4454ab8640054a18ca313",
                "response_text": "Julia Claremont is one of the people the protagonist first sees at the gate. The original purpose of her trip is to visit her sister. Before leaving, her husband Joe packs some books that they have finished reading for her sister. However, he also manages to sneak a bomb inside of her bag for unknown reasons. The protagonist describes her as blonde and shapely, giving a privileged view of a trim ankle and calf. She is also described to stare moodily across the aisle and out the window. Later, when Julia comes to claim her bag, the protagonist hurriedly follows her. She is initially annoyed and then confused, continuously asking “Why?” in response to what he says. He also notices that her eyes are blue and brown-flecked. Later, she is horrified to discover what happened and begins to bawl. She has no idea why her husband would do this, and the two of them come up with a plan to tell the police why there is a bomb in her bag. Julia also explains that she arrived at the baggage claim late because of a call from her sister. Once the bag is stolen, she sees this as an opportunity to leave with the protagonist before the blame can be pinned on them. "
              },
              {
                "worker_id": "112",
                "uid": "e2b12bad8974425591557512915a9ebb",
                "response_text": "Julia Claremont owns the red bag that contains a bomb inside. When she picks up her baggage, the protagonist comes to tell her to put away her bag. When she learns the truth from the protagonist in the coffee shop, she is startled and troubled. She realizes that her husband put the bomb in her baggage. She tries to call her sister when she arrives at the airport because her sister is supposed to pick her up, so she picks her luggage up later than other people. When she and the protagonist decide to tell the police about the bomb, they find a man who steals the pieces of baggage. They cannot catch up with the thief. When the police come to help them, they refuse to report the case because they hear the explosion. She leaves with the protagonist."
              }
            ]
          },
          {
            "question_text": "Q3. Why is the protagonist reluctant to reveal his extraordinary ability?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "109",
                "uid": "d951e09dfc734bc08b8758b2dfbe6dd2",
                "response_text": "The protagonist finds out about his extraordinary ability at an early age and quickly finds out that it is better to keep this information to himself. One incident that drove this message home occured in the fourth grade with his teacher, Miss Winters. At the time, the protagonist was sentenced to eat lunch with her as a minor punishment. After the lunch period was over, Miss Winters found herself looking for her favorite mechanical pencil, asking the class if anyone had seen it while casting a suspicious eye at the protagonist. Aiming to maintain his innocence and help out his teacher, the protagonist used his ability to find the pencil - in Miss Winters’ purse all along - and let her know. Instead, he was rewarded with a note sent home. \n\nEver since then, he found it to be safer to keep his ability a secret. Despite his curiosities about other potential extraordinary individuals, he recognizes that revealing any information gained from his ability would only cast suspicion upon himself from the authorities. For example, had the protagonist immediately alerted a flight attendant or the authorities about a bomb in one of the luggages the moment he discovered it on the plane, intrusive questions about how he knew or suspicions about him being the one to plant it were highly likely to arise. \n"
              },
              {
                "worker_id": "113",
                "uid": "0a53b3c2f9524b75926a004ea5aba4dd",
                "response_text": "After using his gift in primary school and getting a stinging note for that, the protagonist decides to keep quiet about his ability. Even when he has to deal with a bomb he is still reluctant to share his secret because he thinks that his life would change forever and people would never trust him again since he would be considered a prying man. He doesn’t believe that his gift can be used for anything meaningful, and ruining his life by revealing his ability definitely doesn’t seem sensible to him. \n\n"
              },
              {
                "worker_id": "107",
                "uid": "82d4aff5b2c4454ab8640054a18ca313",
                "response_text": "The protagonist is reluctant to reveal his extraordinary ability because it will make him look suspicious. He has learned to keep quiet about it in the past because it will only cast disbelief on him. The incident with his fourth-grade teacher’s mechanical pencil only made it seem like he had purposely hidden it in her purse. He has also thought about making money with the ability before, but it is not very useful because he can only feel around objects and guess what they are. Even though the protagonist feels panicked about the bomb, he knows that he cannot outright report it because nobody is aware of his ability. If he does, they will only cast suspicion on him for being the one who initially put it in there. Even when he thinks about calling ahead and convincing the authorities that he can stop the clock, there is no use. The protagonist knows that everybody will see him as a man who cannot be trusted once the secret is out and has prying eyes. "
              },
              {
                "worker_id": "112",
                "uid": "e2b12bad8974425591557512915a9ebb",
                "response_text": "The protagonist is reluctant to reveal his extrasensory ability because of his childhood experience. He learns the wisdom of not disclosing his power in the fourth grade when his teacher suspects him as a thief after he tells her where her pencil is. He used to believe that many other people have supernatural abilities like him, but the truth remains questionable. He does not want to reveal his ability because he believes that people will not believe him. Even if people believe him, his life will change, and he will become suspected of a prying person who always peeks at others’ privacy."
              }
            ]
          },
          {
            "question_text": "Q4. Describe the setting(s) of the story. Why is it important?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "109",
                "uid": "d951e09dfc734bc08b8758b2dfbe6dd2",
                "response_text": "This story has two settings: first, on an airplane from San Francisco to Los Angeles and second, at the Los Angeles airport in the baggage claim and arrivals terminal. The first setting - on the airplane mid flight - is highly important to the story because it is here that the protagonist discovered the bomb in the luggage. Not only that, he discovers that bomb is on a countdown with 10 minutes remaining before detonation while the flight still has 40 minutes before arrival. It is due to this fact that the protagonist utilizes his time manipulation ability to stop the clock successfully. \n\nIn the second setting, the tensions in this story continue to rise. Despite the protagonist successfully stopping the clock in the air, it appears to continue on the ground. With both the anticipation of watching to see who picks up the little red bag and dodging suspicions from the airport policeman and workers, we can imagine the hectic and panicked energy that sometimes appears in baggage claims. Additionally, an airport is filled with many people arriving and departing, which adds to the pressure the protagonist is facing in dealing with deactivating the bomb before anyone gets hurt. \n"
              },
              {
                "worker_id": "113",
                "uid": "0a53b3c2f9524b75926a004ea5aba4dd",
                "response_text": "The first part of the story is happening on a plane that is flying from San Francisco to Los Angeles. When the protagonist finds the bomb in one of the bags in the luggage compartment, the plane is somewhere above the mountain range north of Los Angeles - even in theory, it is impossible to land because there are no airports around this area. He stops the clock mechanism, using his extraordinary ability. After the landing, the story continues in the building of the airport, where the protagonist finds the owner of the bag with the bomb - Julia Claremont. He tells her about the bomb and how he sensed it during the flight. She cries and tells him that her husband put it in her bag after she had finished packing. They go back to the lobby and see that their suitcases got stolen. The protagonist tries to chase the thief, but the man quickly drives off with the bags. When they decide to file a report, something explodes loudly near the airport, and Julia, together with the protagonist, walks away, refusing to report the theft. \n"
              },
              {
                "worker_id": "107",
                "uid": "82d4aff5b2c4454ab8640054a18ca313",
                "response_text": "The story first begins on a plane from San Francisco to Los Angeles. The protagonist first expects to see San Joaquin Valley, but he is greeted by a sea of clouds instead. He sits next to an old woman on the plane. A little north of Bakersfield, he finds that one of the bags on the plane contains a bomb. It is forty minutes from Burbank to Lockheed Air Terminal, and there would be no place to land the plane any time soon. Once the protagonist gets off the plane, he heads to the baggage claim at the airport for his bag. When Julia gets her bag, he leads her to a telephone booth to make the fake call. Then, they leave their bags in the lobby and go to a coffee shop. The airport policeman is across the street from the parking lot. The setting of the plane is important because it is where the protagonist first discovers the bomb. Without his extraordinary ability to feel around any enclosed object, he would not be able to detect and temporarily stop the bomb’s timer before it was too late. This is also significant because the plane would have exploded had he not found it. The airport is important too because that is where he meets Julia. He would not have figured out who the bag belonged to and the entire story without waiting at the airport. "
              },
              {
                "worker_id": "112",
                "uid": "e2b12bad8974425591557512915a9ebb",
                "response_text": "The story's setting is in an ordinary world where no extrasensory ability is found or known. This setting is essential because the protagonist has the extrasensory ability, which allows him to see the insides of things and move some very light objects with his mind. However, since the world does not know the existence of the ability, he cannot tell anyone about it because if he tells people the truth, people either do not believe him or see him as a freak. Furthermore, since he cannot tell anyone his ability, neither can he tell people about what he finds in any bags, like a bomb, because he cannot explain how he knows what is inside of things that do not belong to him. Therefore, this inability to reveal his extrasensory ability drives the story to progress."
              }
            ]
          },
          {
            "question_text": "What is the relationship between the protagonist and authority figures like the airport policeman?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "109",
                "uid": "d951e09dfc734bc08b8758b2dfbe6dd2",
                "response_text": "The protagonist’s relationship with authority figures - like the airport policeman in this story - is a double edged sword. On one hand, it is figures like the policeman who are the right figure to report his suspicions towards. They are the ones equipped with the knowledge and resources on how to deal with the bomb in the little red bag. More importantly, informing them is the right thing to do and would save the lives of everyone else at the airport. On the other hand, however, we can see that the protagonist has revealed that authority figures in the past often choose to cast suspicion upon him rather than appreciate the usefulness of the knowledge that comes about his ability. If the protagonist were to approach the policeman in a suspicious manner or reveal too much information about his know-how of the bomb, it is likely that they will suspect him to be the culprit and probe him on something he is unable to explain, and hence arrest him. The protagonist has to carefully consider the implications of either decision and try to optimize both the safety of others around him and his own. \n\nThe protagonist chooses to inform the policeman of a suspicious baggage situation through the luggage’s owner, Julia Clarmeont, which would deflect any suspicion on himself. However, the bomb detonates before they are able to follow through with it. \n"
              },
              {
                "worker_id": "113",
                "uid": "0a53b3c2f9524b75926a004ea5aba4dd",
                "response_text": "Throughout the entire story, the protagonist tries to avoid any interaction with the police because he is afraid that they will either consider him the bomber or force him to reveal his ability, thus, changing his life for the worse. Even when Julia and the protagonist were ready to file a theft report, he quickly left after hearing the explosion. Possibly, he thought that he would be under suspicion and wasn’t sure that the police would believe the real story even after he revealed his secret. "
              },
              {
                "worker_id": "107",
                "uid": "82d4aff5b2c4454ab8640054a18ca313",
                "response_text": "The protagonist and the authority figures share a fairly neutral relationship. On the plane, he first speaks to the stewardess by rejecting her food offer. The stewardess also later brings him a cup of coffee and takes the crushed cup away. At the baggage claim, the attendant continues to stare at the protagonist as he stares back. He is bored of his job and confused why the protagonist would ask about bags that are not claimed. He wants to tell the airport policeman that there is a bomb in one of the luggage, but he does not because he sees the clerk begin to move the unclaimed piece of luggage inside. The policeman remains unaware of the bomb. Later, when he and Julia speak to the policeman about a stolen bag, the policeman is sympathetic. As the bomb goes off, the policeman tells them that he cannot make them report the stolen bags after the two of them do not want their pieces of luggage anymore. "
              },
              {
                "worker_id": "112",
                "uid": "e2b12bad8974425591557512915a9ebb",
                "response_text": "The protagonist holds the worry about the explosion of the bomb, but he cannot tell the airport authority about it because he cannot explain how he knows it. Meanwhile, the airport authority works as they usually do without knowing the bomb's existence. They can see the protagonist constantly hovering around the place and looking worrisome and anxious. Still, the only thought they have is probably to regard the protagonist as a strange person that needs help. When the protagonist’s baggage is stolen, the policeman comes and asks if he needs help. After hearing the explosive sound, the protagonist tells the policeman he does not want to report the case. The policeman allows him to do so."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4410,
        "document_length_chars": 23898
      }
    }
  ]
}