{
  "item_metadata": {
    "item_id": "61007",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61007",
      "content": "IT WAS A DULL, ROUTINE LITTLE WORLD. IT DIDN'T EVEN HAVE A CITY. EVERYTHING IT HAD WAS\n \n \n IN THE GARDEN\n \n\n BY R. A. LAFFERTY\n \n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, March 1961. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n The protozoic recorder chirped like a bird. Not only would there be life traces on that little moon, but it would be a lively place. So they skipped several steps in the procedure.\n \n The chordata discerner read Positive over most of the surface. There was spinal fluid on that orb, rivers of it. So again they omitted several tests and went to the cognition scanner. Would it show Thought on the body?\n \n Naturally they did not get results at once, nor did they expect to; it required a fine adjustment. But they were disappointed that they found nothing for several hours as they hovered high over the rotation. Then it came—clearly and definitely, but from quite a small location only.\n \n \"Limited,\" said Steiner, \"as though within a pale. As though there were but one city, if that is its form. Shall we follow the rest of the surface to find another, or concentrate on this? It'll be twelve hours before it's back in our ken if we let it go now.\"\n \n \"Let's lock on this one and finish the scan. Then we can do the rest of the world to make sure we've missed nothing,\" said Stark.\n \n There was one more test to run, one very tricky and difficult of analysis, that with the Extraordinary Perception Locator. This was designed simply to locate a source of superior thought. But this might be so varied or so unfamiliar that often both the machine and the designer of it were puzzled as to how to read the results.\n \n The E. P. Locator had been designed by Glaser. But when the Locator had refused to read Positive when turned on the inventor himself, bad blood developed between machine and man. Glaser knew that he had extraordinary perception. He was a much honored man in his field. He told the machine so heatedly.\n \n The machine replied, with such warmth that its relays chattered, that Glaser did not have extraordinary perception; he had only ordinary perception to an extraordinary degree. There is a difference , the machine insisted.\n \n It was for this reason that Glaser used that model no more, but built others more amenable. And it was for this reason also that the owners of Little Probe had acquired the original machine so cheaply.\n \n And there was no denying that the Extraordinary Perception Locator (or Eppel) was a contrary machine. On Earth it had read Positive on a number of crack-pots, including Waxey Sax, a jazz tootler who could not even read music. But it had also read Positive on ninety per cent of the acknowledged superior minds of the Earth. In space it had been a sound guide to the unusual intelligences encountered. Yet on Suzuki-Mi it had read Positive on a two-inch-long worm, only one of them out of billions. For the countless identical worms no trace of anything at all was shown by the test.\n \n So it was with mixed expectations that Steiner locked onto the area and got a flick. He then narrowed to a smaller area (apparently one individual, though this could not be certain) and got very definite action. Eppel was busy. The machine had a touch of the ham in it, and assumed an air of importance when it ran these tests.\n \n Finally it signaled the result, the most exasperating result it ever produces: the single orange light. It was the equivalent of the shrug of the shoulders in a man. They called it the \"You tell me light.\"\n \n So among the intelligences there was at least one that might be extraordinary, though possibly in a crackpot way. It is good to be forewarned.\n \n \n\n \n \"Scan the remainder of the world, Steiner,\" said Stark, \"and the rest of us will get some sleep. If you find no other spot then we will go down on that one the next time it is in position under us, in about twelve hours.\"\n \n \"You don't want to visit any of the other areas first? Somewhere away from the thoughtful creature?\"\n \n \"No. The rest of the world may be dangerous. There must be a reason that thought is in one spot only. If we find no others then we will go down boldly and visit this.\"\n \n So they all, except Steiner, went off to their bunks then: Stark, the Captain; Gregory Gilbert, the executive officer; Wolfgang Langweilig, the engineer; Casper Craig, super-cargo, tycoon and 51% owner of the Little Probe, and F. R. Briton, S.J., a Jesuit priest who was linguist and checker champion of the craft.\n \n Dawn did not come to the moon-town. The Little Probe hovered stationary in the light and the moon-town came up under the dawn. Then the Probe went down to visit whatever was there.\n \n \"There's no town,\" said Steiner. \"Not a building. Yet we're on the track of the minds. There's nothing but a meadow and some boscage, a sort of fountain or pool, and four streams coming out of it.\"\n \n \"Keep on towards the minds,\" said Stark. \"They're our target.\"\n \n \"Not a building, not two sticks or stones placed together. That looks like an Earth-type sheep there. And that looks like an Earth-lion, I'm almost afraid to say. And those two ... why, they could well be Earth-people. But with a difference. Where is that bright light coming from?\"\n \n \"I don't know, but they're right in the middle of it. Land here. We'll go to meet them at once. Timidity has never been an efficacious tool with us.\"\n \n Well, they were people. And one could only wish that all people were like them. There was a man and a woman, and they were clothed either in very bright garments or in no garments at all, but only in a very bright light.\n \n \"Talk to them, Father Briton,\" said Stark. \"You are the linguist.\"\n \n \"Howdy,\" said the priest.\n \n He may or may not have been understood, but the two of them smiled at him, so he went on.\n \n \"Father Briton from Philadelphia,\" he said, \"on detached service. And you, my good man, what is your handle, your monicker, your tag?\"\n \n \"Ha-Adamah,\" said the man.\n \n \"And your daughter, or niece?\"\n \n It may be that the shining man frowned momentarily at this; but the woman smiled, proving that she was human.\n \n \"The woman is named Hawwah,\" said the man. \"The sheep is named sheep, the lion is named lion, the horse is named horse and the hoolock is named hoolock.\"\n \n \"I understand. It is possible that this could go on and on. How is it that you use the English tongue?\"\n \n \"I have only one tongue; but it is given to us to be understood by all; by the eagle, by the squirrel, by the ass, by the English.\"\n \n \"We happen to be bloody Yankees, but we use a borrowed tongue. You wouldn't have a drink on you for a tubful of thirsty travellers, would you?\"\n \n \"The fountain.\"\n \n \"Ah—I see.\"\n \n \n\n \n But the crew all drank of the fountain to be sociable. It was water, but water that excelled, cool and with all its original bubbles like the first water ever made.\n \n \"What do you make of them?\" asked Stark.\n \n \"Human,\" said Steiner. \"It may even be that they are a little more than human. I don't understand that light that surrounds them. And they seem to be clothed, as it were, in dignity.\"\n \n \"And very little else,\" said Father Briton, \"though that light trick does serve a purpose. But I'm not sure they'd pass in Philadelphia.\"\n \n \"Talk to them again,\" said Stark. \"You're the linguist.\"\n \n \"That isn't necessary here, Captain. Talk to them yourself.\"\n \n \"Are there any other people here?\" Stark asked the man.\n \n \"The two of us. Man and woman.\"\n \n \"But are there any others?\"\n \n \"How would there be any others? What other kind of people could there be than man and woman?\"\n \n \"But is there more than one man or woman?\"\n \n \"How could there be more than one of anything?\"\n \n The captain was a little puzzled by this, but he went on doggedly:\n\"Ha-Adamah, what do you think that we are? Are we not people?\"\n \n \"You are not anything till I name you. But I will name you and then you can be. You are named Captain. He is named Priest. He is named Engineer. He is named Flunky.\"\n \n \"Thanks a lot,\" said Steiner.\n \n \"But are we not people?\" persisted Captain Stark.\n \n \"No. We are the people. There are no people but two. How could there be other people?\"\n \n \"And the damnest thing about it,\" muttered Langweilig, \"is, how are you going to prove him wrong? But it does give you a small feeling.\"\n \n \"Can we have something to eat?\" asked the Captain.\n \n \"Pick from the trees,\" said Ha-Adamah, \"and then it may be that you will want to sleep on the grass. Being not of human nature (which does not need sleep or rest), it may be that you require respite. But you are free to enjoy the garden and its fruits.\"\n \n \"We will,\" said Captain Stark.\n \n They wandered about the place, but they were uneasy. There were the animals. The lion and lioness were enough to make one cautious, though they offered no harm. The two bears had a puzzling look, as though they wanted either to frolic with you or to mangle you.\n \n \"If there are only two people here,\" said Casper Craig, \"then it may be that the rest of the world is not dangerous at all. It looked fertile wherever we scanned it, though not so fertile as this central bit. And those rocks would bear examining.\"\n \n \"Flecked with gold, and possibly with something else,\" said Stark. \"A very promising site.\"\n \n \"And everything grows here,\" added Steiner. \"Those are Earth-fruits and I never saw finer. I've tasted the grapes and plums and pears. The figs and dates are superb, the quince is as flavorsome as a quince can be, the cherries are excellent. And I never did taste such oranges. But I haven't yet tried the—\" and he stopped.\n \n \"If you're thinking what I'm afraid to think,\" said Gilbert, \"then it will be the test at least: whether we're having a pleasant dream or whether this is reality. Go ahead and eat one.\"\n \n \"I won't be the first to eat one. You eat.\"\n \n \"Ask him first. You ask him.\"\n \n \"Ha-Adamah, is it allowed to eat the apples?\"\n \n \"Certainly. Eat. It is the finest fruit in the garden.\"\n \n \n\n \n \"Well, the analogy breaks down there,\" said Stark. \"I was almost beginning to believe in the thing. But if it isn't that, then what. Father Briton, you are the linguist, but in Hebrew does not Ha-Adamah and Hawwah mean—?\"\n \n \"Of course they do. You know that as well as I.\"\n \n \"I was never a believer. But would it be possible for the exact same proposition to maintain here as on Earth?\"\n \n \"All things are possible.\"\n \n And it was then that Ha-Adamah, the shining man, gave a wild cry: \"No, no. Do not approach it. It is not allowed to eat of that one!\"\n \n It was the pomegranate tree, and he was warning Langweilig away from it.\n \n \"Once more, Father,\" said Stark, \"you should be the authority; but does not the idea that it was the apple that was forbidden go back only to a medieval painting?\"\n \n \"It does. The name of the fruit is not mentioned in Genesis. In Hebrew exegesis, however, the pomegranate is usually indicated.\"\n \n \"I thought so. Question the man further, Father. This is too incredible.\"\n \n \"It is a little odd. Adam, old man, how long have you been here?\"\n \n \"Forever less six days is the answer that has been given to me. I never did understand the answer, however.\"\n \n \"And have you gotten no older in all that time?\"\n \n \"I do not understand what 'older' is. I am as I have been from the beginning.\"\n \n \"And do you think that you will ever die?\"\n \n \"To die I do not understand. I am taught that it is a property of fallen nature to die, and that does not pertain to me or mine.\"\n \n \"And are you completely happy here?\"\n \n \"Perfectly happy according to my preternatural state. But I am taught that it might be possible to lose that happiness, and then to seek it vainly through all the ages. I am taught that sickness and ageing and even death could come if this happiness were ever lost. I am taught that on at least one other unfortunate world it has actually been lost.\"\n \n \"Do you consider yourself a knowledgeable man?\"\n \n \"Yes, since I am the only man, and knowledge is natural to man. But I am further blessed. I have a preternatural intellect.\"\n \n Then Stark cut in once more: \"There must be some one question you could ask him, Father. Some way to settle it. I am becoming nearly convinced.\"\n \n \"Yes, there is a question that will settle it. Adam, old man, how about a game of checkers?\"\n \n \"This is hardly the time for clowning,\" said Stark.\n \n \"I'm not clowning, Captain. How about it, Adam? I'll give you choice of colors and first move.\"\n \n \"No. It would be no contest. I have a preternatural intellect.\"\n \n \"Well, I beat a barber who was champion of Germantown. And I beat the champion of Morgan County, Tennessee, which is the hottest checker center on Earth. I've played against, and beaten, machines. But I never played a preternatural mind. Let's just set up the board, Adam, and have a go at it.\"\n \n \"No. It would be no contest. I would not like to humble you.\"\n \n \n\n \n They were there for three days. They were delighted with the place. It was a world with everything, and it seemed to have only two inhabitants. They went everywhere except into the big cave.\n \n \"What is there, Adam?\" asked Captain Stark.\n \n \"The great serpent lives there. I would not disturb him. He has long been cranky because plans he had for us did not materialize. But we are taught that should ever evil come to us, which it cannot if we persevere, it will come by him.\"\n \n They learned no more of the real nature of the sphere in their time there. Yet all but one of them were convinced of the reality when they left. And they talked of it as they took off.\n \n \"A crowd would laugh if told of it,\" said Stark, \"but not many would laugh if they had actually seen the place, or them. I am not a gullible man, but I am convinced of this: that this is a pristine and pure world and that ours and all the others we have visited are fallen worlds. Here are the prototypes of our first parents before their fall. They are garbed in light and innocence, and they have the happiness that we have been seeking for centuries. It would be a crime if anyone disturbed that happiness.\"\n \n \"I too am convinced,\" said Steiner. \"It is Paradise itself, where the lion lies down with the lamb, and where the serpent has not prevailed. It would be the darkest of crimes if we or others should play the part of the serpent, and intrude and spoil.\"\n \n \"I am probably the most skeptical man in the world,\" said Casper Craig the tycoon, \"but I do believe my eyes. I have been there and seen it. It is indeed an unspoiled Paradise; and it would be a crime calling to the wide heavens for vengeance for anyone to smirch in any way that perfection.\n \n \"So much for that. Now to business. Gilbert, take a gram: Ninety Million Square Miles of Pristine Paradise for Sale or Lease. Farming, Ranching, exceptional opportunities for Horticulture. Gold, Silver, Iron, Earth-Type Fauna. Terms. Special Rates for Large Settlement Parties. Write, Gram, or call in person at any of our planetary offices as listed below. Ask for Brochure—Eden Acres Unlimited.\"\n \n \n\n \n Down in the great cave that Old Serpent, a two-legged one among whose names were \"Snake-Oil Sam,\" spoke to his underlings:\n \n \"It'll take them fourteen days to get back with the settlers. We'll have time to overhaul the blasters. We haven't had any well-equipped settlers for six weeks. It used to be we'd hardly have time to strip and slaughter and stow before there was another batch to take care of.\"\n \n \"I think you'd better write me some new lines,\" said Adam. \"I feel like a goof saying those same ones to each bunch.\"\n \n \"You are a goof, and therefore perfect for the part. I was in show business long enough to know never to change a line too soon. I did change Adam and Eve to Ha-Adamah and Hawwah, and the apple to the pomegranate. People aren't becoming any smarter—but they are becoming better researched, and they insist on authenticity.\n \n \"This is still a perfect come-on here. There is something in human nature that cannot resist the idea of a Perfect Paradise. Folks will whoop and holler to their neighbors to come in droves to spoil and mar it. It isn't greed or the desire for new land so much—though that is strong too. Mainly it is the feverish passion to befoul and poison what is unspoiled. Fortunately I am sagacious enough to take advantage of this trait. And when you start to farm a new world on a shoestring you have to acquire your equipment as you can.\"\n \n He looked proudly around at the great cave with its mountains and tiers of materials, heavy machinery of all sorts, titanic crates of foodstuff space-sealed; wheeled, tracked, propped, vaned and jetted vehicles; and power packs to run a world.\n \n He looked at the three dozen space ships stripped and stacked, and at the rather large pile of bone-meal in one corner.\n \n \"We will have to have another lion,\" said Eve. \"Bowser is getting old, and Marie-Yvette abuses him and gnaws his toes. And we do have to have a big-maned lion to lie down with the lamb.\"\n \n \"I know it, Eve. The lion is a very important prop. Maybe one of the crackpot settlers will bring a new lion.\"\n \n \"And can't you mix another kind of shining paint? This itches. It's hell.\"\n \n \"I'm working on it.\"\n \n \n\n \n Casper Craig was still dictating the gram:\n \n \"Amazing quality of longevity seemingly inherent in the locale. Climate ideal. Daylight or half-light. All twenty-one hours from Planet Delphina and from Sol. Pure water for all industrial purposes. Scenic and storied. Zoning and pre-settlement restrictions to insure congenial neighbors. A completely planned globular settlement in a near arm of our own galaxy. Low taxes and liberal credit. Financing our specialty—\"\n \n \"And you had better have an armed escort when you return,\" said Father Briton.\n \n \"Why in cosmos would we want an armed escort?\"\n \n \"It's as phony as a seven-credit note!\"\n \n \"You, a man of the cloth doubt it? And us ready skeptics convinced by our senses? Why do you doubt?\"\n \n \"It is only the unbelieving who believe so easily in obvious frauds. Theologically unsound, dramaturgically weak, philologically impossible, zoologically rigged, salted conspicuously with gold and shot through with anachronisms. And moreover he was afraid to play me at checkers.\"\n \n \"What?\"\n \n \"If I have a preternatural intellect I wouldn't be afraid of a game of checkers with anyone. Yet there was an unusual mind there somewhere; it was just that he chose not to make our acquaintance personally.\"\n \n \"They looked at the priest thoughtfully.\n \n \"But it was Paradise in one way,\" said Steiner at last.\n \n \"How?\"\n \n \"All the time we were there the woman did not speak.\"",
      "metadata": {
        "title": "In the Garden",
        "author": "R. A. Lafferty",
        "passage_id": "61007",
        "uid": "26978d33590c4f7187331a3cc21e1861",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "5",
                "uid": "d93ece0f6739491a81d5bd669adff45e",
                "response_text": "The story describes the crew of a probe spaceship as it investigates an extraterrestrial world. The crew is made up of Stark, Gilbert, Steiner, Langweilig, Craig, and Briton—the captain, executive officer, crewmember, engineer, part-owner of the probe, and a Catholic priest respectively.\nFrom orbit, the crew scans the moon using various technological instruments. They discover abundant highly developed life forms including a small location of sentient life, possibly of extraordinary magnitude. \n\nThey descend to the moon’s surface near the location of the sentient life. They discover a multitude of plants and animals that are found on Earth, also finding two individuals that appear to be human, Ha-Adamah and Hawwah.\n\nTheir investigation of the surroundings bears a startling resemblance to the biblical story of Genesis. The crew is bewildered to consider that this may indeed be a new Garden of Eden which never fell into sin and was preserved as a perfect paradise.\n\nAfter remaining for a few days, the crew returns to their probe. They remark how immoral it would be to meddle such an unspoiled paradise, but nevertheless begin the process of advertising the world to potential colonizers who would indeed exploit the moon for profit.\n\nSurprisingly, it is revealed that back on the planet that the individuals that were merely posing as Ha-Adamah and Hawwah working with their boss, Snake-oil Sam, to deceive potential colonists, ambushing them upon arrival and confiscating their valuable supplies and equipment.\n\nBack on the probe Father Briton chides the rest of the crew that they had been taken in by an obvious ruse and to inform any potential colonists to prepare for armed resistance. The incredulous crew demands to know the reasoning behind his conclusion.  He casually says that besides what he contended were glaring inaccuracies, the fact that Ha-Adamah refused to play him in checkers despite claiming to have a preternaturally perfect intellect was all the proof he needed."
              },
              {
                "worker_id": "1",
                "uid": "04863686a732485b9d5ac52f857d1dd8",
                "response_text": "Steiner uses several tools to determine if there is any life on a little moon that his craft hovers over. After getting some positive feedback, Steiner agrees to scan the rest of the world while his colleagues get some rest. The findings are good, so the crew decides to land.\n\nA man introduces himself as Ha-Adamah (Adam) and his female partner is named Hawwah (Eve). The man explains that he is able to speak whatever language his listener needs to hear in order to understand, and this includes animals like eagles and squirrels. \n\nStark then asks the mostly naked man if there are other humans on the moon. Adam says there cannot be more than one of anything. He then names each member of the crew something different and explains that they cannot be people because the man and woman themselves are people.\n\nThe crew members consume fruit from the garden and are incredibly surprised at their quality. The produce tastes better than anything they have ever eaten on earth. They begin to make the connections between this place and the Garden of Eden, and they wonder if they are dreaming. The man tells Langweilig he is not allowed to eat from the pomegranate tree, and the priest explains that in other languages, it is not the apple that is forbidden in the Garden of Eden, but the pomegranate. \n\nThe crew members continue to silently make comparisons to the Biblical story. Adam tells the men that he has heard about another world in which the people have fallen. He also explains that he has a preternatural intellect. In order to check his claims, the priest asks Adam to play checkers, but he refuses.\n\nThe crew members learn about the large serpent that lives in a nearby cave. Adam claims that if evil is to come to him, it will happen via the serpent. \n\nAfter leaving on their ship, all of the crew members are convinced that they have found an actual paradise, a place that has yet to be touched and has not yet fallen. They are eager to take advantage of the land’s resources and exploit the perfect conditions by selling off the land to settlers. \n\nThe only person who disagrees that this Garden of Eden is real is the priest. He points out several inconsistencies and argues that Adam refused to play checkers because in reality he could not win. His skepticism convinces his colleagues that their shared experience was in fact fake. \n\nMeanwhile, Adam and Eve take off their costumes and the paint on their bodies that causes them to glow. Snake-Oil Sam comes out of his cave and the trio begins to prepare for the return of the settlers. They have done this many times before, and each time they fool a group of people, those settlers come back and Snake-Oil Sam takes everything they have and stockpiles it for himself. His motivation is to gain enough equipment and goods to start his own civilization there. "
              },
              {
                "worker_id": "3",
                "uid": "1e348a091120481da21c024655fcfc77",
                "response_text": "A crew of humans in a spaceship encounter a small moon that has a promising amount of life that they wish to investigate. The crew of the Little Probe is made up of a typical captain, engineer, and executive officer, but also includes a tycoon and a priest, among others. Stark, the captain, orders his man Steiner to continue running scans overnight so that the crew can land on the moon the next day. When they approach the surface, they recognize various animals that look familiar from life on Earth, including sheep and lions, but there is a bright light they don’t understand the source of. Briton, the priest, is also a linguist so he approaches the two people that they find, and is surprised when he is easily understood. The man, Ha Adamah, speaks English perfectly, and says it is due to a special character of his own language that anyone can understand him. The woman on the surface, Hawwah, does not speak while the crew is there. These two are the only humanoids that the crew notices, and they find that the bright light seems to be coming from the people themselves. The main features on the surface are a large garden and a fountain, and the crew is struck by the resemblance to the biblical story of Adam and Eve. They test the boundaries of the similarities by asking to eat apples, which they are told is fine, but then find that pomegranates are not allowed to be consumed. This does not discount the similarity, as some versions of the story say that pomegranates were the forbidden fruit, and the crew is even more baffled when they hear that there is a serpent there that is the source of evil: they do not meet him, as he is in a cave. After three days on the surface, with Father Briton asking questions all the while, the crew goes back to the Little Prob where they discuss what they had witnessed. Stark was astounded at the purity of the world, and thought it needed to be protected, as did Steiner. Craig, the tycoon who owns 51% of the probe, admitted it was beautiful and would be terrible to ruin, but immediately works on dictating a message to Gilbert, the executive officer, advertising the moon to those who might want to buy or lease land there. On the surface, Ha-Adamah and Hawwah are meeting with the Old Serpent—it turns out that the entire situation was a ploy to draw the humans in, and they regularly kill incoming settlers to take their supplies. Father Briton is the only one who is suspicious, and convinces the rest of the crew that they have to doubt what they had just experienced—besides flaws in logic, he was surprised that his offer of a checkers game had been denied, as it would have been a chance for Ha-Adamah to show off."
              },
              {
                "worker_id": "6",
                "uid": "f77fecfc1cc6490f8aa8f2beade9b307",
                "response_text": "\tA crew of six find themselves in outer space, searching for their next mission. Steiner, one man on board, uses a machine to read the planet below, searching for life. The reader comes back positive, so they move on to the next test. The eppel reports an orange light, meaning the possibility of something extraordinary, but perhaps not.The eppel (the Extraordinary Perception Locator) was created with the intention to find the most extraordinary people, brains, or trains of thought.  \n\tStark, the captain, takes charge and demands they scan the rest of the planet for traces of infrastructure. He sends the rest of the crew to bed, and when they wake up the next morning, the report is back. Negative. They target the possibility of something extraordinary, as reported by the eppel, and make their way to the surface. \n\tAs they land, they take note of their surroundings. No shelters, buildings, or lean-tos. Just land with a lion and a lamb. They spot two people, neither naked nor clothed but bathed in light, and ask Father Briton, the Jesuit priest and resident linguist, to communicate with them. \n\tHe approaches them, talking in English, and the man, Ha-Adamah, replies. He introduces himself and the woman, named Hawwah. Father Briton asks him a few questions about their surroundings and names, and the Man responds with convoluted answers. He points the crew towards the fountain, so they may quench their thirst. Although hesitant at first, the men soon realize this water is the best they’ve ever had: the freshest, bubbliest, and clearest. Their suspicions about this place and the Man and Woman only grow. \n\tThe Captain attempts to question Ha-Adamah, and his answers confirm their suspicions. This place might be Paradise or Eden, the place where humanity was born and disgraced. Ha-Adamah welcomes them and offers the fruit on the trees to eat, except for the pomegranates. Ha-Adamah reveals that he is happy here, but that he has been warned that he may lose this happiness and lead the rest of his life desperately trying to find it again. The Man also shies away from the cave where he says the great and evil serpent lives. The crew, now convinced, leave this land and call it in. Selling it as paradise perfect for ranching, farming, camping, or other industrial uses, they plot their return with settlers to take over the land. Only Father Briton believes paradise is not paradise at all, simply a trick. \n\tThe story flashes back to the surface, where Hawwah and Ha-Adamah are huddling with the Serpent, Snake-Oil Sam. It is revealed that they pretend to be Adam and Eve to draw in settlers, only to steal their equipment and kill them. The Serpent congratulates them on their work, but reminds them that more is to be done in order to farm this new world and get all the equipment they need. \n\tOn the spaceship, Father Briton asks for an armed escort to accompany them. The others laugh him off. "
              }
            ]
          },
          {
            "question_text": "Describe the story's characters and how they interact.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "5",
                "uid": "d93ece0f6739491a81d5bd669adff45e",
                "response_text": "There are two main groups of characters: the crew of the Little Probe and the inhabitants of the “Garden” world.\n\nThe crew of the Little Probe consist of Stark, the captain; Gilbert, the executive officer; Steiner, a generall crewmember “flunky”; Langweilig, the engineer; Craig, a businessman and part-owner of the ship; and Fr. Briton, priest, linguist, and checkers afficionado. Stark is the leader of the group, commanding the others to their various tasks. Craig is shown to be a shrewd entrepreneur who is most intent on reaping potential profit from the situation they find themselves in.\n\nOn the moon lives Ha-Adamah and Hawwah who present themselves as archetypes of the biblical Adam and Eve. In reality, they are settlers, attempting to gather supplies to farm this world by stealing supplies from other settlers that they entice to world and then ambush. They are commanded by Snake-Oil Sam, a cynical, former showbusiness professional who runs the con.\n\nThe two groups interact when the crew descends to the surface of the moon. Ha-Adamah describes his environment in casual but bewildering terms to his visitors. Briton, as a Catholic priest, is designated by the crew to be Ha-Adamah’s main interlocutor. Hawwah, notedly does not speak at all—a flourish to attempt to further depict the attractiveness of the world to their all-male visitors. The crew beside Briton are enamored by the environment of the moon and are totally taken in by the performance of their hosts. The story concludes with Briton chiding his crewmates for their gullibility. Although Briton perhaps had the most reason to believe the moon was divinely ordained, he saw through the charade without much difficulty."
              },
              {
                "worker_id": "1",
                "uid": "04863686a732485b9d5ac52f857d1dd8",
                "response_text": "There are two different groups of characters at play in the story. The crew members who land on the new world represent one group, and Adam, Eve, and Snake-Oil Sam represent the other. The second group is nearly able to convince the first group that the moon is an untouched world, almost identical to the Garden of Eden. The crew members spend several days with Adam and Eve, and their elaborate ruse convinces them that Adam and Eve know nothing of death or suffering or ageing. It is only the priest that recognizes that the entire interaction was a con. \n\nAs soon as the crew members leave, Snake-Oil Sam comes out of his cave to give Adam and Eve more directions. He is in charge of the entire sham, and he gives out orders. Sam recognizes that people simply can’t resist ruining something that appears to be perfect. He has played this game before, and he knows that the crew members will be back with others to try and take over what they see as a paradise. Instead, he will murder them and take their goods to use for his own advantage. \n"
              },
              {
                "worker_id": "3",
                "uid": "1e348a091120481da21c024655fcfc77",
                "response_text": "The story’s characters fall into two groups: the crew of the Little Probe, and those who live on the surface of the small moon that the Little Probe goes to investigate. The crew consists of six Americans: Stark is the ship’s captain, so he calls all of shots onboard and asks a lot of questions on the surface. Steiner is his right-hand man, who tends to follow what Stark says and runs a lot of scans. Gilbert is the executive officer, who points out that they have to eat an apple to truly test if this reality is indeed the biblical paradise it appears to be, and Langweilig is the ship’s engineer. Craig is the tycoon who owns most of the ship, and wants to rent out land on the moon, and Briton is the priest and linguist who initiates contact on the surface and remains a skeptic throughout the story, eventually convincing the rest of the crew that the whole thing is a trap. On the surface, there are three characters of interest: the Old Serpent, who the reader finds out at the end of the story is in charge of the deception, and the two people known as Ha-Adamah and Hawwah. Ha-Adamah, or Adam, is the one who interacts with the ship’s crew when they visit the surface, and Hawwah, or Eve, does not talk to them while they are there—she does talk, though, and works on the plan with the serpent at the end. It is the serpent who creates the paint that makes Adam and Eve glow as if they are sources of light themselves, and writes the script for the deception."
              },
              {
                "worker_id": "6",
                "uid": "f77fecfc1cc6490f8aa8f2beade9b307",
                "response_text": "\tThe crew of the spaceship visiting “Paradise” is made up of six men: Captain Stark, Steiner, Father Briton, Casper Craig, Wolfgang Langweilig, and Gregory Gilbert, the executive officer. Each man serves his own purpose on board their ship. Based on their friendliness and camaraderie, these men have worked together before. Finding paradise was not their first mission. Although Stark is the captain, he often asks favors from Father Briton, the advanced linguist. In commanding him and letting him work, Stark is showing his complete trust in his crew. \n\tHowever, the group of creatures on Paradise interact a little differently. As Father Briton mentions later in the story, it’s clear that there was a powerful Thought (mind or being) on the planet, it just didn’t reveal itself to them. The Serpent, or Snake-Oil Sam, hides out in a cave with the equipment, money, ships, and bone meal that they have stolen from previous settlers. He is the true brains behind the operation. He has Ha-Adamah and Hawwah under his command, and, though they complain about the itchy costume, they are on board with his plan. He is clearly in charge and more manipulative than Captain Stark. \n\tAs the Serpent and his crew act out paradise, Captain Stark and his crew fall for it. All except for Father Briton. But the others don’t listen to him. They only laugh off his ideas and request for an armed escort. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "5",
                "uid": "d93ece0f6739491a81d5bd669adff45e",
                "response_text": "The story takes place on an unnamed extraterrestrial moon and a small probe that is visiting the moon to investigate its suitability for development. The moon is an earthlike environment that appears to be a perfect paradise in every respect. The land is fertile, the wild animals are domesticated, and there is an abundance of fruit to eat and minerals to potentially harvest. The description of the world that the crew receives depicts it as a true Eden—a perfect paradise. Also on the moon is a massive cave, from where the inhabitants of the moon store their stolen goods and prepare to ambush unsuspecting potential settlers. "
              },
              {
                "worker_id": "1",
                "uid": "04863686a732485b9d5ac52f857d1dd8",
                "response_text": "The crew members come across a new moon they have never visited before. Once they land, they find a mostly naked man and woman who are glowing in light. There are no cities or buildings, no civilization at all. Instead, they discover a lamb that lays with a lion and bears that do not fight the other animals. The magnificent water and fruit that the land bears, along with many other clues, convince them that they have stumbled upon the Garden of Eden.\n\nWhen the visitors learn about the nearby serpent who lives in a cave and has the power to bring about evil to the land, they are downright convinced that this place is just like Earth, except it is still pure. \n\nAfter staying several days, the men take off in their spaceship and Adam and Eve are revealed to be con artists. Snake-Oil Sam, their boss, is hiding in a cave, and he has stockpiled dozens of spaceships, piles of bonemeal, and lots of equipment to use to create his own civilization. Sam knows that the land is perfect for farming and it is beautiful and untouched. He wants to destroy it in his own way, by creating his own society. \n"
              },
              {
                "worker_id": "3",
                "uid": "1e348a091120481da21c024655fcfc77",
                "response_text": "The majority of this story takes place on the surface of a small moon, in an area with a gorgeous garden and large variety of flora and fauna that are familiar from Earth. The crew of the Little Probe visits for three days, looking to investigate the signs of life and intelligence that their scans had reported. There are two people covered in very bright light, and meadows, forests, and a fountain, but no buildings. The water in the fountain is cool and clean, and the trees have any number of fresh fruits to pick from. The animals there, including lions, sheep, and monkeys, seem to enjoy the soft grass. The one area the crew of the Little Probe did not visit was a large cave that they were told was the home of the great serpent. When Ha-Adamah goes to talk to the serpent we see that this cave is filled with various types of supplies, military and practical, including power equipment, food, and dozens of space ships."
              },
              {
                "worker_id": "6",
                "uid": "f77fecfc1cc6490f8aa8f2beade9b307",
                "response_text": "\tIn the Garden by R.A. Lafferty takes place on a planet somewhere in the universe. The three inhabitants (animals not included) have kept it isolated and deserted. There aren’t any structures, buildings, or infrastructure that would be recognizable from space. Even on land, you can’t tell this planet has been touched by human hands. Trees grow abundantly with the most delicious fruits, a fountain spouts water that is clear and clean, and lush green grass rests on the ground. Gold speckles shine on the rocks, a promise of greater treasures to be found underground.\n\tThe only real mystery is the cave, which the crew of the visiting spaceship are not allowed to see. Within is the evidence of humanity: spaceships, farming equipment, and tools. However, with all this tucked away, this land can truly pass off as Paradise: untouched, unblemished, and unseen by humans. "
              }
            ]
          },
          {
            "question_text": "How do religion and religious faith contribute to the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "5",
                "uid": "d93ece0f6739491a81d5bd669adff45e",
                "response_text": "Christianity is a central component of the story. The heart of the narrative revolves around the description of the world as a replica of the biblical Garden of Eden. The author goes into extensive detail regarding the aspects of the garden and its inhabitants and how they conform to aspects of the Genesis narrative and how it was understood by religious analysis. It is heavily suggested that here, the Serpent did not succeed in convincing man to sin and fall from grace as was the case in the biblical narrative. As a result, Ha-Adamah and Hawwah (the Hebrew names for Adam and Eve) remain clothed in light and still enjoy the preternatural gifts of creation including a highly advanced intellect, immortality and even an illuminated appearance.\n\nIt is revealed that this depiction is a deception on the part of the moon’s inhabitants. Interestingly, the 4 non-believers on the crew are the most ready to believe that the state of affairs on the planet is indeed supernatural. It is only the clever priest who possesses faith, but employs the skepticism necessary to see through the fraud.\n"
              },
              {
                "worker_id": "1",
                "uid": "04863686a732485b9d5ac52f857d1dd8",
                "response_text": "Snake-Oil Sam, the mastermind behind the ruse, realizes that the visitors who come to the new world will immediately make connections to the Garden of Eden if there are enough clues to point them in that direction. In that way, the story demonstrates that people are susceptible to believing in an already established story or trope, regardless of how impossible it seems. Since the settlers are familiar with the Bible and the famous story of Adam and Eve, they are preconditioned to believe that another Adam and Eve may exist in a separate world, a world that has yet to be tainted with sin. \n\nThe priest is the only character that sees through Adam and Eve’s show. Although it’s strange that the religious man in the group would be the most skeptical, it’s clear that he has a keen eye for details. He purposefully asks Adam to play checkers with him to test his supernatural intellect, and when Adam refuses, he realizes that he cannot be who he says he is. Perhaps the priest has the most to lose in believing in this illusion, so his refusal to take the con artists at their word shows his true dedication to Christianity. \n"
              },
              {
                "worker_id": "3",
                "uid": "1e348a091120481da21c024655fcfc77",
                "response_text": "The people on the surface of the moon that the crew of the Little Probe is investigating are part of a very detailed ploy to replicate the biblical story of Adam and Eve. This religious story served as a recognizable type of paradise, which the serpent used to his advantage, knowing that humans would be drawn to something that they thought was perfect. All of the details of the facade were carefully designed around an attempt to make an authentic, tempting environment. This included changing some details from the English-translated version of the biblical story, including giving the people their Hebrew names of Ha Adamah and Hawwah. The other major point of religion in the story is the Jesuit priest who is onboard the Little Probe. It is Father Briton who is the skeptic, asking questions during his stay on the surface to try to uncover the truth of the situation. The rest of the crew are surprised that it is the religious man who is skeptical of the reality of the moon, but he convinces them that he is right, having thought carefully about every detail of every interaction they had on the surface."
              },
              {
                "worker_id": "6",
                "uid": "f77fecfc1cc6490f8aa8f2beade9b307",
                "response_text": "\tThe story of Adam and Eve (or Genesis) is one of the most widely known myths. The idea that we, as humans, once inhabited Paradise, but lost it due to our greed and stolen innocence is intoxicating. It explains why life isn’t perfect, why things don’t always go our way, and why people die. \n\tIn In the Garden, this story is explored in a different manner. The Christian origin story acts as a backdrop for this uninhabited planet that a crew visits. After exploring, they are quick to believe that they have discovered another universe’s Eden. And, therefore, quick to destroy it. \n\tTheir religious faith and belief in the story of Adam and Eve adds to the gravity of the situation. If this weren’t a well-known story, then the crew would have been less amazed by the space before them. The perfection of the place, and the potential of Paradise, was what truly brought them in and, eventually, destroyed them.\n"
              }
            ]
          },
          {
            "question_text": "How is human fallenness explored as a theme?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "5",
                "uid": "d93ece0f6739491a81d5bd669adff45e",
                "response_text": "Human sinfulness and its collective fall from grace are referenced in several ways in the story. Ha-Adamah contrasts his world’s perfection with the fallenness that is apparent in the visitors. He claims to be free from the stain of original sin. He presents himself as perfectly happy and not subject to corruption, aging, or death. This is contrasted with Earth's humanity which was fated to “lose that happiness, and then to seek it vainly through all the ages.”\n\nThe entire crew of the Little Probe agree on the unacceptability of spoiling a pristine world. Even so, they irresistibly and almost gleefully prepare to exploit the world’s riches.\n\nSnake-Oil Sam expounds upon this inclination. He claims that on top of the very real greed of the visitors they’ve deceived over the years, they are capitalizing on the human desire to despoil the unspoiled. This is a clear summation of concupiscence—the inclination for fallen humanity to tend toward sin. It is clear that Sam and his associates are just as fallen as the other individuals in the story, preying on others to further their own goals."
              },
              {
                "worker_id": "1",
                "uid": "04863686a732485b9d5ac52f857d1dd8",
                "response_text": "Although the visiting crew members are impressed and in awe of the Garden of Eden, they have every intention of pillaging the place. They love the clean and delicious water it offers and the tasty fruit that is better than anything they’ve had before. Yet, they cannot resist their urge to take over the land and commercialize it. They do not care that their actions will ruin the purity of the land and its two occupants. They are greedy and only want what will benefit them in the end. \n\nLikewise, Snake-Oil Sam recognizes the immense beauty of the untouched world, and instead of trying to preserve it, he entices groups of people to come and try to take it over so that he can murder them and take their goods and equipment. Snake-Oil Sam is cunning because he innately knows that if he can convince settlers that this world is pure and special, they will immediately desire to destroy it. According to Sam, people can’t resist ruining something that appears to be unique and unadulterated. He uses human nature and the desire to control to his own advantage. By convincing strangers that Adam and Eve are simple and kind and unaware of ageing or suffering, he knows that those strangers will return to the land to make sure that Adam and Eve learn all about those topics. They can’t help themselves precisely because humans have already fallen and are predisposed to sinning. \n"
              },
              {
                "worker_id": "3",
                "uid": "1e348a091120481da21c024655fcfc77",
                "response_text": "Human fallenness can be interpreted as the degraded state of mankind, or as inauthenticity in human interaction. These are both important themes to this story. In terms of inauthenticity, this is the root of the interactions on the surface of the moon. As the crew of the Little Probe is exploring the area where the two humanoids are living, everything they encounter is a carefully staged ploy. The two people on the surface do not let on any of the truth of their situation to the crew, and deliberately lie to them in order to entice them to come back to settle on the moon. This is ironic, as the serpent’s plan for this ruse is heavily based on others’ desires for authenticity in the story they are presented, thus the small changes in various iterations of this illusion of the biblical story of Adam and Eve. In terms of degradation, another central idea is that this moon is a pure and untouched place. However, the serpent knows that this will entice humans to investigate and try to settle there, because of an innate draw to spoil things that are in perfect condition. The crew of the Little Probe recognize this idea in a different way, in that they see this moon as what humankind could have been before it fell, when Adam and Eve fell to temptation. They see this as innocence that would be a crime to ruin, and know that humans of their own world would be inclined to disrupt what was there."
              },
              {
                "worker_id": "6",
                "uid": "f77fecfc1cc6490f8aa8f2beade9b307",
                "response_text": "\tThe story of Adam and Eve ends with human failure. Eve, or Hawwah, eats the apple/pomegranate that God told them not to eat. And so she is cursed with painful birth, toiling the land, and eventual return to dust, or death. Both she and Adam are expelled from Eden and their expulsion leads to the creation of other humans. There is no longer one Man or Woman. \n\tHowever in this story, the destruction of paradise is brought about by two separate groups. The Serpent’s crew of actors and props creates a false paradise to lure people in and pillage them. This in itself is an example of human fallenness, failure, or expulsion from Eden. By extorting the idea of paradise and using it to harm others, the Serpent and his crew are fallen humans. \n\tAnd so are the crew of the visiting spaceship. After discovering so-called paradise, their first thought is to destroy it. Their tools are farming, building, and burning, but not preserving. Human greed is what led to the falling, and is also what led to the falling of these two crews. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 3309,
        "document_length_chars": 18698
      }
    }
  ]
}