{
  "item_metadata": {
    "item_id": "61048",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61048",
      "content": "The Girls From Fieu Dayol\n \n\n By ROBERT F. YOUNG\n \n\n They were lovely and quick to learn—and their only faults were little ones!\n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, September 1961. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Up until the moment when he first looked into Hippolyte Adolphe Taine's History of English Literature , Herbert Quidley's penchant for old books had netted him nothing in the way of romance and intrigue. Not that he was a stranger to either. Far from it. But hitherto the background for both had been bedrooms and bars, not libraries.\n \n On page 21 of the Taine tome he happened upon a sheet of yellow copy paper folded in four. Unfolding it, he read:\n  asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj Cai: Sities towms copeis wotnid. Gind snoll doper nckli! Wilbe Fieu Dayol fot ig habe mot toseo knwo—te bijk weil en snoll doper—Klio, asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj\n \n \n Since when, Quidley wondered, refolding the paper and putting it back in the book, had high-school typing students taken to reading Taine? Thoughtfully he replaced the book on the shelf and moved deeper into the literature section.\n \n He had just taken down Xenophon's Anabasis when he saw the girl walk in the door.\n \n Let it be said forthwith that old books were not the only item on Herbert Quidley's penchant-list. He liked old wood, too, and old paintings, not to mention old wine and old whiskey. But most of all he liked young girls. He especially liked them when they looked the way Helen of Troy must have looked when Paris took one gander at her and started building his ladder. This one was tall, with hyacinth hair and liquid blue eyes, and she had a Grecian symmetry of shape that would have made Paris' eyes pop had he been around to take notice. Paris wasn't, but Quidley's eyes, did the job.\n \n After coming in the door, the girl deposited a book on the librarian's desk and headed for the literature section. Quickly Quidley lowered his eyes to the Anabasis and henceforth followed her progress out of their corners. When she came to the O's she paused, took down a book and glanced through it. Then she replaced it and moved on to the P's ... the Q's ... the R's. Barely three feet from him she paused again and took down Taine's History of English Literature .\n \n He simply could not believe it. The odds against two persons taking an interest in so esoteric a volume on a single night in a single library were ten thousand to one. And yet there was no gainsaying that the volume was in the girl's hands, and that she was riffling through it with the air of a seasoned browser.\n \n Presently she returned the book to the shelf, selected another—seemingly at random—and took it over to the librarian's desk. She waited statuesquely while the librarian processed it, then tucked it under her arm and whisked out the door into the misty April night. As soon as she disappeared, Quidley stepped over to the T's and took Taine down once more. Just as he had suspected. The makeshift bookmark was gone.\n \n He remembered how the asdf-;lkj exercise had given way to several lines of gibberish and then reappeared again. A camouflaged message? Or was it merely what it appeared to be on the surface—the efforts of an impatient typing student to type before his time?\n \n He returned Taine to the shelf. After learning from the librarian that the girl's name was Kay Smith, he went out and got in his hardtop. The name rang a bell. Halfway home he realized why. The typing exercise had contained the word \"Cai\", and if you pronounced it with hard c, you got\n\"Kai\"—or \"Kay\". Obviously, then, the exercise had been a message, and had been deliberately inserted in a book no average person would dream of borrowing.\n \n By whom—her boy friend?\n \n Quidley winced. He was allergic to the term. Not that he ever let the presence of a boy friend deter him when he set out to conquer, but because the term itself brought to mind the word \"fiance,\" and the word\n\"fiance\" brought to mind still another word, one which repelled him violently. I.e., \"marriage\". Just the same, he decided to keep Taine's History under observation for a while.\n \n \n\n \n Her boy friend turned out to be her girl friend, and her girl friend turned out to be a tall and lissome, lovely with a Helenesque air of her own. From the vantage point of a strategically located reading table, where he was keeping company with his favorite little magazine, The Zeitgeist , Quidley watched her take a seemingly haphazard route to the shelf where Taine's History reposed, take the volume down, surreptitiously slip a folded sheet of yellow paper between its pages and return it to the shelf.\n \n After she left he wasted no time in acquainting himself with the second message. It was as unintelligible as the first:\n  asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj asdf ;lkj Cai: Habe wotnid ig ist ending ifedererer te. T'lide sid Fieu Dayol po jestig toseo knwo, bijk weil en snoll doper entling—Yoolna. asdf ;lkj asdf\n;lkj asdf ;lkj asdf ;lkj\n \n \n Well, perhaps not quite as unintelligible. He knew, at least, who Cai was, and he knew—from the reappearance of the words wotnid , Fieu Dayol and snoll doper —that the two communications were in the same code. And certainly it was reasonable to assume that the last word— Yoolna —was the name of the girl he had just seen, and that she was a different person from the Klio whose name had appended the first message.\n \n He refolded the paper, replaced it between the pages, returned the book to the shelf and went back to the reading table and The Zeitgeist .\n \n Kay didn't show up till almost closing time, and he was beginning to think that perhaps she wouldn't come around for the pickup till tomorrow when she finally walked in the door. She employed the same tactics she had employed the previous night, arriving, as though by chance, at the T-section and transferring the message with the same undetectable legerdemain to her purse. This time, when she walked out the door, he was not far behind her.\n \n She climbed into a sleek convertible and pulled into the street. It took him but a moment to gain his hardtop and start out after her. When, several blocks later, she pulled to the curb in front of an all-night coffee bar, he followed suit. After that, it was merely a matter of following her inside.\n \n He decided on Operation Spill-the-sugar. It had stood him in good stead before, and he was rather fond of it. The procedure was quite simple. First you took note of the position of the sugar dispensers, then you situated yourself so that your intended victim was between you and the nearest one, then you ordered coffee without sugar in a low voice, and after the counterman or countergirl had served you, you waited till he/she was out of earshot and asked your i.v. to please pass the sugar. When she did so you let the dispenser slip from your fingers in such a way that some of its contents spilled on her lap—\n \n \"I'm terribly sorry,\" he said, righting it. \"Here, let me brush it off.\"\n \n \n\n \n \"It's all right, it's only sugar,\" she said, laughing.\n \n \"I'm hopelessly clumsy,\" he continued smoothly, brushing the gleaming crystals from her pleated skirt, noting the clean sweep of her thighs.\n\"I beseech you to forgive me.\"\n \n \"You're forgiven,\" she said, and he noticed then that she spoke with a slight accent.\n \n \"If you like, you can send it to the cleaners and have them send the bill to me. My address is 61 Park Place.\" He pulled out his wallet, chose an appropriate card, and handed it to her—\n \n \n Herbert Quidley: Profiliste\n \n \n Her forehead crinkled. \" Profiliste? \"\n \n \"I paint profiles with words,\" he said. \"You may have run across some of my pieces in the Better Magazines. I employ a variety of pseudonyms, of course.\"\n \n \"How interesting.\" She pronounced it \"anteresting.\"\n \n \"Not famous profiles, you understand. Just profiles that strike my fancy.\" He paused. She had raised her cup to her lips and was taking a dainty sip. \"You have a rather striking profile yourself, Miss—\"\n \n \"Smith. Kay Smith.\" She set the cup back on the counter and turned and faced him. For a second her eyes seemed to expand till they preoccupied his entire vision, till he could see nothing but their disturbingly clear—and suddenly cold—blueness. Panic touched him, then vanished when she said, \"Would you really consider word-painting my profile, Mr. Quidley?\"\n  Would he! \"When can I call?\"\n \n She hesitated for a moment. Then: \"I think it will be better if I call on you. There are quite a number of people living in our—our house. I'm afraid the quarters would be much too cramped for an artist like yourself to concentrate.\"\n \n Quidley glowed. Usually it required two or three days, and sometimes a week, to reach the apartment phase. \"Fine,\" he said. \"When can I expect you?\"\n \n She stood up and he got to his feet beside her. She was even taller than he had thought. In fact, if he hadn't been wearing Cuban heels, she'd have been taller than he was. \"I'll be in town night after next,\" she said. \"Will nine o'clock be convenient for you?\"\n \n \"Perfectly.\"\n \n \"Good-by for now then, Mr. Quidley.\"\n \n He was so elated that when he arrived at his apartment he actually did try to write a profile. His own, of course. He sat down at his custom-built chrome-trimmed desk, inserted a blank sheet of paper in his custom-built typewriter and tried to arrange his thoughts. But as usual his mind raced ahead of the moment, and he saw the title, Self Profile , nestling noticeably on the contents page of one of the Better Magazines, and presently he saw the piece itself in all its splendid array of colorful rhetoric, sparkling imagery and scintillating wit, occupying a two-page spread.\n \n It was some time before he returned to reality, and when he did the first thing that met his eyes was the uncompromisingly blank sheet of paper. Hurriedly he typed out a letter to his father, requesting an advance on his allowance, then, after a tall glass of vintage wine, he went to bed.\n \n \n\n \n In telling him that she would be in town two nights hence, Kay had unwittingly apprised him that there would be no exchange of messages until that time, so the next evening he skipped his vigil at the library. The following evening, however, after readying his apartment for the forthcoming assignation, he hied himself to his reading-table post and took up The Zeitgeist once again.\n \n He had not thought it possible that there could be a third such woman.\n \n And yet there she was, walking in the door, tall and blue-eyed and graceful; dark of hair and noble of mien; browsing in the philosophy section now, now the fiction section, now moving leisurely into the literature aisle and toward the T's....\n \n The camouflage had varied, but the message was typical enough:\n  fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl; Cai: Gind en snoll doper nckli! Wotnid antwaterer Fieu Dayol hid jestig snoll doper ifedererer te. Dep gogensplo snoll dopers ensing!—Gorka. fdsa jkl; fdsa jkl; fdsa jkl; fdsa jkl;\n \n \n Judging from the repeated use of the words, snoll dopers were the topic of the day. Annoyed, Quidley replaced the message and put the book back on the shelf. Then he returned to his apartment to await Kay.\n \n He wondered what her reaction would be if he asked her point-blank what a snoll doper was; whether she would reveal the nature of the amateur secret society to which she and Klio and Yoolna and Gorka belonged. It virtually had to be an amateur secret society. Unless, of course, they were foreigners. But what on earth foreign organization would be quixotic enough to employ Taine's History of English Literature as a communications medium when there was a telephone in every drugstore and a mailbox on every corner?\n \n Somehow the words \"what on earth foreign organization\" got turned around in his mind and became \"what foreign organization on earth\" and before he could summon his common sense to succor him, he experienced a rather bad moment. By the time the door chimes sounded he was his normal self again.\n \n He straightened his tie with nervous fingers, checked to see if his shirt cuffs protruded the proper length from his coat sleeves, and looked around the room to see if everything was in place. Everything was—the typewriter uncovered and centered on the chrome-trimmed desk, with the sheaf of crinkly first-sheets beside it; the reference books stacked imposingly nearby; Harper's , The Atlantic and The Saturday Review showing conspicuously in the magazine rack; the newly opened bottle of bourbon and the two snifter glasses on the sideboard; the small table set cozily for two—\n \n \n\n \n The chimes sounded again. He opened the door.\n \n She walked in with a demure, \"Hello.\" He took her wrap. When he saw what she was wearing he had to tilt his head back so that his eyes wouldn't fall out of their sockets.\n \n Skin, mostly, in the upper regions. White, glowing skin on which her long hair lay like forest pools. As for her dress, it was as though she had fallen forward into immaculate snow, half-burying her breasts before catching herself on her elbows, then turning into a sitting position, the snow clinging to her skin in a glistening veneer; arising finally to her feet, resplendently attired.\n \n He went over to the sideboard, picked up the bottle of bourbon. She followed. He set the two snifter glasses side by side and tilted the bottle. \"Say when.\" \"When!\" \"I admire your dress—never saw anything quite like it.\" \"Thank you. The material is something new. Feel it.\"\n\"It's—it's almost like foam rubber. Cigarette?\" \"Thanks.... Is something wrong, Mr. Quidley?\" \"No, of course not. Why?\" \"Your hands are trembling.\" \"Oh. I'm—I'm afraid it's the present company, Miss Smith.\" \"Call me Kay.\"\n \n They touched glasses: \"Your liquor is as exquisite as your living room, Herbert. I shall have to come here more often.\" \"I hope you will, Kay.\"\n\"Though such conduct, I'm told, is morally reprehensible on the planet Earth.\" \"Not in this particular circle. Your hair is lovely.\" \"Thank you.... You haven't mentioned my perfume yet. Perhaps I'm standing too far away.... There!\" \"It's—it's as lovely as your hair, Kay.\" \"Um, kiss me again.\" \"I—I never figured—I mean, I engaged a caterer to serve us dinner at 9:30.\" \"Call him up. Make it 10:30.\"\n \n \n\n \n The following evening found Quidley on tenter-hooks. The snoll-doper mystery had acquired a new tang. He could hardly wait till the next message transfer took place.\n \n He decided to spend the evening plotting the epic novel which he intended to write someday. He set to work immediately. He plotted mentally, of course—notes were for the hacks and the other commercial non-geniuses who infested the modern literary world. Closing his eyes, he saw the whole vivid panorama of epic action and grand adventure flowing like a mighty and majestic river before his literary vision: the authentic and awe-inspiring background; the hordes of colorful characters; the handsome virile hero, the compelling Helenesque heroine.... God, it was going to be great! The best thing he'd ever done! See, already there was a crowd of book lovers in front of the bookstore, staring into the window where the new Herbert Quidley was on display, trying to force its way into the jammed interior.... Cut to interior. FIRST EAGER CUSTOMER: Tell me quickly, are there any more copies of the new Herbert Quidley left? BOOK CLERK: A few. You don't know how lucky you are to get here before the first printing ran out. FIRST EAGER CUSTOMER: Give me a dozen. I want to make sure that my children and my children's children have a plentiful supply. BOOK CLERK: Sorry. Only one to a customer. Next? SECOND EAGER CUSTOMER: Tell me quickly, are ... there ... any ... more ... copies ... of—\n \n ZZZZZZZZZZZZZ....\n \n Message no. 4, except for a slight variation in camouflage, ran true to form:\n  a;sldkfj a;sldkfj a;sldkfj a;sldkfj Cai: Habe te snoll dopers ensing? Wotnid ne Fieu Dayol ist ifederereret, hid jestig snoll doper. Gind ed, olro—Jilka. a;sldkfj a;sldkfj a;sldkfj a;sldkfj\n \n \n Quidley sighed. What, he asked himself, standing in the library aisle and staring at the indecipherable words, was a normal girl like Kay doing in such a childish secret society? From the way she and her correspondents carried on you'd almost think they were Martian girl scouts on an interplanetary camping trip, trying for their merit badges in communications!\n \n You could hardly call Kay a girl scout, though.\n \n Nevertheless, she was the key figure in the snoll-doper enigma. The fact annoyed him, especially when he considered that a snoll doper , for all he knew, could be anything from a Chinese fortune cooky to an H-bomb.\n \n He remembered Kay's odd accent. Was that the way a person would speak English if her own language ran something like \" ist ifedereret, hid jestig snoll doper adwo ?\"\n \n He remembered the way she had looked at him in the coffee bar.\n \n He remembered the material of her dress.\n \n He remembered how she had come to his room.\n \n \"I didn't know you had a taste for Taine.\"\n \n \n\n \n Her voice seemed to come from far away, but she was standing right beside him, tall and bewitching; Helenesque as ever. Her blue eyes became great wells into which he found himself falling. With an effort, he pulled himself back. \"You're early tonight,\" he said lamely.\n \n She appropriated the message, read it. \"Put the book back,\" she said presently. Then, when he complied: \"Come on.\"\n \n \"Where are we going?\"\n \n \"I'm going to deliver a snoll doper to Jilka. After that I'm going to take you home to meet my folks.\"\n \n The relieved sigh he heard was his own.\n \n They climbed into her convertible and she nosed it into the moving line of cars. \"How long have you been reading my mail?\" she asked.\n \n \"Since the night before I met you.\"\n \n \"Was that the reason you spilled the sugar?\"\n \n \"Part of the reason,\" he said. \"What's a snoll doper ?\"\n \n She laughed. \"I don't think I'd better tell you just yet.\"\n \n He sighed again. \"But if Jilka wanted a snoll doper ,\" he said after a while, \"why in the world didn't she call you up and say so?\"\n \n \"Regulations.\" She pulled over to the curb in front of a brick apartment building. \"This is where Jilka lives. I'll explain when I get back.\"\n \n He watched her get out, walk up the walk to the entrance and let herself in. He leaned his head back on the seat, lit a cigarette and exhaled a mixture of smoke and relief. On the way to meet her folks. So it was just an ordinary secret society after all. And here he'd been thinking that she was the key figure in a Martian plot to blow up Earth—\n \n Her folks !\n \n Abruptly the full implication of the words got through to him, and he sat bolt-up-right on the seat. He was starting to climb out of the car when he saw Kay coming down the walk. Anyway, running away wouldn't solve his problem. A complete disappearing act was in order, and a complete disappearing act would take time. Meanwhile he would play along with her.\n \n \n\n \n A station wagon came up behind them, slowed, and matched its speed with theirs. \"Someone's following us,\" Quidley said.\n \n \"Probably Jilka.\"\n \n Five minutes later the station wagon turned down a side street and disappeared. \"She's no longer with us,\" Quidley said.\n \n \"She's got to pick someone up. She'll meet us later.\"\n \n \"At your folks'?\"\n \n \"At the ship.\"\n \n The city was thinning out around them now, and a few stars were visible in the night sky. Quidley watched them thoughtfully for a while. Then:\n\"What ship?\" he said.\n \n \"The one we're going to Fieu Dayol on.\"\n \n \" Fieu Dayol? \"\n \n \"Persei 17 to you. I said I was going to take you home to meet my folks, didn't I?\"\n \n \"In other words, you're kidnapping me.\"\n \n She shook her head vehemently. \"I most certainly am not! Neither according to interstellar law or your own. When you compromised me, you made yourself liable in the eyes of both.\"\n \n \"But why pick on me? There must be plenty of men on Fieu Dayol . Why don't you marry one of them?\"\n \n \"For two reasons: one, you're the particular man who compromised me. Two, there are not plenty of men on Fieu Dayol . Our race is identical to yours in everything except population-balance between the sexes. At periodic intervals the women on Fieu Dayol so greatly outnumber the men that those of us who are temperamentally and emotionally unfitted to become spinsters have to look for wotnids —or mates—on other worlds. It's quite legal and quite respectable. As a matter of fact, we even have schools specializing in alien cultures to expedite our activities. Our biggest problem is the Interstellar statute forbidding us the use of local communications services and forbidding us to appear in public places. It was devised to facilitate the prosecution of interstellar black marketeers, but we're subject to it, too, and have to contrive communications systems of our own.\"\n \n \"But why were all the messages addressed to you?\"\n \n \"They weren't messages. They were requisitions. I'm the ship's stock girl.\"\n \n \n\n \n April fields stretched darkly away on either side of the highway. Presently she turned down a rutted road between two of them and they bounced and swayed back to a black blur of trees. \"Here we are,\" she said.\n \n Gradually he made out the sphere. It blended so flawlessly with its background that he wouldn't have been able to see it at all if he hadn't been informed of its existence. A gangplank sloped down from an open lock and came to rest just within the fringe of the trees.\n \n Lights danced in the darkness behind them as another car jounced down the rutted road. \"Jilka,\" Kay said. \"I wonder if she got him.\"\n \n Apparently she had. At least there was a man with her—a rather woebegone, wilted creature who didn't even look up as they passed. Quidley watched them ascend the gangplank, the man in the lead, and disappear into the ship.\n \n \"Next,\" Kay said.\n \n Quidley shook his head. \"You're not taking me to another planet!\"\n \n She opened her purse and pulled out a small metallic object \"A little while ago you asked me what a snoll doper was,\" she said.\n\"Unfortunately interstellar law severely limits us in our choice of marriageable males, and we can take only those who refuse to conform to the sexual mores of their own societies.\" She did something to the object that caused it to extend itself into a long, tubular affair.\n\" This is a snoll doper .\"\n \n She prodded his ribs. \"March,\" she said.\n \n He marched. Halfway up the plank he glanced back over his shoulder for a better look at the object pressed against his back.\n \n It bore a striking resemblance to a shotgun.",
      "metadata": {
        "title": "The Girls from Fieu Dayol",
        "author": "Robert F. Young",
        "passage_id": "61048",
        "uid": "51ffefefb8bf4c358eb7e0fdf59cd237",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "112",
                "uid": "bd58d0130c204b74a0701d26b7f29dbe",
                "response_text": "Herbert Quidley finds a yellow paper with unintelligible words folded in the book called History of English Literature by Hippolyte Adolphe Taine. After he continues to work, he sees a girl come in, browse randomly, and take Taine’s book. The girl quickly riffles through the book, puts it back on the shelf, and leaves the library. After the girl leaves, Quidley checks the book, noticing the disappearance of the yellow paper. He learns the girl’s name, Kay Smith, from the librarian and goes home. On his way home, he guesses that the paper is a kind of message transmitted through an esoteric book. He guesses the identity of the person who might do this message job with Kay, none of which pleases him as he has a liking for the girl, so he decides to observe this messaging action for a while.\n\nThe following day, when Quidley waits at the library, a girl different from Kay comes to the library, puts another paper in Taine’s book, and leaves. Quidley sees the paper and finds another batch of unintelligible words, from which he finds two common words, Fieu Dayol and snoll doper. He puts back the letter and goes back to his seat. When the library is about to close, Kay comes to take the paper and leaves. Quidley follows behind her into a coffee bar. He intentionally spills the sugar on her, which allows him to start talking to her. Throughout the conversation, Quidley reveals his identity as a profiliste and accepts Kay’s request to make her a profile. They set up a time to meet next time. After they separate, Quidley goes home and writes a letter to his father for the allowance.\n\nTwo days later, Quidley goes to the library again and sits at his reading-table post with his favorite magazine. He sees the third woman come in and do the same thing as the previous girls. He reads the new message and returns to his apartment waiting for Kay. He thinks about the meaning of snoll doper. When Kay comes, they do something sexually. The following day, puzzled by the secret of the snoll doper, Quidley decides to read the message before the exchange happens. Kay finds out that Quidley is reading the message. She tells him to come with her to deliver the snoll doper to Jilka and meet her folks. When Quidley waits in the car, he realizes the possible true identity of Kay and what may happen next. Quidley learns from the conversation with Kay that they are heading to the ship to Fieu Dayol. He also learns that Kay is the ship’s stock girl, and all the messages are actually requisitions for the snoll dopers. He realizes that he is kidnapped to another planet, Fieu Dayol, where women outnumber men. He sees a man with Jilka ascend the ship and disappear. Kay forces Quidley to go into the ship by pointing him with a shotgun, which is called snoll doper in Kay’s language.\n"
              },
              {
                "worker_id": "111",
                "uid": "70133ac675c64f84894cb94c22c6f47f",
                "response_text": "The plot follows Herbert Quidley. Herbert is a man who loves to engage with women. One day, he was in the public library when he saw a weird message scribbled on a bookmark in a random book. He then saw a very beautiful lady enter the library, and go to the book which had weird writing. Herbert learnt that her name was Kay. Herbert thought this was weird, but he thought it was even weirder when the next day another girl came and left another bookmark in the same book. Herbert understood that the girls were using the book as a means of communication, but he didn’t understand the messages. After the original girl came back, Herbert decided to follow her to a bar in order to meet her. Herbert uses a trick in order to first approach her, and they end up getting to know each other. They agree to meet in a few days at Herbert’s house. Herbert was very surprised to learn that there was a third woman communicating with the other two girls. After Herbert and Kay get to know each other more on their date, Herbert decides to confront Kay about her book in their next outing. When he confronts Kay, Kay tells him that she was in fact from an alien species, and that she used the books to communicate with her crew. Kay tells Herbert that he wants to take her to her home planet and mate with him, but when Herbert tries to refuse Kay takes out a shotgun and forces him onto their ship. "
              },
              {
                "worker_id": "107",
                "uid": "953c9e0cdfb8404bb7d8a5dd36c8e23c",
                "response_text": "Herbert Quidley’s penchant for old books has never been much of a problem for him. He finds a sheet of yellow paper in one of his Taine tomes and unfolds it, making him wonder what high school students read. He notices a girl walk through the door, noting that she deposits a book at the librarian’s desk and heads towards the literature section. Although Quidley lowers his eyes, he finds that she also has picked up the book that he had earlier. When he goes to see the book again later, he notes that the makeshift bookmark is now gone. He thinks back to the message again and wonders who could have left it for her. Quidley later finds out that the girl’s friend is another girl, and he tries to figure out what the second message means. Kay shows up again to leave another message, and Quidley follows her out to an all-night coffee shop to get her attention by spilling sugar. He introduces himself to her, and she responds that her name is Kay Smith. He feels intimidated by the girl for a moment, before she asks if he is really willing to word-paint her profile. She asks if they can meet at his place, and he agrees. A date is set up, and Quidley goes home. Although Kay is not in town for the next two days, he notices that there is now a third woman involved. The message is impossible to understand again, and he wonders if they are part of some secret society. When Kay comes, she is wearing a beautiful dress. Later, as Quidley is coming up with a new novel idea, he finds the fourth message again. As he thinks about her, Kay suddenly appears and tells him to put the book back. He is curious as to why she can’t just give Jilka a snoll doper, but Kay says it is because of regulations. Soon, she tells him that she is planning to take him back to Fieu Dayol because he had compromised her and because there are not enough men back on the planet. Kay also reveals that all of the messages were requisitions because she is the ship’s stock girl. The two arrive at the ship, and Quidley watches as Jilka and another man board the ship. Quidley tries to protest against boarding the ship himself, but Kay points a snoll doper at him. He notices that the object looks strikingly like a shotgun. "
              },
              {
                "worker_id": "113",
                "uid": "9e606d110c1246b595985833d6e8be68",
                "response_text": "Herbert Quidley is at a library. He opens Taine's History of English Literature and finds a sheet of paper with unintelligible text. He picks up another book. While reading it, he sees a beautiful young girl enter the library, take the sheet of paper from Taine's book, get another random book from the shelf, and leave. The next day, he notices another girl who slips a piece of paper between the book’s pages. When she leaves, he looks at the sheet of paper - it also has some unintelligible message. Later, the first girl - he calls her Kay - shows up and takes the message from the book. He follows her into a coffee bar. Quidley spills sugar on her lap, which helps him start a conversation with her. He tells her she can send him the cleaners’ bill and gives her his business card with his name, address, and profession - profiliste. He explains that he paints profiles with words. She introduces herself and asks if we can paint her profile. They decide to meet two days later at his place. Before meeting with her, he spends some time in the library and sees another girl who leaves the third coded message. He is confused and doesn’t understand why these girls are using this medium of communication. Quidley comes back home and waits for Kay. She arrives in a pretty white dress - he is mesmerized. They drink some bourbon and soon kiss. She tells him to postpone the dinner. The following evening Quidley goes to the library. He fantasizes about his future novel and finds a new message. Kay finds him reading the message. She look at the paper and then tells him to follow her. They get in her convertible, and Kay says that she has to deliver a snoll doper to Jilka, and then she will take Quidley to meet her folks. He admits to reading all their messages. She stops the car near a brick apartment building and leaves for several minutes. Quidley thinks of running away, but Kay comes back quickly. They drive to some ship which is supposed to take them to Fieu Dayol or Persei 17. She explains that she can and has to marry him now because he compromised her and because there are very few men on Fieu Dayol. She also tells him that those papers were requisitions, not messages - Kay is the ship’s stock girl. They pull up to a ship, parked somewhere among country fields. Jilka arrives with some man who slowly walks to the ship. When Quidley refuses to go with them, Kay tells him that the Interstellar law allows them to take only the ones who do not conform to the sexual mores of their society. She presses a snoll doper - a term he saw in the messages and later asked about - against his back. He realizes it’s something similar to a shotgun and starts marching up the plank. "
              }
            ]
          },
          {
            "question_text": "Who is Kay Smith, and what are her characteristics?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "112",
                "uid": "bd58d0130c204b74a0701d26b7f29dbe",
                "response_text": "She is tall with hyacinth long hair and blue eyes. Her skin is glowingly white. Her body shape is Grecian symmetric. She fascinates Herbert Quidley, a man who finds out the secret letter in Taine’s book, when she walks in the library. She is the receiver of secret messages in the book, and she goes to the library almost every day to pick up the letter in the book. She wears a pleated skirt when Herbert Quidley spills the sugar on her thighs. She speaks with a slight accent that she pronounces “interesting” with “anteresting.” She walks demurely. She wears a dress that exposes a lot of her skin when she goes to Quidley’s apartment, which indicates her intention to have sexual behaviors with him. She owns a convertible, and her purse hides a gun. She is the stock girl on the ship to Fieu Dayol, and her job is to deliver guns to her members, which is why she goes to the library to pick up the secret letters, the requisitions for the guns. It is revealed at the end that she comes to the Earth to bring men to her planet."
              },
              {
                "worker_id": "111",
                "uid": "70133ac675c64f84894cb94c22c6f47f",
                "response_text": "Kay Smith is a beautiful girl who is pursued by Herbert. Kay uses a bookmark and a book to communicate with her friends. At the end we learn that Kay comes from an alien planet, and that she uses the books to communicate with her crew of women who also came from her planet. We also learn that Kay is looking for a mate to take to her planet, as there aren’t enough men for each woman in her home planet. Kay ends up taking Herbert hostage into her ship in order to make him her mate."
              },
              {
                "worker_id": "107",
                "uid": "953c9e0cdfb8404bb7d8a5dd36c8e23c",
                "response_text": "\nKay Smith is a tall woman with hyacinth hair and liquid blue eyes. She also has the Grecian symmetry of shape that instantly caught Quidley’s attention. Kay is described as a mysterious person, going to the library to leave messages in the Taine book. Later, when she meets Quidley at the coffee shop, Kay is shown to be very polite. She is also straightforward as well, telling him that they will be meeting at his apartment even though Quidley does not usually make this exception. Although Kay is a pleasant person, she does become more assertive once she is found out. She forces Quidley to come with her, calling him the man who compromised her. When Quidley does not want to go back to Fieu Dayol with her, she threatens him with her snoll doper. "
              },
              {
                "worker_id": "113",
                "uid": "9e606d110c1246b595985833d6e8be68",
                "response_text": "Kay Smith is a young girl from Fieu Dayol. She came to Earth to get a male partner and is the ship’s stock girl. She is quite confident when she talks to Quidley. She is determined and charming - Kay manages to seduce Quidley very quickly and then orders him to reschedule the dinner. She is pragmatic and sly - we understand that after noticing how she can change the way she converses with Quidley and be both talkative and secretive, depending on her personal goal. Kay is good at planning and manages to almost lure Quidley into the ship by just concealing the information that can alienate him. She knows how to use a weapon. "
              }
            ]
          },
          {
            "question_text": "Who is Herbert Quidley, and what are his characteristics?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "112",
                "uid": "bd58d0130c204b74a0701d26b7f29dbe",
                "response_text": "Herbert Quidley is a profiliste who often stays in the library. He has a variety of pseudonyms for his career, each of which has its own card in his wallet. He owns a hardtop. He lives at 61 Park Place. He often wears Cuban heels. His favorite little magazine is The Zeitgeist. He likes everything old, such as old books, old wines, old woods, and old paintings. But most of all, he likes young girls, which is why he starts his observations on Kay’s behavior, a girl who exchanges letters through the book in the library. Quidley is a very thoughtful and careful person because whenever he reads the mysterious letters in the book, he always puts the letters back in the book and replaces the book on the shelf. He always sits at the reading table to observe the girls. He knows very well about romantic stuff and how to have sexual relationships with girls as he has his own skill called Operation Spill-the-sugar to start a conversation with a stranger woman. However, Quidley has little moral on sexual relationships because whether the targeted girl has a boyfriend would not deter his intention to conquer her."
              },
              {
                "worker_id": "111",
                "uid": "70133ac675c64f84894cb94c22c6f47f",
                "response_text": "Herbert Quidley is a Profiliste who loves books. He is very intelligent, and he uses his smarts to pick up women. Being a profiliste entails writing profiles with words. He loves to meet different women, but he never likes to commit to one woman. He likes to spend a lot of his time at a library, which is where he met Kay. He is also very curious, as he wanted to figure out what the messages in the bookmarks meant. At the end, Herbert gets kidnapped by Kay because of his disagreement with marriage, because Kay could only take a man who didn’t fit his planet’s sexual mores. "
              },
              {
                "worker_id": "107",
                "uid": "953c9e0cdfb8404bb7d8a5dd36c8e23c",
                "response_text": "Herbert Quidley is a man who enjoys old books and always reads at the library. He is described as someone who does not only like old items but also young girls. Although Quidley tends to keep to himself, he is courageous enough to snoop through Kay’s messages in the Taine book. He also becomes more and more interested in solving the mystery behind the messages, even though he cannot understand what any of them say. Quidley is strategic as well, using Operation-Spill-the-sugar as a means to talk to Kay. He also does his best to get to know her, in hopes of trying to figure out more about the mystery behind the messages. When Kay tells him to come with her, he is a little nervous and even says that she is kidnapping him. He does, however, feel a little scared once Kay threatens him."
              },
              {
                "worker_id": "113",
                "uid": "9e606d110c1246b595985833d6e8be68",
                "response_text": "Herbert Quidley is a profiliste who likes young women, old books, and old whiskey. He is a dreamer and can indulge in fantasizing about his future novel and the success it could bring. He is a romantic and loves conventionally beautiful things. He doesn’t enjoy commitment - we understand that when he thinks about marriage as the most terrifying thing ever and almost runs away from Kay when he thinks that she’s taking him to meet her parents. He loves mysteries, like the coded messages he finds in the library. As Kay says, he doesn’t conform to the sexual mores of society - he likes relationships with no obligations. He also considers it normal to follow a woman without talking to her first and peer at her messages. "
              }
            ]
          },
          {
            "question_text": "What role does the snoll doper play in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "112",
                "uid": "bd58d0130c204b74a0701d26b7f29dbe",
                "response_text": "Snoll doper appears in every letter that is hidden in History of English Literature by Hippolyte Adolphe Taine, a book favored by Hebert Quidley, from which he finds these letters and starts his observation. Quidley finds these words several times when he secretly reads the letters in the book whenever a girl comes to put a new letter in the book. He is fascinated by the first girl called Kay Smith who takes the first letter after he notices it. From then on, he has been guessing the meaning of snoll doper. At first, Quidley thinks that snoll doper means a person who has close relationships with Kay, like a boyfriend or a husband. He is annoyed by this possibility after having sexual behaviors with Kay, which causes him to secretly read the fourth letter before Kay comes to pick it up. When Kay finds out that Quidley has been reading her letter, she tells him to come with her to deliver the snoll doper to Jilka, where Quidley is relieved because he realizes that snoll doper is the name of an object, not an identity. On their way to Jilka’s place, Quidley keeps asking Kay what the meaning of snoll doper is, but Kay doesn’t tell him. At the end of the story, snoll doper turns out to be the name of a shotgun, which is what the letters are for, a requisition for the shotgun. Those letters are sent toward Kay because she is the ship’s stock girl who delivers the guns. In conclusion, snoll doper is a word that puzzles Quidley throughout the whole story and causes him to be caught by Kay, the purpose of those secret letters transmitted between Kay and other girls through the book, and an object that forces Quidley to go into the ship."
              },
              {
                "worker_id": "111",
                "uid": "70133ac675c64f84894cb94c22c6f47f",
                "response_text": "The snoll doper is an important part of the story because it was a part of all of the messages. When Herbert read all of the different messages scribbled in bookmarks, he saw that the names of the girls repeated in every message, as well as the words: snoll doper. He was very curious to understand what they meant, so he decided to meet Kay. After Kay tells Herbet who she is, Herbert asks her whan snoll dopers are. She responds by taking out a shotgun-like weapon and forcing him onto their ship. "
              },
              {
                "worker_id": "107",
                "uid": "953c9e0cdfb8404bb7d8a5dd36c8e23c",
                "response_text": "The snoll doper is mentioned in the very first message that Quidley reads. It is also this message that motivates him to investigate further into who Kay is and what exactly is a snoll doper. Most of the story revolves around him trying to crack the meaning behind snoll doper, and he wonders if he could just ask Kay directly about it when she comes to his apartment. The snoll dopper is also largely relevant in helping him figure out what the next The snoll doper is still relevant either, after he finds out Kay’s identity and has to go back to her planet with her. "
              },
              {
                "worker_id": "113",
                "uid": "9e606d110c1246b595985833d6e8be68",
                "response_text": "Snoll doper is one of the phrases that Quidley finds in the unintelligible messages from the library. It intrigues him because he doesn’t understand what it means. It makes him think about its potential meaning. Eventually, it leads to his mini-relationship with Kay. When he asks her about this term, she says she will share its meaning later. Thus, she brings him to the ship without any trouble and knows she can use her snoll doper in case Quidley refuses to go. When he does, she presses a snoll doper - a tool similar to a shotgun - against his back and orders him to enter the ship. "
              }
            ]
          },
          {
            "question_text": "What is the setting of the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "112",
                "uid": "bd58d0130c204b74a0701d26b7f29dbe",
                "response_text": "The first scene is in the library. Hippolyte Adolphe Taine’s History of English Literature is in the literature section. The books are categorized in alphabetical order. Taine’s book is in the T-section. The secret letters are always hidden in Taine’s book in the T section, where the girls from Fieu Dayol always stop and take the book. A librarian sits at the front desk to handle administrative stuff. There are reading tables. The second scene is in an all-night coffee bar where Herbert Quidley conducts his Spill-the-sugar operation to start the conversation with the girl next to him. There is a sugar dispenser on the counter. \n\nThe third scene is in Quidley’s apartment. There is a custom-built chrome-trimmed desk, a typewriter inserted with a blank sheet of paper, and the reference books stacked nearby. The magazine rack has Better Magazines, Harper’s, The Atlantic, and The Saturday Review. There is also a small table and a sideboard with a bottle of bourbon and two snifter glasses on top. The fourth scene is on the highway where Quidley is stuck in the car. The rutted road with trees points towards a ship. A ship with its lock open is hiding in the trees. It is dark."
              },
              {
                "worker_id": "111",
                "uid": "70133ac675c64f84894cb94c22c6f47f",
                "response_text": "The story is set in a city, but most of the action takes place in a library. While searching for a book in the library, Herbert comes across the weird messages that Kay and her crew used to communicate with each other. Some parts of the story also take place in a bar, which is where Kay and Herbert actually met. Herbert’s apartment is also an important location, as it was where Herbert and Kay became closer. Lastly, Kay’ ship is hidden within a forest, which is where the story ends. "
              },
              {
                "worker_id": "107",
                "uid": "953c9e0cdfb8404bb7d8a5dd36c8e23c",
                "response_text": "The story is set on planet Earth. It is set in a city, and the beginning of the story is inside of a library. There is a great number of books inside of the library, including old tomes. Whenever one of the women has to leave a message, they go to the ‘T’ section of English literature. The city also has an all-night coffee shop, where Quidley goes to bump into Kay in order to find out more about her. Quidley has an apartment himself, and Jillka is noted to live in a brick apartment building. It is later revealed that there is also a ship to take everybody back to Fieu Dayol, or Persei 17. It is noted that there is an unequal population-balance between the men and women there. \n"
              },
              {
                "worker_id": "113",
                "uid": "9e606d110c1246b595985833d6e8be68",
                "response_text": "The story starts at the library, where Quidley finds the undecipherable messages inside Taine's novel. The next day, he comes back there and then decides to follow Kay. He gets in his car and drives behind her until they both stop near an all-night coffee bar. They sit at the bar counter and talk. Two days later, Quidley goes to the library again and notices another girl. Later this evening, Kay arrives at his place. The room has a typewriter on his chrome-trimmed desk with crinkly sheets and reference books beside it, a bottle of bourbon and glasses on a sideboard, and a small table set for two. When Kay catches him reading their new message, she orders him to follow her. They get in her convertible and drive to a brick apartment building. She pulls over and enters the building. Minutes later, she walks back to the car, and they drive along a highway away from the city. She turns down a rutted road, and soon they reach a black blur of trees and a spherical ship that blends with its background. At the end, Quidley marches up the ship’s plank. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 3939,
        "document_length_chars": 22759
      }
    }
  ]
}