{
  "item_metadata": {
    "item_id": "61053",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61053",
      "content": "TOLLIVER'S ORBIT\n \n\n was slow—but it wasn't boring. And it would get you there—as long as you weren't going anywhere anyhow!\n \n \n By H. B. FYFE\n \n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, September 1961. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Johnny Tolliver scowled across the desk at his superior. His black thatch was ruffled, as if he had been rubbed the wrong way.\n \n \"I didn't ask you to cut out your own graft, did I?\" he demanded.\n\"Just don't try to sucker me in on the deal. I know you're operating something sneaky all through the colony, but it's not for me.\"\n \n The big moon-face of Jeffers, manager of the Ganymedan branch of Koslow Spaceways, glowered back at him. Its reddish tinge brightened the office noticeably, for such of Ganymede's surface as could be seen through the transparent dome outside the office window was cold, dim and rugged. The glowing semi-disk of Jupiter was more than half a million miles distant.\n \n \"Try not to be simple—for once!\" growled Jeffers. \"A little percentage here and there on the cargoes never shows by the time figures get back to Earth. The big jets in the home office don't care. They count it on the estimates.\"\n \n \"You asked any of them lately?\" Tolliver prodded.\n \n \"Now, listen ! Maybe they live soft back on Earth since the mines and the Jovian satellite colonies grew; but they were out here in the beginning, most of them. They know what it's like. D'ya think they don't expect us to make what we can on the side?\"\n \n Tolliver rammed his fists into the side pockets of his loose blue uniform jacket. He shook his head, grinning resignedly.\n \n \"You just don't listen to me ,\" he complained. \"You know I took this piloting job just to scrape up money for an advanced engineering degree back on Earth. I only want to finish my year—not get into something I can't quit.\"\n \n Jeffers fidgeted in his chair, causing it to creak under the bulk of his body. It had been built for Ganymede, but not for Jeffers.\n \n \"Aw, it's not like that,\" the manager muttered. \"You can ease out whenever your contract's up. Think we'd bend a good orbit on your account?\"\n \n Tolliver stared at him silently, but the other had difficulty meeting his eye.\n \n \"All right, then!\" Jeffers snapped after a long moment. \"If you want it that way, either you get in line with us or you're through right now!\"\n \n \"You can't fire me,\" retorted the pilot pityingly. \"I came out here on a contract. Five hundred credits a week base pay, five hundred for hazardous duty. How else can you get pilots out to Jupiter?\"\n \n \"Okay I can't fire you legally—as long as you report for work,\" grumbled Jeffers, by now a shade more ruddy. \"We'll see how long you keep reporting. Because you're off the Callisto run as of now! Sit in your quarters and see if the company calls that hazardous duty!\"\n \n \"Doesn't matter,\" answered Tolliver, grinning amiably. \"The hazardous part is just being on the same moon as you for the next six months.\"\n \n He winked and walked out, deliberately leaving the door open behind him so as to enjoy the incoherent bellowing that followed him.\n  Looks like a little vacation , he thought, unperturbed. He'll come around. I just want to get back to Earth with a clean rep. Let Jeffers and his gang steal the Great Red Spot off Jupiter if they like! It's their risk.\n \n \n \n\n \n Tolliver began to have his doubts the next day; which was \"Tuesday\" by the arbitrary calender constructed to match Ganymede's week-long journey around Jupiter.\n \n His contract guaranteed a pilot's rating, but someone had neglected to specify the type of craft to be piloted.\n \n On the bulletin board, Tolliver's name stood out beside the number of one of the airtight tractors used between the dome city and the spaceport, or for hauling cross-country to one of the mining domes.\n \n He soon found that there was nothing for him to do but hang around the garage in case a spaceship should land. The few runs to other domes seemed to be assigned to drivers with larger vehicles.\n \n The following day was just as boring, and the next more so. He swore when he found the assignment unchanged by \"Friday.\" Even the reflection that it was payday was small consolation.\n \n \"Hey, Johnny!\" said a voice at his shoulder. \"The word is that they're finally gonna trust you to take that creeper outside.\"\n \n Tolliver turned to see Red Higgins, a regular driver.\n \n \"What do you mean?\"\n \n \"They say some home-office relative is coming in on the Javelin .\"\n \n \"What's wrong with that?\" asked Tolliver. \"Outside of the way they keep handing out soft jobs to nephews, I mean.\"\n \n \"Aah, these young punks just come out for a few months so they can go back to Earth making noises like spacemen. Sometimes there's no reason but them for sending a ship back with a crew instead of in an economy orbit. Wait till you see the baggage you'll have to load!\"\n \n Later in the day-period, Tolliver recalled this warning. Under a portable, double-chambered plastic dome blown up outside the ship's airlock, a crewman helped him load two trunks and a collection of bags into the tractor. He was struggling to suppress a feeling of outrage at the waste of fuel involved when the home-office relative emerged.\n \n She was about five feet four and moved as if she walked lightly even in stronger gravity than Ganymede's. Her trim coiffure was a shade too blonde which served to set off both the blue of her eyes and the cap apparently won from one of the pilots. She wore gray slacks and a heavy sweater, like a spacer.\n \n \"Sorry to keep you waiting,\" she said, sliding into the seat beside Tolliver. \"By the way, just call me Betty.\"\n \n \"Sure,\" agreed Tolliver thinking, Ohmigod! Trying already to be just one of the gang, instead of Lady Betty! Is her old man the treasurer, or does he just know where bodies are buried?\n \n \n \"They were making dates,\" said the girl. \"Were they ribbing me, or is it true that none of the four of them goes back with the ship?\"\n \n \"It's true enough,\" Tolliver assured her. \"We need people out here, and it costs a lot to make the trip. They found they could send back loaded ships by 'automatic' flight—that is, a long, slow, economical orbit and automatic signalling equipment. Then they're boarded approaching Earth's orbit and landed by pilots who don't have to waste their time making the entire trip.\"\n \n \n\n \n He followed the signals of a spacesuited member of the port staff and maneuvered out of the dome. Then he headed the tractor across the frozen surface of Ganymede toward the permanent domes of the city.\n \n \"How is it here?\" asked the girl. \"They told me it's pretty rough.\"\n \n \"What did you expect?\" asked Tolliver. \"Square dances with champagne?\"\n \n \"Don't be silly. Daddy says I'm supposed to learn traffic routing and the business management of a local branch. They probably won't let me see much else.\"\n \n \"You never can tell,\" said the pilot, yielding to temptation. \"Any square inch of Ganymede is likely to be dangerous.\"\n  I'll be sorry later , he reflected, but if Jeffers keeps me jockeying this creeper, I'm entitled to some amusement. And Daddy's little girl is trying too hard to sound like one of the gang.\n \n \n \"Yeah,\" he went on, \"right now, I don't do a thing but drive missions from the city to the spaceport.\"\n \n \"Missions! You call driving a mile or so a mission ?\"\n \n Tolliver pursed his lips and put on a shrewd expression.\n \n \"Don't sneer at Ganymede, honey!\" he warned portentously. \"Many a man who did isn't here today. Take the fellow who used to drive this mission!\"\n \n \"You can call me Betty. What happened to him?\"\n \n \"I'll tell you some day,\" Tolliver promised darkly. \"This moon can strike like a vicious animal.\"\n \n \"Oh, they told me there was nothing alive on Ganymede!\"\n \n \"I was thinking of the mountain slides,\" said the pilot. \"Not to mention volcanic puffballs that pop out through the frozen crust where you'd least expect. That's why I draw such high pay for driving an unarmored tractor.\"\n \n \"You use armored vehicles?\" gasped the girl.\n \n She was now sitting bolt upright in the swaying seat. Tolliver deliberately dipped one track into an icy hollow. In the light gravity, the tractor responded with a weird, floating lurch.\n \n \"Those slides,\" he continued. \"Ganymede's only about the size of Mercury, something like 3200 miles in diameter, so things get heaped up at steep angles. When the rock and ice are set to sliding, they come at you practically horizontally. It doesn't need much start, and it barrels on for a long way before there's enough friction to stop it. If you're in the way—well, it's just too bad!\"\n  Say, that's pretty good! he told himself. What a liar you are, Tolliver!\n \n \n He enlarged upon other dangers to be encountered on the satellite, taking care to impress the newcomer with the daredeviltry of John Tolliver, driver of \"missions\" across the menacing wastes between dome and port.\n \n In the end, he displayed conclusive evidence in the form of the weekly paycheck he had received that morning. It did not, naturally, indicate he was drawing the salary of a space pilot. Betty looked thoughtful.\n \n \"I'm retiring in six months if I'm still alive,\" he said bravely, edging the tractor into the airlock at their destination. \"Made my pile. No use pushing your luck too far.\"\n \n His charge seemed noticeably subdued, but cleared her throat to request that Tolliver guide her to the office of the manager. She trailed along as if with a burden of worry upon her mind, and the pilot's conscience prickled.\n  I'll get hold of her after Jeffers is through and set her straight , he resolved. It isn't really funny if the sucker is too ignorant to know better.\n \n \n \n\n \n Remembering his grudge against the manager, he took pleasure in walking in without knocking.\n \n \"Jeffers,\" he announced, \"this is ... just call her Betty.\"\n \n The manager's jowled features twisted into an expression of welcome as jovial as that of a hungry crocodile.\n \n \"Miss Koslow!\" he beamed, like a politician the day before the voting.\n\"It certainly is an honor to have you on Ganymede with us! That's all, Tolliver, you can go. Yes, indeed! Mr. Koslow—the president, that is: your father—sent a message about you. I repeat, it will be an honor to show you the ropes. Did you want something else, Tolliver?\"\n \n \"Never mind him, Mr. Jeffers,\" snapped the girl, in a tone new to Tolliver. \"We won't be working together, I'm afraid. You've already had enough rope.\"\n \n Jeffers seemed to stagger standing still behind his desk. His loose lips twitched uncertainly, and he looked questioningly to Tolliver. The pilot stared at Betty, trying to recall pictures he had seen of the elder Koslow. He was also trying to remember some of the lies he had told en route from the spaceport.\n \n \"Wh-wh-what do you mean, Miss Koslow?\" Jeffers stammered.\n \n He darted a suspicious glare at Tolliver.\n \n \"Mr. Jeffers,\" said the girl, \"I may look like just another spoiled little blonde, but the best part of this company will be mine someday. I was not allowed to reach twenty-two without learning something about holding on to it.\"\n \n Tolliver blinked. He had taken her for three or four years older. Jeffers now ignored him, intent upon the girl.\n \n \"Daddy gave me the title of tenth vice-president mostly as a joke, when he told me to find out what was wrong with operations on Ganymede. I have some authority, though. And you look like the source of the trouble to me.\"\n \n \"You can't prove anything,\" declared Jeffers hoarsely.\n \n \"Oh, can't I? I've already seen certain evidence, and the rest won't be hard to find. Where are your books, Mr. Jeffers? You're as good as fired!\"\n \n The manager dropped heavily to his chair. He stared unbelievingly at Betty, and Tolliver thought he muttered something about \"just landed.\" After a moment, the big man came out of his daze enough to stab an intercom button with his finger. He growled at someone on the other end to come in without a countdown.\n \n Tolliver, hardly thinking about it, expected the someone to be a secretary, but it turned out to be three members of Jeffers' headquarters staff. He recognized one as Rawlins, a warehouse chief, and guessed that the other two might be his assistants. They were large enough.\n \n \"No stupid questions!\" Jeffers ordered. \"Lock these two up while I think!\"\n \n Tolliver started for the door immediately, but was blocked off.\n \n \"Where should we lock—?\" the fellow paused to ask.\n \n Tolliver brought up a snappy uppercut to the man's chin, feeling that it was a poor time to engage Jeffers in fruitless debate.\n \n In the gravity of Ganymede, the man was knocked off balance as much as he was hurt, and sprawled on the floor.\n \n \"I told you no questions!\" bawled Jeffers.\n \n The fallen hero, upon arising, had to content himself with grabbing Betty. The others were swarming over Tolliver. Jeffers came around his desk to assist.\n \n \n\n \n Tolliver found himself dumped on the floor of an empty office in the adjoining warehouse building. It seemed to him that a long time had been spent in carrying him there.\n \n He heard an indignant yelp, and realized that the girl had been pitched in with him. The snapping of a lock was followed by the tramp of departing footsteps and then by silence.\n \n After considering the idea a few minutes, Tolliver managed to sit up.\n \n He had his wind back. But when he fingered the swelling lump behind his left ear, a sensation befuddled him momentarily.\n \n \"I'm sorry about that,\" murmured Betty.\n \n Tolliver grunted. Sorrow would not reduce the throbbing, nor was he in a mood to undertake an explanation of why Jeffers did not like him anyway.\n \n \"I think perhaps you're going to have a shiner,\" remarked the girl.\n \n \"Thanks for letting me know in time,\" said Tolliver.\n \n The skin under his right eye did feel a trifle tight, but he could see well enough. The abandoned and empty look of the office worried him.\n \n \"What can we use to get out of here?\" he mused.\n \n \"Why should we try?\" asked the girl. \"What can he do?\"\n \n \"You'd be surprised. How did you catch on to him so soon?\"\n \n \"Your paycheck,\" said Betty. \"As soon as I saw that ridiculous amount, it was obvious that there was gross mismanagement here. It had to be Jeffers.\"\n \n Tolliver groaned.\n \n \"Then, on the way over here, he as good as admitted everything. You didn't hear him, I guess. Well, he seemed to be caught all unaware, and seemed to blame you for it.\"\n \n \"Sure!\" grumbled the pilot. \"He thinks I told you he was grafting or smuggling, or whatever he has going for him here. That's why I want to get out of here—before I find myself involved in some kind of fatal accident!\"\n \n \"What do you know about the crooked goings-on here?\" asked Betty after a startled pause.\n \n \"Nothing,\" retorted Tolliver. \"Except that there are some. There are rumors, and I had a halfway invitation to join in. I think he sells things to the mining colonies and makes a double profit for himself by claiming the stuff lost in transit. You didn't think you scared him that bad over a little slack managing?\"\n \n The picture of Jeffers huddled with his partners in the headquarters building, plotting the next move, brought Tolliver to his feet.\n \n There was nothing in the unused office but an old table and half a dozen plastic crates. He saw that the latter contained a mess of discarded records.\n \n \"Better than nothing at all,\" he muttered.\n \n He ripped out a double handful of the forms, crumpled them into a pile at the doorway, and pulled out his cigarette lighter.\n \n \"What do you think you're up to?\" asked Betty with some concern.\n \n \"This plastic is tough,\" said Tolliver, \"but it will bend with enough heat. If I can kick loose a hinge, maybe we can fool them yet!\"\n \n He got a little fire going, and fed it judiciously with more papers.\n \n \"You know,\" he reflected, \"it might be better for you to stay here. He can't do much about you, and you don't have any real proof just by yourself.\"\n \n \"I'll come along with you, Tolliver,\" said the girl.\n \n \"No, I don't think you'd better.\"\n \n \"Why not?\"\n \n \"Well ... after all, what would he dare do? Arranging an accident to the daughter of the boss isn't something that he can pull off without a lot of investigation. He'd be better off just running for it.\"\n \n \"Let's not argue about it,\" said Betty, a trifle pale but looking determined. \"I'm coming with you. Is that stuff getting soft yet?\"\n \n Tolliver kicked at the edge of the door experimentally. It seemed to give slightly, so he knocked the burning papers aside and drove his heel hard at the corner below the hinge.\n \n The plastic yielded.\n \n \"That's enough already, Tolliver,\" whispered the girl. \"We can crawl through!\"\n \n \n\n \n Hardly sixty seconds later, he led her into a maze of stacked crates in the warehouse proper. The building was not much longer than wide, for each of the structures in the colony had its own hemispherical emergency dome of transparent plastic. They soon reached the other end.\n \n \"I think there's a storeroom for spacesuits around here,\" muttered Tolliver.\n \n \"Why do you want them?\"\n \n \"Honey, I just don't think it will be so easy to lay hands on a tractor. I bet Jeffers already phoned the garage and all the airlocks with some good lie that will keep me from getting through.\"\n \n After a brief search, he located the spacesuits. Many, evidently intended for replacements, had never been unpacked, but there were a dozen or so serviced and standing ready for emergencies. He showed Betty how to climb into one, and checked her seals and valves after donning a suit himself.\n \n \"That switch under your chin,\" he said, touching helmets so she could hear him. \"Leave it turned off. Anybody might be listening!\"\n \n He led the way out a rear door of the warehouse. With the heavy knife that was standard suit equipment, he deliberately slashed a four-foot square section out of the dome. He motioned to Betty to step through, then trailed along with the plastic under his arm.\n \n He caught up and touched helmets again.\n \n \"Just act as if you're on business,\" he told her. \"For all anyone can see, we might be inspecting the dome.\"\n \n \"Where are you going?\" asked Betty.\n \n \"Right through the wall, and then head for the nearest mine. Jeffers can't be running everything !\"\n \n \"Is there any way to get to a TV?\" asked the girl. \"I ... uh ... Daddy gave me a good number to call if I needed help.\"\n \n \"How good?\"\n \n \"Pretty official, as a matter of fact.\"\n \n \"All right,\" Tolliver decided. \"We'll try the ship you just came in on. They might have finished refueling and left her empty.\"\n \n They had to cross one open lane between buildings, and Tolliver was very conscious of moving figures in the distance; but no one seemed to look their way.\n \n Reaching the foot of the main dome over the establishment, he glanced furtively about, then plunged his knife into the transparent material.\n \n From the corner of his eye, he thought he saw Betty make a startled gesture, but he had his work cut out for him. This was tougher than the interior dome.\n \n Finally, he managed to saw a ragged slit through which they could squeeze. There was room to walk between the inner and outer layer, so he moved along a few yards. A little dust began to blow about where they had gone through. He touched helmets once more.\n \n \"This time,\" he said, \"the air will really start to blow, so get through as fast as you can. If I can slap this piece of plastic over the rip, it may stow down the loss of pressure enough to give us quite a lead before the alarms go off.\"\n \n Through the faceplates, he saw the girl nod, wide-eyed.\n \n As soon as he plunged the knife into the outer layer, he could see dusty, moist air puffing out into the near-vacuum of Ganymede's surface. Fumbling, he cut as fast as he could and shoved Betty through the small opening.\n \n Squeezing through in his turn, he left one arm inside to spread the plastic sheet as best he could. The internal air pressure slapped it against the inside of the dome as if glued, although it immediately showed an alarming tendency to balloon through the ruptured spot.\n  They'll find it, all right , Tolliver reminded himself. Don't be here when they do!\n \n \n He grabbed Betty by the wrist of her spacesuit and headed for the nearest outcropping of rock.\n \n It promptly developed that she had something to learn about running on ice in such low gravity. Until they were out of direct line of sight from the settlement, Tolliver simply dragged her.\n \n Then, when he decided that it was safe enough to pause and tell her how to manage better, the sight of her outraged scowl through the face-plate made him think better of it.\n  By the time we reach the ship, she'll have learned , he consoled himself.\n \n \n\n \n It was a long mile, even at the pace human muscles could achieve on Ganymede. They took one short rest, during which Tolliver was forced to explain away the dangers of slides and volcanic puffballs. He admitted to having exaggerated slightly. In the end, they reached the spaceship.\n \n There seemed to be no one about. The landing dome had been collapsed and stored, and the ship's airlock port was closed.\n \n \"That's all right,\" Tolliver told the girl. \"We can get in with no trouble.\"\n \n It was when he looked about to make sure that they were unobserved that he caught a glimpse of motion back toward the city. He peered at the spot through the dim light. After a moment, he definitely recognized the outline of a tractor breasting a rise in the ground and tilting downward again.\n \n \"In fact, we have to get in to stay out of trouble,\" he said to Betty.\n \n He located the switch-cover in the hull, opened it and activated the mechanism that swung open the airlock and extended the ladder.\n \n It took him considerable scrambling to boost the girl up the ladder and inside, but he managed. They passed through the airlock, fretting at the time required to seal, pump air and open the inner hatch; and then Tolliver led the way up another ladder to the control room. It was a clumsy trip in their spacesuits, but he wanted to save time.\n \n \n\n \n In the control room, he shoved the girl into an acceleration seat, glanced at the gauges and showed her how to open her helmet.\n \n \"Leave the suit on,\" he ordered, getting in the first word while she was still shaking her head. \"It will help a little on the takeoff.\"\n \n \"Takeoff!\" shrilled Betty. \"What do you think you're going to do? I just want to use the radio or TV!\"\n \n \"That tractor will get here in a minute or two. They might cut your conversation kind of short. Now shut up and let me look over these dials!\"\n \n He ran a practiced eye over the board, reading the condition of the ship. It pleased him. Everything was ready for a takeoff into an economy orbit for Earth. He busied himself making a few adjustments, doing his best to ignore the protests from his partner in crime. He warned her the trip might be long.\n \n \"I told you not to come,\" he said at last. \"Now sit back!\"\n \n He sat down and pushed a button to start the igniting process.\n \n In a moment, he could feel the rumble of the rockets through the deck, and then it was out of his hands for several minutes.\n \n \"That wasn't so bad,\" Betty admitted some time later. \"Did you go in the right direction?\"\n \n \"Who knows?\" retorted Tolliver. \"There wasn't time to check everything . We'll worry about that after we make your call.\"\n \n \"Oh!\" Betty looked helpless. \"It's in my pocket.\"\n \n Tolliver sighed. In their weightless state, it was no easy task to pry her out of the spacesuit. He thought of inquiring if she needed any further help, but reminded himself that this was the boss's daughter. When Betty produced a memo giving frequency and call sign, he set about making contact.\n \n It took only a few minutes, as if the channel had been monitored expectantly, and the man who flickered into life on the screen wore a uniform.\n \n \"Space Patrol?\" whispered Tolliver incredulously.\n \n \"That's right,\" said Betty. \"Uh ... Daddy made arrangements for me.\"\n \n Tolliver held her in front of the screen so she would not float out of range of the scanner and microphone. As she spoke, he stared exasperatedly at a bulkhead, marveling at the influence of a man who could arrange for a cruiser to escort his daughter to Ganymede and wondering what was behind it all.\n \n When he heard Betty requesting assistance in arresting Jeffers and reporting the manager as the head of a ring of crooks, he began to suspect. He also noticed certain peculiarities about the remarks of the Patrolman.\n \n \n\n \n For one thing, though the officer seemed well acquainted with Betty, he never addressed her by the name of Koslow. For another, he accepted the request as if he had been hanging in orbit merely until learning who to go down after.\n  They really sent her out to nail someone , Tolliver realized. Of course, she stumbled onto Jeffers by plain dumb luck. But she had an idea of what to look for. How do I get into these things? She might have got me killed!\n \n \n \"We do have one trouble,\" he heard Betty saying. \"This tractor driver, Tolliver, saved my neck by making the ship take off somehow, but he says it's set for a six-month orbit, or economy flight. Whatever they call it. I don't think he has any idea where we're headed.\"\n \n Tolliver pulled her back, holding her in mid-air by the slack of her sweater.\n \n \"Actually, I have a fine idea,\" he informed the officer coldly. \"I happen to be a qualified space pilot. Everything here is under control. If Miss Koslow thinks you should arrest Jeffers, you can call us later on this channel.\"\n \n \"Miss Koslow?\" repeated the spacer. \"Did she tell you—well, no matter! If you'll be okay, we'll attend to the other affair immediately.\"\n \n He signed off promptly. The pilot faced Betty, who looked more offended than reassured at discovering his status.\n \n \"This 'Miss Koslow' business,\" he said suspiciously. \"He sounded funny about that.\"\n \n The girl grinned.\n \n \"Relax, Tolliver,\" she told him. \"Did you really believe Daddy would send his own little girl way out here to Ganymede to look for whoever was gypping him?\"\n \n \"You ... you...?\"\n \n \"Sure. The name's Betty Hanlon. I work for a private investigating firm. If old Koslow had a son to impersonate—\"\n \n \"I'd be stuck for six months in this orbit with some brash young man,\" Tolliver finished for her. \"I guess it's better this way,\" he said meditatively a moment later.\n \n \"Oh, come on ! Can't they get us back? How can you tell where we're going?\"\n \n \"I know enough to check takeoff time. It was practically due anyhow, so we'll float into the vicinity of Earth at about the right time to be picked up.\"\n \n He went on to explain something of the tremendous cost in fuel necessary to make more than minor corrections to their course. Even though the Patrol ship could easily catch the slow freighter, bringing along enough fuel to head back would be something else again.\n \n \"We'll just have to ride it out,\" he said sympathetically. \"The ship is provisioned according to law, and you were probably going back anyhow.\"\n \n \"I didn't expect to so soon.\"\n \n \"Yeah, you were pretty lucky. They'll think you're a marvel to crack the case in about three hours on Ganymede.\"\n \n \"Great!\" muttered Betty. \"What a lucky girl I am!\"\n \n \"Yes,\" admitted Tolliver, \"there are problems. If you like, we might get the captain of that Patrol ship to legalize the situation by TV.\"\n \n \"I can see you're used to sweeping girls off their feet,\" she commented sourly.\n \n \"The main problem is whether you can cook.\"\n \n Betty frowned at him.\n \n \"I'm pretty good with a pistol,\" she offered, \"or going over crooked books. But cook? Sorry.\"\n \n \"Well, one of us had better learn, and I'll have other things to do.\"\n \n \"I'll think about it,\" promised the girl, staring thoughtfully at the deck.\n \n Tolliver anchored himself in a seat and grinned as he thought about it too.\n  After a while , he promised himself, I'll explain how I cut the fuel flow and see if she's detective enough to suspect that we're just orbiting Ganymede!",
      "metadata": {
        "title": "Tolliver's Orbit",
        "author": "H. B. Fyfe",
        "passage_id": "61053",
        "uid": "8e5272316c5a41deaf2086911d240fdd",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8c343deb053741e1aa02ad9c0ef26824",
                "response_text": "The story begins as Johnny Tolliver argues with Jeffers, the manager of Ganymedan branch of Koslow Spaceways, about how he doesn’t want to be involved with whatever he is doing. This makes Jeffers angry, knowing that he cannot fire Tolliver, he decides to make Tolliver’s job extremely boring. Thus, for the next few days, he simply hang around the garage, with nothing to do. Then on Friday, he gets assigned to take the creeper outside. He picks Betty up, where he told her about the dangers of Ganymede such as the volcanic puffballs and the mountain slides, he explains his high pay for driving unarmored tractor by mentioning that if he survives the six month, he will retire. However, Tolliver understand that this is completely a lie. After they go to see Jeffers, Betty states that she will not work with them, and them fires Jeffers. Jeffers order his men to lock Betty and Tolliver up. After Tolliver wakes up, they decided to escape. Betty told Tolliver about how she was able to figure out that there’s something wrong – his extremely high paycheck. After crawling through the hole by bending plastic, they finds spacesuits in the storeroom. Finally, they are able to escape by taking off on an economy orbit for Earth. After contacting with Space Patrol, Tolliver finds it odd when he says “Miss Koslow.” Questioning Betty, she admits that she works for a private investigating firm. Then, in the end, Tolliver is going to cut the fuel flow to see if Betty will suspect anything, since they are just orbiting Ganymede. "
              },
              {
                "worker_id": "104",
                "uid": "a8647ca10ec442cba5bda82634b374bd",
                "response_text": "Johnny Tolliver meets with his superior, Jeffers. Jeffers is the manager of the Ganymedan branch of Koslow Spaceways. Tolliver is very unhappy with Jeffers and is roughly expressing his frustration to him. Their conversation does not end well and Jeffers is clear that he will retaliate against Tolliver’s demands. Tolliver leaves the room grunting about how Jeffers and his men can steal the Great Red Spot off of Jupiter at their own risk. \n\nOver the next few days, Tolliver grows frustrated that he is not being assigned anything. One day, he does get an assignment. He is meant to pick up a home office relative coming in from the Javelin. Tolliver picks up a woman named Betty and transports her. Very early on he appears not to like her and decides to scare her and make it seem that there is danger at every corner. They arrive at their destination and Tolliver leads Betty to Jeffers office. Tolliver barges into Jeffers office, with Betty in tow, to purposefully upset Jeffers. Jeffers is angered at Tolliver’s arrival, but excitedly greets Betty. However, his warm greeting is not returned by Betty. Betty quickly accuses him of wrongdoings and wants him to leave his position. At first he is too stunned to speak. He quickly recovers and orders some men to lock both Tolliver and Betty in a room. Tolliver tries to fight against one of the guards meant to imprison him. His success does not last long and he finds himself in an empty office next to the warehouse building. Tolliver quickly begins to plot their escape. Betty decides to join him in escaping the room. \n\nThey are able to leave the room and go through the warehouse where they find spacesuits to wear. Making their way outside of the warehouse, Tolliver uses the knife that came with the spacesuit to slash a section out of the dome. They step through the section and walk normally to not attract attention to themselves. Tolliver suggests they go find her ship to make a call to the emergency number that Betty was given. In their process, they escape the dome and into the almost vacuum air of Ganymede’s surface and run to Betty’s ship. As they get closer to Betty’s ship, Tolliver notices a tractor headed towards them. They hurry onto the ship. Tolliver quickly readies the ship for takeoff to Betty’s surprise. Betty grabs a memo from her pocket inside the spacesuit to give Tolliver the number to call. Once the call is connected, Betty requests assistance to arrest Jeffers and co-conspirators. Tolliver becomes suspicious during her call with Space Patrol and she eventually tells him that she is not actually Koslow’s daughter. Eventually, the ship takes off. \n\nTolliver tells Betty that he is taking them back to Earth but the journey will take 6 months. However, thinking to himself, Tolliver wonders when Betty will catch on that they will just be orbiting Ganymede and not the path she thinks. \n"
              },
              {
                "worker_id": "105",
                "uid": "d1e82aee0b964768aee54ef0f0e092a8",
                "response_text": "Johnny Tolliver is a space pilot from Earth to Jupiter and all the way round who works to get enough money for an engineering degree. His superior, Jeffers, tries to get him involved in the sneaky deals of stealing some cargo meant to be transported to Earth. Tolliver refuses as he wants to return clean and as fast as possible to Earth. Jeffers can't fire him and Tolliver feels safe. For the next few days Johnny has nothing to do as he is made to drive a tractor and doesn't have any assignments. Then he gets word he will be assigned to drive a tractor with some home-office relative, who has a lot of bags as a cargo, which is a simple waste of fuel. The relative is a young girl named Betty who tries to behave like a spacer, like all those relatives do, though they only spend a couple months in space doing nothing. Betty wants to learn traffic routing and she doesn't see Johnny's drive from the city to the spaceport on Ganymede as a mission. That scorn makes the man mad and he tells that the trips are dangerous and many men had died on those drives. Tolliver makes up those lies to scare the girl and diminish her arrogance and scorn, and to impress her in some way, he also shows his significant payment. Then, Tolliver leads subdued Betty to Jeffers, who treats her with utmost respect and sweetness remembering who her father is. The girl though takes a threatening tone claiming she will be in charge of her father's company one day and that she has learned what's going wrong on Ganymede, so Jeffers is as good as fired. Jeffers then calls three men in to lock Betty and Tolliver up. Jeffers believes Tolliver has told everything to Betty and she learns from Johnny that he was asked to join the smuggling gang. Tolliver manages to heat and open the door, Betty follows and they approach a storeroom for spacesuits. The two put them on and pretend to be inspecting domes, they get into a low gravity field to reach the ship she arrived in. Tolliver confesses in exaggerating the dangers on the way, then they get into the ship and to the control room, and Johnny plans to take off while Betty was simply going to use her connection on radio or TV. Tolliver and Betty take off and the phone number she has turns out to be Space Patrol. Johnny realizes throughout the dialogue that the person on the other end was waiting for the girl's report to know who to arrest. Betty turns out to be Koslow's daughter but a private investigator. The ship Tolliver and Betty are on is orbiting Ganymede, but the former convinces the girl they are on a long way to Earth. "
              },
              {
                "worker_id": "101",
                "uid": "e820fffa8ece488593ffede2784c4256",
                "response_text": "Johnny Tolliver is a space pilot, working for the Ganymedan branch at Koslow Spaceways. He sits in the office of his supervisor, Jeffers, who has invited him to take part in a scheme where he steals parts of ships' cargoes in order to make profit. Tolliver is skeptical and uncomfortable with this operation, and he refuses. Though Jeffers cannot fire him, because he is on contract, he takes Tolliver off his assigned orbit. The next day, Tolliver finds that instead of being assigned a ship, he has the mundane job of driving a tractor from domes to the spaceport. The job drags on for the next three days when Tolliver is informed that he has the job of escorting a home-office relative to the city. The relative is a young girl named Betty, whom Tolliver immediately perceives as naive and arrogant. To entertain himself on the drive, Tolliver makes up stories about the dangers of Ganymede and his job as a daredevil tractor driver, showing Betty his paycheck. They arrive into the city, and Tolliver leads Betty to Jeffers' office at her request. Jeffers greets Betty, addressing her as Miss Koslow, indicating that she is the daughter of the boss of Koslow Spaceways, to which Tolliver is surprised and secretly regrets the embellished stories he told her. Betty immediately orders Jeffers to be fired out of suspicions of mismanagement. Jeffers, sure that Betty had found out about his side scheme, locks up Tolliver and Betty in an empty office room. Tolliver manages to escape by using fire to bend the plastic door, and Betty insists on joining him. The two find spare spacesuits and get into disguise while they make their way to a spaceship. Tolliver cuts a slit into the dome over the establishment and they squeeze through, running to the spaceport. As they reach the ship, Tolliver notices a tractor headed their way, and he rushes Betty inside. Tolliver quickly launches the ship into orbit despite Betty's protests. Betty then phones Space Patrol, given access by her father, and informs the officer to arrest Jeffers and that the ship they are on has been sent on a six-month orbit. When Betty signs off, it is revealed to Tolliver that she is not actually Koslow's daughter, but a private investigator impersonating her in order to get information on who was stealing from the company. Tolliver informs Betty that they will be on the ship for a while, not telling her that they would be orbiting Ganymede the entire time."
              }
            ]
          },
          {
            "question_text": "What happens to Betty throughout the story",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8c343deb053741e1aa02ad9c0ef26824",
                "response_text": "Betty first disguises as the president’s daughter. She is five feet four, and her hair was a shade too blonde; she has blue eyes and is wearing gray slacks with a heavy sweater. She comes to Ganymedan to learn about traffic routing as well as business management of local branches. Betty is shocked by the exaggerated description that Tolliver gives on the tractor about how dangerous Ganymedan is. Once she arrives in the office, she fires Jeffers stating that she knows that he has been doing. Making Jeffers very angry, he locks her along with Tolliver into the empty office. There, Betty follows Tolliver to escape to the control room. Once she is told that they will take off, she refuses. But, in order to escape, Tolliver takes off the ship into an economy orbit for Earth anyway. Betty finally makes the microphone call to Space Patrol, telling them to capture Jeffers. From the way that the other side of the phone reacted to Tolliver calling Betty Miss Koslow, Tolliver realizes that something’s off. Then Betty tells him that she actually works for a private investigating firm, and her name is Betty Hanlon. Betty "
              },
              {
                "worker_id": "104",
                "uid": "a8647ca10ec442cba5bda82634b374bd",
                "response_text": "Betty arrives to the dome area and is picked up by Tolliver. During the tractor ride back to the dome from her ship, Tolliver attempts to scare her and makes the area sound incredibly dangerous. During their ride, Betty tells Tolliver why she has been sent to this branch. Betty states that her dad wants her to learn the traffic routing and the business management within a local branch of Koslow Spaceways. When they arrive at the air lock, scared from Tolliver’s stories, she asks Tolliver to guide her to manager’s office. Once she reaches Jeffers office, she immediately accuses him of being crooked and wants him gone from his position. One of her first hints came from when she saw Tolliver’s paycheck and its value. She explains to Jeffers that she may look innocent but she is smart and details how she has evidence that he is doing his job improperly. \n\nJeffers responds and orders both Tolliver and Betty to be locked up. They end up in an empty office near a warehouse building. When Tolliver begins to plan his escape from the room, Betty insists on joining Tolliver much to his dismay. They exit on Ganymede’s surface where Betty proves to have trouble running on the ice in a low gravity environment. After successfully grabbing spacesuits to wear and escaping the warehouse, Betty tells Tolliver that she can get significant help from an emergency number she was given by her father. She just needs to find a TV to make the call. They exit the dome and run across the ice to make it towards Betty’s ship. On the ship, Tolliver learns that the woman’s name is actually Betty Hanlon and not the daughter of Koslow. \n\nEventually, Tolliver guides the ship through take off and explains to Betty that they will be on a long orbit path of 6 months. Betty is upset about the return to Earth and the length of the journey. She admits to Tolliver that she is better handling a pistol than being able to cook. \n"
              },
              {
                "worker_id": "105",
                "uid": "d1e82aee0b964768aee54ef0f0e092a8",
                "response_text": "Betty meets Tolliver on Ganymede in the beginning of the story. He drives her from the city to the spaceport in a tractor. Betty behaves like a typical daughter of a home-office: she tries to speak and behave like a spacer, wears a spacesuit and wants to understand how everything around works to be useful. She scorns Tolliver's job and doesn't consider it serious until he scares her with exaggerated stories and shows his significant paycheck. Then he takes the girl to Jeffers, who treats her with utmost sweetness. There Betty directly accuses Jeffers of his manipulations and says he'll be fired. For this statement she gets locked up together with Tolliver, who manages to escape, and Betty follows him. The two put on the spacesuits and get into a spaceship which takes off due ton Tolliver. From there the girl calls Space Patrol and asks them to help arrest Jeffers, it turns out she is an investigator, not a daughter of the high-standing man. The story ends with her being on the ship with Tolliver for unknown amount of time. "
              },
              {
                "worker_id": "101",
                "uid": "e820fffa8ece488593ffede2784c4256",
                "response_text": "Betty arrives at Ganymede, where she is escorted by Johnny Tolliver into the city. On the way there, Tolliver tells her stories of his job as a driver and of the dangerous nature of Ganymede, and shows her his paycheck, making Betty suspicious of mismanagement. Betty requests to meet Jeffers, and she threatens to fire him upon her suspicions. She is then taken and locked up by Jeffers into an empty office, and Tolliver is able to escape. Betty decides to join Tolliver, and the two run to the spaceship. On the ship, Betty calls Space Patrol and orders Jeffers to be arrested. Betty, now stuck in orbit with Tolliver, informs him that she is not actually the daughter of Koslow, but a private investigator."
              }
            ]
          },
          {
            "question_text": "What happens to Jeffers throughout the story",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8c343deb053741e1aa02ad9c0ef26824",
                "response_text": "Jeffers is the manager of the Ganymedan branch of Koslow Spaceways. He is operating something sneaky all through the colony. When he tries to make Tolliver join him, he refuses. But Jeffers cannot legally fire him, thus he decides to make him do some very boring works as a driver of airtight tractor, which is used between the dome city and the spaceport. Then after learning that Betty knows about what he is doing and wants to fire him, he is very shocked. He orders three men to lock Betty and Tolliver up. Later, Jeffers and his partners goes to the headquarters building, plotting their next moves. Tolliver assumes that Jeffers has already warned the garage and airlocks about the two, so that they cannot escape. Finally, when Betty reaches Space Patrol through the microphone, she told them to arrest Jeffers. "
              },
              {
                "worker_id": "104",
                "uid": "a8647ca10ec442cba5bda82634b374bd",
                "response_text": "The story begins with Tolliver expressing his discontent in a meeting with Jeffers. Jeffers at first tries to appease Tolliver and then changes his attitude. He threatens Tolliver multiple times in an attempt to subdue his anger. \n\nLater on, Tolliver barges into Jeffers office in an attempt to annoy Jeffers. He is successful in doing so. Once Jeffers notices Betty, his attitude changes and he greets her warmly and with excitement. However, very quickly Betty shows her disdain towards Jeffers. He is uncertain as to why she is upset with him and appears to blame Tolliver. After Betty details her accusations, Jeffers is quick to defend himself and even quicker to anger and go into action. He orders people to lock both Tolliver and Betty up. \n\nIt is implied that Betty called a group that will come in and arrest Jeffers for his actions and remove him from his post. \n"
              },
              {
                "worker_id": "105",
                "uid": "d1e82aee0b964768aee54ef0f0e092a8",
                "response_text": "The story starts with Jeffers trying to persuade Johnny to join his gang in stealing and reselling a part of the valuable cargo. He threatens Johnny as the least refuses to. The further refusal makes Jeffers put Johnny to some boring job such as driving tractors with relative of home-office. Later, Jeffers meets Betty, a daughter of a very influential man. He treats her sweetly until she accuses him of his crimes. Then he calls for his men to lock up the girl and Tolliver in order to give him time to think. Jeffers plots the next moves and orders to watch out for the prisoners. After a while, Betty calls Space Patrol to request arresting Jeffers. "
              },
              {
                "worker_id": "101",
                "uid": "e820fffa8ece488593ffede2784c4256",
                "response_text": "The story begins in Jeffers' office, where he meets with his employee, Johnny Tolliver, and offers him a part in his scheme where he steals from his cargo ships for profit. Tolliver refuses to join, and Jeffers then lays Tolliver off his space pilot assignment, and instead places him to drive tractors. A few days later, Jeffers is met by Tolliver and Betty in his office. Jeffers happily greets Betty as Miss Koslow, but Betty instead threatens to have Jeffers fired. Afraid of being found out, Jeffers captures the two and keeps them in an office. However, they soon escape and Jeffers is ordered to be arrested."
              }
            ]
          },
          {
            "question_text": "Describe the equipments used throughout the story",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8c343deb053741e1aa02ad9c0ef26824",
                "response_text": "Firstly, Tolliver takes Betty towards Jeffers’ office on a tractor since it can go through the frozen surface of Ganymede. Then later, when Betty and Tolliver were put in the empty office, Tolliver uses a lighter to light up the mess of discarded records so that the plastic can be bent. Later, inside the storage room, Tolliver finds some spacesuits for the two to wear. Then finally, when they gets to the control room, they gets onto the acceleration seat. Using the ship, the two fly into the economy orbit for Earth in order to escape. In the end, Betty uses the scanner and microphone to make a call to the Space Patrol so that they will arrest Jeffers. "
              },
              {
                "worker_id": "104",
                "uid": "a8647ca10ec442cba5bda82634b374bd",
                "response_text": "Tolliver is a pilot, but while at the Ganymede branch he drives a tractor. One of the equipment used during the story is the automatic flight. An automatic flight allows loaded ships to take a slow and economical orbit using automatic signaling equipment towards Earth. As the loaded ship gets closer to Earth, it is boarded by pilots that land the ship. Another piece of equipment mentioned are spacesuits. The spacesuits involve valves and seals and microphones for people to communicate with each other in the spacesuits. The communication is activated by a switch under the chin on the helmet of the spacesuit. They also come with a heavy knife. "
              },
              {
                "worker_id": "105",
                "uid": "d1e82aee0b964768aee54ef0f0e092a8",
                "response_text": "Various types of transportation are used throughout the story - tractors to travel on Ganymede between the city and the spaceport, spaceships requiring a lot of fuel and economy orbits which require less fuel but take much longer to get to the place. In a storeroom there are plenty spacesuits, some of which need replacement. Knives are standard suit equipment. Spaceships are equipped with airlocks, ladders and switch-cover. In the control room there is an acceleration seat, a button to set off, a radio and TV, with a screen to see the other side of the call. "
              },
              {
                "worker_id": "101",
                "uid": "e820fffa8ece488593ffede2784c4256",
                "response_text": "Tolliver is first assigned to use an airtight tractor to transport to and from the spaceport. This tractor is like a regular one, but built specifically to trek across Ganymede with its gravity. When Tolliver and Betty are locked into Jeffers' office, he uses a lighter and paper to bend the plastic of the door. Then, he uses a knife to cut through the plastic of the dome. Finally, Tolliver and Betty board a ship, where the orbit is automatically preset in order to preserve fuel. The ship, which Tolliver knows how to operate, is airlocked. Betty uses a transmitter to contact Space Patrol."
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8c343deb053741e1aa02ad9c0ef26824",
                "response_text": "First, the story starts inside Jeffers’ office where the two argues. From the office window, the transparent domes of Ganymede’s can be seen. There is also a chair and a door which is the exit from the room. Then at the empty office next to the warehouse building, Tolliver wakes up. There is an old table and half a dozen plastic crates in the empty office. The plastic crates contain a mess of discarded records. There is also a doorway. The doorway is plastic and can be bended when applied heat. Outside of the room, there’s a storeroom, which has spacesuits inside them. Many of the spacesuits are unpacked while some are standing ready for emergencies. The control room has an acceleration seat. There is a board that has the condition of the ship. "
              },
              {
                "worker_id": "104",
                "uid": "a8647ca10ec442cba5bda82634b374bd",
                "response_text": "The story begins with Johnny Tolliver and Jeffers in Jeffers office at the Ganymedan branch of Koslow Spaceways. The office was encapsulated in a transparent dome. Jupiter was more than half a million miles away from the surface of Ganymede. The story begins on a Monday, according to the calendar to match the week long journey it took to go around Jupiter. When Tolliver does get an assignment, it is to take the tractor to bring a home office relative to the airlock at their destination. He does so and brings Betty, the home office relative, to Jeffers office. \n\nAfter Jeffers orders them locked up, they find themselves in an office next to the warehouse building. Tolliver begins to plan their escape and is successfully in getting the door open. Tolliver and Betty walk through to the end of the adjoining warehouse building and find spacesuits in a storeroom for them to wear. After putting on their spacesuits, they leave the warehouse. Tolliver and Betty cut through different layers of the dome and make their way on to the Ganymedan surface. As they get onto the Ganymedan surface, they run across the ice towards Betty’s ship. They climb a ladder and go through an airlock to board the ship and then head to the control room. Tolliver guides the ship to take off and tells Betty that they will be spending 6 months there. \n"
              },
              {
                "worker_id": "105",
                "uid": "d1e82aee0b964768aee54ef0f0e092a8",
                "response_text": "The story opens with Johnny sitting at the desk with his superior on Ganymede. Then Johnny walks out living the door open. Next day he comes to the bulletin board to see his tasks. In a couple of days he is ordered to drive a home-office relative. He loads trunks and bags into his tractor and drives a girl from her dome. He maneuvers out of it and heads toward the city domes. The gravity is light all around. The two walk again into Jeffers' office. Then they find themselves on the floor of an empty locked office in a warehouse building. There is only a table and some plastic crates. When they escape, the two head to a storeroom for spacesuits. Through a rear door they go out, cross an open lane between buildings and reach the main dome. They squeeze inside where there is air pressure and low gravity, so it's extremely hard to run there. They open a spaceship airlock and get in through a ladder.  In the control room there is an acceleration seat, a button to set off, a radio and TV, with a screen to see the other side of the call. The ship sets off to the orbit of Ganymede. "
              },
              {
                "worker_id": "101",
                "uid": "e820fffa8ece488593ffede2784c4256",
                "response_text": "The story takes place on Ganymede, a moon of Jupiter. The climate of the moon is cold and vast, with very low gravity. The beginning of the story takes place in Jeffers' office. Tolliver gets the job of driving a tractor to and from Ganymede's spaceport, where different parts of the moon are covered by transparent domes. Later in the story, Tolliver and Betty are trapped in an empty office room with only a table, crates, and papers. They escape and run on the surface of Ganymede into a spaceship."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4898,
        "document_length_chars": 28157
      }
    }
  ]
}