{
  "item_metadata": {
    "item_id": "61052",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61052",
      "content": "Spawning Ground\n \n\n By LESTER DEL REY\n \n\n They weren't human. They were something\n  \n more—and something less—they were,\n  \n in short, humanity's hopes for survival!\n \n\n [Transcriber's Note: This etext was produced from\n  \n Worlds of If Science Fiction, September 1961.\n  \n Extensive research did not uncover any evidence that\n  \n the U.S. copyright on this publication was renewed.]\n \n\n\n The Starship\n \n  Pandora\n \n creaked and groaned as her landing pads settled\n unevenly in the mucky surface of the ugly world outside. She seemed to\n be restless to end her fool's errand here, two hundred light years from\n the waiting hordes on Earth. Straining metal plates twanged and echoed\n through her hallways.\n \n\n Captain Gwayne cursed and rolled over, reaching for his boots. He was\n a big, rawboned man, barely forty; but ten years of responsibility\n had pressed down his shoulders and put age-feigning hollows under his\n reddened eyes. The starlanes between Earth and her potential colonies\n were rough on the men who traveled them now. He shuffled toward the\n control room, grumbling at the heavy gravity.\n \n\n Lieutenant Jane Corey looked up, nodding a blonde head at him as he\n moved toward the ever-waiting pot of murky coffee. \"Morning, Bob. You\n need a shave.\"\n \n\n \"Yeah.\" He swallowed the hot coffee without tasting it, then ran a\n hand across the dark stubble on his chin. It could wait. \"Anything new\n during the night?\"\n \n\n \"About a dozen blobs held something like a convention a little ways\n north of us. They broke up about an hour ago and streaked off into the\n clouds.\" The blobs were a peculiarity of this planet about which nobody\n knew anything. They looked like overgrown fireballs, but seemed to have\n an almost sentient curiosity about anything moving on the ground. \"And\n our two cadets sneaked out again. Barker followed them, but lost them\n in the murk. I've kept a signal going to guide them back.\"\n \n\n Gwayne swore softly to himself. Earth couldn't turn out enough starmen\n in the schools, so promising kids were being shipped out for training\n as cadets on their twelfth birthday. The two he'd drawn, Kaufman and\n Pinelli, seemed to be totally devoid of any sense of caution.\n \n\n Of course there was no obvious need for caution here. The blobs hadn't\n seemed dangerous, and the local animals were apparently all herbivorous\n and harmless. They were ugly enough, looking like insects in spite of\n their internal skeletons, with anywhere from four to twelve legs each\n on their segmented bodies. None acted like dangerous beasts.\n \n\n But\n \n  something\n \n had happened to the exploration party fifteen years\n back, and to the more recent ship under Hennessy that was sent to check\n up.\n \n\n He turned to the port to stare out at the planet. The Sol-type sun\n must be rising, since there was a dim light. But the thick clouds that\n wrapped the entire world diffused its rays into a haze. For a change,\n it wasn't raining, though the ground was covered by thick swirls of\n fog. In the distance, the tops of shrubs that made a scrub forest\n glowed yellow-green. Motions around them suggested a herd of feeding\n animals. Details were impossible to see through the haze. Even the\n deep gorge where they'd found Hennessy's carefully buried ship was\n completely hidden by the fog.\n \n\n There were three of the blobs dancing about over the grazing animals\n now, as they often seemed to do. Gwayne stared at them for a minute,\n trying to read sense into the things. If he had time to study them....\n \n\n But there was no time.\n \n\n Earth had ordered him to detour here, after leaving his load of\n deep-sleep stored colonists on Official World 71, to check on any sign\n of Hennessy. He'd been here a week longer than he should have stayed\n already. If there was no sign in another day or so of what had happened\n to the men who'd deserted their ship and its equipment, he'd have to\n report back.\n \n\n He would have left before, if a recent landslip hadn't exposed enough\n of the buried ship for his metal locators to spot from the air by\n luck. It had obviously been hidden deep enough to foil the detectors\n originally.\n \n\n \"Bob!\" Jane Corey's voice cut through his pondering. \"Bob, there are\n the kids!\"\n \n\n Before he could swing to follow her pointing finger, movement caught\n his eye.\n \n\n The blobs had left the herd. Now the three were streaking at fantastic\n speed to a spot near the ship, to hover excitedly above something that\n moved there.\n \n\n He saw the two cadets then, heading back to the waiting ship, just\n beyond the movement he'd seen through the mist.\n \n\n Whatever was making the fog swirl must have reached higher ground.\n Something began to heave upwards. It was too far to see clearly, but\n Gwayne grabbed the microphone, yelling into the radio toward the cadets.\n \n\n They must have seen whatever it was just as the call reached them.\n Young Kaufman grabbed at Pinelli, and they swung around together.\n \n\n Then the mists cleared.\n \n\n Under the dancing blobs, a horde of things was heading for the cadets.\n Shaggy heads, brute bodies vaguely man-like! One seemed to be almost\n eight feet tall, leading the others directly toward the spacesuited\n cadets. Some of the horde were carrying spears or sticks. There was a\n momentary halt, and then the leader lifted one arm, as if motioning the\n others forward.\n \n\n \"Get the jeeps out!\" Gwayne yelled at Jane. He yanked the door of\n the little officers' lift open and jabbed the down button. It was\n agonizingly slow, but faster than climbing down. He ripped the door\n back at the exit deck. Men were dashing in, stumbling around in\n confusion. But someone was taking over now—one of the crew women. The\n jeeps were lining up. One, at the front, was stuttering into life, and\n Gwayne dashed for it as the exit port slid back.\n \n\n There was no time for suits or helmets. The air on the planet was\n irritating and vile smelling, but it could be breathed. He leaped to\n the seat, to see that the driver was Doctor Barker. At a gesture, the\n jeep rolled down the ramp, grinding its gears into second as it picked\n up speed. The other two followed.\n \n\n There was no sign of the cadets at first. Then Gwayne spotted them;\n surrounded by the menacing horde. Seen from here, the things looked\n horrible in a travesty of manhood.\n \n\n The huge leader suddenly waved and pointed toward the jeeps that were\n racing toward him. He made a fantastic leap backwards. Others swung\n about, two of them grabbing up the cadets. The jeep was doing twenty\n miles an hour now, but the horde began to increase the distance, in\n spite of the load of the two struggling boys! The creatures dived\n downward into lower ground, beginning to disappear into the mists.\n \n\n \"Follow the blobs,\" Gwayne yelled. He realized now he'd been a fool to\n leave his suit; the radio would have let him keep in contact with the\n kids. But it was too late to go back.\n \n\n The blobs danced after the horde. Barker bounced the jeep downward into\n a gorge. Somewhere the man had learned to drive superlatively; but he\n had to slow as the fog thickened lower down.\n \n\n Then it cleared to show the mob of creatures doubling back on their own\n trail to confuse the pursuers.\n \n\n There was no time to stop. The jeep plowed through them. Gwayne had a\n glimpse of five-foot bodies tumbling out of the way. Monstrously coarse\n faces were half hidden by thick hair. A spear crunched against the\n windshield from behind, and Gwayne caught it before it could foul the\n steering wheel. It had a wickedly beautiful point of stone.\n \n\n The creatures vanished as Barker fought to turn to follow them. The\n other jeeps were coming up, by the sound of their motors, but too late\n to help. They'd have to get to the group with the cadets in a hurry or\n the horde would all vanish in the uneven ground, hidden by the fog.\n \n\n A blob dropped down, almost touching Gwayne.\n \n\n He threw up an instinctive hand. There was a tingling as the creature\n seemed to pass around it. It lifted a few inches and drifted off.\n \n\n Abruptly, Barker's foot ground at the brake. Gwayne jolted forward\n against the windshield, just as he made out the form of the eight-foot\n leader. The thing was standing directly ahead of him, a cadet on each\n shoulder.\n \n\n The wheels locked and the jeep slid protestingly forward. The creature\n leaped back. But Gwayne was out of the jeep before it stopped, diving\n for the figure. It dropped the boys with a surprised grunt.\n \n\n The arms were thin and grotesque below the massively distorted\n shoulders, but amazingly strong. Gwayne felt them wrench at him as his\n hands locked on the thick throat. A stench of alien flesh was in his\n nose as the thing fell backwards. Doc Barker had hit it seconds after\n the captain's attack. Its head hit rocky ground with a dull, heavy\n sound, and it collapsed. Gwayne eased back slowly, but it made no\n further move, though it was still breathing.\n \n\n Another jeep had drawn up, and men were examining the cadets. Pinelli\n was either laughing or crying, and Kaufman was trying to break free to\n kick at the monster. But neither had been harmed. The two were loaded\n onto a jeep while men helped Barker and Gwayne stow the bound monster\n on another before heading back.\n \n\n \"No sign of skull fracture. My God, what a tough brute!\" Barker shook\n his own head, as if feeling the shock of the monster's landing.\n \n\n \"I hope so,\" Gwayne told him. \"I want that thing to live—and you're\n detailed to save it and revive it. Find out if it can make sign\n language or draw pictures. I want to know what happened to Hennessy\n and why that ship was buried against detection. This thing may be the\n answer.\"\n \n\n Barker nodded grimly. \"I'll try, though I can't risk drugs on an alien\n metabolism.\" He sucked in on the cigarette he'd dug out, then spat\n sickly. Smoke and this air made a foul combination. \"Bob, it still\n makes no sense. We've scoured this planet by infra-red, and there was\n no sign of native villages or culture. We should have found some.\"\n \n\n \"Troglodytes, maybe,\" Gwayne guessed. \"Anyhow, send for me when you get\n anything. I've got to get this ship back to Earth. We're overstaying\n our time here already.\"\n \n\n The reports from the cadets were satisfactory enough. They'd been\n picked up and carried, but no harm had been done them. Now they were\n busy being little heroes. Gwayne sentenced them to quarters as soon\n as he could, knowing their stories would only get wilder and less\n informative with retelling.\n \n\n If they could get any story from the captured creature, they might save\n time and be better off than trying to dig through Hennessy's ship. That\n was almost certainly spoorless by now. The only possible answer seemed\n to be that the exploring expedition and Hennessy's rescue group had\n been overcome by the aliens.\n \n\n It was an answer, but it left a lot of questions. How could the\n primitives have gotten to the men inside Hennessy's ship? Why was its\n fuel dumped? Only men would have known how to do that. And who told\n these creatures that a space ship's metal finders could be fooled by a\n little more than a hundred feet of solid rock? They'd buried the ship\n cunningly, and only the accidental slippage had undone their work.\n \n\n Maybe there would never be a full answer, but he had to find\n something—and find it fast. Earth needed every world she could make\n remotely habitable, or mankind was probably doomed to extinction.\n \n\n The race had blundered safely through its discovery of atomic weapons\n into a peace that had lasted two hundred years. It had managed to\n prevent an interplanetary war with the Venus colonists. It had found\n a drive that led to the stars, and hadn't even found intelligent life\n there to be dangerous on the few worlds that had cultures of their own.\n \n\n But forty years ago, observations from beyond the Solar System had\n finally proved that the sun was going to go nova.\n \n\n It wouldn't be much of an explosion, as such things go—but it would\n render the whole Solar System uninhabitable for millenia. To survive,\n man had to colonize.\n \n\n And there were no worlds perfect for him, as Earth had been. The\n explorers went out in desperation to find what they could; the\n terraforming teams did what they could. And then the big starships\n began filling worlds with colonists, carried in deep sleep to conserve\n space.\n \n\n Almost eighty worlds. The nearest a four month journey from Earth and\n four more months back.\n \n\n In another ten years, the sun would explode, leaving man only on the\n footholds he was trying to dig among other solar systems. Maybe some\n of the strange worlds would let men spread his seed again. Maybe none\n would be spawning grounds for mankind in spite of the efforts. Each was\n precious as a haven for the race.\n \n\n If this world could be used, it would be nearer than most. If not, as\n it now seemed, no more time could be wasted here.\n \n\n Primitives could be overcome, maybe. It would be ruthless and unfair to\n strip them of their world, but the first law was survival.\n \n\n But how could primitives do what these must have done?\n \n\n He studied the spear he had salvaged. It was on a staff made of\n cemented bits of smaller wood from the scrub growth, skillfully\n laminated. The point was of delicately chipped flint, done as no human\n hand had been able to do for centuries.\n \n\n \"Beautiful primitive work,\" he muttered.\n \n\n Jane pulled the coffee cup away from her lips and snorted. \"You can\n see a lot more of it out there,\" she suggested.\n \n\n He went to the port and glanced out. About sixty of the things were\n squatting in the clearing fog, holding lances and staring at the ship.\n They were perhaps a thousand yards away, waiting patiently. For what?\n For the return of their leader—or for something that would give the\n ship to them?\n \n\n Gwayne grabbed the phone and called Barker. \"How's the captive coming?\"\n \n\n Barker's voice sounded odd.\n \n\n \"Physically fine. You can see him. But—\"\n \n\n Gwayne dropped the phone and headed for the little sick bay. He swore\n at Doc for not calling him at once, and then at himself for not\n checking up sooner. Then he stopped at the sound of voices.\n \n\n There was the end of a question from Barker and a thick, harsh growling\n sound that lifted the hair along the nape of Gwayne's neck. Barker\n seemed to understand, and was making a comment as the captain dashed in.\n \n\n The captive was sitting on the bunk, unbound and oddly unmenacing. The\n thick features were relaxed and yet somehow intent. He seemed to make\n some kind of a salute as he saw Gwayne enter, and his eyes burned up\n unerringly toward the device on the officer's cap.\n \n\n \"Haarroo, Cabbaan!\" the thing said.\n \n\n \"Captain Gwayne, may I present your former friend, Captain Hennessy?\"\n Barker said. There was a grin on the doctor's lips, but his face was\n taut with strain.\n \n\n The creature nodded slowly and drew something from the thick hair on\n its head. It was the golden comet of a captain.\n \n\n \"He never meant to hurt the kids—just to talk to them,\" Barker cut in\n quickly. \"I've got some of the story. He's changed. He can't talk very\n well. Says they've had to change the language around to make the sounds\n fit, and he's forgotten how to use what normal English he can. But it\n gets easier as you listen. It's Hennessy, all right. I'm certain.\"\n \n\n Gwayne had his own ideas on that. It was easy for an alien to seize\n on the gold ornament of a captive earthman, even to learn a little\n English, maybe. But Hennessy had been his friend.\n \n\n \"How many barmaids in the Cheshire Cat? How many pups did your oldest\n kid's dog have? How many were brown?\"\n \n\n The lips contorted into something vaguely like a smile, and the\n curiously shaped fingers that could handle no human-designed equipment\n spread out.\n \n\n Three. Seven. Zero.\n \n\n The answers were right.\n \n\n By the time the session was over, Gwayne had begun to understand the\n twisted speech from inhuman vocal cords better. But the story took a\n long time telling.\n \n\n When it was finished, Gwayne and Barker sat for long minutes in\n silence. Finally Gwayne drew a shuddering breath and stood up. \"Is it\n possible, Doc?\"\n \n\n \"No,\" Barker said flatly. He spread his hands and grimaced. \"No. Not\n by what I know. But it happened. I've looked at a few tissues under\n the microscope. The changes are there. It's hard to believe about\n their kids. Adults in eight years, but they stay shorter. It can't be\n a hereditary change—the things that affect the body don't change the\n germ plasm. But in this case, what changed Hennessy is real, so maybe\n the fact that the change is passed on is as real as he claims.\"\n \n\n Gwayne led the former Hennessy to the exit. The waiting blobs dropped\n down to touch the monstrous man, then leaped up again. The crowd of\n monsters began moving forward toward their leader. A few were almost as\n tall as Hennessy, but most were not more than five feet high.\n \n\n The kids of the exploring party....\n \n\n Back in the control room, Gwayne found the emergency release levers,\n set the combinations and pressed the studs. There was a hiss and gurgle\n as the great tanks of fuel discharged their contents out onto the\n ground where no ingenuity could ever recover it to bring life to the\n ship again.\n \n\n He'd have to tell the men and women of the crew later, after he'd had\n time to organize things and present it all in a way they could accept,\n however much they might hate it at first. But there was no putting off\n giving the gist of it to Jane.\n \n\n \"It was the blobs,\" he summarized it. \"They seem to be amused by men.\n They don't require anything from us, but they like us around. Hennessy\n doesn't know why. They can change our cells, adapt us. Before men came,\n all life here had twelve legs. Now they're changing that, as we've seen.\n \n\n \"And they don't have to be close to do it. We've all been outside the\n hull. It doesn't show yet—but we're changed. In another month, Earth\n food would kill us. We've got to stay here. We'll bury the ships deeper\n this time, and Earth won't find us. They can't risk trying a colony\n where three ships vanish, so we'll just disappear. And they'll never\n know.\"\n \n\n Nobody would know. Their children—odd children who matured in eight\n years—would be primitive savages in three generations. The Earth\n tools would be useless, impossible for the hands so radically changed.\n Nothing from the ship would last. Books could never be read by the new\n eyes. And in time, Earth wouldn't even be a memory to this world.\n \n\n She was silent a long time, staring out of the port toward what must\n now be her home. Then she sighed. \"You'll need practice, but the others\n don't know you as well as I do, Bob. I guess we can fix it so they'll\n believe it all. And it's too late now. But we haven't really been\n changed yet, have we?\"\n \n\n \"No,\" he admitted. Damn his voice! He'd never been good at lying. \"No.\n They have to touch us. I've been touched, but the rest could go back.\"\n \n\n She nodded. He waited for the condemnation, but there was only\n puzzlement in her face. \"Why?\"\n \n\n And then, before he could answer, her own intelligence gave her the\n same answer he had found for himself. \"The spawning ground!\"\n \n\n It was the only thing they could do. Earth needed a place to plant her\n seed, but no world other than Earth could ever be trusted to preserve\n that seed for generation after generation. Some worlds already were\n becoming uncertain.\n \n\n Here, though, the blobs had adapted men to the alien world instead of\n men having to adapt the whole planet to their needs. Here, the strange\n children of man's race could grow, develop and begin the long trek back\n to civilization. The gadgets would be lost for a time. But perhaps\n some of the attitudes of civilized man would remain to make the next\n rise to culture a better one.\n \n\n \"We're needed here,\" he told her, his voice pleading for the\n understanding he couldn't yet fully give himself. \"These people need\n as rich a set of bloodlines as possible to give the new race strength.\n The fifty men and women on this ship will be needed to start them with\n a decent chance. We can't go to Earth, where nobody would believe or\n accept the idea—or even let us come back. We have to stay here.\"\n \n\n She smiled then and moved toward him, groping for his strength. \"Be\n fruitful,\" she whispered. \"Be fruitful and spawn and replenish an\n earth.\"\n \n\n \"No,\" he told her. \"Replenish the stars.\"\n \n\n But she was no longer listening, and that part of his idea could wait.\n \n\n Some day, though, their children would find a way to the starlanes\n again, looking for other worlds. With the blobs to help them, they\n could adapt to most worlds. The unchanged spirit would lead them\n through all space, and the changing bodies would claim worlds beyond\n numbering.\n \n\n Some day, the whole universe would be a spawning ground for the\n children of men!",
      "metadata": {
        "title": "Spawning Ground",
        "author": "Lester del Rey",
        "passage_id": "61052",
        "uid": "a1cd22cb2e5943b7bf7712977dd79153",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "112",
                "uid": "433c25c82cc749389b26ea9f22686d22",
                "response_text": "The Starship Pandora lands on a planet where an exploring ship and a rescue group disappear. Captain Gwayne was ordered to come and inspect the lost ships for a week. They prolong their stay because of a discovery of the carefully buried ship whose parts were exposed by a landslide and detected by a metal locator a few days ago. When two cadets, Kaufman and Pinelli, and one member, Doctor Barker, approach to examine the buried ship, a horde of mysterious creatures come to them. The leader of mysterious creatures, tall and man-like, kidnaps the two cadets with his members and runs away. Captain Gwayne and other crew members ride on jeeps and chase after the monsters. When they catch up to the mysterious leader, the cadets are sitting on each shoulder of the leader without harm. Captain Gwayne and Doctor Barker collaborate to defeat the leader and bring it back to the ship.\n\nAfter bringing back the captive, Captain Gwayne has learned from the creature that he is Hennessy, the missing captain of the buried ship. He reveals that the blobs, a peculiarity on the planet, can change the cells in living creatures to help them adapt to the planet, which has done to Captain Hennessy and his crew members. All the mysterious creatures surrounding the ship are either the original crew members or their descendants. They decided to bury the ship after noticing the changes. After he finished the story, Captain Hennessy went to gather with his people. And now, Captain Gwayne faces the same situation as Captain Hennessy did in the past: either die when they go back to the Earth or stay on the planet to become a different creature, which at least makes humankind survive differently. Captain Gwayne decides to stay, so he discharges all the fuel out to not let the ship live again. He then tells Jane Corey, the Lieutenant, the truth and his decision. They both know that they have to stay for the better strength of the species after generations because humankind needs to have at least one hope to spread their seeds, even in a different shape. They will obliterate all their traces so that the Earth will send no more humans to the planet.\n"
              },
              {
                "worker_id": "109",
                "uid": "17362750e0094364a9365a4295b0e4f7",
                "response_text": "Captain Gwayne is a weary fourty-year old man who captains the starship Pandora, as one of the many colonies traveling around space to find a new planet that can sustain human life like Earth. Accompanied by Lieutenant Jane Corey, he is informed that two of the space cadets snuck outside the ship. Among the outside landscape includes blobs, who are described to be a peculiarity of this particular planet; seemingly harmless but are ugly in looks.\n\nGwayne wishes to study them more thoroughly, but is reminded of his mission in deviating to this planet to search for Captain Hennessey and his men, who had abandoned their ship. As the cadets are heading back to Gwayne’s ship, a herd of blobs disperses in excitement and instead they begin to hover over a singular spot. The cadets turn to find a horde of things heading towards them, described to be vaguely man-like with a distinct leader at eight feet tall, and all of them holding objects like spears or sticks. In a race to reach the cadets before the things did, Gwayne, Jane and other officers raced in Jeeps towards the boys. Noticing the incoming Jeeps, the creatures grabbed the boys and disappeared into the mists, with the officers following fast in pursuit. Plowing through them, Gwayne touches a blob whose shape passes around it. As they confront the eight foot leader, it suddenly drops the boys and Gwayne and Doc Barker knock it out of consciousness. \n\nWith the boys safe, they take the unconscious creature back to the ship to try and see if the creature had anything to do with Hennessey’s disappearance and buried ship. Any information revealed would be pivotal in determining this planet’s habitability, as it is revealed that Earth was threatened with the Sun going nova and hence the human race found themselves in a scramble to find a replacement home. Gwayne and Jane then visit Barker and the now-awake creature, who immediately greets Gwayne in some garbled English. They find out that the leader of the creature is actually Captain Hennessy who had grabbed the kids with the intention of talking to them. It turns out that Hennessey and his crew have physically changed due to the planet, turning them into man-like creatures with an adapted English language. \n\nMore so, it is revealed that blobs enjoy having the humans around, and are subtly changing and adapting the human cells. It is what happened to Hennessy and is already happening to Gwayne because he’s been touched. However, the rest of his crew could go back but are unable to because Gwayne has dumped the fuel. In the end, we find out that Gwayne and Jane consider the answer to finding a new planet to be void, as they only thing they could do is find a new spawning ground, which they would be able to achieve if both crews spawn a new race on this planet and eventually, explore the star lanes once again. \n"
              },
              {
                "worker_id": "111",
                "uid": "2e7ac0d328af449aaf0169a3bb6ddd4e",
                "response_text": "The story is about a ship captain, Gwayne, and his team arriving on a new planet. It is revealed that they were on that planet because two different expeditions had gone there before and neither had returned, so Gwayne and his team were there to see what had happened. It is also revealed that Earth’s sun was going nova, which is why humans were exploring and looking to colonize other planets. The planet is inhabited by blobs, spirit-like alien creatures, who seem harmless. Gwayne sends 2 kids to check the planet, and when they return the ship and the crew are ambushed by a horde of alien-like creatures. When the leader captures the two cadets, Gwayne rushes out and, with the help of another crew member, rescues the kids and captures the leader. When the crew’s doctor checks the leader, they find out that the creature is actually the captain of the previous mission, and Gwayne’s friend. Gwayne realizes that this was the blobs’ doing, and that they can change and adapt the body of human beings. After this is revealed, the crew decides that they should all stay on the planet, and bury the ship. This would allow the humans to create a new colony there with the blobs, and allow them to help each other, as the blobs could in a far future help the changed humans adapt to different planets. "
              },
              {
                "worker_id": "107",
                "uid": "f6fb6af1626843458f73bbe960102af8",
                "response_text": "The starship Pandora creaks and groans as she settles on an ugly world. The starship is two hundred light-years away from Earth. Captain Gwayne curses and reaches for his boots; he shuffles to the control room where Lieutenant Jane Corey is waiting. Jane reports that a dozen mysterious blobs held a convention north, but they had broken off about an hour ago. She also informs him that the two cadets have snuck out again, to which Gwayne swears because Kaufman and Pinelli have no sense of caution. The Sol-type Sun begins to rise, but there is so much fog everywhere that it is impossible to see. He observes three blobs but knows that there is no time because Earth sent him here to check for any signs of Hennessy’s ship. Suddenly, Jane calls him to say that the two cadets are back. Strange creatures appear, and Gwayne yells at Jane to get the jeeps out. Once they drive, the menacing horde notices the jeeps and begins to run away with the cadets faster. Although the creatures try to stop their pursuers, the jeep goes through and catches a glimpse. Once the creature with the two cadets is in front of him, Gwayne dives to get the cadets back. Doc Barker hits the creature seconds after, and this causes the creature to collapse. The men examine the cadets, while Doc and Gwayne wonder if the creature could be the key to the missing ship. They discuss how the native creatures could have gone undetected, while Gwayne explains that it is time for him to go and get the ship back to Earth. The report from the cadets is enough, but there are still a lot of questions regarding the creatures and the missing crew. However, there needs to be an answer fast because Earth is close to extinction from the Sun. Since nobody would be able to live in the Solar System when that happens, the explorers must go out and find another world. Everybody does their part because the Sun will explode in ten years, while some of the strange planets would give man the opportunity to repopulate. Gwayne receives a call from Doc Barker and goes to see the creature. The creature is Captain Hennessy, and he has forgotten how to speak English because they had to change the language to make the sounds fit. When Gwayne questions the creature, it answers correctly; they listen to Hennessy’s story. Gwayne leads former Hennessy out and goes back to the control room to discharge the ship’s fuel tanks. It is revealed that the blobs can adapt to cells and have no choice but to stay because they are already changed. Jane figures that they have really not been changed yet, but she concludes spawning ground. The fifty men and women can replenish the Earth here, and Gwayne knows that their children would one day find a way to the star lanes again to spread the children of men further. "
              }
            ]
          },
          {
            "question_text": "Who is Hennessy? What happens to him throughout the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "112",
                "uid": "433c25c82cc749389b26ea9f22686d22",
                "response_text": "Hennessy is the captain of the lost ship sent to inspect an exploring team fifteen years ago on a planet. He is also a friend of Captain Gwayne, who comes after him to check his loss. He becomes a mysterious creature adapted by the blobs, a peculiarity on the planet. Due to this change to him and his crew members, they decide to bury their ships carefully not to let other people find them.\n\nWhen the Starship Pandora lands on the planet and the two cadets from the ship approach to examine the buried ship, Hennessy kidnaps them with his members, leading Captain Gwayne to come to capture him. After becoming a captive in the ship, he reveals his identity to Captain Gwayne, and Gwayne confirms his identity with a series of questions that are only known to them. Finally, he tells all the story to Gwayne and leaves to gather with his people outside the ship.\n"
              },
              {
                "worker_id": "109",
                "uid": "17362750e0094364a9365a4295b0e4f7",
                "response_text": "Captain Hennessy is a fellow officer whose ship and its crew became the first colony to explore this peculiar planet. However, for some initial unknown reason, Hennessy and his men abandoned their ship and equipment and ultimately buried their ship; hence, leading Earth to send Captain Gwayne and his crew to search for signs of them. \n\nIt is revealed that Captain Hennessy and his crew are indeed the horde of creatures that initially take the two young cadets. The tall eight foot leader, who actually turned out to be Hennessy, was knocked out after a confrontation and in conversation with Gwayne, Jane and the Doc, reveals how he and his crew came to be the creatures. It turns out that the blobs had great curiosity and interest in the humans and desired to keep them around, and so through contact with the humans, eventually changed and adapted their cells to be able to live on this planet. The change resulted in going from humans to man-like creatures with more primitive instincts, an adapted English language with distorted yet strong physiques. \n\nAfter explaining this to the officers aboard Pandora, Hennessy is released off the ship and back onto the planet, where he is greeted by the blobs and the rest of his monstrous crew. \n"
              },
              {
                "worker_id": "111",
                "uid": "2e7ac0d328af449aaf0169a3bb6ddd4e",
                "response_text": "Hennessy is a captain of one of the human’s colonizing ships. He is sent to a new planet in order to check up on a failed mission there. When he arrives, he and his crew get in contact with the blobs of the planet, which end up physically changing them into monster-like creatures. They decide to bury the ship and cut ties with the humans, in order to stop the same thing from happening to others. After a few years, a new ship arrives under the leadership of captain Gwayne. When two cadets of the ship are sent to explore the planet, Hennessy tries to talk to them, but this action is taken as a violent act by the ship, which ends up with the crew capturing him and taking him back to the ship. There the crew realizes that the creature is in fact Hennessy, and the crew realizes the position that they are in now. "
              },
              {
                "worker_id": "107",
                "uid": "f6fb6af1626843458f73bbe960102af8",
                "response_text": "Hennessy is one of the captains of a ship that was sent to check on an exploration party that disappeared. His own ship disappears too, which is why Gwayne’s ship is sent to check up on the vile planet. Although Hennessy is initially thought to have disappeared, his ship is found in a deep gorge hidden by fog. Gwayne and his crew spend the majority of their time trying to find any traces of Hennessy or his crew. Later, it is revealed that Hennessy had actually adapted and become something akin to one of the creatures that they encounter. He has forgotten how to speak normal English as a result of having to change the language around to make the sounds fit. When Gwayne tests him, Hennessy knows that there are three barmaids at the Cheshire Cat; his oldest son’s dog has seven pups, and none of them are brown. Hennessy then tells his story, and Gwayne leads him out to where a crowd of monsters is waiting.  "
              }
            ]
          },
          {
            "question_text": "Who is Jane Corey? What happens to her throughout the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "112",
                "uid": "433c25c82cc749389b26ea9f22686d22",
                "response_text": "Jane Corey is the lieutenant on the Starship Pandora. She calls Captain Gwayne “Bob.” She informs Captain Gwayne about the sneaking out of two cadets and the situation when Captain Gwayne asks her. She also gets the jeeps out when Captain Gwayne tries to catch up with the mysterious creatures who captured the cadets. In addition, after Captain Gwayne learns the truth from Hennessy, the leader of the mysterious creature, and discharges the fuel from the ship, he tells Jane about his decision. Jane does not condemn him for deciding the future of other members alone because she realizes that they must stay on the planet to function as a spawning ground for the human species. She is a good partner for Captain Gwayne."
              },
              {
                "worker_id": "109",
                "uid": "17362750e0094364a9365a4295b0e4f7",
                "response_text": "Jane Corey is a Lieutenant aboard the ship, Pandora, and is Captain Gwayne’s right hand woman. She is described to be highly intelligent and organized, as she is the first to inform Gwayne of the young cadet’s escapades as well as the first to observe the blobs’ change in behavior, hence alerting them to the kids’ presence in danger. \n\nHer intelligence is further highlighted after she, Gwayne and the Doc speak with the changed Hennessy. When Gwayne gives the gist of the situation to Jane, she is able to see through his lie and come to the conclusion herself the dire reality of the situation: that she and the crew are to remain on this planet in spite of turning into the creatures. This is because the planet is to be their spawning ground, in which the future bloodlines need to be as rich and fruitful in order to give the new human race a chance - and in the future - once again explore and adapt to other worlds. After this realization, she smiles and understands this reality to be fruitful and eventually, spawn to replenish Earth. \n"
              },
              {
                "worker_id": "111",
                "uid": "2e7ac0d328af449aaf0169a3bb6ddd4e",
                "response_text": "Jane Corey is a lieutenant in Captain Gwayne’s ship. She arrives on a new planet with her crew following up on the disappearance of two previous expeditions on that planet. After the crew finds Hennessy in his new form, Corey and Gwayne decide the best course of action for the ship, which is to settle in the planet and let the blobs adapt them to the planet, and adapt them to new planets in the future. \n"
              },
              {
                "worker_id": "107",
                "uid": "f6fb6af1626843458f73bbe960102af8",
                "response_text": "Lieutenant Jane Corey is one of the crew members on the Pandora spaceship. She is noted to have blonde hair. When Gwayne sees her in the morning, she tells him that he needs a shave. Later, she is the one to tell him about the kids heading back to the ship. She is also a quick-thinker, instantly releasing the jeeps when Gwayne yells at her. Jane later holds a cup of murky coffee in her hand and tells Gwayne that he can see more primitive spears outside if he enjoys its design so much. She instantly catches on when he tells her about the blobs, concluding that they have to be the ones who set up a spawning ground. She knows Gwayne better than the other crew members, and she silently agrees to stay on the planet. However, she also knows that they have not really been changed yet. As Gwayne talks about how he needs her, she smiles and talks about being fruitful to spawn and replenish the earth. "
              }
            ]
          },
          {
            "question_text": "What is the significance of the blobs?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "112",
                "uid": "433c25c82cc749389b26ea9f22686d22",
                "response_text": "The blobs are insect-like creatures with skeletons inside with four to twelve legs on their bodies. They are harmless. They are curious about any moving objects on the ground. They can change the cells in any living thing to adapt to the planet. They like humans, so they change their cells to let them stay on the planet.\n\nThe blobs are the main reason why Captain Hennessy and Gwayne decide to stay on the planet. They choose to stay because the blobs make them able to survive on the planet without having to change the whole planet to do so. Without the blobs, they may leave to search for other planets that can let humans survive. But with the blobs, someday in the future, humans may be able to seek out more possibilities in other worlds where the blobs will help them adapt to the new environments. In addition, the blobs also change their shape from only a twelve-leg body to having a four-leg form, which is also evidence of how they like human beings.\n"
              },
              {
                "worker_id": "109",
                "uid": "17362750e0094364a9365a4295b0e4f7",
                "response_text": "The blobs are the native inhabitants of this peculiar planet that the characters are exploring in this story. Observed as seemingly harmless and curious, the blobs aren’t given too much caution in the beginning of the story. However, the behavior of the blobs seem to indicate the presence of humans or creatures and as the story continues, are revealed to play a role in the latter. \n\nIt turns out that the blobs have adaptive capabilities to them - and have already used these capabilities to change the cell structure of Hennessy and his crew - changing them from humans to man-like creatures. While they are no longer like Earth humans, these man-like creatures are able to survive on this planet. This is significant because this story details man’s mission in searching for a habitable planet and the survival of the human race  - and through the blob’s amusement of man and adaptive capabilities - have discovered this form of survival. Rather than humans colonizing the planet like we may assume, the blobs indicate the planet changing the humans and signify the new reality for Captain Gwayne and his crew. \n"
              },
              {
                "worker_id": "111",
                "uid": "2e7ac0d328af449aaf0169a3bb6ddd4e",
                "response_text": "The blobs are the inhabitants of the new planet that are described as spirit-like. The crew believes that the blobs are harmless. After they find Hennessy, the crew realizes that the blobs can affect the humans, and adapt their bodies to different environments. Because of the impending explosion of the sun, humans are desperately looking for different planets where humans can live. Gwayne realizes that the blobs could be very important for the survival of the human species, because if the humans stay on the planet, the blobs could help the humans adapt to different planetary conditions in the future. "
              },
              {
                "worker_id": "107",
                "uid": "f6fb6af1626843458f73bbe960102af8",
                "response_text": "The blobs are a peculiarity on the planet and look like overgrown fireballs. They are initially very curious about humans, but they are not harmless. These blobs, however, later prove to be significant because they are capable of changing human cells to better adapt to the alien environment. The blobs find people amusing and like having them around. Gwayne mentions that life before man came used to have twelve legs, but the blobs have changed that. Another reason why the blobs are significant is that they have adapted man to the alien world instead of the other way around. Since men usually have to adapt the planet to their needs, being touched by a blob does the opposite and brings a human further away from human society. "
              }
            ]
          },
          {
            "question_text": "What happens to the human race on the Earth?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "112",
                "uid": "433c25c82cc749389b26ea9f22686d22",
                "response_text": "After the invention of atomic weapons, humans maintained peace for nearly two centuries. However, four decades ago, observation revealed that the sun would soon go nova, which would make the whole solar system uninhabitable for millennia. Since then, humans have been searching for habitable planets in other solar systems. They send many starships carrying deep-sleep stored people to different worlds, hoping they could be the colonies for the human race in the future, but none has promised to be safe for generations. So the exploring teams are sent continuously. Yet the situation is challenging. The training schools cannot export enough astronauts, so promising young candidates are trained as cadets on starships. Humans do not have enough time to find another Earth to live on for generations."
              },
              {
                "worker_id": "109",
                "uid": "17362750e0094364a9365a4295b0e4f7",
                "response_text": "On Earth, the human race is threatened by the Sun’s imminent reality of going nova. Despite surviving the discovery of atomic weapons and preventing an interplanetary war, the Sun going nova meant that humans had to find another world to inhabit and colonize in order to continue to survive, as even the Solar System would be uninhabitable for a while. \nAs such, explorers like Captain Gwayne and Hennessy were sent out to discover new worlds that may be habitable for humans with deep-sleeping colonizers while teams of terraformers did their best. \n"
              },
              {
                "worker_id": "111",
                "uid": "2e7ac0d328af449aaf0169a3bb6ddd4e",
                "response_text": "The human race on Earth is facing probable extinction. This is because they found out that the sun is going nova, which means that the Sun is going to explode soon, leading to the extinction of the human race. This has caused the human race to search different planets where they could live and colonize. This whole process is what set up the arrival of Gwayne’s crew on the planet to search for Hennessy. Hennessy’s ship was sent to the planet to scout and see if humans could live there. "
              },
              {
                "worker_id": "107",
                "uid": "f6fb6af1626843458f73bbe960102af8",
                "response_text": "The human race on Earth will be destroyed when the sun goes nova. Since this event will render the entire Solar System uninhabitable for millenia, people will have to colonize other planets. There is a team of explorers going out to find a world in desperation, terraforming teams, and big starships are also sent out with colonists in a deep sleep to conserve space. By the time they go to the new planet, the sun will explode in ten years and kill the entire human race on Earth. Even though humans enjoy their life on Earth, they know that they must find a new place to adapt to because the world will become destroyed. The human race might also go to these new planets to spawn and spread the same seeds that they did on Earth. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 3602,
        "document_length_chars": 20870
      }
    }
  ]
}