{
  "item_metadata": {
    "item_id": "61090",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61090",
      "content": "CALL HIM NEMESIS\n \n\n By DONALD E. WESTLAKE\n \n\n Criminals, beware; the Scorpion is on your trail! Hoodlums fear his fury—and, for that matter, so do the cops!\n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, September 1961. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n The man with the handkerchief mask said, \"All right, everybody, keep tight. This is a holdup.\"\n \n There were twelve people in the bank. There was Mr. Featherhall at his desk, refusing to okay a personal check from a perfect stranger. There was the perfect stranger, an itinerant garage mechanic named Rodney (Rod) Strom, like the check said. There were Miss English and Miss Philicoff, the girls in the gilded teller cages. There was Mister Anderson, the guard, dozing by the door in his brown uniform. There was Mrs. Elizabeth Clayhorn, depositing her husband's pay check in their joint checking account, and with her was her ten-year-old son Edward\n(Eddie) Clayhorn, Junior. There was Charlie Casale, getting ten dollars dimes, six dollars nickels and four dollars pennies for his father in the grocery store down the street. There was Mrs. Dolly Daniels, withdrawing money from her savings account again. And there were three bank robbers.\n \n The three bank robbers looked like triplets. From the ground up, they all wore scuffy black shoes, baggy-kneed and unpressed khaki trousers, brown cracked-leather jackets over flannel shirts, white handkerchiefs over the lower half of their faces and gray-and-white check caps pulled low over their eyes. The eyes themselves looked dangerous.\n \n The man who had spoken withdrew a small but mean-looking thirty-two calibre pistol from his jacket pocket. He waved it menacingly. One of the others took the pistol away from Mister Anderson, the guard, and said to him in a low voice, \"Think about retirement, my friend.\" The third one, who carried a black satchel like a doctor's bag, walked quickly around behind the teller's counter and started filling it with money.\n \n It was just like the movies.\n \n The man who had first spoken herded the tellers, Mr. Featherhall and the customers all over against the back wall, while the second man stayed next to Mr. Anderson and the door. The third man stuffed money into the black satchel.\n \n The man by the door said, \"Hurry up.\"\n \n The man with the satchel said, \"One more drawer.\"\n \n The man with the gun turned to say to the man at the door, \"Keep your shirt on.\"\n \n That was all Miss English needed. She kicked off her shoes and ran pelting in her stocking feet for the door.\n \n \n\n \n The man by the door spread his arms out and shouted, \"Hey!\" The man with the gun swung violently back, cursing, and fired the gun. But he'd been moving too fast, and so had Miss English, and all he hit was the brass plate on Mr. Featherhall's desk.\n \n The man by the door caught Miss English in a bear hug. She promptly did her best to scratch his eyes out. Meanwhile, Mr. Anderson went scooting out the front door and running down the street toward the police station in the next block, shouting, \"Help! Help! Robbery!\"\n \n The man with the gun cursed some more. The man with the satchel came running around from behind the counter, and the man by the door tried to keep Miss English from scratching his eyes out. Then the man with the gun hit Miss English on the head. She fell unconscious to the floor, and all three of them ran out of the bank to the car out front, in which sat a very nervous-looking fourth man, gunning the engine.\n \n Everyone except Miss English ran out after the bandits, to watch.\n \n Things got very fast and very confused then. Two police cars came driving down the block and a half from the precinct house to the bank, and the car with the four robbers in it lurched away from the curb and drove straight down the street toward the police station. The police cars and the getaway car passed one another, with everybody shooting like the ships in pirate movies.\n \n There was so much confusion that it looked as though the bank robbers were going to get away after all. The police cars were aiming the wrong way and, as they'd come down with sirens wailing, there was a clear path behind them.\n \n Then, after the getaway car had gone more than two blocks, it suddenly started jouncing around. It smacked into a parked car and stopped. And all the police went running down there to clap handcuffs on the robbers when they crawled dazedly out of their car.\n \n \"Hey,\" said Eddie Clayhorn, ten years old. \"Hey, that was something, huh, Mom?\"\n \n \"Come along home,\" said his mother, grabbing his hand. \"We don't want to be involved.\"\n \n \n\n \n \"It was the nuttiest thing,\" said Detective-Sergeant Stevenson. \"An operation planned that well, you'd think they'd pay attention to their getaway car, you know what I mean?\"\n \n Detective-Sergeant Pauling shrugged. \"They always slip up,\" he said.\n\"Sooner or later, on some minor detail, they always slip up.\"\n \n \"Yes, but their tires .\"\n \n \"Well,\" said Pauling, \"it was a stolen car. I suppose they just grabbed whatever was handiest.\"\n \n \"What I can't figure out,\" said Stevenson, \"is exactly what made those tires do that. I mean, it was a hot day and all, but it wasn't that hot. And they weren't going that fast. I don't think you could go fast enough to melt your tires down.\"\n \n Pauling shrugged again. \"We got them. That's the important thing.\"\n \n \"Still and all, it's nutty. They're free and clear, barrelling out Rockaway toward the Belt, and all at once their tires melt, the tubes blow out and there they are.\" Stevenson shook his head. \"I can't figure it.\"\n \n \"Don't look a gift horse in the mouth,\" suggested Pauling. \"They picked the wrong car to steal.\"\n \n \"And that doesn't make sense, either,\" said Stevenson. \"Why steal a car that could be identified as easily as that one?\"\n \n \"Why? What was it, a foreign make?\"\n \n \"No, it was a Chevvy, two-tone, three years old, looked just like half the cars on the streets. Except that in the trunk lid the owner had burned in 'The Scorpion' in big black letters you could see half a block away.\"\n \n \"Maybe they didn't notice it when they stole the car,\" said Pauling.\n \n \"For a well-planned operation like this one,\" said Stevenson, \"they made a couple of really idiotic boners. It doesn't make any sense.\"\n \n \"What do they have to say about it?\" Pauling demanded.\n \n \"Nothing, what do you expect? They'll make no statement at all.\"\n \n The squad-room door opened, and a uniformed patrolman stuck his head in. \"The owner of that Chevvy's here,\" he said.\n \n \"Right,\" said Stevenson. He followed the patrolman down the hall to the front desk.\n \n The owner of the Chevvy was an angry-looking man of middle age, tall and paunchy. \"John Hastings,\" he said. \"They say you have my car here.\"\n \n \"I believe so, yes,\" said Stevenson. \"I'm afraid it's in pretty bad shape.\"\n \n \"So I was told over the phone,\" said Hastings grimly. \"I've contacted my insurance company.\"\n \n \"Good. The car's in the police garage, around the corner. If you'd come with me?\"\n \n \n\n \n On the way around, Stevenson said, \"I believe you reported the car stolen almost immediately after it happened.\"\n \n \"That's right,\" said Hastings. \"I stepped into a bar on my route. I'm a wine and liquor salesman. When I came out five minutes later, my car was gone.\"\n \n \"You left the keys in it?\"\n \n \"Well, why not?\" demanded Hastings belligerently. \"If I'm making just a quick stop—I never spend more than five minutes with any one customer—I always leave the keys in the car. Why not?\"\n \n \"The car was stolen,\" Stevenson reminded him.\n \n Hastings grumbled and glared. \"It's always been perfectly safe up till now.\"\n \n \"Yes, sir. In here.\"\n \n Hastings took one look at his car and hit the ceiling. \"It's ruined!\" he cried. \"What did you do to the tires?\"\n \n \"Not a thing, sir. That happened to them in the holdup.\"\n \n Hastings leaned down over one of the front tires. \"Look at that! There's melted rubber all over the rims. Those rims are ruined! What did you use, incendiary bullets?\"\n \n Stevenson shook his head. \"No, sir. When that happened they were two blocks away from the nearest policeman.\"\n \n \"Hmph.\" Hastings moved on around the car, stopping short to exclaim,\n\"What in the name of God is that? You didn't tell me a bunch of kids had stolen the car.\"\n \n \"It wasn't a bunch of kids,\" Stevenson told him. \"It was four professional criminals, I thought you knew that. They were using it in a bank holdup.\"\n \n \"Then why did they do that ?\"\n \n Stevenson followed Hastings' pointing finger, and saw again the crudely-lettered words, \"The Scorpion\" burned black into the paint of the trunk lid. \"I really don't know,\" he said. \"It wasn't there before the car was stolen?\"\n \n \"Of course not!\"\n \n Stevenson frowned. \"Now, why in the world did they do that?\"\n \n \"I suggest,\" said Hastings with heavy sarcasm, \"you ask them that.\"\n \n Stevenson shook his head. \"It wouldn't do any good. They aren't talking about anything. I don't suppose they'll ever tell us.\" He looked at the trunk lid again. \"It's the nuttiest thing,\" he said thoughtfully....\n \n That was on Wednesday.\n \n The Friday afternoon mail delivery to the Daily News brought a crank letter. It was in the crank letter's most obvious form; that is, the address had been clipped, a letter or a word at a time, from a newspaper and glued to the envelope. There was no return address.\n \n The letter itself was in the same format. It was brief and to the point:\n \n Dear Mr. Editor:\n \n The Scorpion has struck. The bank robbers were captured. The Scorpion fights crime. Crooks and robbers are not safe from the avenging Scorpion. WARN YOUR READERS!\n \n \n Sincerely yours, THE SCORPION\n \n The warning was duly noted, and the letter filed in the wastebasket. It didn't rate a line in the paper.\n \n \n\n II\n \n The bank robbery occurred in late June. Early in August, a Brooklyn man went berserk.\n \n It happened in Canarsie, a section in southeast Brooklyn near Jamaica Bay. This particular area of Canarsie was a residential neighborhood, composed of one and two family houses. The man who went berserk was a Motor Vehicle Bureau clerk named Jerome Higgins.\n \n Two days before, he had flunked a Civil Service examination for the third time. He reported himself sick and spent the two days at home, brooding, a bottle of blended whiskey at all times in his hand.\n \n As the police reconstructed it later, Mrs. Higgins had attempted to awaken him on the third morning at seven-thirty, suggesting that he really ought to stop being so foolish, and go back to work. He then allegedly poked her in the eye, and locked her out of the bedroom.\n \n Mrs. Higgins then apparently called her sister-in-law, a Mrs. Thelma Stodbetter, who was Mr. Higgins' sister. Mrs. Stodbetter arrived at the house at nine o'clock, and spent some time tapping at the still-locked bedroom door, apparently requesting Mr. Higgins to unlock the door and\n\"stop acting like a child.\" Neighbors reported to the police that they heard Mr. Higgins shout a number of times, \"Go away! Can't you let a man sleep?\"\n \n At about ten-fifteen, neighbors heard shots from the Higgins residence, a two-story one-family pink stucco affair in the middle of a block of similar homes. Mr. Higgins, it was learned later, had suddenly erupted from his bedroom, brandishing a .30-.30 hunting rifle and, being annoyed at the shrieks of his wife and sister, had fired seven shells at them, killing his wife on the spot and wounding his sister in the hand and shoulder.\n \n Mrs. Stodbetter, wounded and scared out of her wits, raced screaming out the front door of the house, crying for the police and shouting,\n\"Murder! Murder!\" At this point, neighbors called the police. One neighbor additionally phoned three newspapers and two television stations, thereby earning forty dollars in \"news-tips\" rewards.\n \n \n\n \n By chance, a mobile television unit was at that moment on the Belt Parkway, returning from having seen off a prime minister at Idlewild Airport. This unit was at once diverted to Canarsie, where it took up a position across the street from the scene of carnage and went to work with a Zoomar lens.\n \n In the meantime, Mister Higgins had barricaded himself in his house, firing at anything that moved.\n \n The two cameramen in the mobile unit worked their hearts out. One concentrated on the movements of the police and firemen and neighbors and ambulance attendants, while the other used the Zoomar lens to search for Mr. Higgins. He found him occasionally, offering the at-home audience brief glimpses of a stocky balding man in brown trousers and undershirt, stalking from window to window on the second floor of the house.\n \n The show lasted for nearly an hour. There were policemen everywhere, and firemen everywhere, and neighbors milling around down at the corner, where the police had roped the block off, and occasionally Mr. Higgins would stick his rifle out a window and shoot at somebody. The police used loudspeakers to tell Higgins he might as well give up, they had the place surrounded and could eventually starve him out anyway. Higgins used his own good lungs to shout obscenities back and challenge anyone present to hand-to-hand combat.\n \n The police fired tear gas shells at the house, but it was a windy day and all the windows in the Higgins house were either open or broken. Higgins was able to throw all the shells back out of the house again.\n \n The show lasted for nearly an hour. Then it ended, suddenly and dramatically.\n \n Higgins had showed himself to the Zoomar lens again, for the purpose of shooting either the camera or its operator. All at once he yelped and threw the rifle away. The rifle bounced onto the porch roof, slithered down to the edge, hung for a second against the drain, and finally fell barrel first onto the lawn.\n \n Meanwhile, Higgins was running through the house, shouting like a wounded bull. He thundered down the stairs and out, hollering, to fall into the arms of the waiting police.\n \n They had trouble holding him. At first they thought he was actually trying to get away, but then one of them heard what it was he was shouting: \"My hands! My hands!\"\n \n They looked at his hands. The palms and the palm-side of the fingers were red and blistering, from what looked like severe burns. There was another burn on his right cheek and another one on his right shoulder.\n \n Higgins, thoroughly chastened and bewildered, was led away for burn ointment and jail. The television crew went on back to Manhattan. The neighbors went home and telephoned their friends.\n \n On-duty policemen had been called in from practically all of the precincts in Brooklyn. Among them was Detective-Sergeant William Stevenson. Stevenson frowned thoughtfully at Higgins as that unhappy individual was led away, and then strolled over to look at the rifle. He touched the stock, and it was somewhat warm but that was all.\n \n He picked it up and turned it around. There, on the other side of the stock, burned into the wood, were the crudely-shaped letters, \"The Scorpion.\"\n \n \n\n \n You don't get to be Precinct Captain on nothing but political connections. Those help, of course, but you need more than that. As Captain Hanks was fond of pointing out, you needed as well to be both more imaginative than most—\"You gotta be able to second-guess the smart boys\"—and to be a complete realist—\"You gotta have both feet on the ground.\" If these were somewhat contradictory qualities, it was best not to mention the fact to Captain Hanks.\n \n The realist side of the captain's nature was currently at the fore.\n\"Just what are you trying to say, Stevenson?\" he demanded.\n \n \"I'm not sure,\" admitted Stevenson. \"But we've got these two things. First, there's the getaway car from that bank job. The wheels melt for no reason at all, and somebody burns 'The Scorpion' onto the trunk. Then, yesterday, this guy Higgins out in Canarsie. He says the rifle all of a sudden got too hot to hold, and he's got the burn marks to prove it. And there on the rifle stock it is again. 'The Scorpion'.\"\n \n \"He says he put that on there himself,\" said the captain.\n \n Stevenson shook his head. \"His lawyer says he put it on there. Higgins says he doesn't remember doing it. That's half the lawyer's case. He's trying to build up an insanity defense.\"\n \n \"He put it on there himself, Stevenson,\" said the captain with weary patience. \"What are you trying to prove?\"\n \n \"I don't know. All I know is it's the nuttiest thing I ever saw. And what about the getaway car? What about those tires melting?\"\n \n \"They were defective,\" said Hanks promptly.\n \n \"All four of them at once? And what about the thing written on the trunk?\"\n \n \"How do I know?\" demanded the captain. \"Kids put it on before the car was stolen, maybe. Or maybe the hoods did it themselves, who knows? What do they say?\"\n \n \"They say they didn't do it,\" said Stevenson. \"And they say they never saw it before the robbery and they would have noticed it if it'd been there.\"\n \n The captain shook his head. \"I don't get it,\" he admitted. \"What are you trying to prove?\"\n \n \"I guess,\" said Stevenson slowly, thinking it out as he went along, \"I guess I'm trying to prove that somebody melted those tires, and made that rifle too hot, and left his signature behind.\"\n \n \"What? You mean like in the comic books? Come on, Stevenson! What are you trying to hand me?\"\n \n \"All I know,\" insisted Stevenson, \"is what I see.\"\n \n \"And all I know,\" the captain told him, \"is Higgins put that name on his rifle himself. He says so.\"\n \n \"And what made it so hot?\"\n \n \"Hell, man, he'd been firing that thing at people for an hour! What do you think made it hot?\"\n \n \"All of a sudden?\"\n \n \"He noticed it all of a sudden, when it started to burn him.\"\n \n \"How come the same name showed up each time, then?\" Stevenson asked desperately.\n \n \"How should I know? And why not, anyway? You know as well as I do these things happen. A bunch of teen-agers burgle a liquor store and they write 'The Golden Avengers' on the plate glass in lipstick. It happens all the time. Why not 'The Scorpion'? It couldn't occur to two people?\"\n \n \"But there's no explanation—\" started Stevenson.\n \n \"What do you mean, there's no explanation? I just gave you the explanation. Look, Stevenson, I'm a busy man. You got a nutty idea—like Wilcox a few years ago, remember him? Got the idea there was a fiend around loose, stuffing all those kids into abandoned refrigerators to starve. He went around trying to prove it, and getting all upset, and pretty soon they had to put him away in the nut hatch. Remember?\"\n \n \"I remember,\" said Stevenson.\n \n \"Forget this silly stuff, Stevenson,\" the captain advised him.\n \n \"Yes, sir,\" said Stevenson....\n \n The day after Jerome Higgins went berserk, the afternoon mail brought a crank letter to the Daily News :\n \n Dear Mr. Editor,\n \n You did not warn your readers. The man who shot all those people could not escape the Scorpion. The Scorpion fights crime. No criminal is safe from the Scorpion. WARN YOUR READERS.\n \n \n Sincerely yours, THE SCORPION\n \n Unfortunately, this letter was not read by the same individual who had seen the first one, two months before. At any rate, it was filed in the same place, and forgotten.\n \n \n\n III\n \n Hallowe'en is a good time for a rumble. There's too many kids around for the cops to keep track of all of them, and if you're picked up carrying a knife or a length of tire chain or something, why, you're on your way to a Hallowe'en party and you're in costume. You're going as a JD.\n \n The problem was this schoolyard. It was a block wide, with entrances on two streets. The street on the north was Challenger territory, and the street on the south was Scarlet Raider territory, and both sides claimed the schoolyard. There had been a few skirmishes, a few guys from both gangs had been jumped and knocked around a little, but that had been all. Finally, the War Lords from the two gangs had met, and determined that the matter could only be settled in a war.\n \n The time was chosen: Hallowe'en. The place was chosen: the schoolyard. The weapons were chosen: pocket knives and tire chains okay, but no pistols or zip-guns. The time was fixed: eleven P.M. And the winner would have undisputed territorial rights to the schoolyard, both entrances.\n \n The night of the rumble, the gangs assembled in their separate clubrooms for last-minute instructions. Debs were sent out to play chicken at the intersections nearest the schoolyard, both to warn of the approach of cops and to keep out any non-combatant kids who might come wandering through.\n \n Judy Canzanetti was a Deb with the Scarlet Raiders. She was fifteen years old, short and black-haired and pretty in a movie-magazine, gum-chewing sort of way. She was proud of being in the Auxiliary of the Scarlet Raiders, and proud also of the job that had been assigned to her. She was to stand chicken on the southwest corner of the street.\n \n Judy took up her position at five minutes to eleven. The streets were dark and quiet. Few people cared to walk this neighborhood after dark, particularly on Hallowe'en. Judy leaned her back against the telephone pole on the corner, stuck her hands in the pockets of her Scarlet Raider jacket and waited.\n \n At eleven o'clock, she heard indistinct noises begin behind her. The rumble had started.\n \n At five after eleven, a bunch of little kids came wandering down the street. They were all about ten or eleven years old, and most of them carried trick-or-treat shopping bags. Some of them had Hallowe'en masks on.\n \n They started to make the turn toward the schoolyard. Judy said, \"Hey, you kids. Take off.\"\n \n One of them, wearing a red mask, turned to look at her. \"Who, us?\"\n \n \"Yes, you! Stay out of that street. Go on down that way.\"\n \n \"The subway's this way,\" objected the kid in the red mask.\n \n \"Who cares? You go around the other way.\"\n \n \n\n \n \"Listen, lady,\" said the kid in the red mask, aggrieved, \"we got a long way to go to get home.\"\n \n \"Yeah,\" said another kid, in a black mask, \"and we're late as it is.\"\n \n \"I couldn't care less,\" Judy told them callously. \"You can't go down that street.\"\n \n \"Why not?\" demanded yet another kid. This one was in the most complete and elaborate costume of them all, black leotards and a yellow shirt and a flowing: black cape. He wore a black and gold mask and had a black knit cap jammed down tight onto his head. \"Why can't we go down there?\" this apparition demanded.\n \n \"Because I said so,\" Judy told him. \"Now, you kids get away from here. Take off.\"\n \n \"Hey!\" cried the kid in the black-and-yellow costume. \"Hey, they're fighting down there!\"\n \n \"It's a rumble,\" said Judy proudly. \"You twerps don't want to be involved.\"\n \n \"Hey!\" cried the kid in the black-and-yellow costume again. And he went running around Judy and dashing off down the street.\n \n \"Hey, Eddie!\" shouted one of the other kids. \"Eddie, come back!\"\n \n Judy wasn't sure what to do next. If she abandoned her post to chase the one kid who'd gotten through, then maybe all the rest of them would come running along after her. She didn't know what to do.\n \n A sudden siren and a distant flashing red light solved her problems.\n\"Cheez,\" said one of the kids. \"The cops!\"\n \n \"Fuzz!\" screamed Judy. She turned and raced down the block toward the schoolyard, shouting, \"Fuzz! Fuzz! Clear out, it's the fuzz!\"\n \n But then she stopped, wide-eyed, when she saw what was going on in the schoolyard.\n \n The guys from both gangs were dancing. They were jumping around, waving their arms, throwing their weapons away. Then they all started pulling off their gang jackets and throwing them away, whooping and hollering. They were making such a racket themselves that they never heard Judy's warning. They didn't even hear the police sirens. And all at once both schoolyard entrances were full of cops, a cop had tight hold of Judy and the rumble was over.\n \n \n\n \n Judy was so baffled and terrified that everything was just one great big blur. But in the middle of it all, she did see the little kid in the yellow-and-black costume go scooting away down the street.\n \n And she had the craziest idea that it was all his fault.\n \n \n\n \n Captain Hanks was still in his realistic cycle this morning, and he was impatient as well. \"All right, Stevenson,\" he said. \"Make it fast, I've got a lot to do this morning. And I hope it isn't this comic-book thing of yours again.\"\n \n \"I'm afraid it is, Captain,\" said Stevenson. \"Did you see the morning paper?\"\n \n \"So what?\"\n \n \"Did you see that thing about the gang fight up in Manhattan?\"\n \n Captain Hanks sighed. \"Stevenson,\" he said wearily, \"are you going to try to connect every single time the word 'scorpion' comes up? What's the problem with this one? These kid gangs have names, so what?\"\n \n \"Neither one of them was called 'The Scorpions,'\" Stevenson told him. \"One of them was the Scarlet Raiders and the other gang was the Challengers.\"\n \n \"So they changed their name,\" said Hanks.\n \n \"Both gangs? Simultaneously? To the same name?\"\n \n \"Why not? Maybe that's what they were fighting over.\"\n \n \"It was a territorial war,\" Stevenson reminded him. \"They've admitted that much. It says so in the paper. And it also says they all deny ever seeing that word on their jackets until after the fight.\"\n \n \"A bunch of juvenile delinquents,\" said Hanks in disgust. \"You take their word?\"\n \n \"Captain, did you read the article in the paper?\"\n \n \"I glanced through it.\"\n \n \"All right. Here's what they say happened: They say they started fighting at eleven o'clock. And they just got going when all at once all the metal they were carrying—knives and tire chains and coins and belt buckles and everything else—got freezing cold, too cold to touch. And then their leather jackets got freezing cold, so cold they had to pull them off and throw them away. And when the jackets were later collected, across the name of the gang on the back of each one had been branded 'The Scorpion.'\"\n \n \"Now, let me tell you something,\" said Hanks severely. \"They heard the police sirens, and they threw all their weapons away. Then they threw their jackets away, to try to make believe they hadn't been part of the gang that had been fighting. But they were caught before they could get out of the schoolyard. If the squad cars had showed up a minute later, the schoolyard wouldn't have had anything in it but weapons and jackets, and the kids would have been all over the neighborhood, nice as you please, minding their own business and not bothering anybody. That's what happened. And all this talk about freezing cold and branding names into jackets is just some smart-alec punk's idea of a way to razz the police. Now, you just go back to worrying about what's happening in this precinct and forget about kid gangs up in Manhattan and comic book things like the Scorpion, or you're going to wind up like Wilcox, with that refrigerator business. Now, I don't want to hear any more about this nonsense, Stevenson.\"\n \n \"Yes, sir,\" said Stevenson.",
      "metadata": {
        "title": "Call Him Nemesis",
        "author": "Donald E. Westlake",
        "passage_id": "61090",
        "uid": "12d5d378cd2c491bb92252c61e7ffdb1",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "101",
                "uid": "0918340a3d5b4c4ab394b2b3a512fafa",
                "response_text": "The story opens up on a bank robbery. Three men, wearing identical outfits and masks, walk in and threaten the citizens in the bank, raising a weapon. As the men are taking money from behind the counter, a woman, Miss English, makes a run for the door. She is shot at but missed, caught by one of the men at the door, and another citizen, Mr. Anderson, manages to escape and call for help. The men flee the bank and hop into a stolen car, just missing the incoming police. As the men get away, the car suddenly malfunctions and crashes into another car, and they are eventually caught by the police. Detective Stevenson discusses the incident with Detective Pauling, and he is perplexed by how the tires of the stolen car seemed to melt instantly, and how the words \"The Scorpion\" were branded into the car. The owner of the stolen car, John Hastings, arrives, and he confirms that the words were not on the car before it was stolen. Two days later, the Daily News receives a crank letter, addressed from \"The Scorpion\" and explaining that he fights crime, threatening criminals. The letter was not published. About a month after the robbery, another incident occurs in Brooklyn, where Jerome Higgins murders his wife and injures his sister after spending days in his bedroom. Police and cameramen arrive at his home, where a standoff occurs for an hour before Higgins suddenly throws his rifle and runs outside, his hands burned severely. Stevenson finds the rifle and sees \"The Scorpion\" burned into the side of it. Stevenson goes to Captain Hanks, questioning the similarities between the two events, and Hanks dismisses his conspiracies. The Daily Mail receives another letter, but still does not publish it. On Halloween, two gangs, the Challengers and the Scarlet Raiders, plan a rumble over territory. Judy Canzanetti is a lookout for the Scarlet Raiders, and she is guarding the street when a group of children approach her. Judy warns them to leave, but one of the children goes around her and runs down the street. Suddenly, the police arrive, and Judy warns the gang, but then sees them jumping around and throwing their weapons and jackets. Again, the words \"The Scorpion\" are found on the jackets of both gangs. Stevenson brings this up to Hanks again, but he denies it and tells him to stop bringing the theory up."
              },
              {
                "worker_id": "106",
                "uid": "4c6f633c44ee4565925589e76b394d3e",
                "response_text": "The story begins in a bank. It is under control of three bank robbers, who have taken nine other people in the bank hostage. One man escapes out the door, shouting for help. The robbers quickly run outside to meet their getaway driver, where they speed off. They are followed by police. The getaway car reaches ahead until the car crashes, and the police clap handcuffs on the robbers, taking them to the station. \nBack in the station Detective-Sergeant Stevenson discusses with his colleague what happened. The tires of the getaway car seemed to have melted. The car was normal, apart from the words \"the scorpion\", burned in big black letters on the trunk lid. They meet the owner of the stolen car at the station, who tells them that he never put that sign on the car. That was on Wednesday. On Friday, the Daily News is sent a crank letter from someone signed \"the scorpion\" who tells the paper to warn their readers that \"the scorpion fights crime\" and that criminals are not safe.\nJerome Higgins, a man from Brooklyn goes crazy and kills his wife and injures his sister with a gun. Both neighbours and police surround the house after his sister Mrs.Strober escapes the house. inside, Higgins goes ballistic, shooting at random. That is until Higgins runs out of the house, his hands and shoulder having severe burns. He is taken to get his wounds treated, and then to jail. On the gun, it is burned into the wood \"The Scorpion\". \nThe Sergeant and his Captain discuss these cases. Stevenson thinks that they must be connected, but the Captain tells Stevenson to stop looking into this fantasy, as they have nothing in common, and it's a mere coincidence. The Daily News received another letter of warning that was never published. \nIt is Halloween night. The gangs \"The Challengers\" and \"The Scarlet Raiders\" are getting ready for a fight. The two leaders of the gang have agreed to a knife fight over a schoolyard for territory. Judy Canzanetti is sent out by the Scarlet Raiders as a lookout for any kids or cops going by. She sees a group of kids, who she tries to divert, but when one of them escapes and runs in the direction of the fight, she is caught off guard. That is until she hears sirens, and goes to warn the gang. Before she gets there though, all the members of the two gangs jump around, throwing their weapons on the ground and taking off their jackets. It is explained later on by Steavenson that their weapons all of a sudden became freezing cold, as did their jackets, with \"the scorpion\" burned into the backs of them. The captain once again tells Stevenson to let this \"nonsense\" go, and it's nothing more than a coincidence. "
              },
              {
                "worker_id": "107",
                "uid": "9db353c0e87e453a83f419f3df149006",
                "response_text": "The story starts with a bank robbery in late June. There are twelve people in the bank when it is robbed. The three robbers, who look like triplets, all wear the same outfits. One man draws a pistol while the other one takes the guard's pistol, Mr. Anderson. The last one takes a black satchel bag and fills it with money. Then, they join the fourth robber in a stolen car while the police chase them. It seems that they will get away, but the tires melt, which gives the police the opportunity to apprehend them. On Wednesday, Detective-Sergeant Stevenson finds it very strange, but Detective-Sergeant Pauling tells him it is common for plans to have these flaws. Stevenson mentions that the car has 'The Scorpion' burned into it just as the owner arrives. John Hastings says that he reported his car as soon as it was stolen. Stevenson is surprised that he would leave his keys in it, but Hastings says it is usually safe for him because he is a wine and liquor salesman. Hastings is angry at the police for melting his tires, but Stevenson says the police had no part in that. Both of them are confused by the writing on the car since it was not there before. On Friday, the Daily News receives a letter from The Scorpion that warns the readers of the paper because it fights crime. However, the letter is ignored and filed into the wastebasket instead. The second incident happens in early August when a Brooklyn man named Jerome Higgins goes berserk after failing a Civil Service exam for the third time. The crime is in Canarsie, in southeast Brooklyn near Jamaica Bay. Mrs. Higgins and his sister, Mrs. Thelma Stodbetter, try to wake him up; Mister Higgins kills his wife and injures his sister with a hunting rifle. He then goes on a rampage, barricading himself in the house and shooting at anything that moves. Policemen, firemen, neighbors, ambulance attendants, and even two cameramen from the mobile unit are present. After one hour, Higgins plans to shoot at the camera, but he suddenly throws his rifle away. He then complains about his hands, which are severely burned, and Stevenson finds the words 'The Scorpion' present again. Precinct Captain Hanks tells him that his idea of an external force fighting crime out there is silly, while the Daily News receives a second letter from The Scorpion. The third case details a Hallowe'en rumble in a schoolyard. Judy Canzanetti is made to stand chicken, and she tells a group of kids in Hallowe'en masks to stay away from the schoolyard. The kid named Eddie dashes down the street, and the cops soon appear after. Stevenson tries to bring up how strange it is for both gangs to have 'The Scorpion' on their jackets when the conflict was a territorial war. Hanks refutes his points and tells him to stop worrying about any Scorpion nonsense."
              },
              {
                "worker_id": "105",
                "uid": "b8a27c98c4ed4570b33a89dcaf95fc9c",
                "response_text": "A bank is being robbed by three similar looking men. Picking a moment, one of the hostages, Miss English, rushes out, but she is stopped, while another captive, Mr. Anderson, manages to escape and call the police. The robbers hit Miss English into unconsciousness and run away. Police cars come and go in the wrong way, but surprisingly manage to capture the robbers after all. The stupid mistake of the robbers seems suspicious as the car's tires melted for no reason and the stolen car was very noticeable with \"The Scorpion\" written in the back. When the car owner comes, he is very angry and upset, and he mentions the inscription wasn't there before the robbery. Soon, a letter from \"The Scorpion\" is received by a newspaper, saying that the sender will keep fighting crime. About one month later, a clerk murders his wife from a rifle after going berserk. This man, Mr. Higgins, barricades himself at home and fires outside in defense, while his sister runs to the police and the neighbors call. After an hour of no success in arresting the man, he runs out himself with his hands being terribly burnt. The same detective who led the first case, Stevenson, comes to the scene, and sees an engraving \"The Scorpion\" on the rifle. Higgins' lawyer claims the inscription was put by his client, while the least denies it, which the lawyer uses to proclaim him insane. Stevenson holds on to someone else making those inscriptions while Captain Hanks denies the version. Stevenson keeps posing questions making the case strange, but Hanks tries to close the case with explaining everything as primitively as possible. Hanks orders Stevenson to forget his ideas of someone pretending to be a superhero and even threatens him reminding about a precedent. Another warning letter to the readers comes from \"The Scorpion\" to the newspaper, but it's not printed again. Another story takes place on Halloween, two gangs meet to fight for a school yard with knifes and chains. A fifteen year old girl Judy stands chicken on the corner during the fight and sees a bunch of kids heading home, she says them to go another way, but one kid sees the rumble and rushes there. Suddenly the cops come and the gangs do not hear Judy's warning, everyone is arrested. \"The Scorpion\" appears on the participants' jackets after the fight. Turns out the fight didn't happen as all the metallic weapons and leather jackets suddenly got extremely cold to hold. Hanks again finds an explanation - the kids threw all of these away not tore arrested. He again tells Stevenson to stop with this nonsense from the superhero books. "
              }
            ]
          },
          {
            "question_text": "What pattern does Stevenson notice in the crimes that makes him suspicious?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "101",
                "uid": "0918340a3d5b4c4ab394b2b3a512fafa",
                "response_text": "In all three incidents that take place in the story, the criminals were stopped and caught by the police. They all seemed to be mysteriously burned in one way or another: the tires on the car melted off, Higgins' hands were burned by the rifle, and the jackets and weapons of the gang members seemed to have the same effect. Additionally, all three events were tagged by \"The Scorpion\": the words were branded on the car, the rifle, and the jackets."
              },
              {
                "worker_id": "106",
                "uid": "4c6f633c44ee4565925589e76b394d3e",
                "response_text": "There is a very odd pattern that Stevenson notices in the crimes that makes him suspicious. In all the crimes mentioned in the story, there has been the words \"The Scorpion\" left behind on some piece of evidence relating to the crime by an unknown source. There is also the connection of heat in all three cases. In the bank robbery case, the tires melt without explanation, and \"the scorpion\" is burned onto the outside of the car. \nIn the murder case, the gun which Mr Higgins holds burns his hands and his shoulder, and the words are left burned into the wooden part of the gun. \nIn the incident involving the two gangs, their weapons and jackets become increasingly cold, up to the point where they can no longer touch them. The words \"the scorpion\" and imprinted on the back of their jackets. "
              },
              {
                "worker_id": "107",
                "uid": "9db353c0e87e453a83f419f3df149006",
                "response_text": "Stevenson notices that shortly after all of the criminals are arrested, the mark of ‘The Scorpion’ is left behind. In the bank robbery, the writing is burned into the lid of the car. In the Brooklyn rampage incident, it is burned onto the wood stock of Mister Higgin’s hunting rifle. In the schoolyard incident, the word is written on the back of all the jackets of the two gangs. These patterns make him suspicious because although there is no evidence of any external interference, the word appears whenever the criminals’ plans have been thwarted and the police have arrived. The words also do not seem to be written by the criminals themselves either. \n"
              },
              {
                "worker_id": "105",
                "uid": "b8a27c98c4ed4570b33a89dcaf95fc9c",
                "response_text": "Each crime is very different - a bank robbery, a domestic murder and a kids gangs fight. Nevertheless, they bare linked with an inscription \"The Scorpion\" appearing on some attributes and weird things preventing the crimes. First, well-organized robbers make a stupid mistake of picking a noticeable car and their tires burn for no cause, then a rifle gets hot all of a sudden and burns the hands holding it. In the end, weapons and jackets become impossible to hold as they are extremely cold. Thus, the thee crimes are stopped. And the same inscription is told by everyone not to have been there before. "
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "101",
                "uid": "0918340a3d5b4c4ab394b2b3a512fafa",
                "response_text": "The story takes place in New York City. The first scene takes place in a bank, where a police station is a few blocks away. The second crime takes place in Canarsie, a part of Brooklyn, at the home of Jerome Higgins, which is located in a residential neighborhood. The third crime takes place on Halloween in Manhattan, this time in a schoolyard, a neutral territory up for grabs between the Scarlet Raiders and the Challengers."
              },
              {
                "worker_id": "106",
                "uid": "4c6f633c44ee4565925589e76b394d3e",
                "response_text": "There are multiple settings in this story. The first part of this story is set in a bank, where the hostages are ousted against the back wall. That is until the action is taken out onto the street, where a high speed car chase and shootout take place between the police and the perpetrators. \nIn the next part of the story, we see the precaint. Detective Stevenson takes the Chevy owner to the police garage around the corner. \nAfter this, the story moves to Southeast Brooklyn, to the home of Jerome Higgins, who after locking himself in his bedroom, shot his wife and sister, injuring one and killing the other. The house is surrounded on the street by neighbours and police. \nIn the final setting of the story, we see a schoolyard, which the Challengers and Scarlet Raiders are fighting for the right to control over. The rumble takes place on Halloween night. "
              },
              {
                "worker_id": "107",
                "uid": "9db353c0e87e453a83f419f3df149006",
                "response_text": "The bank has a desk for Mr. Featherhall and gilded teller cages in the first crime. Mr. Featherhall leads everybody to the back wall when the bank is being robbed. There is also a brass plate on his desk. Outside, a precinct house is a block and a half from the bank. There is also a police station down the street that the robbers drive towards. The car that the criminals steal is a two-tone Chevvy that looks like half the cars on the streets. At the precinct house, there is a squadroom and a front desk connected by a hallway. \n\nThe second crime is located in Canarsie, a section in southeast Brooklyn located near Jamaica Bay. The residential area is primarily composed of one or two family houses. The Higgins house is described to have a bedroom with a door that locks. The mobile unit arrives from Belt Parkway during the incident after seeing the prime minister off at Idlewild airport. \n\nThe final incident is located in a schoolyard. The schoolyard is a block wide, with entrances on two streets. The Challenger gang claims the street on the North as their territory, while the Scarlet Raider gang claims the street on the south as theirs. Both sides also have claims on the schoolyard. \n"
              },
              {
                "worker_id": "105",
                "uid": "b8a27c98c4ed4570b33a89dcaf95fc9c",
                "response_text": "The story begins in a bank being robbed by three men dressed in the same way and holding hostages. They run away in a stolen car, which is very typical for the city, but has a noticeable inscription \"The Scorpion\" in the back. In the police department the robbery is discussed, the car owner comes and they go to the police garage to look at his car. Another crime takes place in Higgins' apartment, where a man. killed his wife and barricaded himself. The police is outside, the windows are open and the man shoots everyone from there. Suddenly, he gives in with his hands burning. He is taken to the police. There a dialogue between Hanks and Stevenson takes place. The third scene is on a school yard during Halloween, two gangs are fighting, a girl stands chicken. The police comes and manages to. arrest everyone. "
              }
            ]
          },
          {
            "question_text": "What is the relationship between Stevenson and Hanks?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "101",
                "uid": "0918340a3d5b4c4ab394b2b3a512fafa",
                "response_text": "Stevenson and Hanks have a tense relationship. Though they are both in high positions at the police precinct, Hanks is the Captain, Stevenson's superior. This power dynamic is evident throughout the story, particularly when Stevenson tries to bring up his theories and suspicions about The Scorpion. Instead of hearing him out, Hanks refuses to listen, becoming increasingly frustrated and calling Stevenson's thoughts childlike nonsense. Despite this, Stevenson is still determined to get his idea through to Hanks."
              },
              {
                "worker_id": "106",
                "uid": "4c6f633c44ee4565925589e76b394d3e",
                "response_text": "There are multiple settings in this story. The first part of this story is set in a bank, where the hostages are ousted against the back wall. That is until the action is taken out onto the street, where a high speed car chase and shootout take place between the police and the perpetrators. \nIn the next part of the story, we see the precaint. Detective Steavenson takes the Chevy owner to the police garage around the corner. \nAfter this, the story moves to Southeast Brooklyn, to the home of Jerome Higgins, who after locking himself in his bedroom, shot his wife and sister, injuring one and killing the other. The house is surrounded on the street by neighbours and police. \nIn the final setting of the story, we see a schoolyard, which the Challengers and Scarlet Raiders are fighting for the right to control over. The rumble takes place on Halloween night. "
              },
              {
                "worker_id": "107",
                "uid": "9db353c0e87e453a83f419f3df149006",
                "response_text": "Hanks is the Precinct Captain, while Stevenson works under him as a Detective-Sergeant. Hanks and Stevenson share a good working relationship; however, Hank gets annoyed whenever Stevenson brings up his theories about “The Scorpion” and thinks of them as nonsense. He refutes every point realistically, saying that Higgins burned the words onto the rifle himself. When Stevenson brings up the earlier robbery incident, Hanks refuses to accept those observations and says Stevenson’s points are similar to that of a comic book. During the schoolyard incident, Hank is extremely annoyed at Stevenson trying to connect more points to ‘The Scorpion’ and tells him that the children just had a silly brawl. He also warns Stevenson to stop thinking about these foolish ideas and return to doing his job in the precinct. \n\n"
              },
              {
                "worker_id": "105",
                "uid": "b8a27c98c4ed4570b33a89dcaf95fc9c",
                "response_text": "Stevenson and Hanks are both important people in the police with years of experience. They have completely different views on the described crimes. Stevenson wants to check every possibility, something doesn't adds up for him and he wants to keep investigating. He is determined to find out the truth and he is passionate about it, he is also emotional in proving his point and thinks a lot about the cases. Hanks simply wants to close the cases as fast as possible and Stevenson's guesses irritate him. He is not interested in other possibilities and has rather realistic explanations. He uses his position and authority to threaten Stevenson into shutting up and stopping irritated Hanks."
              }
            ]
          },
          {
            "question_text": "Who is \"The Scorpion\" and why are they significant?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "101",
                "uid": "0918340a3d5b4c4ab394b2b3a512fafa",
                "response_text": "The Scorpion is a mysterious figure, self-proclaimed to be fighting crime, as stated in the crank letters to the Daily Mail. The true identity of The Scorpion is unknown, and no one has ever seen him. However, The Scorpion is a powerful force in the story, as he ends up being responsible for the capturing of several criminals. The Scorpion makes his presence known by tagging his signature at different crime scenes through branding, but the characters in the story, especially Stevenson, are determined to know who he is."
              },
              {
                "worker_id": "106",
                "uid": "4c6f633c44ee4565925589e76b394d3e",
                "response_text": "The Scorpion is an unknown vigilante, who seeks to fight crime, with some mysterious super power. They send messages to the daily news, asking them to warn their readers that they will be after any criminals. It seems as though whoever they are, they have the ability to control heat in objects. They melt the tires of the Chevy, they heat the gun to such an intense level that it burns Mr. Higgins' hands, and they cool the weapons and jackets of the two hangs so much that they have to get rid of both. Detective Stevenson thinks that the scorpion is all the same force, affecting these three cases, but his boss, Captain Hanks, doesn't see one. \n"
              },
              {
                "worker_id": "107",
                "uid": "9db353c0e87e453a83f419f3df149006",
                "response_text": "“The Scorpion” is an anonymous bringer of justice. Their identity is never revealed, but they send warning letters to the Daily News explaining their intentions of stopping crime and helping the police arrest the criminals to bring justice. They are significant because the crimes could have gotten out of hand without them. In the first case, it looked as though the robbers would get away, but “The Scorpion” managed to stop them in time for the police to come. They can also help stop crime a lot faster than the police. Furthermore, “The Scorpion” also becomes an object of interest for Stevenson and leads him to start following these patterns. \n"
              },
              {
                "worker_id": "105",
                "uid": "b8a27c98c4ed4570b33a89dcaf95fc9c",
                "response_text": "\"The Scorpion\"'s identity is not exposed. It is a person or an organization which decided to take the mission of fighting crime. He is like a modern superhero dealing with any kind of crime. He stops the criminals and makes them surrender to the police. After every intervention he leaves an inscription saying \"The Scorpion\" as a mark of his intervention. He also sends letters to a newspaper warning people about his existence. He is significant as he is connected to every crime described and stays the main mystery of the story, being also the reason of disputes between Hanks and Stevenson."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4666,
        "document_length_chars": 27096
      }
    }
  ]
}