{
  "item_metadata": {
    "item_id": "61097",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61097",
      "content": "THE FROZEN PLANET\n \n\n By Keith Laumer\n \n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, September 1961. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n \"It is rather unusual,\" Magnan said, \"to assign an officer of your rank to courier duty, but this is an unusual mission.\"\n \n Retief sat relaxed and said nothing. Just before the silence grew awkward, Magnan went on.\n \n \"There are four planets in the group,\" he said. \"Two double planets, all rather close to an unimportant star listed as DRI-G 33987. They're called Jorgensen's Worlds, and in themselves are of no importance whatever. However, they lie deep in the sector into which the Soetti have been penetrating.\n \n \"Now—\" Magnan leaned forward and lowered his voice—\"we have learned that the Soetti plan a bold step forward. Since they've met no opposition so far in their infiltration of Terrestrial space, they intend to seize Jorgensen's Worlds by force.\"\n \n Magnan leaned back, waiting for Retief's reaction. Retief drew carefully on his cigar and looked at Magnan. Magnan frowned.\n \n \"This is open aggression, Retief,\" he said, \"in case I haven't made myself clear. Aggression on Terrestrial-occupied territory by an alien species. Obviously, we can't allow it.\"\n \n Magnan drew a large folder from his desk.\n \n \"A show of resistance at this point is necessary. Unfortunately, Jorgensen's Worlds are technologically undeveloped areas. They're farmers or traders. Their industry is limited to a minor role in their economy—enough to support the merchant fleet, no more. The war potential, by conventional standards, is nil.\"\n \n Magnan tapped the folder before him.\n \n \"I have here,\" he said solemnly, \"information which will change that picture completely.\" He leaned back and blinked at Retief.\n \n \n\n \n \"All right, Mr. Councillor,\" Retief said. \"I'll play along; what's in the folder?\"\n \n Magnan spread his fingers, folded one down.\n \n \"First,\" he said. \"The Soetti War Plan—in detail. We were fortunate enough to make contact with a defector from a party of renegade Terrestrials who've been advising the Soetti.\" He folded another finger. \"Next, a battle plan for the Jorgensen's people, worked out by the Theory group.\" He wrestled a third finger down. \"Lastly; an Utter Top Secret schematic for conversion of a standard anti-acceleration field into a potent weapon—a development our systems people have been holding in reserve for just such a situation.\"\n \n \"Is that all?\" Retief said. \"You've still got two fingers sticking up.\"\n \n Magnan looked at the fingers and put them away.\n \n \"This is no occasion for flippancy, Retief. In the wrong hands, this information could be catastrophic. You'll memorize it before you leave this building.\"\n \n \"I'll carry it, sealed,\" Retief said. \"That way nobody can sweat it out of me.\"\n \n Magnan started to shake his head.\n \n \"Well,\" he said. \"If it's trapped for destruction, I suppose—\"\n \n \"I've heard of these Jorgensen's Worlds,\" Retief said. \"I remember an agent, a big blond fellow, very quick on the uptake. A wizard with cards and dice. Never played for money, though.\"\n \n \"Umm,\" Magnan said. \"Don't make the error of personalizing this situation, Retief. Overall policy calls for a defense of these backwater worlds. Otherwise the Corps would allow history to follow its natural course, as always.\"\n \n \"When does this attack happen?\"\n \n \"Less than four weeks.\"\n \n \"That doesn't leave me much time.\"\n \n \"I have your itinerary here. Your accommodations are clear as far as Aldo Cerise. You'll have to rely on your ingenuity to get you the rest of the way.\"\n \n \"That's a pretty rough trip, Mr. Councillor. Suppose I don't make it?\"\n \n Magnan looked sour. \"Someone at a policy-making level has chosen to put all our eggs in one basket, Retief. I hope their confidence in you is not misplaced.\"\n \n \"This antiac conversion; how long does it take?\"\n \n \"A skilled electronics crew can do the job in a matter of minutes. The Jorgensens can handle it very nicely; every other man is a mechanic of some sort.\"\n \n Retief opened the envelope Magnan handed him and looked at the tickets inside.\n \n \"Less than four hours to departure time,\" he said. \"I'd better not start any long books.\"\n \n \"You'd better waste no time getting over to Indoctrination,\" Magnan said.\n \n Retief stood up. \"If I hurry, maybe I can catch the cartoon.\"\n \n \"The allusion escapes me,\" Magnan said coldly. \"And one last word. The Soetti are patrolling the trade lanes into Jorgensen's Worlds; don't get yourself interned.\"\n \n \"I'll tell you what,\" Retief said soberly. \"In a pinch, I'll mention your name.\"\n \n \"You'll be traveling with Class X credentials,\" Magnan snapped. \"There must be nothing to connect you with the Corps.\"\n \n \"They'll never guess,\" Retief said. \"I'll pose as a gentleman.\"\n \n \"You'd better be getting started,\" Magnan said, shuffling papers.\n \n \"You're right,\" Retief said. \"If I work at it, I might manage a snootful by takeoff.\" He went to the door. \"No objection to my checking out a needler, is there?\"\n \n Magnan looked up. \"I suppose not. What do you want with it?\"\n \n \"Just a feeling I've got.\"\n \n \"Please yourself.\"\n \n \"Some day,\" Retief said, \"I may take you up on that.\"\n \n \n\n II\n \n Retief put down the heavy travel-battered suitcase and leaned on the counter, studying the schedules chalked on the board under the legend\n\"ALDO CERISE—INTERPLANETARY.\" A thin clerk in a faded sequined blouse and a plastic snakeskin cummerbund groomed his fingernails, watching Retief from the corner of his eye.\n \n Retief glanced at him.\n \n The clerk nipped off a ragged corner with rabbitlike front teeth and spat it on the floor.\n \n \"Was there something?\" he said.\n \n \"Two twenty-eight, due out today for the Jorgensen group,\" Retief said.\n\"Is it on schedule?\"\n \n The clerk sampled the inside of his right cheek, eyed Retief. \"Filled up. Try again in a couple of weeks.\"\n \n \"What time does it leave?\"\n \n \"I don't think—\"\n \n \"Let's stick to facts,\" Retief said. \"Don't try to think. What time is it due out?\"\n \n The clerk smiled pityingly. \"It's my lunch hour,\" he said. \"I'll be open in an hour.\" He held up a thumb nail, frowned at it.\n \n \"If I have to come around this counter,\" Retief said, \"I'll feed that thumb to you the hard way.\"\n \n The clerk looked up and opened his mouth. Then he caught Retief's eye, closed his mouth and swallowed.\n \n \"Like it says there,\" he said, jerking a thumb at the board. \"Lifts in an hour. But you won't be on it,\" he added.\n \n Retief looked at him.\n \n \"Some ... ah ... VIP's required accommodation,\" he said. He hooked a finger inside the sequined collar. \"All tourist reservations were canceled. You'll have to try to get space on the Four-Planet Line ship next—\"\n \n \"Which gate?\" Retief said.\n \n \"For ... ah...?\"\n \n \"For the two twenty-eight for Jorgensen's Worlds,\" Retief said.\n \n \"Well,\" the clerk said. \"Gate 19,\" he added quickly. \"But—\"\n \n Retief picked up his suitcase and walked away toward the glare sign reading To Gates 16-30 .\n \n \"Another smart alec,\" the clerk said behind him.\n \n \n\n \n Retief followed the signs, threaded his way through crowds, found a covered ramp with the number 228 posted over it. A heavy-shouldered man with a scarred jawline and small eyes was slouching there in a rumpled gray uniform. He put out a hand as Retief started past him.\n \n \"Lessee your boarding pass,\" he muttered.\n \n Retief pulled a paper from an inside pocket, handed it over.\n \n The guard blinked at it.\n \n \"Whassat?\"\n \n \"A gram confirming my space,\" Retief said. \"Your boy on the counter says he's out to lunch.\"\n \n The guard crumpled the gram, dropped it on the floor and lounged back against the handrail.\n \n \"On your way, bub,\" he said.\n \n Retief put his suitcase carefully on the floor, took a step and drove a right into the guard's midriff. He stepped aside as the man doubled and went to his knees.\n \n \"You were wide open, ugly. I couldn't resist. Tell your boss I sneaked past while you were resting your eyes.\" He picked up his bag, stepped over the man and went up the gangway into the ship.\n \n A cabin boy in stained whites came along the corridor.\n \n \"Which way to cabin fifty-seven, son?\" Retief asked.\n \n \"Up there.\" The boy jerked his head and hurried on. Retief made his way along the narrow hall, found signs, followed them to cabin fifty-seven. The door was open. Inside, baggage was piled in the center of the floor. It was expensive looking baggage.\n \n Retief put his bag down. He turned at a sound behind him. A tall, florid man with an expensive coat belted over a massive paunch stood in the open door, looking at Retief. Retief looked back. The florid man clamped his jaws together, turned to speak over his shoulder.\n \n \"Somebody in the cabin. Get 'em out.\" He rolled a cold eye at Retief as he backed out of the room. A short, thick-necked man appeared.\n \n \"What are you doing in Mr. Tony's room?\" he barked. \"Never mind! Clear out of here, fellow! You're keeping Mr. Tony waiting.\"\n \n \"Too bad,\" Retief said. \"Finders keepers.\"\n \n \"You nuts?\" The thick-necked man stared at Retief. \"I said it's Mr. Tony's room.\"\n \n \"I don't know Mr. Tony. He'll have to bull his way into other quarters.\"\n \n \"We'll see about you, mister.\" The man turned and went out. Retief sat on the bunk and lit a cigar. There was a sound of voices in the corridor. Two burly baggage-smashers appeared, straining at an oversized trunk. They maneuvered it through the door, lowered it, glanced at Retief and went out. The thick-necked man returned.\n \n \"All right, you. Out,\" he growled. \"Or have I got to have you thrown out?\"\n \n Retief rose and clamped the cigar between his teeth. He gripped a handle of the brass-bound trunk in each hand, bent his knees and heaved the trunk up to chest level, then raised it overhead. He turned to the door.\n \n \"Catch,\" he said between clenched teeth. The trunk slammed against the far wall of the corridor and burst.\n \n Retief turned to the baggage on the floor, tossed it into the hall. The face of the thick-necked man appeared cautiously around the door jamb.\n \n \"Mister, you must be—\"\n \n \"If you'll excuse me,\" Retief said, \"I want to catch a nap.\" He flipped the door shut, pulled off his shoes and stretched out on the bed.\n \n \n\n \n Five minutes passed before the door rattled and burst open.\n \n Retief looked up. A gaunt leathery-skinned man wearing white ducks, a blue turtleneck sweater and a peaked cap tilted raffishly over one eye stared at Retief.\n \n \"Is this the joker?\" he grated.\n \n The thick-necked man edged past him, looked at Retief and snorted,\n\"That's him, sure.\"\n \n \"I'm captain of this vessel,\" the first man said. \"You've got two minutes to haul your freight out of here, buster.\"\n \n \"When you can spare the time from your other duties,\" Retief said,\n\"take a look at Section Three, Paragraph One, of the Uniform Code. That spells out the law on confirmed space on vessels engaged in interplanetary commerce.\"\n \n \"A space lawyer.\" The captain turned. \"Throw him out, boys.\"\n \n Two big men edged into the cabin, looking at Retief.\n \n \"Go on, pitch him out,\" the captain snapped.\n \n Retief put his cigar in an ashtray, and swung his feet off the bunk.\n \n \"Don't try it,\" he said softly.\n \n One of the two wiped his nose on a sleeve, spat on his right palm, and stepped forward, then hesitated.\n \n \"Hey,\" he said. \"This the guy tossed the trunk off the wall?\"\n \n \"That's him,\" the thick-necked man called. \"Spilled Mr. Tony's possessions right on the deck.\"\n \n \"Deal me out,\" the bouncer said. \"He can stay put as long as he wants to. I signed on to move cargo. Let's go, Moe.\"\n \n \"You'd better be getting back to the bridge, Captain,\" Retief said.\n\"We're due to lift in twenty minutes.\"\n \n The thick-necked man and the Captain both shouted at once. The Captain's voice prevailed.\n \n \"—twenty minutes ... uniform Code ... gonna do?\"\n \n \"Close the door as you leave,\" Retief said.\n \n The thick-necked man paused at the door. \"We'll see you when you come out.\"\n \n \n\n III\n \n Four waiters passed Retief's table without stopping. A fifth leaned against the wall nearby, a menu under his arm.\n \n At a table across the room, the Captain, now wearing a dress uniform and with his thin red hair neatly parted, sat with a table of male passengers. He talked loudly and laughed frequently, casting occasional glances Retief's way.\n \n A panel opened in the wall behind Retief's chair. Bright blue eyes peered out from under a white chef's cap.\n \n \"Givin' you the cold shoulder, heh, Mister?\"\n \n \"Looks like it, old-timer,\" Retief said. \"Maybe I'd better go join the skipper. His party seems to be having all the fun.\"\n \n \"Feller has to be mighty careless who he eats with to set over there.\"\n \n \"I see your point.\"\n \n \"You set right where you're at, Mister. I'll rustle you up a plate.\"\n \n Five minutes later, Retief cut into a thirty-two ounce Delmonico backed up with mushrooms and garlic butter.\n \n \"I'm Chip,\" the chef said. \"I don't like the Cap'n. You can tell him I said so. Don't like his friends, either. Don't like them dern Sweaties, look at a man like he was a worm.\"\n \n \"You've got the right idea on frying a steak, Chip. And you've got the right idea on the Soetti, too,\" Retief said. He poured red wine into a glass. \"Here's to you.\"\n \n \"Dern right,\" Chip said. \"Dunno who ever thought up broiling 'em. Steaks, that is. I got a Baked Alaska coming up in here for dessert. You like brandy in yer coffee?\"\n \n \"Chip, you're a genius.\"\n \n \"Like to see a feller eat,\" Chip said. \"I gotta go now. If you need anything, holler.\"\n \n Retief ate slowly. Time always dragged on shipboard. Four days to Jorgensen's Worlds. Then, if Magnan's information was correct, there would be four days to prepare for the Soetti attack. It was a temptation to scan the tapes built into the handle of his suitcase. It would be good to know what Jorgensen's Worlds would be up against.\n \n Retief finished the steak, and the chef passed out the baked Alaska and coffee. Most of the other passengers had left the dining room. Mr. Tony and his retainers still sat at the Captain's table.\n \n As Retief watched, four men arose from the table and sauntered across the room. The first in line, a stony-faced thug with a broken ear, took a cigar from his mouth as he reached the table. He dipped the lighted end in Retief's coffee, looked at it, and dropped it on the tablecloth.\n \n The others came up, Mr. Tony trailing.\n \n \"You must want to get to Jorgensen's pretty bad,\" the thug said in a grating voice. \"What's your game, hick?\"\n \n Retief looked at the coffee cup, picked it up.\n \n \"I don't think I want my coffee,\" he said. He looked at the thug. \"You drink it.\"\n \n The thug squinted at Retief. \"A wise hick,\" he began.\n \n With a flick of the wrist, Retief tossed the coffee into the thug's face, then stood and slammed a straight right to the chin. The thug went down.\n \n Retief looked at Mr. Tony, still standing open-mouthed.\n \n \"You can take your playmates away now, Tony,\" he said. \"And don't bother to come around yourself. You're not funny enough.\"\n \n Mr. Tony found his voice.\n \n \"Take him, Marbles!\" he growled.\n \n The thick-necked man slipped a hand inside his tunic and brought out a long-bladed knife. He licked his lips and moved in.\n \n Retief heard the panel open beside him.\n \n \"Here you go, Mister,\" Chip said. Retief darted a glance; a well-honed french knife lay on the sill.\n \n \"Thanks, Chip,\" Retief said. \"I won't need it for these punks.\"\n \n Thick-neck lunged and Retief hit him square in the face, knocking him under the table. The other man stepped back, fumbling a power pistol from his shoulder holster.\n \n \"Aim that at me, and I'll kill you,\" Retief said.\n \n \"Go on, burn him!\" Mr. Tony shouted. Behind him, the captain appeared, white-faced.\n \n \"Put that away, you!\" he yelled. \"What kind of—\"\n \n \"Shut up,\" Mr. Tony said. \"Put it away, Hoany. We'll fix this bum later.\"\n \n \"Not on this vessel, you won't,\" the captain said shakily. \"I got my charter to consider.\"\n \n \"Ram your charter,\" Hoany said harshly. \"You won't be needing it long.\"\n \n \"Button your floppy mouth, damn you!\" Mr. Tony snapped. He looked at the man on the floor. \"Get Marbles out of here. I ought to dump the slob.\"\n \n He turned and walked away. The captain signaled and two waiters came up. Retief watched as they carted the casualty from the dining room.\n \n The panel opened.\n \n \"I usta be about your size, when I was your age,\" Chip said. \"You handled them pansies right. I wouldn't give 'em the time o' day.\"\n \n \"How about a fresh cup of coffee, Chip?\" Retief said.\n \n \"Sure, Mister. Anything else?\"\n \n \"I'll think of something,\" Retief said. \"This is shaping up into one of those long days.\"\n \n \n\n \n \"They don't like me bringing yer meals to you in yer cabin,\" Chip said.\n\"But the cap'n knows I'm the best cook in the Merchant Service. They won't mess with me.\"\n \n \"What has Mr. Tony got on the captain, Chip?\" Retief asked.\n \n \"They're in some kind o' crooked business together. You want some more smoked turkey?\"\n \n \"Sure. What have they got against my going to Jorgensen's Worlds?\"\n \n \"Dunno. Hasn't been no tourists got in there fer six or eight months. I sure like a feller that can put it away. I was a big eater when I was yer age.\"\n \n \"I'll bet you can still handle it, Old Timer. What are Jorgensen's Worlds like?\"\n \n \"One of 'em's cold as hell and three of 'em's colder. Most o' the Jorgies live on Svea; that's the least froze up. Man don't enjoy eatin' his own cookin' like he does somebody else's.\"\n \n \"That's where I'm lucky, Chip. What kind of cargo's the captain got aboard for Jorgensen's?\"\n \n \"Derned if I know. In and out o' there like a grasshopper, ever few weeks. Don't never pick up no cargo. No tourists any more, like I says. Don't know what we even run in there for.\"\n \n \"Where are the passengers we have aboard headed?\"\n \n \"To Alabaster. That's nine days' run in-sector from Jorgensen's. You ain't got another one of them cigars, have you?\"\n \n \"Have one, Chip. I guess I was lucky to get space on this ship.\"\n \n \"Plenty o' space, Mister. We got a dozen empty cabins.\" Chip puffed the cigar alight, then cleared away the dishes, poured out coffee and brandy.\n \n \"Them Sweaties is what I don't like,\" he said.\n \n Retief looked at him questioningly.\n \n \"You never seen a Sweaty? Ugly lookin' devils. Skinny legs, like a lobster; big chest, shaped like the top of a turnip; rubbery lookin' head. You can see the pulse beatin' when they get riled.\"\n \n \"I've never had the pleasure,\" Retief said.\n \n \"You prob'ly have it perty soon. Them devils board us nigh ever trip out. Act like they was the Customs Patrol or somethin'.\"\n \n There was a distant clang, and a faint tremor ran through the floor.\n \n \"I ain't superstitious ner nothin',\" Chip said. \"But I'll be triple-damned if that ain't them boarding us now.\"\n \n Ten minutes passed before bootsteps sounded outside the door, accompanied by a clicking patter. The doorknob rattled, then a heavy knock shook the door.\n \n \"They got to look you over,\" Chip whispered. \"Nosy damn Sweaties.\"\n \n \"Unlock it, Chip.\" The chef opened the door.\n \n \"Come in, damn you,\" he said.\n \n A tall and grotesque creature minced into the room, tiny hoof-like feet tapping on the floor. A flaring metal helmet shaded the deep-set compound eyes, and a loose mantle flapped around the knobbed knees. Behind the alien, the captain hovered nervously.\n \n \"Yo' papiss,\" the alien rasped.\n \n \"Who's your friend, Captain?\" Retief said.\n \n \"Never mind; just do like he tells you.\"\n \n \"Yo' papiss,\" the alien said again.\n \n \"Okay,\" Retief said. \"I've seen it. You can take it away now.\"\n \n \n\n \n \"Don't horse around,\" the captain said. \"This fellow can get mean.\"\n \n The alien brought two tiny arms out from the concealment of the mantle, clicked toothed pincers under Retief's nose.\n \n \"Quick, soft one.\"\n \n \"Captain, tell your friend to keep its distance. It looks brittle, and I'm tempted to test it.\"\n \n \"Don't start anything with Skaw; he can clip through steel with those snappers.\"\n \n \"Last chance,\" Retief said. Skaw stood poised, open pincers an inch from Retief's eyes.\n \n \"Show him your papers, you damned fool,\" the captain said hoarsely. \"I got no control over Skaw.\"\n \n \n\n \n The alien clicked both pincers with a sharp report, and in the same instant Retief half-turned to the left, leaned away from the alien and drove his right foot against the slender leg above the bulbous knee-joint. Skaw screeched and floundered, greenish fluid spattering from the burst joint.\n \n \"I told you he was brittle,\" Retief said. \"Next time you invite pirates aboard, don't bother to call.\"\n \n \"Jesus, what did you do! They'll kill us!\" the captain gasped, staring at the figure flopping on the floor.\n \n \"Cart poor old Skaw back to his boat,\" Retief said. \"Tell him to pass the word. No more illegal entry and search of Terrestrial vessels in Terrestrial space.\"\n \n \"Hey,\" Chip said. \"He's quit kicking.\"\n \n The captain bent over Skaw, gingerly rolled him over. He leaned close and sniffed.\n \n \"He's dead.\" The captain stared at Retief. \"We're all dead men,\" he said. \"These Soetti got no mercy.\"\n \n \"They won't need it. Tell 'em to sheer off; their fun is over.\"\n \n \"They got no more emotions than a blue crab—\"\n \n \"You bluff easily, Captain. Show a few guns as you hand the body back. We know their secret now.\"\n \n \"What secret? I—\"\n \n \"Don't be no dumber than you got to, Cap'n,\" Chip said. \"Sweaties die easy; that's the secret.\"\n \n \"Maybe you got a point,\" the captain said, looking at Retief. \"All they got's a three-man scout. It could work.\"\n \n He went out, came back with two crewmen. They hauled the dead alien gingerly into the hall.\n \n \"Maybe I can run a bluff on the Soetti,\" the captain said, looking back from the door. \"But I'll be back to see you later.\"\n \n \"You don't scare us, Cap'n,\" Chip said. \"Him and Mr. Tony and all his goons. You hit 'em where they live, that time. They're pals o' these Sweaties. Runnin' some kind o' crooked racket.\"\n \n \"You'd better take the captain's advice, Chip. There's no point in your getting involved in my problems.\"\n \n \"They'd of killed you before now, Mister, if they had any guts. That's where we got it over these monkeys. They got no guts.\"\n \n \"They act scared, Chip. Scared men are killers.\"\n \n \"They don't scare me none.\" Chip picked up the tray. \"I'll scout around a little and see what's goin' on. If the Sweaties figure to do anything about that Skaw feller they'll have to move fast; they won't try nothin' close to port.\"\n \n \"Don't worry, Chip. I have reason to be pretty sure they won't do anything to attract a lot of attention in this sector just now.\"\n \n Chip looked at Retief. \"You ain't no tourist, Mister. I know that much. You didn't come out here for fun, did you?\"\n \n \"That,\" Retief said, \"would be a hard one to answer.\"\n \n \n\n IV\n \n Retief awoke at a tap on his door.\n \n \"It's me, Mister. Chip.\"\n \n \"Come on in.\"\n \n The chef entered the room, locking the door.\n \n \"You shoulda had that door locked.\" He stood by the door, listening, then turned to Retief.\n \n \"You want to get to Jorgensen's perty bad, don't you, Mister?\"\n \n \"That's right, Chip.\"\n \n \"Mr. Tony give the captain a real hard time about old Skaw. The Sweaties didn't say nothin'. Didn't even act surprised, just took the remains and pushed off. But Mr. Tony and that other crook they call Marbles, they was fit to be tied. Took the cap'n in his cabin and talked loud at him fer half a hour. Then the cap'n come out and give some orders to the Mate.\"\n \n Retief sat up and reached for a cigar.\n \n \"Mr. Tony and Skaw were pals, eh?\"\n \n \"He hated Skaw's guts. But with him it was business. Mister, you got a gun?\"\n \n \"A 2mm needler. Why?\"\n \n \"The orders cap'n give was to change course fer Alabaster. We're by-passin' Jorgensen's Worlds. We'll feel the course change any minute.\"\n \n Retief lit the cigar, reached under the mattress and took out a short-barreled pistol. He dropped it in his pocket, looked at Chip.\n \n \"Maybe it was a good thought, at that. Which way to the Captain's cabin?\"\n \n \n\n \n \"This is it,\" Chip said softly. \"You want me to keep an eye on who comes down the passage?\"\n \n Retief nodded, opened the door and stepped into the cabin. The captain looked up from his desk, then jumped up.\n \n \"What do you think you're doing, busting in here?\"\n \n \"I hear you're planning a course change, Captain.\"\n \n \"You've got damn big ears.\"\n \n \"I think we'd better call in at Jorgensen's.\"\n \n \"You do, huh?\" the captain sat down. \"I'm in command of this vessel,\" he said. \"I'm changing course for Alabaster.\"\n \n \"I wouldn't find it convenient to go to Alabaster,\" Retief said. \"So just hold your course for Jorgensen's.\"\n \n \"Not bloody likely.\"\n \n \"Your use of the word 'bloody' is interesting, Captain. Don't try to change course.\"\n \n The captain reached for the mike on his desk, pressed the key.\n \n \"Power Section, this is the captain,\" he said. Retief reached across the desk, gripped the captain's wrist.\n \n \"Tell the mate to hold his present course,\" he said softly.\n \n \"Let go my hand, buster,\" the captain snarled. Eyes on Retief's, he eased a drawer open with his left hand, reached in. Retief kneed the drawer. The captain yelped and dropped the mike.\n \n \"You busted it, you—\"\n \n \"And one to go,\" Retief said. \"Tell him.\"\n \n \"I'm an officer of the Merchant Service!\"\n \n \"You're a cheapjack who's sold his bridge to a pack of back-alley hoods.\"\n \n \"You can't put it over, hick.\"\n \n \"Tell him.\"\n \n The captain groaned and picked up the mike. \"Captain to Power Section,\" he said. \"Hold your present course until you hear from me.\" He dropped the mike and looked up at Retief.\n \n \"It's eighteen hours yet before we pick up Jorgensen Control. You going to sit here and bend my arm the whole time?\"\n \n Retief released the captain's wrist and turned to the door.\n \n \"Chip, I'm locking the door. You circulate around, let me know what's going on. Bring me a pot of coffee every so often. I'm sitting up with a sick friend.\"\n \n \"Right, Mister. Keep an eye on that jasper; he's slippery.\"\n \n \"What are you going to do?\" the captain demanded.\n \n Retief settled himself in a chair.\n \n \"Instead of strangling you, as you deserve,\" he said, \"I'm going to stay here and help you hold your course for Jorgensen's Worlds.\"\n \n The captain looked at Retief. He laughed, a short bark.\n \n \"Then I'll just stretch out and have a little nap, farmer. If you feel like dozing off sometime during the next eighteen hours, don't mind me.\"\n \n Retief took out the needler and put it on the desk before him.\n \n \"If anything happens that I don't like,\" he said, \"I'll wake you up. With this.\"",
      "metadata": {
        "title": "The Frozen Planet",
        "author": "Keith Laumer",
        "passage_id": "61097",
        "uid": "cc5949d34ad34950b1ec2167f26bbebf",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "2",
                "uid": "37fc0aac8bf04a208d02ecda8ea5ac91",
                "response_text": "Councillor Magnan dispatches Retief on a mission to deliver information to Jorgensen’s Worlds, notifying them that the aliens, the Soettis, are planning to attack them and to deliver a battle plan and the instructions for converting their anti-acceleration field into a powerful weapon to defend themselves. As a precaution, Retief checks out a needler to take with him. At the airport, he is told that the flight to Jorgensen’s World is fully booked and that he should try again in a couple of weeks; by then, the alien invasion will be over. Under pressure, the clerk tells Retief that the ship is booked for a VIP, and all tourist reservations are canceled. Retief goes to the gate for the flight and punches the ticket taker, forcing his way onto the airship. \n\tRetief makes his way to a room full of expensive luggage and is discovered by Mr. Tony, the man who has claimed the room. When Mr. Tony’s henchmen try to force Retief out of the room, he hefts a large trunk at them and then tosses all the luggage into the hallway. Next, the Captain appears and tries to throw Retief off the ship, but Retief claims the right of the passage under Section Three, Paragraph One of the Uniform Code. The henchmen and the Captain give up for now.\n\tAt dinner, the wait staff ignore Retief, but the chef, Chip, provides him with an excellent meal. Chip dislikes the Captain and Mr. Tony, but he knows they won’t replace him because of his excellent culinary skills. Chip befriends Retief and explains the situation to him. He doesn’t know exactly what the Captain and Mr. Tony are up to, but they make frequent trips to Jorgensen’s Worlds and cut off all tourist travel to the planet. They travel to Jorgensen’s Worlds every few weeks but never pick up any cargo. They allow the Soettis, the aliens who are planning an attack on the Worlds, to board the ships and inspect them because the Soettis are in control of the travel lanes to the planet.\n\tWhen Skaw, a Soetti, demands Retief’s travel papers, Retief attacks him and kills him. The Captain is terrified that the Soettis will kill all of them, and Retief urges him to show some backbone. Retief knows the Soettis won’t make a big deal of the death because they don’t want to draw attention to themselves on the eve of their launch against the Worlds. \n\tLater, Chip informs Retief that the Captain has ordered a change of course to skip Jorgensen’s Worlds and travel on to Alabaster. Retief must reach the Jorgensen’s population ASAP with news of the impending alien attack, so he goes to the Captain’s cabin, catching him off guard, and makes him change the orders for the crew, keeping the ship on track to the Worlds. To prevent the Captain from changing the order, Retief stays with him in his cabin and uses the threat of his needler as a deterrent.\n"
              },
              {
                "worker_id": "8",
                "uid": "5ff504bd39244e459e6f9872d3a369dc",
                "response_text": "Councillor Magnan assigns Retief on a mission to Jorgensen's Worlds to warn and prepare them for an attack by the Soetti, an alien species characterized by their long legs, turnip-shaped torsos, snapper arms, and aggressive infiltration of Terrestrial space. Since Jorgensen's Worlds are underdeveloped technologically, Magnan wants Retief to help the Jorgies convert their anti-acceleration field into a powerful weapon for their defense. Retief has four weeks to complete his mission. Magnan has booked him a space flight as far as Aldo Cerise, and he warns Retief prior to departure to look out for the Soetti, who are patrolling the customs areas into Jorgensen's Worlds. Retief brings a gun with him in case he encounters trouble. When he arrives to check in to his flight, the clerk informs him that his flight is full, and he has no chance of boarding. Retief finds out the gate number and goes there, knocking out a guard in order to make his way onto the ship. When Retief locates his cabin, he discovers a tall man named Mr. Tony and his henchman, a short, thick-necked man named Marbles are already there. Mr. Tony orders his henchman to remove Retief, but Retief throws his luggage out into the corridor and closes the door. A few minutes later, Marbles returns with the ship's captain and orders Retief to leave the ship. Again, Retief refuses, and the captain's henchmen avoid escalation having seen Retief's previous aggression with Mr. Tony's luggage. At dinner later, the waiters refuse to serve Retief, and he sees the Captain dining with Mr. Tony and his henchmen. Retief meets the ship's chef Chip, who serves him food. Meanwhile, four of Mr. Tony's henchmen come to Retief's table to find out why he wants to go to Jorgensen's Worlds. When Marbles pulls a knife, Chef Chip offers Retief a knife of his own, but he simply punches Marbles in the face, knocking him out. Another thug pulls a gun on Retief, but the Captain defuses the situation, thinking about his career. After everyone leaves, Chip informs Retief that the Captain has a shady business arrangement with Mr. Tony wherein he ferries unknown cargo instead of tourists to Jorgensen's World with frequent visits from the Soetti. Before the conversation has ended, the Captain arrives with a Soetti named Skaw, who wants to question Retief. When Retief refuses to show Skaw his papers, Skaw moves in for the attack, and Retief breaks his slender leg. Skaw flops about the floor until he dies. Horrified, the Captain worries the other Soetti will react violently, but Retief orders him to show them the body of Skaw and some guns, predicting they will retreat. Later, Chip informs Retief that Mr. Tony is deeply upset about Skaw's death, considering they were close business partners; he also tells him the captain has ordered a course-change to bypass Jorgensen's Worlds and head straight to Alabaster. Retief finds the captain and strong-arms him into maintaining his course to Jorgensen's Worlds."
              },
              {
                "worker_id": "10",
                "uid": "6d1309b785b34bdfb771bf0a7f172789",
                "response_text": "Magnan, a Councillor of the Corps, assigns an officer of high rank, Retief, on a dangerous courier mission to stop the forceful takeover of the Terrestrial occupied space of Jorgensen's Worlds (a cluster of four planets around a star) by the Soetti. Magan suggests a show of force against the Soetti is necessary, and details that he has acquired their war plan and weapon schematics. The Soetti will attack the Jorgensen’s Worlds in less than four weeks and are already patrolling the trade lanes into them, making Retief’s entry sketchy even while hiding his Corps credentials. Magnan gives him a ticket departing in four hours to the Aldo Cerise to start Retief’s trip. However, Retief has to punch out an attendant to actually get on this ship because his ticket has been voided by “VIPs” booking the train up to capacity and bumping him off. Retief goes to his originally assigned cabin, but it is already full of expensive luggage. Two men tell him it’s Mr.Tony’s room and that he needs to leave. The Captain shows up and tries to tell Retief to leave as well, but Retief cites the Uniform Code law that protects confirmed space on interplanetary vessels. \nRetief meets the chef, Chip, in the dining car as he watches the red-haired Captain eat with a table of men, including Mr. Tony. One of the “thugs” dining with the Captain dips a cigar into Retief’s coffee while walking past, and Retief throws the coffee on him and punches him in the chin. Mr. Tony calls on one of his men, Marbles, to take out Retief and he attacks. Chip offers Retief a knife, but he doesn’t take it. The Captain urges them to stop fighting saying he has his “charter to consider”.\nChip brings Retief a meal in his cabin, and tells him that the Captain and Mr. Tony are in a crooked business arrangement and haven’t let any tourists into Jorgensen's World in 6-8 months. They only make quick stops and never pick up any cargo. The passengers currently aboard are headed to Alabaster. The Soetti board the vessel, and one of them, Skaw, appears at Retief’s cabin with the Captain and demands his papers. Skaw threatens Retief with snapping claws, but Retief refuses and breaks his leg, which leaks green fluid and kills Skaw. \nThe Soetti don’t retaliate when Skaw’s body is returned to them, but the thugs and Mr. Tony are very angry with the Captain, and force him to pass by Jorgensen’s Worlds and go straight to Alabaster. Retief goes to the Captain’s quarters and tries to get him to return to the original course. The Captain initially refuses, but Retief slams his fingers in a drawer and the Captain obliges. It will be 18 hours to Jorgensen’s Worlds and Retief asks Chip to bring him pots of coffee to keep him awake as he stays with the Captain to ensure he stays on course under threat of shooting him with his 2mm needler weapon.\n"
              },
              {
                "worker_id": "12",
                "uid": "99a56fcc57304a0c9fe6563ecde8e7b5",
                "response_text": "The story opens with Magnan debriefing Retief about the Soetti, who are planning to seize Jorgensen's Worlds. Retief is to be tasked with getting to Jorgensen's Worlds before the arrival of the Soetti to equip the people of Jorgensen's Worlds with advanced weaponry and a battle plan to defend themselves. Retief boards a ship on Aldo Cerise without a boarding pass and claims a room that is meant for a man named Mr. Tony. Mr. Tony calls his associates and they attempt to remove Retief from his room but are unsuccessful. As they travel towards Jorgensen's Worlds, it becomes clear that the ship is under the control of Mr. Tony, who has some sort of shady dealings with the Soetti. Retief learns this with the aid of the ship's cook, Chip. A Soetti named Skaw appears and attempts to find out more about Retief and his purpose for being on the ship, but Retief kills Skaw. The captain then attempts to change the course of the ship, but Retief forces him to stay the course towards Jorgensen's Worlds."
              }
            ]
          },
          {
            "question_text": "Who are the Soettis, and what is their significance?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "2",
                "uid": "37fc0aac8bf04a208d02ecda8ea5ac91",
                "response_text": "The Soettis are involved in some kind of illegal activity with the Captain and Mr. Tony. The Soettis, nicknamed Sweaties, by humans who dislike them, are an alien species who have been moving deep into the sector where the Jorgensen’s Worlds are located. The Soettis are unattractive creatures with skinny legs like a lobster’s and a big chest shaped somewhat like a turnip. They have rubbery heads, and you can see their pulse beating when they get upset. They have tiny arms with toothed pincers at the ends and threaten humans with them. These pincers are incredibly strong and can cut through steel. \nIt has been learned that they are planning to seize Jorgensen’s Worlds by force, a move of open aggression against Terrestrial territory that cannot be overlooked. The headquarters where Retief works has obtained the Soetti War Plan from a defector of Terrestrials who have actually been providing advice to the Soettis, so the plan is for Retief to travel personally to Jorgensen’s Worlds to provide them with this information and also with the schematics that will enable them to convert their anti-acceleration field into a powerful weapon to protect the planets. Reaching the Jorgensen’s Worlds will be challenging because the Soettis are on patrol in the trade lanes where the airships travel to the Worlds. The Soettis look down on Terrestrials and try to assert themselves over them. The Soettis can speak English, so they can communicate with the Terrestrials.\nThe Captain is afraid of the Soettis and worries that when Retief harms Skaw, the Soetties will kill all of the humans. Retief intends for Skaw to go back and tell the other Soettis that they can no longer enter the Terrestrials’ airships and search them. When Skaw dies, the Captain is certain they are done for, but Retief tells him to bluff and show guns when they return the body, and the Soettis will back down. Surprisingly, the Soettis don’t say anything about Skaw’s death, but Mr. Tony is furious. Retief thinks it is good to know that the Soettis are easy to kill.\n"
              },
              {
                "worker_id": "8",
                "uid": "5ff504bd39244e459e6f9872d3a369dc",
                "response_text": "The Soetti are a hostile alien species that have been infiltrating Terrestrial space. Councillor Magnan and his associates have uncovered their plot to seize Jorgensen's Worlds and assign Retief to travel to the underdeveloped planets to help prepare a defense.  The Soetti are tall creatures with skinny legs, big chests, and round, bulbous torsos. Their heads look rubbery and pulse when they are angry. Soettis have two small arms with pincers for hands that are sharp enough to cut through steel. Magnan warns Retief to be on the lookout for Soettis when he boards his flight for Jorgensen's Worlds, since they tend to patrol the customs areas. They also seem to have some kind of business arrangement with the Captain of the ship that ferries to Jorgensen's World and Mr. Tony, a space thug who employs a number of strong men like Marbles to rough up passengers to Jorgensen's Worlds who might get too curious. Chip informs Retief that the Soetti frequently board the ship, although he is not clear as to their purpose. A Soetti named Skaw confronts Retief and asks to see his papers. When Retief refuses the request, Skaw moves in to attack him. Retief discovers a Soetti weakness when he breaks Skaw's slender leg, spilling greenish blood, and ultimately killing Skaw. Retief demonstrates to the Captain how this can be used as leverage against the hostile aliens."
              },
              {
                "worker_id": "10",
                "uid": "6d1309b785b34bdfb771bf0a7f172789",
                "response_text": "Soettis are an alien race of lobster-like crustaceans with skinny legs, big chests and rubbery heads that show their beating pulse. They patrol the trade lanes into the Jorgensen’s Worlds and one of them, Skaw, boards the merchant vessel that Retief is riding on, acting as if he is a Customs Patrol officer. Skaw is tall with tiny hoof-like feet, and a loose mantle that flaps around knobby knees. He wears a metal helmet. Retief easily breaks the joint of one of Skaw’s legs which then leaks green fluid and kills Skaw.\nThey are significant to the story because they are the enemies that Retief is being sent on a Corps mission to clear from the Jorgensen’s Worlds where they are mounting a hostile takeover of Terrestrial space. After Retief discovers how easy they are to kill, he knows he can exploit this weakness to succeed on his mission to reclaim Jorgensen's Worlds for Terrestrials.\n"
              },
              {
                "worker_id": "12",
                "uid": "99a56fcc57304a0c9fe6563ecde8e7b5",
                "response_text": "The Soettis are an aggressive species that is attempting to seize Jorgensen's Worlds by force. They are much more technologically advanced than the Jorgensen's Worlds, especially when it comes to weaponry. The Soetti look different than the other characters in the story, with skinny legs like lobsters, and big chests that look like turnips. They have hoof-like feet as well. In Retief's quest to defend Jorgensen's Worlds, he finds that they have some kind of shady dealings with Mr. Tony aboard the transport ship from Aldo Cerise."
              }
            ]
          },
          {
            "question_text": "Describe Jorgensen’s Worlds and their significance.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "2",
                "uid": "37fc0aac8bf04a208d02ecda8ea5ac91",
                "response_text": "Jorgensen’s Worlds are a group of four planets, or actually two double planets, and are located close to an unimportant star known as DRI-G 33987. These planets are freezing cold and are undeveloped and mostly populated with farmers and traders. They have a small amount of industry, just enough to support their merchant fleet. However, the governing body in this sector of space has received word that an alien race, the Soetti, has plans to seize Jorgensen’s Worlds. The governing body isn’t going to sit by and let the aliens take over Terrestrial-occupied territory. Retief is on a mission to deliver information to Jorgensen’s Worlds that will enable them to defend themselves from the alien attack, providing them with the Soettis War Plan, a battle plan for the planets, and the schematics that will enable them, in a matter of minutes, to convert their anti-acceleration fields into a powerful weapon. Reaching Jorgensen’s Worlds will be challenging because the Soetti are patroling the trade lanes to the planet. Their successful defense against the Soetti hinges on Retief’s reaching the planets in time for them to make the conversions before the aliens' attack."
              },
              {
                "worker_id": "8",
                "uid": "5ff504bd39244e459e6f9872d3a369dc",
                "response_text": "Jorgensen's Worlds consist of four cold planets: Two double planets that hover near a star called DRI-G 33987. The people who live on Jorgensen's Worlds are called \"Jorgies\" and most of them live on Svea because it is the least-frozen among the four planetes. Technologically underdeveloped, Jorgensen's Worlds make their industries in farming and trading and have nothing in the way of defense against hostile attack. The Soetti plan to seize Jorgensen's Worlds as part of their efforts to continue infiltrating Terrestrial space; this plan was revealed to Councillor Magnan and his associates by a defector from a group of Terrestrials who had been working with the Soetti. Councillor Magnan sends Retief on the four-day trip to help them convert their anti-acceleration field into a powerful weapon that may be used to defend themselves against the Soetti. Tourism to Jorgensen's Wolrds has recently come to a stand-still, but a ship piloted by the Captain and occupied by Mr. Tony, his henchmen, and the attendant Soetti ferries frequently to the planets carrying a mystery cargoload. The Captain wants to avoid stopping at Jorgensen's Worlds when he realizes Retief is slowly uncovering the plot, so he orders a course-change to Alabaster. But Retief stops him."
              },
              {
                "worker_id": "10",
                "uid": "6d1309b785b34bdfb771bf0a7f172789",
                "response_text": "There are four planets in Jorgensen’s Worlds. Two sets of double planets that are close to star DRI-G 33987. Chip, the chef on the merchant vessel that Retief is riding, describes that one of them is as cold as hell and the other three are colder. Most of the population lives on the warmest of the planets, Svea. Jorgensen's Worlds are technologically undeveloped, populated by mostly farmers or traders, with industry playing only a minor economic role that barely supports the Merchant Fleet to make runs to them. They are significant because they are within Terrestrial space and an alien race, the Soetti, are trying to claim them by hostile takeover which Retief is sent by the Corps to stop. The Jorgensen's Worlds have essentially no ability to defend themselves since they don't have an armed force, so they can only be saved by the Corps."
              },
              {
                "worker_id": "12",
                "uid": "99a56fcc57304a0c9fe6563ecde8e7b5",
                "response_text": "Jorgensen's Worlds is the name used for four planets grouped around a star named DRI-G 33987. These worlds are colder than most other planets, with Svea being the least cold. Jorgensen's Worlds are inhabited by farmers and traders. They are technologically underdeveloped, especially when it comes to weapons and defense. Many of the inhabitants of Jorgensen's Worlds are mechanics. Jorgensen's Worlds are significant because they are the target of the Soetti, who hope to take the worlds by force. This is in open opposition to the organization for which Retief works, and he is given the mission of delivering advanced weaponry and knowledge to the people of Jorgensen's Worlds in order to protect it."
              }
            ]
          },
          {
            "question_text": "Who is Chip, and what is his significance?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "2",
                "uid": "37fc0aac8bf04a208d02ecda8ea5ac91",
                "response_text": "Chip is the chef on the airship that is traveling to Jorgensen’s Worlds. His role as chef enables him to have contact with the Captain, crew, and passengers, which makes him extremely valuable to Retief. In addition, he likes Retief since he stands up to Mr. Tony and the Captain, neither of whom Chip can stand. When the serving staff ignore Retief, Chip serves Retief and later continues serving him meals in his room. When Retief is threatened by one of Mr. Tony’s goons wielding a knife, Chip passes a knife from the kitchen to Retief to defend himself. Most importantly, Chip shares his wealth of knowledge with Retief and assists him. Chip informs Retief that Mr. Tony and the Captain are involved in some kind of crooked business deal with each other, adding that there haven’t been any tourist to Jorgensen’s Worlds for the last six to eight months. He also tells Retief about the Soettis boarding the ship and searching it. At the end of the story when Retief is holding the Captain in his cabin to prevent him from changing the orders and bypassing Jorgensen’s Worlds, Chip keeps an eye on what is going on with the rest of the passengers to report back to Retief. Without Chip’s help, Retief might not have been as successful in thwarting the Captain and Mr. Tony’s plan to bypass Jorgensen’s Worlds.\n"
              },
              {
                "worker_id": "8",
                "uid": "5ff504bd39244e459e6f9872d3a369dc",
                "response_text": "Chip is the chef on the ship that ferries passengers and cargo to planet clusters like Jorgensen's Worlds and even further into Terrestrial space to planets like Alabaster. Friendly and helpful to Retief, Chip speaks to him through a panel in the wall that he slides open and closed whenever he is ready to serve food or dish out some useful information. Chip cannot stand the Soetti, whom he calls \"Sweaties\", because of their condescension and harassment. He also doesn't like the Captain of the ship, Mr. Tony, or any of his henchmen. When the waiters in the dining area ignore Retief, Chip whips him up a thirty-two-ounce Delmonico with mushrooms and garlic butter as well as some coffee with brandy and baked Alaska. When Marbles threatens retief with a knife, Chip offers Retief a french knife through his sliding panel in order to defend himself. Later, Chip helps Retief again by providing him information about Mr. Tony's business relationship with Skaw and the Captain's order to change course for Alabaster. While Retief holds the Captain at gunpoint to prevent him from following through on that order, Chip keeps watch in the corridor. "
              },
              {
                "worker_id": "10",
                "uid": "6d1309b785b34bdfb771bf0a7f172789",
                "response_text": "Chip is the chef on the Merchant Vessel that Retief has boarded to travel to Jorgensen’s Worlds to prepare them for the Soetti attack. Chip is significant because he is the guide of the story, giving Retief key information to make decisions, such as that the Captain is engaged in crooked business with Mr. Tony and the thugs, and that vessel is changing course unexpectedly to pass by the Jorgensen’s Worlds which would jeopardize Retief’s mission entirely. Chip is friendly to Retief from their first meeting and supportive of his mission since he does not trust the Soetti and he thinks they look at men like worms. Chip takes liberties to deliver food to Retief in his room, which allows them to have private conversations about the Captain and Mr.Tony, and will support Retief with coffee during the 18 hours he has to stay awake to watch the Captain and ensure he stays on course to Jorgensen's Worlds."
              },
              {
                "worker_id": "12",
                "uid": "99a56fcc57304a0c9fe6563ecde8e7b5",
                "response_text": "Chip is the ship's cook and happens to be the best cook in the Merchant Service. Chip doesn't care for the captain of the ship or the Soetti, who he derisively calls the \"Sweaties.\" Chip is considerably older than Retief but he sympathizes with the younger man when the waiters of the ship refuse to wait on him and he feeds Retief. Chip feeds Retief then goes so far as to assist him in fighting the Soetti that comes on board named Skaw. It is through Chip that Retief finds out the situation on the ship and uncovers that Mr. Tony is working with the Soetti."
              }
            ]
          },
          {
            "question_text": "What is the relationship between the Captain and Mr. Tony?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "2",
                "uid": "37fc0aac8bf04a208d02ecda8ea5ac91",
                "response_text": "Mr. Tony is a tall, florid man with expensive clothes and a massive paunch. He is also used to getting his way. The Captain and Mr. Tony are involved in an illegal deal with the Soettis, so the two men are business associates, although they don’t much like each other. Together, they have cut off all tourism to Jorgensen’s Worlds for the past six to eight months; the airlines won’t provide any bookings for passengers; however, the Captain’s airship has at least a dozen empty rooms. Mr. Tony has several henchmen working for him who do his “dirty business” of roughhandling anyone who interferes with Mr. Tony’s business. Whatever their business is, it involves frequent trips to Jorgensen’s Worlds without taking any cargo there. Mr. Tony seems to hold power over the Captain.\n\tThe Captain is a thin, leathery-skinned man who wears white ducks, a blue turtleneck, and a peaked cap that he tilts rakishly over one eye. He isn’t a very strong person or leader. He tries to get Mr. Tony’s men to throw Retief off the ship, but they refuse to do so when Retief warns them not to try and when they realize he is the person who picked up Mr. Tony’s trunk and threw it. The Captain has ordered Retief to get off the ship but backs down when the men refuse to touch Retief. He apparently tells the wait staff in the restaurant to refuse service to Retief because they all ignore him. And when the Captain warns Mr. Tony’s henchmen not to shoot Retief on his airship because it could threaten his charter, one of them talks back and tells him he won’t need it for long. Retief has the distinct impression that Mr. Tony has something on the Captain that forces the Captain to cooperate with him and places him at a lower level than Mr. Tony.  \n"
              },
              {
                "worker_id": "8",
                "uid": "5ff504bd39244e459e6f9872d3a369dc",
                "response_text": "The Captain and Mr. Tony are friends, which Retief discovers when he sees them dining together and occasionally glancing over at his table as the waiters ignore him. Chip fills him in on their close business association, which includes an arrangement to ferry some unknown cargo to Jorgensen's Worlds. Mr. Tony is a VIP guest on the Captain's ship and takes Retief's room, but Retief kicks him out, which draws the ire of Mr. Tony and his henchmen. It appears that Mr. Tony is a thug whose men work as guards of whatever cargo is being transported to Jorgensen's Worlds. The Captain and Mr. Tony are also working with the Soetti, who visit the ship during each flight, according to Chip. Although the exact details of their plot are never revealed, Retief assumes it has something to do with the Soetti's overall plan to seize Jorgensen's Worlds in their overall infiltration of Terrestrial space. Although the Captain and Mr. Tony are friendly, the Captain is concerned about his charter, and he draws the line when Mr. Tony's men come for Retief with a gun. He calls off his henchman and leaves."
              },
              {
                "worker_id": "10",
                "uid": "6d1309b785b34bdfb771bf0a7f172789",
                "response_text": "The Captain is operating a Merchant Vessel transiting between Earth and distant worlds to deliver and retrieve passengers and cargo. However, he has fallen into crooked business with Mr. Tony, who is a violent ring leader closely connected with the Soettis who are trying to violently take control of the Terrestrial space of Jorgensen’s Worlds. For the last 6-8 months they have not delivered any tourists to Jorgensen's Worlds, and never pick up any cargo, which is highly suspicious. \nMr. Tony deals closely with the Soettis, and is very upset when the Soetti Skaw is killed and the body has to be returned to them. Skaw boards the Merchant Vessel to check Retief’s papers even though he has no authority, and Retief kills him by breaking his leg joint which leaks green fluid. Mr. Tony and one of his “thugs”, Marbles, yell at the Captain for half an hour in his cabin after this incident and force him to change course to not stop at Jorgensen’s Worlds, demonstrating that Mr. Tony has control over the Captain in their relationship.\n"
              },
              {
                "worker_id": "12",
                "uid": "99a56fcc57304a0c9fe6563ecde8e7b5",
                "response_text": "The captain has given up control of the ship to Mr. Tony and has basically become one of his underlings. This is most evident when the captain attempts to throw Retief out of Mr. Tony's room and when he attempts to reroute the ship to Alabaster when Retief beats up Mr. Tony's goons. Chip says that the captain has a crooked business agreement with Mr. Tony, but it becomes clear later in the story that the business agreement is really controlled by the Soetti. The captain says he has no control over Skaw, the Soetti that comes aboard the ship, and becomes very nervous when Retief kills Skaw. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4545,
        "document_length_chars": 26718
      }
    }
  ]
}