{
  "item_metadata": {
    "item_id": "61139",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61139",
      "content": "THE MADMAN FROM EARTH\n \n\n BY KEITH LAUMER\n \n\n You don't have to be crazy to be an earth diplomat—but on Groac it sure helps!\n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, March 1962. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n I\n \n \"The Consul for the Terrestrial States,\" Retief said, \"presents his compliments, et cetera, to the Ministry of Culture of the Groacian Autonomy, and with reference to the Ministry's invitation to attend a recital of interpretive grimacing, has the honor to express regret that he will be unable—\"\n \n \"You can't turn this invitation down,\" Administrative Assistant Meuhl said flatly. \"I'll make that 'accepts with pleasure'.\"\n \n Retief exhaled a plume of cigar smoke.\n \n \"Miss Meuhl,\" he said, \"in the past couple of weeks I've sat through six light-concerts, four attempts at chamber music, and god knows how many assorted folk-art festivals. I've been tied up every off-duty hour since I got here—\"\n \n \"You can't offend the Groaci,\" Miss Meuhl said sharply. \"Consul Whaffle would never have been so rude.\"\n \n \"Whaffle left here three months ago,\" Retief said, \"leaving me in charge.\"\n \n \"Well,\" Miss Meuhl said, snapping off the dictyper. \"I'm sure I don't know what excuse I can give the Minister.\"\n \n \"Never mind the excuses,\" Retief said. \"Just tell him I won't be there.\" He stood up.\n \n \"Are you leaving the office?\" Miss Meuhl adjusted her glasses. \"I have some important letters here for your signature.\"\n \n \"I don't recall dictating any letters today, Miss Meuhl,\" Retief said, pulling on a light cape.\n \n \n\n \n \"I wrote them for you. They're just as Consul Whaffle would have wanted them.\"\n \n \"Did you write all Whaffle's letters for him, Miss Meuhl?\"\n \n \"Consul Whaffle was an extremely busy man,\" Miss Meuhl said stiffly.\n\"He had complete confidence in me.\"\n \n \"Since I'm cutting out the culture from now on,\" Retief said, \"I won't be so busy.\"\n \n \"Well!\" Miss Meuhl said. \"May I ask where you'll be if something comes up?\"\n \n \"I'm going over to the Foreign Office Archives.\"\n \n Miss Meuhl blinked behind thick lenses. \"Whatever for?\"\n \n Retief looked thoughtfully at Miss Meuhl. \"You've been here on Groac for four years, Miss Meuhl. What was behind the coup d'etat that put the present government in power?\"\n \n \"I'm sure I haven't pried into—\"\n \n \"What about that Terrestrial cruiser? The one that disappeared out this way about ten years back?\"\n \n \"Mr. Retief, those are just the sort of questions we avoid with the Groaci. I certainly hope you're not thinking of openly intruding—\"\n \n \"Why?\"\n \n \"The Groaci are a very sensitive race. They don't welcome outworlders raking up things. They've been gracious enough to let us live down the fact that Terrestrials subjected them to deep humiliation on one occasion.\"\n \n \"You mean when they came looking for the cruiser?\"\n \n \"I, for one, am ashamed of the high-handed tactics that were employed, grilling these innocent people as though they were criminals. We try never to reopen that wound, Mr. Retief.\"\n \n \"They never found the cruiser, did they?\"\n \n \"Certainly not on Groac.\"\n \n Retief nodded. \"Thanks, Miss Meuhl,\" he said. \"I'll be back before you close the office.\" Miss Meuhl's face was set in lines of grim disapproval as he closed the door.\n \n \n\n \n The pale-featured Groacian vibrated his throat-bladder in a distressed bleat.\n \n \"Not to enter the Archives,\" he said in his faint voice. \"The denial of permission. The deep regret of the Archivist.\"\n \n \"The importance of my task here,\" Retief said, enunciating the glottal dialect with difficulty. \"My interest in local history.\"\n \n \"The impossibility of access to outworlders. To depart quietly.\"\n \n \"The necessity that I enter.\"\n \n \"The specific instructions of the Archivist.\" The Groacian's voice rose to a whisper. \"To insist no longer. To give up this idea!\"\n \n \"OK, Skinny, I know when I'm licked,\" Retief said in Terran. \"To keep your nose clean.\"\n \n Outside, Retief stood for a moment looking across at the deeply carved windowless stucco facades lining the street, then started off in the direction of the Terrestrial Consulate General. The few Groacians on the street eyed him furtively, veered to avoid him as he passed. Flimsy high-wheeled ground cars puffed silently along the resilient pavement. The air was clean and cool.\n \n At the office, Miss Meuhl would be waiting with another list of complaints.\n \n Retief studied the carving over the open doorways along the street. An elaborate one picked out in pinkish paint seemed to indicate the Groacian equivalent of a bar. Retief went in.\n \n A Groacian bartender was dispensing clay pots of alcoholic drink from the bar-pit at the center of the room. He looked at Retief and froze in mid-motion, a metal tube poised over a waiting pot.\n \n \"To enjoy a cooling drink,\" Retief said in Groacian, squatting down at the edge of the pit. \"To sample a true Groacian beverage.\"\n \n \"To not enjoy my poor offerings,\" the Groacian mumbled. \"A pain in the digestive sacs; to express regret.\"\n \n \"To not worry,\" Retief said, irritated. \"To pour it out and let me decide whether I like it.\"\n \n \"To be grappled in by peace-keepers for poisoning of—foreigners.\" The barkeep looked around for support, found none. The Groaci customers, eyes elsewhere, were drifting away.\n \n \"To get the lead out,\" Retief said, placing a thick gold-piece in the dish provided. \"To shake a tentacle.\"\n \n \"The procuring of a cage,\" a thin voice called from the sidelines. \"The displaying of a freak.\"\n \n \n\n \n Retief turned. A tall Groacian vibrated his mandibles in a gesture of contempt. From his bluish throat coloration, it was apparent the creature was drunk.\n \n \"To choke in your upper sac,\" the bartender hissed, extending his eyes toward the drunk. \"To keep silent, litter-mate of drones.\"\n \n \"To swallow your own poison, dispenser of vileness,\" the drunk whispered. \"To find a proper cage for this zoo-piece.\" He wavered toward Retief. \"To show this one in the streets, like all freaks.\"\n \n \"Seen a lot of freaks like me, have you?\" Retief asked, interestedly.\n \n \"To speak intelligibly, malodorous outworlder,\" the drunk said. The barkeep whispered something, and two customers came up to the drunk, took his arms and helped him to the door.\n \n \"To get a cage!\" the drunk shrilled. \"To keep the animals in their own stinking place.\"\n \n \"I've changed my mind,\" Retief said to the bartender. \"To be grateful as hell, but to have to hurry off now.\" He followed the drunk out the door. The other Groaci released him, hurried back inside. Retief looked at the weaving alien.\n \n \"To begone, freak,\" the Groacian whispered.\n \n \"To be pals,\" Retief said. \"To be kind to dumb animals.\"\n \n \"To have you hauled away to a stockyard, ill-odored foreign livestock.\"\n \n \"To not be angry, fragrant native,\" Retief said. \"To permit me to chum with you.\"\n \n \"To flee before I take a cane to you!\"\n \n \"To have a drink together—\"\n \n \"To not endure such insolence!\" The Groacian advanced toward Retief. Retief backed away.\n \n \"To hold hands,\" Retief said. \"To be palsy-walsy—\"\n \n The Groacian reached for him, missed. A passer-by stepped around him, head down, scuttled away. Retief backed into the opening to a narrow crossway and offered further verbal familiarities to the drunken local, who followed, furious. Retief backed, rounded a corner into a narrow alley-like passage, deserted, silent ... except for the following Groacian.\n \n Retief stepped around him, seized his collar and yanked. The Groacian fell on his back. Retief stood over him. The downed native half-rose; Retief put a foot against his chest and pushed.\n \n \"To not be going anywhere for a few minutes,\" Retief said. \"To stay right here and have a nice long talk.\"\n \n \n\n II\n \n \"There you are!\" Miss Meuhl said, eyeing Retief over her lenses. \"There are two gentlemen waiting to see you. Groacian gentlemen.\"\n \n \"Government men, I imagine. Word travels fast.\" Retief pulled off his cape. \"This saves me the trouble of paying another call at the Foreign Ministry.\"\n \n \"What have you been doing? They seem very upset, I don't mind telling you.\"\n \n \"I'm sure you don't. Come along. And bring an official recorder.\"\n \n Two Groaci wearing heavy eye-shields and elaborate crest ornaments indicative of rank rose as Retief entered the room. Neither offered a courteous snap of the mandibles, Retief noted. They were mad, all right.\n \n \"I am Fith, of the Terrestrial Desk, Ministry of Foreign Affairs, Mr. Consul,\" the taller Groacian said, in lisping Terran. \"May I present Shluh, of the Internal Police?\"\n \n \"Sit down, gentlemen,\" Retief said. They resumed their seats. Miss Meuhl hovered nervously, then sat on the edge of a comfortless chair.\n \n \"Oh, it's such a pleasure—\" she began.\n \n \"Never mind that,\" Retief said. \"These gentlemen didn't come here to sip tea today.\"\n \n \"So true,\" Fith said. \"Frankly, I have had a most disturbing report, Mr. Consul. I shall ask Shluh to recount it.\" He nodded to the police chief.\n \n \"One hour ago,\" The Groacian said, \"a Groacian national was brought to hospital suffering from serious contusions. Questioning of this individual revealed that he had been set upon and beaten by a foreigner. A Terrestrial, to be precise. Investigation by my department indicates that the description of the culprit closely matches that of the Terrestrial Consul.\"\n \n Miss Meuhl gasped audibly.\n \n \"Have you ever heard,\" Retief said, looking steadily at Fith, \"of a Terrestrial cruiser, the ISV Terrific , which dropped from sight in this sector nine years ago?\"\n \n \"Really!\" Miss Meuhl exclaimed, rising. \"I wash my hands—\"\n \n \"Just keep that recorder going,\" Retief snapped.\n \n \"I'll not be a party—\"\n \n \"You'll do as you're told, Miss Meuhl,\" Retief said quietly. \"I'm telling you to make an official sealed record of this conversation.\"\n \n Miss Meuhl sat down.\n \n Fith puffed out his throat indignantly. \"You reopen an old wound, Mr. Consul. It reminds us of certain illegal treatment at Terrestrial hands—\"\n \n \"Hogwash,\" Retief said. \"That tune went over with my predecessors, but it hits a sour note with me.\"\n \n \"All our efforts,\" Miss Meuhl said, \"to live down that terrible episode! And you—\"\n \n \"Terrible? I understand that a Terrestrial task force stood off Groac and sent a delegation down to ask questions. They got some funny answers, and stayed on to dig around a little. After a week they left. Somewhat annoying to the Groaci, maybe—at the most. If they were innocent.\"\n \n \"IF!\" Miss Meuhl burst out.\n \n \"If, indeed!\" Fith said, his weak voice trembling. \"I must protest your—\"\n \n \n\n \n \"Save the protests, Fith. You have some explaining to do. And I don't think your story will be good enough.\"\n \n \"It is for you to explain! This person who was beaten—\"\n \n \"Not beaten. Just rapped a few times to loosen his memory.\"\n \n \"Then you admit—\"\n \n \"It worked, too. He remembered lots of things, once he put his mind to it.\"\n \n Fith rose; Shluh followed suit.\n \n \"I shall ask for your immediate recall, Mr. Consul. Were it not for your diplomatic immunity, I should do more—\"\n \n \"Why did the government fall, Fith? It was just after the task force paid its visit, and before the arrival of the first Terrestrial diplomatic mission.\"\n \n \"This is an internal matter!\" Fith cried, in his faint Groacian voice.\n\"The new regime has shown itself most amiable to you Terrestrials. It has outdone itself—\"\n \n \"—to keep the Terrestrial consul and his staff in the dark,\" Retief said. \"And the same goes for the few terrestrial businessmen you've visaed. This continual round of culture; no social contacts outside the diplomatic circle; no travel permits to visit out-lying districts, or your satellite—\"\n \n \"Enough!\" Fith's mandibles quivered in distress. \"I can talk no more of this matter—\"\n \n \"You'll talk to me, or there'll be a task force here in five days to do the talking,\" Retief said.\n \n \"You can't!\" Miss Meuhl gasped.\n \n Retief turned a steady look on Miss Meuhl. She closed her mouth. The Groaci sat down.\n \n \"Answer me this one,\" Retief said, looking at Shluh. \"A few years back—about nine, I think—there was a little parade held here. Some curious looking creatures were captured. After being securely caged, they were exhibited to the gentle Groaci public. Hauled through the streets. Very educational, no doubt. A highly cultural show.\n \n \"Funny thing about these animals. They wore clothes. They seemed to communicate with each other. Altogether it was a very amusing exhibit.\n \n \"Tell me, Shluh, what happened to those six Terrestrials after the parade was over?\"\n \n \n\n \n Fith made a choked noise and spoke rapidly to Shluh in Groacian. Shluh retracted his eyes, shrank down in his chair. Miss Meuhl opened her mouth, closed it and blinked rapidly.\n \n \"How did they die?\" Retief snapped. \"Did you murder them, cut their throats, shoot them or bury them alive? What amusing end did you figure out for them? Research, maybe? Cut them open to see what made them yell....\"\n \n \"No!\" Fith gasped. \"I must correct this terrible false impression at once.\"\n \n \"False impression, hell,\" Retief said. \"They were Terrans! A simple narco-interrogation would get that out of any Groacian who saw the parade.\"\n \n \"Yes,\" Fith said weakly. \"It is true, they were Terrestrials. But there was no killing.\"\n \n \"They're alive?\"\n \n \"Alas, no. They ... died.\"\n \n Miss Meuhl yelped faintly.\n \n \"I see,\" Retief said. \"They died.\"\n \n \"We tried to keep them alive, of course. But we did not know what foods—\"\n \n \"Didn't take the trouble to find out, either, did you?\"\n \n \"They fell ill,\" Fith said. \"One by one....\"\n \n \"We'll deal with that question later,\" Retief said. \"Right now, I want more information. Where did you get them? Where did you hide the ship? What happened to the rest of the crew? Did they 'fall ill' before the big parade?\"\n \n \"There were no more! Absolutely, I assure you!\"\n \n \"Killed in the crash landing?\"\n \n \"No crash landing. The ship descended intact, east of the city. The ... Terrestrials ... were unharmed. Naturally, we feared them. They were strange to us. We had never before seen such beings.\"\n \n \"Stepped off the ship with guns blazing, did they?\"\n \n \"Guns? No, no guns—\"\n \n \"They raised their hands, didn't they? Asked for help. You helped them; helped them to death.\"\n \n \"How could we know?\" Fith moaned.\n \n \"How could you know a flotilla would show up in a few months looking for them, you mean? That was a shock, wasn't it? I'll bet you had a brisk time of it hiding the ship, and shutting everybody up. A close call, eh?\"\n \n \"We were afraid,\" Shluh said. \"We are a simple people. We feared the strange creatures from the alien craft. We did not kill them, but we felt it was as well they ... did not survive. Then, when the warships came, we realized our error. But we feared to speak. We purged our guilty leaders, concealed what had happened, and ... offered our friendship. We invited the opening of diplomatic relations. We made a blunder, it is true, a great blunder. But we have tried to make amends....\"\n \n \"Where is the ship?\"\n \n \"The ship?\"\n \n \"What did you do with it? It was too big to just walk off and forget. Where is it?\"\n \n The two Groacians exchanged looks.\n \n \"We wish to show our contrition,\" Fith said. \"We will show you the ship.\"\n \n \"Miss Meuhl,\" Retief said. \"If I don't come back in a reasonable length of time, transmit that recording to Regional Headquarters, sealed.\" He stood, looked at the Groaci.\n \n \"Let's go,\" he said.\n \n \n\n \n Retief stooped under the heavy timbers shoring the entry to the cavern. He peered into the gloom at the curving flank of the space-burned hull.\n \n \"Any lights in here?\" he asked.\n \n A Groacian threw a switch. A weak bluish glow sprang up.\n \n Retief walked along the raised wooden catwalk, studying the ship. Empty emplacements gaped below lensless scanner eyes. Littered decking was visible within the half-open entry port. Near the bow the words 'IVS Terrific B7 New Terra' were lettered in bright chrome duralloy.\n \n \"How did you get it in here?\" Retief asked.\n \n \"It was hauled here from the landing point, some nine miles distant,\" Fith said, his voice thinner than ever. \"This is a natural crevasse. The vessel was lowered into it and roofed over.\"\n \n \"How did you shield it so the detectors didn't pick it up?\"\n \n \"All here is high-grade iron ore,\" Fith said, waving a member. \"Great veins of almost pure metal.\"\n \n Retief grunted. \"Let's go inside.\"\n \n Shluh came forward with a hand-lamp. The party entered the ship.\n \n Retief clambered up a narrow companionway, glanced around the interior of the control compartment. Dust was thick on the deck, the stanchions where acceleration couches had been mounted, the empty instrument panels, the litter of sheared bolts, scraps of wire and paper. A thin frosting of rust dulled the exposed metal where cutting torches had sliced away heavy shielding. There was a faint odor of stale bedding.\n \n \"The cargo compartment—\" Shluh began.\n \n \"I've seen enough,\" Retief said.\n \n Silently, the Groacians led the way back out through the tunnel and into the late afternoon sunshine. As they climbed the slope to the steam car, Fith came to Retief's side.\n \n \"Indeed, I hope that this will be the end of this unfortunate affair,\" he said. \"Now that all has been fully and honestly shown—\"\n \n \"You can skip all that,\" Retief said. \"You're nine years late. The crew was still alive when the task force called, I imagine. You killed them—or let them die—rather than take the chance of admitting what you'd done.\"\n \n \"We were at fault,\" Fith said abjectly. \"Now we wish only friendship.\"\n \n \"The Terrific was a heavy cruiser, about twenty thousand tons.\" Retief looked grimly at the slender Foreign Office official. \"Where is she, Fith? I won't settle for a hundred-ton lifeboat.\"\n \n \n\n \n Fith erected his eye stalks so violently that one eye-shield fell off.\n \n \"I know nothing of ... of....\" He stopped. His throat vibrated rapidly as he struggled for calm.\n \n \"My government can entertain no further accusations, Mr. Consul,\" he said at last. \"I have been completely candid with you, I have overlooked your probing into matters not properly within your sphere of responsibility. My patience is at an end.\"\n \n \"Where is that ship?\" Retief rapped out. \"You never learn, do you? You're still convinced you can hide the whole thing and forget it. I'm telling you you can't.\"\n \n \"We return to the city now,\" Fith said. \"I can do no more.\"\n \n \"You can and you will, Fith,\" Retief said. \"I intend to get to the truth of this matter.\"\n \n Fith spoke to Shluh in rapid Groacian. The police chief gestured to his four armed constables. They moved to ring Retief in.\n \n Retief eyed Fith. \"Don't try it,\" he said. \"You'll just get yourself in deeper.\"\n \n Fith clacked his mandibles angrily, eye stalks canted aggressively toward the Terrestrial.\n \n \"Out of deference to your diplomatic status, Terrestrial, I shall ignore your insulting remarks,\" Fith said in his reedy voice. \"Let us now return to the city.\"\n \n Retief looked at the four policemen. \"I see your point,\" he said.\n \n Fith followed him into the car, sat rigidly at the far end of the seat.\n \n \"I advise you to remain very close to your consulate,\" Fith said. \"I advise you to dismiss these fancies from your mind, and to enjoy the cultural aspects of life at Groac. Especially, I should not venture out of the city, or appear overly curious about matters of concern only to the Groacian government.\"\n \n In the front seat, Shluh looked straight ahead. The loosely-sprung vehicle bobbed and swayed along the narrow highway. Retief listened to the rhythmic puffing of the motor and said nothing.\n \n \n\n III\n \n \"Miss Meuhl,\" Retief said, \"I want you to listen carefully to what I'm going to tell you. I have to move rapidly now, to catch the Groaci off guard.\"\n \n \"I'm sure I don't know what you're talking about,\" Miss Meuhl snapped, her eyes sharp behind the heavy lenses.\n \n \"If you'll listen, you may find out,\" Retief said. \"I have no time to waste, Miss Meuhl. They won't be expecting an immediate move—I hope—and that may give me the latitude I need.\"\n \n \"You're still determined to make an issue of that incident!\" Miss Meuhl snorted. \"I really can hardly blame the Groaci. They are not a sophisticated race; they had never before met aliens.\"\n \n \"You're ready to forgive a great deal, Miss Meuhl. But it's not what happened nine years ago I'm concerned with. It's what's happening now. I've told you that it was only a lifeboat the Groaci have hidden out. Don't you understand the implication? That vessel couldn't have come far. The cruiser itself must be somewhere near by. I want to know where!\"\n \n \"The Groaci don't know. They're a very cultured, gentle people. You can do irreparable harm to the reputation of Terrestrials if you insist—\"\n \n \"That's my decision,\" Retief said. \"I have a job to do and we're wasting time.\" He crossed the room to his desk, opened a drawer and took out a slim-barreled needler.\n \n \"This office is being watched. Not very efficiently, if I know the Groaci. I think I can get past them all right.\"\n \n \"Where are you going with ... that?\" Miss Meuhl stared at the needler.\n\"What in the world—\"\n \n \"The Groaci won't waste any time destroying every piece of paper in their files relating to this thing. I have to get what I need before it's too late. If I wait for an official Inquiry Commission, they'll find nothing but blank smiles.\"\n \n \"You're out of your mind!\" Miss Meuhl stood up, quivering with indignation. \"You're like a ... a....\"\n \n \"You and I are in a tight spot, Miss Meuhl. The logical next move for the Groaci is to dispose of both of us. We're the only ones who know what happened. Fith almost did the job this afternoon, but I bluffed him out—for the moment.\"\n \n Miss Meuhl emitted a shrill laugh. \"Your fantasies are getting the better of you,\" she gasped. \"In danger, indeed! Disposing of me! I've never heard anything so ridiculous.\"\n \n \"Stay in this office. Close and safe-lock the door. You've got food and water in the dispenser. I suggest you stock up, before they shut the supply down. Don't let anyone in, on any pretext whatever. I'll keep in touch with you via hand-phone.\"\n \n \"What are you planning to do?\"\n \n \"If I don't make it back here, transmit the sealed record of this afternoon's conversation, along with the information I've given you. Beam it through on a mayday priority. Then tell the Groaci what you've done and sit tight. I think you'll be all right. It won't be easy to blast in here and anyway, they won't make things worse by killing you. A force can be here in a week.\"\n \n \"I'll do nothing of the sort! The Groaci are very fond of me! You ... Johnny-come-lately! Roughneck! Setting out to destroy—\"\n \n \"Blame it on me if it will make you feel any better,\" Retief said, \"but don't be fool enough to trust them.\" He pulled on a cape, opened the door.\n \n \"I'll be back in a couple of hours,\" he said. Miss Meuhl stared after him silently as he closed the door.\n \n \n\n \n It was an hour before dawn when Retief keyed the combination to the safe-lock and stepped into the darkened consular office. He looked tired.\n \n Miss Meuhl, dozing in a chair, awoke with a start. She looked at Retief, rose and snapped on a light, turned to stare.\n \n \"What in the world—Where have you been? What's happened to your clothing?\"\n \n \"I got a little dirty. Don't worry about it.\" Retief went to his desk, opened a drawer and replaced the needler.\n \n \"Where have you been?\" Miss Meuhl demanded. \"I stayed here—\"\n \n \"I'm glad you did,\" Retief said. \"I hope you piled up a supply of food and water from the dispenser, too. We'll be holed up here for a week, at least.\" He jotted figures on a pad. \"Warm up the official sender. I have a long transmission for Regional Headquarters.\"\n \n \"Are you going to tell me where you've been?\"\n \n \"I have a message to get off first, Miss Meuhl,\" Retief said sharply.\n\"I've been to the Foreign Ministry,\" he added. \"I'll tell you all about it later.\"\n \n \"At this hour? There's no one there....\"\n \n \"Exactly.\"\n \n Miss Meuhl gasped. \"You mean you broke in? You burgled the Foreign Office?\"\n \n \"That's right,\" Retief said calmly. \"Now—\"\n \n \"This is absolutely the end!\" Miss Meuhl said. \"Thank heaven I've already—\"\n \n \"Get that sender going, woman!\" Retief snapped. \"This is important.\"\n \n \"I've already done so, Mr. Retief!\" Miss Meuhl said harshly. \"I've been waiting for you to come back here....\" She turned to the communicator, flipped levers. The screen snapped aglow, and a wavering long-distance image appeared.\n \n \"He's here now,\" Miss Meuhl said to the screen. She looked at Retief triumphantly.\n \n \"That's good,\" Retief said. \"I don't think the Groaci can knock us off the air, but—\"\n \n \"I have done my duty, Mr. Retief,\" Miss Meuhl said. \"I made a full report to Regional Headquarters last night, as soon as you left this office. Any doubts I may have had as to the rightness of that decision have been completely dispelled by what you've just told me.\"\n \n Retief looked at her levelly. \"You've been a busy girl, Miss Meuhl. Did you mention the six Terrestrials who were killed here?\"\n \n \"That had no bearing on the matter of your wild behavior! I must say, in all my years in the Corps, I've never encountered a personality less suited to diplomatic work.\"\n \n \n\n \n The screen crackled, the ten-second transmission lag having elapsed.\n\"Mr. Retief,\" the face on the screen said, \"I am Counsellor Pardy, DSO-1, Deputy Under-secretary for the region. I have received a report on your conduct which makes it mandatory for me to relieve you administratively, vice Miss Yolanda Meuhl, DAO-9. Pending the findings of a Board of Inquiry, you will—\"\n \n Retief reached out and snapped off the communicator. The triumphant look faded from Miss Meuhl's face.\n \n \"Why, what is the meaning—\"\n \n \"If I'd listened any longer, I might have heard something I couldn't ignore. I can't afford that, at this moment. Listen, Miss Meuhl,\" Retief went on earnestly, \"I've found the missing cruiser.\"\n \n \"You heard him relieve you!\"\n \n \"I heard him say he was going to, Miss Meuhl. But until I've heard and acknowledged a verbal order, it has no force. If I'm wrong, he'll get my resignation. If I'm right, that suspension would be embarrassing all around.\"\n \n \"You're defying lawful authority! I'm in charge here now.\" Miss Meuhl stepped to the local communicator.\n \n \"I'm going to report this terrible thing to the Groaci at once, and offer my profound—\"\n \n \"Don't touch that screen,\" Retief said. \"You go sit in that corner where I can keep an eye on you. I'm going to make a sealed tape for transmission to Headquarters, along with a call for an armed task force. Then we'll settle down to wait.\"\n \n Retief ignored Miss Meuhl's fury as he spoke into the recorder.\n \n The local communicator chimed. Miss Meuhl jumped up, staring at it.\n \n \"Go ahead,\" Retief said. \"Answer it.\"\n \n A Groacian official appeared on the screen.\n \n \"Yolanda Meuhl,\" he said without preamble, \"for the Foreign Minister of the Groacian Autonomy, I herewith accredit you as Terrestrial Consul to Groac, in accordance with the advices transmitted to my government direct from the Terrestrial Headquarters. As consul, you are requested to make available for questioning Mr. J. Retief, former consul, in connection with the assault on two peace keepers and illegal entry into the offices of the Ministry for Foreign Affairs.\"\n \n \"Why, why,\" Miss Meuhl stammered. \"Yes, of course. And I do want to express my deepest regrets—\"\n \n \n\n \n Retief rose, went to the communicator, assisted Miss Meuhl aside.\n \n \"Listen carefully, Fith,\" he said. \"Your bluff has been called. You don't come in and we don't come out. Your camouflage worked for nine years, but it's all over now. I suggest you keep your heads and resist the temptation to make matters worse than they are.\"\n \n \"Miss Meuhl,\" Fith said, \"a peace squad waits outside your consulate. It is clear you are in the hands of a dangerous lunatic. As always, the Groaci wish only friendship with the Terrestrials, but—\"\n \n \"Don't bother,\" Retief said. \"You know what was in those files I looked over this morning.\"\n \n Retief turned at a sound behind him. Miss Meuhl was at the door, reaching for the safe-lock release....\n \n \"Don't!\" Retief jumped—too late.\n \n The door burst inward. A crowd of crested Groaci pressed into the room, pushed Miss Meuhl back, aimed scatter guns at Retief. Police Chief Shluh pushed forward.\n \n \"Attempt no violence, Terrestrial,\" he said. \"I cannot promise to restrain my men.\"\n \n \"You're violating Terrestrial territory, Shluh,\" Retief said steadily.\n\"I suggest you move back out the same way you came in.\"\n \n \"I invited them here,\" Miss Meuhl spoke up. \"They are here at my express wish.\"\n \n \"Are they? Are you sure you meant to go this far, Miss Meuhl? A squad of armed Groaci in the consulate?\"\n \n \"You are the consul, Miss Yolanda Meuhl,\" Shluh said. \"Would it not be best if we removed this deranged person to a place of safety?\"\n \n \"You're making a serious mistake, Shluh,\" Retief said.\n \n \"Yes,\" Miss Meuhl said. \"You're quite right, Mr. Shluh. Please escort Mr. Retief to his quarters in this building—\"\n \n \"I don't advise you to violate my diplomatic immunity, Fith,\" Retief said.\n \n \"As chief of mission,\" Miss Meuhl said quickly, \"I hereby waive immunity in the case of Mr. Retief.\"\n \n Shluh produced a hand recorder. \"Kindly repeat your statement, Madam, officially,\" he said. \"I wish no question to arise later.\"\n \n \"Don't be a fool, woman,\" Retief said. \"Don't you see what you're letting yourself in for? This would be a hell of a good time for you to figure out whose side you're on.\"\n \n \"I'm on the side of common decency!\"\n \n \"You've been taken in. These people are concealing—\"\n \n \"You think all women are fools, don't you, Mr. Retief?\" She turned to the police chief and spoke into the microphone he held up.\n \n \"That's an illegal waiver,\" Retief said. \"I'm consul here, whatever rumors you've heard. This thing's coming out into the open, whatever you do. Don't add violation of the Consulate to the list of Groacian atrocities.\"\n \n \"Take the man,\" Shluh said.",
      "metadata": {
        "title": "The Madman from Earth",
        "author": "Keith Laumer",
        "passage_id": "61139",
        "uid": "7842df416dc341eba207272ca2af02d3",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "8",
                "uid": "859d15ea77e145aab1af8b304e005f78",
                "response_text": "Following the departure of Consul Whaffle, Retief has taken over as Consul for the Terrestrial States with the Terrestrial Consulate General on the planet Groac. His administrative assistant, Miss Yolanda Meuhl, wants him to attend Groacian cultural events, but Retief is more interested in addressing the nine-year-old mystery of the disappearance of a Terrestrial cruiser, the ISV Terrific--an event which was followed by a coup d'etat enacted by the current Groacian government. Much to Miss Meuhl's dismay, Retief shirks his cultural duties and makes his way to the Foreign Office Archives, whereupon he is promptly barred from entering by a pale-featured Archivist speaking in the throat-bladder vibrations of the native Groacians. Because of the Archivist's insistence that \"outworlders\" cannot access the archives, Retief begins walking back to the Consulate and stops at a bar for a drink. At the, a drunken Groacian approaches Retief and threatens to cage him and put him on display as a freak. The bartender orders the drunken Groacian out of the bar, and Retief follows him, ultimately beating him up for information. When Retief returns to the Consulate, Miss Meuhl informs him that two angry Groaci await him in his office. One is Fith, an employee of the Terrestrial Desk at the Ministry of Foreign Affairs; the other is Shluh, a representative of the Internal Police. They are there to investigate reports that Retief has assaulted a Groacian national--an accusation Retief ignores in order to launch into his own accusations that the Groaci were engaged in a cover-up of the whereabouts of the ISV Terrific. Miss Meuhl continually interjects, expresses horror at Retief's claims, and apologizes to the Groacians on behalf of the Terrestrial Consulate. Despite the persistent denials of the Groacians, Retief continues his accusations, suggesting the coup d'etat was an effort to silence government officials with knowledge of the truth of what happened to the cruiser and its crew. Then he reveals what he discovered from the drunken Groacian: The crew of the ISV Terrific had been caged and paraded through the streets of Groac and then neglected until they died. Fith and Shluh finally admit the truth and offer to show Retief the hidden cruiser in order to show their contrition. When Retief sees the ship, he once again accuses the Groacians of attempting to mislead him, saying that this is a lifeboat, and he demands to see the actual ship. Fith has had enough and threatens to arrest Retief, who yields and goes back to the Consulate. There, Miss Meuhl is at her wits end. Retief orders her to barricade herself inside the office while he goes to the Foreign Ministry to gather more evidence. When he returns, Miss Meuhl informs him she has reported him to Regional Headquarters, and Retief learns he has been relieved of his post. Soon after, the Groacians appoint Miss Meuhl to his position, and Fith and Shluh enter to arrest him."
              },
              {
                "worker_id": "6",
                "uid": "22ed0051fe8d4216be3cb4e8190710a6",
                "response_text": "Consul Whaffle left the Terrestrial Consul three months prior, leaving Retief in charge. Retief is sick of the constant cultural events and lack of real progress, so he’s beginning to suspect the Groaci are hiding something. He turns down the latest invitation, offending his Administrative Assistant Miss Meuhl. She is horrified at his choices and at his questioning the Groaci’s motives. Retief wants to learn more about the Terrestrial cruiser, Terrific ISV, that crashed on Groac nine years ago. Miss Meuhl disapproves and believes the Groacian side of the story, but Retief is not convinced. He is turned down at the Archies, as he is an outsider. He leaves and decides to visit a bar and try the local drink. There, Retief is refused by the bartender as well, claiming his stomach can’t handle their drink. A drunk Groacian in the background whispers about putting Retief in a cage where he belongs. He follows the drunk after he gets thrown out and violently interrogates him.\nWhen Retief returns to his office, Miss Meuhl announces that there are two Groaci waiting for him. Fith and Shluh, of the Ministry of Foreign Affairs and Internal Police respectively, have heard about the assaults on a Groacian. Retief asks Miss Meuhl to record their conversation. Retief admits to his questioning, but not before doing some of his own. He prods the two Groaci about the Terrific ISV cruiser and soon reveals that the drunk told him about the zoo-like parade of Terrestrials. Fith admits to the parade and tells them that the Terrestrials died afterward due to insufficient nutrition. The Groaci hid their blunder and lied to the Terrestrials about what truly happened. Retief asks them to take him to the cruiser, which they do. After they explore a little, Fith and Shluh ask him to keep his mouth shut. Retief refuses and says that this ship was the lifeboat, not the cruiser itself. Four armed Groaci surround Retief, but he talks his way out of the situation. \nHe returns to the Consulate and tells Miss Meuhl everything, warning her to prepare for the present crisis. She is still upset and defends the Groaci. He tells her to lock herself in the Consulate and wait for his return. If something were to happen, she is to send the recording and all his evidence to Regional Headquarters. He leaves to break into the Foreign Ministry. When he returns, he asks Miss Meuhl to fire up the sender, which she’d already done. She had reported him to the Regional Headquarters and all his misactions. Counsellor Pardy pops up on the screen and attempts to relieve Retief of his duties, but he quickly shuts it off. Retief says he found the missing cruiser but is interrupted by the local communicator. A Groacian promotes Miss Meuhl to Consul, and she lets in the so-called peace squad. They surround Retief, armed, and Miss Meuhl waives Retief’s diplomatic immunity. Shluh orders his men to take Retief. \n"
              },
              {
                "worker_id": "10",
                "uid": "9b348a8582824644b70014ef5d74b953",
                "response_text": "At the Terrestrial Consulate General on the planet Groac, Retief has taken over for Consul Whaffle who left three months prior. Administrative Assistant Miss Yolanda Meuhl used to serve Consul Whaffle, and is not pleased with how Retief is handling things. Retief dictates a response declining a prestigious invitation to a Groacian event to Miss Meuhl, and she warns he will offend them. This is not Retief’s only controversy. He also questions the coup d'etat of the present government and the disappearance of the Terrestrial cruiser, ISV Terrific, nine years ago, which are considered topics to be avoided by Miss Meuhl. Retief is denied entry into the Foreign Office Archives to investigate, and steps into a local bar. A drunkard Groacian calls Retief a freak and then is escorted out by two other customers. Retief follows the drunk out to the street and pins him down to the ground to have a “long talk”.\nBack in Retief’s consulate office, two angry Groacian officials, Fith, of the Terrestrial Desk, Ministry of Foreign Affairs and Shluh, of the Internal Police, accuse Retief of beating the drunkard. Retief has Miss Meuhl officially record the conversation and pivots to ask what happened to the Terrestrial cruiser, ISV Terrific, that disappeared nine years ago. Fith is offended and calls for Retief to be fired. Retief presses on to ask why the government fell after the visit of a Terrestrial investigation task force after the incident. He notices the Groacians are covering something up - not letting Terrestrials have social contacts outside the diplomatic circle and never speaking of a parade of six Terrestrials hauled through the streets after the vessel disappeared. Fith admits that six Terrans were captured and they fell ill and died because the Groacians didn’t know what to feed them. Fith admits the ship descended intact East of the city, and that they didn’t realize they had done something terrible until the Terran warships came. So they covered their mistake, purging their guilty leaders, concealing what happened, and offering Terrans diplomatic relations.  Fith and Shluh take Retief to see the ship in a cavern, however, it is not the real ISV Terrific. The Terrific was a twenty thousand ton ship, and this one is only a small lifeboat. Fith becomes furious. Shluh and four constables escort Retief back to the city and ban him from leaving or questioning Groacian government matters. \nRetief decides to find what happened to the real Terrific before they destroy all the Archives’ paperwork. He instructs Miss Meuhl to lock herself in the consulate office. She reports Retief to Regional Headquarters. When Retief returns, he wants to send his findings to Regional Headquarters, but when they reconnect, Counsellor Pardy, DSO-1, Deputy Under-secretary for the region fires Retief. Miss Meuhl answers a call from the Groacians who accredit her as the new Terrestrial Consul to Groac (Retief’s role). She lets armed Groacian’s into the consulate and waives diplomatic immunity for Retief. A total betrayal that shocks Retief."
              },
              {
                "worker_id": "2",
                "uid": "c41eb690db154c64ab4ab86b68e93ea0",
                "response_text": "Consul Retief for the Terrestrial States is serving on the Groac planet, having replaced the previous consul, Mr. Whaffle, three months ago. His Administrative Assistant, Miss Meuhl, tries to tell him how to do his job, indicating what he can and cannot do. She is defensive of the Groacians, calling them sensitive, cultured, innocent, and gentle yet unsophisticated. She professes deep shame at the way they were treated by the investigators. She has been working in the consulate for four years and considers herself much more knowledgeable than Retief. There was a Terrestrial ship, the ISV Terrific, that went missing in their sector nine years ago, and while the Terrestrials held an investigation and questioned the Groacians, they did not get satisfactory answers. Retief is trying to get those answers.\nTo determine what happened, Retief first tries the Archives and local museum, but Terrestrials are denied entry here. From there, he makes his way to a bar. While the bartender refuses him service, a drunken Groacian calls out for a cage to put Retief in, referring to him as a zoo animal or a freak. When the bartender has the drunk taken out of the bar, Retief follows and beats him to get more information. Later, two government men, Fith from the Ministry of Foreign Affairs and Shluh from the Internal Police, show up at the consulate to question Retief about the beating. He turns their questioning into his own interrogation about the missing ship from nine years ago and the reason for the change in their government right after the investigators left Groac. Retief confronts them with his knowledge that the Terrestrials were put in cages and paraded through the streets and demands to know what happened to them. Fith admits this happened and claims the humans grew ill and died since the Groacians didn’t really know how to keep them alive.\nFith also relates that the government was changed after the inquiry to get rid of the leaders who were involved. To try to cover and make up for their mistakes, they then reached out to the Terrestrials to establish a diplomatic relationship. When Retief asks to see the ship, Fith and Shluh show him a ship hidden in a cavern, but Retief realizes it isn’t the ISV. He confronts the men about this, and they end their cooperation with him. Fith warns Retief to stay close to the consulate.\nKnowing that he has little time left, that night Retief breaks into the Foreign Ministry to find evidence and answers to his questions; he is sure they will destroy this information soon. When he returns to the consulate, Miss Meuhl has filed a report against him with the Regional Headquarters, having him relieved of duty and making her acting Consul. Fith and Shluh show up to question Retief about the break-in, and he claims diplomatic immunity, but Miss Meuhl waives his immunity.  \n"
              }
            ]
          },
          {
            "question_text": "What is the setting of the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "8",
                "uid": "859d15ea77e145aab1af8b304e005f78",
                "response_text": "The story takes place on the planet Groac, which is populated by the native Groaci. The Groaci is a skinny, pale species with a throat-bladder that vibrates when speaking with a glottal dialect in an unusual syntax. They are a sensitive race, according to Miss Meuhl, and they hide their heads and hurry along at any sign of trouble. Consul Retief has an office in the Terrestrial Consulate General and attends cultural events such as light-concerts, chamber music, and folk-art festivals. Retief suggests that these events are mere distractions from more underhanded business happening on the planet, which explains why visas are handed out for only a few terrestrial businessmen, traveling to outlying districts is forbidden, and social contacts must be limited to the diplomatic circle. Groac also has a moon that foreigners cannot visit. In addition to the Consulate General, other important government agencies exist including the Foreign Office Archives, the Ministry of Culture of the Groacian Autonomy, the Ministry of Foreign Affairs, and the Internal Police (called \"peace-keepers\"). Close to the Consulate General is the bar where Retief goes, seeking a cold drink and information. The bartender stands in the bar-pit and dispenses a Groacian beverage he insists is poisonous to foreigners due to its lead content. Retief brandishes a thick gold piece to act as a filter. Later, Fith and Shluh lead Retief to a crevasse nine miles from the supposed landing point of the ISV Terrific. Due to the large veins of high-grade iron ore, Terrestrial investigators had been unable to detect the cruiser's presence, which had been disguised by a roof of heavy timbers. Retief enters the cruiser via a narrow companionway and sees dust all over the deck, stanchions, instrument panels, sheared bolts, and scraps of wire and paper strewn about the control compartment. "
              },
              {
                "worker_id": "6",
                "uid": "22ed0051fe8d4216be3cb4e8190710a6",
                "response_text": "The story takes place on the planet Groac inhabited by the Groaci. Previously undiscovered by humans, the Groaci had their first contact with an alien species just nine years prior to the story beginning. The Groaci use ground cars to travel, though they may be considered flimsy. With a cool temperature and clean air, Groac isn’t a terrible place to live. There are mountainous caverns in the terrain as well, and one serves as the hiding spot for the lost Terrific ISV. Retief visits several places and buildings on Groac, including the Consul, their Ministry of Affairs, and a bar, showing their culture does not differ entirely from Terrestrials. The Groaci are often called simple people, however. They have several cultural events, such as folk festivals, chamber choirs, and light concerts. "
              },
              {
                "worker_id": "10",
                "uid": "9b348a8582824644b70014ef5d74b953",
                "response_text": "The Madman From Earth is set on the planet of Groac, where the Terrans have had a Terrestrial Consulate General for less than nine years. The consulate contains offices for the Ministry of Culture of the Groacian Autonomy staff like Retief and Miss Meuhl as well as their living quarters. Relations between the Terrans and the Groacians have been peaceful, but there are some subjects that are off limits to discuss with the Groacians, such as the disappearance of a Terran ship, ISV Terrific, nine years ago. Retief is the new Consul, and is planning on digging into this controversial topic directly with the Groacians, creating a very tense atmosphere.\nIn the city, there are windowless stucco facades on the buildings lining the street, and  the Groacians avoid the Terrans as they pass. There are high-wheeled ground cars and the environment has clean and cool air. Retief enters a Groacian bar that serves clay pots of an alcoholic drink that could harm humans from a pit in the center of the room. When Retief is escorted out of the city by Fith and Shluh, they take him to a natural crevasse with thick veins of high-grade iron ore in the rock that they claim the vessel, ISV Terrific, was lowered into and then it was covered with a roof to avoid detection. The land around the city is dusty like a desert, and Terrans are generally forbidden from traveling through these areas or visiting Groac’s satellite, which is part of their cover-up of what happened to the ISV Terrific."
              },
              {
                "worker_id": "2",
                "uid": "c41eb690db154c64ab4ab86b68e93ea0",
                "response_text": "The story takes place on the planet inhabited by the Groacians, specifically in the Terrestrial Consulate, a bar, and a cavern. The Consul for the Terrestrial States has been open on the planet for almost nine years, opening not long after the ISV Terrific B7 New Terra Terrestrial cruiser went missing in the sector. The Consul is in a building protected by a safelock and communicates with the Regional Headquarters via a video communication system. The Consul has a needle gun for protection and keeps food and water on hand; it has quarters in the building for the staff as well.\n\tGroac is civilized and orderly. The Groacians have an Archives and museum for their local history, but it is off-limits to Terrestrials. Buildings have deeply carved, windowless stucco facades lining the streets, and Groacs travel by flimsy, high-wheeled ground cars. The air on the planet is clean and cool. Carvings over the doorways of buildings indicate the businesses housed within; one such business is a bar. The bar features a bar pit at the center of the room, and drinks are served in clay pots. They have culture, too, with light concerts, chamber music, and folk-art festivals. There is a Foreign Office that handles foreign matters and maintains files regarding its dealings.\n\tThe Groaci, however, have a deep dislike of Terrestrials. They avoid them on the streets, refuse service, and drunkenly slur insults at them. The Groaci government was overhauled after an investigation of a missing cruiser; after this, the Terrestrial consul was established. \n\tRetief is taken to a cavern to see the ISV Terrific, but it turns out not to be the real ISV Terrific. The Groaci authorities claim they hauled it there, nine miles from where it landed, placing it in a natural crevasse and roofing it over with high-grade iron ore. The ship has curving flanks and a space-burned hull. The instrument panels are empty, bolts have been sheared, scraps of paper and wire are lying around. Cutting torches have been used to remove the heavy shielding.\n"
              }
            ]
          },
          {
            "question_text": "Who are Fith and Shluh and what are their roles in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "8",
                "uid": "859d15ea77e145aab1af8b304e005f78",
                "response_text": "Fith is a Groacian who works with the Terrestrial Desk at the Ministry of Foreign Affairs. His associate, Shluh, is the police chief of the Internal Police. While both are Groacians, they speak to Retief in a lisping Terran and wear heavy eye-shields and elaborately-decorated crest ornaments indicating their rank. Fith does most of the talking as he attempts to convince Retief to cease his inquiries into the ISV Terrific, and Shluh is there primarily as a tool with which to threaten Retief. When the two Groacians first meet Retief, they accuse him of attacking a Groacian national, which Retief admits to, but he quickly reveals what the national confessed to him about the fate of ISV Terrific's crew. Although Miss Meuhl is sympathetic to the supposed sensitive nature of the Groaci, Retief distrusts them wholly, and when Fith and Shluh eventually confess to hiding the ISV Terrific, he further distrusts their sincerity of contrition and accuses them of showing him a lifeboat instead of the missing cruiser. This accusation infuriates Fith, who threatens to have Shluh's attending officers arrest Retief on the spot. Later, following Retief's break-in at the Foreign Ministry, Fith appoints Miss Meuh as Consul for the Terrestrial States and orders Shluh to arrest Retief."
              },
              {
                "worker_id": "6",
                "uid": "22ed0051fe8d4216be3cb4e8190710a6",
                "response_text": "Fith, of the Terrestrial Desk, Ministry of Foreign Affairs, and Shluh, Internal Police, show their rank through their ornamental uniforms and sturdy eye-shields. Fith and Shluh meet Retief after he has been accused of assaulting a Groacian civilian, which he readily admits to. Fith and Shluh accompany Retief on his journey of discovering the mystery of the ISV Terrific crash and human discovery on Groac. Although at first they try and hide what happened, Retief soon learns the truth about those Terrestrials. Fith reveals that all six of the Terrestrials used in the parade died due to malnourishment and the Groaci’s unfamiliarity with the needs of humans. Although Fith and Shluh help Retief in some ways, they also greatly hinder the process by attempting to keep this all under wraps. The story ends with Fith and Shluh along with many other Groaci police officers barging into the Consul’s office armed and ready to arrest Retief. "
              },
              {
                "worker_id": "10",
                "uid": "9b348a8582824644b70014ef5d74b953",
                "response_text": "Fith is from the Terrestrial Desk of the Ministry of Foreign Affairs for the planet Groac, and Shluh is an official of their Internal Police. They are first introduced when they show up to Retief's Terrestrial Consulate office on Groac to question him about a report of a drunkard who was beaten on the street. Fith’s role is largely to protect the interests of the planet Groac, who Retief is threatening with his offensive investigations into the disappearance of the ISV Terrific, which Groacians claim the Terrans falsely accuse them of capturing nine years ago. Although Fith admits to the cover up of the vessel, it appears he is concealing a much larger secret that Retief uncovers when he notices they are showing him only a small lifeboat from ISV Terrific and claiming that they know nothing further. Then, Fith and Shuhl become forceful and violent with Retief when he presses about the heavy cruising ship - the real ISV Terrific - that the small lifeboat came from. \nShluh commands the Internal Police, and enforces the wishes of Fith faithfully throughout the story. This is seen when Shluh and four of his constables apprehend Retief at the cavern and forcefully escort him back to the city, and again when they enter the Terran consulate armed to take Retief into custody.\n"
              },
              {
                "worker_id": "2",
                "uid": "c41eb690db154c64ab4ab86b68e93ea0",
                "response_text": "Fith works at the Terrestrial Desk of the Ministry of Foreign Affairs, and Shluh is the chief of the Internal Police. These authorities first deny Retief’s claims, then give him some information hoping to satisfy him, but ultimately turn against him and try to block his further investigation into the events nine years ago. When we first see them, the two men question Retief about his beating of the drunk Groacian from the bar, but Retief counters by asking them questions about the ISV Terrific. Retief reveals that the drunken man told him certain information, and Fith indicates he will ask for Retief’s recall and claims he would do more if Retief didn’t have diplomatic immunity. While Retief tells them what he knows and then inquires how the people from the ISV Terrific died, proffering several suggestions, Fith becomes so worked up that he begins answering the questions. He admits the humans died from illness but claims the Groacians tried to keep them alive but didn’t know how. He also asserts that the Groacians were unaware of the severity of their actions until the investigation was held. They were afraid to tell what had happened and hid the ship. When the investigators left, they replaced their government and opened diplomatic relations with the Terrestrials. To persuade Retief of their sincerity, Fith offers to show Retief the ship and takes him to a ship hidden in a cavern. However, Retief recognizes that the ship they show him is not the ISV Terrific and confronts Fith with this fact, leading Shluh to have his four armed constables surround Retief. Fith then warns Retief not to go far from the consulate and to drop his inquiries about the government. At the end of the story, the two men come to the consulate to remove Retief for questioning and respond to Miss Meuhl as Consul now. "
              }
            ]
          },
          {
            "question_text": "What is the significance of the ISV Terrific in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "8",
                "uid": "859d15ea77e145aab1af8b304e005f78",
                "response_text": "The ISV Terrific, full name ISV Terrific B7 New Terra, was a Terrestrial cruiser gone missing nine years prior to the events of the story. The vessel landed on Groac and its crew was captured and paraded through the streets by the Groaci. The crew died of mysterious causes and the vessel was hidden in a cavern and undetectable by investigators thanks to large veins of high-grade iron ore under the planet's surface. After a Terrestrial investigation failed to uncover the cruiser, a Groacian coup d'etat replaced the government in the time before the establishment of the Terrestrial Consulate General. Fith and Shluh deny any wrongdoing related to the deaths of the crewmembers when Retief confronts them about the situation, insisting that the crew died because the Groaci were ignorant about the Terran diet. They do, however, admit that they hid the cruiser. When they lead Retief to the ship, he observes its state of disrepair: A thick layer of dust covers the deck, stanchions, acceleration couches, instrument panels, sheared bolts, and scraps of wire and paper strewn about the control compartment. Then, Retief accuses them of attempting to continue their deception by showing him a lifeboat instead of the actual cruiser. This enrages Fith. The disappearance of the ISV Terrific, the coup d'etat that followed, and the subsequent incompetent Terrestrial investigation had led Retief to conduct the investigation in the first place and ultimately reveal that the Groacians are trying to hide something more sinister."
              },
              {
                "worker_id": "6",
                "uid": "22ed0051fe8d4216be3cb4e8190710a6",
                "response_text": "The ISV Terrific is a Terrestrial spaceship that crashed on Groac nine years before the story begins. It is significant because it marks the first Terrestrial contact with the Groaci, in fact, the first alien contact at all. The crew of the ISV Terrific were captured and paraded through the streets like animals in a zoo. They all later died due to malnourishment and dehydration, or so the Groaci claim. The ISV Terrific is significant because it acts as the catalyst for much of the conflict in this story, as Retief sets down a path to discover the truth and reveal what was long ago covered up. "
              },
              {
                "worker_id": "10",
                "uid": "9b348a8582824644b70014ef5d74b953",
                "response_text": "The ISV Terrific was a heavy, interplanetary cruising vessel, weighing about twenty thousand tons, that was mysteriously lost on the planet Groac nine years ago. When the Terrans questioned the Grocians about their vessel, the Groacians covered up the fact that the ship did land on their planet to the east of the city and there were humans that all died after falling ill because the Groacians did not understand what to feed them. \nThe ISV Terrific is significant in the story because it is Retief’s singular focus to solve its disappearance. Retief is highly suspicious of why his fellow colleagues at the consulate are afraid to investigate the incident any further.  The Groacians treat the incident as an embarrassment, as if the Terrans had wrongly accused them. But Retief is intent on getting to the bottom of it. At first, he is able to get some information from Fith, who admits to covering up the ship and the death of the humans that fell ill. When Retief arrives at the cavern that the Groacians have hidden the ship in, he uncovers a further mystery. The ship they show him is only a hundred-ton lifeboat of the ISV Terrific, marked 'IVS Terrific B7 New Terra’ on the bow. The real ISV Terrific is somewhere else.\nRetief does not give up on his quest, despite the threats of the Groacian officials, and pushes on into the night by breaking into the Archives to obtain the records from nine years ago to find out where the ISV Terrific is.\n"
              },
              {
                "worker_id": "2",
                "uid": "c41eb690db154c64ab4ab86b68e93ea0",
                "response_text": "The ISV Terrific is the reason for Retief’s appointment as Consul on Groac. The ship was a Terrestrial cruiser that went missing nine years ago in the Groaci sector of the galaxy. Consul Retief is trying to track down the ship and discover what happened to the passengers. He suspects that the ship crashed on the Groaci’s planet and that the Groaci killed the people on it. He is on a mission to answer these questions. He first asks Miss Meuhl what she knows about it. She refuses to discuss it, siding with the Groacis and defending them as a very sensitive race and stating she is ashamed of how they were treated when the investigation was conducted. Retief tries to enter the Archives and local museum to search for information but is denied entry. \nBut he stumbles on a clue in a bar when a drunken Groaci points at him and says they need to find a proper cage for him; Retief follows the drunk out of the bar and learns that the Groaci captured the passengers and caged, paraded, and exhibited them. Fith and Shluh admit that these Terrestrials died but that the Groaci tried to keep them alive but didn’t know what foods they ate. They fell ill one by one and died. The Groaci claim that they didn’t realize the significance of the humans until the warships came to investigate, and then the Groaci were afraid to say anything. Afterward, they got rid of their government, replaced it with a new one, hid the ship, and invited diplomatic relations with the Terrestrials. Fith and Shluh also reveal that the ship didn’t crash but landed intact and claim that the ship is hidden in a cavern now and offer to show it to Retief. However, Retief recognizes that the ship they show him is not the ISV Terrific  but is, instead, a lifeboat. To get to the bottom of the mystery, Retief breaks into the Foreign Ministry during the night and finds answers to his questions, but before he can transmit the information that he has learned, Miss Meuhl notifies the Regional Headquarters of his actions, having him removed as consul, and allows the Groaci into the consulate to take Retief into custody.\nThus, the ISV Terrific is the basis for interplanetary hostilities, the opening of a diplomatic channel between the Groacians and the Terrestrials, the overthrow of the Groaci government, and an unsolved mystery that could reopen hostilities when the truth of the matter is revealed.\n"
              }
            ]
          },
          {
            "question_text": "Who is Miss Meuhl and what is her role in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "8",
                "uid": "859d15ea77e145aab1af8b304e005f78",
                "response_text": "Miss Yolanda Meuhl is the Administrative Assistant of The Consul for the Terrestrial States Retief, the replacement for Consul Whaffle who left the post three months prior. Miss Meuhl wears glasses, uses a dictyper, and takes her position at the Consulate extremely seriously. She faithfully executes her duties as an administrative assistant without question, which leads her to develop a blind trust in authority as well as the Groaci race, according to Retief.  Miss Meuhl considers the Groaci to be a sensitive race and defends them against Retief's constant accusations of misconduct. She threatens to report Retief to the Regional Headquarters when he continues to act against the guidelines set forth by the Corps. Her commitment to diplomatic relations ensures that she takes the side of the Groaci in nearly every matter; she even excuses when Fith and Shluh admit to hiding the Terrestrial cruiser. When Retief orders Miss Meuhl to lock herself inside the office while he goes to break into the Foreign Ministry, Miss Meuhl calls the Regional Headquarters and makes a full report of his actions. When he returns, Counsellor Pardy calls and relieves Retief of his post. Then, a Groacian official calls and appoints Miss Meuhl to the post vacated by Retief, which she accepts. She then allows the Groacian officials to enter the office in order to arrest Retief."
              },
              {
                "worker_id": "6",
                "uid": "22ed0051fe8d4216be3cb4e8190710a6",
                "response_text": "Miss Meuhl is Retief’s secretary and administrative assistant at the Groac Embassy for Terrestrials. She is used to serving the former consul, Whaffle, who was happy to go along with all the cultural ploys and let her do much of the writing. Retief, however, takes things into his own hands and immediately starts investigating a covered-up crime. Miss Meuhl does not approve of his actions and argues with Retief throughout the entire story. In the end, Miss Meuhl essentially betrays his trust and allows the Groaci to take Retief away, making her the new Consul. She would rather side with them to keep the peace than discover the truth, a trait that Retief abhorred. "
              },
              {
                "worker_id": "10",
                "uid": "9b348a8582824644b70014ef5d74b953",
                "response_text": "Miss Yolanda Meuhl, DAO-9 is the Administrative Assistant to the Terran diplomat within the Ministry of Culture of the Groacian Autonomy, stationed at the Terrestrial Consulate General of the planet Groac. She used to serve Consul Whaffle, who was replaced with Consul Retief three months ago. She is not happy about assisting Retief, who she feels is deeply unfit to be a diplomat. She objects to nearly everything that Retief does during the course of the story, and only obliges when the task might gain her some information she can use against Retief in the future. Such as when she obliges to record the conversation Retief has with Fith and Shuhl when they question him about the drunkard he beat up. Or when she accepts locking herself in their consulate office when Retief goes to investigate the whereabouts of the vessel Terrific against the will of the Groacian officials, so that she can transmit a report to get Retief dismissed to their Regional Headquarters. After she turns against Retief, she is assigned his position as Consul by the Regional Headquarters and plays the role of a villain when she immediately betrays Retief by waiving his diplomatic protections before the Groacian authorities."
              },
              {
                "worker_id": "2",
                "uid": "c41eb690db154c64ab4ab86b68e93ea0",
                "response_text": "Miss Meuhl is the Administrative Assistant to the Consul for the Terrestrial States on Groac. She has held that position for over four years and believes she knows better than Consul Retief, who has only been there three months, what he should do and say. She frequently references the previous Consul as an example of what Retief should do and how he should act. When Retief brings up questions about the replacement of the government and the Groacis’ role in the missing ISV Terrific, Miss Meuhl sides with the Groaci, stating that they are a very sensitive, cultured, gentle race and were treated very poorly during the inquiry that followed the disappearance of the ship. When Fith and Shluh arrive to question Retief about his role in beating a Groaci, she is appalled. She refuses to be a party to his conversation with the authorities until Retief forces her because he needs her to record the discussion. When Retief leaves with the authorities to see the ship, he trusts Miss Meuhl to transmit the recording to the Regional Headquarters if he doesn’t return in a reasonable amount of time. When Retief later continues his investigation under cover of night, he warns Miss Meuhl she is in danger and not to leave the consulate; he also warns her not to trust the Groaci. While he is gone, Miss Meuhl reports his activities to the Regional Headquarters, having him dismissed from his post and replaced by Miss Meuhl. When Groaci authorities arrive to question Retief, they already know that Miss Meuhl is in charge. She unlocks the safelock so that they can enter, and she revokes Retief’s diplomatic immunity and has them remove Retief from the office area. Miss Meuhl thwarts Retief every step of the way as he tries to learn the truth about the people who were on the ISV Terrific and ultimately gains his consulate post for herself.\n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5041,
        "document_length_chars": 30257
      }
    }
  ]
}