{
  "item_metadata": {
    "item_id": "61146",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61146",
      "content": "\n\n\n\nProduced by Greg Weeks, Mary Meehan and the Online\nDistributed Proofreading Team at http://www.pgdp.net\nRETIEF OF THE RED-TAPE MOUNTAIN\nby KEITH LAUMER\nRetief knew the importance of sealed\n   \n  orders—and the need to keep them that way!\n \n  [Transcriber's Note: This etext was produced from\n   \n  Worlds of If Science Fiction, May 1962.\n   \n  Extensive research did not uncover any evidence that\n   \n  the U.S. copyright on this publication was renewed.]\n\"It's true,\" Consul Passwyn said, \"I requested assignment as principal\nofficer at a small post. But I had in mind one of those charming resort\nworlds, with only an occasional visa problem, or perhaps a distressed\nspaceman or two a year. Instead, I'm zoo-keeper to these confounded\nsettlers. And not for one world, mind you, but eight!\" He stared glumly\nat Vice-Consul Retief.\n \n  \"Still,\" Retief said, \"it gives an opportunity to travel—\"\n \n  \"Travel!\" the consul barked. \"I hate travel. Here in this backwater\nsystem particularly—\" He paused, blinked at Retief and cleared his\nthroat. \"Not that a bit of travel isn't an excellent thing for a\njunior officer. Marvelous experience.\"\n \n  He turned to the wall-screen and pressed a button. A system triagram\nappeared: eight luminous green dots arranged around a larger disk\nrepresenting the primary. He picked up a pointer, indicating the\ninnermost planet.\n \n  \"The situation on Adobe is nearing crisis. The confounded settlers—a\nmere handful of them—have managed, as usual, to stir up trouble with\nan intelligent indigenous life form, the Jaq. I can't think why they\nbother, merely for a few oases among the endless deserts. However I\nhave, at last, received authorization from Sector Headquarters to\ntake certain action.\" He swung back to face Retief. \"I'm sending you\nin to handle the situation, Retief—under sealed orders.\" He picked\nup a fat buff envelope. \"A pity they didn't see fit to order the\nTerrestrial settlers out weeks ago, as I suggested. Now it is too late.\nI'm expected to produce a miracle—a rapprochement between Terrestrial\nand Adoban and a division of territory. It's idiotic. However, failure\nwould look very bad in my record, so I shall expect results.\"\n \n  He passed the buff envelope across to Retief.\n \n  \"I understood that Adobe was uninhabited,\" Retief said, \"until the\nTerrestrial settlers arrived.\"\n \n  \"Apparently, that was an erroneous impression.\" Passwyn fixed Retief\nwith a watery eye. \"You'll follow your instructions to the letter. In a\ndelicate situation such as this, there must be no impulsive, impromptu\nelement introduced. This approach has been worked out in detail at\nSector. You need merely implement it. Is that entirely clear?\"\n \n  \"Has anyone at Headquarters ever visited Adobe?\"\n \n  \"Of course not. They all hate travel. If there are no other questions,\nyou'd best be on your way. The mail run departs the dome in less than\nan hour.\"\n \n  \"What's this native life form like?\" Retief asked, getting to his feet.\n \n  \"When you get back,\" said Passwyn, \"you tell me.\"\nThe mail pilot, a leathery veteran with quarter-inch whiskers, spat\ntoward a stained corner of the compartment, leaned close to the screen.\n \n  \"They's shootin' goin' on down there,\" he said. \"See them white puffs\nover the edge of the desert?\"\n \n  \"I'm supposed to be preventing the war,\" said Retief. \"It looks like\nI'm a little late.\"\n \n  The pilot's head snapped around. \"War?\" he yelped. \"Nobody told me they\nwas a war goin' on on 'Dobe. If that's what that is, I'm gettin' out of\nhere.\"\n \n  \"Hold on,\" said Retief. \"I've got to get down. They won't shoot at you.\"\n \n  \"They shore won't, sonny. I ain't givin' 'em the chance.\" He started\npunching keys on the console. Retief reached out, caught his wrist.\n \n  \"Maybe you didn't hear me. I said I've got to get down.\"\n \n  The pilot plunged against the restraint, swung a punch that Retief\nblocked casually. \"Are you nuts?\" the pilot screeched. \"They's plenty\nshootin' goin' on fer me to see it fifty miles out.\"\n \n  \"The mail must go through, you know.\"\n \n  \"Okay! You're so dead set on gettin' killed, you take the skiff. I'll\ntell 'em to pick up the remains next trip.\"\n \n  \"You're a pal. I'll take your offer.\"\n \n  The pilot jumped to the lifeboat hatch and cycled it open. \"Get in.\nWe're closin' fast. Them birds might take it into their heads to lob\none this way....\"\n \n  Retief crawled into the narrow cockpit of the skiff, glanced over the\ncontrols. The pilot ducked out of sight, came back, handed Retief a\nheavy old-fashioned power pistol. \"Long as you're goin' in, might as\nwell take this.\"\n \n  \"Thanks.\" Retief shoved the pistol in his belt. \"I hope you're wrong.\"\n \n  \"I'll see they pick you up when the shootin's over—one way or another.\"\n \n  The hatch clanked shut. A moment later there was a jar as the skiff\ndropped away, followed by heavy buffeting in the backwash from the\ndeparting mail boat. Retief watched the tiny screen, hands on the\nmanual controls. He was dropping rapidly: forty miles, thirty-nine....\n \n  A crimson blip showed on the screen, moving out.\n \n  Retief felt sweat pop out on his forehead. The red blip meant heavy\nradiation from a warhead. Somebody was playing around with an outlawed\nbut by no means unheard of fission weapon. But maybe it was just on a\nhigh trajectory and had no connection with the skiff....\n \n  Retief altered course to the south. The blip followed.\n \n  He checked instrument readings, gripped the controls, watching. This\nwas going to be tricky. The missile bored closer. At five miles Retief\nthrew the light skiff into maximum acceleration, straight toward the\noncoming bomb. Crushed back in the padded seat, he watched the screen,\ncorrecting course minutely. The proximity fuse should be set for no\nmore than 1000 yards.\n \n  At a combined speed of two miles per second, the skiff flashed past\nthe missile, and Retief was slammed violently against the restraining\nharness in the concussion of the explosion ... a mile astern, and\nharmless.\n \n  Then the planetary surface was rushing up with frightening speed.\nRetief shook his head, kicked in the emergency retro-drive. Points\nof light arced up from the planet face below. If they were ordinary\nchemical warheads the skiff's meteor screens should handle them. The\nscreen flashed brilliant white, then went dark. The skiff flipped on\nits back. Smoke filled the tiny compartment. There was a series of\nshocks, a final bone-shaking concussion, then stillness, broken by the\nping of hot metal contracting.\nCoughing, Retief disengaged himself from the shock-webbing. He beat\nout sparks in his lap, groped underfoot for the hatch and wrenched it\nopen. A wave of hot jungle air struck him. He lowered himself to a bed\nof shattered foliage, got to his feet ... and dropped flat as a bullet\nwhined past his ear.\n \n  He lay listening. Stealthy movements were audible from the left.\n \n  He inched his way to the shelter of a broad-boled dwarf tree. Somewhere\na song lizard burbled. Whining insects circled, scented alien life,\nbuzzed off. There was another rustle of foliage from the underbrush\nfive yards away. A bush quivered, then a low bough dipped.\n \n  Retief edged back around the trunk, eased down behind a fallen log.\nA stocky man in grimy leather shirt and shorts appeared, moving\ncautiously, a pistol in his hand.\n \n  As he passed, Retief rose, leaped the log and tackled him.\n \n  They went down together. The stranger gave one short yell, then\nstruggled in silence. Retief flipped him onto his back, raised a fist—\n \n  \"Hey!\" the settler yelled. \"You're as human as I am!\"\n \n  \"Maybe I'll look better after a shave,\" said Retief. \"What's the idea\nof shooting at me?\"\n \n  \"Lemme up. My name's Potter. Sorry 'bout that. I figured it was a\nFlap-jack boat; looks just like 'em. I took a shot when I saw something\nmove. Didn't know it was a Terrestrial. Who are you? What you doin'\nhere? We're pretty close to the edge of the oases. That's Flap-jack\ncountry over there.\" He waved a hand toward the north, where the desert\nlay.\n \n  \"I'm glad you're a poor shot. That missile was too close for comfort.\"\n \n  \"Missile, eh? Must be Flap-jack artillery. We got nothing like that.\"\n \n  \"I heard there was a full-fledged war brewing,\" said Retief. \"I didn't\nexpect—\"\n \n  \"Good!\" Potter said. \"We figured a few of you boys from Ivory would be\njoining up when you heard. You are from Ivory?\"\n \n  \"Yes. I'm—\"\n \n  \"Hey, you must be Lemuel's cousin. Good night! I pretty near made a bad\nmistake. Lemuel's a tough man to explain something to.\"\n \n  \"I'm—\"\n \n  \"Keep your head down. These damn Flap-jacks have got some wicked hand\nweapons. Come on....\" He moved off silently on all fours. Retief\nfollowed. They crossed two hundred yards of rough country before Potter\ngot to his feet, took out a soggy bandana and mopped his face.\n \n  \"You move good for a city man. I thought you folks on Ivory just sat\nunder those domes and read dials. But I guess bein' Lemuel's cousin you\nwas raised different.\"\n \n  \"As a matter of fact—\"\n \n  \"Have to get you some real clothes, though. Those city duds don't stand\nup on 'Dobe.\"\n \n  Retief looked down at the charred, torn and sweat-soaked powder-blue\nblazer and slacks.\n \n  \"This outfit seemed pretty rough-and-ready back home,\" he said. \"But I\nguess leather has its points.\"\n \n  \"Let's get on back to camp. We'll just about make it by sundown.\nAnd, look. Don't say anything to Lemuel about me thinking you were a\nFlap-jack.\"\n \n  \"I won't, but—\"\n \n  Potter was on his way, loping off up a gentle slope. Retief pulled off\nthe sodden blazer, dropped it over a bush, added his string tie and\nfollowed Potter.\nII\n \n  \"We're damn glad you're here, mister,\" said a fat man with two\nrevolvers belted across his paunch. \"We can use every hand. We're in\nbad shape. We ran into the Flap-jacks three months ago and we haven't\nmade a smart move since. First, we thought they were a native form we\nhadn't run into before. Fact is, one of the boys shot one, thinkin' it\nwas fair game. I guess that was the start of it.\" He stirred the fire,\nadded a stick.\n \n  \"And then a bunch of 'em hit Swazey's farm here,\" Potter said. \"Killed\ntwo of his cattle, and pulled back.\"\n \n  \"I figure they thought the cows were people,\" said Swazey. \"They were\nout for revenge.\"\n \n  \"How could anybody think a cow was folks?\" another man put in. \"They\ndon't look nothin' like—\"\n \n  \"Don't be so dumb, Bert,\" said Swazey. \"They'd never seen Terries\nbefore. They know better now.\"\n \n  Bert chuckled. \"Sure do. We showed 'em the next time, didn't we,\nPotter? Got four.\"\n \n  \"They walked right up to my place a couple days after the first time,\"\nSwazey said. \"We were ready for 'em. Peppered 'em good. They cut and\nrun.\"\n \n  \"Flopped, you mean. Ugliest lookin' critters you ever saw. Look just\nlike a old piece of dirty blanket humpin' around.\"\n \n  \"It's been goin' on this way ever since. They raid and then we raid.\nBut lately they've been bringing some big stuff into it. They've got\nsome kind of pint-sized airships and automatic rifles. We've lost four\nmen now and a dozen more in the freezer, waiting for the med ship. We\ncan't afford it. The colony's got less than three hundred able-bodied\nmen.\"\n \n  \"But we're hanging onto our farms,\" said Potter. \"All these oases are\nold sea-beds—a mile deep, solid topsoil. And there's a couple of\nhundred others we haven't touched yet. The Flap-jacks won't get 'em\nwhile there's a man alive.\"\n \n  \"The whole system needs the food we can raise,\" Bert said. \"These farms\nwe're trying to start won't be enough but they'll help.\"\n \n  \"We been yellin' for help to the CDT, over on Ivory,\" said Potter. \"But\nyou know these Embassy stooges.\"\n \n  \"We heard they were sending some kind of bureaucrat in here to tell\nus to get out and give the oases to the Flap-jacks,\" said Swazey. He\ntightened his mouth. \"We're waitin' for him....\"\n \n  \"Meanwhile we got reinforcements comin' up, eh, boys?\" Bert winked at\nRetief. \"We put out the word back home. We all got relatives on Ivory\nand Verde.\"\n \n  \"Shut up, you damn fool!\" a deep voice grated.\n \n  \"Lemuel!\" Potter said. \"Nobody else could sneak up on us like that.\"\n \n  \"If I'd a been a Flap-jack; I'd of et you alive,\" the newcomer said,\nmoving into the ring of fire, a tall, broad-faced man in grimy leather.\nHe eyed Retief.\n \n  \"Who's that?\"\n \n  \"What do ya mean?\" Potter spoke in the silence. \"He's your cousin....\"\n \n  \"He ain't no cousin of mine,\" Lemuel said slowly. He stepped to Retief.\n \n  \"Who you spyin' for, stranger?\" he rasped.\nRetief got to his feet. \"I think I should explain—\"\n \n  A short-nosed automatic appeared in Lemuel's hand, a clashing note\nagainst his fringed buckskins.\n \n  \"Skip the talk. I know a fink when I see one.\"\n \n  \"Just for a change, I'd like to finish a sentence,\" said Retief. \"And I\nsuggest you put your courage back in your pocket before it bites you.\"\n \n  \"You talk too damned fancy to suit me.\"\n \n  \"Maybe. But I'm talking to suit me. Now, for the last time, put it\naway.\"\n \n  Lemuel stared at Retief. \"You givin' me orders...?\"\n \n  Retief's left fist shot out, smacked Lemuel's face dead center. He\nstumbled back, blood starting from his nose; the pistol fired into the\ndirt as he dropped it. He caught himself, jumped for Retief ... and met\na straight right that snapped him onto his back: out cold.\n \n  \"Wow!\" said Potter. \"The stranger took Lem ... in two punches!\"\n \n  \"One,\" said Swazey. \"That first one was just a love tap.\"\n \n  Bert froze. \"Hark, boys,\" he whispered. In the sudden silence a night\nlizard called. Retief strained, heard nothing. He narrowed his eyes,\npeered past the fire—\n \n  With a swift lunge he seized up the bucket of drinking water, dashed it\nover the fire, threw himself flat. He heard the others hit the dirt a\nsplit second behind him.\n \n  \"You move fast for a city man,\" breathed Swazey beside him. \"You see\npretty good too. We'll split and take 'em from two sides. You and Bert\nfrom the left, me and Potter from the right.\"\n \n  \"No,\" said Retief. \"You wait here. I'm going out alone.\"\n \n  \"What's the idea...?\"\n \n  \"Later. Sit tight and keep your eyes open.\" Retief took a bearing on a\ntreetop faintly visible against the sky and started forward.\nFive minutes' stealthy progress brought him to a slight rise of ground.\nWith infinite caution he raised himself, risking a glance over an\nout-cropping of rock.\n \n  The stunted trees ended just ahead. Beyond, he could make out the dim\ncontour of rolling desert. Flap-jack country. He got to his feet,\nclambered over the stone—still hot after a day of tropical heat—and\nmoved forward twenty yards. Around him he saw nothing but drifted sand,\npalely visible in the starlight, and the occasional shadow of jutting\nshale slabs. Behind him the jungle was still.\n \n  He sat down on the ground to wait.\n \n  It was ten minutes before a movement caught his eye. Something had\nseparated itself from a dark mass of stone, glided across a few yards\nof open ground to another shelter. Retief watched. Minutes passed. The\nshape moved again, slipped into a shadow ten feet distant. Retief felt\nthe butt of the power pistol with his elbow. His guess had better be\nright this time....\n \n  There was a sudden rasp, like leather against concrete, and a flurry of\nsand as the Flap-jack charged.\n \n  Retief rolled aside, then lunged, threw his weight on the flopping\nFlap-jack—a yard square, three inches thick at the center and all\nmuscle. The ray-like creature heaved up, curled backward, its edge\nrippling, to stand on the flattened rim of its encircling sphincter.\nIt scrabbled with prehensile fringe-tentacles for a grip on Retief's\nshoulders. He wrapped his arms around the alien and struggled to his\nfeet. The thing was heavy. A hundred pounds at least. Fighting as it\nwas, it seemed more like five hundred.\n \n  The Flap-jack reversed its tactics, went limp. Retief grabbed, felt a\nthumb slip into an orifice—\n \n  The alien went wild. Retief hung on, dug the thumb in deeper.\n \n  \"Sorry, fellow,\" he muttered between clenched teeth. \"Eye-gouging isn't\ngentlemanly, but it's effective....\"\n \n  The Flap-jack fell still, only its fringes rippling slowly. Retief\nrelaxed the pressure of his thumb; the alien gave a tentative jerk; the\nthumb dug in.\n \n  The alien went limp again, waiting.\n \n  \"Now we understand each other,\" said Retief. \"Take me to your leader.\"\nTwenty minutes' walk into the desert brought Retief to a low rampart\nof thorn branches: the Flap-jacks' outer defensive line against Terry\nforays. It would be as good a place as any to wait for the move by the\nFlap-jacks. He sat down and eased the weight of his captive off his\nback, but kept a firm thumb in place. If his analysis of the situation\nwas correct, a Flap-jack picket should be along before too long....\n \n  A penetrating beam of red light struck Retief in the face, blinked off.\nHe got to his feet. The captive Flap-jack rippled its fringe in an\nagitated way. Retief tensed his thumb in the eye-socket.\n \n  \"Sit tight,\" he said. \"Don't try to do anything hasty....\" His remarks\nwere falling on deaf ears—or no ears at all—but the thumb spoke as\nloudly as words.\n \n  There was a slither of sand. Another. He became aware of a ring of\npresences drawing closer.\n \n  Retief tightened his grip on the alien. He could see a dark shape now,\nlooming up almost to his own six-three. It looked like the Flap-jacks\ncame in all sizes.\n \n  A low rumble sounded, like a deep-throated growl. It strummed on, faded\nout. Retief cocked his head, frowning.\n \n  \"Try it two octaves higher,\" he said.\n \n  \"Awwrrp! Sorry. Is that better?\" a clear voice came from the darkness.\n \n  \"That's fine,\" Retief said. \"I'm here to arrange a prisoner exchange.\"\n \n  \"Prisoners? But we have no prisoners.\"\n \n  \"Sure you have. Me. Is it a deal?\"\n \n  \"Ah, yes, of course. Quite equitable. What guarantees do you require?\"\n \n  \"The word of a gentleman is sufficient.\" Retief released the alien. It\nflopped once, disappeared into the darkness.\n \n  \"If you'd care to accompany me to our headquarters,\" the voice said,\n\"we can discuss our mutual concerns in comfort.\"\n \n  \"Delighted.\"\n \n  Red lights blinked briefly. Retief glimpsed a gap in the thorny\nbarrier, stepped through it. He followed dim shapes across warm sand to\na low cave-like entry, faintly lit with a reddish glow.\n \n  \"I must apologize for the awkward design of our comfort-dome,\" said the\nvoice. \"Had we known we would be honored by a visit—\"\n \n  \"Think nothing of it,\" Retief said. \"We diplomats are trained to crawl.\"\n \n  Inside, with knees bent and head ducked under the five-foot ceiling,\nRetief looked around at the walls of pink-toned nacre, a floor like\nburgundy-colored glass spread with silken rugs and a low table of\npolished red granite that stretched down the center of the spacious\nroom, set out with silver dishes and rose-crystal drinking-tubes.\nIII\n \n  \"Let me congratulate you,\" the voice said.\n \n  Retief turned. An immense Flap-jack, hung with crimson trappings,\nrippled at his side. The voice issued from a disk strapped to its back.\n\"You fight well. I think we will find in each other worthy adversaries.\"\n \n  \"Thanks. I'm sure the test would be interesting, but I'm hoping we can\navoid it.\"\n \n  \"Avoid it?\" Retief heard a low humming coming from the speaker in the\nsilence. \"Well, let us dine,\" the mighty Flap-jack said at last. \"We\ncan resolve these matters later. I am called Hoshick of the Mosaic of\nthe Two Dawns.\"\n \n  \"I'm Retief.\" Hoshick waited expectantly, \"... of the Mountain of Red\nTape,\" Retief added.\n \n  \"Take place, Retief,\" said Hoshick. \"I hope you won't find our rude\ncouches uncomfortable.\" Two other large Flap-jacks came into the room,\ncommuned silently with Hoshick. \"Pray forgive our lack of translating\ndevices,\" he said to Retief. \"Permit me to introduce my colleagues....\"\n \n  A small Flap-jack rippled the chamber bearing on its back a silver tray\nladen with aromatic food. The waiter served the four diners, filled the\ndrinking tubes with yellow wine. It smelled good.\n \n  \"I trust you'll find these dishes palatable,\" said Hoshick. \"Our\nmetabolisms are much alike, I believe.\" Retief tried the food. It had a\ndelicious nut-like flavor. The wine was indistinguishable from Chateau\nd'Yquem.\n \n  \"It was an unexpected pleasure to encounter your party here,\"\nsaid Hoshick. \"I confess at first we took you for an indigenous\nearth-grubbing form, but we were soon disabused of that notion.\" He\nraised a tube, manipulating it deftly with his fringe tentacles. Retief\nreturned the salute and drank.\n \n  \"Of course,\" Hoshick continued, \"as soon as we realized that you were\nsportsmen like ourselves, we attempted to make amends by providing a\nbit of activity for you. We've ordered out our heavier equipment and a\nfew trained skirmishers and soon we'll be able to give you an adequate\nshow. Or so I hope.\"\n \n  \"Additional skirmishers?\" said Retief. \"How many, if you don't mind my\nasking?\"\n \n  \"For the moment, perhaps only a few hundred. There-after ... well,\nI'm sure we can arrange that between us. Personally I would prefer a\ncontest of limited scope. No nuclear or radiation-effect weapons. Such\na bore, screening the spawn for deviations. Though I confess we've come\nupon some remarkably useful sports. The rangerform such as you made\ncaptive, for example. Simple-minded, of course, but a fantastically\nkeen tracker.\"\n \n  \"Oh, by all means,\" Retief said. \"No atomics. As you pointed out,\nspawn-sorting is a nuisance, and then too, it's wasteful of troops.\"\n \n  \"Ah, well, they are after all expendable. But we agree: no atomics.\nHave you tried the ground-gwack eggs? Rather a specialty of my\nMosaic....\"\n \n  \"Delicious,\" said Retief. \"I wonder. Have you considered eliminating\nweapons altogether?\"\nA scratchy sound issued from the disk. \"Pardon my laughter,\" Hoshick\nsaid, \"but surely you jest?\"\n \n  \"As a matter of fact,\" said Retief, \"we ourselves seldom use weapons.\"\n \n  \"I seem to recall that our first contact of skirmishforms involved the\nuse of a weapon by one of your units.\"\n \n  \"My apologies,\" said Retief. \"The—ah—the skirmishform failed to\nrecognize that he was dealing with a sportsman.\"\n \n  \"Still, now that we have commenced so merrily with weapons....\" Hoshick\nsignaled and the servant refilled tubes.\n \n  \"There is an aspect I haven't yet mentioned,\" Retief went on. \"I hope\nyou won't take this personally, but the fact is, our skirmishforms\nthink of weapons as something one employs only in dealing with certain\nspecific life-forms.\"\n \n  \"Oh? Curious. What forms are those?\"\n \n  \"Vermin. Or 'varmints' as some call them. Deadly antagonists, but\nlacking in caste. I don't want our skirmishforms thinking of such\nworthy adversaries as yourself as varmints.\"\n \n  \"Dear me! I hadn't realized, of course. Most considerate of you to\npoint it out.\" Hoshick clucked in dismay. \"I see that skirmishforms are\nmuch the same among you as with us: lacking in perception.\" He laughed\nscratchily. \"Imagine considering us as—what was the word?—varmints.\"\n \n  \"Which brings us to the crux of the matter. You see, we're up against\na serious problem with regard to skirmishforms. A low birth rate.\nTherefore we've reluctantly taken to substitutes for the mass actions\nso dear to the heart of the sportsman. We've attempted to put an end to\nthese contests altogether....\"\n \n  Hoshick coughed explosively, sending a spray of wine into the air.\n\"What are you saying?\" he gasped. \"Are you proposing that Hoshick of\nthe Mosaic of the Two Dawns abandon honor....?\"\n \n  \"Sir!\" said Retief sternly. \"You forget yourself. I, Retief of the Red\nTape Mountain, make an alternate proposal more in keeping with the\nnewest sporting principles.\"\n \n  \"New?\" cried Hoshick. \"My dear Retief, what a pleasant surprise! I'm\nenthralled with novel modes. One gets so out of touch. Do elaborate.\"\n \n  \"It's quite simple, really. Each side selects a representative and the\ntwo individuals settle the issue between them.\"\n \n  \"I ... um ... fear I don't understand. What possible significance could\none attach to the activities of a couple of random skirmishforms?\"\n \n  \"I haven't made myself clear,\" said Retief. He took a sip of wine. \"We\ndon't involve the skirmishforms at all. That's quite passe.\"\n \n  \"You don't mean...?\"\n \n  \"That's right. You and me.\"\nOutside on the starlit sand Retief tossed aside the power pistol,\nfollowed it with the leather shirt Swazey had lent him. By the faint\nlight he could just make out the towering figure of the Flap-jack\nrearing up before him, his trappings gone. A silent rank of Flap-jack\nretainers were grouped behind him.\n \n  \"I fear I must lay aside the translator now, Retief,\" said Hoshick.\nHe sighed and rippled his fringe tentacles. \"My spawn-fellows will\nnever credit this. Such a curious turn fashion has taken. How much\nmore pleasant it is to observe the action of the skirmishforms from a\ndistance.\"\n \n  \"I suggest we use Tennessee rules,\" said Retief. \"They're very liberal.\nBiting, gouging, stomping, kneeing and of course choking, as well as\nthe usual punching, shoving and kicking.\"\n \n  \"Hmmm. These gambits seem geared to forms employing rigid\nendo-skeletons; I fear I shall be at a disadvantage.\"\n \n  \"Of course,\" Retief said, \"if you'd prefer a more plebeian type of\ncontest....\"\n \n  \"By no means. But perhaps we could rule out tentacle-twisting, just to\neven it.\"\n \n  \"Very well. Shall we begin?\"\n \n  With a rush Hoshick threw himself at Retief, who ducked, whirled, and\nleaped on the Flap-jack's back ... and felt himself flipped clear by\na mighty ripple of the alien's slab-like body. Retief rolled aside\nas Hoshick turned on him; he jumped to his feet and threw a right\nhay-maker to Hoshick's mid-section. The alien whipped his left fringe\naround in an arc that connected with Retief's jaw, sent him spinning\nonto his back ... and Hoshick's weight struck him.\nRetief twisted, tried to roll. The flat body of the alien blanketed\nhim. He worked an arm free, drumming blows on the leathery back.\nHoshick nestled closer.\n \n  Retief's air was running out. He heaved up against the smothering\nweight. Nothing budged.\n \n  It was like burial under a dump-truck-load of concrete.\n \n  He remembered the rangerform he had captured. The sensitive orifice\nhad been placed ventrally, in what would be the thoracic area....\n \n  He groped, felt tough hide set with horny granules. He would be missing\nskin tomorrow ... if there was a tomorrow. His thumb found the orifice\nand probed.\n \n  The Flap-jack recoiled. Retief held fast, probed deeper, groping with\nthe other hand. If the alien were bilaterally symmetrical there would\nbe a set of ready made hand-holds....\nThere were.\n \n  Retief dug in and the Flap-jack writhed, pulled away. Retief held on,\nscrambled to his feet, threw his weight against the alien and fell on\ntop of him, still gouging. Hoshick rippled his fringe wildly, flopped\nin terror, then went limp.\n \n  Retief relaxed, released his hold and got to his feet, breathing hard.\nHoshick humped himself over onto his ventral side, lifted and moved\ngingerly over to the sidelines. His retainers came forward, assisted\nhim into his trappings, strapped on the translator. He sighed heavily,\nadjusted the volume.\n \n  \"There is much to be said for the old system,\" he said. \"What a burden\none's sportsmanship places on one at times.\"\n \n  \"Great sport, wasn't it?\" said Retief. \"Now, I know you'll be eager to\ncontinue. If you'll just wait while I run back and fetch some of our\ngougerforms—\"\n \n  \"May hide-ticks devour the gougerforms!\" Hoshick bellowed. \"You've\ngiven me such a sprong-ache as I'll remember each spawning-time for a\nyear.\"\n \n  \"Speaking of hide-ticks,\" said Retief, \"we've developed a biterform—\"\n \n  \"Enough!\" Hoshick roared, so loudly that the translator bounced on his\nhide. \"Suddenly I yearn for the crowded yellow sands of Jaq. I had\nhoped....\" He broke off, drew a rasping breath. \"I had hoped, Retief,\"\nhe said, speaking sadly now, \"to find a new land here where I might\nplan my own Mosaic, till these alien sands and bring forth such a crop\nof paradise-lichen as should glut the markets of a hundred worlds. But\nmy spirit is not equal to the prospect of biterforms and gougerforms\nwithout end. I am shamed before you....\"\n \n  \"To tell you the truth, I'm old-fashioned myself. I'd rather watch the\naction from a distance too.\"\n \n  \"But surely your spawn-fellows would never condone such an attitude.\"\n \n  \"My spawn-fellows aren't here. And besides, didn't I mention it? No\none who's really in the know would think of engaging in competition by\nmere combat if there were any other way. Now, you mentioned tilling the\nsand, raising lichens—things like that—\"\n \n  \"That on which we dined but now,\" said Hoshick, \"and from which the\nwine is made.\"\n \n  \"The big news in fashionable diplomacy today is farming competition.\nNow, if you'd like to take these deserts and raise lichen, we'll\npromise to stick to the oases and vegetables.\"\n \n  Hoshick curled his back in attention. \"Retief, you're quite serious?\nYou would leave all the fair sand hills to us?\"\n \n  \"The whole works, Hoshick. I'll take the oases.\"\n \n  Hoshick rippled his fringes ecstatically. \"Once again you have outdone\nme, Retief,\" he cried. \"This time, in generosity.\"\n \n  \"We'll talk over the details later. I'm sure we can establish a set of\nrules that will satisfy all parties. Now I've got to get back. I think\nsome of the gougerforms are waiting to see me.\"\nIV\n \n  It was nearly dawn when Retief gave the whistled signal he had agreed\non with Potter, then rose and walked into the camp circle. Swazey stood\nup.\n \n  \"There you are,\" he said. \"We been wonderin' whether to go out after\nyou.\"\n \n  Lemuel came forward, one eye black to the cheekbone. He held out a\nraw-boned hand. \"Sorry I jumped you, stranger. Tell you the truth, I\nthought you was some kind of stool-pigeon from the CDT.\"\n \n  Bert came up behind Lemuel. \"How do you know he ain't, Lemuel?\" he\nsaid. \"Maybe he—\"\n \n  Lemuel floored Bert with a backward sweep of his arm. \"Next\ncotton-picker says some embassy Johnny can cool me gets worse'n that.\"\n \n  \"Tell me,\" said Retief. \"How are you boys fixed for wine?\"\n \n  \"Wine? Mister, we been livin' on stump water for a year now. 'Dobe's\nfatal to the kind of bacteria it takes to ferment likker.\"\n \n  \"Try this.\" Retief handed over a sqat jug. Swazey drew the cork,\nsniffed, drank and passed it to Lemuel.\n \n  \"Mister, where'd you get that?\"\n \n  \"The Flap-jacks make it. Here's another question for you: Would you\nconcede a share in this planet to the Flap-jacks in return for a peace\nguarantee?\"\n \n  At the end of a half hour of heated debate Lemuel turned to Retief.\n\"We'll make any reasonable deal,\" he said. \"I guess they got as much\nright here as we have. I think we'd agree to a fifty-fifty split.\nThat'd give about a hundred and fifty oases to each side.\"\n \n  \"What would you say to keeping all the oases and giving them the\ndesert?\"\n \n  Lemuel reached for the wine jug, eyes on Retief. \"Keep talkin',\nmister,\" he said. \"I think you got yourself a deal.\"\nConsul Passwyn glanced up at Retief, went on perusing a paper.\n \n  \"Sit down, Retief,\" he said absently. \"I thought you were over on\nPueblo, or Mud-flat, or whatever they call that desert.\"\n \n  \"I'm back.\"\n \n  Passwyn eyed him sharply. \"Well, well, what is it you need, man? Speak\nup. Don't expect me to request any military assistance, no matter how\nthings are....\"\n \n  Retief passed a bundle of documents across the desk. \"Here's the\nTreaty. And a Mutual Assistance Pact declaration and a trade agreement.\"\n \n  \"Eh?\" Passwyn picked up the papers, riffled through them. He leaned\nback in his chair, beamed.\n \n  \"Well, Retief. Expeditiously handled.\" He stopped, blinked at Retief.\n\"You seem to have a bruise on your jaw. I hope you've been conducting\nyourself as befits a member of the Embassy staff.\"\n \n  \"I attended a sporting event,\" Retief said. \"One of the players got a\nlittle excited.\"\n \n  \"Well ... it's one of the hazards of the profession. One must\npretend an interest in such matters.\" Passwyn rose, extended a hand.\n\"You've done well, my boy. Let this teach you the value of following\ninstructions to the letter.\"\n \n  Outside, by the hall incinerator drop, Retief paused long enough to\ntake from his briefcase a large buff envelope, still sealed, and drop\nit in the slot.\nEnd of Project Gutenberg's Retief of the Red-Tape Mountain, by Keith Laumer\n\n",
      "metadata": {
        "title": "Retief of the Red-Tape Mountain",
        "author": "Keith Laumer",
        "passage_id": "61146",
        "uid": "ca0040cc3bc740f39e51994855bd284d",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "8",
                "uid": "5763f1a9afc945e3979933028291e984",
                "response_text": " The story begins with Consul Passwyn giving an assignment in a sealed envelope to Vice-Consul Retief, who is a diplomat with the Embassy. His mission is to visit the planet of Adobe and broker a land treaty between the Terrestrial settlers and an invading species, the Jaq. Before Retief leaves, Passwyn stresses the importance of following his orders exactly as written and acknowledges that no one from the Embassy has visited Adobe before, nor do they know the characteristics of the Jaq. Retief gets a ride to Adobe on a mail carrier with the help of a veteran pilot. When the pilot discovers they are entering the planet in the midst of war, he decides to leave on a lifeboat and gives control of the skiff to Retief. Then, Retief crash lands the skiff in order to avoid being blown up by a fission missile that was tracking him on his course. He lands in the middle of an Adoban oasis and immediately encounters a Terrestrial man named Potter, who confuses him for the cousin of one of his associates, Lemuel. Potter tells Retief about his group's history with the Jaqs, whom he refers to as \"Flap-jacks\" due to their wide, flat, tentacled bodies. Along with a team of settlers including Swazey, Lemuel, and Bert, Potter has been spending his days protecting his farms against attacks by the Jaqs after they mistakenly killed one three months prior, having mistaken it for one of the native species. Potter and his team do not trust the Embassy, having heard they are sending a representative to tell them to ceded control of the oases to the Jaqs. When they discover Retief is not Lemuel's cousin, Lemuel confronts Retief, who swiftly establishes his authority by knocking him out cold. When the group senses a Jaq nearby, Retief insists on dealing with the issue by himself. He hunts down the Jaq, they wrestle, and he assumes control by pressing his thumb against the Jaq’s eye hole. The captive Jaq leads Retief to the Jaq headquarters, where he is introduced to their leader, Hoshick. Retief discovers the affability of the species and particularly their penchant for proper sportsmanship. He uses this knowledge to his advantage, and convinces Hoshick that it would be more sportsmanlike to abandon the war efforts and solve their differences through a simple wrestling match. Once again, he wins the match by squeezing his thumb against Hoshick’s eye hole, and he convinces Hoshick to agree to cede control of the entirety of the oases to the Terrestrials and his people would be gifted all of the planets’ desert areas. Upon returning to the Embassy, Retief tells Consul Passwyn the good news and then burns the envelope Passwyn had given him at the beginning of the story."
              },
              {
                "worker_id": "2",
                "uid": "214208d3ae8f44efb780457d42fd1103",
                "response_text": "Consul Passwyn sends Vice-Consul Retief to Adobe to negotiate a peace deal between the native Jaqs and the human settlers who have moved there. Retief travels to Adobe on the mail ship, but as they near the planet, the pilot points out that there is fighting going on that he can see from fifty miles out; he refuses to land there to deliver Retief but offers Retief the use of the skiff. \n\nAs Retief begins heading toward the planet, he is tracked by a fission weapon. He outmaneuvers the bomb and lands on the planet where he soon encounters one of the settlers. They fight until the man realizes Retief is a human, introduces himself as Potter, and takes Retief to his camp where other men are. The men explain the history of their conflict with the Flap-jacks, saying that one of their men saw one and shot it thinking it was some sort of native game. After that, the Flap-jacks showed up at a farm and killed two cows. Since then, the two sides have been attacking each other back and forth.\n\nLemuel arrives and asks Retief who he is spying for as he pulls a weapon on him. Retief tells him to put the weapon up and then punches Lemuel quickly when he doesn’t. Suddenly, they hear a noise; Retief throws a bucket of water on their fire, and they all dive for cover. Retief then announces he will go out by himself. \n\nAway from the camp, Retief sits and waits until a Flap-jack attacks him. He fights back and struggles but then manages to put his thumb in the creature’s eye, which subdues it. Then he has the creature take him to its leader. In the Flap-jack’s camp, Retief offers himself as a prisoner and is taken to the leader, who introduces himself as Hoshick of the Mosaic of the Two Dawns. Retief introduces himself as Retief of the Mountain of Red Tape. The two have dinner as Hoshick explains the Flap-jacks' history with the settlers. They think the settlers are sportsmen who enjoy skirmishes, so every time the setters attack them, the Flap-jacks attack back. The Flap-jacks plan to bring in more equipment and skirmishers to match the settlers. Hoshick says he personally prefers a more limited skirmish without nuclear or radiation-effect weapons. \n\nRetief suggests eliminating the weapons and explains that the settlers only use them when they think they are fighting against lower life forms. In further discussion, he learns that the Flap-jacks are worried that the settlers want to take over the deserts they need to grow the lichens they use for their food and wine. The Flap-jacks have no use for the oases. Retief brokers a deal where the Flap-jacks get all the deserts, and the settlers get all the oases.\n\nRetief briefs Passwyn when he returns to Ivory but does not reveal that he never opened the envelope containing his orders.\n"
              },
              {
                "worker_id": "9",
                "uid": "54fb79669123452bbaeb31b2dc4ec4d8",
                "response_text": "A Vice-Consul named Retief is sent to the planet Adobe to settle a dispute between the human settlers there and an indigenous species called the Jaq. He is given a thick envelope of instructions by his superior, Consul Passwyn, who tells him to follow them to the letter with no improvisation. Passwyn makes it clear that he thinks it will take a miracle to pull this mission off, but still tells Retief that he expects results. \n\nRetief lands on Adobe under arduous circumstances, during which his pilot bails out of the plane, he narrowly misses an atomic fission weapon, and he is immediately shot at upon landing. The shooter turns out to be Potter, a human who mistook Retief for a Jaq (or, as the human settlers refer to them, a “flap-jack”). He now assumes that Retief is the cousin of someone called “Lemuel”, and brings him back to the other humans without letting Retief clarify his real identity. \n\nThe other humans are glad to see him, thinking he’s a reinforcement. They tell him that they’ve been engaged in back-and-forth raids with the Flap-jacks, and also that they’ve heard that a bureaucrat is coming to talk them out of the dispute. Lemuel enters and reveals that Retief is not his cousin. He asks Retief who he is spying for and threatens him, at which time Retief easily subdues him in 1-2 punches, much to the awe of the other humans.\n\nRetief senses something outside and insists on looking into it alone. He hides and waits for a Jaq to attack him, and he subdues it by gouging its eye. He asks to see its leader, and is brought to the Jaq headquarters to dine and meet with Hoshick of the Mosaic of the Two Dawns. \n\nRetief and Hoshick eat and discuss how best to conduct next steps in the ongoing battle between the Jaq and the human settlers, of whom Hoshick seems to assume Retief is the leader. They discuss banning certain weapons, until Retief eventually gets Hoshick to agree to combat between the two of them. After discussing a few rules,  they commence to fight. Hoshick does well until Retief manages to gouge him until he goes limp. \n\nAfterward, Retief asks Hoshick if he would consider giving the human settlers the oases and vegetables on the planet if the humans would let the Jaq have all the desert areas. Hoshick likes the idea. \n\nRetief goes back to the human camp, gives them some wine and offers the same deal. They are equally happy to take the oases and give up the desert. \n\nWe then find Retief back with Consul Passwyn, who is shocked at the success of the mission. Passwyn, who never seems to give praise where it is actually due, says it’s a good lesson about how things go when you follow instructions exactly. After Retief leaves the office, he tosses the envelope of instructions into the trash, still unopened. \n"
              },
              {
                "worker_id": "1",
                "uid": "9be358ce45834ce4976c218772aa09d1",
                "response_text": "Consul Passwyn meets with Vice-Consul Retief. Passwyn explains that Terrestrial settlers came to Adobe thinking it was uninhabited, but they started a war with the indigenous life form, the Flap-jacks. Passwyn hands Retief an envelope and tells him that he must handle the situation without any impromptu actions. \n\nThe mail pilot that is supposed to take Retief to Adobe refuses to do his job after he sees that there is a war going on. Retief pilots the skiff himself and crash lands on the planet. He gets out, enters a jungle-like habitat, and immediately looks for cover. A stocky man shoots at Retief, and Retief tackles him to the ground. The man, Potter, tells him that they’ve been waiting for help from Ivory to come and battle the Flap-jacks. \n\nPotter takes Retief to meet with his comrades, and the men explain that the Flap-jacks have recently started using superior weaponry, and more Terrestrials have been killed. Lemuel walks up, butts in the men’s conversation, points a gun at Retief, and accuses him of being a spy. Retief responds by punching Lemuel in the face and knocking him unconscious. The men hear a noise and get down on the ground. Retief tells the others that he’s going to check it out by himself. \n\nRetief enters the desert of Flap-jack country. A Flap-jack attacks him, and in response he is able to wrap his arms around the alien and put his thumb into the creature’s eye. The Flap-jack agrees to take Retief to his leader.\n\nAfter a short walk, Retief crawls on the ground to enter a cave. The leader, Hoshick of the Mosaic of the Two Dawns, congratulates Retief on being a worthy adversary. Hoshick uses a translating device to speak to Retief, and he offers the Terrestrial delicious food and several servings of tasty yellow wine. \n\nRetief asks Hoshick to consider getting rid of all weapons, and he suggests that this is the modern and polite way to fight. Weapons are reserved for vermin. He then goes one step further and asks Hoshick to keep the fight between the two of them. \n\nRetief and Hoshick go outside, remove their weapons, and engage in one-on-one combat. Retief remembers his trick and gouges Hoshick’s eye. Retief wins, and Hoshick agrees to give the Terrestrials the sand that the Flap-jacks desperately want to harvest lichen for their wine. Retief offers to allow the Flap-jacks to keep the desert as long as the Terrestrials can have all of the oases and vegetable farming land. \n\nRetief returns to Potter, Lemuel, Swazey, and Bert. He has the men try the wine that Hoshick gifted to him and tells them about the deal he made. He hands the Treaty and the other important paperwork to Passwyn. Passwyn congratulates him on a job well done and by the book. Retief takes his original envelope of instructions and throws it in the incinerator. \n"
              }
            ]
          },
          {
            "question_text": "What is the relationship between the Jaqs and the Terrestrials throughout the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "8",
                "uid": "5763f1a9afc945e3979933028291e984",
                "response_text": "The Jaq are a flat, wide-bodied species with tentacles and a tender orifice at the center of their bodies where a human chest would normally be. They are led by Hoshick, who has a strong interest in mining the deserts of Adobe for a special lichen used to craft their yellow wine. This wine would then be sold to planets across the universe. The Jaq make their headquarters in the desert. In the scattered oases of Adobe, the Terrestrial settlers have built farms in the rich soil of the planet's surface. The Terrestrials refer to the Jaq as \"Flap-jacks\" due to their unique physicality. One day, a Terrestrial man mistakes a Jaq for one of Adobe's native species, and he shoots and kills it. This ignites a war between the two groups. The central Terrestrials featured in the story--Potter, Lemuel, Bert, and Swazey--require assistance from their allies on Ivory because they only have three hundred men and are unsure they can defeat the Jaq. When the Embassy sends Retief to serve as an intermediary, he discovers that the two groups have similar interests--they each only want control of their separate areas. By craftily suggesting the use of weapons is no longer fashionable, Retief neutralizes the Jaq artillery and is able to convince both groups to reach a peace treaty. And, as it turns out, the Terrestrial settlements no longer have wine, so the adjacent existence of Jaq wine fields would have a mutual benefit."
              },
              {
                "worker_id": "2",
                "uid": "214208d3ae8f44efb780457d42fd1103",
                "response_text": "The Jaqs and the Terrestrials fight each other throughout the story. It started when a human saw a Jaq and thought it was some type of native game and shot it. From that incident, the Jaqs concluded that the humans were sportsmen like themselves and responded by going to one of the farms and killing two cows. Since then, the two sides have been attacking back and forth, and the humans think the Jaqs are fighting against them. Hoshick explains that he actually prefers the skirmishes to be without weapons. Until Retief meets with the Jaqs and talks with Hoshick, none of the humans had interacted with the Jaqs peacefully. The humans think the Jaqs want to take over all the oases, and the Jaqs think the humans want to take over all the deserts."
              },
              {
                "worker_id": "9",
                "uid": "54fb79669123452bbaeb31b2dc4ec4d8",
                "response_text": "The Jaqs and Terrestrials are at odds with each other over territorial rights on Adobe, but they clearly know nothing about each other, nor what the other group actually wants. A Terrestrial set off the disagreement by shooting at a Jaq, and the Jaqs have apparently killed several cows thinking they are humans. The Jaqs also believe that they are giving the Terrestrials what they want because they consider them fellow “sportsmen”, while the Terrestrials are actually dwindling in number and living in fear. While they continue raiding each other without talking, they fail to understand that different parts of the planet interest them, and they need not fight at all. By the end of the story, Retief has settled the dispute and both parties have been given the lands they desire; they now all happily reside on the planet together under the new agreement. \n"
              },
              {
                "worker_id": "1",
                "uid": "9be358ce45834ce4976c218772aa09d1",
                "response_text": "The Terrestrials show up on Adobe thinking the land is uninhabited, but they quickly learn that the Flap-jacks are also there. One of the men shoots at an Adoban, and for three months, the Terrestrials engage in battle with the aliens. The Flap-jacks attack Swayzey’s farm and kill two of his cows. The next time they showed up, Potter and Swazey shot at them. The men describe the aliens as dirty blankets. \n\nThe Flap-jacks begin using more advanced weaponry, like airships and automatic rifles. With their new technology, they are able to kill more Terrestrials. The men are very concerned about protecting their farmlands, and they believe the aliens want to take them. \n\nRetief is put in charge of mending the relationship between the Terrestrials and the Flap-jacks, so he goes to meet with their leader. He learns how to appropriately attack a Flap-jack when one of them charges at him when he enters their territory. The aliens are muscular and heavy with fringe-tentacles, and Retief is able to subdue the Flap-jack by gouging its eye with his thumb. \n\nThe Flap-jack’s leader, Hoshick, is immediately cordial towards Retief. Hoshick must use a translating device to speak to him, but he is open to all kinds of suggestions from Retief. He has his waiter serve food and wine during their meeting, and he explains that once they figured out the Terrestrials were sportsmen, they wanted to up the ante and show them a good time with their advanced weaponry. In fact, Hoshick called in an additional hundred Adobans to make the fight more interesting. \n\nHoshick is quickly convinced that fighting with weapons is a lowly thing to do, and he agrees to fight Retief one-on-one. Hoshick loses the fight when Retief sticks his thumb in the alien’s eye. Hoshick is willing to give the Terrestrials all of their land, but he admits that he’s disappointed that he won’t be able to continue farming lichens in the desert in order to make their delicious and profitable wine. \n\nRetief agrees that the Flap-jacks can keep the sand hills they need for harvesting lichens as long as the Terrestrials can have the oases and the farmlands. Essentially, the entire war was a miscommunication. Neither side wanted what the other had, but without a discussion about why each party was on Adobe, it was completely unclear to everyone that their motivations were dissimilar. \n"
              }
            ]
          },
          {
            "question_text": "Where does the story take place?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "8",
                "uid": "5763f1a9afc945e3979933028291e984",
                "response_text": "The story begins on the planet of Ivory, where Retief meets with his superior, Consul Passwyn. This seems to be the headquarters of the CDT, a kind of intergalactic governing body concerned with diplomatic efforts. The majority of the story's action takes place on the planet of Adobe. The planet is covered with vast deserts and spotted with several oases. The oases are like jungles with hot air, dense foliage, and dwarf trees along with a variety of wildlife from lizards to insects. They used to be sea-beds and therefore have rich soil for planting. The Terrestrials settlers live and built farms there. The Jaq built their headquarters in the midst of the deserts, where they prefer to stay for their rich resource of lichen used to produce wine. When Retief crash-lands on Adobe, he meets the Terrestrials in an oasis and eventually crosses over into the desert when he goes to consult with the leader of the Jaq, Hoshick. The Jaq headquarters is a comfort-dome with red lights, granite tables, fine silverware and glassware, pink walls, and a low-lying ceiling. Retief meets with Hoshick here and convinces him to engage in a skirmish. He then fights and defeats the leader outside the headquarters in the bright sand. After securing the deal, Retief returns to Ivory to report on the success of his mission."
              },
              {
                "worker_id": "2",
                "uid": "214208d3ae8f44efb780457d42fd1103",
                "response_text": "The story begins and ends on a planet called Ivory. It is the location of the CDT and the Embassy where Retief works. The rest of the story takes place on a planet called Adobe, which has a native life form that the Terrestrial settlers call Flap-jacks. Adobe has deserts and oases. The human settlers have farms on the oases where they raise crops and cattle to help feed the space system. The Flap-jacks live in the desert where they can grow the lichens that they use for food and wine. The temperature during the daytime is warm, and the oases support trees, animals, insects, and the humans living there. The oases are old sea-beds and have good, deep topsoil. The Flap-jacks live in a comfort-dome that has a low ceiling about five feet high. The walls are a pink-colored nacre, and the floor looks like burgundy glass and is covered with silk rugs."
              },
              {
                "worker_id": "9",
                "uid": "54fb79669123452bbaeb31b2dc4ec4d8",
                "response_text": "The majority of the story takes place on the planet Adobe, which has multiple topographical and climate features including a humid jungle, temperate oases, and rolling deserts. Retief reaches the planet via an aircrafts, and once there he visits several locations. He visits the camp of the Terrestrials, outdoors around a fire, as well as the low-to-the-ground but comparatively lavish dwellings of the Jaqs. These are surrounded by thorned branches for protection, but the inside of the Jaq headquarters is adorned with fine textures and surfaces like granite, silk, silver, and rose-crystal. Retief also spends the beginning and end of the story back at his unspecified posting with his superior, which is apparently quite rural and rugged. \n"
              },
              {
                "worker_id": "1",
                "uid": "9be358ce45834ce4976c218772aa09d1",
                "response_text": "The story takes place on Adobe. The Terrestrials have recently started farming there, and the Flap-jacks are also farming, but they are using the sand hills to grow lichens to make wine. The Flap-jack’s side is desert, and the Terrestrial’s side is more of a jungle. There are dwarf trees, song lizards, and insects, as wells as foliage and bushes. \n\nThe Terrestrials are using the land to keep their cattle, and they also value the dozens of oases. The ponds are a mile deep with excellent topsoil. \n\nIn the desert portion of the land, the leader of the Flap-jacks holds court in a cave surrounded by thorn branches. The cave’s ceiling is not very tall, and it is decorated with silk rugs, polished red granite, silver dishes, and rose-crystal drinking glasses. \n\nAdobe is a place that both Flap-jacks and Terrestrials can use to their advantage, and they have nothing to fight over because the resources they desire to not overlap at all.\n"
              }
            ]
          },
          {
            "question_text": "What is the significance of wine in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "8",
                "uid": "5763f1a9afc945e3979933028291e984",
                "response_text": "Wine is the essential reason the Jaq came to Adobe in the first place. Their leader, Hoshick, envisioned sourcing its vast deserts for lichen. This lichen would then be used to produce a yellow wine that could be sold to planets all around the universe. When Retief first meets Hoshick, the Jaq leader provides him with a rose-crystal drinking-tube, from which they are able to sample this wine. Retief notes that the wine tastes delicious and smells good and reminds him of Chateau d'Yquem. This detail reveals the Jaq's interest in the finer things in life, in appearing distinguished. This interest is reflected in all of the Jaq's interactions with Retief, including his ability to be coerced into hand-to-hand combat because he deems it a more modern, sportsmanlike way of resolving issues. Wine again becomes important after Retief wins the fight and gets Hoshick to agree to the terms of his proposed land treaty with the Terrestrials. After Hoshick agrees, Retief attempts to convince the Terrestrials to agree as well. After learning of the lack of wine within their settlements, Retief lets the Terrestrials sample the wine provided to him by the Jaq. Eventually, the Terrestrials agree to the arrangement as well. Therefore, the wine is also a symbol of the newfound peace between the two previously warring groups."
              },
              {
                "worker_id": "2",
                "uid": "214208d3ae8f44efb780457d42fd1103",
                "response_text": "The Jaqs make their own wine out of the lichens that they grow in the desert. The lichens will only grow in the desert, so the desert is extremely important to them. Their wine is of very high quality; in fact, Retief compares it to the wine from Chateau d’Yquem. The wine helps Retief arrange the deal to divide the land between the settlers and Jaqs in a way that is favorable to both sides. The human settlers have not been able to produce wine; they believe that the bacteria required to make it won’t grow on Yaq, so they have only been drinking stump water. Retief lets them try the Jaqs' wine, and they like it. This, along with the offer to give all of the deserts to the Jaqs and keep all of the oases for the humans, helps Retief work out the peace deal for the Jaqs and the settlers. \n"
              },
              {
                "worker_id": "9",
                "uid": "54fb79669123452bbaeb31b2dc4ec4d8",
                "response_text": "Wine is significant in the story because it symbolizes how little the Jaqs and the Terrestrials know about one another, and how they can live harmoniously. The Terrestrials believe that Adobe is lethal to the process of making alcohol and that wine can’t be made. The Jaqs enjoy a sweet yellow wine made from lichens that they get from the desert. Retief settles the dispute with the Jaqs over wine, and then brings some with him to settle it with the Terrestrials, and both parties agree. The wine is a symbol of how their differing aims can complement each other and they can produce and trade different crops to benefit everyone. \n"
              },
              {
                "worker_id": "1",
                "uid": "9be358ce45834ce4976c218772aa09d1",
                "response_text": "Wine is an important part of the story because the Flap-jacks have only come to Adobe to make their wine. The leader of the Flap-jacks, Hoshick, explains that he brought his people to the planet to build his own Mosaic and till the sands to grow paradise-lichen. He hoped to make delicious and expensive wine with the crop and sell it all over the universe. \n\nRetief tries the wine during his conversation with Hoshick, and he compares the beverage to Chateau d'Yquem. When he takes some back to his men, they also find the wine to be wonderful. \n\nIf the Terrestrials had known in the beginning that the Flap-jacks were interested in harvesting the lichens in the sand, they never would have tried to engage in battle with them.\n"
              }
            ]
          },
          {
            "question_text": "What is the significance of the fission weapon in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "8",
                "uid": "5763f1a9afc945e3979933028291e984",
                "response_text": "After Retief takes command of the mail skiff, he narrowly misses colliding with a warhead that tracks his trajectory. Thanks to a swift maneuver, Retief is able to dodge its impact and crash-lands on Adobe. However, due to the red blip on his radar screen, Retief is now aware that one of the warring groups on the planet is using illegal fission weapons in battle. Initially, he believes the Terrestrials were responsible for this, but after meeting Potter, he realizes his mistake. Potter informs him the Terrestrials do not have weapons of that kind, so it has to be Jaq weaponry. This information becomes important later when Retief meets Hoshick for the first time. As the leader of the Jaq, Hoshick informs Retief that the skirmishes were a result of a desire to engage in more sportsmanlike conduct on the battlefield. Retief realizes he can use this desire to his advantage and pushes Hoshick to question whether or not weapons are required at all in resolving conflict. He pushes this idea further by suggesting his own kind would never solve problems with weapons, despite one of the Jaqs having been previously shot down by them. Retief excuses this by again playing into Hoshick's desire to appear more dignified and saying the shooting was a failure to recognize the Jaq as sportsmen. This tactic works, and he is able to use it to convince Hoshick to engage in hand-to-hand combat, which eventually leads to the resolution of the war."
              },
              {
                "worker_id": "2",
                "uid": "214208d3ae8f44efb780457d42fd1103",
                "response_text": "The fission weapon is an indication of the intelligence and resources of the Jaqs, although at first, Retief doesn’t know whose weapon it is. The fission weapon tracks the object it seeks and follows it. Retief is only able to avoid colliding with it by flying straight toward it at the last minute and passing it before it explodes. The leader of the Jaqs, Hoshick, says that he would prefer a contest without nuclear or radiation-effect weapons because it is such a bore having to screen the spawn for deviations afterward. Retief readily agrees that the humans will not use atomic weapons either for the same reason and because it wastes troops. This agreement is the first concession by the Jaqs and the humans about the fighting and is followed by other concessions that are advantageous to both sides."
              },
              {
                "worker_id": "9",
                "uid": "54fb79669123452bbaeb31b2dc4ec4d8",
                "response_text": "The fission weapon is significant in the story for a few reasons. It nearly takes down the aircraft that Retief is flying to Adobe. He later finds out that the Jaqs have been using them in order to give the Terrestrials a good show of strength, and that their nuclear/radiation effect has spawned more creatures, such as the one that Retief briefly takes captive. The Terrestrials tell Retief that they don’t have access to such weapons and that the Jaqs have been leveling up their weaponry; unbeknownst to them, the Jaqs have done so to try to compete with them. \n"
              },
              {
                "worker_id": "1",
                "uid": "9be358ce45834ce4976c218772aa09d1",
                "response_text": "The fission weapon is important because it almost kills Retief.\n\nRetief encounters the fission weapon when he is piloting the skiff alone towards Adobe. His original pilot refuses to transport him to the planet because he can see that there are missiles and other weapons in use. The pilot does not want to get killed, and he insists that Retief can die if that’s what he wants to do.\n\nWhile Retief is flying towards Adobe, he sees a red blip show up on the screen of the skiff. Retief feels nervous and panicky because the red dot means that someone has deployed a warhead that emits heavy radiation, also known as a fission weapon. The fission weapon has been outlawed. He hopes that his skiff has not been spotted, and he changes course to avoid the warhead. When the missile comes within five miles of his vehicle, Retief decides to accelerate as fast as possible. He just makes it past the missile, and it explodes mid-air. The fission weapon makes Retief crash land on the planet. His skiff fills with smoke and his screen breaks. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5398,
        "document_length_chars": 32365
      }
    }
  ]
}