{
  "item_metadata": {
    "item_id": "61171",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61171",
      "content": "THE EXPENDABLES\n \n\n BY JIM HARMON\n \n\n It was just a little black box, useful for getting rid of things. Trouble was, it worked too well!\n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, May 1962. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n \"You see my problem, Professor?\" Tony Carmen held his pinkly manicured, flashily ringed hands wide.\n \n I saw his problem and it was warmly embarrassing.\n \n \"Really, Mr. Carmen,\" I said, \"this isn't the sort of thing you discuss with a total stranger. I'm not a doctor—not of medicine, anyway—or a lawyer.\"\n \n \"They can't help me. I need an operator in your line.\"\n \n \"I work for the United States government. I can't become involved in anything illegal.\"\n \n Carmen smoothed down the front of his too-tight midnight blue suit and touched the diamond sticking in his silver tie. \"You can't, Professor Venetti? Ever hear of the Mafia?\"\n \n \"I've heard of it,\" I said uneasily. \"An old fraternal organization something like the Moose or Rosicrucians, founded in Sicily. It allegedly controls organized crime in the U.S. But that is a responsibility-eluding myth that honest Italian-Americans are stamping out. We don't even like to see the word in print.\"\n \n \"I can understand honest Italian-Americans feeling that way. But guys like me know the Mafia is still with it. We can put the squeeze on marks like you pretty easy.\"\n \n You don't have to tell even a third generation American about the Mafia. Maybe that was the trouble. I had heard too much and for too long. All the stories I had ever heard about the Mafia, true or false, built up an unendurable threat.\n \n \"All right, I'll try to help you, Carmen. But ... that is, you didn't kill any of these people?\"\n \n He snorted. \"I haven't killed anybody since early 1943.\"\n \n \"Please,\" I said weakly. \"You needn't incriminate yourself with me.\"\n \n \"I was in the Marines,\" Carmen said hotly. \"Listen, Professor, these aren't no Prohibition times. Not many people get made for a hit these days. Mother, most of these bodies they keep ditching at my club haven't been murdered by anybody. They're accident victims. Rumbums with too much anti-freeze for a summer's day, Spanish-American War vets going to visit Teddy in the natural course of events. Harry Keno just stows them at my place to embarrass me. Figures to make me lose my liquor license or take a contempt before the Grand Jury.\"\n \n \"I don't suppose you could just go to the police—\" I saw the answer in his eyes. \"No. I don't suppose you could.\"\n \n \"I told you once, Professor, but I'll tell you again. I have to get rid of these bodies they keep leaving in my kitchen. I can take 'em and throw them in the river, sure. But what if me or my boys are stopped en route by some tipped badge?\"\n \n \"Quicklime?\" I suggested automatically.\n \n \"What are you talking about? Are you sure you're some kind of scientist? Lime doesn't do much to a stiff at all. Kind of putrifies them like....\"\n \n \"I forgot,\" I admitted. \"I'd read it in so many stories I'd forgotten it wouldn't work. And I suppose the furnace leaves ashes and there's always traces of hair and teeth in the garbage disposal... An interesting problem, at that.\"\n \n \"I figured you could handle it,\" Carmen said, leaning back comfortably in the favorite chair of my bachelor apartment. \"I heard you were working on something to get rid of trash for the government.\"\n \n \"That,\" I told him, \"is restricted information. I subcontracted that work from the big telephone laboratories. How did you find it out?\"\n \n \"Ways, Professor, ways.\"\n \n The government did want me to find a way to dispose of wastes—radioactive wastes. It was the most important problem any country could have in this time of growing atomic industry. Now a small-time gangster was asking me to use this research to help him dispose of hot corpses. It made my scientific blood seethe. But the shadow of the Black Hand cooled it off.\n \n \"Maybe I can find something in that area of research to help you,\" I said. \"I'll call you.\"\n \n \"Don't take too long, Professor,\" Carmen said cordially.\n \n \n\n \n The big drum topped with a metallic coolie's hat had started out as a neutralizer for radioactivity. Now I didn't know what to call it.\n \n The AEC had found burying canisters of hot rubbish in the desert or in the Gulf had eventually proved unsatisfactory. Earth tremors or changes of temperature split the tanks in the ground, causing leaks. The undersea containers rusted and corroded through the time, poisoning fish and fishermen.\n \n Through the SBA I had been awarded a subcontract to work on the problem. The ideal solution would be to find a way to neutralize radioactive emanations, alpha, beta, X et cetera. (No, my dear, et cetera rays aren't any more dangerous than the rest.) But this is easier written than done.\n \n Of course, getting energy to destroy energy without producing energy or matter is a violation of the maxim of the conservation of energy. But I didn't let that stop me—any more than I would have let the velocity of light put any limitations on a spacecraft engine had I been engaged to work on one. You can't allow other people's ideas to tie you hand and foot. There are some who tell me, however, that my refusal to honor such time-tested cliches is why I only have a small private laboratory owned by myself, my late wife's father and the bank, instead of working in the vast facilities of Bell, Du Pont, or General Motors. To this, I can only smile and nod.\n \n But even refusing to be balked by conservative ideas, I failed.\n \n I could not neutralize radioactivity. All I had been able to do (by a basic disturbance in the electromagnetogravitational co-ordinant system for Earth-Sun) was to reduce the mass of the radioactive matter.\n \n This only concentrated the radiations, as in boiling contaminated water. It did make the hot stuff vaguely easier to handle, but it was no breakthrough on the central problem.\n \n Now, in the middle of this, I was supposed to find a way to get rid of some damned bodies for Carmen.\n \n Pressed for time and knowing the results wouldn't have to be so precise or carefully defined for a racketeer as for the United States government, I began experimenting.\n \n I cut corners.\n \n I bypassed complete safety circuits.\n \n I put dangerous overloads on some transformers and doodled with the wiring diagrams. If I got some kind of passable incinerator I would be happy.\n \n I turned the machine on.\n \n The lights popped out.\n \n There were changes that should be made before I tried that again, but instead I only found a larger fuse for a heavier load and jammed that in the switchbox.\n \n I flipped my machine into service once again. The lights flickered and held.\n \n The dials on my control board told me the story. It was hard to take.\n \n But there it was.\n \n The internal Scale showed zero.\n \n I had had a slightly hot bar of silver alloy inside. It was completely gone. Mass zero. The temperature gauge showed that there had been no change in centigrade reading that couldn't be explained by the mechanical operation of the machine itself. There had been no sudden discharge of electricity or radioactivity. I checked for a standard anti-gravity effect but there was none. Gravity inside the cylinder had gone to zero but never to minus.\n \n I was at last violating conservation of energy—not by successfully inverting the cube of the ionization factor, but by destroying mass ... by simply making it cease to exist with no cause-and-effect side effects.\n \n I knew the government wouldn't be interested, since I couldn't explain how my device worked. No amount of successful demonstration could ever convince anybody with any scientific training that it actually did work.\n \n But I shrewdly judged that Tony Carmen wouldn't ask an embarrassing\n\"how\" when he was incapable of understanding the explanation.\n \n \n\n \n \"Yeah, but how does it work?\" Tony Carmen demanded of me, sleeking his mirror-black hair and staring up at the disk-topped drum.\n \n \"Why do you care?\" I asked irritably. \"It will dispose of your bodies for you.\"\n \n \"I got a reason that goes beyond the stiff, but let's stick to that just for now. Where are these bodies going? I don't want them winding up in the D.A.'s bathtub.\"\n \n \"Why not? How could they trace them back to you?\"\n \n \"You're the scientist,\" Tony said hotly. \"I got great respect for those crime lab boys. Maybe the stiff got some of my exclusive brand of talc on it, I don't know.\"\n \n \"Listen here, Carmen,\" I said, \"what makes you think these bodies are going somewhere? Think of it only as a kind of—incinerator.\"\n \n \"Not on your life, Professor. The gadget don't get hot so how can it burn? It don't use enough electricity to fry. It don't cut 'em up or crush 'em down, or dissolve them in acid. I've seen disappearing cabinets before.\"\n \n Mafia or not, I saw red. \"Are you daring to suggest that I am working some trick with trap doors or sliding panels?\"\n \n \"Easy, Professor,\" Carmen said, effortlessly shoving me back with one palm. \"I'm not saying you have the machine rigged. It's just that you have to be dropping the stuff through a sliding panel in—well, everything around us. You're sliding all that aside and dropping things through. But I want to know where they wind up. Reasonable?\"\n \n Carmen was an uneducated lout and a criminal but he had an instinctive feel for the mechanics of physics.\n \n \"I don't know where the stuff goes, Carmen,\" I finally admitted. \"It might go into another plane of existence. 'Another dimension' the writers for the American Weekly would describe it. Or into our past, or our future.\"\n \n The swarthy racketeer pursed his lips and apparently did some rapid calculation.\n \n \"I don't mind the first two, but I don't like them going into the future. If they do that, they may show up again in six months.\"\n \n \"Or six million years.\"\n \n \"You'll have to cut that future part out, Professor.\"\n \n I was beginning to get a trifle impatient. All those folk tales I had heard about the Mafia were getting more distant. \"See here, Carmen, I could lie to you and say they went into the prehistoric past and you would never know the difference. But the truth is, I just don't know where the processed material goes. There's a chance it may go into the future, yes. But unless it goes exactly one year or exactly so many years it would appear in empty space ... because the earth will have moved from the spot it was transmitted. I don't know for sure. Perhaps the slight Deneb-ward movement of the Solar System would wreck a perfect three-point landing even then and cause the dispatched materials to burn up from atmospheric friction, like meteors. You will just have to take a chance on the future. That's the best I can do.\"\n \n Carmen inhaled deeply. \"Okay. I'll risk it. Pretty long odds against any squeal on the play. How many of these things can you turn out, Professor?\"\n \n \"I can construct a duplicate of this device so that you may destroy the unwanted corpses that you would have me believe are delivered to you with the regularity of the morning milk run.\"\n \n The racketeer waved that suggestion aside. \"I'm talking about a big operation, Venetti. These things can take the place of incinerators, garbage disposals, waste baskets....\"\n \n \"Impractical,\" I snorted. \"You don't realize the tremendous amount of electrical power these devices require....\"\n \n \"Nuts! From what you said, the machine is like a TV set; it takes a lot of power to get it started, but then on it coasts on its own generators.\"\n \n \n\n \n \"There's something to what you say,\" I admitted in the face of his unexpected information. \"But I can hardly turn my invention over to your entirely persuasive salesmen, I'm sure. This is part of the results of an investigation for the government. Washington will have to decide what to do with the machine.\"\n \n \"Listen, Professor,\" Carmen began, \"the Mafia—\"\n \n \"What makes you think I'm any more afraid of the Mafia than I am of the F.B.I.? I may have already sealed my fate by letting you in on this much. Machinegunning is hardly a less attractive fate to me than a poor security rating. To me, being dead professionally would be as bad as being dead biologically.\"\n \n Tony Carmen laid a heavy hand on my shoulder. I finally deduced he intended to be cordial.\n \n \"Of course,\" he said smoothly \"you have to give this to Washington but there are ways , Professor. I know. I'm a business man—\"\n \n \"You are ?\" I said.\n \n He named some of the businesses in which he held large shares of stock.\n \n \"You are .\"\n \n \"I've had experience in this sort of thing. We simply leak the information to a few hundred well selected persons about all that your machine can do. We'll call 'em Expendables, because they can expend anything.\"\n \n \"I,\" I interjected, \"planned to call it the Venetti Machine.\"\n \n \"Professor, who calls the radio the Marconi these days?\"\n \n \"There are Geiger-Muller Counters, though,\" I said.\n \n \"You don't have to give a Geiger counter the sex appeal of a TV set or a hardtop convertible. We'll call them Expendables. No home will be complete without one.\"\n \n \"Perfect for disposing of unwanted bodies,\" I mused. \"The murder rate will go alarmingly with those devices within easy reach.\"\n \n \"Did that stop Sam Colt or Henry Ford?\" Tony Carmen asked reasonably....\n \n Naturally, I was aware that the government would not be interested in my machine. I am not a Fortean, a psychic, a psionicist or a screwball. But the government frequently gets things it doesn't know what to do with—like airplanes in the 'twenties. When it doesn't know what to do, it doesn't do it.\n \n There have been hundreds of workable perpetual motion machines patented, for example. Of course, they weren't vices in the strictest sense of the word. Many of them used the external power of gravity, they would wear out or slow down in time from friction, but for the meanwhile, for some ten to two hundred years they would just sit there, moving. No one had ever been able to figure out what to do with them.\n \n I knew the AEC wasn't going to dump tons of radioactive waste (with some possible future reclaimation value) into a machine which they didn't believe actually could work.\n \n Tony Carmen knew exactly what to do with an Expendable once he got his hands on it.\n \n Naturally, that was what I had been afraid of.\n \n \n\n \n The closed sedan was warm, even in early December.\n \n Outside, the street was a progression of shadowed block forms. I was shivering slightly, my teeth rattling like the porcelain they were. Was this the storied \"ride,\" I wondered?\n \n Carmen finally returned to the car, unlatched the door and slid in. He did not reinsert the ignition key. I did not feel like sprinting down the deserted street.\n \n \"The boys will have it set up in a minute,\" Tony the racketeer informed me.\n \n \"What?\" The firing squad?\n \n \"The Expendable, of course.\"\n \n \"Here? You dragged me out here to see how you have prostituted my invention? I presume you've set it up with a 'Keep Our City Clean' sign pasted on it.\"\n \n He chuckled. It was a somewhat nasty sound, or so I imagined.\n \n A flashlight winked in the sooty twilight.\n \n \"Okay. Let's go,\" Tony said, slapping my shoulder.\n \n I got out of the car, rubbing my flabby bicep. Whenever I took my teen-age daughter to the beach from my late wife's parents' home, I frequently found 230 pound bullies did kick sand in my ears.\n \n The machine was installed on the corner, half covered with a gloomy white shroud, and fearlessly plugged into the city lighting system via a blanketed streetlamp. Two hoods hovered in a doorway ready to take care of the first cop with a couple of fifties or a single .38, as necessity dictated.\n \n Tony guided my elbow. \"Okay, Professor, I think I understand the bit now, but I'll let you run it up with the flagpole for me, to see how it waves to the national anthem.\"\n \n \"Here?\" I spluttered once more. \"I told you, Carmen, I wanted nothing more to do with you. Your check is still on deposit....\"\n \n \"You didn't want anything to do with me in the first place.\" The thug's teeth flashed in the night. \"Throw your contraption into gear, buddy.\"\n \n That was the first time the tone of respect, even if faked, had gone out of his voice. I moved to the switchboard of my invention. What remained was as simple as adjusting a modern floor lamp to a medium light position. I flipped.\n \n Restraining any impulse toward colloqualism, I was also deeply disturbed by what next occurred.\n \n One of the massive square shapes on the horizon vanished.\n \n \"What have you done?\" I yelped, ripping the cover off the machine.\n \n Even under the uncertain illumination of the smogged stars I could see that the unit was half gone—in fact, exactly halved.\n \n \"Squint the Seal is one of my boys. He used to be a mechanic in the old days for Burger, Madle, the guys who used to rob banks and stuff.\" There was an unmistakable note of boyish admiration in Carmen's voice.\n\"He figured the thing would work like that. Separate the poles and you increase the size of the working area.\"\n \n \"You mean square the operational field. Your idiot doesn't even know mechanics.\"\n \n \"No, but he knows all about how any kind of machine works.\"\n \n \"You call that working?\" I demanded. \"Do you realize what you have there, Carmen?\"\n \n \"Sure. A disintegrator ray, straight out of Startling Stories .\"\n \n My opinion as to the type of person who followed the pages of science-fiction magazines with fluttering lips and tracing finger was upheld.\n \n I looked at the old warehouse and of course didn't see it.\n \n \"What was this a test for?\" I asked, fearful of the Frankenstein I had made. \"What are you planning to do now?\"\n \n \"This was no test, Venetti. This was it. I just wiped out Harry Keno and his intimates right in the middle of their confidential squat.\"\n \n \"Good heavens. That's uncouthly old-fashioned of you, Carmen! Why, that's murder .\"\n \n \"Not,\" Carmen said, \"without no corpus delecti .\"\n \n \"The body of the crime remains without the body of the victim,\" I remembered from my early Ellery Queen training.\n \n \"You're talking too much, Professor,\" Tony suggested. \"Remember, you did it with your machine.\"\n \n \"Yes,\" I said at length. \"And why are we standing here letting those machines sit there?\"\n \n \n\n \n There were two small items of interest to me in the Times the following morning.\n \n One two-inch story—barely making page one because of a hole to fill at the bottom of an account of the number of victims of Indian summer heat prostration—told of the incineration of a warehouse on Fleet Street by an ingenious new arson bomb that left \"virtually\" no trace. (Maybe the fire inspector had planted a few traces to make his explanation more creditable.)\n \n The second item was further over in a science column just off the editorial page. It told of the government—!—developing a new process of waste disposal rivaling the old Buck Rogers disintegrator ray.\n \n This, I presumed, was one of Tony Carmen's information leaks.\n \n If he hoped to arouse the public into demanding my invention I doubted he would succeed. The public had been told repeatedly of a new radioactive process for preserving food and a painless way of spraying injections through the skin. But they were still stuck with refrigerators and hypodermic needles.\n \n I had forced my way half-way through the paper and the terrible coffee I made when the doorbell rang.\n \n I was hardly surprised when it turned out to be Tony Carmen behind the front door.\n \n He pushed in, slapping a rolled newspaper in his palm. \"Action, Professor.\"\n \n \"The district attorney has indicted you?\" I asked hopefully.\n \n \"He's not even indicted you , Venetti. No, I got a feeler on this plant in the Times .\"\n \n I shook my head. \"The government will take over the invention, no matter what the public wants.\"\n \n \"The public? Who cares about the public? The Arcivox corporation wants this machine of yours. They have their agents tracing the plant now. They will go from the columnist to his legman to my man and finally to you. Won't be long before they get here. An hour maybe.\"\n \n \"Arcivox makes radios and TV sets. What do they want with the Expendables?\"\n \n \"Opening up a new appliance line with real innovations. I hear they got a new refrigerator. All open. Just shelves—no doors or sides. They want a revolutionary garbage disposal too.\"\n \n \"Do you own stock in the company? Is that how you know?\"\n \n \"I own stock in a competitor. That's how I know,\" Carmen informed me.\n\"Listen, Professor, you can sell to Arcivox and still keep control of the patents through a separate corporation. And I'll give you 49% of its stock.\"\n \n This was Carmen's idea of a magnanimous offer for my invention. It was a pretty good offer—49% and my good health.\n \n \"But will the government let Arcivox have the machine for commercial use?\"\n \n \"The government would let Arcivox have the hydrogen bomb if they found a commercial use for it.\"\n \n There was a sturdy knock on the door, not a shrill ring of the bell.\n \n \"That must be Arcivox now,\" Carmen growled. \"They have the best detectives in the business. You know what to tell them?\"\n \n I knew what to tell them.\n \n \n\n \n I peeled off my wet shirt and threw it across the corner of my desk, casting a reproving eye at the pastel air-conditioner in the window. It wasn't really the machine's fault—The water department reported the reservoir too low to run water-cooled systems. It would be a day or two before I could get the gas type into my office.\n \n Miss Brown, my secretary, was getting a good look at my pale, bony chest. Well, for the salary she got, she could stand to look. Of course, she herself was wearing a modest one-strap sun dress, not shorts and halters like some of the girls.\n \n \"My,\" she observed \"it certainly is humid for March, isn't it, Professor Venetti?\"\n \n I agreed that it was.\n \n She got her pad and pencil ready.\n \n \"Wheedling form letter to Better Mousetraps. Where are our royalties for the last quarter of the year? We know we didn't have a full three months with our Expendable Field in operation on the new traps, but we want the payola for what we have coming.\n \n \"Condescending form letter to Humane Lethal Equipment. Absolutely do not send the California penal system any chambers equipped with our patented field until legislature officially approves them. We got away with it in New Mexico, but we're older and wiser now.\n \n \"Rush priority telegram to President, United States, any time in the next ten days. Thanks for citation, et cetera. Glad buddy system working out well in training battlefield disintegrator teams.\n \n \"Indignant form letter to Arcivox. We do not feel we are properly a co-respondent in your damage suits. Small children and appliances have always been a problem, viz ice boxes and refrigerators. Suggest you put a more complicated latch on the handles of the dangerously inferior doors you have covering our efficient, patented field.\"\n \n I leaned back and took a breather. There was no getting around it—I just wasn't happy as a business man. I had been counting on being only a figurehead in the Expendable Patent Holding Corporation, but Tony Carmen didn't like office work. And he hadn't anyone he trusted any more than me. Even.\n \n I jerked open a drawer and pulled off a paper towel from the roll I had stolen in the men's room. Scrubbing my chest and neck with it, I smoothed it out and dropped it into the wastebasket. It slid down the tapering sides and through the narrow slot above the Expendable Field. I had redesigned the wastebaskets after a janitor had stepped in one. But Gimpy was happy now, with the $50,000 we paid him.\n \n I opened my mouth and Miss Brown's pencil perked up its eraser, reflecting her fierce alertness.\n \n Tony Carmen banged open the door, and I closed my mouth.\n \n \"G-men on the way here,\" he blurted and collapsed into a chair opposite Miss Brown.\n \n \"Don't revert to type,\" I warned him. \"What kind of G-Men? FBI? FCC? CIA? FDA? USTD?\"\n \n \"Investigators for the Atomic Energy Commission.\"\n \n The solemn, conservatively dressed young man in the door touched the edge of his snap-brim hat as he said it.\n \n \"Miss Brown, would you mind letting our visitor use your chair?\" I asked.\n \n \"Not at all, sir,\" she said dreamily.\n \n \"May I suggest,\" I said, \"that we might get more business done if you then removed yourself from the chair first.\"\n \n Miss Brown leaped to her feet with a healthy galvanic response and quit the vicinity with her usual efficiency.\n \n \n\n \n Once seated, the AEC man said \"I'll get right to the point. You may find this troublesome, gentlemen, but your government intends to confiscate all of the devices using your so-called Expendable field, and forever bar their manufacture in this country or their importation.\"\n \n \"You stinking G-men aren't getting away with this,\" Carmen said ingratiatingly. \"Ever hear of the Mafia?\"\n \n \"Not much,\" the young man admitted earnestly, \"since the FBI finished with its deportations a few years back.\"\n \n I cleared my throat. \"I must admit that the destruction of a multi-billion business is disconcerting before lunch. May we ask why you took this step?\"\n \n The agent inserted a finger between his collar and tie. \"Have you noticed how unseasonably warm it is?\"\n \n \"I wondered if you had. You're going to have heat prostration if you keep that suit coat on five minutes more.\"\n \n The young man collapsed back in his chair, loosening the top button of his ivy league jacket, looking from my naked hide to the gossomer scrap of sport shirt Carmen wore. \"We have to dress inconspicuously in the service,\" he panted weakly.\n \n I nodded understandingly. \"What does the heat have to do with the outlawing of the Expendables?\"\n \n \"At first we thought there might be some truth in the folk nonsense that nuclear tests had something to do with raising the mean temperature of the world,\" the AEC man said. \"But our scientists quickly found they weren't to blame.\"\n \n \"Clever of them.\"\n \n \"Yes, they saw that the widespread use of your machines was responsible for the higher temperature. Your device violates the law of conservation of energy, seemingly . It seemingly destroys matter without creating energy. Actually—\"\n \n He paused dramatically.\n \n \"Actually, your device added the energy it created in destroying matter to the energy potential of the planet in the form of heat . You see what that means? If your devices continue in operation, the mean temperature of Earth will rise to the point where we burst into flame. They must be outlawed!\"\n \n \"I agree,\" I said reluctantly.\n \n Tony Carmen spoke up. \"No, you don't, Professor. We don't agree to that.\"\n \n I waved his protests aside.\n \n \"I would agree,\" I said, \"except that it wouldn't work. Explain the danger to the public, let them feel the heat rise themselves, and they will hoard Expendables against seizure and continue to use them, until we do burst into flame, as you put it so religiously.\"\n \n \"Why?\" the young man demanded.\n \n \"Because Expendables are convenient. There is a ban on frivolous use of water due to the dire need. But the police still have to go stop people from watering lawns, and I suspect not a few swimming pools are being filled on the sly. Water is somebody else's worry. So will be generating enough heat to turn Eden into Hell.\"\n \n \"Mass psychology isn't my strongest point,\" the young man said worriedly. \"But I suspect you may be right. Then—we'll be damned?\"\n \n \"No, not necessarily,\" I told him comfortingly. \"All we have to do is use up the excess energy with engines of a specific design.\"\n \n \"But can we design those engines in time?\" the young man wondered with uncharacteristic gloom.\n \n \"Certainly,\" I said, practising the power of positive thinking. \"Now that your world-wide testing laboratories have confirmed a vague fear of mine, I can easily reverse the field of the Expendable device and create a rather low-efficiency engine that consumes the excess energy in our planetary potential.\"\n \n \n\n \n The agent of the AEC whose name I can never remember was present along\n with Tony Carmen the night my assistants finished with the work I had\n outlined.\n \n While it was midnight outside, the fluorescents made the scene more\n visible than sunlight. My Disexpendable was a medium-sized drum in a\n tripod frame with an unturned coolie's hat at the bottom.\n \n Breathlessly, I closed the switch and the scooped disc began slowly to\n revolve.\n \n \"Is it my imagination,\" the agent asked, \"or is it getting cooler in\n here?\"\n \n \"Professor.\" Carmen gave me a warning nudge.\n \n There was now something on the revolving disc. It was a bar of some\n shiny gray metal.\n \n \"Kill the power, Professor,\" Carmen said.\n \n \"Can it be,\" I wondered, \"that the machine is somehow recreating or\n drawing back the processed material from some other time or dimension?\"\n \n \"Shut the thing off, Venetti!\" the racketeer demanded.\n \n But too late.\n \n There was now a somewhat dead man sitting in the saddle of the turning\n circle of metal.\n \n If Harry Keno had only been sane when he turned up on that\n merry-go-round in Boston I feel we would have learned much of immense\n value on the nature of time and space.\n \n As it is, I feel that it is a miscarriage of justice to hold me in\n connection with the murders I am sure Tony Carmen did commit.\n \n I hope this personal account when published will end the vicious\n story supported by the district attorney that it was I who sought Tony\n Carmen out and offered to dispose of his enemies and that I sought his\n financial backing for the exploitation of my invention.\n \n This is the true, and only true, account of the development of the\n machine known as the Expendable.\n \n I am only sorry, now that the temperature has been standardized once\n more, that the Expendable's antithesis, the Disexpendable, is of too\n low an order of efficiency to be of much value as a power source in\n these days of nuclear and solar energy. So the world is again stuck\n with the problem of waste disposal ... including all that I dumped\n before. But as a great American once said, you can't win 'em all.\n \n If you so desire, you may send your generous and fruitful letters\n towards my upcoming defense in care of this civic-minded publication.",
      "metadata": {
        "title": "The Expendables",
        "author": "Jim Harmon",
        "passage_id": "61171",
        "uid": "e80713aa02fd426d8e5cf3777b05bc62",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "112",
                "uid": "49fcdca30ca949f1b6b4f720c503b473",
                "response_text": "A racketeer, Tony Carmen, comes to Professor Venetti, demanding him figure out how to get rid of the corpse in his house without leaving any traces by using the information Professor Venetti has in his job for the U.S. government that is related to the disposal problem of nuclear waste. Tony threatens Professor Venetti that if Professor Venetti does not abide by what he says, his connection with Mafia will cause Professor Venetti a lot of trouble. Afraid of what the Mafia may do, Professor Venetti finally accepts his request. However, professor Venetti does not abide by the safety and careful principles when he invents the machine, which is named Expendable late after by Tony. He does not know how the machine works either; he creates a device that can turn physical mass into nothingness without knowing where the disposed of mass or energy goes. When he gives the machine to Tony, Tony asks how the machine works, but Professor Venetti cannot explain. Later on, Tony sets up the device on the street, ordering Professor Venetti to turn on the machine, which is modified by a boy who used to be a mechanic, and Professor Venetti does. The machine destroys a warehouse, including the people inside. Professor Venetti condemns Tony for committing a crime, but Tony does not care as there is no corpse to prove the crime. \n\nTony persuades Professor Venetti to put the Expendables into business. He leaks the information about the machine through newspapers to attract big corporations to come for them. As they make more profits from the product and go through all the business matters, an agent from Atomic Energy Commission comes. The agent informs them about the ban of their products because there is a research finding that the side effect of their product is the heat transformed from the mass, which results in the rising temperature. Professor Venetti believes that people would not stop using the products even if they knew what environmental damage they would cause. He creates a reverse version of the machine, called Disexpendable, which would consume the excess energy produced by the Expendables. After he completes it, he turns it on. As the Disexpendable operates, the temperature gets colder, and the corpse, once decomposed, appears in the room in front of the agent. At the same time, Tony orders Professor Venetti to turn off the machine.\n"
              },
              {
                "worker_id": "113",
                "uid": "575c44ac458249d78baf7dfd7118532d",
                "response_text": "Tony Carmen, a criminal with connections in the Mafia, comes to professor Venetti with a request to create some method of getting rid of human corpses with no traces. He says that these are bodies of accident victims left by Harry Keno. Professor tries to come up with different conventional methods. Carmen mentions that he knows Venetti’s affiliation with the radioactive waste disposal program coordinated by the government and wants something more scientifically-based. Venetti thinks about all the attempts the government made to dispose of radioactive waste, but they were all futile since there was no way of creating an effective mechanism without breaking the law of energy conservation. He experiments and manages to create a machine that erases any physical object without any thermal or gravitational traces. When Tony Carmen asks where the matter goes, the professor honestly admits that he doesn’t know. Carmen is suspicious, but Venetti firmly states that even if the objects go to the future or the past, there is a small chance of them appearing again soon. Tony starts talking about the mass-production of these machines, but Venetti initially protests, scared of legal prosecution and reputational damage. But eventually, the professor gives up, realizing that this mechanism  - Tony calls it an Expendable - won’t be useful to the government. Sometime later, Camren and Venetti decide to test the machine outside. After flipping the switch, Venetti sees that a distant warehouse building disappears. He is shocked and soon notices that the unit is halved. Tony says that his friend separated the mechanism to square the operational field, and it worked. He also says that his enemy Harry Keno just got wiped out together with his intimates and their confidential squat. The following morning, the Times mentions the vanishing of the building and that the government is developing a disintegrating process for waste. Tony comes to him and tells him that Arcivox - a company producing radios and TV sets - wants to buy the machine. Tony suggests selling the potent and keeping it in control through a separate corporation. Several months later, professor Venetti is in his office talking to his secretary, Miss Brown, about the future business communications. Suddenly Tony bangs open the door and says that G-men are on their way. Seconds later, an investigator from the Atomic Energy Commission comes in. He quickly states that the manufacturing of the Expendable will soon be banned. He explains that their scientists understood that the energy the machine seemingly destroyed actually turned into heat. This process increased the mean temperature. The professor agrees but adds that people are too stubborn to stop using the machine. He suggests creating an engine that would use up this extra energy. When they switch the disexpendable on, slowly the body of Harry Keno appears on the revolving disc. At the end, Venetti claims that his inventions are useless now and that this story is true, and he encourages the readers to write letters towards his upcoming defense."
              },
              {
                "worker_id": "111",
                "uid": "61c4ddb230b746f58145c69010c7afca",
                "response_text": "The story follows a scientist who works for the U.S. Government. He is trying to find ways that the Government can get rid of radioactive and nuclear waste cleanly and safely. He is approached by a member of the Italian Mob. He asks Venetti to continue making this instrument, and to give him a copy when he makes it, because he needs to find a way to get rid of human bodies. At the beginning Venetti doubts doing this, but he believes it is a good way to make money. Venetti finally makes it and it, and gives Venetti one of the machines. The machine seems to get rid of anything that is put in it, without leaving behind any trace. Together, they start a company and commercially sell the boxes as expendables. They start to gain a lot of money, because it makes life easier for a lot of people. Their company grows a lot, and they start to get a lot of. Finally, it is revealed that the expendables have been contributing to global warming, as it excretes the energy into the environment. Venetti develops another machine in order to counteract the effects of the original expendable, which leads to regenerating everything that was put in the machine, including the dead bodies. This leads to Venetti being sued for the expendables, as people believe that he approached the member of the mob first. "
              },
              {
                "worker_id": "108",
                "uid": "3c333be6b0da45d59322ef334d206637",
                "response_text": "The Expendables is written in the form of a personal account by scientist Professor Venetti. He is approached by a stranger claiming to know the Mafia, Tony Carmen, who asks him for a favor to which Venetti initially refuses. Carmen is trying to use the professor’s potential invention to get rid of dead bodies Carmen has. After Carmen makes Venetti aware that he knows about his secret project with the government to develop an innovation that would get rid of radioactive wastes, Carmen manages to make Venetti agree to help him. Prof. Venetti makes him promise that he did not kill the bodies. Venetti has yet to succeed in finding such an invention because this requires a neutralization of the radioactive emanations while he has only been able to reduce the radioactive mass. With less responsibility and credibility associated with Tony’s request compared to the government’s, he decides to perform more risky experimentations. He finds a way to make trash disappear but by completely destroying its mass. Venetti thinks that contrary to the government, Carmen would not be curious enough to ask where the mass actually goes. Carmen does in fact ask this when Venetti shows him the machine as he is concerned that he will get caught. Venetti genuinely does not know the answer and Carmen proposes that they launch the machine as the “Expendable”. With his business expertise, Carmen promises to help with the launch while Venetti is still concerned with the ethical implications such as a possible rise in murder rate. Together, they go test the machine on an empty, wide land with bodyguards around in case any policemen show up. When they use it, a square shape of the horizon disappears and Tony uses the machine for corpses which Venetti ultimately understands were results of Carmen’s own crime. The next morning, the innovation is featured in the newspaper as a rumor. Arcivox, a radio and TV company, expresses interest. Tony convinces Venetti to accept the offer when they come forward, saying that he will give him a large portion of the stocks.\n\nFlash forward into time, after taking the offer, Venetti is now a business man but he is not enjoying it. One day, the Atomic Energy Commission approaches his team, telling him they need to end the Expendables. They explain that their scientists used to think that the increasing hot weather was due to nuclear testing but they found that it was in fact due to the Expendables. The machines merely destroy matter but do not create any, violating the law of conversion of energy which could raise the Earth temperature to worrying extremities. Venetti argues that the public would not be willing to stop its use because of how convenient it is and instead agrees to create “Disexpendibles” which would create the opposite effect. When put to use, the temperature readjusts but trash reappears and so do the bodies that Tony wanted gone. At the very least, this held Tony accountable for his actions.\n"
              }
            ]
          },
          {
            "question_text": "Who is Tony Carmen and what happens to him in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "112",
                "uid": "49fcdca30ca949f1b6b4f720c503b473",
                "response_text": "Tony Carmen is a racketeer who threatens Professor Venetti to invent the machine to decompose corpses without leaving any traces. He is also a criminal who does not care about killing people, so he orders Professor Venetti to conduct the machine to wipe off the warehouse and the people inside. It is also implied that he kills the corpse he wants to get rid of. When he receives the machine Professor Venetti creates, he gives it to his subordinates and lets them modify it. He takes Professor Venetti to the place where they try the machine's function. He has many connections to business, the mafia, and the news, and he knows how to make profits by manipulating the business work behind the scene. When he realizes how much profit the machine can make after seeing its effects, he persuades Professor Venetti to collaborate with him. He leaks the information through the newspaper to attract the business corporates’ attention. When the agent from Atomic Energy Commission informs the harmful consequences of the machine, he strongly disagrees with the ban on the manufacture and the selling of the device. When Professor Venetti turns on the reverse machine, Tony is panicked, and he shouts to order the professor to turn off the engine."
              },
              {
                "worker_id": "113",
                "uid": "575c44ac458249d78baf7dfd7118532d",
                "response_text": "Tony Carmen is one of the near-mafia criminals. At the beginning, he asks a scientist called Venetti, who works in the secret radioactive wastes disposal project, to come up with a mechanism that could help Tony get rid of the bodies Harry Keno leaves at his place. Soon the professor says that he created a mechanism that works like an incinerator but with no traces. Tony tries to understand where the bodies would go after disappearing in this machine. Venetti honestly says that he doesn’t know where they end up: it might be the past, the future, or another dimension. He also explains that the probability of finding these bodies is small, and Tony accepts this. Carmen also mentions that they could mass-produce these machines, which Venetti finds impractical. Tony calls it an Expendable and decides to test it. He asks his friend to halve the unit to cover the area of Harry Keno’s warehouse. When the professor turns it on, the building disappears, wiping out its inhabitants - Keno and his intimates - too. Tony starts leaking information about the mechanism to intrigue potential buyers, for example, ordering a small article in the Times. Soon he gets an offer from Arcivox - a manufacturer of radio and TV sets. Tony persuades the professor to sell the potent and control the manufacturing through a separate company. Their business grows fast. Months later, Tony learns that some government officials are going to come to them. He gets into Venetti’s office seconds before the AEC man shows up at the door. Tony starts threatening the officer but gets a witty comeback and then keeps silent. They hear that the government scientist learned that the energy the expendables seemingly destroyed has been turning into heat energy, increasing the mean temperature of Earth and leading to a climate catastrophe. Venetti proposes creating an engine that could use the excess energy by reversing the expendable mechanism. When they switch the engine on, Tony screams to the professor to turn the mechanism off, but the body of Harry Keno appears quickly. They both are under investigation. "
              },
              {
                "worker_id": "111",
                "uid": "61c4ddb230b746f58145c69010c7afca",
                "response_text": "Tony Carmen is a member of the Italian mob who approaches Venetti. Tony is in desperate need of a machine to get rid of bodies. He believes that Venetti could create this device. When Venetti does create it, Tony convinces him to partner with him and start selling them commercially. Tony believes that there is a big space in the market for people to buy them. After he uses the machine to get rid of some men who were messing with his business. At the end, both Tony and Venetti are put on trial. "
              },
              {
                "worker_id": "108",
                "uid": "3c333be6b0da45d59322ef334d206637",
                "response_text": "Tony Carmen is a stranger who approaches Professor Venetti, claiming that he knows the Mafia. He threatens Venetti into helping him with his potential new invention. Carmen is in need of assistance to get rid of dead bodies he has. Venetti is currently working on a secret project with the government to create an innovation that would get rid of radioactive waste. Tony manages to make Venetti agree to help him by threatening him. When Venetti comes up with a machine, “the Expendable,” which he took unusual risks to create, they go test it together on a wide, empty lawn. Tony’s demeanor changes as he becomes more aggressive and makes the bodies, which is hinted that he actually murdered, disappear through the machine. He lures the professor to launch the machine on the market and helps him when a large corporation approaches them. As their business booms, they are approached by the Atomic Energy Commission which explains that their machines have been raising Earth’s temperature and need to be stopped. The professor explains that customer behavior will be hard to change and instead creates “Disexpendables” which does the opposite effect. Tony is very much against this and when put to use, the bodies he hid all come back. This allows the professor to restore justice by disproving the narrative that Tony was creating in which lawyers claimed that the professor approached Tony, suggesting to help him get rid of his enemies in exchange for financial backing for his innovation.\n"
              }
            ]
          },
          {
            "question_text": "What are Professor Venetti’s inventions and what do they do?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "112",
                "uid": "49fcdca30ca949f1b6b4f720c503b473",
                "response_text": "Professor Venetti’s inventions are the Expendables which can decompose anything into nothingness without apparent side effects. It is first shown to violate the energy conservation rule when Professor Venetti finds it produces nothing after the decomposition, and he does not know where the decomposed particles go. However, later in the story, it is revealed by an investigator of the Atomic Energy Commission that the energy transformed from mass through the machine turns into heat, resulting in the rising global temperature. The other device he creates is Disexpendable, the reverse version of the Expendable. It is a medium-sized drum in a frame with an unturned coolie’s hat at the bottom. Disexpendable has a low-efficiency engine, and it can consume excess energy produced by the Expendable and lower the temperature. Consuming the excess energy also makes the once-decomposed mass back together again, such as the corpse."
              },
              {
                "worker_id": "113",
                "uid": "575c44ac458249d78baf7dfd7118532d",
                "response_text": "Professor Venetti’s first invention is called an Expandable. Initially, it’s believed to be able to destroy any physical object without any energy traces. But later the characters learn that the energy of all the waste has been turning into heat, increasing the mean temperature on Earth. This invention almost could lead to climate catastrophe. The second invention is called the Disexpendable - it is an engine that uses excess heat energy. It can be created by reversing the field of the first mechanism. It can draw back the processed material or people, as we see when the body of Harry Keno, who vanished months ago, together with his warehouse, appears on the revolving disk of the engine.  "
              },
              {
                "worker_id": "111",
                "uid": "61c4ddb230b746f58145c69010c7afca",
                "response_text": "Professor Venetti worked for the U.S. government in order to make a device that could get rid of radioactive waste. The device that he created is called an expendable, and it is a box that gets rid of anything that is put in it without any trace. The inventions allow for an increased convenience for consumers who need to get rid of things. At first, the inventions were thought to have no environmental impact, but it is revealed that they had a lot of impact on global warming, as it released energy as heat energy. "
              },
              {
                "worker_id": "108",
                "uid": "3c333be6b0da45d59322ef334d206637",
                "response_text": "Professor Venetti is working on a secret project with the government to create an innovation that would potentially be able to get rid of radioactive wastes. The problem that Venetti is faced with is that getting an energy to destroy another energy without creating new energy actually violates the law of conservation of energy. Nevertheless, Venetti tries to challenge this law. Venetti has yet to succeed in finding such an invention because this requires a neutralization of the radioactive emanations while he has only been able to reduce the radioactive mass. Ultimately, motivated by Venetti’s agreement, he finds a way to make trash disappear but by completely destroying its mass. Together with Carmen, they call this machine the “Expendable.” The only issue is that Venetti does not actually know where the disappeared mass goes. Later, this invention causes issues as by violating the law of conservation of energy, it raises the Earth’s temperature. To fix this, Venetti comes up with another invention, the “Disexpendable,” which would do the opposite effect, consuming the excess energy. He is able to restore the cool temperature back but as a result, this unfortunately brings back all radioactive wastes that were removed by the “Expendables” too.\n"
              }
            ]
          },
          {
            "question_text": "How is the theme of global warming explored throughout the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "112",
                "uid": "49fcdca30ca949f1b6b4f720c503b473",
                "response_text": "Throughout the story, a racketeer demands a professor create a machine to destroy the dead body he has without leaving any traces. The professor invented the device that can destroy mass into nothingness without knowing where the decomposed particles or mass go. However, later in the story, it reveals that the missing energy is turned into heat under the rule of energy conservation, resulting in a rising global temperature. The officials come to ban the usage and production of the machine, but the professor knows that people will still use it for its convenience, just like what people do concerning the wasteful use of water when it is in dire need. The professor ends up creating a machine whose side effect would cool down the temperature to fix the problem. The theme of global warming is explored through the conflicted balance between convenience and environmental damage. People tend to use what is convenient for them with the knowledge of its ecological harm until the consequence is no longer recoverable. The author tries to imply that if we keep wasting resources and damage the environment for our benefit, global warming will reach a point where the earth is no longer recoverable. It is also mentioned in the professor’s thought when he is thinking about selling the machine that tons of patented perpetual motion machines are created, used, and remain as trash without the means to get rid of them. People don’t care whether there is a solution to get rid of those trash completely or don’t know how, but they still produce and use them. This preference for convenience over the environment indicates that humans would not stop their pollution until they bear the consequence of their deeds, not to mention improve the situation of global warming."
              },
              {
                "worker_id": "113",
                "uid": "575c44ac458249d78baf7dfd7118532d",
                "response_text": "Professor Venetti was struggling when creating the mechanism because the physical law of energy conservation didn’t allow him to destroy energy without its simultaneous recreation. Eventually, we learn that the Expandable was actually recreating the energy of the disintegrated matter in the form of heat. His invention led to global warming - the increase in the mean temperature on Earth. The professor realizes the danger of his invention but also admits that it’s unlikely people would quickly stop using such a convenient mechanism. They would ignore the consequences. "
              },
              {
                "worker_id": "111",
                "uid": "61c4ddb230b746f58145c69010c7afca",
                "response_text": "Global warming is an important theme throughout the story. At first, Venetti wanted to create a machine that could reduce the environmental impact of radioactive and nuclear waste. This type of waste harmed the environment, as before the expendables the waste was put underground, where it would seep into the ocean and water supplies. After the use of expendables increased, it seemed like there was little environmental impact, but then it was revealed that the expendables actually increased global warming. This led to Veretti creating a new device that could reverse the effects, leading to all the dead bodies coming back and Veretti getting put on trial. "
              },
              {
                "worker_id": "108",
                "uid": "3c333be6b0da45d59322ef334d206637",
                "response_text": "One of the main themes explored in “The Expenables” is the concept of global warming. Even though published in 1962, the story gives a commentary on the roots of global warming and human responses to it. Initially, we are introduced to the issue of waste with the government and a scientist trying to figure out a way out of it. The ideal thought that we could create an invention that could simply “remove” trash reminds the readers of how we as humans take the consequences of our actions for granted and think that anything can be fixed, even global littering. This shows that we tend to tackle such global problems at the end of their timeline rather than try to genuinely prevent them from happening in the first place. By the end of the story, however, even when a machine has been successfully created to fix this issue, another one, an increase in Earth temperature still occurs. In other words, as the law of conversion of energy states in the story that an energy cannot be destroyed without producing another energy is similar to saying that every action has to have a consequence. The readers recognize that they cannot get the best of both worlds all the time. Venetti also mentions to the Atomic Energy Commission when they want to end the Expendables that the public would not agree to do so because of how convenient it is just like failure to stop them from watering lawns. This symbolizes how global warming or any global issue usually arises from humans’ carelessness and laziness, assuming that their actions are of little importance on this big Earth.\n"
              }
            ]
          },
          {
            "question_text": "How is the theme of capitalism explored throughout the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "112",
                "uid": "49fcdca30ca949f1b6b4f720c503b473",
                "response_text": "The theme of capitalism is explored throughout the story by the greed of the racketeer, Tony Carmen, and how he prefers profits over the environment. In the story, Professor Venetti creates a machine that can easily decompose anything without knowing how it works and where the decomposed particles go. His process of creating the device is also not carefully examined under the safety rules. Despite knowing these manufacturing facts and the uncertainty of its consequences, Tony Carmen makes this machine into a business and sells it for a considerable profit, with the collaboration of Professor Venetti. The theme of capitalism is shown through the preference for profits over safety when seeking profits from a product. It is also explored through Tony’s dealings with business corporates and how he attracts business corporations’ attention to sell their products. Revealed by Tony’s testimony, big business corporations would have detectives and their sources of information to buy the inventions and sell them. Finally, the mechanism of the business world and the dark side of capitalism are shown through Tony’s plan to sell the products and all the dirty work behind it when Professor Venetti’s secretary is reading the letters regarding their business matter from several organizations."
              },
              {
                "worker_id": "113",
                "uid": "575c44ac458249d78baf7dfd7118532d",
                "response_text": "The story shows how commercial benefits may outweigh all the negative consequences of inventions and products. Tony Carmen says that the government would allow a private company like Arcivox to sell anything - they just have to find a commercial use for a potential product. Tony Carmen’s and Venetti’s desire to profit off of the professor’s mechanism leads to global warming and makes the threat of climate doomsday more than realistic. The story also shows that people disregard environmental repercussions when the commodity they’re using is convenient.\n\n\n"
              },
              {
                "worker_id": "111",
                "uid": "61c4ddb230b746f58145c69010c7afca",
                "response_text": "Capitalism is one of the most important themes in the story. Veretti’s and Tony’s hunger for money is what led them to selling these very controversial boxes, and Veretti deciding to look away when the boxes were used for murder. When convincing Veretti to work with him, Tony even compares him to Henry Ford and Sam Colt, two famous capitalists that also decided to look away when their inventions lead to death. Capitalism also was the reason that led to an absurd number of sales of the expendables, as consumers are always looking for their lives to be easier. The expendables provided this exact same service, as it was a very easy and simple way that people could get rid of trash."
              },
              {
                "worker_id": "108",
                "uid": "3c333be6b0da45d59322ef334d206637",
                "response_text": "One of the main themes explored in “The Expenables” is also the concept of capitalism. We are first introduced to a scientist working for the government with the best intentions to find a fix to a global issue through innovation. As the story goes on, however, he is lured by a stranger belonging to the mafia to take the easy and riskier path to speed up the process of creating a successful innovation. Additionally, when this machine works, we see the professor ditch his ethical concerns around it and rather starts getting attracted by the financial benefits he is told he could get by the stranger if he were to launch his product on the market. Instead of sticking with his initial intentions of helping the government, he chooses to partner with a large corporation who takes on his machines worldwide as he is promised a big sum of the stocks. This showcases human greed that arises from capitalism and how it can consume an individual to the point that they disregard all ethical thoughts, even when on a global level. Moreover, we are introduced to the idea of convenience the public is used to. Instead of ending his machines, the scientist creates another machine to counter the effect of his first one as he believes the public will not be able to part its convenience. This showcases the speed as to which capitalism has led our lives to adapt to and how because of that, people would choose convenience over the greater good at any time.\n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5197,
        "document_length_chars": 30341
      }
    }
  ]
}