{
  "item_metadata": {
    "item_id": "61198",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61198",
      "content": "\n\n\n\nProduced by Greg Weeks, Mary Meehan and the Online\nDistributed Proofreading Team at http://www.pgdp.net\nAIDE MEMOIRE\nBY KEITH LAUMER\nThe Fustians looked like turtles—but\n   \n  they could move fast when they chose!\n \n  [Transcriber's Note: This etext was produced from\n   \n  Worlds of If Science Fiction, July 1962.\n   \n  Extensive research did not uncover any evidence that\n   \n  the U.S. copyright on this publication was renewed.]\nAcross the table from Retief, Ambassador Magnan rustled a stiff sheet\nof parchment and looked grave.\n \n  \"This aide memoire,\" he said, \"was just handed to me by the Cultural\nAttache. It's the third on the subject this week. It refers to the\nmatter of sponsorship of Youth groups—\"\n \n  \"Some youths,\" Retief said. \"Average age, seventy-five.\"\n \n  \"The Fustians are a long-lived people,\" Magnan snapped. \"These matters\nare relative. At seventy-five, a male Fustian is at a trying age—\"\n \n  \"That's right. He'll try anything—in the hope it will maim somebody.\"\n \n  \"Precisely the problem,\" Magnan said. \"But the Youth Movement is\nthe important news in today's political situation here on Fust. And\nsponsorship of Youth groups is a shrewd stroke on the part of the\nTerrestrial Embassy. At my suggestion, well nigh every member of the\nmission has leaped at the opportunity to score a few p—that is, cement\nrelations with this emergent power group—the leaders of the future.\nYou, Retief, as Councillor, are the outstanding exception.\"\n \n  \"I'm not convinced these hoodlums need my help in organizing their\nrumbles,\" Retief said. \"Now, if you have a proposal for a pest control\ngroup—\"\n \n  \"To the Fustians this is no jesting matter,\" Magnan cut in. \"This\ngroup—\" he glanced at the paper—\"known as the Sexual, Cultural, and\nAthletic Recreational Society, or SCARS for short, has been awaiting\nsponsorship for a matter of weeks now.\"\n \n  \"Meaning they want someone to buy them a clubhouse, uniforms, equipment\nand anything else they need to complete their sexual, cultural and\nathletic development,\" Retief said.\n \n  \"If we don't act promptly,\" Magnan said, \"the Groaci Embassy may well\nanticipate us. They're very active here.\"\n \n  \"That's an idea,\" said Retief. \"Let 'em. After awhile they'll go broke\ninstead of us.\"\n \n  \"Nonsense. The group requires a sponsor. I can't actually order you to\nstep forward. However....\" Magnan let the sentence hang in the air.\nRetief raised one eyebrow.\n \n  \"For a minute there,\" he said, \"I thought you were going to make a\npositive statement.\"\nMagnan leaned back, lacing his fingers over his stomach. \"I don't think\nyou'll find a diplomat of my experience doing anything so naive,\" he\nsaid.\n \n  \"I like the adult Fustians,\" said Retief. \"Too bad they have to lug\nhalf a ton of horn around on their backs. I wonder if surgery would\nhelp.\"\n \n  \"Great heavens, Retief,\" Magnan sputtered. \"I'm amazed that even you\nwould bring up a matter of such delicacy. A race's unfortunate physical\ncharacteristics are hardly a fit matter for Terrestrial curiosity.\"\n \n  \"Well, of course your experience of the Fustian mentality is greater\nthan mine. I've only been here a month. But it's been my experience,\nMr. Ambassador, that few races are above improving on nature. Otherwise\nyou, for example, would be tripping over your beard.\"\n \n  Magnan shuddered. \"Please—never mention the idea to a Fustian.\"\n \n  Retief stood. \"My own program for the day includes going over to the\ndockyards. There are some features of this new passenger liner the\nFustians are putting together that I want to look into. With your\npermission, Mr. Ambassador...?\"\n \n  Magnan snorted. \"Your pre-occupation with the trivial disturbs me,\nRetief. More interest in substantive matters—such as working with\nYouth groups—would create a far better impression.\"\n \n  \"Before getting too involved with these groups, it might be a good idea\nto find out a little more about them,\" said Retief. \"Who organizes\nthem? There are three strong political parties here on Fust. What's the\nalignment of this SCARS organization?\"\n \n  \"You forget, these are merely teenagers, so to speak,\" Magnan said.\n\"Politics mean nothing to them ... yet.\"\n \n  \"Then there are the Groaci. Why their passionate interest in a\ntwo-horse world like Fust? Normally they're concerned with nothing but\nbusiness. But what has Fust got that they could use?\"\n \n  \"You may rule out the commercial aspect in this instance,\" said Magnan.\n\"Fust possesses a vigorous steel-age manufacturing economy. The Groaci\nare barely ahead of them.\"\n \n  \"Barely,\" said Retief. \"Just over the line into crude atomics ... like\nfission bombs.\"\n \n  Magnan shook his head, turned back to his papers. \"What market exists\nfor such devices on a world at peace? I suggest you address your\nattention to the less spectacular but more rewarding work of studying\nthe social patterns of the local youth.\"\n \n  \"I've studied them,\" said Retief. \"And before I meet any of the local\nyouth socially I want to get myself a good blackjack.\"\nII\n \n  Retief left the sprawling bungalow-type building that housed the\nchancery of the Terrestrial Embassy, swung aboard a passing flat-car\nand leaned back against the wooden guard rail as the heavy vehicle\ntrundled through the city toward the looming gantries of the shipyards.\n \n  It was a cool morning. A light breeze carried the fishy odor of Fusty\ndwellings across the broad cobbled avenue. A few mature Fustians\nlumbered heavily along in the shade of the low buildings, audibly\nwheezing under the burden of their immense carapaces. Among them,\nshell-less youths trotted briskly on scaly stub legs. The driver of the\nflat-car, a labor-caste Fustian with his guild colors emblazoned on his\nback, heaved at the tiller, swung the unwieldy conveyance through the\nshipyard gates, creaked to a halt.\n \n  \"Thus I come to the shipyard with frightful speed,\" he said in Fustian.\n\"Well I know the way of the naked-backs, who move always in haste.\"\n \n  Retief climbed down, handed him a coin. \"You should take up\nprofessional racing,\" he said. \"Daredevil.\"\n \n  He crossed the littered yard and tapped at the door of a rambling shed.\nBoards creaked inside. Then the door swung back.\n \n  A gnarled ancient with tarnished facial scales and a weathered carapace\npeered out at Retief.\n \n  \"Long-may-you-sleep,\" said Retief. \"I'd like to take a look around, if\nyou don't mind. I understand you're laying the bedplate for your new\nliner today.\"\n\"May-you-dream-of-the-deeps,\" the old fellow mumbled. He waved a stumpy\narm toward a group of shell-less Fustians standing by a massive hoist.\n\"The youths know more of bedplates than do I, who but tend the place of\npapers.\"\n \n  \"I know how you feel, old-timer,\" said Retief. \"That sounds like the\nstory of my life. Among your papers do you have a set of plans for the\nvessel? I understand it's to be a passenger liner.\"\n \n  The oldster nodded. He shuffled to a drawing file, rummaged, pulled out\na sheaf of curled prints and spread them on the table. Retief stood\nsilently, running a finger over the uppermost drawing, tracing lines....\n \n  \"What does the naked-back here?\" barked a deep voice behind Retief. He\nturned. A heavy-faced Fustian youth, wrapped in a mantle, stood at the\nopen door. Beady yellow eyes set among fine scales bored into Retief.\n \n  \"I came to take a look at your new liner,\" said Retief.\n \n  \"We need no prying foreigners here,\" the youth snapped. His eye fell on\nthe drawings. He hissed in sudden anger.\n \n  \"Doddering hulk!\" he snapped at the ancient. \"May you toss in\nnightmares! Put by the plans!\"\n \n  \"My mistake,\" Retief said. \"I didn't know this was a secret project.\"\nThe youth hesitated. \"It is not a secret project,\" he muttered. \"Why\nshould it be secret?\"\n \n  \"You tell me.\"\n \n  The youth worked his jaws and rocked his head from side to side in the\nFusty gesture of uncertainty. \"There is nothing to conceal,\" he said.\n\"We merely construct a passenger liner.\"\n \n  \"Then you don't mind if I look over the drawings,\" said Retief. \"Who\nknows? Maybe some day I'll want to reserve a suite for the trip out.\"\n \n  The youth turned and disappeared. Retief grinned at the oldster. \"Went\nfor his big brother, I guess,\" he said. \"I have a feeling I won't get\nto study these in peace here. Mind if I copy them?\"\n \n  \"Willingly, light-footed one,\" said the old Fustian. \"And mine is the\nshame for the discourtesy of youth.\"\n \n  Retief took out a tiny camera, flipped a copying lens in place, leafed\nthrough the drawings, clicking the shutter.\n \n  \"A plague on these youths,\" said the oldster, \"who grow more virulent\nday by day.\"\n \n  \"Why don't you elders clamp down?\"\n \n  \"Agile are they and we are slow of foot. And this unrest is new.\nUnknown in my youth was such insolence.\"\n \n  \"The police—\"\n \n  \"Bah!\" the ancient rumbled. \"None have we worthy of the name, nor have\nwe needed ought ere now.\"\n \n  \"What's behind it?\"\n \n  \"They have found leaders. The spiv, Slock, is one. And I fear they plot\nmischief.\" He pointed to the window. \"They come, and a Soft One with\nthem.\"\n \n  Retief pocketed the camera, glanced out the window. A pale-featured\nGroaci with an ornately decorated crest stood with the youths, who eyed\nthe hut, then started toward it.\n \n  \"That's the military attache of the Groaci Embassy,\" Retief said. \"I\nwonder what he and the boys are cooking up together?\"\n \n  \"Naught that augurs well for the dignity of Fust,\" the oldster rumbled.\n\"Flee, agile one, while I engage their attentions.\"\n \n  \"I was just leaving,\" Retief said. \"Which way out?\"\n \n  \"The rear door,\" the Fustian gestured with a stubby member. \"Rest well,\nstranger on these shores.\" He moved to the entrance.\n \n  \"Same to you, pop,\" said Retief. \"And thanks.\"\n \n  He eased through the narrow back entrance, waited until voices were\nraised at the front of the shed, then strolled off toward the gate.\nThe second dark of the third cycle was lightening when Retief left the\nEmbassy technical library and crossed the corridor to his office. He\nflipped on a light. A note was tucked under a paperweight:\n \n  \"Retief—I shall expect your attendance at the IAS dinner at first\ndark of the fourth cycle. There will be a brief but, I hope, impressive\nSponsorship ceremony for the SCARS group, with full press coverage,\narrangements for which I have managed to complete in spite of your\nintransigence.\"\n \n  Retief snorted and glanced at his watch. Less than three hours. Just\ntime to creep home by flat-car, dress in ceremonial uniform and creep\nback.\n \n  Outside he flagged a lumbering bus. He stationed himself in a corner\nand watched the yellow sun, Beta, rise rapidly above the low skyline.\nThe nearby sea was at high tide now, under the pull of the major sun\nand the three moons, and the stiff breeze carried a mist of salt spray.\n \n  Retief turned up his collar against the dampness. In half an hour he\nwould be perspiring under the vertical rays of a third-noon sun, but\nthe thought failed to keep the chill off.\n \n  Two Youths clambered up on the platform, moving purposefully toward\nRetief. He moved off the rail, watching them, weight balanced.\n \n  \"That's close enough, kids,\" he said. \"Plenty of room on this scow. No\nneed to crowd up.\"\n \n  \"There are certain films,\" the lead Fustian muttered. His voice was\nunusually deep for a Youth. He was wrapped in a heavy cloak and moved\nawkwardly. His adolescence was nearly at an end, Retief guessed.\n \n  \"I told you once,\" said Retief. \"Don't crowd me.\"\n \n  The two stepped close, slit mouths snapping in anger. Retief put out a\nfoot, hooked it behind the scaly leg of the overaged juvenile and threw\nhis weight against the cloaked chest. The clumsy Fustian tottered, fell\nheavily. Retief was past him and off the flat-car before the other\nYouth had completed his vain lunge toward the spot Retief had occupied.\nThe Terrestrial waved cheerfully at the pair, hopped aboard another\nvehicle, watched his would-be assailants lumber down from their car,\ntiny heads twisted to follow his retreating figure.\n \n  So they wanted the film? Retief reflected, thumbing a cigar alight.\nThey were a little late. He had already filed it in the Embassy vault,\nafter running a copy for the reference files.\n \n  And a comparison of the drawings with those of the obsolete Mark XXXV\nbattle cruiser used two hundred years earlier by the Concordiat Naval\nArm showed them to be almost identical, gun emplacements and all. The\nterm \"obsolete\" was a relative one. A ship which had been outmoded in\nthe armories of the Galactic Powers could still be king of the walk in\nthe Eastern Arm.\n \n  But how had these two known of the film? There had been no one present\nbut himself and the old-timer—and he was willing to bet the elderly\nFustian hadn't told them anything.\n \n  At least not willingly....\n \n  Retief frowned, dropped the cigar over the side, waited until the\nflat-car negotiated a mud-wallow, then swung down and headed for the\nshipyard.\nThe door, hinges torn loose, had been propped loosely back in position.\nRetief looked around at the battered interior of the shed. The old\nfellow had put up a struggle.\n \n  There were deep drag-marks in the dust behind the building. Retief\nfollowed them across the yard. They disappeared under the steel door of\na warehouse.\n \n  Retief glanced around. Now, at the mid-hour of the fourth cycle, the\nworkmen were heaped along the edge of the refreshment pond, deep in\ntheir siesta. He took a multi-bladed tool from a pocket, tried various\nfittings in the lock. It snicked open.\n \n  He eased the door aside far enough to enter.\n \n  Heaped bales loomed before him. Snapping on the tiny lamp in the handle\nof the combination tool, Retief looked over the pile. One stack seemed\nout of alignment ... and the dust had been scraped from the floor\nbefore it. He pocketed the light, climbed up on the bales, looked over\ninto a nest made by stacking the bundles around a clear spot. The aged\nFustian lay in it, on his back, a heavy sack tied over his head.\n \n  Retief dropped down inside the ring of bales, sawed at the tough twine\nand pulled the sack free.\n \n  \"It's me, old fellow,\" Retief said. \"The nosy stranger. Sorry I got you\ninto this.\"\n \n  The oldster threshed his gnarled legs. He rocked slightly and fell\nback. \"A curse on the cradle that rocked their infant slumbers,\" he\nrumbled. \"But place me back on my feet and I hunt down the youth,\nSlock, though he flee to the bottommost muck of the Sea of Torments.\"\n \n  \"How am I going to get you out of here? Maybe I'd better get some help.\"\n \n  \"Nay. The perfidious Youths abound here,\" said the old Fustian. \"It\nwould be your life.\"\n \n  \"I doubt if they'd go that far.\"\n \n  \"Would they not?\" The Fustian stretched his neck. \"Cast your light\nhere. But for the toughness of my hide....\"\n \n  Retief put the beam of the light on the leathery neck. A great smear of\nthick purplish blood welled from a ragged cut. The oldster chuckled, a\nsound like a seal coughing.\n \n  \"Traitor, they called me. For long they sawed at me—in vain. Then\nthey trussed me and dumped me here. They think to return with weapons\nto complete the task.\"\n \n  \"Weapons? I thought it was illegal!\"\n \n  \"Their evil genius, the Soft One,\" said the Fustian. \"He would provide\nfuel to the Devil himself.\"\n \n  \"The Groaci again,\" said Retief. \"I wonder what their angle is.\"\n \n  \"And I must confess, I told them of you, ere I knew their full\nintentions. Much can I tell you of their doings. But first, I pray, the\nblock and tackle.\"\n \n  Retief found the hoist where the Fustian directed him, maneuvered it\ninto position, hooked onto the edge of the carapace and hauled away.\nThe immense Fustian rose slowly, teetered ... then flopped on his chest.\n \n  Slowly he got to his feet.\n \n  \"My name is Whonk, fleet one,\" he said. \"My cows are yours.\"\n \n  \"Thanks. I'm Retief. I'd like to meet the girls some time. But right\nnow, let's get out of here.\"\n \n  Whonk leaned his bulk against the ponderous stacks of baled kelp,\nbulldozed them aside. \"Slow am I to anger,\" he said, \"but implacable in\nmy wrath. Slock, beware!\"\n \n  \"Hold it,\" said Retief suddenly. He sniffed. \"What's that odor?\" He\nflashed the light around, played it over a dry stain on the floor. He\nknelt, sniffed at the spot.\n \n  \"What kind of cargo was stacked here, Whonk? And where is it now?\"\n \n  Whonk considered. \"There were drums,\" he said. \"Four of them, quite\nsmall, painted an evil green, the property of the Soft Ones, the\nGroaci. They lay here a day and a night. At full dark of the first\nperiod they came with stevedores and loaded them aboard the barge\nMoss\nRock\n.\"\n \n  \"The VIP boat. Who's scheduled to use it?\"\n \n  \"I know not. But what matters this? Let us discuss cargo movements\nafter I have settled a score with certain Youths.\"\n \n  \"We'd better follow this up first, Whonk. There's only one substance I\nknow of that's transported in drums and smells like that blot on the\nfloor. That's titanite: the hottest explosive this side of a uranium\npile.\"\nIII\n \n  Beta was setting as Retief, Whonk puffing at his heels, came up to the\nsentry box beside the gangway leading to the plush interior of the\nofficial luxury space barge\nMoss Rock\n.\n \n  \"A sign of the times,\" said Whonk, glancing inside the empty shelter.\n\"A guard should stand here, but I see him not. Doubtless he crept away\nto sleep.\"\n \n  \"Let's go aboard and take a look around.\"\n \n  They entered the ship. Soft lights glowed in utter silence. A rough box\nstood on the floor, rollers and pry-bars beside it—a discordant note\nin the muted luxury of the setting. Whonk rummaged in it.\n \n  \"Curious,\" he said. \"What means this?\" He held up a stained cloak of\norange and green, a metal bracelet, papers.\n \n  \"Orange and green,\" mused Relief. \"Whose colors are those?\"\n \n  \"I know not.\" Whonk glanced at the arm-band. \"But this is lettered.\" He\npassed the metal band to Retief.\n \n  \"SCARS,\" Retief read. He looked at Whonk. \"It seems to me I've heard\nthe name before,\" he murmured. \"Let's get back to the Embassy—fast.\"\n \n  Back on the ramp Retief heard a sound ... and turned in time to duck\nthe charge of a hulking Fustian youth who thundered past him and\nfetched up against the broad chest of Whonk, who locked him in a warm\nembrace.\n \n  \"Nice catch, Whonk. Where'd he sneak out of?\"\n \n  \"The lout hid there by the storage bin,\" rumbled Whonk. The captive\nyouth thumped fists and toes fruitlessly against the oldster's carapace.\n \n  \"Hang onto him,\" said Retief. \"He looks like the biting kind.\"\n \n  \"No fear. Clumsy I am, yet not without strength.\"\n \n  \"Ask him where the titanite is tucked away.\"\n \n  \"Speak, witless grub,\" growled Whonk, \"lest I tweak you in twain.\"\n \n  The youth gurgled.\n \n  \"Better let up before you make a mess of him,\" said Retief. Whonk\nlifted the Youth clear of the floor, then flung him down with a thump\nthat made the ground quiver. The younger Fustian glared up at the\nelder, mouth snapping.\n \n  \"This one was among those who trussed me and hid me away for the\nkilling,\" said Whonk. \"In his repentance he will tell all to his elder.\"\n \n  \"That's the same young squirt that tried to strike up an acquaintance\nwith me on the bus,\" Retief said. \"He gets around.\"\n \n  The youth scrambled to hands and knees, scuttled for freedom. Retief\nplanted a foot on his dragging cloak; it ripped free. He stared at the\nbare back of the Fustian—\n \n  \"By the Great Egg!\" Whonk exclaimed, tripping the refugee as he tried\nto rise. \"This is no Youth! His carapace has been taken from him!\"\n \n  Retief looked at the scarred back. \"I thought he looked a little old.\nBut I thought—\"\n \n  \"This is not possible,\" Whonk said wonderingly. \"The great nerve trunks\nare deeply involved. Not even the cleverest surgeon could excise the\ncarapace and leave the patient living.\"\n \n  \"It looks like somebody did the trick. But let's take this boy with us\nand get out of here. His folks may come home.\"\n \n  \"Too late,\" said Whonk. Retief turned.\n \n  Three youths came from behind the sheds.\n \n  \"Well,\" Retief said. \"It looks like the SCARS are out in force tonight.\nWhere's your pal?\" he said to the advancing trio. \"The sticky little\nbird with the eye-stalks? Back at his Embassy, leaving you suckers\nholding the bag, I'll bet.\"\n \n  \"Shelter behind me, Retief,\" said Whonk.\n \n  \"Go get 'em, old-timer.\" Retief stooped, picked up one of the pry-bars.\n\"I'll jump around and distract them.\"\n \n  Whonk let out a whistling roar and charged for the immature Fustians.\nThey fanned out ... and one tripped, sprawled on his face. Retief\nwhirled the metal bar he had thrust between the Fustian's legs, slammed\nit against the skull of another, who shook his head, turned on\nRetief ... and bounced off the steel hull of the\nMoss Rock\nas Whonk\ntook him in full charge.\n \n  Retief used the bar on another head. His third blow laid the Fustian\non the pavement, oozing purple. The other two club members departed\nhastily, seriously dented but still mobile.\n \n  Retief leaned on his club, breathing hard. \"Tough heads these kids\nhave got. I'm tempted to chase those two lads down, but I've got\nanother errand to run. I don't know who the Groaci intended to blast,\nbut I have a sneaking suspicion somebody of importance was scheduled\nfor a boat ride in the next few hours. And three drums of titanite is\nenough to vaporize this tub and everyone aboard her.\"\n \n  \"The plot is foiled,\" said Whonk. \"But what reason did they have?\"\n \n  \"The Groaci are behind it. I have an idea the SCARS didn't know about\nthis gambit.\"\n \n  \"Which of these is the leader?\" asked Whonk. He prodded a fallen Youth\nwith a horny toe. \"Arise, dreaming one.\"\n \n  \"Never mind him, Whonk. We'll tie these two up and leave them here. I\nknow where to find the boss.\"\nA stolid crowd filled the low-ceilinged banquet hall. Retief scanned\nthe tables for the pale blobs of Terrestrial faces, dwarfed by the\ngiant armored bodies of the Fustians. Across the room Magnan fluttered\na hand. Retief headed toward him. A low-pitched vibration filled the\nair: the rumble of subsonic Fustian music.\n \n  Retief slid into his place beside Magnan. \"Sorry to be late, Mr.\nAmbassador.\"\n \n  \"I'm honored that you chose to appear at all,\" said Magnan coldly. He\nturned back to the Fustian on his left.\n \n  \"Ah, yes, Mr. Minister,\" he said. \"Charming, most charming. So joyous.\"\n \n  The Fustian looked at him, beady-eyed. \"It is the\nLament of\nHatching\n,\" he said; \"our National Dirge.\"\n \n  \"Oh,\" said Magnan. \"How interesting. Such a pleasing balance of\ninstruments—\"\n \n  \"It is a droon solo,\" said the Fustian, eyeing the Terrestrial\nAmbassador suspiciously.\n \n  \"Why don't you just admit you can't hear it,\" Retief whispered loudly.\n\"And if I may interrupt a moment—\"\n \n  Magnan cleared his throat. \"Now that our Mr. Retief has arrived,\nperhaps we could rush right along to the Sponsorship ceremonies.\"\n \n  \"This group,\" said Retief, leaning across Magnan, \"the SCARS. How much\ndo you know about them, Mr. Minister?\"\n \n  \"Nothing at all,\" the huge Fustian elder rumbled. \"For my taste, all\nYouths should be kept penned with the livestock until they grow a\ncarapace to tame their irresponsibility.\"\n \n  \"We mustn't lose sight of the importance of channeling youthful\nenergies,\" said Magnan.\n \n  \"Labor gangs,\" said the minister. \"In my youth we were indentured to\nthe dredge-masters. I myself drew a muck sledge.\"\n \n  \"But in these modern times,\" put in Magnan, \"surely it's incumbent on\nus to make happy these golden hours.\"\n \n  The minister snorted. \"Last week I had a golden hour. They set upon me\nand pelted me with overripe stench-fruit.\"\n \n  \"But this was merely a manifestation of normal youthful frustrations,\"\ncried Magnan. \"Their essential tenderness—\"\n \n  \"You'd not find a tender spot on that lout yonder,\" the minister\nsaid, pointing with a fork at a newly arrived Youth, \"if you drilled\nboreholes and blasted.\"\n\"Why, that's our guest of honor,\" said Magnan, \"a fine young fellow!\nSlop I believe his name is.\"\n \n  \"Slock,\" said Retief. \"Eight feet of armor-plated orneriness. And—\"\n \n  Magnan rose and tapped on his glass. The Fustians winced at the, to\nthem, supersonic vibrations. They looked at each other muttering.\nMagnan tapped louder. The Minister drew in his head, eyes closed. Some\nof the Fustians rose, tottered for the doors; the noise level rose.\nMagnan redoubled his efforts. The glass broke with a clatter and green\nwine gushed on the tablecloth.\n \n  \"What in the name of the Great Egg!\" the Minister muttered. He blinked,\nbreathing deeply.\n \n  \"Oh, forgive me,\" blurted Magnan, dabbing at the wine.\n \n  \"Too bad the glass gave out,\" said Retief. \"In another minute you'd\nhave cleared the hall. And then maybe I could have gotten a word in\nsideways. There's a matter you should know about—\"\n \n  \"Your attention, please,\" Magnan said, rising. \"I see that our fine\nyoung guest has arrived, and I hope that the remainder of his committee\nwill be along in a moment. It is my pleasure to announce that our Mr.\nRetief has had the good fortune to win out in the keen bidding for the\npleasure of sponsoring this lovely group.\"\n \n  Retief tugged at Magnan's sleeve. \"Don't introduce me yet,\" he said. \"I\nwant to appear suddenly. More dramatic, you know.\"\n \n  \"Well,\" murmured Magnan, glancing down at Retief, \"I'm gratified to\nsee you entering into the spirit of the event at last.\" He turned his\nattention back to the assembled guests. \"If our honored guest will join\nme on the rostrum...?\" he said. \"The gentlemen of the press may want to\ncatch a few shots of the presentation.\"\n \n  Magnan stepped up on the low platform at the center of the wide room,\ntook his place beside the robed Fustian youth and beamed at the cameras.\n \n  \"How gratifying it is to take this opportunity to express once more the\ngreat pleasure we have in sponsoring SCARS,\" he said, talking slowly\nfor the benefit of the scribbling reporters. \"We'd like to think that\nin our modest way we're to be a part of all that the SCARS achieve\nduring the years ahead.\"\n \n  Magnan paused as a huge Fustian elder heaved his bulk up the two low\nsteps to the rostrum, approached the guest of honor. He watched as the\nnewcomer paused behind Slock, who did not see the new arrival.\n \n  Retief pushed through the crowd, stepped up to face the Fustian youth.\nSlock stared at him, drew back.\n \n  \"You know me, Slock,\" said Retief loudly. \"An old fellow named Whonk\ntold you about me, just before you tried to saw his head off, remember?\nIt was when I came out to take a look at that battle cruiser you're\nbuilding.\"\nIV\n \n  With a bellow Slock reached for Retief—and choked off in mid-cry as\nthe Fustian elder, Whonk, pinioned him from behind, lifting him clear\nof the floor.\n \n  \"Glad you reporters happened along,\" said Retief to the gaping newsmen.\n\"Slock here had a deal with a sharp operator from the Groaci Embassy.\nThe Groaci were to supply the necessary hardware and Slock, as foreman\nat the shipyards, was to see that everything was properly installed.\nThe next step, I assume, would have been a local take-over, followed\nby a little interplanetary war on Flamenco or one of the other nearby\nworlds ... for which the Groaci would be glad to supply plenty of ammo.\"\n \n  Magnan found his tongue. \"Are you mad, Retief?\" he screeched. \"This\ngroup was vouched for by the Ministry of Youth!\"\n \n  \"The Ministry's overdue for a purge,\" snapped Retief. He turned back\nto Slock. \"I wonder if you were in on the little diversion that was\nplanned for today. When the\nMoss Rock\nblew, a variety of clues were\nto be planted where they'd be easy to find ... with SCARS written all\nover them. The Groaci would thus have neatly laid the whole affair\nsquarely at the door of the Terrestrial Embassy ... whose sponsorship\nof the SCARS had received plenty of publicity.\"\n \n  \"The\nMoss Rock\n?\" said Magnan. \"But that was—Retief! This is idiotic.\nSlock himself was scheduled to go on a cruise tomorrow!\"\n \n  Slock roared suddenly, twisting violently. Whonk teetered, his grip\nloosened ... and Slock pulled free and was off the platform, butting\nhis way through the milling oldsters on the dining room floor. Magnan\nwatched, open-mouthed.\n \n  \"The Groaci were playing a double game, as usual,\" Retief said. \"They\nintended to dispose of this fellow Slock, once he'd served their\npurpose.\"\n \n  \"Well, don't stand there,\" yelped Magnan over the uproar. \"If Slock is\nthe ring-leader of a delinquent gang...!\" He moved to give chase.\n \n  Retief grabbed his arm. \"Don't jump down there! You'd have as much\nchance of getting through as a jack-rabbit through a threshing contest.\"\n \n  Ten minutes later the crowd had thinned slightly. \"We can get through\nnow,\" Whonk called. \"This way.\" He lowered himself to the floor, bulled\nthrough to the exit. Flashbulbs popped. Retief and Magnan followed in\nWhonk's wake.\n \n  In the lounge Retief grabbed the phone, waited for the operator, gave a\ncode letter. No reply. He tried another.\n \n  \"No good,\" he said after a full minute had passed. \"Wonder what's\nloose?\" He slammed the phone back in its niche. \"Let's grab a cab.\"\nIn the street the blue sun, Alpha, peered like an arc light under a low\ncloud layer, casting flat shadows across the mud of the avenue. The\nthree mounted a passing flat-car. Whonk squatted, resting the weight of\nhis immense shell on the heavy plank flooring.\n \n  \"Would that I too could lose this burden, as has the false youth we\nbludgeoned aboard the\nMoss Rock\n,\" he sighed. \"Soon will I be forced\ninto retirement. Then a mere keeper of a place of papers such as I\nwill rate no more than a slab on the public strand, with once-daily\nfeedings. And even for a man of high position, retirement is no\npleasure. A slab in the Park of Monuments is little better. A dismal\noutlook for one's next thousand years!\"\n \n  \"You two carry on to the police station,\" said Retief. \"I want to play\na hunch. But don't take too long. I may be painfully right.\"\n \n  \"What—?\" Magnan started.\n \n  \"As you wish, Retief,\" said Whonk.\n \n  The flat-car trundled past the gate to the shipyard and Retief jumped\ndown, headed at a run for the VIP boat. The guard post still stood\nvacant. The two Youths whom he and Whonk had left trussed were gone.\n \n  \"That's the trouble with a peaceful world,\" Retief muttered. \"No police\nprotection.\" He stepped down from the lighted entry and took up a\nposition behind the sentry box. Alpha rose higher, shedding a glaring\nblue-white light without heat. Retief shivered. Maybe he'd guessed\nwrong....\n \n  There was a sound in the near distance, like two elephants colliding.\n \n  Retief looked toward the gate. His giant acquaintance, Whonk, had\nreappeared and was grappling with a hardly less massive opponent. A\nsmall figure became visible in the melee, scuttled for the gate. Headed\noff by the battling titans, he turned and made for the opposite side\nof the shipyard. Retief waited, jumped out and gathered in the fleeing\nGroaci.\n \n  \"Well, Yith,\" he said, \"how's tricks? You should pardon the expression.\"\n \n  \"Release me, Retief!\" the pale-featured alien lisped, his throat\nbladder pulsating in agitation. \"The behemoths vie for the privilege of\ndismembering me out of hand!\"\n \n  \"I know how they feel. I'll see what I can do ... for a price.\"\n \n  \"I appeal to you,\" Yith whispered hoarsely. \"As a fellow diplomat, a\nfellow alien, a fellow soft-back—\"\n \n  \"Why don't you appeal to Slock, as a fellow skunk?\" said Retief. \"Now\nkeep quiet ... and you may get out of this alive.\"\n \n  The heavier of the two struggling Fustians threw the other to the\nground. There was another brief flurry, and then the smaller figure was\non its back, helpless.\n \n  \"That's Whonk, still on his feet,\" said Retief. \"I wonder who he's\ncaught—and why.\"\n \n  Whonk came toward the\nMoss Rock\ndragging the supine Fustian, who\nkicked vainly. Retief thrust Yith down well out of sight behind the\nsentry box. \"Better sit tight, Yith. Don't try to sneak off; I can\noutrun you. Stay here and I'll see what I can do.\" He stepped out and\nhailed Whonk.\n \n  Puffing like a steam engine Whonk pulled up before him. \"Sleep,\nRetief!\" He panted. \"You followed a hunch; I did the same. I saw\nsomething strange in this one when we passed him on the avenue. I\nwatched, followed him here. Look! It is Slock, strapped into a dead\ncarapace! Now many things become clear.\"\nRetief whistled. \"So the Youths aren't all as young as they look.\nSomebody's been holding out on the rest of you Fustians!\"\n \n  \"The Soft One,\" Whonk said. \"You laid him by the heels, Retief. I saw.\nProduce him now.\"\n \n  \"Hold on a minute, Whonk. It won't do you any good—\"\n \n  Whonk winked broadly. \"I must take my revenge!\" he roared. \"I shall\ntest the texture of the Soft One! His pulped remains will be scoured up\nby the ramp-washers and mailed home in bottles!\"\n \n  Retief whirled at a sound, caught up with the scuttling Yith fifty feet\naway, hauled him back to Whonk.\n \n  \"It's up to you, Whonk,\" he said. \"I know how important ceremonial\nrevenge is to you Fustians. I will not interfere.\"\n \n  \"Mercy!\" Yith hissed, eye-stalks whipping in distress. \"I claim\ndiplomatic immunity!\"\n \n  \"No diplomat am I,\" rumbled Whonk. \"Let me see; suppose I start with\none of those obscenely active eyes—\" He reached....\n \n  \"I have an idea,\" said Retief brightly. \"Do you suppose—just this\nonce—you could forego the ceremonial revenge if Yith promised to\narrange for a Groaci Surgical Mission to de-carapace you elders?\"\n \n  \"But,\" Whonk protested, \"those eyes! What a pleasure to pluck them, one\nby one!\"\n \n  \"Yess,\" hissed Yith, \"I swear it! Our most expert surgeons ... platoons\nof them, with the finest of equipment.\"\n \n  \"I have dreamed of how it would be to sit on this one, to feel him\nsquash beneath my bulk....\"\n \n  \"Light as a whissle feather shall you dance,\" Yith whispered.\n\"Shell-less shall you spring in the joy of renewed youth—\"\n \n  \"Maybe just one eye,\" said Whonk grudgingly. \"That would leave him\nfour.\"\n \n  \"Be a sport,\" said Retief.\n \n  \"Well.\"\n \n  \"It's a deal then,\" said Retief. \"Yith, on your word as a diplomat,\nan alien, a soft-back and a skunk, you'll set up the mission. Groaci\nsurgical skill is an export that will net you more than armaments.\nIt will be a whissle feather in your cap—if you bring it off. And\nin return, Whonk won't sit on you. And I won't prefer charges of\ninterference in the internal affairs of a free world.\"\n \n  Behind Whonk there was a movement. Slock, wriggling free of the\nborrowed carapace, struggled to his feet ... in time for Whonk to seize\nhim, lift him high and head for the entry to the\nMoss Rock\n.\n \n  \"Hey,\" Retief called. \"Where are you going?\"\n \n  \"I would not deny this one his reward,\" called Whonk. \"He hoped to\ncruise in luxury. So be it.\"\n \n  \"Hold on,\" said Retief. \"That tub is loaded with titanite!\"\n \n  \"Stand not in my way, Retief. For this one in truth owes me a\nvengeance.\"\n \n  Retief watched as the immense Fustian bore his giant burden up the ramp\nand disappeared within the ship.\n \n  \"I guess Whonk means business,\" he said to Yith, who hung in his grasp,\nall five eyes goggling. \"And he's a little too big for me to stop.\"\n \n  Whonk reappeared, alone, climbed down.\n \n  \"What did you do with him?\" said Retief. \"Tell him you were going to—\"\n \n  \"We had best withdraw,\" said Whonk. \"The killing radius of the drive is\nfifty yards.\"\n \n  \"You mean—\"\n \n  \"The controls are set for Groaci. Long-may-he-sleep.\"\n\"It was quite a bang,\" said Retief. \"But I guess you saw it, too.\"\n \n  \"No, confound it,\" Magnan said. \"When I remonstrated with Hulk, or\nWhelk—\"\n \n  \"Whonk.\"\n \n  \"—the ruffian thrust me into an alley bound in my own cloak. I'll most\ncertainly complain to the Minister.\"\n \n  \"How about the surgical mission?\"\n \n  \"A most generous offer,\" said Magnan. \"Frankly, I was astonished. I\nthink perhaps we've judged the Groaci too harshly.\"\n \n  \"I hear the Ministry of Youth has had a rough morning of it,\" said\nRetief. \"And a lot of rumors are flying to the effect that Youth Groups\nare on the way out.\"\n \n  Magnan cleared his throat, shuffled papers. \"I—ah—have explained to\nthe press that last night's—ah—\"\n \n  \"Fiasco.\"\n \n  \"—affair was necessary in order to place the culprits in an untenable\nposition. Of course, as to the destruction of the VIP vessel and the\npresumed death of, uh, Slop.\"\n \n  \"The Fustians understand,\" said Retief. \"Whonk wasn't kidding about\nceremonial vengeance.\"\n \n  \"The Groaci had been guilty of gross misuse of diplomatic privilege,\"\nsaid Magnan. \"I think that a note—or perhaps an Aide Memoire: less\nformal....\"\n \n  \"The\nMoss Rock\nwas bound for Groaci,\" said Retief. \"She was already\nin her transit orbit when she blew. The major fragments will arrive on\nschedule in a month or so. It should provide quite a meteorite display.\nI think that should be all the\naide\nthe Groaci's\nmemoires\nwill need\nto keep their tentacles off Fust.\"\n \n  \"But diplomatic usage—\"\n \n  \"Then, too, the less that's put in writing, the less they can blame you\nfor, if anything goes wrong.\"\n \n  \"That's true,\" said Magnan, lips pursed. \"Now you're thinking\nconstructively, Retief. We may make a diplomat of you yet.\" He smiled\nexpansively.\n \n  \"Maybe. But I refuse to let it depress me.\" Retief stood up. \"I'm\ntaking a few weeks off ... if you have no objection, Mr. Ambassador. My\npal Whonk wants to show me an island down south where the fishing is\ngood.\"\n \n  \"But there are some extremely important matters coming up,\" said\nMagnan. \"We're planning to sponsor Senior Citizen Groups—\"\n \n  \"Count me out. All groups give me an itch.\"\n \n  \"Why, what an astonishing remark, Retief! After all, we diplomats are\nourselves a group.\"\n \n  \"Uh-huh,\" Retief said.\n \n  Magnan sat quietly, mouth open, and watched as Retief stepped into the\nhall and closed the door gently behind him.\n",
      "metadata": {
        "title": "Aide Memoire",
        "author": "Keith Laumer",
        "passage_id": "61198",
        "uid": "e231b33ccdde4a85a43fe243341d85f8",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "4",
                "uid": "5b6e8d8966aa4d008d21bc2759834090",
                "response_text": "As the story opens, Ambassador Magnan briefs Councillor Retief on the Terrestrial Embassy’s request for sponsorship of youth groups on the planet Fust.  Councillor Retief is not interested. Magnan specifically suggests that Retief sponsor the group SCARS (Sexual, Cultural and Athletic Recreational Society), and warns Retief that the rival Groaci may fill any void. Retief suggests researching the youth groups before giving them money. Magnan is dismissive. Retief is still not interested, and leaves to go look at plans for a new passenger liner being built by the Fustians. \nRetief takes a flat-car to the ship yard and meets Whonk, who is a shipyard clerk. He asks to see the blueprints, which he photographs. He and Whonk chat about the attitude of the youth, and Whonk blames it on their new leader, Slock, who hangs around with Yith, a member of the Groaci embassy.\nLater, while Retief is on his way home to dress for a dinner and press event organized by Magnan, two Fustian youths threaten him on the bus. Retief realizes that they were after his photos, which showed that the ship under construction was a battle cruiser, not a passenger liner. He also realizes that Whonk may be in danger. Retief escapes the youths and races back to the shipyard to find that Whonk has been dragged off and tied up in a warehouse. From the Fustian’s wounds, Retief realized that they had tried to kill him.\nRetief figures out that the Fustian youths have taken some titanite, an explosive, over to a ship called the Moss Rock, which would be full of dignitaries later. He and Whonk race over there and encounter more Fustians, and win a fight with them, effectively breaking up the Groaci-backed plot to blow up the ship. \nRetief arrives at the banquet a little late, and exchanges a few words with Magnan, who proceeds to make the Fustians miserable with his cultural insensitivity. A few minutes later, the SCARS leader, Slock, arrives. Retief reveals Slock’s plan: Slock, backed by the Groaci, was planning to take over Fust. The Groaci tried to frame the Terrestrial Embassy for the plot.\nSlock escaped. Retief went back toward the Moss Rock, where Whonk tackled Slock, and Retief accosted Yith. Whonk wanted to take revenge on Yith for attacking him earlier, but Retief instead negotiated a deal in which Yith, who had mastered removing the Fustian carapace surgically, which would be a great relief to Whonk and other elders, would agree to do so in return for not being ritually dismembered. Just as this agreement was completed, Slock tried to escape again, but Whonk dumped him on the Moss Rock, and set the autopilot for Groaci, still full of titanite. It blew up on the way there.\nMagnan wrested what he could, diplomatically speaking, from the wreckage of the youth sponsorship program and moved on to plans to sponsor Senior Citizens Groups.\n"
              },
              {
                "worker_id": "3",
                "uid": "33a99d27926948c09e8527c8a0863bcd",
                "response_text": "This story follows Retief, a Terrestrial diplomat working on the surface of the Fustian planet, where these two species co-exist with the Groaci. At the start of the story, Retief is talking to the Terrestrial Ambassador about a new program that the Fustians are looking for sponsorship for, that the Ambassador wants Retief to take care of. Retief, the Councillor, does not seem interested, and heads out to the shipyards to ask the people there some questions about a new ship being built. An older Fustian named Whonk allows him to see the plans for the ship and tells Retief about Slock, one of the local leaders of the Youths that seems to be a bad influence. These troublesome characters showed up to talk to Whonk and scare Retief off of the docks as Retief slips out unnoticed. He finds plans in the Embassy's library for an old battle cruiser that match the plans for the new ship, pointing him towards a plot to re-introduce weapons into the society. He finds Whonk, injured from the others' attempt to extract information from him, and the two of them piece together the clues: there was titanite, a dangerous explosive, that is going to be placed on the fanciest boat at the docks, the Moss Rock. When they get to that ship to take a look, they find a variety of items emblazoned with the logo of SCARS, the Youth Group that Ambassador Magnan wanted Retief to sponsor at the beginning. Retief figures that these items are here as planted false evidence, so that the explosion would be pinned on the Youth Group, and thus the Terrestrials by extension. Retief's goal is to destroy this plot--Whonk captures a Fustian who they realize has had his shell surgically removed, something that they thought impossible. Retief takes this to mean that the Groaci have more medical knowledge than they realized, and that they are responsible for this plot. In order to expose this plan, he heads to the banquet where the sponsorship of the Youth Group is being announced. He interrupts the Ambassador's grand announcement, exposing the plot to the press that was already gathered there. He knew Slock to be a gang leader, told everyone of the plan to blow up the Moss Rock and his deal with the Groaci, and then runs toward the boat with Whonk and the Ambassador. Whonk wanted to follow through with his society's classic ceremonial revenge against Yith, the Groaci at the ship, but Retief convinces them to have a sort of trade: Yith would share the medical knowledge to remove Whonk's heavy outer shell so that it would no longer be a nuisance and a heavyweight, and Slock is thrown onto the Moss Rock as it leaves the docks and explodes. With the plot exposed, the Ambassador wants to move on to more social projects, but Retief heads out for a fishing vacation with his new friend Whonk."
              },
              {
                "worker_id": "8",
                "uid": "a7064998590c4b819f8cc3238df496c0",
                "response_text": "The story begins with a meeting between Ambassador Magnan and Councillor Retief, who represents the Terrestrial Embassy on the planet Fust. The planet is populated with turtle-like creatures called Fustians (the younger Fustians lack the hard shell of the mature ones). Magnan assigns Retief the mission of sponsoring a new youth movement there called the Sexual, Cultural, Athletic Recreational Society (SCARS). Instead, Retief prefers to investigate a new passenger ship being built by the Fustians. Upon his arrival at the shipyard, Retief meets Whonk, an elderly Fustian who maintains documents, and he shows Retief the blueprints for the new ship. A young Fustian named Slock enters and arouses Retief’s suspicions by inquiring what he wants with the plans. After he leaves the shipyard, Retief is attacked by two young Fustians, and he returns to find Whonk has been attacked as well. Retief notices a stain on the ground that Whonk tells him is a remnant of four drums belonging to the Groaci—an alien species that operated a competing embassy. Retief had seen interacting a Groaci attache interacting with the youth that had attacked him earlier. The drums had been loaded onto a boat called \"Moss Rock.\" After identifying the smelly stain as an explosive called titanite, Retief and Whonk go to \"Moss Rock\" and discover a box containing a SCARS uniform. While there, they are attacked by an older-looking youth Fustian and discover that he is not a youth at all; rather, his shell has been removed by some mysterious method. They ward off another attack by his friends, and Retief decides to head to the sponsorship ceremony, realizing that the Groaci are likely taking advantage of the SCARS group's distaste for Fustian leadership to advance their plot to bomb \"Moss Rock\". At the sponsorship ceremony, Ambassador Magnan introduces Slock as guest of honor, and Retief and Whonk seize the opportunity to apprehend him and explain his deal with the Groaci to the press: The Groaci would supply weapons, and Slock would make sure they were installed on the ship. The SCARS uniforms found at the scene of the exploded ship would implicate them along with the Terrestrial Embassy, because of its sponsorship of SCARS. Magnan notes that Slock was scheduled to be on the ship, and Retief rebuts that this reveals the Groaci's intention to get rid of Slock after he'd done their bidding. Thus, the disaster at \"Moss Rock\" would cement the Groaci's control of Fust. Retief returns to the \"Moss Rock\" and captures the Groaci diplomat Yith, and Whonk captures Slock, whom they both discover has also had his shell surgically removed to appear younger. Retief makes a deal with Whonk to spare Yith's life in exchange for the same shell-removal surgery. Whonk takes his revenge on Slock by placing him back on the \"Moss Rock\" and exploding the ship with the titanite barrels on its course to Groaci. Retief informs Magnan that this display will prevent the Groaci from pursuing any further action against Fust."
              },
              {
                "worker_id": "2",
                "uid": "de621b3387174916833eeca37bc082a8",
                "response_text": "Ambassador Magnan wants Retief, the Councillor working with him at the Terrestrial Embassy, to sponsor the Fustian youth group the Sexual, Cultural, and Athletic Recreational Society (SCARS), but Retief isn’t interested. Instead, he wants to check out the new passenger liner that the Fustians are building, but he does express concern about the Groaci’s interest in Fust, which has a steel-age manufacturing economy while Groaci is into crude atomics. At the shipyards, an old Fustian named Whonk shows him the blueprints for the new passenger liner. Retief takes photographs of the blueprints to study them later. Slock, a young Fustian, comes with a Groaci Embassy military attache and beats up on Whonk while Retief sneaks out the back.\n\nLater in the day, Retief has to attend a dinner where the sponsor for the SCARS youth group will be announced. On the way, he is accosted by two Fustain youth who tell him they want the films for the pictures he took of the blueprints. Retief manages to elude them. He has looked at pictures and realized they are plans for a replica of a battlecruiser used two hundred years ago and has gun placements. Retief realizes that Whonk must have told them about his pictures and knows that he wouldn’t tell them willingly, so he goes to Whonk’s office to look for him. He sees signs of a struggle and finds Whonk tied up behind some bales where he is out of sight. Whonk reveals he was attacked by a Groaci, Slock, and his cohorts, and they tried to kill him. Retief recognizes the smell of an explosive, and Whonk tells him drums of it have been placed on a barge called Moss Rock. \n\nRetief and Whonk decide to go back to the Embassy but are attacked by one of the young Fustians who attacked Whonk earlier that day. As they wrestle with him, they pull off his cloak to discover that his carapace has been removed, so he isn’t really a youth. Whonk is stunned because he believed it wasn’t possible to remove a carapace without killing the Fustian. \n\nAt the dinner, Magnan announces that Retief has won the “bidding” to sponsor the SCARS. Retief sneaks up on Slock and tells Magnan that he has figured out that the Groaci are planning to take over a local world and then branch out to more worlds. They have been using the young Fustians to help them set up their attack but planned to kill them after everything was ready. Retief catches a Groaci, and Whonk wants to kill him, but Retief gets him to promise to have the Groaci surgeon remove the carapaces from the older Fustians like Whonk. When Retief reports the scheme to Magnan, he tells his superior that the Moss Rock is headed for Groaci and will explode there, ending their problems with the Groaci.\n"
              }
            ]
          },
          {
            "question_text": "Summarize the Fustian life cycle and culture.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "4",
                "uid": "5b6e8d8966aa4d008d21bc2759834090",
                "response_text": "Fustians somewhat resemble gigantic, intelligent snapping turtles, and like turtles, start life as eggs. During their youth and adolescence, they are relatively agile and have no shells (unlike turtles). It is notable how many Fustian elders take a dim view of adolescents, with the Minister of Fust himself saying that the Youth should be “kept penned with the livestock until they grow a carapace to tame their irresponsibility.”\nWhen Fustians mature, they develop an enormous, horny carapace which they are obliged to carry around on their backs for the rest of their lives, which last over a thousand years. The carapaces cause the adult Fustians to be slow-moving, and they take up a lot of space – hence their public transportation consists of flat-cars instead of buses with seats. Unfortunately, not much is known by off-worlders of Fustian females.\nLike most intelligent races, Fustians enjoy music. The frequencies at which their music is played are subsonic, and therefore not audible to the human ear. Likewise, their ears are quite sensitive to high frequencies, such as those produced by tapping on a crystal glass with a spoon. This is not just unpleasant, but painful to Fustian ears.\n"
              },
              {
                "worker_id": "3",
                "uid": "33a99d27926948c09e8527c8a0863bcd",
                "response_text": "Fustians are similar to tortoises in build, with yellow eyes, scales, and very thick hides that leak purple blood when cut. They have a much longer life-cycle than humans, as those that are 75 years of age are still considered to be teenagers or even youths. \n\nAs Faustians age, they grow larger, their voices get deeper, and they eventually acquire very heavy shells. It is past their current medical knowledge to safely remove the shells, though we find out at the end of the story that the Groaci have discovered a technique that allows them to do this. This is important because the shells slow the older Fustians down and are often considered a nuisance. When they are young, they are very secretive, and wary of strangers from other groups and species. The older Fustians do not seem to mind the humans (and aliens in general) as much, and sometimes apologize for the behavior of the younger ones. It seems that they wish they could do more to control their behavior, but the younger ones are physically much faster and can escape attempts at control. It also seems to be the case that this difference in behavior is more acute now than it has been in the past, perhaps due to social pressures from other groups. \n\nSleep is very important to them, and regular greetings in day-to-day life include well wishes for a long rest, as well as specific types of dreams. When they are angry or want to insult someone, they wish nightmares upon them. They have regular siesta times during the work day. Sleep is so important to them that they have a National Dirge called the Lament of Hatching. Ceremonial revenge is also important to them: although the older Fustians are not necessarily quick to anger, they follow through once they have been wronged. "
              },
              {
                "worker_id": "8",
                "uid": "a7064998590c4b819f8cc3238df496c0",
                "response_text": "Fustians are a species turtle-like in their appearance. They have very long lives; in fact, the average age of a Fustian youth is seventy-five years old. As they age, they develop a hard-shell on their backs, which is quite heavy and hard. This causes them to move slower as they get older. The younger Fustians can move quite fast in comparison. However, the older Fustians appear to be a great deal stronger and can hold their own in combat, as demonstrated by Whonk when he defends himself against Slock’s cronies and eventually captures Slock. The elderly Fustians also grow thicker skin, which is what ultimately prevents Whonk from being decapitated when he is first attacked. Fustians have turtle-like mouths that snap when they are angry. Steel manufacturing fuels their economy. While older Fustians are generally hospitable and patient, the younger Fustians have become frustrated with the ways of the elderly Fustian leadership, and their drive to change things blinds them to being manipulated by the Groaci. Although weapons are illegal on Fust, the younger Fustians seem willing to break this rule by accepting weapons from the Groaci in exchange for their knowledge of the ships."
              },
              {
                "worker_id": "2",
                "uid": "de621b3387174916833eeca37bc082a8",
                "response_text": "The Fustians look like turtles and have extremely long lifespans. Younger Fustians do not have a carapace, but older ones do, which can be quite heavy. Seventy-five-year-olds are considered youths, like teenagers, because they can live for about two thousand years. The 75-year-olds have a reputation as being at a trying age. As Whonk explains to Retief, the youth have a reputation for “shame” and “discourtesy.” The Elders feel that there is little they can do about the youths' misbehavior since the Elders are so much slower with their carapaces. They have no police and have never needed them until the youth became so unruly. They have a youth group, the Sexual, Cultural, and Athletic Recreational Society (SCARS), that needs a sponsor and wants someone to provide them a clubhouse, uniforms, equipment, and so forth. The Fustians’ dwellings have a fishy odor and are found along a broad cobbled street. They have a caste system; the driver of a flat car is a member of the labor caste. Their greetings relate to peaceful sleep: “Long-may-you-sleep” and “May-you-dream-of-the-deeps.” Likewise, their insults related to unpleasant sleep: “May you toss in nightmares!” The oldest Fustians are forced into retirement and given once-daily feedings; Whonk says this is nothing to look forward to for his next thousand years. They have a strong sense of right and wrong and carry out ceremonial revenge when wronged."
              }
            ]
          },
          {
            "question_text": "Who is Magnan, and what is his role in and relevance to the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "4",
                "uid": "5b6e8d8966aa4d008d21bc2759834090",
                "response_text": "Magnan is the Ambassador to Fust, and thus is Retief’s boss. He is also a spineless, political wind-sniffing clod. His main role, or function in the story is as a foil to the hero, Retief. Magnan’s clueless blathering sets up Retief’s dry, sarcastic remarks – remarks which, if Magnan were not so oblivious, would perhaps offend Magnan to the point of firing Retief. \nWhile Retief is running around Fust getting into fist fights and spoiling terrorists’ plots, Magnan is back at the office shuffling whatever papers came in from the Terrestrial Embassy that day, implementing the “program of the week.” Magnan is flat. Retief is three-dimensional.\nMagnan’s main contributions to the story are to: \n1.\tIgnore Retief’s advice to check out the Fustian youth organizations before sponsoring them, which leads to the potential for the Terrestrial Embassy being embarrassed by the Groaci attempts to frame SCARS for the explosion they hoped to cause aboard the Moss Rock. \n2.\tSet up the banquet to honor SCARS where he grossly insults his Fustian counterparts by having the hired musicians play a dirge, the “Lament of Hatching,” and then shattering their ear drums by tapping on his wine glass.\n3.\tWhip up a meringue of obfuscation to hide the fiasco of the youth organization sponsorship program and try to make himself smell like a rose in the process\n4.\tStart a new sponsorship program for Fustian Senior Citizens.\nAt no point in the story does he do anything useful at all.\n"
              },
              {
                "worker_id": "3",
                "uid": "33a99d27926948c09e8527c8a0863bcd",
                "response_text": "Magnan is the Terrestrial Ambassador to the Fustians. He is the figurehead of their influence on the Fustian planet, and works closely with Retief, the Terrestrial diplomat who uncovers a plot against the Terrestrials through the course of the story. He is the man who tries to convince Retief to sponsor the Youth Group SCARS in the beginning of the story, and we encounter him at the banquet near the end of the story. As the figurehead, he is responsible for announcing the role of the Terrestrials in funding the Youth Group, which creates an opportunity for Retief to announce the Grocian plot to everyone. Ambassador Magnan eventually joins Retief and Whonk as they leave the event to stop the criminals, but he is thrown into an alley by Whonk and doesn't have an opportunity to help directly. After the issue is dealt with by Whonk and Retief, Magnan resumes normal duty, and as the story ends he is looking at other groups that his government could potentially fund.\n"
              },
              {
                "worker_id": "8",
                "uid": "a7064998590c4b819f8cc3238df496c0",
                "response_text": "Magnan is an ambassador with the Terrestrial Embassy, and he assigns Retief the mission to sponsor the new youth movement (SCARS) on the planet Fust. Magnan seems eager for this sponsorship to proceed despite his general ignorance about the movement itself. His motivation for speed rather than understanding may be attributed to the haste with which the Groaci Embassy has moved to establish a connection with SCARS. Magnan, of course, is not aware of the secret dealings between the Groaci and the SCARS, whom they are working with to ultimately supplant the Fustian leadership and take control of the planet for themselves. Magnan’s vision is fairly straightforward and views this sponsorship as the surest way to curry good favor with the Fustians (and get good publicity for the Terrestrial Embassy). Magnan is impatient with Retief’s more meticulous, fact-finding methods and organizes the sponsorship ceremony before Retief has completed his research. At the ceremony, Magnan’s interactions with the Fustian minister reveal further his humorous ignorance about their species, particularly when he hurts their sensitive hearing by banging his glass louder and louder. After he invites Slock on stage to present him to the press as his guest of honor and representative of SCARS, Whonk and Retief capture Slock and expose his plan to Magnan. At first, Magnan does not believe them, but he is quickly convinced when Slock escapes. In the end, Magnan creates a story for the press that the sponsorship event was a ruse to apprehend the perpetrators of the attempted coup against the Fustian leadership. "
              },
              {
                "worker_id": "2",
                "uid": "de621b3387174916833eeca37bc082a8",
                "response_text": "Magnan is the Ambassador at the Terrestrial Embassy on Fust and Councillor Retief’s boss. He wants Retief to sponsor the SCARS and stops just short of ordering him to do so. Magnan is very focused on his role as Ambassador and has little interest in anything not directly connected to his job. Magnan is not concerned about the passenger ship the Fustians are building or the fact that the Groacis are interested in the Fustians when their lives and economies are so different from each other. When Retief mentions the fact that the Groacis are interested in fission bombs, Magnan’s reaction is to wonder what market there could be for such devices since the world is at peace. He is politically correct and is shocked when Retief mentions the carapaces that the older Fustians has. He also pretends that he can hear the Fustians’ music when he clearly isn’t able to do so. Magnan is manipulative because he announces that Retief will sponsor SCARS even after Retief clearly tells him he is not interested. He misjudges character and refers to Slock as a fine young fellow when Slock is rude, violent, and mixed up in the scheme with the Groacis to begin conquering nearby worlds. At the end of the story when Magnan finally learns of the deceit of the young Fustians and the Groacis, he tries to act like he knew about it all along. His disinterest in anything not related to diplomacy gives Retief the leeway he needs to figure out the Fustian and Groaci crimes."
              }
            ]
          },
          {
            "question_text": "Who is Whonk, and what is his relevance to the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "4",
                "uid": "5b6e8d8966aa4d008d21bc2759834090",
                "response_text": "Whonk is a very old Fustian who works as a clerk at the shipyards. He meets Retief when Retief comes to to inquire about seeing plans for the new passenger liner. Whonk is neutral and correct, but not especially friendly. His partnership, and it seems fair to say, friendship with Retief really begins when Retief returns to the shipyard to look for Whonk and finds that the Fustian thugs who tried and failed to kill him, due to his thick, mature skin and shell, have left him tied up, in an undignified position on his back.\nRetief apologizes for putting him in danger, and gets the old Fustian back on his feet. Whonk is so grateful that he tells Retief, “My cows are yours,” a heartfelt, traditional Fustian expression of gratitude. \nWhonk is extremely angry about what the Fustian Slock and his gang have done to him, and throws in his lot with Retief. Thereafter, every time Retief is in physical danger from Fustians, Whonk is right there to help. \nAt the end of the story, Whonk steps in again to help Retief capture Yith, a member of the Groaci diplomatic mission, and Slock the rebel adult Fustian with no carapace. His desire for vengeance against these two nearly overwhelms his good sense. He puts Slock on the Moss Rose with the titanite that Slock had intended to use against Fustian politicians, and sets the rocket to blast off to Groaci, knowing that it would below up before it got there. \nBut Retief manages to settle him down enough not to take Yith apart piece by piece, by getting the Groaci to do something that would make Whonk’s life a lot easier and more pleasant: surgically remove his carapace. \nWhonk is steadfast, reliable, implacable – a good sidekick for Retief.\n"
              },
              {
                "worker_id": "3",
                "uid": "33a99d27926948c09e8527c8a0863bcd",
                "response_text": "Whonk is the older Fustian who helps Retief uncover the Groacian plot. He is looking after papers when Retief asks to see the plans of the new ship being built, but is hurt by the gang members and Youths that come in after Retief leaves. He is still willing to help Retief after this, and the two of them work together to piece together their evidence. Being older means that Whonk has a very heavy shell that keeps him from moving quickly, but he is very strong--he manages to capture a number of characters throughout the story to keep them from running away. Not only is Whonk the reason Retief was able to confirm that the new ship was indeed meant to be a battle cruiser, helping to uncover the plot, but the two of them become friends and go on a fishing trip together at the end of the story."
              },
              {
                "worker_id": "8",
                "uid": "a7064998590c4b819f8cc3238df496c0",
                "response_text": "Whonk is an elderly Fustian who works managing documents at the shipyard where Retief goes to investigate the new passenger ship being built there. Whonk shares the documents with Retief, who notices its similarities to a defunct ship design that had been previously used in combat. Whonk educates Retief on the rebellious ways of the younger Fustians before they witness a Groaci military attache consulting with some youth outside his office. The youth attack Whonk after Retief’s departure, nearly severing his head. When Retief returns to help him, Whonk is very grateful and continues to help Retief on his mission to discover the real connection between the Groaci and SCARS. Whonk guides Retief to the “Moss Rock” and helps Retief defeat yet another group of attacking youth. Whonk discovers that one of the youths is not a youth at all but rather an older Fustian with a detached shell. He is baffled by this. After a fracas at the sponsorship ceremony, Retief captures the Groaci attaché, and Whonk apprehends Slock, whom he quickly discovers is also an older Fustian with a surgically-removed shell. Retief convinces Whonk to forego his act of vengeance on the Groaci, and in exchange the Groaci would provide the elders of Fust with the same surgical procedure provided to the SCARS members. Pleased with this arrangement, Whonk agrees, but he is still seeking vengeance. He places Slock aboard the “Moss Rock” and sends it on a path to Groaci. The ship explodes on the way, killing Slock, and sending a message to the Groaci to stay away from Fust."
              },
              {
                "worker_id": "2",
                "uid": "de621b3387174916833eeca37bc082a8",
                "response_text": "Whonk is an older Fustian who is very polite and helpful to Retief. He lets Retief look at the blueprints for the passenger ship that the younger Fustians are building with the Groacis and then apologizes for the rudeness of the younger Fustian who confronts Retief for looking at the plans. Whonk becomes Retief’s ally right away; he holds off the younger Fustians who come back to confront Retief, giving Retief a chance to sneak out the back door. After two younger Fustians tell Retief they want his films from his pictures of the plans, he realizes they must have gotten the information about the pictures from Whonk and knew Whonk wouldn’t have given it to them freely. When he checks on Whonk, he finds him tied up. The younger Fustians had tried to kill him. From then on, the two work together, checking the Moss Rock for explosives that have been removed from the storage area. When attackers come, Whonk protects Retief and blocks the attackers with his carapace. Whonk provides Retief with information that he needs to determine who is involved in criminal activity and what that criminal activity is. At the end of the story, he provides justice for Slock by putting him aboard the Moss Rock before it blows up so that he gets his just rewards. When everything settles, Whonk offers to take Retief on a fishing vacation."
              }
            ]
          },
          {
            "question_text": "What is the setting for this story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "4",
                "uid": "5b6e8d8966aa4d008d21bc2759834090",
                "response_text": "The story is set entirely on the planet Fust. The native inhabitants of Fust are described as something similar to snapping turtles that walk on their hind legs, and much of the imagery used by Fustians when speaking revolves around themes of the sea and mud. Fust is a peaceful enough world that they don’t even really have much of a police force, despite the rowdy and rebellious behavior of Fustian youths. \nNot much is known about the physical characteristics of the planet, such as the proportion of sea and dry land. We know there must be oceans, because the warehouse where Wonk was tied up and left was full of bales of kelp, a sea product. The city of the story is also near a sea, whose breezes make it a bit cool at certain times of day.\nThe city where all the action takes place is an important city, perhaps the capitol. It is full of diplomatic missions from all planets, and is apparently a place of some Fustian learning and culture, given that it has musicians for hire. There is a space ship building operation right outside the city, which can be reached by public transport that consists of flat open wagons. This is practical for the unwieldy shape of the adult Fustian, if not too comfortable for a human.\nOne of the most interesting things about Fust, and the hardest for an outsider to understand, is their assorted suns and moons. Fust is lit by a blue sun called Alpha and a yellow sun known as Beta, and three moons orbit Fust. There is also a third sun, unnamed, so that there are three “noons” on Fust.\n"
              },
              {
                "worker_id": "3",
                "uid": "33a99d27926948c09e8527c8a0863bcd",
                "response_text": "The story takes place on the planet whose native species is a turtle-like race known as the Fustians. It is usually a peaceful planet, and does not have a police force like humans are used to--in fact, weapons are currently illegal. There are at least two other species living here as well: the Terrestrials and the Groaci. More specifically, the story takes place near the coastline, with many events taking place either in political buildings or at the docks. The sea that lines this area has strong tides controlled by a number of celestial objects: there are three moons and multiple sons. The major sun is referred to as Beta, and is yellow, but there is a blue sun called Alpha as well. This has strong impacts on the weather as well: it can be very chilly while there are no suns in the sky, but very hot when the light is at its strongest. Besides the Terrestrial Embassy, its technical library, and the banquet hall, the protagonist Retief spends most of his time near the docks. At the port, he spends some time in the new ship being built where he asks Whonk to see the plans. He also does some investigation on the Moss Rock, the luxury ship where he found false evidence planted."
              },
              {
                "worker_id": "8",
                "uid": "a7064998590c4b819f8cc3238df496c0",
                "response_text": "The story takes place on the planet Fust, where a chancery houses the Terrestrial Embassy where Retief works. Fust has several suns and moons that regulate the tides of the ocean nearby. The Fustians regularly nap There is a large city surrounded by shipyards, where Retief conducts the majority of his investigation into the development of the new passenger barge. When Retief meets Whonk, they pore over blueprints for the barge in Whonk’s work hut and look out the window to see the Groaci attaché consulting with the Fustian youth that had harassed them earlier. Later, a pair of youth attack Retief at the bus station, and he returns to the shipyard to inquire after Whonk. He enters the warehouse behind Whonk’s shack and finds him injured in the midst of some hay bales. From there, Whonk and Retief go to the “Moss Rock”—a ship where the Groaci barrels filled with titanite had been taken earlier—to investigate. The “Moss Rock” is a luxurious ship dimly lit and meant for VIP guests. This is where Retief begins to uncover the plot of the Groaci to implicate SCARS in the ship’s destruction. Retief then attends the sponsorship ceremony, which is held in a banquet hall with a low-ceiling. Fustian music plays, which is inaudible to the human ear. After Slock escapes the ceremony, Retief goes back to the “Moss Rock”, and this is where Whonk ultimately apprehends Slock once more."
              },
              {
                "worker_id": "2",
                "uid": "de621b3387174916833eeca37bc082a8",
                "response_text": "The story's setting is in the future on a space world named Fust, inhabited by creatures who look similar to turtles. Fust has oceans or seas large enough for passenger ships and barges which provide fish for the Fustians. Aliens come to Fust; Magnan and Retief work at the Terrestrial Embassy; the Groacis also have members on Fust. The planet has two suns: Beta, which is yellow, and Alpha, which is blue. There are also three moons. Part of the action in the story takes place in the Terrestrial Embassy. In contrast, other parts occur in the shipyard where the passenger ship is being built, its warehouse where Whonk is hidden after he is beaten, and where the explosive had been stored, aboard the barge the Moss Rock where the explosive has been moved and where Whonk puts Slock at the end of the story, and a low-ceiling banquet hall where the dinner is being held. Magnan announces Retief’s sponsorship of SCARS.\n\n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 6369,
        "document_length_chars": 37667
      }
    }
  ]
}