{
  "item_metadata": {
    "item_id": "61204",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61204",
      "content": "THE RECRUIT\n \n\n BY BRYCE WALTON\n \n\n It was dirty work, but it would make him a man. And kids had a right to grow up—some of them!\n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, July 1962. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Wayne, unseen, sneered down from the head of the stairs.\n \n The old man with his thick neck, thick cigar, evening highball, potgut and bald head without a brain in it. His slim mother with nervously polite smiles and voice fluttering, assuring the old man by her frailty that he was big in the world. They were squareheads one and all, marking moron time in a gray dream. Man, was he glad to break out.\n \n The old man said, \"He'll be okay. Let him alone.\"\n \n \"But he won't eat. Just lies there all the time.\"\n \n \"Hell,\" the old man said. \"Sixteen's a bad time. School over, waiting for the draft and all. He's in between. It's rough.\"\n \n Mother clasped her forearms and shook her head once slowly.\n \n \"We got to let him go, Eva. It's a dangerous time. You got to remember about all these dangerous repressed impulses piling up with nowhere to go, like they say. You read the books.\"\n \n \"But he's unhappy.\"\n \n \"Are we specialists? That's the Youth Board's headache, ain't it? What do we know about adolescent trauma and like that? Now get dressed or we'll be late.\"\n \n Wayne watched the ritual, grinning. He listened to their purposeless noises, their blabbing and yakking as if they had something to say. Blab-blab about the same old bones, and end up chewing them in the same old ways. Then they begin all over again. A freak sideshow all the way to nowhere. Squareheads going around either unconscious or with eyes looking dead from the millennium in the office waiting to retire into limbo.\n \n How come he'd been stuck with parental images like that? One thing—when he was jockeying a rocket to Mars or maybe firing the pants off Asiatic reds in some steamy gone jungle paradise, he'd forget his punkie origins in teeveeland.\n \n But the old man was right on for once about the dangerous repressed impulses. Wayne had heard about it often enough. Anyway there was no doubt about it when every move he made was a restrained explosion. So he'd waited in his room, and it wasn't easy sweating it out alone waiting for the breakout call from HQ.\n \n \"Well, dear, if you say so,\" Mother said, with the old resigned sigh that must make the old man feel like Superman with a beerbelly.\n \n They heard Wayne slouching loosely down the stairs and looked up.\n \n \"Relax,\" Wayne said. \"You're not going anywhere tonight.\"\n \n \"What, son?\" his old man said uneasily. \"Sure we are. We're going to the movies.\"\n \n He could feel them watching him, waiting; and yet still he didn't answer. Somewhere out in suburban grayness a dog barked, then was silent.\n \n \"Okay, go,\" Wayne said. \"If you wanta walk. I'm taking the family boltbucket.\"\n \n \"But we promised the Clemons, dear,\" his mother said.\n \n \"Hell,\" Wayne said, grinning straight into the old man. \"I just got my draft call.\"\n \n He saw the old man's Adam's apple move. \"Oh, my dear boy,\" Mother cried out.\n \n \"So gimme the keys,\" Wayne said. The old man handed the keys over. His understanding smile was strained, and fear flicked in his sagging eyes.\n \n \"Do be careful, dear,\" his mother said. She ran toward him as he laughed and shut the door on her. He was still laughing as he whoomed the Olds between the pale dead glow of houses and roared up the ramp onto the Freeway. Ahead was the promising glitter of adventure-calling neon, and he looked up at the high skies of night and his eyes sailed the glaring wonders of escape.\n \n \n\n \n He burned off some rubber finding a slot in the park-lot. He strode under a sign reading Public Youth Center No. 947 and walked casually to the reception desk, where a thin man with sergeant's stripes and a pansy haircut looked out of a pile of paperwork.\n \n \"Where you think you're going, my pretty lad?\"\n \n Wayne grinned down. \"Higher I hope than a typewriter jockey.\"\n \n \"Well,\" the sergeant said. \"How tough we are this evening. You have a pass, killer?\"\n \n \"Wayne Seton. Draft call.\"\n \n \"Oh.\" The sergeant checked his name off a roster and nodded. He wrote on a slip of paper, handed the pass to Wayne. \"Go to the Armory and check out whatever your lusting little heart desires. Then report to Captain Jack, room 307.\"\n \n \"Thanks, sarge dear,\" Wayne said and took the elevator up to the Armory.\n \n A tired fat corporal with a naked head blinked up at tall Wayne. Finally he said, \"So make up your mind, bud. Think you're the only kid breaking out tonight?\"\n \n \"Hold your teeth, pop,\" Wayne said, coolly and slowly lighting a cigarette. \"I've decided.\"\n \n The corporal's little eyes studied Wayne with malicious amusement.\n\"Take it from a vet, bud. Sooner you go the better. It's a big city and you're starting late. You can get a cat, not a mouse, and some babes are clever hellcats in a dark alley.\"\n \n \"You must be a genius,\" Wayne said. \"A corporal with no hair and still a counterboy. I'm impressed. I'm all ears, Dad.\"\n \n The corporal sighed wearily. \"You can get that balloon head ventilated, bud, and good.\"\n \n Wayne's mouth twitched. He leaned across the counter toward the shelves and racks of weapons. \"I'll remember that crack when I get my commission.\" He blew smoke in the corporal's face. \"Bring me a Smith and Wesson .38, shoulder holster with spring-clip. And throw in a Skelly switchblade for kicks—the six-inch disguised job with the double springs.\"\n \n The corporal waddled back with the revolver and the switchblade disguised in a leather comb case. He checked them on a receipt ledger, while Wayne examined the weapons, broke open the revolver, twirled the cylinder and pushed cartridges into the waiting chamber. He slipped the knife from the comb case, flicked open the blade and stared at its gleam in the buttery light as his mouth went dry and the refracted incandescence of it trickled on his brain like melted ice, exciting and scary.\n \n He removed his leather jacket. He slung the holster under his left armpit and tested the spring clip release several times, feeling the way the serrated butt dropped into his wet palm. He put his jacket back on and the switchblade case in his pocket. He walked toward the elevator and didn't look back as the corporal said, \"Good luck, tiger.\"\n \n Captain Jack moved massively. The big stone-walled office, alive with stuffed lion and tiger and gunracks, seemed to grow smaller. Captain Jack crossed black-booted legs and whacked a cane at the floor. It had a head shaped like a grinning bear.\n \n Wayne felt the assured smile die on his face. Something seemed to shrink him. If he didn't watch himself he'd begin feeling like a pea among bowling balls.\n \n Contemptuously amused little eyes glittered at Wayne from a shaggy head. Shoulders hunched like stuffed sea-bags.\n \n \"Wayne Seton,\" said Captain Jack as if he were discussing something in a bug collection. \"Well, well, you're really fired up aren't you? Really going out to eat 'em. Right, punk?\"\n \n \"Yes, sir,\" Wayne said. He ran wet hands down the sides of his chinos. His legs seemed sheathed in lead as he bit inwardly at shrinking fear the way a dog snaps at a wound. You big overblown son, he thought, I'll show you but good who is a punk. They made a guy wait and sweat until he screamed. They kept a guy on the fire until desire leaped in him, ran and billowed and roared until his brain was filled with it. But that wasn't enough. If this muscle-bound creep was such a big boy, what was he doing holding down a desk?\n \n \"Well, this is it, punk. You go the distance or start a butterfly collection.\"\n \n The cane darted up. A blade snicked from the end and stopped an inch from Wayne's nose. He jerked up a shaky hand involuntarily and clamped a knuckle-ridged gag to his gasping mouth.\n \n Captain Jack chuckled. \"All right, superboy.\" He handed Wayne his passcard. \"Curfew's off, punk, for 6 hours. You got 6 hours to make out.\"\n \n \"Yes, sir.\"\n \n \"Your beast is primed and waiting at the Four Aces Club on the West Side. Know where that is, punk?\"\n \n \"No, sir, but I'll find it fast.\"\n \n \"Sure you will, punk,\" smiled Captain Jack. \"She'll be wearing yellow slacks and a red shirt. Black hair, a cute trick. She's with a hefty psycho who eats punks for breakfast. He's butchered five people. They're both on top of the Undesirable list, Seton. They got to go and they're your key to the stars.\"\n \n \"Yes, sir,\" Wayne said.\n \n \"So run along and make out, punk,\" grinned Captain Jack.\n \n \n\n \n A copcar stopped Wayne as he started over the bridge, out of bright respectable neon into the murky westside slum over the river.\n \n Wayne waved the pass card, signed by Captain Jack, under the cop's quivering nose. The cop shivered and stepped back and waved him on. The Olds roared over the bridge as the night's rain blew away.\n \n The air through the open window was chill and damp coming from Slumville, but Wayne felt a cold that wasn't of the night or the wind. He turned off into a rat's warren of the inferiors. Lights turned pale, secretive and sparse, the uncared-for streets became rough with pitted potholes, narrow and winding and humid with wet unpleasant smells. Wayne's fearful exhilaration increased as he cruised with bated breath through the dark mazes of streets and rickety tenements crawling with the shadows of mysterious promise.\n \n He found the alley, dark, a gloom-dripping tunnel. He drove cautiously into it and rolled along, watching. His belly ached with expectancy as he spotted the sick-looking dab of neon wanly sparkling.\n \n  FOUR ACES CLUB\n \n \n He parked across the alley. He got out and stood in shadows, digging the sultry beat of a combo, the wild pulse of drums and spinning brass filtering through windows painted black.\n \n He breathed deep, started over, ducked back. A stewbum weaved out of a bank of garbage cans, humming to himself, pulling at a rainsoaked shirt clinging to a pale stick body. He reminded Wayne of a slim grub balanced on one end.\n \n The stewbum stumbled. His bearded face in dim breaking moonlight had a dirty, greenish tinge as he sensed Wayne there. He turned in a grotesque uncoordinated jiggling and his eyes were wide with terror and doom.\n \n \"I gotta hide, kid. They're on me.\"\n \n Wayne's chest rose and his hands curled.\n \n The bum's fingers drew at the air like white talons.\n \n \"Help me, kid.\"\n \n He turned with a scratchy cry and retreated before the sudden blast of headlights from a Cad bulleting into the alley. The Cad rushed past Wayne and he felt the engine-hot fumes against his legs. Tires squealed. The Cad stopped and a teener in black jacket jumped out and crouched as he began stalking the old rummy.\n \n \"This is him! This is him all right,\" the teener yelled, and one hand came up swinging a baseball bat.\n \n A head bobbed out of the Cad window and giggled.\n \n The fumble-footed rummy tried to run and plopped on wet pavement. The teener moved in, while a faint odor of burnt rubber hovered in the air as the Cad cruised in a slow follow-up.\n \n Wayne's breath quickened as he watched, feeling somehow blank wonder at finding himself there, free and breaking out at last with no curfew and no law but his own. He felt as though he couldn't stop anything. Living seemed directionless, but he still would go with it regardless, until something dropped off or blew to hell like a hot light-bulb. He held his breath, waiting. His body was tensed and rigid as he moved in spirit with the hunting teener, an omniscient shadow with a hunting license and a ghetto jungle twenty miles deep.\n \n The crawling stewbum screamed as the baseball bat whacked. The teener laughed. Wayne wanted to shout. He opened his mouth, but the yell clogged up somewhere, so that he remained soundless yet with his mouth still open as he heard the payoff thuds where the useless wino curled up with stick arms over his rheumy face.\n \n The teener laughed, tossed the bat away and began jumping up and down with his hobnailed, mail-order air force boots. Then he ran into the Cad. A hootch bottle soared out, made a brittle tink-tink of falling glass.\n \n \"Go, man!\"\n \n The Cad wooshed by. It made a sort of hollow sucking noise as it bounced over the old man twice. Then the finlights diminished like bright wind-blown sparks.\n \n Wayne walked over and sneered down at the human garbage lying in scummed rain pools. The smell of raw violence, the scent of blood, made his heart thump like a trapped rubber ball in a cage.\n \n He hurried into the Four Aces, drawn by an exhilarating vision ... and pursued by the hollow haunting fears of his own desires.\n \n \n\n \n He walked through the wavering haze of smoke and liquored dizziness and stood until his eyes learned the dark. He spotted her red shirt and yellow legs over in the corner above a murky lighted table.\n \n He walked toward her, watching her little subhuman pixie face lift. The eyes widened with exciting terror, turned even paler behind a red slash of sensuous mouth. Briefed and waiting, primed and eager for running, she recognized her pursuer at once. He sat at a table near her, watching and grinning and seeing her squirm.\n \n She sat in that slightly baffled, fearful and uncomprehending attitude of being motionless, as though they were all actors performing in a weirdo drama being staged in that smoky thick-aired dive.\n \n Wayne smiled with wry superiority at the redheaded psycho in a dirty T-shirt, a big bruiser with a gorilla face. He was tussling his mouse heavy.\n \n \"What's yours, teener?\" the slug-faced waiter asked.\n \n \"Bring me a Crusher, buddyroo,\" Wayne said, and flashed his pass card.\n \n \"Sure, teener.\"\n \n Red nuzzled the mouse's neck and made drooly noises. Wayne watched and fed on the promising terror and helplessness of her hunted face. She sat rigid, eyes fixed on Wayne like balls of frozen glass.\n \n Red looked up and stared straight at Wayne with eyes like black buttons imbedded in the waxlike skin of his face. Then he grinned all on one side. One huge hand scratched across the wet table top like a furious cat's.\n \n Wayne returned the challenging move but felt a nervous twitch jerk at his lips. A numbness covered his brain like a film as he concentrated on staring down Red the psycho. But Red kept looking, his eyes bright but dead. Then he began struggling it up again with the scared little mouse.\n \n The waiter sat the Crusher down. Wayne signed a chit; tonight he was in the pay of the state.\n \n \"What else, teener?\"\n \n \"One thing. Fade.\"\n \n \"Sure, teener,\" the waiter said, his breathy words dripping like syrup.\n \n Wayne drank. Liquored heat dripped into his stomach. Fire tickled his veins, became hot wire twisting in his head.\n \n He drank again and forced out a shaky breath. The jazz beat thumped fast and muted brass moaned. Drumpulse, stabbing trumpet raped the air. Tension mounted as Wayne watched her pale throat convulsing, the white eyelids fluttering. Red fingered at her legs and salivated at her throat, glancing now and then at Wayne, baiting him good.\n \n \"Okay, you creep,\" Wayne said.\n \n He stood up and started through the haze. The psycho leaped and a table crashed. Wayne's .38 dropped from its spring-clip holster and the blast filled the room. The psycho screamed and stumbled toward the door holding something in. The mouse darted by, eluded Wayne's grasp and was out the door.\n \n Wayne went out after her in a laughing frenzy of release. He felt the cold strange breath of moist air on his sweating skin as he sprinted down the alley into a wind full of blowing wet.\n \n He ran laughing under the crazy starlight and glimpsed her now and then, fading in and out of shadows, jumping, crawling, running with the life-or-death animation of a wild deer.\n \n Up and down alleys, a rat's maze. A rabbit run. Across vacant lots. Through shattered tenement ruins. Over a fence. There she was, falling, sliding down a brick shute.\n \n He gained. He moved up. His labored breath pumped more fire. And her scream was a rejuvenation hypo in his blood.\n \n \n\n \n She quivered above him on the stoop, panting, her eyes afire with terror.\n \n \"You, baby,\" Wayne gasped. \"I gotcha.\"\n \n She backed into darkness, up there against the sagging tenement wall, her arms out and poised like crippled wings. Wayne crept up. She gave a squeaking sob, turned, ran. Wayne leaped into gloom. Wood cracked. He clambered over rotten lumber. The doorway sagged and he hesitated in the musty dark. A few feet away was the sound of loose trickling plaster, a whimpering whine.\n \n \"No use running,\" Wayne said. \"Go loose. Give, baby. Give now.\"\n \n She scurried up sagging stairs. Wayne laughed and dug up after her, feeling his way through debris. Dim moonlight filtered through a sagging stairway from a shattered skylight three floors up. The mouse's shadow floated ahead.\n \n He started up. The entire stair structure canted sickeningly. A railing ripped and he nearly went with it back down to the first floor. He heard a scream as rotten boards crumbled and dust exploded from cracks. A rat ran past Wayne and fell into space. He burst into the third-floor hallway and saw her half-falling through a door under the jagged skylight.\n \n Wayne took his time. He knew how she felt waiting in there, listening to his creeping, implacable footfalls.\n \n Then he yelled and slammed open the door.\n \n Dust and stench, filth so awful it made nothing of the dust. In the corner he saw something hardly to be called a bed. More like a nest. A dirty, lumpy pile of torn mattress, felt, excelsior, shredded newspapers and rags. It seemed to crawl a little under the moon-streaming skylight.\n \n She crouched in the corner panting. He took his time moving in. He snickered as he flashed the switchblade and circled it like a serpent's tongue. He watched what was left of her nerves go to pieces like rotten cloth.\n \n \n\n \n \"Do it quick, hunter,\" she whispered. \"Please do it quick.\"\n \n \"What's that, baby?\"\n \n \"I'm tired running. Kill me first. Beat me after. They won't know the difference.\"\n \n \"I'm gonna bruise and beat you,\" he said.\n \n \"Kill me first,\" she begged. \"I don't want—\" She began to cry. She cried right up in his face, her wide eyes unblinking, and her mouth open.\n \n \"You got bad blood, baby,\" he snarled. He laughed but it didn't sound like him and something was wrong with his belly. It was knotting up.\n \n \"Bad, I know! So get it over with, please. Hurry, hurry.\"\n \n She was small and white and quivering. She moaned but kept staring up at him.\n \n He ripped off his rivet-studded belt and swung once, then groaned and shuffled away from her.\n \n He kept backing toward the door. She crawled after him, begging and clutching with both arms as she wriggled forward on her knees.\n \n \"Don't run. Please. Kill me! It'll be someone else if you don't. Oh, God, I'm so tired waiting and running!\"\n \n \"I can't,\" he said, and sickness soured in his throat.\n \n \"Please.\"\n \n \"I can't, I can't!\"\n \n He turned and ran blindly, half-fell down the cracking stairs.\n \n \n\n \n Doctor Burns, head of the readjustment staff at the Youth Center, studied Wayne with abstract interest.\n \n \"You enjoyed the hunt, Seton? You got your kicks?\"\n \n \"Yes, sir.\"\n \n \"But you couldn't execute them?\"\n \n \"No, sir.\"\n \n \"They're undesirables. Incurables. You know that, Seton?\"\n \n \"Yes, sir.\"\n \n \"The psycho you only wounded. He's a five-times murderer. And that girl killed her father when she was twelve. You realize there's nothing can be done for them? That they have to be executed?\"\n \n \"I know.\"\n \n \"Too bad,\" the doctor said. \"We all have aggressive impulses, primitive needs that must be expressed early, purged. There's murder in all of us, Seton. The impulse shouldn't be denied or suppressed, but educated . The state used to kill them. Isn't it better all around, Seton, for us to do it, as part of growing up? What was the matter, Seton?\"\n \n \"I—felt sorry for her.\"\n \n \"Is that all you can say about it?\"\n \n \"Yes, sir.\"\n \n The doctor pressed a buzzer. Two men in white coats entered.\n \n \"You should have got it out of your system, Seton, but now it's still in there. I can't turn you out and have it erupt later—and maybe shed clean innocent blood, can I?\"\n \n \"No, sir,\" Wayne mumbled. He didn't look up. \"I'm sorry I punked out.\"\n \n \"Give him the treatment,\" the doctor said wearily. \"And send him back to his mother.\"\n \n Wayne nodded and they led him away. His mind screamed still to split open some prison of bone and lay bare and breathing wide. But there was no way out for the trapped. Now he knew about the old man and his poker-playing pals.\n \n They had all punked out.\n \n Like him.",
      "metadata": {
        "title": "The Recruit",
        "author": "Bryce Walton",
        "passage_id": "61204",
        "uid": "14b4516244994712850343266cbe42b7",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "5",
                "uid": "220b7d4245314ae1bc5be811e3aeff6a",
                "response_text": "The story opens on a discussion at home between a husband and wife being overheard by their sixteen-year-old son, Wayne. They are distraught over their son’s attitude and attribute it to his age and the buildup of repressed impulses. Wayne views is parents with contempt. He reveals that he has been called to be drafted and leaves them to go to the authorities taking the family automobile.\n\nArriving at the Youth Center, Wayne navigates the bureaucracy of being drafted which involves registering and being issued with a firearm and a switchblade. He bristles against the military authority figures at the youth center, deriding their appearance and position. Wayne is cocky and confident even as he is warned about the dangers of his mission. Wayne is assigned a mission that involves killing a known murderer and his girl. He has six hours of autonomy where he is privileged to operate outside of the normal rule of law.\n\nWayne makes his way to a rougher neighborhood and witnesses another teenager hunt down and brutally murder a vagrant with a baseball bat. Wayne enters the bar which contains his target. He locates and engages them, shooting the man and chasing the woman out of the bar into a crumbling apartment building. When he eventually corners her, she begs him to kill her quickly. Wayne however is overcome with a physical aversion to the violence he was intending to commit.\n\nWayne is later being evaluated back at the Youth Center. It is revealed that society engages teenagers to execute criminals as a preferred outlet for their aggressive impulses. Those that go through with an execution are initiated into the military. Wayne mournfully contemplates that “punking out” in failing to execute his targets relegates him to a shameful, nondescript life much like that of his own father."
              },
              {
                "worker_id": "6",
                "uid": "6cbe02858e1e451baab36f057a331c1f",
                "response_text": "Wayne Seton is a young man with an irrepressible urge. At 16 years old, he’s impatient, hormonal, and waiting for the draft, especially not that school is over. His mothers worries over him, but his father assures her that the draft is the right move. \nSeton receives his draft and quickly runs downstairs, grabs the keys to the car, and leaves, ignoring the fear in his father’s eyes. \nHe arrives at the 947th Youth Center. After checking in at the reception, he makes his way to the armory. He picks out a revolver, a shoulder hoster, and a switchblade disguised as a comb. His arrogance shows through his interactions with the many adults working at the Youth Center. They warn him of the trails he’ll face, and he simply laughs them off. \nFinally, he heads to the elevator that will take him to Captain Jack, the commander of this facility. Seton’s nervousness finally shows in his clammy palms and racing thoughts. Captain Jack intimidates him and questions his nerve and willingness to complete the mission. Captain Jack raises his bear-shaped cane to Seton, a blade sticking out the end of it. He tells Seton he has only six hours before the curfew sets back in. His target is at the Four Aces Club; a pretty woman with brightly colored clothes as well as a larger man, who’d killed five people. \nSeton begins his hunt, driving around town and searching for them. He’s pulled over by a cop trying to enforce the curfew, but one look at his pass card sends shivers down the officer’s spine, and Seton is sent on his way. \nOnce he’s arrived at the club, a bum grabs onto him and asks Seton to protect him. A car rushes in, and a young man jumps out. He beats the bum with a baseball bat, then runs him over with his car. Seton watches in awe. \nFinally, he walks into the bar and stalks his prey. After the man put his hands on the girl, he pulled out his revolver and shot him. The girl escapes and he runs after her. \nShe leads him on an epic chase, eventually stopping at what is assumedly her home.\nShe begs him to shoot her first and then beat her once she’s dead. Seton talks and talks, but his confidence fades. He realizes he feels bad for this girl and runs out, leaving her alive. \nSeton is examined by Doctor Burns back at the Youth Center, who questions him about his inability to complete the mission. He reveals that this system was set in place to rid the world of dangerous criminals and to expel the murderous impulses all people are born with. Since Seton failed, two men came in to take him away and treat him. He realizes that the others were like him; they had also refused to kill and had been given the same treatment.\n"
              },
              {
                "worker_id": "3",
                "uid": "a8e62c037525496a80f4fcca4611c6c0",
                "response_text": "Wayne is a teenage boy who lives with his parents, but doesn’t respect them very much. Because he is 16, he is waiting for a draft call. His parents are worried about him, and suspect he has repressed some impulses to be violent, so they are a mix of relieved and concerned when Wayne tells them that he has received his call. Wayne takes the car that his parents were going to take for their night out, and heads toward the neon lights on the freeway. When he arrives at the Public Youth Center to check in for his draft call, he acts arrogantly to the sergeant at the reception desk. He heads to the armory to pick up two weapons: a Smith & Wesson .38, and a six-inch, spring-loaded Skelly switchblade. Afterwards, he heads to Captain Jack’s office. Captain Jack is the first person Wayne encounters in the story who makes him nervous. The Captain gives Wayne permission to go without curfew or law for six hours, and assigns him a task: a “beast” of a woman on the west side of town, at Four Aces Club, along with the man she is with. Wayne uses his signed pass to get past copy on his way there, driving through darker and darker streets, and  eventually makes it to the club. He ran into a drunk man who tried to ask Wayne for help, but some other teenagers pulled up a car, beat the man to death with a baseball bat, and split. Wayne disappeared into the club and caught eye of his targets. He was able to match the woman’s description to the outfit Captain Jack said she would be wearing, and Wayne sits at a nearby table, watching the woman get nervous. He orders a drink; after he downs it, he gets up, and his targets try to run. He shoots the man before they all run out of the club, chasing each other through alleys and a building that was falling apart. He eventually cornered the woman in a pieced-together bedroom, and she begged him to kill her quickly. She is so tired of running from people sent to kill her that she would like it to be over as quickly as possible. Wayne pulls out his belt to whip her with, but after he swings it once, he starts to retreat. The woman still begs for him to kill her, but his attitude has completely shifted and he insists that he cannot, and runs away. When Wayne goes back to the Youth Center, the doctor in charge of “readjustment” of teenagers scolds Wayne for not killing the woman, both because he believes the two targeted people are terrible people, but also because that means Wayne did not get the violent energy out of his system. The team is sent to receive treatment and be sent back home, and Wayne realizes that these nights end like this more often than he had realized. "
              },
              {
                "worker_id": "1",
                "uid": "eb62c63c6a794ecf83f22d34f85b3a22",
                "response_text": "Wayne listens at the top of the stairs as his parents discuss their concerns about him. Eva, his mother, worries that Wayne doesn’t eat, and his father explains that he’s only sixteen years old and he’s waiting on his draft card. His father reminds Eva that Wayne’s repressed impulses are not something they should be worrying about because the Youth Board takes care of those.\n\nWayne tells his parents that he just got his draft call, and he demands the car keys and leaves the house. He travels to the Youth Center. When he arrives, he chooses a gun and a knife for his weapons, and he meets up with Captain Jack. Captain Jack tells Wayne that he has one chance to prove himself, and he has six hours to complete his mission. Wayne needs to go to the Four Aces Club and murder two people who top the undesireable list. \n\nOutside of the club, he watches as a homeless person is beaten to death by a teenager. The bum calls out for help, but Wayne ignores his pleas.\n\nOnce he goes inside, he immediately recognizes his two targets, Red the psycho and a mousy girl. His gun fires accidentally, and the girl runs outside. Wayne chases her through dilapidated buildings and into her home where he sees the disgusting nest she sleeps in. Although he knows he is on a mission to bruise her and then kill her, and he has been asked to fulfill this duty, he cannot do it. He feels too badly for her. Even when she begs to be murdered so that she no longer has to live in fear of death, he refuses.\n\nWayne goes back to the Youth Center where Doctor Burns, the head of the readjustment staff at the Youth Center, tells him that he needed to get his impulses out of the way in a controlled environment. Now, he can’t be trusted not to hurt someone else since everyone has those impulses inside of themselves. Wayne is sent for treatment, and he realizes he is just like his father whom he despises. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "5",
                "uid": "220b7d4245314ae1bc5be811e3aeff6a",
                "response_text": "The story is set in an urban environment in an unspecified time in the future. The story begins in a conventional domestic setting but quickly transitions to a Youth Center and then gritty underbelly of the city. The Youth Center is bureaucratic and clinical with Wayne making his way from registration to the Armory to his assignment. Later he returns to this center for psychological treatment. The inner-city area is known as Slumville and is filled with crumbling infrastructure and violent dealings. It is described as dark and mazelike with semi-abandoned buildings that are on the verge of collapse. The Four Aces Club where the main conflict of the story takes place is a seedy bar in Slumville where undesirables congregate. Smoky and filled with jazzy music, the club becomes a scene of tension and violence as Wayne confronts his targets there."
              },
              {
                "worker_id": "6",
                "uid": "6cbe02858e1e451baab36f057a331c1f",
                "response_text": "The Recruit by Bryce Walton takes place in a modern society, similar to the one we exist in now. The story starts in a normal suburban household. A mother, father, and one son coexist without too much tension. \nHowever, as the story progresses, this world continues to differ from ours. A curfew is set in place, keeping in the acceptable people and allowing the undesirables to be hunted. As the main character continues to explore the city, we see more and more of its darkness. It is grimy and gritty, filled with crime and scared citizens. \nSquatters have taken over abandoned buildings, and the feeling is truly man vs. man, citizen vs. citizen.\n"
              },
              {
                "worker_id": "3",
                "uid": "a8e62c037525496a80f4fcca4611c6c0",
                "response_text": "The story starts in the home of Wayne and his parents, which has at least two stories and is in the suburbs of some city. After a short drive on the freeway, Wayne arrives at the Public Youth Center where he navigates a series of rooms, first an armory with a wide variety of weapons, and then Captain Jack’s office, which had its own sets of weapons, taxidermied animals, and menacing stone walls. After some more driving into town, Wayne heads into darker and darker streets that twist their way towards the club he was told his targets would be at. He parked his car in the alley across from the club, next to a large collection of garbage cans, where he encountered a homeless man. When he made it into the club, he found it to be very hazy and dark, even though it had been night outside already. He sat at his own table in the smoky environment for a while, until it was time to chase his targets. Once outside, the alley turned into a maze of other alleys, parking lots, ruined buildings, and other infrastructure that seems to be falling apart. He followed her up a crumbling staircase in a building that was barely standing, and eventually cornered her in a small room where she had made a makeshift bed to sleep on, created entirely from scraps of anything she could find, including paper and rags. After he left this building after not successfully killing his target, he finds himself back at the Youth Center where the story ends. "
              },
              {
                "worker_id": "1",
                "uid": "eb62c63c6a794ecf83f22d34f85b3a22",
                "response_text": "Wayne must leave the Youth Center and go out on a mission on a dark night in the city. There are rats, crumbling buildings, potholes, and dangerous happenings around every corner. Outside of the Four Aces Club, Wayne witnesses a deadly assault of a seemingly innocent homeless man. Once inside, he is served an alcoholic beverage even though he is only sixteen. \n\nIn his society, teenagers like Wayne are sent out into the streets to murder people who have committed crimes. The prevailing belief is that all humans have violent impulses inside of them, so allowing teenagers to murder legitimately terrible people will get rid of those impulses and allow for a peaceful society. In the past, the state was responsible for taking care of criminals, but at some point their way of dealing with violent offenders changed. Now, every child that turns sixteen is presented with a draft card. They must report to the local Youth Center, choose a weapon or two, and receive a target to eliminate. \n"
              }
            ]
          },
          {
            "question_text": "How is slang used in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "5",
                "uid": "220b7d4245314ae1bc5be811e3aeff6a",
                "response_text": "Distinctive teenage or “teener” vernacular language is used extensively throughout the story. Wayne uses slang to communicate his dismissiveness of those in authority. People who live commonplace lives are “squareheads” and “punks”. Some typical proper nouns are shortened “Olds” for Oldsmobile, “Cad” for Cadillac. The effect is to cement the story in a future where language has evolved from its current state with teens communicating in a way that distinguishes them from other more conventional member of society. Wayne’s interaction with the waiter is emblematic of this effect. By saying, “Bring me a Crusher,” and then “Fade,” it is signaled to the reader that Wayne views himself as a member of a select group with its own cant."
              },
              {
                "worker_id": "6",
                "uid": "6cbe02858e1e451baab36f057a331c1f",
                "response_text": "The author uses slang throughout the story as a way to designate actions/events that are unfamiliar and to fully immerse the reader. Although no clear definitions are given, the true meaning of the slang is discovered as the story unfolds. At first, the draft and make out are absolutely foreign terms. As the story continues, the reader learns that to make out is to take on the mission assigned to the youth by the Public Youth Center. These terms thrust the reader into the story and show how different this world is from ours."
              },
              {
                "worker_id": "3",
                "uid": "a8e62c037525496a80f4fcca4611c6c0",
                "response_text": "Slang is the means by which the author denotes various categories of people throughout the story. In this world, people are categorized in large age groups. Wayne refers to people his parents’ age as the Olds, and Wayne himself is referred to multiple times as a teener. This use of slang separates the world in the story from the world of the reader. It seems that Wayne likes to refer to things in casual ways, referring to the family car as a bolt bucket, and really takes the label of punk to heart when he is called that by Captain Jack. When Wayne arrives at the club where his targets are, the car that the other teenagers show up in is referred to as a Cad, presumably short for Cadillac. Another way language is used to delineate groups of people is in calling the hunted people beasts, and using animal imagery to describe them. The targets Wayne was after referred to as beasts, the woman as a mouse, and the man is a cat. This is one way these people are portrayed as less than human. Even during the chase, the woman is regularly referred to as a mouse, even as actual rats are running by as well. However, others are not entirely exempt from this use of animal imagery at the point of comparison, as Wayne is also compared to wild deer when he is chasing after the woman in the alley."
              },
              {
                "worker_id": "1",
                "uid": "eb62c63c6a794ecf83f22d34f85b3a22",
                "response_text": "Slang words are used throughout the story, not only when Wayne is talking, but also when the narrator is explaining characters’ actions. The specific word choices work to make the setting appear unique and mostly dreadful. \n\nWayne refers to his parents as “squareheads” as an insult. Wayne can’t wait to distinguish himself from his parents. He finds them to be monotonous, overbearing, and lame. The slang term is meant to portray them in the light that Wayne sees them. They are not bad people, and they are deeply for their son. They’re just normal, everyday parents, and Wayne wants a more adventurous life. \n\nIn a later scene, the narrator refers to a homeless person on the street as a “stewbum”. The word is definitely not a euphemism for alcoholic, and it doesn’t make the character appear sympathetic. Instead, the use of the term stewbum suggests that he is inferior and is almost deserving of the violence he faces from a seemingly random teenager. \n\nIn the text, teenagers are referred to as “teeners”. Since teenagers have a very important role in this society, and it’s definitely a rite of passage to fulfill the violent mission and purge the criminal that they’ve been assigned to, this slang term makes teenagers seem like a separate class of people. Their ability or inability to make good on their draft card will change the course of their lives, so it’s fitting that they are given a different name.\n\n"
              }
            ]
          },
          {
            "question_text": "How does Wayne interact with the story’s other characters?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "5",
                "uid": "220b7d4245314ae1bc5be811e3aeff6a",
                "response_text": "Wayne is a cocky, arrogant sixteen-year-old defined by his lack of respect for authority. His main goal in life is to be drafted into the military and lead an adventuring life.\n\nHis unnamed parents care for their son but are nonplussed by his attitude and general demeanor of rebelliousness. They seem to live commonplace lives with domestic trips to the movie theatre or a neighborhood poker game. Wayne views this type of life as detestable. His interaction with his parents is crude and condescending.\n\nThe military officials that Wayne meets in the Youth Center also elicit Wayne’s contempt. He views their desk jobs as an analog to his parents’ “punkie” existence. To Wayne, the only admirable way of life is one of high adventure. He disrespects most of the desk workers, but the commanding officer, Captain Jack, deflates his self-assurance.\n\nWayne is keenly intent on hunting his targets. He stares them down tensely before violently engaging them. female target, nicknamed the “mouse”, is revealed to be a woman without hope. She’s tired of running and just wants to be put out of her misery. Surprisingly, at the moment of truth, Wayne cannot bring himself to execute the woman in cold blood, in his own words, “punking out”. He admits to the doctor analyzing him after his assignment that he felt sorry for her.     \n"
              },
              {
                "worker_id": "6",
                "uid": "6cbe02858e1e451baab36f057a331c1f",
                "response_text": "In the beginning, Wayne Seton’s interactions are marked by his arrogance, ego, and desire to hunt. He treats his parents as one would children. He over-analyzes their behavior, and, instead of feeling pity for them, he finds them annoying and useless. He’s desperate to break free of this house and this planet. He views himself highly and dreams about his future on Mars or other such grand adventures. \nHis behavior doesn’t change when Seton finally arrives at the Youth Center. He continues to treat the officers with disrespect, although, as he meets with Captain Jack, he begins to become scared. \nHis desire to hunt and break free of his family drives him, as well as his belief that he is beyond all of this. He watches the other men kill the bum with awe and glee. It doesn’t disgust him, rather it interests him. \nHowever, when it comes time to kill his own undesirable, he finds himself unable. He begins to feel pity, empathy, and sympathy. These emotions make it impossible for him to complete his mission. Although he tries to use his arrogance to hype himself up, he ends up admitting that he doesn’t want to kill the woman and runs away. All bark, but no bite.\n"
              },
              {
                "worker_id": "3",
                "uid": "a8e62c037525496a80f4fcca4611c6c0",
                "response_text": "In the first half of the story, Wayne is very cocky in his interactions with other people. He clearly has no respect for his parents, thinks they lack intelligence, and is annoyed with their routines. He felt he could explode at any moment, so being cold and short with them when they had to interact with them is his way of keeping them out of the line of fire of his impulses. He insists on taking the family car, and is still high and mighty when he gets to the Public Youth Center, throwing sass at the sergeant at the reception desk as well as the corporal in the armory. It is only when he meets Captain Jack that he starts to show some humility and nervousness. His hands start to sweat, and the captain calls him a punk a number of times and then startles him, almost whacking Wayne with his cane. Once he gets to the club, Wayne is nervous interacting with the homeless alcoholic who encountering the alley, and is terrified by the other teenagers who arrived to kill this man. After he retreats into the club, Wayne finds a sense of superiority again as he flashes his official documents to be able to order a drink, after he spots his targets. His goal is to make them as uncomfortable as possible, so he sits right near them, and enjoys the opportunity to have a drink on the government’s dime. After he decides to pursue his targets, he shoots the man once before both targets and Wayne make their way outside. Wayne taunts the woman as he chases her through the alley and the dilapidated buildings, and threatens her with what he intends to do to her once he has her cornered. Once he actually strikes her with his belt though, he retreats into himself and is very nervous all of a sudden, and runs away from the woman. He felt sorry for her, and told this to the doctor at the Youth Center as he is scolded. Wayne seems ashamed, apologizes for punking out, and quietly does what he is told by the doctor for the rest of the session."
              },
              {
                "worker_id": "1",
                "uid": "eb62c63c6a794ecf83f22d34f85b3a22",
                "response_text": "Wayne looks down on the other characters in the story, including his own mother and father. He refers to them as squareheads, and he actually finds his mother’s distress and her arguments with his father to be funny. In a brief scene where Wayne demands the car keys from his parents, it’s clear that they are fearful of him. Instead of thanking them for allowing him to use the car, he repays them for their generosity by laughing at them and slamming the door in his mother’s face. Wayne is fully aware that his mother is terrified of his draft call, and he does not allow her to hug him or give him words of encouragement or advice before he leaves the house. \n\nWhen he arrives at the Youth Center, he treats the man at the front desk poorly, and then proceeds to make fun of the corporal who tries to give him advice. Wayne has a bad attitude, and it affects his interactions with everyone. \n\nThe only person that Wayne does not feel like he can treat badly is Captain Jack. Captain Jack is in a serious position of authority, and that makes Wayne nervous. He answers his questions politely. \n\nIt is truly shocking when Wayne is unable to kill the mousy woman that he was assigned to purge. He has her cornered in an abandoned and run-down building, but he can’t go through with the violence, no matter how much he wants to. In the meeting that takes place afterwards, he tells the doctor that he felt bad for the woman. Therefore, Wayne does have a conscience, even if he likes to pretend that he does not. \n"
              }
            ]
          },
          {
            "question_text": "How does this society seek to deal with violence?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "5",
                "uid": "220b7d4245314ae1bc5be811e3aeff6a",
                "response_text": "The expository dialogue by Doctor Burns at the end of the story provides some insight into how this society views the tendency toward violence in its citizens and retributive criminal justice. The prevailing understanding is that adolescents (presumably adolescent men) are subjected to aggressive and violent impulses. The society seeks to provide these teens a preferred outlet for these impulses in the form of a violent act in service of the state. Typical this seems to be the execution of an undesirable member of society who is viewed as beyond redemption. This permitted brutality is thought to get it out of a teen’s system and prepare him for a life as a contributing member in the state’s military apparatus. The result of this situation is a dramatically violent society where untrained youths are recruited to act as vicious vigilantes who terrorize anyone labelled as undesirable. "
              },
              {
                "worker_id": "6",
                "uid": "6cbe02858e1e451baab36f057a331c1f",
                "response_text": " In the final passages of the story, Wayne Seton, the protagonist, sees a doctor after his failed attempt to eliminate two alleged criminals. Despite feeling the spark and need to hunt and kill earlier, when faced with a scared young woman, he was unable to complete his task. \nDoctor Burns, a member of the readjustment staff at the center where Seton was drafted, takes a look over Seton after he returned. Although Seton enjoyed the thrill of the chase, his empathy and sympathy got the better of him. \nAfter examining him, Dr. Burns reveals the reason why Seton was sent on this mission in the first place. In this abstract reality, those who have committed heinous crimes (in this case, paternal murder and multiple homicides) are labeled as unwanted and unable to change. Instead of sending them to prison for their crimes where they may spend the rest of their lives or receive the death penalty, they send young adults out to hunt them down. \nAt 16 years old, school ends for the teenagers in this society. Once school is over, all the young adults must wait for their draft to come in. \nThey believe that each person is born with a dangerous impulse to kill. If it can be expelled at a young age and used on a person who deserves it, then there’s no risk of a violent crime later on. \nThe justice system is executed by everyday people, instead of a team of soldiers or the government. \nAs well, if the 16-year-olds complete their mission, they will be shot off to space and continue their work in the galaxy.\n"
              },
              {
                "worker_id": "3",
                "uid": "a8e62c037525496a80f4fcca4611c6c0",
                "response_text": "In this society, instead of imposing penalties like death row, the government uses teenagers to end the lives of the people the society has deemed the biggest criminals. Part of this is an attempt to acknowledge the violent impulses that they expect teenagers to have, so this program is meant to give teenagers an outlet to expend this energy in hopes of getting rid of it entirely. Violent tendencies are clearly expected of everyone, as part of a more primitive instinct of sorts. The two people that Wayne was given as targets both killed people outside of this designated time, and so society decided they had to die. There is this tension between government sanctioned murder and other murder. This opportunity for teenagers to address their aggression also serves as a sort of test, and their ability to successfully eliminate their targets determines their future in some way. Formally, this means that the teenagers are given their own choice of weapons, and a six-hour pass to do whatever they want, including breaking curfew and any other laws. However, what happens to them going forward depends on the success of killing their targets in the six hours."
              },
              {
                "worker_id": "1",
                "uid": "eb62c63c6a794ecf83f22d34f85b3a22",
                "response_text": "When the children in this society turn sixteen, they are forced to take a draft call. They must go to a local Youth Center and take orders from an established captain. The kids choose the weapons they would like to use, and they head out to take down a dangerous individual or multiple individuals. When Wayne is stopped by a cop at the beginning of his mission, all he has to do is show the police officer the card he has, and he’s free to continue on into the darkness. This means that his mission is sanctioned by the state. \n\nAfter Wayne fails to commit the beatings and murders that he’s been assigned, he must receive some sort of treatment from a doctor. The thinking is that all people are born with impulses to commit violence, and those that cannot bring themselves to do it in a state sanctioned way are now in danger of hurting people that do not deserve it. The society asks the teenagers to kill the criminals because they believe it fulfills two necessities at once. Dangerous people are expelled from society, and adolescents can be trusted not to turn into violent individuals because they have already gotten it out of their systems.  \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 3587,
        "document_length_chars": 20752
      }
    }
  ]
}