{
  "item_metadata": {
    "item_id": "61228",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61228",
      "content": "THE BIG HEADACHE\n \n\n BY JIM HARMON\n \n\n What's the principal cause of headaches? Why, having a head, of course!\n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, September 1962. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n I\n \n \"Do you think we'll have to use force on Macklin to get him to cooperate in the experiment?\" Ferris asked eagerly.\n \n \"How are you going to go about forcing him, Doctor?\" Mitchell inquired.\n\"He outweighs you by fifty pounds and you needn't look to me for help against that repatriated fullback.\"\n \n Ferris fingered the collar of his starched lab smock. \"Guess I got carried away for a moment. But Macklin is exactly what we need for a quick, dramatic test. We've had it if he turns us down.\"\n \n \"I know,\" Mitchell said, exhaling deeply. \"Somehow the men with the money just can't seem to understand basic research. Who would have financed a study of cyclic periods of the hedgehog? Yet the information gained from that study is vital in cancer research.\"\n \n \"When we prove our results that should be of enough practical value for anyone. But those crummy trustees didn't even leave us enough for a field test.\" Ferris scrubbed his thin hand over the bony ridge of his forehead. \"I've been worrying so much about this I've got the ancestor of all headaches.\"\n \n Mitchell's blue eyes narrowed and his boyish face took on an expression of demonic intensity. \"Ferris, would you consider—?\"\n \n \"No!\" the smaller man yelled. \"You can't expect me to violate professional ethics and test my own discovery on myself.\"\n \n \" Our discovery,\" Mitchell said politely.\n \n \"That's what I meant to say. But I'm not sure it would be completely ethical with even a discovery partly mine.\"\n \n \"You're right. Besides who cares if you or I are cured of headaches? Our reputations don't go outside our own fields,\" Mitchell said. \"But now Macklin—\"\n \n Elliot Macklin had inherited the reputation of the late Albert Einstein in the popular mind. He was the man people thought of when the word\n\"mathematician\" or even \"scientist\" was mentioned. No one knew whether his Theory of Spatium was correct or not because no one had yet been able to frame an argument with it. Macklin was in his early fifties but looked in his late thirties, with the build of a football player. The government took up a lot of his time using him as the symbol of the Ideal Scientist to help recruit Science and Engineering Cadets.\n \n For the past seven years Macklin—who was the Advanced Studies Department of Firestone University—had been involved in devising a faster-than-light drive to help the Army reach Pluto and eventually the nearer stars. Mitchell had overheard two coeds talking and so knew that the project was nearing completion. If so, it was a case of Ad astra per aspirin .\n \n The only thing that could delay the project was Macklin's health.\n \n Despite his impressive body, some years before he had suffered a mild stroke ... or at least a vascular spasm of a cerebral artery. It was known that he suffered from the vilest variety of migraine. A cycle of the headaches had caused him to be absent from his classes for several weeks, and there were an unusual number of military uniforms seen around the campus.\n \n \n\n \n Ferris paced off the tidy measurements of the office outside the laboratory in the biology building. Mitchell sat slumped in the chair behind the blond imitation wood desk, watching him disinterestedly.\n \n \"Do you suppose the Great Man will actually show up?\" Ferris demanded, pausing in mid-stride.\n \n \"I imagine he will,\" Mitchell said. \"Macklin's always seemed a decent enough fellow when I've had lunch with him or seen him at the trustees meetings.\"\n \n \"He's always treated me like dirt,\" Ferris said heatedly. \"Everyone on this campus treats biologists like dirt. Sometimes I want to bash in their smug faces.\"\n \n Sometimes, Mitchell reflected, Ferris displayed a certain lack of scientific detachment.\n \n There came a discreet knock on the door.\n \n \"Please come in,\" Mitchell said.\n \n Elliot Macklin entered in a cloud of pipe smoke and a tweed jacket. He looked more than a little like a postgraduate student, and Mitchell suspected that that was his intention.\n \n He shook hands warmly with Mitchell. \"Good of you to ask me over, Steven.\"\n \n Macklin threw a big arm across Ferris' shoulders. \"How have you been, Harold?\"\n \n Ferris' face flickered between pink and white. \"Fine, thank you, doctor.\"\n \n Macklin dropped on the edge of the desk and adjusted his pipe. \"Now what's this about you wanting my help on something? And please keep the explanation simple. Biology isn't my field, you know.\"\n \n Mitchell moved around the desk casually. \"Actually, Doctor, we haven't the right to ask this of a man of your importance. There may be an element of risk.\"\n \n The mathematician clamped onto his pipe and showed his teeth. \"Now you have me intrigued. What is it all about?\"\n \n \"Doctor, we understand you have severe headaches,\" Mitchell said.\n \n Macklin nodded. \"That's right, Steven. Migraine.\"\n \n \"That must be terrible,\" Ferris said. \"All your fine reputation and lavish salary can't be much consolation when that ripping, tearing agony begins, can it?\"\n \n \"No, Harold, it isn't,\" Macklin admitted. \"What does your project have to do with my headaches?\"\n \n \"Doctor,\" Mitchell said, \"what would you say the most common complaint of man is?\"\n \n \"I would have said the common cold,\" Macklin replied, \"but I suppose from what you have said you mean headaches.\"\n \n \n\n \n \"Headaches,\" Mitchell agreed. \"Everybody has them at some time in his life. Some people have them every day. Some are driven to suicide by their headaches.\"\n \n \"Yes,\" Macklin said.\n \n \"But think,\" Ferris interjected, \"what a boon it would be if everyone could be cured of headaches forever by one simple injection.\"\n \n \"I don't suppose the manufacturers of aspirin would like you. But it would please about everybody else.\"\n \n \"Aspirins would still be used to reduce fever and relieve muscular pains,\" Mitchell said.\n \n \"I see. Are you two saying you have such a shot? Can you cure headaches?\"\n \n \"We think we can,\" Ferris said.\n \n \"How can you have a specific for a number of different causes?\" Macklin asked. \"I know that much about the subject.\"\n \n \"There are a number of different causes for headaches—nervous strain, fatigue, physical diseases from kidney complaints to tumors, over-indulgence—but there is one effect of all of this, the one real cause of headaches,\" Mitchell announced.\n \n \"We have definitely established this for this first time,\" Ferris added.\n \n \"That's fine,\" Macklin said, sucking on his pipe. \"And this effect that produces headaches is?\"\n \n \"The pressure effect caused by pituitrin in the brain,\" Mitchell said eagerly. \"That is, the constriction of blood vessels in the telencephalon section of the frontal lobes. It's caused by an over-production of the pituitary gland. We have artificially bred a virus that feeds on pituitrin.\"\n \n \"That may mean the end of headaches, but I would think it would mean the end of the race as well,\" Macklin said. \"In certain areas it is valuable to have a constriction of blood vessels.\"\n \n \"The virus,\" Ferris explained, \"can easily be localized and stabilized. A colony of virus in the brain cells will relax the cerebral vessels—and only the cerebral vessels—so that the cerebrospinal fluid doesn't create pressure in the cavities of the brain.\"\n \n The mathematician took the pipe out of his mouth. \"If this really works, I could stop using that damned gynergen, couldn't I? The stuff makes me violently sick to my stomach. But it's better than the migraine. How should I go about removing my curse?\" He reinserted the pipe.\n \n \"I assure you, you can forget ergotamine tartrate,\" Ferris said. \"Our discovery will work.\"\n \n \n\n \n \"Will work,\" Macklin said thoughtfully. \"The operative word. It hasn't worked then?\"\n \n \"Certainly it has,\" Ferris said. \"On rats, on chimps....\"\n \n \"But not on humans?\" Macklin asked.\n \n \"Not yet,\" Mitchell admitted.\n \n \"Well,\" Macklin said. \"Well.\" He thumped pipe ashes out into his palm.\n\"Certainly you can get volunteers. Convicts. Conscientious objectors from the Army.\"\n \n \"We want you,\" Ferris told him.\n \n Macklin coughed. \"I don't want to overestimate my value but the government wouldn't like it very well if I died in the middle of this project. My wife would like it even less.\"\n \n Ferris turned his back on the mathematician. Mitchell could see him mouthing the word yellow .\n \n \"Doctor,\" Mitchell said quickly, \"I know it's a tremendous favor to ask of a man of your position. But you can understand our problem. Unless we can produce quick, conclusive and dramatic proof of our studies we can get no more financial backing. We should run a large-scale field test. But we haven't the time or money for that. We can cure the headaches of one person and that's the limit of our resources.\"\n \n \"I'm tempted,\" Macklin said hesitantly, \"but the answer is go. I mean\n' no '. I'd like to help you out, but I'm afraid I owe too much to others to take the rest—the risk, I mean.\"\n \n Macklin ran the back of his knuckles across his forehead. \"I really would like to take you up on it. When I start making slips like that it means another attack of migraine. The drilling, grinding pain through my temples and around my eyeballs. The flashes of light, the rioting pools of color playing on the back of my lids. Ugh.\"\n \n Ferris smiled. \"Gynergen makes you sick, does it, doctor? Produces nausea, eh? The pain of that turns you almost wrong side out, doesn't it? You aren't much better off with it than without, are you? I've heard some say they preferred the migraine.\"\n \n Macklin carefully arranged his pipe along with the tools he used to tend it in a worn leather case. \"Tell me,\" he said, \"what is the worst that could happen to me?\"\n \n \"Low blood pressure,\" Ferris said.\n \n \"That's not so bad,\" Macklin said. \"How low can it get?\"\n \n \"When your heart stops, your blood pressure goes to its lowest point,\" Mitchell said.\n \n A dew of perspiration had bloomed on Macklin's forehead. \"Is there much risk of that?\"\n \n \"Practically none,\" Mitchell said. \"We have to give you the worst possibilities. All our test animals survived and seem perfectly happy and contented. As I said, the virus is self-stabilizing. Ferris and I are confident that there is no danger.... But we may be wrong.\"\n \n Macklin held his head in both hands. \"Why did you two select me ?\"\n \n \"You're an important man, doctor,\" Ferris said. \"Nobody would care if Mitchell or I cured ourselves of headaches—they might not even believe us if we said we did. But the proper authorities will believe a man of your reputation. Besides, neither of us has a record of chronic migraine. You do.\"\n \n \"Yes, I do,\" Macklin said. \"Very well. Go ahead. Give me your injection.\"\n \n Mitchell cleared his throat. \"Are you positive, doctor?\" he asked uncertainly. \"Perhaps you would like a few days to think it over.\"\n \n \"No! I'm ready. Go ahead, right now.\"\n \n \"There's a simple release,\" Ferris said smoothly.\n \n Macklin groped in his pocket for a pen.\n \n \n\n II\n \n \"Ferris!\" Mitchell yelled, slamming the laboratory door behind him.\n \n \"Right here,\" the small man said briskly. He was sitting at a work table, penciling notes. \"I've been expecting you.\"\n \n \"Doctor—Harold—you shouldn't have given this story to the newspapers,\" Mitchell said. He tapped the back of his hand against the folded paper.\n \n \"On the contrary, I should and I did,\" Ferris answered. \"We wanted something dramatic to show to the trustees and here it is.\"\n \n \"Yes, we wanted to show our proof to the trustees—but not broadcast unverified results to the press. It's too early for that!\"\n \n \"Don't be so stuffy and conservative, Mitchell! Macklin's cured, isn't he? By established periodic cycle he should be suffering hell right now, shouldn't he? But thanks to our treatment he is perfectly happy, with no unfortunate side effects such as gynergen produces.\"\n \n \"It's a significant test case, yes. But not enough to go to the newspapers with. If it wasn't enough to go to the press with, it wasn't enough to try and breach the trustees with. Don't you see? The public will hand down a ukase demanding our virus, just as they demanded the Salk vaccine and the Grennell serum.\"\n \n \"But—\"\n \n The shrill call of the telephone interrupted Mitchell's objections.\n \n Ferris excused himself and crossed to the instrument. He answered it and listened for a moment, his face growing impatient.\n \n \"It's Macklin's wife,\" Ferris said. \"Do you want to talk to her? I'm no good with hysterical women.\"\n \n \"Hysterical?\" Mitchell muttered in alarm and went to the phone.\n \n \"Hello?\" Mitchell said reluctantly. \"Mrs. Macklin?\"\n \n \"You are the other one,\" the clear feminine voice said. \"Your name is Mitchell.\"\n \n She couldn't have sounded calmer or more self-possessed, Mitchell thought.\n \n \"That's right, Mrs. Macklin. I'm Dr. Steven Mitchell, Dr. Ferris's associate.\"\n \n \"Do you have a license to dispense narcotics?\"\n \n \"What do you mean by that, Mrs. Macklin,\" Mitchell said sharply.\n \n \"I used to be a nurse, Dr. Mitchell. I know you've given my husband heroin.\"\n \n \"That's absurd. What makes you think a thing like that?\"\n \n \"The—trance he's in now.\"\n \n \"Now, Mrs. Macklin. Neither Dr. Ferris or myself have been near your husband for a full day. The effects of a narcotic would have worn off by this time.\"\n \n \"Most known narcotics,\" she admitted, \"but evidently you have discovered something new. Is it so expensive to refine you and Ferris have to recruit new customers to keep yourselves supplied?\"\n \n \"Mrs. Macklin! I think I had better talk to you later when you are calmer.\"\n \n Mitchell dropped the receiver heavily. \"What could be wrong with Macklin?\" he asked without removing his hand from the telephone.\n \n Ferris frowned, making quotation marks above his nose. \"Let's have a look at the test animals.\"\n \n Together they marched over to the cages and peered through the honeycomb pattern of the wire. The test chimp, Dean, was sitting peacefully in a corner scratching under his arms with the back of his knuckles. Jerry, their control in the experiment, who was practically Dean's twin except that he had received no injection of the E-M Virus, was stomping up and down punching his fingers through the wire, worrying the lock on the cage.\n \n \"Jerry is a great deal more active than Dean,\" Mitchell said.\n \n \"Yes, but Dean isn't sick. He just doesn't seem to have as much nervous energy to burn up. Nothing wrong with his thyroid either.\"\n \n They went to the smaller cages. They found the situation with the rats, Bud and Lou, much the same.\n \n \"I don't know. Maybe they just have tired blood,\" Mitchell ventured.\n \n \"Iron deficiency anemia?\"\n \n \"Never mind, doctor. It was a form of humor. I think we had better see exactly what is wrong with Elliot Macklin.\"\n \n \"There's nothing wrong with him,\" Ferris snapped. \"He's probably just trying to get us in trouble, the ingrate!\"\n \n \n\n \n Macklin's traditional ranch house was small but attractive in aqua-tinted aluminum.\n \n Under Mitchell's thumb the bell chimbed dum-de-de-dum-dum-dum .\n \n As they waited Mitchell glanced at Ferris. He seemed completely undisturbed, perhaps slightly curious.\n \n The door unlatched and swung back.\n \n \"Mrs. Macklin,\" Mitchell said quickly, \"I'm sure we can help if there is anything wrong with your husband. This is Dr. Ferris. I am Dr. Mitchell.\"\n \n \"You had certainly better help him, gentlemen.\" She stood out of the doorway for them to pass.\n \n Mrs. Macklin was an attractive brunette in her late thirties. She wore an expensive yellow dress. And she had a sharp-cornered jawline.\n \n The Army officer came out into the hall to meet them.\n \n \"You are the gentlemen who gave Dr. Macklin the unauthorized injection,\" he said.\n \n It wasn't a question.\n \n \"I don't like that 'unauthorized',\" Ferris snapped.\n \n The colonel—Mitchell spotted the eagles on his green tunic—lifted a heavy eyebrow. \"No? Are you medical doctors? Are you authorized to treat illnesses?\"\n \n \"We weren't treating an illness,\" Mitchell said. \"We were discovering a method of treatment. What concern is it of yours?\"\n \n The colonel smiled thinly. \"Dr. Macklin is my concern. And everything that happens to him. The Army doesn't like what you have done to him.\"\n \n Mitchell wondered desperately just what they had done to the man.\n \n \"Can we see him?\" Mitchell asked.\n \n \"Why not? You can't do much worse than murder him now. That might be just as well. We have laws to cover that.\"\n \n The colonel led them into the comfortable, over-feminine living room. Macklin sat in an easy chair draped in embroidery, smoking. Mitchell suddenly realized Macklin used a pipe as a form of masculine protest to his home surroundings.\n \n On the coffee table in front of Macklin were some odd-shaped building blocks such as were used in nursery schools. A second uniformed man—another colonel but with the snake-entwined staff of the medical corps in his insignia—was kneeling at the table on the marble-effect carpet.\n \n The Army physician stood up and brushed his knees, undusted from the scrupulously clean rug.\n \n \"What's wrong with him, Sidney?\" the other officer asked the doctor.\n \n \"Not a thing,\" Sidney said. \"He's the healthiest, happiest, most well-adjusted man I've ever examined, Carson.\"\n \n \"But—\" Colonel Carson protested.\n \n \"Oh, he's changed all right,\" the Army doctor answered. \"He's not the same man as he used to be.\"\n \n \"How is he different?\" Mitchell demanded.\n \n The medic examined Mitchell and Ferris critically before answering. \"He used to be a mathematical genius.\"\n \n \"And now?\" Mitchell said impatiently.\n \n \"Now he is a moron,\" the medic said.\n \n \n\n III\n \n Mitchell tried to stop Colonel Sidney as he went past, but the doctor mumbled he had a report to make.\n \n Mitchell and Ferris stared at Colonel Carson and Macklin and at each other.\n \n \"What did he mean, Macklin is an idiot?\" Mitchell asked.\n \n \"Not an idiot,\" Colonel Carson corrected primly. \"Dr. Macklin is a moron. He's legally responsible, but he's extremely stupid.\"\n \n \"I'm not so dumb,\" Macklin said defensively.\n \n \"I beg your pardon, sir,\" Carson said. \"I didn't intend any offense. But according to all the standard intelligence tests we have given you, your clinical intelligence quotient is that of a moron.\"\n \n \"That's just on book learning,\" Macklin said. \"There's a lot you learn in life that you don't get out of books, son.\"\n \n \"I'm confident that's true, sir,\" Colonel Carson said. He turned to the two biologists. \"Perhaps we had better speak outside.\"\n \n \"But—\" Mitchell said, impatient to examine Macklin for himself. \"Very well. Let's step into the hall.\"\n \n Ferris followed them docilely.\n \n \"What have you done to him?\" the colonel asked straightforwardly.\n \n \"We merely cured him of his headaches,\" Mitchell said.\n \n \"How?\"\n \n Mitchell did his best to explain the F-M Virus.\n \n \"You mean,\" the Army officer said levelly \"you have infected him with some kind of a disease to rot his brain?\"\n \n \"No, no! Could I talk to the other man, the doctor? Maybe I can make him understand.\"\n \n \"All I want to know is why Elliot Macklin has been made as simple as if he had been kicked in the head by a mule,\" Colonel Carson said.\n \n \"I think I can explain,\" Ferris interrupted.\n \n \"You can?\" Mitchell said.\n \n Ferris nodded. \"We made a slight miscalculation. It appears as if the virus colony overcontrols the supply of posterior pituitary extract in the cerebrum. It isn't more than necessary to stop headaches. But that necessary amount of control to stop pain is too much to allow the brain cells to function properly.\"\n \n \"Why won't they function?\" Carson roared.\n \n \"They don't get enough food—blood, oxygen, hemoglobin,\" Ferris explained. \"The cerebral vessels don't contract enough to pump the blood through the brain as fast and as hard as is needed. The brain cells remain sluggish, dormant. Perhaps decaying.\"\n \n The colonel yelled.\n \n Mitchell groaned. He was abruptly sure Ferris was correct.\n \n \n\n \n The colonel drew himself to attention, fists trembling at his sides.\n\"I'll see you hung for treason! Don't you know what Elliot Macklin means to us? Do you want those filthy Luxemburgians to reach Pluto before we do? Macklin's formula is essential to the FTL engine. You might just as well have blown up Washington, D.C. Better! The capital is replaceable. But the chances of an Elliot Macklin are very nearly once in a human race.\"\n \n \"Just a moment,\" Mitchell interrupted, \"we can cure Macklin.\"\n \n \"You can ?\" Carson said. For a moment Mitchell thought the man was going to clasp his hands and sink to his knees.\n \n \"Certainly. We have learned to stabilize the virus colonies. We have antitoxin to combat the virus. We had always thought of it as a beneficial parasite, but we can wipe it out if necessary.\"\n \n \"Good!\" Carson clasped his hands and gave at least slightly at the knees.\n \n \"Just you wait a second now, boys,\" Elliot Macklin said. He was leaning in the doorway, holding his pipe. \"I've been listening to what you've been saying and I don't like it.\"\n \n \"What do you mean you don't like it?\" Carson demanded. He added, \"Sir?\"\n \n \"I figure you mean to put me back like I used to be.\"\n \n \"Yes, doctor,\" Mitchell said eagerly, \"just as you used to be.\"\n \n \" With my headaches, like before?\"\n \n Mitchell coughed into his fist for an instant, to give him time to frame an answer. \"Unfortunately, yes. Apparently if your mind functions properly once again you will have the headaches again. Our research is a dismal failure.\"\n \n \"I wouldn't go that far,\" Ferris remarked cheerfully.\n \n Mitchell was about to ask his associate what he meant when he saw Macklin slowly shaking his head.\n \n \"No, sir!\" the mathematician said. \"I shall not go back to my original state. I can remember what it was like. Always worrying, worrying, worrying.\"\n \n \"You mean wondering,\" Mitchell said.\n \n Macklin nodded. \"Troubled, anyway. Disturbed by every little thing. How high was up, which infinity was bigger than what infinity—say, what was an infinity anyway? All that sort of schoolboy things. It's peaceful this way. My head doesn't hurt. I've got a good-looking wife and all the money I need. I've got it made. Why worry?\"\n \n Colonel Carson opened his mouth, then closed it.\n \n \"That's right, Colonel. There's no use in arguing with him,\" Mitchell said.\n \n \"It's not his decision to make,\" the colonel said. \"He's an idiot now.\"\n \n \"No, Colonel. As you said, he's a moron. He seems an idiot compared to his former level of intelligence but he's legally responsible. There are millions of morons running around loose in the United States. They can get married, own property, vote, even hold office. Many of them do. You can't force him into being cured.... At least, I don't think you can.\"\n \n \"No, I can't. This is hardly a totalitarian state.\" The colonel looked momentarily glum that it wasn't.\n \n Mitchell looked back at Macklin. \"Where did his wife get to, Colonel? I don't think that even previously he made too many personal decisions for himself. Perhaps she could influence him.\"\n \n \"Maybe,\" the colonel said. \"Let's find her.\"\n \n \n\n \n They found Mrs. Macklin in the dining room, her face at the picture window an attractive silhouette. She turned as the men approached.\n \n \"Mrs. Macklin,\" the colonel began, \"these gentlemen believe they can cure your husband of his present condition.\"\n \n \"Really?\" she said. \"Did you speak to Elliot about that?\"\n \n \"Y-yes,\" Colonel Carson said, \"but he's not himself. He refused the treatment. He wants to remain in his state of lower intelligence.\"\n \n She nodded. \"If those are his wishes, I can't go against them.\"\n \n \"But Mrs. Macklin!\" Mitchell protested. \"You will have to get a court order overruling your husband's wishes.\"\n \n She smoothed an eyebrow with the third finger of her right hand. \"That was my original thought. But I've redecided.\"\n \n \"Redecided!\" Carson burst out almost hysterically.\n \n \"Yes. I can't go against Elliot's wishes. It would be monstrous to put him back where he would suffer the hell of those headaches once again, where he never had a moment's peace from worry and pressure. He's happy now. Like a child, but happy.\"\n \n \"Mrs. Macklin,\" the Army man said levelly, \"if you don't help us restore your husband's mind we will be forced to get a court order declaring him incompetent.\"\n \n \"But he is not! Legally, I mean,\" the woman stormed.\n \n \"Maybe not. It's a borderline case. But I think any court would give us the edge where restoring the mind of Elliot Macklin was concerned. Once he's certified incompetent, authorities can rule whether Mitchell and Ferris' antitoxin treatment is the best method of restoring Dr. Macklin to sanity.\"\n \n \"I doubt very much if the court would rule in that manner,\" she said.\n \n The colonel looked smug. \"Why not?\"\n \n \"Because, Colonel, the matter of my husband's health, his very life, is involved.\"\n \n \"There is some degree of risk in shock treatments, too. But—\"\n \n \"It isn't quite the same, Colonel. Elliot Macklin has a history of vascular spasm, a mild pseudostroke some years ago. Now you want to give those cerebral arteries back the ability to constrict. To paralyze. To kill. No court would give you that authority.\"\n \n \"I suppose there's some chance of that. But without the treatment there is no chance of your husband regaining his right senses, Mrs. Macklin,\" Mitchell interjected.\n \n Her mouth grew petulant. \"I don't care. I would rather have a live husband than a dead genius. I can take care of him this way, make him comfortable....\"\n \n Carson opened his mouth and closed his fist, then relaxed. Mitchell led him back into the hall.\n \n \"I'm no psychiatrist,\" Mitchell said, \"but I think she wants Macklin stupid. Prefers it that way. She's always dominated his personal life, and now she can dominate him completely.\"\n \n \"What is she? A monster?\" the Army officer muttered.\n \n \"No,\" Mitchell said. \"She's an intelligent woman unconsciously jealous of her husband's genius.\"\n \n \"Maybe,\" Carson said. \"I don't know. I don't know what the hell to tell the Pentagon. I think I'll go out and get drunk.\"\n \n \"I'll go with you,\" Ferris said.\n \n Mitchell glanced sharply at the little biologist.\n \n Carson squinted. \"Any particular reason, doctor?\"\n \n \"To celebrate,\" Ferris said.\n \n The colonel shrugged. \"That's as good a reason as any.\"\n \n On the street, Mitchell watched the two men go off together in bewilderment.\n \n \n\n IV\n \n Macklin was playing jacks.\n \n He didn't have a head on his shoulders and he was squatting on a great curving surface that was Spacetime, and his jacks were Earth and Pluto and the rest of the planets. And for a ball he was using a head. Not his head. Mitchell's. Both heads were initialed \"M\" so it was all the same.\n \n \n\n \n Mitchell forced himself to awaken, with some initial difficulty.\n \n He lay there, blinking the sleep out of his eyes, listening to his heart race, and then convulsively snatched the telephone receiver from the nightstand. He stabbed out a number with a vicious index finger.\n \n After a time there came a dull click and a sleepy answer.\n \n \"Hello?\" Elliot Macklin said.\n \n Mitchell smiled to himself. He was in luck; Macklin had answered the phone instead of his wife.\n \n \"Can you speak freely, doctor?\" Mitchell asked.\n \n \"Of course,\" the mathematician said. \"I can talk fine.\"\n \n \"I mean, are you alone?\"\n \n \"Oh, you want to know if my wife is around. No, she's asleep. That Army doctor, Colonel Sidney, he gave her a sedative. I wouldn't let him give me anything, though.\"\n \n \"Good boy,\" the biologist said. \"Listen, doctor—Elliot—El, old son. I'm not against you like all the others. I don't want to make you go back to all that worrying and thinking and headaches. You believe me, don't you?\"\n \n There was a slight hesitation.\n \n \"Sure,\" Macklin said, \"if you say so. Why shouldn't I believe you?\"\n \n \"But there was a hesitation there, El. You worried for just a second if I could have some reason for not telling you the truth.\"\n \n \"I suppose so,\" Macklin said humbly.\n \n \"You've found yourself worrying—thinking—about a lot of other problems since we left you, haven't you? Maybe not the same kind of scientific problem. But more personal ones, ones you didn't used to have time to think about.\"\n \n \"If you say so.\"\n \n \"Now, you know it's so. But how would you like to get rid of those worries just as you got rid of the others?\" Mitchell asked.\n \n \"I guess I'd like that,\" the mathematician replied.\n \n \"Then come on over to my laboratory. You remember where it's at, don't you?\"\n \n \"No, I—yes, I guess I do. But how do I know you won't try to put me back where I was instead of helping me more?\"\n \n \"I couldn't do that against your wishes. That would be illegal!\"\n \n \"If you say so. But I don't guess I can come anyway. The Army is watching me pretty close.\"\n \n \"That's alright,\" Mitchell said quickly. \"You can bring along Colonel Carson.\"\n \n \"But he won't like you fixing me up more.\"\n \n \"But he can't stop me! Not if you want me to do it. Now listen to me—I want you to come right on over here, El.\"\n \n \"If you say so,\" Macklin said uncertainly.",
      "metadata": {
        "title": "The Big Headache",
        "author": "Jim Harmon",
        "passage_id": "61228",
        "uid": "b50ed1fe89ac4c60ac91617e561af258",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "104",
                "uid": "26e0391c309243e8b3c8bf848e98419e",
                "response_text": "Ferris and Mitchell discuss the struggles they are experiencing with their research. They are eager to test their new research and want the test subject to be Elliot Macklin, a well-known and attractive scientist with a reputation akin to Albert Einstein. Macklin experiences migraines and the two believe that their injection shot could cure them. The two want Macklin to participate because it could ensure that their research will have strong financial support.\n\nMacklin soon enters their laboratory and begins to ask about what they’re looking to do with their research. Ferris and Mitchell discuss their theory with Macklin and how their supposed cure works. They mention to Macklin, to his dismay, that it has only been tested on animals. Macklin is skeptical and considers the injection too risky and initially does not agree to take the treatment. \n\nMacklin begins to start experiencing a migraine. As he suffers through a migraine, Ferris and Mitchell use the opportunity to try again to convince him to participate in the research. They further emphasize the very minimal potential risk. Macklin finally agrees to take the injection due to the immense pain he is experiencing. \n\nLater on, Mitchell is upset with Ferris for sharing their unverified results with the press. Ferris exclaims to Mitchell that the experiment with Macklin was a success and that he should not be concerned. The phone rings and Ferris answers it but quickly passes it to Mitchell. Macklin’s wife is on the phone accusing them of giving her husband heroin as Macklin appears to be in a trance. The doctors are concerned by the news and decide to check on the test animals. They do not find anything of concern with the test animals and go to Macklin’s house. Ferris does not seem worried to Mitchell as they wait to be let into the house. When they enter the house, an army Colonel meets them and expresses his unhappiness with their actions. \n\nAs the group heads into the living room, they greet an army physician that tells them that medically there is nothing wrong with Macklin’s health the only difference is that Macklin is no longer a mathematical genius. The three go into the hallway and discuss how the experiment most likely went wrong. The Colonel becomes upset because Macklin was very important to many missions because of his invaluable research. Mitchell suddenly exclaims that he thinks that Macklin can be cured. \n\nHowever, Macklin overhears the possibility of a cure and protests receiving the treatment. The Colonel is upset at Macklin’s reaction and tries to convince Macklin’s wife to force him to be cured. Macklin’s wife does not wish to go against her husband’s wishes. They leave the house without convincing Macklin or his wife. Later on, Mitchell wakes up and calls Macklin. Mitchell attempts to get Macklin to trust him and goes about luring Macklin back to the laboratory by saying that he can help with the new types of worries that Macklin experiences. \n"
              },
              {
                "worker_id": "106",
                "uid": "2e192dfa2c3b4c6896ef02ea70bd4613",
                "response_text": "Dr. Mitchell and Dr. Ferris are preparing to test out their new medical breakthrough on world renowned scientist, Dr. Macklin. Their new injection that they have discovered will potentially cure Macklin of his incessant migraines, which plague the genius' daily life. Macklin is famed for being at the forefront of the research team that is almost finished developing a faster than light drive, to help the US army reach Pluto. The only thing in the way of the completion of this project could be Macklin's headaches. Mitchell and Ferris ask Macklin if he would like to be the trial patient for their new antidote, which they only have funding to test out on one person. The antidote consists of a virus that is injected into a specific spot in the brain, blocking off oxygen from entering, curing the patient of any headaches. After walking Macklin through the science behind it and Macklin signing some waivers, they deliver the treatment to him. \nThe next day, Ferris gives the story of their success with the Doctor to the newspapers, that is until they get a call form Macklin's wife. She tells him that her husband seems to be high on a form of heroin. To this the two scientists protest, but then go to check on their previous animal test subjects to see their state. All the animals tested appear fine, yet subdued. They decide to go and check up on Macklin. \nThey arrive at his house to meet a colonel at the door, who invites them into the living room, where Macklin is sitting. He has just been evaluated by the doctor, and it turns out that the vaccine has reduced his brain capacity, to the point where he is now a \"moron\". The oxygen that the brain has been denied has made Macklin stupid, almost childlike. The two scientists propose they can fix this quite easily, and they just need to reverse the treatment they gave him, which would return him to his original state. Both Macklin and his wife refuse this. Macklin wants to live a life without pain, and the thoughts about the universe that would keep him up worrying, late at night. His wife tells the men that she doesn't want to go against her husband's wishes, and if the US government wants to take the pair to court over it, so that Macklin might regain full consciousness and continue with his work on the Pluto project, the court would side in her and her husband's favour. \nThe men leave, defeated. That is until Mitchell wakes up in the middle of the night, and calls Macklin, convincing him that it's in his best interest to come to his lab, so that he might make him better. The colonel has given his wife a sedative, so she won't wake up. Macklin leaves to unknowingly go to have his treatment reversed. "
              },
              {
                "worker_id": "103",
                "uid": "b9bdd47815ac4daa8dcc6cb6392f5c39",
                "response_text": "The story starts with Steven Mitchell and Harold Ferris arguing over the candidate that they should test their discovery on. While Ferris suggests Mitchell to be the candidate, Mitchell points out that it wouldn’t be ethical. He suggests that Elliot Macklin, the late Albert Einstein, has more reputation and his migraine is well known. He is the perfect candidate they have. After a knock on the door, Mitchell and Ferris invite Macklin inside. They introduce the injection and claim that his headache can be cured forever with this one simple injection. Macklin notices that they have not yet tested this on a human being, but they assert that it worked fine on rats and chimps. They explain their situation to Macklin, which is a lack of time and money. They have the resources to cure one person. However, Macklin is still suspicious of the injection. Mitchell and Ferris assure that there is practically no possibility of getting a low enough blood pressure to stop the heart. Along with another attack of the migraine, Macklin gives them permission to inject. \n\nMacklin’s wife calls and blames them for giving her husband heroin. Being confused, Mitchell and Ferris look at the test animals and realize that the ones with injections are much more calmer and have less energy. They go to see Macklin. Macklin has become the healthiest, happiest person, but he also becomes a moron, namely not very intelligent. After Mitchell explains that he has the antitoxin to fix him, Carson demands them to give it to Macklin. However, Macklin refuses. He used to be worried all the time, but now he is peaceful. Since he is legally responsible, he can definitely refuse the antitoxin. Thus, they go to Mrs. Macklin, hoping that she will be able to persuade Macklin to take the antitoxin. She also refuses. Later, Mitchell calls Macklin pointing out that he is still doing a lot of thinking. Mitchell tells him that he can get rid of them if he wants. "
              },
              {
                "worker_id": "101",
                "uid": "bafe2015f135476683d1328fd4e13307",
                "response_text": "Ferris and Mitchell are two biologists that are in the process of developing a cure to the common headache. They want to test their cure on Elliot Macklin, a well-known genius mathematician who suffered from a stroke and is victim to periodic migraines. Macklin arrives, and the two inform him of their plan. They want to create a cure to the headache using an injection of a virus that attacks pituitrin, which causes migraines. They have had no confirmation of success of their cure on humans, only animals, so there is uncertainty with their experiment. Macklin initially tells them that there is too much of a risk, and that too many people rely on him for him to take the risk. However, after some consideration, Macklin agrees to take the injection. Later on, Mitchell scolds Ferris after learning that he had released the story to the press, despite the results not being confirmed yet. They then receive a call from Macklin's wife, hsyterically accusing them of giving Macklin narcotics and claiming that he has been put under a trance. Ferris and Mitchell visit Macklin, where they meet a team of Army doctors and officials, and find Macklin to be in a mellow, relaxed state. The army doctor claims that Macklin is happy and healthy, but that the injection has caused him to become dumber due to a miscalculation. Ferris and Mitchell suggest fixing the issue by wiping out the virus, but Macklin refuses, not wanting to return to his previous state. They ask Mrs. Macklin, who wants to support her husband's best interests. The two suspect that she is jealous of Macklin's genius and wants to keep him subdued in his current condition. One night, Mitchell wakes and calls Macklin, asking him to come to his lab to fix him. "
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "104",
                "uid": "26e0391c309243e8b3c8bf848e98419e",
                "response_text": "The story begins with the two doctors, Ferris and Mitchell, discussing their research in a laboratory in the biology building. Macklin comes into their office to discuss their potential cure for headaches. It is in the office that Macklin agrees and is administered the experimental cure. \n\nLater, Mitchell is angry at Ferris and goes to scold him in the laboratory. After they receive a concerning call from Macklin’s wife, the two examine their test animals kept in cages. With no significant revelations found, they head to Macklin’s house. \n\nMacklin’s house is described as a traditional ranch style home. At the house, they see Macklin sitting in a very femininely decorated living room. Ferris, Mitchell, and the Colonel have discussions throughout the house about the possibility of a cure and how they might be able to get Macklin to take the cure. They leave the house without any success. \n\nThe next section of the story begins with Mitchell waking up in his bed where he suddenly calls Macklin in an attempt to lure him back to the laboratory.  \n"
              },
              {
                "worker_id": "106",
                "uid": "2e192dfa2c3b4c6896ef02ea70bd4613",
                "response_text": "The story moves through two settings. At the beginning of the story, Mitchell and Ferris are in their lab on a university campus. The lab is situated in the biology building. There is a wooden desk and a chair. There are cages where they keep their animal test subjects.\nThe setting then moves to Macklin's house. It is a traditional, small ranch house, covered in aqua aluminium. There is a living room with an easy chair, covered in embroidery and a coffee table. There is a hallway outside the living room which leads to a dining room. In the dining room is a picture window. "
              },
              {
                "worker_id": "103",
                "uid": "b9bdd47815ac4daa8dcc6cb6392f5c39",
                "response_text": "Mitchell and Ferris’s office are in the biology building. There is a blond imitation wood desk in front of the chair in the office, which is connected to the laboratory. There is a work table and a folded paper on top of it. The room also has a telephone. There are cages of test animals, including a twin chimp and two rats. Macklin has is a small traditional ranch house in aqua-tinted aluminum. The door has a doorbell that rings. Inside, the living room is very feminine, it has a chair filled with embroidery. There is also a coffee table and a marble-effect carpet. And Macklin’s wife stands in the dining room area. "
              },
              {
                "worker_id": "101",
                "uid": "bafe2015f135476683d1328fd4e13307",
                "response_text": "The first part of the story takes place in the office lab of Ferris and Mitchell, located on the campus of Firestone University. Their lab contains several cages of animals that they have experimented on, including chimps and rats. When the two receive news that their experiment has backfired, they visit Macklin at his ranch house, small but uniquely decorated in an overly feminine manner. The living room is covered in embroidery and has a marble carpet. "
              }
            ]
          },
          {
            "question_text": "Describe Elliot Macklin and his established health issues?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "104",
                "uid": "26e0391c309243e8b3c8bf848e98419e",
                "response_text": "It is well-known that Macklin succumbs to migraines from time to time in his life. Physically, Macklin is very fit and is regarded as having a built, athletic frame. However, internally he does suffer from various ailments. His migraine symptoms involve incorrectly substituting words with others, overstimulation of color and light between his eyes, and a concrete pain through his temples. In addition to the migraines, Macklin has a history of vascular spasms. He had even experienced a pseudo stroke in the past. "
              },
              {
                "worker_id": "106",
                "uid": "2e192dfa2c3b4c6896ef02ea70bd4613",
                "response_text": "Elliot Macklin is a Doctor of science. He is renowned to be as intelligent as Albert Einstein. He is described as being in his fifties, yet having the appearance of one in his thirties. He created the Theory of Spatium. For the past seven years, Macklin has worked in the advanced studies department of Firestone university, creating a faster than light speed drive. It is believed that a number of years ago, he suffered a mild stroke. He has to deal with never-ending, terrible migraines every day. His health issues have been life threatening at times, something which Mrs Macklin uses to back up her argument to let her husband remain treated. \n"
              },
              {
                "worker_id": "103",
                "uid": "b9bdd47815ac4daa8dcc6cb6392f5c39",
                "response_text": "Elliot Macklin, the late Albert Einstein, has a great reputation as Mathematician and Scientist. The government even uses him as the symbol of Ideal Scientist. He has been involved in helping the Army reach Pluto and other stars. His headache is also well known. He has a record of chronic migraine, and had to be absent from classes. He had a mild stroke before. When he has headaches, the reputation and lavish salary do not really help. "
              },
              {
                "worker_id": "101",
                "uid": "bafe2015f135476683d1328fd4e13307",
                "response_text": "Elliot Macklin is a genius mathematician and scientist in his fifties, though he looks much younger and has an athletic build. He is responsible for his Theory of Spatium and is aiding the Army in developing an expedition to Pluto. Despite his genius, Macklin had suffered a stroke to his cerebral artery. Because of this, Macklin periodically suffers with severe migraines, enough for him to not be able to function. The migraines also affect his speaking. "
              }
            ]
          },
          {
            "question_text": "Describe the experiment and the mechanisms of how it works.",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "104",
                "uid": "26e0391c309243e8b3c8bf848e98419e",
                "response_text": "Ferris and Mitchell believe they have an injection that can cure headaches forever. They acknowledge during their initial discussion with Macklin that there is a potential risk with the injection, but they heavily downplay the risk. From their research, the two doctors believe that the over-production in the pituitary gland creates a pressure effect that constricts blood vessels in a section of the frontal lobe. Their injection is synthetically made that is meant to feed on the pituitrin that causes the pressure effect. They believe their virus is safe because it is able to target a specific area and remain stabilized within the brain cells. \n\nAfter they give Macklin the injection, they later receive news that he has become a moron and is no longer a mathematical genius. The injection was successful in stopping the pain but in doing so it stopped the brain cells from functioning properly because the vessels cannot pump the necessary amount of blood through the brain to maintain an active and alert mind. \n"
              },
              {
                "worker_id": "106",
                "uid": "2e192dfa2c3b4c6896ef02ea70bd4613",
                "response_text": "The experiment is used to try and eliminate headaches. Headaches are said to cause pressure to pituitrin in the brain. It is a constriction of blood vessels in the front of the brain. This is caused by an overproduction of the pituitary gland. The two men have created a virus that feeds on this pituitrin. The localised virus will relax the cerebral vessels, so that the cerebrospinal fluid won't create pressure in the cavities of the brain. \n"
              },
              {
                "worker_id": "103",
                "uid": "b9bdd47815ac4daa8dcc6cb6392f5c39",
                "response_text": "Since headaches are caused by over-productions of the pituitary gland, which will constrict the blood vessels leading to pressure differences in the brain. Because the virus created by them feeds on pituitrin, the pressure effect can be eliminated. The experiment is to inject the right amount of virus into the body so that the brain cells will relax the pressure effect. Moreover, since the virus can be easily localized and stabilized, it will only affect the cerebral vessels. Other cavities of the brain will not be effected. However, in reality, there is a miscalculation and the amount of control needed in stopping the pain is too much for the brain cells to still function properly. "
              },
              {
                "worker_id": "101",
                "uid": "bafe2015f135476683d1328fd4e13307",
                "response_text": "The experiment that Ferris and Mitchell have come up with aims to cure headaches permanently. They plan to do so by targeting pituitrin, the main cause of constricting blood vessels that cause headaches. The cure is in the form of an injection containing a virus. This virus would feed on pituitrin and put an end to headache production. The virus can be stabilized, and is only designed to target the necessary vessels without interfering with other functions of the brain."
              }
            ]
          },
          {
            "question_text": "How do people react to the choice of using the cure?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "104",
                "uid": "26e0391c309243e8b3c8bf848e98419e",
                "response_text": "When Macklin overhears the possibility of receiving a cure to return him back to his previous state before the injection, he protests that he does not want to receive a cure. He does not want to reverse the injection because he remembers how awful the migraines were and refuses to return back to his original state where he has to experience them. He recollects how he was always worrying back then. He is perfectly content with living in a peaceful existence as he has all the money he could want and an attractive wife. \n\nThe Colonel is shocked at Macklin’s revelation and is upset when he realizes he cannot force Macklin to be cured. The Colonel, Ferris, and Mitchell go to Macklin’s wife to try to convince her to get him to be cured. The Colonel is desperate as he wants to use Macklin’s intelligence since it is such a great advantage for the country. \n\nMacklin’s wife supports her husband’s decision because she recognizes the pain and suffering Macklin has experienced. She is glad that he can be peaceful and happy, even if he is childish. \n\nFerris seems unphased and is overall happy to celebrate that the injection did work to cure headaches. Mitchell still wants to attempt to convince Macklin to take the cure. \n"
              },
              {
                "worker_id": "106",
                "uid": "2e192dfa2c3b4c6896ef02ea70bd4613",
                "response_text": "Each character in the story reacts differently to Macklin's choice to go through with Ferris and Mitchell's cure for migraines. Macklin himself is thrilled with the outcome. He is happy he no longer has the worries of his day to day life that he used to have. Now he can just lead a happy, healthy life with his wife. His wife feels the same way, but for more complicated reasons. She is addicted to controlling her husband, and she sees this as an opportunity to do this completely now, as he has the wits of a child. The colonel is enraged by the fact that the virus has turned Macklin's brain to mush. Macklin is the US government's biggest asset, and he fears what they will do if Macklin doesn't go back to the way he was. Mitchell is remorseful for what the virus has done to Macklin, and goes about finding a way to convince Macklin to reverse the effects. Ferris, while completely on board with the idea of returning Macklin to normal, is happy that the experiment was not a complete failure. "
              },
              {
                "worker_id": "103",
                "uid": "b9bdd47815ac4daa8dcc6cb6392f5c39",
                "response_text": "Macklin first reacted with a surprise. He take the pipe out from his mouth and is quite delight that he can stop taking the gynergen. However, after hearing that it has not been tested on humans, he believes that there are too much risk involved and refuses to take the injection. After they assure that there is practically no possibility of getting a low blood pressure to the point that the heart stops and along with another attack of the migraine, Macklin gives them permission to inject, immediately. Later Mrs. Macklin calls and blames them for giving his husband heroin, and orders them to make him better. But later, she does not want to go against Macklin’s wish of staying in the current state. Carson has always wanted Macklin to become normal again since the Army still need his intelligence. However, there is nothing he can do since Macklin is still in a legally responsible state.  "
              },
              {
                "worker_id": "101",
                "uid": "bafe2015f135476683d1328fd4e13307",
                "response_text": "Macklin is initially hesitant about receiving the cure, but eventually agrees to it out of desperation for his migraines to end. However, the rest of the people around him are not as receptive, especially once the side effects settle in causing Macklin to become less intelligent. Macklin's wife is in distress, convinced that Ferris and Mitchell have given him narcotics. The Army officers and doctors do not approve of the injection either, holding the two scientists responsible for any potential harm done to Macklin and demanding that they reverse it immediately. However, Macklin does not mind the effects of the cure, and prefers it to his old experiences. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4854,
        "document_length_chars": 29305
      }
    }
  ]
}