{
  "item_metadata": {
    "item_id": "61242",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61242",
      "content": "The Winning of the Moon\n \n\n BY KRIS NEVILLE\n \n\n The enemy was friendly enough. Trouble was—their friendship was as dangerous as their hate!\n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, September 1962. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n General Finogenov notified Major Winship that the underground blast was scheduled for the following morning.\n \n Major Winship, after receiving the message, discussed precautions with the three other Americans.\n \n Next morning, before the sunlight exploded, the four of them donned their space suits and went and sat outside the dome, waiting. The sun rose with its bright, silent clap of radiance. Black pools of shadows lay in harsh contrast, their edges drawn with geometric precision.\n \n Major Winship attempted unsuccessfully to communicate with Base Gagarin. \"Will you please request the general to keep us informed on the progress of the countdown?\"\n \n \"Is Pinov,\" came the reply. \"Help?\"\n \n \" Nyet ,\" said Major Winship, exhausting his Russian. \"Count down. Progress. When—boom?\"\n \n \"Is Pinov,\" came the reply.\n \n \"Boom! Boom!\" said Major Winship in exasperation.\n \n \"Boom!\" said Pinov happily.\n \n \"When?\"\n \n \"Boom—boom!\" said Pinov.\n \n \"Oh, nuts.\" Major Winship cut out the circuit. \"They've got Pinov on emergency watch this morning,\" he explained to the other Americans.\n\"The one that doesn't speak English.\"\n \n \"He's done it deliberately,\" said Capt. Wilkins, the eldest of the four Americans. \"How are we going to know when it's over?\"\n \n No one bothered to respond. They sat for a while in silence while the shadows evaporated. One by one they clicked on their cooling systems.\n \n Ultimately, Lt. Chandler said, \"This is a little ridiculous. I'm going to switch over to their channel. Rap if you want me.\" He sat transfixed for several minutes. \"Ah, it's all Russian. Jabbering away. I can't tell a thing that's going on.\"\n \n In the airless void of the moon, the blast itself would be silent. A moth's wing of dust would, perhaps, rise and settle beyond the horizon: no more.\n \n \"Static?\"\n \n \"Nope.\"\n \n \"We'll get static on these things.\"\n \n A small infinity seemed to pass very slowly.\n \n Major Winship shifted restlessly. \"My reefer's gone on the fritz.\" Perspiration was trickling down his face.\n \n \"Let's all go in,\" said the fourth American, Capt. Lawler. \"It's probably over by now.\"\n \n \"I'll try again,\" Major Winship said and switched to the emergency channel. \"Base Gagarin? Base Gagarin?\"\n \n \"Is Pinov. Help?\"\n \n \" Nyet. \"\n \n \"Pinov's still there,\" Major Winship said.\n \n \"Tell him, 'Help',\" said Capt. Wilkins, \"so he'll get somebody we can talk to.\"\n \n \"I'll see them all in hell, first,\" Major Winship said.\n \n Five minutes later, the perspiration was rivers across his face. \"This is it,\" he said. \"I'm going in.\"\n \n \"Let's all—\"\n \n \"No. I've got to cool off.\"\n \n \"Hell, Charlie, I feel stupid sitting out here,\" Capt. Lawler said.\n\"The shot probably went off an hour ago.\"\n \n \"The static level hasn't gone up much, if at all.\"\n \n \"Maybe,\" Lt. Chandler said, \"it's buried too deep.\"\n \n \"Maybe so,\" Major Winship said. \"But we can't have the dome fall down around all our ears.\" He stood. \"Whew! You guys stay put.\"\n \n \n\n \n He crossed with the floating moon-motion to the airlock and entered, closing the door behind him. The darkness slowly filled with air, and the temperature inside the suit declined steadily. At the proper moment of pressure, the inner lock slid open and Major Winship stepped into the illuminated central area. His foot was lifted for the second step when the floor beneath him rose and fell gently, pitching him forward, off balance. He stumbled against the table and ended up seated beside the radio equipment. The ground moved again.\n \n \"Charlie! Charlie!\"\n \n \"I'm okay,\" Major Winship answered. \"Okay! Okay!\"\n \n \"It's—\"\n \n There was additional surface movement. The movement ceased.\n \n \"Hey, Les, how's it look?\" Capt. Wilkins asked.\n \n \"Okay from this side. Charlie, you still okay?\"\n \n \"Okay,\" Major Winship said. \"We told them this might happen,\" he added bitterly.\n \n There was a wait during which everyone seemed to be holding their breath.\n \n \"I guess it's over,\" said Major Winship, getting to his feet. \"Wait a bit more, there may be an after-shock.\" He switched once again to the emergency channel.\n \n \"Is Pinov,\" came the supremely relaxed voice. \"Help?\"\n \n Major Winship whinnied in disgust. \" Nyet! \" he snarled. To the other Americans: \"Our comrades seem unconcerned.\"\n \n \"Tough.\"\n \n They began to get the static for the first time. It crackled and snapped in their speakers. They made sounds of disapproval at each other. For a minute or two, static blanked out the communications completely. It then abated to something in excess of normal.\n \n \"Well,\" Lt. Chandler commented, \"even though we didn't build this thing to withstand a moonquake, it seems to have stood up all right.\"\n \n \"I guess I was just—\" Major Winship began. \"Oh, hell! We're losing pressure. Where's the markers?\"\n \n \"By the lug cabinet.\"\n \n \"Got 'em,\" Major Winship said a moment later.\n \n He peeled back a marker and let it fall. Air currents whisked it away and plastered it against a riveted seam of the dome. It pulsed as though it were breathing and then it ruptured.\n \n Major Winship moved quickly to cut out the emergency air supply which had cut in automatically with the pressure drop. \"You guys wait. It's on your right side, midway up. I'll try to sheet it.\"\n \n He moved for the plastic sheeting.\n \n \"We've lost about three feet of calk out here,\" Capt. Lawler said. \"I can see more ripping loose. You're losing pressure fast at this rate.\"\n \n Major Winship pressed the sheeting over the leak. \"How's that?\"\n \n \"Not yet.\"\n \n \"I don't think I've got enough pressure left to hold it, now. It's sprung a little, and I can't get it to conform over the rivet heads.\"\n \n There was a splatter of static.\n \n \"Damn!\" Major Winship said, \"they should have made these things more flexible.\"\n \n \"Still coming out.\"\n \n \"Best I can do.\" Major Winship stepped back. The sheet began slowly to slide downward, then it fell away completely and lay limply on the floor.\n \n \"Come on in,\" he said dryly.\n \n \n\n \n With the four of them inside, it was somewhat cramped. Most of the five hundred square feet was filled with equipment. Electrical cables trailed loosely along the walls and were festooned from the ceiling, radiating from the connections to the outside solar cells. The living space was more restricted than in a submarine, with the bunks jutting out from the walls about six feet from the floor.\n \n Lt. Chandler mounted one of the bunks to give them more room. \"Well,\" he said wryly, \"it doesn't smell as bad now.\"\n \n \"Oops,\" said Major Winship. \"Just a second. They're coming in.\" He switched over to the emergency channel. It was General Finogenov.\n \n \"Major Winship! Hello! Hello, hello, hello. You A Okay?\"\n \n \"This is Major Winship.\"\n \n \"Oh! Excellent, very good. Any damage, Major?\"\n \n \"Little leak. You?\"\n \n \"Came through without damage.\" General Finogenov paused a moment. When no comment was forthcoming, he continued: \"Perhaps we built a bit more strongly, Major.\"\n \n \"You did this deliberately,\" Major Winship said testily.\n \n \"No, no. Oh, no, no, no, no. Major Winship, please believe me. I very much regret this. Very much so. I am very distressed. Depressed. After repeatedly assuring you there was no danger of a quake—and then to have something like this happen. Oh, this is very embarrassing to me. Is there anything at all we can do?\"\n \n \"Just leave us alone, thank you,\" Major Winship said and cut off the communication.\n \n \"What'd they say?\" Capt. Wilkins asked.\n \n \"Larry, General Finogenov said he was very embarrassed by this.\"\n \n \"That's nice,\" Lt. Chandler said.\n \n \"I'll be damned surprised,\" Major Winship said, \"if they got any seismic data out of that shot.... Well, to hell with them, let's get this leak fixed. Skip, can you get the calking compound?\"\n \n \"Larry, where's the inventory?\"\n \n \"Les has got it.\"\n \n Lt. Chandler got down from the bunk and Capt. Wilkins mounted.\n \n \"Larry,\" Major Winship said, \"why don't you get Earth?\"\n \n \"Okay.\"\n \n Capt. Wilkins got down from the bunk and Capt. Lawler ascended.\n \n \"Got the inventory sheet, Les?\"\n \n \"Right here.\"\n \n Squeezed in front of the massive transmitter, Capt. Wilkins had energized the circuits. There was a puzzled look on his face. He leaned his helmet against the speaker and then shook his head sadly. \"We can't hear anything without any air.\"\n \n Major Winship looked at the microphone. \"Well, I'll just report and—\" He started to pick up the microphone and reconsidered. \"Yes,\" he said.\n\"That's right, isn't it.\"\n \n Capt. Wilkins flicked off the transmitter. \"Some days you don't mine at all,\" he said.\n \n \"Les, have you found it?\"\n \n \"It's around here somewhere. Supposed to be back here.\"\n \n \"Well, find it.\"\n \n Lt. Chandler began moving boxes. \"I saw it—\"\n \n \"Skip, help look.\"\n \n Capt. Lawler got down from the bunk and Major Winship mounted. \"We haven't got all day.\"\n \n A few minutes later, Lt. Chandler issued the triumphant cry. \"Here it is! Dozen tubes. Squeeze tubes. It's the new stuff.\"\n \n Major Winship got down and Capt. Wilkins got up.\n \n \"Marker showed it over here,\" Major Winship said, inching over to the wall. He traced the leak with a metallic finger.\n \n \"How does this stuff work?\" Capt. Lawler asked.\n \n They huddled over the instruction sheet.\n \n \"Let's see. Squeeze the tube until the diaphragm at the nozzle ruptures. Extrude paste into seam. Allow to harden one hour before service.\"\n \n Major Winship said dryly, \"Never mind. I notice it hardens on contact with air.\"\n \n Capt. Wilkins lay back on the bunk and stared upward. He said, \"Now that makes a weird kind of sense, doesn't it?\"\n \n \"How do they possibly think—?\"\n \n \"Gentlemen! It doesn't make any difference,\" Lt. Chandler said. \"Some air must already have leaked into this one. It's hard as a rock. A gorilla couldn't extrude it.\"\n \n \"How're the other ones?\" asked Major Winship.\n \n Lt. Chandler turned and made a quick examination. \"Oh, they're all hard, too.\"\n \n \"Who was supposed to check?\" demanded Capt. Wilkins in exasperation.\n \n \"The only way you can check is to extrude it,\" Lt. Chandler said, \"and if it does extrude, you've ruined it.\"\n \n \"That's that,\" Major Winship said. \"There's nothing for it but to yell help.\"\n \n \n\n II\n \n Capt. Lawler and Lt. Chandler took the land car to Base Gagarin. The Soviet base was situated some ten miles toward sunset at the bottom of a natural fold in the surface. The route was moderately direct to the tip of the gently rolling ridge. At that point, the best pathway angled left and made an S-shaped descent to the basin. It was a one-way trip of approximately thirty exhausting minutes.\n \n Major Winship, with his deficient reefer, remained behind. Capt. Wilkins stayed for company.\n \n \"I want a cigarette in the worst way,\" Capt. Wilkins said.\n \n \"So do I, Larry. Shouldn't be more than a couple of hours. Unless something else goes wrong.\"\n \n \"As long as they'll loan us the calking compound,\" Capt. Wilkins said.\n \n \"Yeah, yeah,\" Major Winship said.\n \n \"Let's eat.\"\n \n \"You got any concentrate? I'm empty.\"\n \n \"I'll load you,\" Capt. Wilkins volunteered wearily.\n \n It was an awkward operation that took several minutes. Capt. Wilkins cursed twice during the operation. \"I'd hate to live in this thing for any period.\"\n \n \"I think these suits are one thing we've got over the Russians,\" Major Winship said. \"I don't see how they can manipulate those bulky pieces of junk around.\"\n \n They ate.\n \n \"Really horrible stuff.\"\n \n \"Nutritious.\"\n \n After the meal, Major Winship said reflectively, \"Now I'd like a cup of hot tea. I'm cooled off.\"\n \n Capt. Wilkins raised eyebrows. \"What brought this on?\"\n \n \"I was just thinking.... They really got it made, Larry. They've got better than three thousand square feet in the main dome and better than twelve hundred square feet in each of the two little ones. And there's only seven of them right now. That's living.\"\n \n \"They've been here six years longer, after all.\"\n \n \"Finogenov had a clay samovar sent up. Lemon and nutmeg, too. Real, by God, fresh lemons for the tea, the last time I was there. His own office is about ten by ten. Think of that. One hundred square feet. And a wooden desk. A wooden desk. And a chair. A wooden chair. Everything big and heavy. Everything. Weight, hell. Fifty pounds more or less—\"\n \n \"They've got the power-plants for it.\"\n \n \"Do you think he did that deliberately?\" Major Winship asked. \"I think he's trying to force us off. I think he hoped for the quake. Gagarin's built to take it, I'll say that. Looks like it, anyhow. You don't suppose they planned this all along? Even if they didn't, they sure got the jump on us again, didn't they? I told you what he told me?\"\n \n \"You told me,\" Capt. Wilkins said.\n \n \n\n \n After a moment, Major Winship said bitterly, \"To hell with the Russian engineer.\"\n \n \"If you've got all that power....\"\n \n \"That's the thing. That's the thing that gripes me, know what I mean? It's just insane to send up a heavy wooden desk. That's showing off. Like a little kid.\"\n \n \"Maybe they don't make aluminum desks.\"\n \n \"They've—got—aluminum. Half of everything on the whole planet is aluminum. You know they're just showing off.\"\n \n \"Let me wire you up,\" Capt. Wilkins said. \"We ought to report.\"\n \n \"That's going to take awhile.\"\n \n \"It's something to do while we wait.\"\n \n \"I guess we ought to.\" Major Winship came down from the bunk and sat with his back toward the transmitter. Capt. Wilkins slewed the equipment around until the emergency jacks were accessible. He unearthed the appropriate cable and began unscrewing the exterior plate to the small transmitter-receiver set on Major Winship's back. Eventually, trailing wires, Major Winship was coupled into the network.\n\"Okay?\"\n \n \"Okay,\" Major Winship gestured.\n \n They roused Earth.\n \n \"This is Major Charles Winship, Commanding Officer, Freedom 19, the American moonbase.\"\n \n At this point, Major Winship observed for the first time that he was now on emergency air. He started to ask Capt. Wilkins to change his air bottle, but then he realized his communications were cut off. He reached over and rapped Capt. Wilkins' helmet.\n \n \"This is the Cape. Come in, Major Winship.\"\n \n \"Just a moment.\"\n \n \"Is everything all right?\"\n \n Major Winship was squirming nervously, obviously perturbed.\n \n \"A-Okay,\" he said. \"Just a moment.\"\n \n \"What's wrong?\" came the worried question. In the background, he heard someone say, \"I think there's something wrong.\"\n \n Capt. Wilkins peered intently. Major Winship contorted his face in a savage grimace.\n \n Capt. Wilkins raised his eyebrows in alarm. They were face to face through their helmets, close together. Each face appeared monstrously large to the other.\n \n Major Winship made a strangling motion and reached for his throat. One arm tangled a cable and jerked the speaker jack loose. Major Winship could no longer hear the alarmed expressions from the Cape. The effort was not entirely subvocal, since he emitted a little gasping cry in involuntary realism.\n \n This, in the course of some 90 seconds, was transmitted to Earth.\n \n Capt. Wilkins's lips were desperately forming the word \"Leak?\"\n \n Air, Major Winship said silently.\n \n Leak?\n \n Bottle! Bottle! Bottle! It was a frog-like, unvocal expletive.\n \n \n\n \n Comprehension dawned. Capt. Wilkins nodded and started to turn away. Major Winship caught his arm and nodded his head toward the loose jack.\n \n Oh.\n \n Capt. Wilkins nodded and smiled. He reached across and plugged the speaker in again.\n \n \"... Freedom 19! Hello, Freedom 19! Come in!\"\n \n \"We're here,\" Major Winship said.\n \n \"All right? Are you all right?\"\n \n \"We're all right. A-Okay.\" Major Winship, mindful of the extent of his potential audience, took a deep breath. \"Earlier this morning, the Soviet Union fired an underground atomic device for the ostensible purpose of investigating the composition of the lunar mass by means of seismic analysis of the resultant shock waves. This was done in spite of American warnings that such a disturbance might release accumulated stresses in the long undisturbed satellite, and was done in the face of vigorous American protests.\"\n \n Capt. Wilkins tapped his helmet and gestured for him to swivel around. The turn was uncomfortably tight and complicated by the restraining cables. Capt. Wilkins began replacement of the air bottle.\n \n \"These protests have proved well founded,\" Major Winship continued.\n\"Immediately following the detonation, Freedom 19 was called on to withstand a moderately severe shifting of the Lunar surface. No personnel were injured and there was no equipment damage.\"\n \n Capt. Wilkins tapped his shoulder to indicate the new air bottle was being inserted. Another tap indicated it was seated. Major Winship flicked the appropriate chest button and nodded in appreciation.\n \n \"However,\" he continued, \"we did experience a minor leak in the dome, which is presently being repaired.\"\n \n \"The Soviet Union,\" came the reply, \"has reported the disturbance and has tendered their official apology. You want it?\"\n \n \"It can wait until later. Send it by mail for all I care. Vacuum has destroyed our organic air reconditioner. We have approximately three weeks of emergency air. However, Base Gagarin reports no damage, so that, in the event we exhaust our air, we will be able to obtain the necessary replacement.\"\n \n The wait of a little better than three seconds for the response gave the conversation a tone of deliberation.\n \n A new voice came on. \"We tried to contact you earlier, Major. We will be able to deliver replacements in about ten days.\"\n \n \"I will forward a coded report on the occurrence,\" Major Winship said.\n \n \"Let us hear from you again in ... about three hours. Is the leak repaired?\"\n \n \"The leak has not yet been repaired. Over and out.\"\n \n He nodded to Capt. Wilkins and leaned back.\n \n Methodically, Capt. Wilkins set about disconnecting the major from the transmitter.\n \n \"Wow!\" said Major Winship when he was once more in communication. \"For a moment there, I thought....\"\n \n \"What?\" Capt. Wilkins asked with interest.\n \n \"I could see myself asking them to ask the Russians to ask Finogenov to get on the emergency channel to ask you to charge the air bottle. I never felt so ... idiotic is not quite strong enough ... there for a minute in my whole life. I didn't know how much emergency air was left, and I thought, my God, I'll never live this down. All the hams in the world listening, while I try to explain the situation. I could see the nickname being entered in my files: aka. The Airless Idiot. I tell you, that was rough.\"\n \n \n\n III\n \n Capt. Lawler and Lt. Chandler returned with the calking compound. It occupied the rear section of the land car. Lt. Chandler sat atop it. It was a fifty-five gallon drum.\n \n The airlock to Freedom 19 was open. \"What is that ?\" asked Major Winship, squinting out into the glaring sunlight.\n \n \"That,\" said Capt. Lawler, \"is the calking compound.\"\n \n \"You're kidding,\" said Capt. Wilkins.\n \n \"I am not kidding.\"\n \n Capt. Lawler and Lt. Chandler came inside. Capt. Wilkins mounted a bunk.\n \n \"Why didn't you just borrow a cupful?\" Major Winship said sarcastically.\n \n \"It's this way,\" Lt. Chandler said. \"They didn't have anything but\n55-gallon drums of it.\"\n \n \"Oh, my,\" said Capt. Wilkins. \"I suppose it's a steel drum. Those things must weigh....\"\n \n \"Actually, I think you guys have got the general wrong,\" Capt. Lawler said. \"He was out, himself, to greet us. I think he was really quite upset by the quake. Probably because his people had misfigured so bad.\"\n \n \"He's too damned suspicious,\" Major Winship said. \"You know and I know why they set that blast off. I tried to tell him. Hell. He looks at me like an emasculated owl and wants to know our ulterior motive in trying to prevent a purely scientific experiment, the results of which will be published in the technical press for the good of everybody. I'll bet!\"\n \n \"About this drum,\" Capt. Wilkins said.\n \n \"Well, like I said, it's this way,\" Lt. Chandler resumed. \"I told him we needed about a pint. Maybe a quart. But this stuff you have to mix up. He only had these drums. There's two parts to it, and you have to combine them in just the right proportion. He told me to take a little scale—\"\n \n \"A little scale?\" asked Capt. Wilkins, rolling his eyes at the dome.\n \n \"That's what I told him. We don't have any little scale.\"\n \n \"Yeah,\" said Captain Lawler, \"and he looked at us with that mute, surprised look, like everybody, everywhere has dozens of little scales.\"\n \n \"Well, anyway,\" Lt. Chandler continued, \"he told us just to mix up the whole fifty-five gallon drum. There's a little bucket of stuff that goes in, and it's measured just right. We can throw away what we don't need.\"\n \n \"Somehow, that sounds like him,\" Major Winship said.\n \n \"He had five or six of them.\"\n \n \"Jesus!\" said Capt. Wilkins. \"That must be three thousand pounds of calking compound. Those people are insane.\"\n \n \"The question is,\" Capt. Lawler said, \"'How are we going to mix it?' It's supposed to be mixed thoroughly.\"\n \n They thought over the problem for a while.\n \n \"That will be a man-sized job,\" Major Winship said.\n \n \"Let's see, Charlie. Maybe not too bad,\" said Capt. Wilkins. \"If I took the compressor motor, we could make up a shaft and ... let's see ... if we could....\"\n \n \n\n \n It took the better part of an hour to rig up the electric mixer.\n \n Capt. Wilkins was profusely congratulated.\n \n \"Now,\" Major Winship said, \"we can either bring the drum inside or take the mixer out there.\"\n \n \"We're going to have to bring the drum in,\" Capt. Wilkins said.\n \n \"Well,\" said Capt. Lawler, \"that will make it nice and cozy.\"\n \n It took the four of them to roll the drum inside, rocking it back and forth through the airlock. At that time, it was apparent the table was interposing itself.\n \n Lt. Chandler tried to dismantle the table. \"Damn these suits,\" he said.\n \n \"You've got it stuck between the bunk post.\"\n \n \"I know that.\"\n \n \"I don't think this is the way to do it,\" Major Winship said. \"Let's back the drum out.\"\n \n Reluctantly, they backed the drum out and deposited it. With the aid of Capt. Lawler, Lt. Chandler got the table unstuck. They passed it over to Major Winship, who handed it out to Capt. Wilkins. Captain Wilkins carried it around the drum of calking compound and set it down. It rested uneasily on the uneven surface.\n \n \"Now, let's go,\" said Major Winship.\n \n Eventually, they accomplished the moving. They wedged the drum between the main air-supply tank and the transmitter. They were all perspiring.\n\"It's not the weight, it's the mass,\" said Capt. Wilkins brightly.\n \n \"The hell it isn't the weight,\" said Lt. Chandler. \"That's heavy.\"\n \n \"With my reefer out,\" said Major Winship, \"I'm the one it's rough on.\" He shook perspiration out of his eyes. \"They should figure a way to get a mop in here, or a towel, or a sponge, or something. I'll bet you've forgotten how much sweat stings in the eyes.\"\n \n \"It's the salt.\"\n \n \"Speaking of salt. I wish I had some salt tablets,\" Major Winship said.\n\"I've never sweat so much since basic.\"\n \n \"Want to bet Finogenov hasn't got a bushel of them?\"\n \n \"No!\" Major Winship snapped.\n \n \n\n \n With the drum of calking compound inside, both Capt. Lawler and Lt. Chandler retreated to the bunks. Capt. Wilkins maneuvered the mixing attachment. \"I feel crowded,\" he said.\n \n \"Cozy's the word.\"\n \n \"Watch it! Watch it! You almost hit me in the face plate with that!\"\n \n \"Sorry.\"\n \n At length the mixer was in operation in the drum.\n \n \"Works perfectly,\" said Capt. Wilkins proudly.\n \n \"Now what, Skip? The instructions aren't in English.\"\n \n \"You're supposed to dump the bucket of stuff in. Then clean the area thoroughly around the leak.\"\n \n \"With what?\" asked Major Winship.\n \n \"Sandpaper, I guess.\"\n \n \"With sandpaper?\" Major Winship said, emptying the bucket of fluid into the drum. \"We don't have any sandpaper.\"\n \n \"It's been a long day,\" Capt. Wilkins said.\n \n \"Mix it thoroughly,\" Lt. Chandler mused. \"I guess that means let it mix for about ten minutes or so. Then you apply it. It sets for service in just a little bit, Finogenov said. An hour or so, maybe.\"\n \n \"I hope this doesn't set on exposure to air.\"\n \n \"No,\" Capt. Lawler said. \"It sets by some kind of chemical action. General Finogenov wasn't sure of the English name for it. Some kind of plastic.\"\n \n \"Let's come back to how we're going to clean around the leak,\" Major Winship said.\n \n \"Say, I—\" interrupted Capt. Wilkins. There was a trace of concern in his voice. \"This is a hell of a time for this to occur to me. I just wasn't thinking, before. You don't suppose it's a room-temperature-curing epoxy resin, do you? \"\n \n \"Larry,\" said Major Winship, \"I wouldn't know a room-temperature-curing epoxy resin from—\"\n \n \"Hey!\" exclaimed Capt. Wilkins. \"The mixer's stopped.\" He bent forward and touched the drum. He jerked back. \"Ye Gods! that's hot! And it's harder than a rock! It is an epoxy! Let's get out of here.\"\n \n \"Huh?\"\n \n \"Out! Out!\"\n \n Major Winship, Lt. Chandler, and Capt. Lawler, recognizing the sense of urgency, simultaneously glanced at the drum. It was glowing cherry red.\n \n \"Let's go!\" Capt. Wilkins said.\n \n He and the Major reached the airlock at the same time and became temporarily engaged with each other. Movement was somewhat ungainly in the space suits under the best of conditions, and now, with the necessity for speed, was doubly so. The other two crashed into them from behind, and they spewed forth from the dome in a tangle of arms and legs.\n \n At the table, they separated, two going to the left, two to the right. The table remained untouched.\n \n When they halted, Capt. Wilkins said, \"Get to one side, it may go off like shrapnel.\" They obeyed.\n \n \"What—what—what?\" Capt. Lawler stuttered.\n \n They were still separated, two on one side of the airlock, two on the other.\n \n \"I'm going to try to look,\" Capt. Wilkins said. \"Let me go.\" He lumbered directly away from the dome for a distance of about fifteen feet, then turned and positioned himself, some five feet behind the table, on a line of sight with the airlock.\n \n \"I can see it,\" he said. \"It's getting redder. It's ... it's ... melting, yes. Melting down at the bottom a little. Now it's falling over to one side and laying on the air tank. The air tank is getting red, too. I'm afraid ... it's weakening it.... Redder. Oh, oh.\"\n \n \"What?\" said Capt. Lawler.\n \n \"Watch out! There. There! \" Capt. Wilkins leaped from his position. He was still floating toward the ground when there was an incredibly bright flare from inside the dome, and a great, silent tongue of flame lashed through the airlock and rolled across the lunar surface. The table was sent tumbling. The flame was gone almost instantly.\n \n \n\n \n \"There went the air,\" Capt. Lawler commented.\n \n \"We got T-Trouble,\" said Lt. Chandler.",
      "metadata": {
        "title": "The Winning of the Moon",
        "author": "Kris Neville",
        "passage_id": "61242",
        "uid": "cb79c5d16ee0415b87ac969b616167a9",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "6",
                "uid": "ba9528a78921460085d46c72bc5d94ed",
                "response_text": "On the surface of the moon, the American base (Freedom 19) is headed by Major Winship, with his three men, Captain Wilkins, Captain Lawler, and Lieutenant Chandler. The Soviets of Base Garagin are conducting a seismic test to learn more about the depths of the moon. The Americans protested it, as their base is not as strongly built, but the Russians went ahead anyway. With a language barrier and poor communication, the Americans don’t know when they are going to perform the test, so they stand outside in their suits waiting. After a few hours, a moonquake occurs, rippling through the surface. The quake caused a leak in their base, which Winship tries and fails to fix with a marker and a plastic sheet. He complains that the Russians did this on purpose, to try and force them off the moon, but they have three weeks of emergency air. They can try and fix it. \nThey are unable to use the transmission since there is no air in the base. Winship orders his men to find the caulking solution, but it has hardened and dried out. He orders Lawler and Chandler to make the 60-minute-round-trip journey to Base Garagin to ask for help. Though Soviet General Finogenov denies it, Winship still wonders if this was intentional. Wilkins and Winship share a meal of gross nutrition tablets. \nWilkins, the resident tech, hooks Winship up to the radio within his suit, so he can speak into the radio. With all the complicated wiring, Winship’s air supply is cut off, and he motions to Wilkins to fix it. Earth is on the line, but he tries to not make his problem known. After Wilkins fixes it, Winship informs them of their difficulties and is told that a replacement could arrive in 10 days and that the Russians formally apologized. \nChandler and Lawler arrive with a 55-gallon barrel of caulking agent, along with another compound that must be mixed in. Displeased by the Russian’s excessiveness, the team figures out a way to successfully mix it. Wilkins creates an electric mixer, while the rest move the barrel inside the dome with great difficulty. They mix the barrel and quickly realize that it is a chemical epoxy, one that reacts to temperature. The heat of the mixer and the dome causes the epoxy to heat up drastically. The men escape to the airlock and watch as the barrel explodes, the fire it causes using up all their remaining oxygen. \n"
              },
              {
                "worker_id": "1",
                "uid": "2a5de3150ff94f21a84049f1efcb0fda",
                "response_text": "An American man named Major Winship learns that there will be an underground blast the following day. He calls Base Gagrin, the Soviet Union’s dome, to request that they relay the exact timing of the explosion. The person who answers cannot speak English, so Winship hangs up. Winship and his three crew members, Lawler, Wilkins, and Chandler, have no way of knowing when the explosion will be over because they are on the moon. Winship’s suit stops working, and his body starts to overheat. Although he knows it’s a risk, he decides to leave the safety of the dome so that he can cool down. He can’t stand the excessive heat and thinks that the explosion has already occurred.\n\nWhen Winship immerses himself in the moon’s environment, he successfully cools down. Within seconds, however, he feels the explosion. The men hear several minutes of static on their communication devices. They realize that their capsule has a dome and is losing pressure. Winship tries to cover the hole with a plastic sheet, but it doesn’t work. He reenters the dome and speaks to the Soviets on the phone. Their leader lets him know that they suffered zero damage and suggests that it’s because their dome is stronger and superior to the Americans’. Winship accuses them of purposefully failing to communicate, and the Soviet denies it. The men attempt to use some calk to fix the hole, but it is useless because it has already been exposed to air. \n\nAlthough the Americans hate to rely on the Soviets for any type of help, the crew has no choice at this point. Lawler and Chandler take the land car to the Soviet base to get supplies to patch the hole. Winship cannot travel because of his busted suit, and Wilkins stays behind with him. They share a meal and complain about how the Soviets have a much nicer dome than they do, and their leader has a real wooden desk, among other nicer amenities. Some time later, Winship calls Earth. He tells the Americans on the ground about the leak in their dome. The man on the other end tells Winship that the Soviets have apologized for the incident, but Winship still isn’t convinced of their sincerity. \n\nLawler and Chandler return with a 55-gallon drum of the calking agent, and this shocks Wilkins and Winship. They need only a very small amount, and this massive drum is difficult to carry and maneuver. Again, Winship wonders if the Soviets are playing tricks with the Americans. The team uses an electric mixer to prepare the calk, but the mixture gets incredibly hot and starts turning bright red. Wilkins realizes that the compound is an epoxy, and the men need to exit the dome immediately. He yells at everyone to evacuate. The Americans are very worried that the drum of calk is going to blow up like a bomb. Moments later, it does. \n"
              },
              {
                "worker_id": "3",
                "uid": "3c517552d0524beea53ff661423a4360",
                "response_text": "The story starts with four Americans in spacesuits on the moon waiting outside of their dome as the Russians conduct a seismic test involving some explosions. Pinov is the Russian on the emergency line, but he does not speak English, so the Americans don't know when it will be safe to enter the dome again. It was hot outside the dome, and the suits' cooling systems could only do so much. Major Winship got tired of waiting and wanted to cool off, so he entered the dome, but as soon as he did so he was thrown off his feet from an explosion. Soon after, some static blocked communications for a minute or two, but then the men had a new problem: the dome was losing pressure, so they were losing air. After their best attempt at patching the hole, they got in touch with the Russians who had not sustained any damage. Major Winship had no patience for General Finogenov, even though the Russian was seemingly embarrassed that there had been a quake caused by his test, as he had promised therew ould not be. Lt. Chandler found the squeeze tubes that they could use to patch the rupture, but they were no longer any good, so Capt. Lawler and Lt. Chandler headed to Base Gagarin in their land car to ask to borrow calking compound from the Russians.  Major Winship and Capt. Wilkins figured they may as well report back to Earth, but once their communications connect, Major Winship realized he is on emergency air and tries to get help from Capt. Wilkins, but those on Earth heard Winship lose air and gasp. Wilkins caught on just in time, and updated those on Earth as they swaped out their oxygen supplies in their suits. Earth requested a report in three hours, confirming that the dome's leak hadn't been repaired, and Winship was relieved the Soviet didn't have to step in to help with his air issue. When the others returned with the fifty-five gallon drum of calking compound, they marveled at how much the Soviets had on hand, and then moved to make an electric mixer to prepare the compound. They tried to move the drum inside to mix it, but there wasn't room, and they tried to move it back out, so all of the men were sweating again. As they discussed how best to proceed in patching the dome, it occured to Wilkins that it could be a room-temperature-curing epoxy resin, and just then they realized that the epoxy had become rock-solid and hot. Wilkins threw out orders to try to protect the men from the impending explosion, but he watched the drum of compound melt, and eventually the air tank started to heat up too. A quick burst of flame flashed inside the dome, leaving the men stranded without air at the end of the story. \n"
              },
              {
                "worker_id": "8",
                "uid": "f7f2d3e848ad426a94701e5cfa068f11",
                "response_text": "Major Winship and his crew stationed at the American moonbase Freedom 19 await a subterranean atomic explosion resulting from a test conducted by their Russian counterparts at Base Gagarin. According to the Russians, the test will help them determine the composition of the moon by analyzing the resultant seismic activity. However, Major Winship suspects the Russians, led by General Finogenov, are conducting the tests in order to purposefully sabotage American efforts to fortify their moon presence. They struggle to communicate with the Russian base as they await word on the status of their test, and when Major Winship goes back inside the dome to call them again, he is suddenly knocked over by movements of the moon's surface, signifying completion of the test. After the quakes settle, the crew discovers a leak in the protective dome, which causes air to slowly seep out. Luckily, they have an emergency air supply to last three weeks, but they lose a significant amount of calking that could be used to repair the leak. When a plastic sheet fails to patch the damage, Lt. Les Chandler searches for squeeze tubes that can ostensibly repair it. However, he discovers that the paste inside requires air in order to harden and some of the tubes have hardened already. Captain Skip Lawler accompanies Lt. Chandler to Base Gagarin in order to ask for calking that might help repair the patch. In their absence, Major Winship bemoans to Captain Larry Wilkins the luxury in which the Russians live on Base Gagarin compared to their discomfort in the cramped quarters of Freedom 19. He continues to muse about his theory that General Finogenov intentionally caused the explosion to harm their base and cause them to vacate the moon. As they await Lawler and Chandler's return, Capt. Wilkins calls Earth on the radio transmitter so that Winship can report the test explosion and the resulting damage. While he talks, he suddenly runs out of his emergency supply of air, and Wilkins refills it for him. Earth promises to restore their air supply in ten days. When Lawler and Chandler return with the calking compound, the crew spends a good amount of time engineering a large, mechanical mixer since the compound comes in a massive, heavy barrel and must be mixed together in order to use it properly. As Captain Wilkins begins mixing the compound, he suddenly realizes that it is a room-temperature-curing epoxy resin. The resin hardens, and the crew rushes out of the dome just before it melts, tips over the barrel, and ignites the air tank next to it, causing a massive explosion. Now the crew is left without any supply of air, and their only hope is an emergency supply still ten days from arriving."
              }
            ]
          },
          {
            "question_text": "Describe the relationship between the Soviets and the Americans.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "6",
                "uid": "ba9528a78921460085d46c72bc5d94ed",
                "response_text": "As can be seen from the beginning, Base Gagarin and the small group of Americans have a slightly contentious relationship. Even the title of the story, The Winning of the Moon, emphasizes the undercurrent of war and competition that informs the way they interact with each other. \nThe story begins with potentially purposeful miscommunication between the Russians and the Americans. The Soviet base is running an underground seismic wave test, the likes of which could release after-shocks and tremors. Such a quake could damage the American dome, meager in comparison with Base Gagarin. The Soviets put Pinov on the line, who only speaks Russian. Without the ability to communicate, the Americans were stuck outside on the moon for hours, waiting to see if the seismic eruption could be seen or felt. Feeling like idiots, one goes inside, just as an aftershock causes a leak in their dome. They instantly blame the Russians, especially since the Americans protested such a test. \nThis series of unfortunate events continues as the Americans quickly realize that their supplies are not able to fix the leak. They must ask the Russians for help, even after complaining to their home base about their actions. \nBase Gagarin is huge compared to the American dome. General Finogenov even has a wooden desk in his office, along with other earthly amenities that the Americans have been deprived of. The Russians have been on the moon for six years longer than the Americans, which could explain their extensive supplies. \nThey give the Americans a 55-gallon mixture to fix the leak, however, the language barrier prevents them from realizing what kind of epoxy it is. This miscommunication leads to the barrel exploding and further destroying the American dome. It’s fair to say that it’s not smooth sailing on the moon. \n"
              },
              {
                "worker_id": "1",
                "uid": "2a5de3150ff94f21a84049f1efcb0fda",
                "response_text": "When Winship calls the Soviets to discuss the exact timing for the underground explosion, Pinov, the person who answers the call, cannot speak English. This makes Winship frustrated. When Captain Wilkins suggests to Captain Winship that he say the word “help” into the phone so that the Soviets will know it’s serious, Winship says he would rather die. This suggests that there’s a power dynamic between the two nations, and Winship, as an American, does not want to appear weak in front of the Soviets. Winship wants to keep his American crew safe, but his pride is equally important at this point. As a result of Winship’s refusal to say the word “help,” he ends up stepping outside of the dome before the explosion occurs. \n\nLater, Winship called General Finogenov, the Soviet leader, to report some damage to their dome. The General responds by explaining that the Soviets have a stronger dome, and Winship accuses Finogenov of deliberately cutting the ties of communication to keep the Americans guessing and jeopardize their safety. Finogenov profusely denies Winship’s claim and offers to help in any way possible. \n\nWinship is highly suspicious of the Soviets, and especially suspicious of Finogenov’s incredible working space in the dome. He has a wooden desk, a chair, and one hundred square feet to move around in. It appears to Winshp that Finogenov cares only about his own comfort and not about the safety of his American counterparts. When Winship has to call the Americans on Earth to let them know about the air leak, he is concerned that the Soviets are listening in on his call. He and his men do not want to wait 10 days for the other Americans to send them supplies to fix the leak, so their only real choice is to rely on the kindness of the Soviets. This makes Winship sick to his stomach, as he loathes asking them for help and potentially looking weak. \n\nIt appears that Winship’s suspicions are merited when the Soviets send over a 55-gallon drum of calk to fix a very small leak in the Americans’ dome, and they do not give the Americans proper instructions for how to prepare and use the chemicals. The crew uses an electric mixer to prepare the calk, and the epoxy mixture turns bright red and blows up. \n"
              },
              {
                "worker_id": "3",
                "uid": "3c517552d0524beea53ff661423a4360",
                "response_text": "There are seven Soviets and four Americans on the moon in this story, and there is definitely an issue of a balance of power. The Soviets have been there for six years longer than the Americans have, and have way more space set up for their equipment and living. The Americans operate out of one 500 square foot dome, and the Soviets have a 3000 square foot dome and two smaller ones (that are each still larger than the American one). The Americans think they have better space suits, that are at least less bulky, but don't have the amenities like the nice furniture or the fresh plants. Things are very tense over the radio: Major Winship seems constantly angry while communicating with the Soviets, and the Russians act polite and apologetic when things go terribly wrong, even if it's unclear how much happened on purpose. On the day of the seismic test, the one Soviet who does not speak English is the one who is in charge of emergency communication, which Winship thinks was on purpose. The Soviets have a lot more electric power, and say that their experiments are all for purely scientific purposes, even if the Americans think the Soviets are trying to drive them out. The Americans have to rely on the Soviets for emergency supplies; they hope not to have to ask for air, but do retrieve a drum of calking compound to aid in the dome repairs which eventually causes an even larger problem as their air supply is burnt out. "
              },
              {
                "worker_id": "8",
                "uid": "f7f2d3e848ad426a94701e5cfa068f11",
                "response_text": "Although the two groups both operate bases on the moon, they live very different lives and struggle to effectively communicate with each other. While one large dome and three smaller ones comprise the Soviet Base Gagarin, the American Freedom 19 base is one cramped dome where the four-person crew lives and works.  The seven-person crew at Base Gagarin live in luxury compared to the American crew and have hot tea, better supplies, and more space to live and work. Major Winship expresses consistent frustration with the inability to communicate with Pinov during the atomic test, and he is deeply suspicious about General Finogenov's motives regarding the test in the first place. Winship does not trust when Finogenov insists the tests are being conducted for purely scientific purposes, and the results of the study will be made available in the technical press. For his part, Finogenov is deeply apologetic when the test causes a leak in Freedom 19 and therefore a drop in air pressure, but Winship still doesn't trust him. He believes it is all part of a Soviet plan to sabotage their mission and expel them from the moon. Winship's misgivings appear to have some truth (or else the whole incident reveals the incompetence of the American crew) when the Soviet base supplies the Americans a large batch of what they believe to be a calking compound in order to repair the air leak. The compound turns out to be a highly explosive material that combusts when it makes contact with the American air tank, thus completely depleting its air supply."
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "6",
                "uid": "ba9528a78921460085d46c72bc5d94ed",
                "response_text": "The Winning of the Moon by Kris Neville takes place on the moon, although exactly what moon is never specified. The moon itself has a fairly uneven surface, especially after the moonquake rips through its bases. \nMost of the story takes place inside of the American base, a mere 500 square feet. It is cramped inside, filled to the brim with equipment, tools, and supplies necessary for the moon. The American men slept on bunks that rose up from the floor. Cables hung from the ceiling and snaked across the walls, bringing energy into the dome using solar power. The base itself is in the shape of a dome with an airlock leading to the outside. \nThe Russian base, Base Gagarin, is incredibly different. They’ve got three buildings that make up the base, the biggest of which is 3,000 square feet. With luxuries like wooden furniture, fresh lemons from Earth, and nutmeg, the Soviet base has everything the Americans lacked. \n"
              },
              {
                "worker_id": "1",
                "uid": "2a5de3150ff94f21a84049f1efcb0fda",
                "response_text": "“The Winning of the Moon” takes place on Earth’s moon, where both the Americans and the Soviets have built domes that house crews for years at a time. There is no oxygen on the moon’s surface, so it’s very important that the crew members have strong suits with plenty of emergency air canisters. In this story, the Soviets’ explosion creates a leak in the Americans’ dome, which poses a major problem. The Americans housed in the dome will die if they cannot fix the leak in a few weeks’ time.\n\nThe Americans’ dome is small and cramped. There is a ton of necessary equipment, and not a lot of room to move around for the four crew members. The men sleep in bunk beds. The Soviets’ dome, however, is much nicer and roomier. Their home is called Base Gagarin, and it’s located about 10 miles away from the Americans. It is much sturdier, and as a result, it does not spring a leak after the purposeful detonation is over with. The Soviet General has a real wooden desk in his office and a real wooden chair, and the norm is to use aluminum furniture. The Soviets have lots of space to move around, and they look down upon the Americans for their less luxurious space. \n\n"
              },
              {
                "worker_id": "3",
                "uid": "3c517552d0524beea53ff661423a4360",
                "response_text": "This story takes place on the moon, where the American mission Freedom 19 has established a base. Their neighbors, so to speak, are the Soviet Union. These bases are ten miles apart, which is a thirty-minute trip by land car. The dome that the Americans live and work in is very small, only 500 square feet, but the Soviets have one large dome and two smaller ones which gives them much more space. It is hot on the surface of the moon in the space suits, so the Americans have to be inside the dome to be able to cool off. "
              },
              {
                "worker_id": "8",
                "uid": "f7f2d3e848ad426a94701e5cfa068f11",
                "response_text": "The story takes place at Freedom 19, an American moonbase. An airlock leads into a five hundred square foot dome on the surface of the moon filled with various kinds of equipment, a table, an air tank, and radio transmitter. The dome is powered by solar cells affixed to the roof. The compact living space includes bunks attached to the walls six feet above the floor. Ten miles from Freedom 19 rests Base Gagarin, the Russian moonbase situated at the bottom of a fold in the moon's surface. The Americans travel to and from Base Gagarin in a small land car for supply runs and meetings. Compared to the cozy quarters of the American base, the Russian base is large and comfortable with three domes instead of one. The main dome has more than three thousand square feet and the smaller two are twelve hundred square feet each. Finogenev's office is one-hundred square feet with a wooden desk and chair. Major Winship envies the comfort in which the Russians live on their base and mentions the presence of a samovar, which they use to boil and dispense hot tea. Winship also believes the Russians chose their heavy, wooden furniture to taunt the Americans since they have access to vast amounts of aluminum and choose wood construction instead. "
              }
            ]
          },
          {
            "question_text": "What is the significance of the seismic test the Russians conduct?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "6",
                "uid": "ba9528a78921460085d46c72bc5d94ed",
                "response_text": "After the Russians conduct their seismic test, a moonquake erupts and tears a leak in the American dome. This leak is significant because it is the first of a series of slightly cataclysmic events. As well, it highlights the strained and tense relationship between the Russians and the Americans. \nMajor Winship accused the Russians of deliberately injuring their base, further showing how contentious their relationship is. General Finogenov ardently denies this, however, and says that their base had no damage at all. \nAfter trying and failing to fix the leak with their own supplies, two of the Americans are forced to travel to Base Gagarin and borrow their resin. This ends up backfiring, however, as the epoxy quickly heats up and explodes as they mix the two components together. The explosion further damages the dome and takes away the American’s entire air supply. \nAs well, the seismic testing was greatly discouraged and protested by the Americans. \n"
              },
              {
                "worker_id": "1",
                "uid": "2a5de3150ff94f21a84049f1efcb0fda",
                "response_text": "The four man American crew on the moon is warned about the Soviets’ underground atomic device and its planned detonation before the test is completed. The Soviets have planned the explosion in order to learn more about the composition of the moon. The shock waves from the explosion should give them information about the various layers of the moon. The Americans protested the underground explosion because they feared that the device’s detonation would disturb their satellite. Although the Americans call their Soviet counterparts to get information about the exact timing of the explosion, the person who answers the phone cannot speak English, so they are unable to learn the Soviets’ specific plans. Major Winship is outside of the American dome when the device is detonated, which is strictly against protocol. The Americans prove that they were right to fight the Soviets about their plan because the dome they live in gets a leak from the shifting surface of the moon. The Soviet General apologizes for the lack of communication and the damage to the Americans’ dome, but their behavior still reads as suspicious. "
              },
              {
                "worker_id": "3",
                "uid": "3c517552d0524beea53ff661423a4360",
                "response_text": "The Soviet Union had conducted a seismic test on the moon by detonating an underground atomic device, but the Americans had warned the Soviets that they shouldn't go through with the tests because of potential dangers. Even though the Americans asked the Soviets not to run the test, they did anyway, and the resulting tremors ruptured the American dome. Not only was the dome leaking air because of this test, but the Americans had to rely on the Soviets for supplies to try to fix it. This only made matters worse, because the materials the Americans borrowed from the Soviets to repair the dome ended up burning out their entire oxygen supply, leaving them stranded without air at the end of the story. In this way, the seismic test shows both the power the Soviets think they hold over the Americans as well as a chance for the Americans to lose emergency supplies as their situation rapidly falls downhill.  "
              },
              {
                "worker_id": "8",
                "uid": "f7f2d3e848ad426a94701e5cfa068f11",
                "response_text": "The Russians claim to conduct the seismic test in order to analyze the resultant shock waves to help them better understand the composition of the moon where they and the American have established bases. Although they insist their purpose is purely scientific, Major Winship suspects they intended the test to harm Freedom 19. The test triggers a few moonquakes, which ultimately causes a leak to appear in the dome. The resulting loss in air pressure leads the crew of the Freedom 19 to attempt a variety of methods to patch the leak. However, they have subpar materials and tools to work with compared with the plentiful resource at Base Gagarin. Lawler and Chandler make their way to the Russian base in order to procure calking that may seal the leak. They return with the calking compound which turns out to be a highly combustible material, which explodes and eliminates the rest of their air supply."
              }
            ]
          },
          {
            "question_text": "Who is Major Winship, and what happens to him throughout the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "6",
                "uid": "ba9528a78921460085d46c72bc5d94ed",
                "response_text": "Major Winship is one of the few Americans who is currently living on base on the surface of the moon. He is in charge as the Commanding Officer of Freedom 19, as he outranks both the Captains and the first Lieutenant. After watching the moonquake shake the surface from inside the base, Major Winship quickly realizes that the quake ripped a hole in the dome itself. He attempts to fix it with a marker, then with a plastic sheet, but both fail. Their caulking compound has hardened and is completely unusable. Winship accuses the Russians of causing the quake and leak on purpose, but the General vehemently denies his claims. They try to call into Earth but realize that without air, there’d be no sound. So, they have to find another way.  \nStuck in his suit until they can restore air to the base, Winship sends Lt. Chandler and Capt. Lawler to ask the Soviets for help. Winship shares a meal with Wilkins, and then the Captain connected to Winship with a series of wires to the radio. This way he’d be able to communicate while in his suit. \nHe suffers a major mistake with the wiring, however, when his air supply is cut off. He motions to Wilkins who saves him, reconnecting the lost cable, and Winship lets those on Earth know what happened. They let him know that they’ve received a formal apology and that they will send a replacement in ten days’ time. \nOnce Chandler and Lawler return, Winship is faced with a new problem: how to mix and activate the 55-gallon fix for the leak. Wilkins creates an electric mixer, and they bring the barrel inside to mix. The barrel becomes red-hot and looks to be on the verge of combustion. The men scramble and get to the airlock. The barrel explodes and the flames use up all the oxygen. Winship is faced with an even greater problem now: how to survive. \n"
              },
              {
                "worker_id": "1",
                "uid": "2a5de3150ff94f21a84049f1efcb0fda",
                "response_text": "Major Winship is the main character in “The Winning of the Moon”, and he faces external and internal conflicts throughout the story. At the beginning of the story, Winship’s spacesuit malfunctions, and the technology that keeps him cool stops working. He begins sweating profusely, and it deeply annoys him. He wants information about the Soviets’ planned explosion, but he cannot learn the timing of the explosion because the person he speaks to at the Soviet base does not speak English. This further frustrates Winship, and he begins to believe that the Soviets are making the Americans’ lives difficult on purpose. He decides to take a risk and exit the dome even though he can’t be totally sure that the device was already detonated. He goes outside to cool himself off, and within moments he feels the ground quaking. When he discovers a leak in the dome, he tries unsuccessfully to patch it up with plastic sheeting. The last thing he wants to do is ask the Soviets for help, so he becomes even more irritated when he learns that the calk the Americans have on hand is busted and will not work to fix the leak.Two of his team members head to the Soviet base to get supplies to fix the leak, but Winship stays behind with his malfunctioning suit. He decides to call Earth to discuss the Soviets’ actions, and while he is on the phone, he realizes that he is using his emergency air supply. He has to motion silently to his colleague, Wilkins, to help him out so that he can breathe. Winship is very frustrated when Lawler and Chandler return to the American base with a 55-gallon drum of calk to fix the small leak, and he once again questions the Soviets’ actions. He has to quickly exit the dome along with the other crew members before the drum explodes after they attempt to ready the concoction for use with an electric mixer. "
              },
              {
                "worker_id": "3",
                "uid": "3c517552d0524beea53ff661423a4360",
                "response_text": "Major Winship is the commanding officer of the mission Freedom 19, the American base on the moon. He runs communications with the Russians who are also on the moon, and is trying to requet information from Pinov, who does not speak English, at the beginning of the story. He is upset with the Russians and does not like them very much, and he thinks they are deliberately making communication difficult. His reefer isn't working and he's boiling in his suit so he insists on going back into the dome to cool off, when he is knocked over by the quake from a seismic test the Russians are doing. He has a spat on the radio with the Russians and complains about the situation as the Americans try to patch the dome. While Capt. Lawler and Lt. Chandler head to the base for supplies, he stays behind in the dome, reflecting on how the American space suits are better than those of the Russians, as he yearns to be able to smoke. After the men return with a drum of calking compound, Winship continues discussing his suspicions that the Soviets ran the test to cause damage to the American base on purpose. After they try to mix the drum indoors, he realizes they have to move it back outside, but soon everything goes wrong. The drum heats up, heating up the air tank in turn, and a flame shoots through the dome, burning through the entire American oxygen supply."
              },
              {
                "worker_id": "8",
                "uid": "f7f2d3e848ad426a94701e5cfa068f11",
                "response_text": "Major Winship is the commander of the four-person crew of the Freedom 19. Suspicious and cynical, Winship envies the luxury in which the crew at Base Gagarin lives. His bitterness manifests in his interactions with everyone from the Russian crew; he grows frustrated and impatient when Pinov cannot speak English. He suspects General Finogenov is lying about the purpose of the atomic test and believes he wants to eliminate the American base from the moon entirely. Winship orders his crew through a series of failed repairs using their inferior resources after the atomic test results in an air leak in the Freedom 19 dome. During his call to Earth to report the explosion damage, he thinks he is dying when his emergency air supply runs out, but Wilkins quickly replaces it. Winship's growing frustration reaches its crescendo when Lawler and Chandler return from their supply run, and the five-person crew struggles to maneuver the large container into the small dome and then further struggle to build a makeshift mixer which with to stir the calking compound. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4480,
        "document_length_chars": 27155
      }
    }
  ]
}