{
  "item_metadata": {
    "item_id": "61263",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61263",
      "content": "\n\n\n\nProduced by Greg Weeks, Mary Meehan and the Online\nDistributed Proofreading Team at http://www.pgdp.net\nCULTURAL EXCHANGE\nBY KEITH LAUMER\nIt was a simple student exchange—but\n   \n  Retief gave them more of\n   \n  an education than they expected!\n \n  [Transcriber's Note: This etext was produced from\n   \n  Worlds of If Science Fiction, September 1962.\n   \n  Extensive research did not uncover any evidence that\n   \n  the U.S. copyright on this publication was renewed.]\nI\n \n  Second Secretary Magnan took his green-lined cape and orange-feathered\nberet from the clothes tree. \"I'm off now, Retief,\" he said. \"I hope\nyou'll manage the administrative routine during my absence without any\nunfortunate incidents.\"\n \n  \"That seems a modest enough hope,\" Retief said. \"I'll try to live up to\nit.\"\n \n  \"I don't appreciate frivolity with reference to this Division,\" Magnan\nsaid testily. \"When I first came here, the Manpower Utilization\nDirectorate, Division of Libraries and Education was a shambles. I\nfancy I've made MUDDLE what it is today. Frankly, I question the\nwisdom of placing you in charge of such a sensitive desk, even for two\nweeks. But remember. Yours is purely a rubber-stamp function.\"\n \n  \"In that case, let's leave it to Miss Furkle. I'll take a couple of\nweeks off myself. With her poundage, she could bring plenty of pressure\nto bear.\"\n \n  \"I assume you jest, Retief,\" Magnan said sadly. \"I should expect even\nyou to appreciate that Bogan participation in the Exchange Program may\nbe the first step toward sublimation of their aggressions into more\ncultivated channels.\"\n \n  \"I see they're sending two thousand students to d'Land,\" Retief said,\nglancing at the Memo for Record. \"That's a sizable sublimation.\"\n \n  Magnan nodded. \"The Bogans have launched no less than four military\ncampaigns in the last two decades. They're known as the Hoodlums of\nthe Nicodemean Cluster. Now, perhaps, we shall see them breaking that\nprecedent and entering into the cultural life of the Galaxy.\"\n \n  \"Breaking and entering,\" Retief said. \"You may have something there.\nBut I'm wondering what they'll study on d'Land. That's an industrial\nworld of the poor but honest variety.\"\n \n  \"Academic details are the affair of the students and their professors,\"\nMagnan said. \"Our function is merely to bring them together. See\nthat you don't antagonize the Bogan representative. This will\nbe an excellent opportunity for you to practice your diplomatic\nrestraint—not your strong point, I'm sure you'll agree.\"\n \n  A buzzer sounded. Retief punched a button. \"What is it, Miss Furkle?\"\n \n  \"That—bucolic person from Lovenbroy is here again.\" On the small desk\nscreen, Miss Furkle's meaty features were compressed in disapproval.\n \n  \"This fellow's a confounded pest. I'll leave him to you, Retief,\"\nMagnan said. \"Tell him something. Get rid of him. And remember: here\nat Corps HQ, all eyes are upon you.\"\n \n  \"If I'd thought of that, I'd have worn my other suit,\" Retief said.\n \n  Magnan snorted and passed from view. Retief punched Miss Furkle's\nbutton.\n \n  \"Send the bucolic person in.\"\nA tall broad man with bronze skin and gray hair, wearing tight trousers\nof heavy cloth, a loose shirt open at the neck and a short jacket,\nstepped into the room. He had a bundle under his arm. He paused at\nsight of Retief, looked him over momentarily, then advanced and held\nout his hand. Retief took it. For a moment the two big men stood, face\nto face. The newcomer's jaw muscles knotted. Then he winced.\n \n  Retief dropped his hand and motioned to a chair.\n \n  \"That's nice knuckle work, mister,\" the stranger said, massaging his\nhand. \"First time anybody ever did that to me. My fault though. I\nstarted it, I guess.\" He grinned and sat down.\n \n  \"What can I do for you?\" Retief said.\n \n  \"You work for this Culture bunch, do you? Funny. I thought they were\nall ribbon-counter boys. Never mind. I'm Hank Arapoulous. I'm a farmer.\nWhat I wanted to see you about was—\" He shifted in his chair. \"Well,\nout on Lovenbroy we've got a serious problem. The wine crop is just\nabout ready. We start picking in another two, three months. Now I don't\nknow if you're familiar with the Bacchus vines we grow...?\"\n \n  \"No,\" Retief said. \"Have a cigar?\" He pushed a box across the desk.\nArapoulous took one. \"Bacchus vines are an unusual crop,\" he said,\npuffing the cigar alight. \"Only mature every twelve years. In between,\nthe vines don't need a lot of attention, so our time's mostly our own.\nWe like to farm, though. Spend a lot of time developing new forms.\nApples the size of a melon—and sweet—\"\n \n  \"Sounds very pleasant,\" Retief said. \"Where does the Libraries and\nEducation Division come in?\"\n \n  Arapoulous leaned forward. \"We go in pretty heavy for the arts. Folks\ncan't spend all their time hybridizing plants. We've turned all the\nland area we've got into parks and farms. Course, we left some sizable\nforest areas for hunting and such. Lovenbroy's a nice place, Mr.\nRetief.\"\n \n  \"It sounds like it, Mr. Arapoulous. Just what—\"\n \n  \"Call me Hank. We've got long seasons back home. Five of 'em. Our\nyear's about eighteen Terry months. Cold as hell in winter; eccentric\norbit, you know. Blue-black sky, stars visible all day. We do mostly\npainting and sculpture in the winter. Then Spring; still plenty cold.\nLots of skiing, bob-sledding, ice skating; and it's the season for\nwoodworkers. Our furniture—\"\n \n  \"I've seen some of your furniture,\" Retief said. \"Beautiful work.\"\n \n  Arapoulous nodded. \"All local timbers too. Lots of metals in our soil\nand those sulphates give the woods some color, I'll tell you. Then\ncomes the Monsoon. Rain—it comes down in sheets. But the sun's getting\ncloser. Shines all the time. Ever seen it pouring rain in the sunshine?\nThat's the music-writing season. Then summer. Summer's hot. We stay\ninside in the daytime and have beach parties all night. Lots of beach\non Lovenbroy; we're mostly islands. That's the drama and symphony time.\nThe theatres are set up on the sand, or anchored off-shore. You have\nthe music and the surf and the bonfires and stars—we're close to the\ncenter of a globular cluster, you know....\"\n \n  \"You say it's time now for the wine crop?\"\n \n  \"That's right. Autumn's our harvest season. Most years we have just the\nordinary crops. Fruit, grain, that kind of thing; getting it in doesn't\ntake long. We spend most of the time on architecture, getting new\nplaces ready for the winter or remodeling the older ones. We spend a\nlot of time in our houses. We like to have them comfortable. But this\nyear's different. This is Wine Year.\"\nArapoulous puffed on his cigar, looked worriedly at Retief. \"Our wine\ncrop is our big money crop,\" he said. \"We make enough to keep us going.\nBut this year....\"\n \n  \"The crop isn't panning out?\"\n \n  \"Oh, the crop's fine. One of the best I can remember. Course, I'm only\ntwenty-eight; I can't remember but two other harvests. The problem's\nnot the crop.\"\n \n  \"Have you lost your markets? That sounds like a matter for the\nCommercial—\"\n \n  \"Lost our markets? Mister, nobody that ever tasted our wines ever\nsettled for anything else!\"\n \n  \"It sounds like I've been missing something,\" said Retief. \"I'll have\nto try them some time.\"\n \n  Arapoulous put his bundle on the desk, pulled off the wrappings. \"No\ntime like the present,\" he said.\n \n  Retief looked at the two squat bottles, one green, one amber, both\ndusty, with faded labels, and blackened corks secured by wire.\n \n  \"Drinking on duty is frowned on in the Corps, Mr. Arapoulous,\" he said.\n \n  \"This isn't\ndrinking\n. It's just wine.\" Arapoulous pulled the wire\nretainer loose, thumbed the cork. It rose slowly, then popped in the\nair. Arapoulous caught it. Aromatic fumes wafted from the bottle.\n\"Besides, my feelings would be hurt if you didn't join me.\" He winked.\n \n  Retief took two thin-walled glasses from a table beside the desk. \"Come\nto think of it, we also have to be careful about violating quaint\nnative customs.\"\n \n  Arapoulous filled the glasses. Retief picked one up, sniffed the deep\nrust-colored fluid, tasted it, then took a healthy swallow. He looked\nat Arapoulous thoughtfully.\n \n  \"Hmmm. It tastes like salted pecans, with an undercurrent of crusted\nport.\"\n \n  \"Don't try to describe it, Mr. Retief,\" Arapoulous said. He took a\nmouthful of wine, swished it around his teeth, swallowed. \"It's Bacchus\nwine, that's all. Nothing like it in the Galaxy.\" He pushed the second\nbottle toward Retief. \"The custom back home is to alternate red wine\nand black.\"\nRetief put aside his cigar, pulled the wires loose, nudged the cork,\ncaught it as it popped up.\n \n  \"Bad luck if you miss the cork,\" Arapoulous said, nodding. \"You\nprobably never heard about the trouble we had on Lovenbroy a few years\nback?\"\n \n  \"Can't say that I did, Hank.\" Retief poured the black wine into two\nfresh glasses. \"Here's to the harvest.\"\n \n  \"We've got plenty of minerals on Lovenbroy,\" Arapoulous said,\nswallowing wine. \"But we don't plan to wreck the landscape mining 'em.\nWe like to farm. About ten years back some neighbors of ours landed a\nforce. They figured they knew better what to do with our minerals than\nwe did. Wanted to strip-mine, smelt ore. We convinced 'em otherwise.\nBut it took a year, and we lost a lot of men.\"\n \n  \"That's too bad,\" Retief said. \"I'd say this one tastes more like roast\nbeef and popcorn over a Riesling base.\"\n \n  \"It put us in a bad spot,\" Arapoulous went on. \"We had to borrow\nmoney from a world called Croanie. Mortgaged our crops. Had to start\nexporting art work too. Plenty of buyers, but it's not the same when\nyou're doing it for strangers.\"\n \n  \"Say, this business of alternating drinks is the real McCoy,\" Retief\nsaid. \"What's the problem? Croanie about to foreclose?\"\n \n  \"Well, the loan's due. The wine crop would put us in the clear. But\nwe need harvest hands. Picking Bacchus grapes isn't a job you can\nturn over to machinery—and anyway we wouldn't if we could. Vintage\nseason is the high point of living on Lovenbroy. Everybody joins in.\nFirst, there's the picking in the fields. Miles and miles of vineyards\ncovering the mountain sides, and crowding the river banks, with gardens\nhere and there. Big vines, eight feet high, loaded with fruit, and deep\ngrass growing between. The wine-carriers keep on the run, bringing wine\nto the pickers. There's prizes for the biggest day's output, bets on\nwho can fill the most baskets in an hour.... The sun's high and bright,\nand it's just cool enough to give you plenty of energy. Come nightfall,\nthe tables are set up in the garden plots, and the feast is laid on:\nroast turkeys, beef, hams, all kinds of fowl. Big salads. Plenty of\nfruit. Fresh-baked bread ... and wine, plenty of wine. The cooking's\ndone by a different crew each night in each garden, and there's prizes\nfor the best crews.\n \n  \"Then the wine-making. We still tramp out the vintage. That's mostly\nfor the young folks but anybody's welcome. That's when things start to\nget loosened up. Matter of fact, pretty near half our young-uns are\nborn after a vintage. All bets are off then. It keeps a fellow on his\ntoes though. Ever tried to hold onto a gal wearing nothing but a layer\nof grape juice?\"\n\"Never did,\" Retief said. \"You say most of the children are born after\na vintage. That would make them only twelve years old by the time—\"\n \n  \"Oh, that's Lovenbroy years; they'd be eighteen, Terry reckoning.\"\n \n  \"I was thinking you looked a little mature for twenty-eight,\" Retief\nsaid.\n \n  \"Forty-two, Terry years,\" Arapoulous said. \"But this year it looks bad.\nWe've got a bumper crop—and we're short-handed. If we don't get a big\nvintage, Croanie steps in. Lord knows what they'll do to the land. Then\nnext vintage time, with them holding half our grape acreage—\"\n \n  \"You hocked the vineyards?\"\n \n  \"Yep. Pretty dumb, huh? But we figured twelve years was a long time.\"\n \n  \"On the whole,\" Retief said, \"I think I prefer the black. But the red\nis hard to beat....\"\n \n  \"What we figured was, maybe you Culture boys could help us out. A loan\nto see us through the vintage, enough to hire extra hands. Then we'd\nrepay it in sculpture, painting, furniture—\"\n \n  \"Sorry, Hank. All we do here is work out itineraries for traveling\nside-shows, that kind of thing. Now, if you needed a troop of Groaci\nnose-flute players—\"\n \n  \"Can they pick grapes?\"\n \n  \"Nope. Anyway, they can't stand the daylight. Have you talked this over\nwith the Labor Office?\"\n \n  \"Sure did. They said they'd fix us up with all the electronics\nspecialists and computer programmers we wanted—but no field hands.\nSaid it was what they classified as menial drudgery; you'd have thought\nI was trying to buy slaves.\"\n \n  The buzzer sounded. Miss Furkle's features appeared on the desk screen.\n \n  \"You're due at the Intergroup Council in five minutes,\" she said. \"Then\nafterwards, there are the Bogan students to meet.\"\n \n  \"Thanks.\" Retief finished his glass, stood. \"I have to run, Hank,\" he\nsaid. \"Let me think this over. Maybe I can come up with something.\nCheck with me day after tomorrow. And you'd better leave the bottles\nhere. Cultural exhibits, you know.\"\nII\n \n  As the council meeting broke up, Retief caught the eye of a colleague\nacross the table.\n \n  \"Mr. Whaffle, you mentioned a shipment going to a place called Croanie.\nWhat are they getting?\"\n \n  Whaffle blinked. \"You're the fellow who's filling in for Magnan, over\nat MUDDLE,\" he said. \"Properly speaking, equipment grants are the\nsole concern of the Motorized Equipment Depot, Division of Loans and\nExchanges.\" He pursed his lips. \"However, I suppose there's no harm in\ntelling you. They'll be receiving heavy mining equipment.\"\n \n  \"Drill rigs, that sort of thing?\"\n \n  \"Strip mining gear.\" Whaffle took a slip of paper from a breast pocket,\nblinked at it. \"Bolo Model WV/1 tractors, to be specific. Why is MUDDLE\ninterested in MEDDLE's activities?\"\n \n  \"Forgive my curiosity, Mr. Whaffle. It's just that Croanie cropped up\nearlier today. It seems she holds a mortgage on some vineyards over\non—\"\n \n  \"That's not MEDDLE's affair, sir,\" Whaffle cut in. \"I have sufficient\nproblems as Chief of MEDDLE without probing into MUDDLE'S business.\"\n \n  \"Speaking of tractors,\" another man put in, \"we over at the Special\nCommittee for Rehabilitation and Overhaul of Under-developed Nations'\nGeneral Economies have been trying for months to get a request for\nmining equipment for d'Land through MEDDLE—\"\n \n  \"SCROUNGE was late on the scene,\" Whaffle said. \"First come, first\nserved. That's our policy at MEDDLE. Good day, gentlemen.\" He strode\noff, briefcase under his arm.\n \n  \"That's the trouble with peaceful worlds,\" the SCROUNGE committeeman\nsaid. \"Boge is a troublemaker, so every agency in the Corps is out\nto pacify her. While my chance to make a record—that is, assist\npeace-loving d'Land—comes to naught.\" He shook his head.\n \n  \"What kind of university do they have on d'Land?\" asked Retief. \"We're\nsending them two thousand exchange students. It must be quite an\ninstitution.\"\n \n  \"University? D'Land has one under-endowed technical college.\"\n \n  \"Will all the exchange students be studying at the Technical College?\"\n \n  \"Two thousand students? Hah! Two\nhundred\nstudents would overtax the\nfacilities of the college.\"\n \n  \"I wonder if the Bogans know that?\"\n \n  \"The Bogans? Why, most of d'Land's difficulties are due to the unwise\ntrade agreement she entered into with Boge. Two thousand students\nindeed!\" He snorted and walked away.\nRetief stopped by the office to pick up a short cape, then rode the\nelevator to the roof of the 230-story Corps HQ building and hailed a\ncab to the port. The Bogan students had arrived early. Retief saw them\nlined up on the ramp waiting to go through customs. It would be half\nan hour before they were cleared through. He turned into the bar and\nordered a beer.\n \n  A tall young fellow on the next stool raised his glass.\n \n  \"Happy days,\" he said.\n \n  \"And nights to match.\"\n \n  \"You said it.\" He gulped half his beer. \"My name's Karsh. Mr. Karsh.\nYep, Mr. Karsh. Boy, this is a drag, sitting around this place\nwaiting....\"\n \n  \"You meeting somebody?\"\n \n  \"Yeah. Bunch of babies. Kids. How they expect—Never mind. Have one on\nme.\"\n \n  \"Thanks. You a Scoutmaster?\"\n \n  \"I'll tell you what I am. I'm a cradle-robber. You know—\" he turned\nto Retief—\"not one of those kids is over eighteen.\" He hiccupped.\n\"Students, you know. Never saw a student with a beard, did you?\"\n \n  \"Lots of times. You're meeting the students, are you?\"\n \n  The young fellow blinked at Retief. \"Oh, you know about it, huh?\"\n \n  \"I represent MUDDLE.\"\n \n  Karsh finished his beer, ordered another. \"I came on ahead. Sort of\nan advance guard for the kids. I trained 'em myself. Treated it like\na game, but they can handle a CSU. Don't know how they'll act under\npressure. If I had my old platoon—\"\n \n  He looked at his beer glass, pushed it back. \"Had enough,\" he said. \"So\nlong, friend. Or are you coming along?\"\n \n  Retief nodded. \"Might as well.\"\nAt the exit to the Customs enclosure, Retief watched as the first of\nthe Bogan students came through, caught sight of Karsh and snapped to\nattention, his chest out.\n \n  \"Drop that, mister,\" Karsh snapped. \"Is that any way for a student to\nact?\"\n \n  The youth, a round-faced lad with broad shoulders, grinned.\n \n  \"Heck, no,\" he said. \"Say, uh, Mr. Karsh, are we gonna get to go to\ntown? We fellas were thinking—\"\n \n  \"You were, hah? You act like a bunch of school kids! I mean ... no! Now\nline up!\"\n \n  \"We have quarters ready for the students,\" Retief said. \"If you'd like\nto bring them around to the west side, I have a couple of copters laid\non.\"\n \n  \"Thanks,\" said Karsh. \"They'll stay here until take-off time. Can't\nhave the little dears wandering around loose. Might get ideas about\ngoing over the hill.\" He hiccupped. \"I mean they might play hookey.\"\n \n  \"We've scheduled your re-embarkation for noon tomorrow. That's a long\nwait. MUDDLE's arranged theater tickets and a dinner.\"\n \n  \"Sorry,\" Karsh said. \"As soon as the baggage gets here, we're off.\" He\nhiccupped again. \"Can't travel without our baggage, y'know.\"\n \n  \"Suit yourself,\" Retief said. \"Where's the baggage now?\"\n \n  \"Coming in aboard a Croanie lighter.\"\n \n  \"Maybe you'd like to arrange for a meal for the students here.\"\n \n  \"Sure,\" Karsh said. \"That's a good idea. Why don't you join us?\" Karsh\nwinked. \"And bring a few beers.\"\n \n  \"Not this time,\" Retief said. He watched the students, still emerging\nfrom Customs. \"They seem to be all boys,\" he commented. \"No female\nstudents?\"\n \n  \"Maybe later,\" Karsh said. \"You know, after we see how the first bunch\nis received.\"\n \n  Back at the MUDDLE office, Retief buzzed Miss Furkle.\n \n  \"Do you know the name of the institution these Bogan students are bound\nfor?\"\n \n  \"Why, the University at d'Land, of course.\"\n \n  \"Would that be the Technical College?\"\n \n  Miss Furkle's mouth puckered. \"I'm sure I've never pried into these\ndetails.\"\n \n  \"Where does doing your job stop and prying begin, Miss Furkle?\" Retief\nsaid. \"Personally, I'm curious as to just what it is these students are\ntravelling so far to study—at Corps expense.\"\n \n  \"Mr. Magnan never—\"\n \n  \"For the present. Miss Furkle, Mr. Magnan is vacationing. That leaves\nme with the question of two thousand young male students headed for\na world with no classrooms for them ... a world in need of tractors.\nBut the tractors are on their way to Croanie, a world under obligation\nto Boge. And Croanie holds a mortgage on the best grape acreage on\nLovenbroy.\"\n \n  \"Well!\" Miss Furkle snapped, small eyes glaring under unplucked brows.\n\"I hope you're not questioning Mr. Magnan's wisdom!\"\n \n  \"About Mr. Magnan's wisdom there can be no question,\" Retief said. \"But\nnever mind. I'd like you to look up an item for me. How many tractors\nwill Croanie be getting under the MEDDLE program?\"\n \n  \"Why, that's entirely MEDDLE business,\" Miss Furkle said. \"Mr. Magnan\nalways—\"\n \n  \"I'm sure he did. Let me know about the tractors as soon as you can.\"\nMiss Furkle sniffed and disappeared from the screen. Retief left the\noffice, descended forty-one stories, followed a corridor to the Corps\nLibrary. In the stacks he thumbed through catalogues, pored over\nindices.\n \n  \"Can I help you?\" someone chirped. A tiny librarian stood at his elbow.\n \n  \"Thank you, ma'am,\" Retief said. \"I'm looking for information on a\nmining rig. A Bolo model WV tractor.\"\n \n  \"You won't find it in the industrial section,\" the librarian said.\n\"Come along.\" Retief followed her along the stacks to a well-lit\nsection lettered ARMAMENTS. She took a tape from the shelf, plugged\nit into the viewer, flipped through and stopped at a squat armored\nvehicle.\n \n  \"That's the model WV,\" she said. \"It's what is known as a continental\nsiege unit. It carries four men, with a half-megaton/second firepower.\"\n \n  \"There must be an error somewhere,\" Retief said. \"The Bolo model I want\nis a tractor. Model WV M-1—\"\n\"Oh, the modification was the addition of a bulldozer blade for\ndemolition work. That must be what confused you.\"\n \n  \"Probably—among other things. Thank you.\"\n \n  Miss Furkle was waiting at the office. \"I have the information you\nwanted,\" she said. \"I've had it for over ten minutes. I was under the\nimpression you needed it urgently, and I went to great lengths—\"\n \n  \"Sure,\" Retief said. \"Shoot. How many tractors?\"\n \n  \"Five hundred.\"\n \n  \"Are you sure?\"\n \n  Miss Furkle's chins quivered. \"Well! If you feel I'm incompetent—\"\n \n  \"Just questioning the possibility of a mistake, Miss Furkle. Five\nhundred tractors is a lot of equipment.\"\n \n  \"Was there anything further?\" Miss Furkle inquired frigidly.\n \n  \"I sincerely hope not,\" Retief said.\nIII\n \n  Leaning back in Magnan's padded chair with power swivel and\nhip-u-matic concontour, Retief leafed through a folder labelled \"CERP\n7-602-Ba; CROANIE (general).\" He paused at a page headed Industry.\n \n  Still reading, he opened the desk drawer, took out the two bottles of\nBacchus wine and two glasses. He poured an inch of wine into each and\nsipped the black wine meditatively.\n \n  It would be a pity, he reflected, if anything should interfere with the\nproduction of such vintages....\n \n  Half an hour later he laid the folder aside, keyed the phone and put\nthrough a call to the Croanie Legation. He asked for the Commercial\nAttache.\n \n  \"Retief here, Corps HQ,\" he said airily. \"About the MEDDLE shipment,\nthe tractors. I'm wondering if there's been a slip up. My records show\nwe're shipping five hundred units....\"\n \n  \"That's correct. Five hundred.\"\n \n  Retief waited.\n \n  \"Ah ... are you there, Retief?\"\n \n  \"I'm still here. And I'm still wondering about the five hundred\ntractors.\"\n \n  \"It's perfectly in order. I thought it was all settled. Mr. Whaffle—\"\n \n  \"One unit would require a good-sized plant to handle its output,\"\nRetief said. \"Now Croanie subsists on her fisheries. She has perhaps\nhalf a dozen pint-sized processing plants. Maybe, in a bind, they\ncould handle the ore ten WV's could scrape up ... if Croanie had any\nore. It doesn't. By the way, isn't a WV a poor choice as a mining\noutfit? I should think—\"\n \n  \"See here, Retief! Why all this interest in a few surplus tractors?\nAnd in any event, what business is it of yours how we plan to use the\nequipment? That's an internal affair of my government. Mr. Whaffle—\"\n \n  \"I'm not Mr. Whaffle. What are you going to do with the other four\nhundred and ninety tractors?\"\n \n  \"I understood the grant was to be with no strings attached!\"\n \n  \"I know it's bad manners to ask questions. It's an old diplomatic\ntradition that any time you can get anybody to accept anything as a\ngift, you've scored points in the game. But if Croanie has some scheme\ncooking—\"\n\"Nothing like that, Retief. It's a mere business transaction.\"\n \n  \"What kind of business do you do with a Bolo WV? With or without a\nblade attached, it's what's known as a continental siege unit.\"\n \n  \"Great Heavens, Retief! Don't jump to conclusions! Would you have us\nbranded as warmongers? Frankly—is this a closed line?\"\n \n  \"Certainly. You may speak freely.\"\n \n  \"The tractors are for transshipment. We've gotten ourselves into a\ndifficult situation, balance-of-payments-wise. This is an accommodation\nto a group with which we have rather strong business ties.\"\n \n  \"I understand you hold a mortgage on the best land on Lovenbroy,\"\nRetief said. \"Any connection?\"\n \n  \"Why ... ah ... no. Of course not, ha ha.\"\n \n  \"Who gets the tractors eventually?\"\n \n  \"Retief, this is unwarranted interference!\"\n \n  \"Who gets them?\"\n \n  \"They happen to be going to Lovenbroy. But I scarcely see—\"\n \n  \"And who's the friend you're helping out with an unauthorized\ntransshipment of grant material?\"\n \n  \"Why ... ah ... I've been working with a Mr. Gulver, a Bogan\nrepresentative.\"\n \n  \"And when will they be shipped?\"\n \n  \"Why, they went out a week ago. They'll be half way there by now. But\nlook here, Retief, this isn't what you're thinking!\"\n \n  \"How do you know what I'm thinking? I don't know myself.\" Retief rang\noff, buzzed the secretary.\n \n  \"Miss Furkle, I'd like to be notified immediately of any new\napplications that might come in from the Bogan Consulate for placement\nof students.\"\n \n  \"Well, it happens, by coincidence, that I have an application here now.\nMr. Gulver of the Consulate brought it in.\"\n \n  \"Is Mr. Gulver in the office? I'd like to see him.\"\n \n  \"I'll ask him if he has time.\"\n \n  \"Great. Thanks.\" It was half a minute before a thick-necked red-faced\nman in a tight hat walked in. He wore an old-fashioned suit, a drab\nshirt, shiny shoes with round toes and an ill-tempered expression.\n\"What is it you wish?\" he barked. \"I understood in my discussions with\nthe other ... ah ... civilian there'd be no further need for these\nirritating conferences.\"\n \n  \"I've just learned you're placing more students abroad, Mr. Gulver. How\nmany this time?\"\n \n  \"Two thousand.\"\n \n  \"And where will they be going?\"\n \n  \"Croanie. It's all in the application form I've handed in. Your job is\nto provide transportation.\"\n \n  \"Will there be any other students embarking this season?\"\n \n  \"Why ... perhaps. That's Boge's business.\" Gulver looked at Retief with\npursed lips. \"As a matter of fact, we had in mind dispatching another\ntwo thousand to Featherweight.\"\n \n  \"Another under-populated world—and in the same cluster, I believe,\"\nRetief said. \"Your people must be unusually interested in that region\nof space.\"\n \n  \"If that's all you wanted to know, I'll be on my way. I have matters of\nimportance to see to.\"\n \n  After Gulver left, Retief called Miss Furkle in. \"I'd like to have a\nbreak-out of all the student movements that have been planned under the\npresent program,\" he said. \"And see if you can get a summary of what\nMEDDLE has been shipping lately.\"\n \n  Miss Furkle compressed her lips. \"If Mr. Magnan were here, I'm sure\nhe wouldn't dream of interfering in the work of other departments.\nI ... overheard your conversation with the gentleman from the Croanie\nLegation—\"\n \n  \"The lists, Miss Furkle.\"\n \n  \"I'm not accustomed,\" Miss Furkle said, \"to intruding in matters\noutside our interest cluster.\"\n \n  \"That's worse than listening in on phone conversations, eh? But never\nmind. I need the information, Miss Furkle.\"\n \n  \"Loyalty to my Chief—\"\n \n  \"Loyalty to your pay-check should send you scuttling for the material\nI've asked for,\" Retief said. \"I'm taking full responsibility. Now\nscat.\"\n \n  The buzzer sounded. Retief flipped a key. \"MUDDLE, Retief speaking....\"\n \n  Arapoulous's brown face appeared on the desk screen.\n \n  \"How-do, Retief. Okay if I come up?\"\n \n  \"Sure, Hank. I want to talk to you.\"\n \n  In the office, Arapoulous took a chair. \"Sorry if I'm rushing you,\nRetief,\" he said. \"But have you got anything for me?\"\n \n  Retief waved at the wine bottles. \"What do you know about Croanie?\"\n \n  \"Croanie? Not much of a place. Mostly ocean. All right if you like\nfish, I guess. We import our seafood from there. Nice prawns in monsoon\ntime. Over a foot long.\"\n \n  \"You on good terms with them?\"\n \n  \"Sure, I guess so. Course, they're pretty thick with Boge.\"\n \n  \"So?\"\n \n  \"Didn't I tell you? Boge was the bunch that tried to take us over here\na dozen years back. They'd've made it too, if they hadn't had a lot of\nbad luck. Their armor went in the drink, and without armor they're easy\ngame.\"\n \n  Miss Furkle buzzed. \"I have your lists,\" she said shortly.\n \n  \"Bring them in, please.\"\nThe secretary placed the papers on the desk. Arapoulous caught her eye\nand grinned. She sniffed and marched from the room.\n \n  \"What that gal needs is a slippery time in the grape mash,\" Arapoulous\nobserved. Retief thumbed through the papers, pausing to read from time\nto time. He finished and looked at Arapoulous.\n \n  \"How many men do you need for the harvest, Hank?\" Retief inquired.\n \n  Arapoulous sniffed his wine glass and looked thoughtful.\n \n  \"A hundred would help,\" he said. \"A thousand would be better. Cheers.\"\n \n  \"What would you say to two thousand?\"\n \n  \"Two thousand? Retief, you're not fooling?\"\n \n  \"I hope not.\" He picked up the phone, called the Port Authority, asked\nfor the dispatch clerk.\n \n  \"Hello, Jim. Say, I have a favor to ask of you. You know that\ncontingent of Bogan students. They're traveling aboard the two CDT\ntransports. I'm interested in the baggage that goes with the students.\nHas it arrived yet? Okay, I'll wait.\"\n \n  Jim came back to the phone. \"Yeah, Retief, it's here. Just arrived.\nBut there's a funny thing. It's not consigned to d'Land. It's ticketed\nclear through to Lovenbroy.\"\n \n  \"Listen, Jim,\" Retief said. \"I want you to go over to the warehouse and\ntake a look at that baggage for me.\"\n \n  Retief waited while the dispatch clerk carried out the errand. The\nlevel in the two bottles had gone down an inch when Jim returned to\nthe phone.\n \n  \"Hey, I took a look at that baggage, Retief. Something funny going on.\nGuns. 2mm needlers, Mark XII hand blasters, power pistols—\"\n \n  \"It's okay, Jim. Nothing to worry about. Just a mix-up. Now, Jim,\nI'm going to ask you to do something more for me. I'm covering for a\nfriend. It seems he slipped up. I wouldn't want word to get out, you\nunderstand. I'll send along a written change order in the morning that\nwill cover you officially. Meanwhile, here's what I want you to do....\"\n \n  Retief gave instructions, then rang off and turned to Arapoulous.\n \n  \"As soon as I get off a couple of TWX's, I think we'd better get down\nto the port, Hank. I think I'd like to see the students off personally.\"\nIV\n \n  Karsh met Retief as he entered the Departures enclosure at the port.\n \n  \"What's going on here?\" he demanded. \"There's some funny business with\nmy baggage consignment. They won't let me see it! I've got a feeling\nit's not being loaded.\"\n \n  \"You'd better hurry, Mr. Karsh,\" Retief said. \"You're scheduled to\nblast off in less than an hour. Are the students all loaded?\"\n \n  \"Yes, blast you! What about my baggage? Those vessels aren't moving\nwithout it!\"\n \n  \"No need to get so upset about a few toothbrushes, is there, Mr.\nKarsh?\" Retief said blandly. \"Still, if you're worried—\" He turned to\nArapoulous.\n \n  \"Hank, why don't you walk Mr. Karsh over to the warehouse and ...\nah ... take care of him?\"\n \n  \"I know just how to handle it,\" Arapoulous said.\n \n  The dispatch clerk came up to Retief. \"I caught the tractor equipment,\"\nhe said. \"Funny kind of mistake, but it's okay now. They're being\noff-loaded at d'Land. I talked to the traffic controller there. He said\nthey weren't looking for any students.\"\n \n  \"The labels got switched, Jim. The students go where the baggage was\nconsigned. Too bad about the mistake, but the Armaments Office will\nhave a man along in a little while to dispose of the guns. Keep an eye\nout for the luggage. No telling where it's gotten to.\"\n \n  \"Here!\" a hoarse voice yelled. Retief turned. A disheveled figure in a\ntight hat was crossing the enclosure, arms waving.\n \n  \"Hi there, Mr. Gulver,\" Retief called. \"How's Boge's business coming\nalong?\"\n \n  \"Piracy!\" Gulver blurted as he came up to Retief, puffing hard. \"You've\ngot a hand in this, I don't doubt! Where's that Magnan fellow?\"\n \n  \"What seems to be the problem?\" Retief said.\n \n  \"Hold those transports! I've just been notified that the baggage\nshipment has been impounded. I'll remind you, that shipment enjoys\ndiplomatic free entry!\"\n \n  \"Who told you it was impounded?\"\n \n  \"Never mind! I have my sources!\"\n \n  Two tall men buttoned into gray tunics came up. \"Are you Mr. Retief of\nCDT?\" one said.\n \n  \"That's right.\"\n \n  \"What about my baggage!\" Gulver cut in. \"And I'm warning you, if those\nships lift without—\"\n \n  \"These gentlemen are from the Armaments Control Commission,\" Retief\nsaid. \"Would you like to come along and claim your baggage, Mr. Gulver?\"\n \n  \"From where? I—\" Gulver turned two shades redder about the ears.\n\"Armaments?\"\n \n  \"The only shipment I've held up seems to be somebody's arsenal,\" Retief\nsaid. \"Now if you claim this is your baggage....\"\n \n  \"Why, impossible,\" Gulver said in a strained voice. \"Armaments?\nRidiculous. There's been an error....\"\nAt the baggage warehouse Gulver looked glumly at the opened cases of\nguns. \"No, of course not,\" he said dully. \"Not my baggage. Not my\nbaggage at all.\"\n \n  Arapoulous appeared, supporting the stumbling figure of Mr. Karsh.\n \n  \"What—what's this?\" Gulver spluttered. \"Karsh? What's happened?\"\n \n  \"He had a little fall. He'll be okay,\" Arapoulous said.\n \n  \"You'd better help him to the ship,\" Retief said. \"It's ready to lift.\nWe wouldn't want him to miss it.\"\n \n  \"Leave him to me!\" Gulver snapped, his eyes slashing at Karsh. \"I'll\nsee he's dealt with.\"\n \n  \"I couldn't think of it,\" Retief said. \"He's a guest of the Corps, you\nknow. We'll see him safely aboard.\"\n \n  Gulver turned, signaled frantically. Three heavy-set men in identical\ndrab suits detached themselves from the wall, crossed to the group.\n \n  \"Take this man,\" Gulver snapped, indicating Karsh, who looked at him\ndazedly, reached up to rub his head.\n \n  \"We take our hospitality seriously,\" Retief said. \"We'll see him aboard\nthe vessel.\"\n \n  Gulver opened his mouth.\n \n  \"I know you feel bad about finding guns instead of school books in\nyour luggage,\" Retief said, looking Gulver in the eye. \"You'll be busy\nstraightening out the details of the mix-up. You'll want to avoid\nfurther complications.\"\n \n  \"Ah. Ulp. Yes,\" Gulver said. He appeared unhappy.\n \n  Arapoulous went on to the passenger conveyor, turned to wave.\n \n  \"Your man—he's going too?\" Gulver blurted.\n \n  \"He's not our man, properly speaking,\" Retief said. \"He lives on\nLovenbroy.\"\n \n  \"Lovenbroy?\" Gulver choked. \"But ... the ... I....\"\n \n  \"I know you said the students were bound for d'Land,\" Retief said. \"But\nI guess that was just another aspect of the general confusion. The\ncourse plugged into the navigators was to Lovenbroy. You'll be glad to\nknow they're still headed there—even without the baggage.\"\n \n  \"Perhaps,\" Gulver said grimly, \"perhaps they'll manage without it.\"\n \n  \"By the way,\" Retief said. \"There was another funny mix-up. There\nwere some tractors—for industrial use, you'll recall. I believe you\nco-operated with Croanie in arranging the grant through MEDDLE. They\nwere erroneously consigned to Lovenbroy, a purely agricultural world. I\nsaved you some embarrassment, I trust, Mr. Gulver, by arranging to have\nthem off-loaded at d'Land.\"\n \n  \"D'Land! You've put the CSU's in the hands of Boge's bitterest enemies!\"\n \n  \"But they're only tractors, Mr. Gulver. Peaceful devices. Isn't that\ncorrect?\"\n \n  \"That's ... correct.\" Gulver sagged. Then he snapped erect. \"Hold the\nships!\" he yelled. \"I'm canceling the student exchange—\"\n \n  His voice was drowned by the rumble as the first of the monster\ntransports rose from the launch pit, followed a moment later by the\nsecond, Retief watched them out of sight, then turned to Gulver.\n \n  \"They're off,\" he said. \"Let's hope they get a liberal education.\"\nV\n \n  Retief lay on his back in deep grass by a stream, eating grapes. A tall\nfigure appeared on the knoll above him and waved.\n \n  \"Retief!\" Hank Arapoulous bounded down the slope and embraced Retief,\nslapping him on the back. \"I heard you were here—and I've got news\nfor you. You won the final day's picking competition. Over two hundred\nbushels! That's a record!\"\n \n  \"Let's get on over to the garden. Sounds like the celebration's about\nto start.\"\n \n  In the flower-crowded park among the stripped vines, Retief and\nArapoulous made their way to a laden table under the lanterns. A tall\ngirl dressed in loose white, and with long golden hair, came up to\nArapoulous.\n \n  \"Delinda, this is Retief—today's winner. And he's also the fellow that\ngot those workers for us.\"\n \n  Delinda smiled at Retief. \"I've heard about you, Mr. Retief. We\nweren't sure about the boys at first. Two thousand Bogans, and all\nconfused about their baggage that went astray. But they seemed to like\nthe picking.\" She smiled again.\n \n  \"That's not all. Our gals liked the boys,\" Hank said. \"Even Bogans\naren't so bad, minus their irons. A lot of 'em will be staying on. But\nhow come you didn't tell me you were coming, Retief? I'd have laid on\nsome kind of big welcome.\"\n \n  \"I liked the welcome I got. And I didn't have much notice. Mr. Magnan\nwas a little upset when he got back. It seems I exceeded my authority.\"\n \n  Arapoulous laughed. \"I had a feeling you were wheeling pretty free,\nRetief. I hope you didn't get into any trouble over it.\"\n \n  \"No trouble,\" Retief said. \"A few people were a little unhappy with\nme. It seems I'm not ready for important assignments at Departmental\nlevel. I was shipped off here to the boondocks to get a little more\nexperience.\"\n \n  \"Delinda, look after Retief,\" said Arapoulous. \"I'll see you later.\nI've got to see to the wine judging.\" He disappeared in the crowd.\n \n  \"Congratulations on winning the day,\" said Delinda. \"I noticed you at\nwork. You were wonderful. I'm glad you're going to have the prize.\"\n \n  \"Thanks. I noticed you too, flitting around in that white nightie of\nyours. But why weren't you picking grapes with the rest of us?\"\n \n  \"I had a special assignment.\"\n \n  \"Too bad. You should have had a chance at the prize.\"\n \n  Delinda took Retief's hand. \"I wouldn't have anyway,\" she said. \"I'm\nthe prize.\"\n",
      "metadata": {
        "title": "Cultural Exchange",
        "author": "Keith Laumer",
        "passage_id": "61263",
        "uid": "3ca15c335843477eaa38ed31980680be",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "2",
                "uid": "18c9c61e7ecc4132b9ef185ffceda36f",
                "response_text": "Second Secretary Magnan will be away from the Manpower Utilization Directorate, Division of Libraries and Education (MUDDLE) for two weeks, leaving Retief in charge. Magnan reminds Retief that his role is to act as a rubber stamp, continuing Magnan’s actions. Magnan points out that Retief should appreciate that Bogan is participating in the Exchange Program. Its participation might be a step toward sublimating their aggression into more cultivated channels. The Bogans are sending two thousand students to d’Land as exchange students, and Magnan thinks this might end their aggression and bring them into the cultural life of the Galaxy. Retief wonders aloud what the students will study in such a poor, industrial land. Magnan points out that this is none of Retief’s concern and that his role is simply to facilitate bringing the two groups together. When Miss Furkle, the secretary, buzzes Magnan that the bucolic person from Lovenbroy is there again, Magnan pushes the meeting off onto Retief.\n\nThe person from Lovenbroy is named Hank Arapoulous. He is a farmer and tells Retief that the Bacchus vines that they use to make their wine mature every twelve years and that this year is a harvest year, but they are short on workers to harvest the grapes. They have a shortage of workers for the harvest due to their conflict over strip mining and the loss of several of their young men in the battles to prevent it. Also, Lovenbroy had to borrow money from Croanie, and the loan was due. The wine crop will put them in the clear if they can harvest it. The biggest concern is what Croanie will do with the land if they can’t pay the loan; Lovenbroy has offered half its grape acreage as security for the loan it received. Hank asks Retief for a loan, but Retief tells him that MEDDLE’s role is only for transportation. Hank says he also checked with the Labor Office, but it only offered to set them up with machinery. \n\nRetief attends a council meeting and learns that Croanie will receive a shipment of strip mining equipment. A spokesman for the Special Committee for Rehabilitation and Overhaul of Under-developed Nations’ General Economies (SCROUNGE) indicates he has been trying to get mining equipment for d’Land. He tells Retief that Boge is a troublemaker, so all the agencies in the Corps are trying to appease her. Upon further discussion, Retief learns that d’Land doesn’t have a university for the exchange students to attend, just a technical college that would be overwhelmed to receive 200, much less 2,000, students. \n\nRetief also learns that all the exchange students are males, and their “luggage” is full of weapons. He diverts their luggage and sends the exchange students to Lovenbroy, where they help harvest the grapes. Retief is also sent to Lovenbroy for exceeding his authority. Hank tells Retief that he has won the prize for the picking competition. The prize is a girl named Delinda.\n\n"
              },
              {
                "worker_id": "9",
                "uid": "5eecd525b99b4c098873d1b84d8594ef",
                "response_text": "Retief is left in charge of his division while his superior, Magnan, is out of the office. After a farmer from the planet Lovenbroy tries to enlist his help with a labor shortage, Retief realizes a complex plot has been set into motion by the government of the planet Boge. The Bogans are sending two-thousand students to the planet D’Land, except there’s no school to accommodate them there and they’re not actually students but soldiers. They’ve also arranged to have weapons and war vehicles shipped under the guise of student baggage and tractors. Boge is using the financial leverage they have with the planet Croanie to get them to help with these shipments, and to ultimately allow the Bogans to take over Lovenbroy (a planet in debt to Lovenbroy that Boge has tried and failed to conquer in the past), D’Land, and potentially another planet. After Retief uncovers how all of these plans and planets are connected, he moves to disrupt them. He reroutes the “students” to Lovenbroy to help with their grape harvest and allow them to get out of their debt to Croanie, and the war machines to D’Land where they’ll be out of Bogan hands. The end of the story finds Retief on Lovenbroy, where he has been sent because his superiors aren’t happy that he meddled with the Bogan situation. Retief doesn’t seem to mind his exile to Lovenbroy at all, as he has just won the grape harvest competition and met the beautiful woman who claims to be his prize. \n"
              },
              {
                "worker_id": "6",
                "uid": "89f91bacbaa542399d95ad7cd50f72ef",
                "response_text": "\tAfter Second Secretary Magnan took his temporary leave of the Manpower Utilization Directorate, Division of Libraries and Education (AKA MUDDLE), Retief, his subordinate, is put in charge. Retief’s first order of business is dealing with Hank Arapoulous who came to MUDDLE to ask for some help harvesting the Bacchus grapes. He shares that they are indebted to Croanie, who loaned them funds after a failed invasion from the Bogans. Arapoulous is worried that the Croanie’s will be able to come in and harvest the grapes (as well as take the land) for themselves if they can’t pay the debt since they hold the mortgage on some of the acreage. After sharing some wine (alternating between red and black), Retief agrees to try and see if he can send some helping hands to Lovenbroy, Arapoulous’ home planet. \n\tRetief soon discovers that MEDDLE, another division at the Manpower Utilization Director, has authorized a shipment of 500 tractors that will be sent to Croanie. Retief questions Mr. Whaffle about it, and he explains that they are in need of heavy mining equipment. However, Croanie is mostly made up of fisheries, so there’s nothing to mine there. Retief questions other shipments as well, including the authorized transport of 2,000 Bogan students to d’Land. He discovers that there is only one technical college on d’Land and that it would be overwhelmed with just 200 transfer students. As well, Boge and d’Land have a very tense relationship; such a trade would be very rare. Sensing something fishy, Retief continues his search. \n\tOn his way to greet the incoming students, Retief stops at a bar and meets their teacher, Mr. Karsh. He describes training them as if they were in the military, not as if they were students. They leave together to meet the students. Retief arranged for a variety of fun events for the students, but Mr. Karsh shuts it all down. He simply wants to know when their luggage, flying in on a Croanie ship, will get in and when they will leave. \n\tQuickly, their plot falls apart as Retief researches these tractors and discovers they are machines built for war. After interrogating Mr. Whaffle about the shipment, he discovers that the tractors are going to Lovenbroy. He speaks to Mr. Gulver, a Bogan representative, who reveals that he just submitted an application for transportation for another 2,000 students. Retief then discovers the student’s luggage was bound for Lovenbroy and filled with army-grade weaponry. Putting it all together, Retief sends the students to Lovenbroy without their weapons, hands Mr. Karsh off to Arapoulous for a frank talking to, and sends the tractors to d’Land. The plan now thwarted, the students help harvest the Bacchus grapes. \n\tRetief was sent to Lovenbroy as punishment. He joins the harvest and ends up picking the most grapes of them all. His prize is a beautiful blonde woman. \n"
              },
              {
                "worker_id": "8",
                "uid": "ce65bca558e94733a2a713d042040902",
                "response_text": "Corps HQ is a diplomatic entity that houses a number of intergalactic departments, including the Manpower Utilization Directorate, Division of Libraries and Education (MUDDLE), which employs the story’s protagonist, Retief. Retief reports to Second Secretary Magnan, who is taking some time off and asks Retief to manage affairs in his absence. He reminds Retief of a group of students from the planet Boge who will be traveling to the planet d’Land as part of an Exchange Program. Magnan’s hope is this program will help the warring Bogans better assimilate into the Galaxy’s culture. While he is gone, Retief meets with a man named Hank Arapoulous, who represents a planet called Lovenbroy, known for its plentiful grape harvests. Over wine, Hank requests labor to harvest the crop essential to their livelihood on Lovenbroy, and Retief learns of their connection to a planet called Croanie. Several years ago, the farmers of Lovenbroy had to defend their mineral resources against their neighbors, and they lost a lot of money and men in the process. Therefore, they had to borrow money from Croanie, and Hank is afraid they won’t be able to pay their debt on time without enough hands to harvest their grape crop. In addition, in their desperation, the farmers of Lovenbroy pawned the mortgage of their vineyards to Croanie thinking the twelve-year crop rotation would buy them enough time to pay back their debts. Retief says he will try to find a solution to his problem, and he sets about to attend the Intergroup Council and meet with the Bogan students set to depart for d’Land. At the Council meeting, he learns Croanie is set to receive a shipment of mining equipment from the Corps, and the school on d’Land set to receive the 2,000 Bogan students could hardly accommodate 200. At a bar later, Retief meets a man named Karsh, who drunkenly reveals he is training the students for something other than studying. At the library later, Retief learns that the tractors being sent to Croanie are not mining equipment, but are heavily armored with firepower. When Retief questions why so many tractors are being sent to a planet without the capacity to process them, he learns the excess will be sent to Boge. Retief deduces the entire situation is a Bogan plot to send troops to d’Land and have Croanie provide the military equipment sourced from Corps grants. Instead, Retief has representatives from Armaments confiscate the students’ luggage (which are actually filled with guns) and sends the “students” to Lovenbroy instead, where they help the farmers harvest their grape crop. Later, on Lovenbroy, Retief wins the grape-picking competition and celebrates with a local woman named Delinda, his prize for winning."
              }
            ]
          },
          {
            "question_text": "Who are the Bogans, and what happens to their plan?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "2",
                "uid": "18c9c61e7ecc4132b9ef185ffceda36f",
                "response_text": "The Bogans are people who have a history of aggression within the Nicodemean Cluster. In the last twenty years, they have launched four military campaigns against other Galaxy members; because of this, they are known as the Hoodlums of the Nicodemean Cluster. They have agreed to send 2,000 of their students to participate in the Exchange Program in d’Land that the Manpower Utilization Directorate, Division of Libraries and Education is facilitating. This agreement is a curiosity to Retief because d’Land is a poor, industrial society, so he wonders what the Bogans will study there. His superior, Second Secretary Magnan, tells him that is none of his business and to be sure not to antagonize the Bogan representative. According to the Special Committee for Rehabilitation and Overhaul of Underdeveloped Nations’ General Economies (SCROUNGE) committeeman, every agency in the Corps is trying to appease Boge since Boge is a well-known troublemaker. He also informs Retief that d’Land has no universities, just an under-endowed technical college that could not handle 200, much less 2,000, exchange students. He also tells Retief that most of d’Land’s problems result from an unwise trade agreement that it made with Boge.\n\n Retief meets Karsh, a Scoutmaster who trained the Bogan students; he made it like a game but says they know how to handle a CSU. As the Bogan students come through Customs and see Mr. Karsh, they snap to attention. Mr. Karsh refuses to let the students leave the airport. Retief notices that all the exchange students are males, and Karsh tells him they wanted to see how the first group of students was received before sending any females. Retief realizes that Bogan students are headed to a place that has no classrooms for the students. In the meantime, the tractors are being sent to Croanie, a world under obligation to Boge, and Croanie holds the mortgage to the best vineyards in Lovenbroy. Retief looks up the tractors that are being sent to Croanie and discovers they are armored vehicles with a half-megaton per second firepower. Retief learns that these continental siege units are ultimately being sent to Lovenbroy, which is rich in minerals, on behalf of Boge. Retief also learns that Boge has an application to send another 2,000 students to Croanie and is considering sending 2,000 more to Featherweight. Retief learns that Boge tried to take over Lovenbroy several years earlier and would have succeeded if not for bad luck. Retief calls a friend who works in transport and learns that the Bogan students’ luggage is all being sent to Lovenbroy, and when he looked in the luggage, it was all weapons. Retief diverts the luggage and sends the students on to Lovenbroy to help with the grape harvest for the vineyards. He impounds the luggage full of weapons.\n\n"
              },
              {
                "worker_id": "9",
                "uid": "5eecd525b99b4c098873d1b84d8594ef",
                "response_text": "The Bogans are the people from the planet Boge. According to Retief’s superior, they are known as the “hoodlums” of the nearby universe and have launched multiple military campaigns in the recent past. Despite this, no one seems to suspect the Bogans when they claim to be participating in a “cultural exchange”.  They plan to send “students” who are really intended to be soldiers and guns to D’Land, a planet that loves peace but isn’t on good terms with Boge. Another planet, Croanie, has fallen into debt to Boge and is facilitating a transshipment of “tractors” that are actually devices only useful for war or mining, making it seem like they might also be looking to take over Lovenbroy (which they tried, unsuccessfully, to do in the past, as well as another small nearby planet referenced in the story, Featherweight. Their plans are thwarted by Retief when he figures out what they are up to and reroutes the weaponry to D’Land and the students to Lovenbroy. \n"
              },
              {
                "worker_id": "6",
                "uid": "89f91bacbaa542399d95ad7cd50f72ef",
                "response_text": "\tThe Bogans are the people of Boge, a planet that lies in the same cluster as Lovenbroy and Croanie. The Bogans attempted to invade Lovenbroy ten years back, and, though they managed to fight for one year, they were eventually defeated. Their goal was to mine the land for the rich minerals that lay below the surface. \n\tAfter scheming with Croanie (who loaned money and resources to Lovenbroy post-war), the Bogans were able to develop a plan to finally invade Lovenbroy successfully. By using grants and a ploy of educating 2,000 of their students, the Bogans were almost able to ship 2,000 male soldiers to Lovenbroy with an array of weaponry in their duffel bags. The Bogans lied and said that they were sending these “students” to d’Land to study there at the university. As well, Croanie aided them in acquiring 500 death tractors. These Bolo WV M-1s are incredibly dangerous tanks that can travel extremely fast and are outfitted with a bulldozer blade. Thanks to this added blade, they were able to market them as simply tractors, not the weapons of war they truly are. The tractors were on their way to Lovenbroy when Retief caught wind of their plan and stopped their shipment. He sent them to d’Land instead, an enemy of the Bogans. \n\tRetief further destroyed their plan by sending the trained boys to Lovenbroy without their weaponry. He sent them to this beautiful planet so they could help Arapoulous in harvesting the Bacchus grapes. Fully thwarted and upset, Mr. Gulver, the Bogan representative, admits defeat and somehow escapes any true diplomatic punishment. \n"
              },
              {
                "worker_id": "8",
                "uid": "ce65bca558e94733a2a713d042040902",
                "response_text": "The Bogans are a warring people from the planet Boge who have started four wars in the past twenty years throughout the galaxy. Because of their warlike tendencies, the Corps bends over backward to work with them to restore diplomacy to the galaxy. Boge has a trade agreement with the small, underpopulated planet of d’Land, which they use to their advantage in hatching their plan to overtake them. They also have a hold over the planet of Croanie, which controls the vineyard mortgages on the planet of Lovenbroy. The Bogan representative, Mr. Gulver, manipulates the incompetent functions of the Corps to procure grants for 500 armored tractors to be sent to Croanie, which cannot process that amount. The plan is to send the excess to Boge. In addition, he has worked out an agreement with Second Secretary Magnan to send 2,000 students to d’Land’s technical college, which cannot accommodate that many students. Retief discovers that the students’ luggage contains guns, and so he puts all the pieces together and discovers the Bogans’ plan to overtake d’Land rather than sublimate themselves. Retief sends the students to Lovenbroy to help harvest the grapes, and the guns are confiscated by representatives from the Armaments department."
              }
            ]
          },
          {
            "question_text": "Who is Hank Arapoulous, and what does he do in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "2",
                "uid": "18c9c61e7ecc4132b9ef185ffceda36f",
                "response_text": "Hank Arapoulousis is first described as a “bucolic person from Lovenbroy.” He is a farmer, tall with bronze skin and gray hair, who comes to MUDDLE’s office to discuss the harvest problems in Lovenbroy. They grow Bacchus vines, which only mature once every twelve years. This year is a harvest year, but they don’t have enough people to harvest the grapes. Arapoulousis explains to Retief that a few years ago, Boge landed a force on Lovenbroy to try to mine their minerals by strip-mining. Lovenbroy fought back for a year but lost a lot of its men. This created financial problems, so Lovenbroy borrowed money from Croanie, mortgaging its crops. The loan is due, and the wine crop will cover the loan amount, but they don’t have enough people to harvest the grapes. He is worried that if they don’t have a great harvest, Croanie will come in and start mining. Also, if they default on the loan, Croanie will hold half of the grape acreage that they used to secure the loan. Arapoulousis has also asked for help from the Labor Office, but they only offered to send them machinery, and machines cannot harvest the grapes. He returns to see Retief the following day to find out if Retief has discovered a way to help. When Mr. Karsh makes a scene about the missing luggage for the exchange students, Retief has Arapoulousis take Karsh away and “take care of him.” When they return, Karsh is stumbling and needs support to stand up. Arapoulousis explains that Karsh fell. \nRetief sends the exchange students to Lovenbroy with Arapoulousis to help with the harvest. As the harvest is winding down, Arapoulousis tells Retief that Retief has won the award for the picking competition. Arapoulousis is also the person who judges the wine contest.\n"
              },
              {
                "worker_id": "9",
                "uid": "5eecd525b99b4c098873d1b84d8594ef",
                "response_text": "Hank Arapolous is a farmer from the planet Lovenbroy, who beseeches Retief to send laborers to help with their grape harvest. He is described as tall and broad with gray hair and tanned skin, and he says he is 28 in Lovenbroy years, or 42 in terrestrial years. He is friendly, honest, and informal, though he is worried throughout most of the story about his people and his planet. He asks Retief for help getting labor to assist with Lovenbroy’s grape harvest so they don’t default on their debt to another planet, Croanie. He also informs Retief about Lovenbroy’s relationships and history with other planets, which helps Retief put the pieces together regarding what the Bogans are trying to do. He assists Retief with his plans and introduces him to Lovenbroy wine. \n"
              },
              {
                "worker_id": "6",
                "uid": "89f91bacbaa542399d95ad7cd50f72ef",
                "response_text": "Hank Arapoulous is a farmer from Lovenbroy. He tends to the land and is very invested in the arts and architecture part of his culture as well. Although he hybridizes fruit as well for his job (apples the size of melons!), his love for his home planet comes first. He is a very stocky and sturdy man, around Retief’s height. He is middle-aged, in his early 40s in Terrestrial years but only 28 in Lovenbroy years. He’s a silver fox with gray hair and tan skin. \n\tArapoulous arrives at MUDDLE in need of help and assistance. The Bacchus wine, which he cultivates, has two varieties, red and black. The crop is only harvested every 12 years, but this year they have a shortage of harvesters. He asks Retief to send over some pickers since the other departments had already turned him down. \n\tArapoulous plays a very important role in this story as he introduces Retief to the diplomatic relations between Lovenbroy, Croanie, and the Borge. After explaining that the Lovenbroy are in debt to the Croanie (who came to their aid after a one-year war with the Boge), Retief soon realizes that a great plot is at hand. When all is discovered and Retief manages to thwart the Borge takeover of Lovenbroy, Arapoulous helps him interrogate and punish Karsh, the militaristic leader of the Borge boys. \n\tVictorious and proud, Arapoulous returns to Lovenbroy with 2,000 mighty helping hands. The Borge boys who were trained to take over Lovenbroy are now being used to harvest its mighty crop. Arapoulous is thrilled at the turn of events, especially since only hoped for 100 men, and is even more excited when he learns that Retief might be staying on Lovenbroy for a while. With his home safe from prying eyes and greedy hands, Arapoulous ends the story on a high note. \n"
              },
              {
                "worker_id": "8",
                "uid": "ce65bca558e94733a2a713d042040902",
                "response_text": "Hank Arapoulous is a representative from the planet Lovenbroy. He is a farmer who is very passionate about the Bacchus vines they grow. These vines produce a crop on a twelve-year rotation, and he comes to Retief seeking labor to help harvest the crop. Without the labor, they will not be able to pay back their debt to Croanie, the planet that owns the mortgage on Lovenbroy’s vineyards. Hank tells Retief he is 28 years old, but later he learns Hank is closer to 42 because of the variation in the Terry years they use to track time on his planet. Hank is gregarious and passionate about the wine they produce, and he shares the red and black variations with Retief, who enjoys both. Retief agrees to help Hank, and during his inquiries, he discovers the Bogan plot to incite military action against d’Land. Later, Hank helps Retief in bamboozling the Bogan representative, Mr. Gulver, by joining Karsh and the students on the ship bound for Lovenbroy. After Retief returns to Lovenbroy and wins the grape-picking competition, Hank rewards him with a visit from a local woman named Delinda."
              }
            ]
          },
          {
            "question_text": "What is Lovenbroy, and why is it important?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "2",
                "uid": "18c9c61e7ecc4132b9ef185ffceda36f",
                "response_text": "Lovenbroy is one of the members of the Nicodemean Cluster and part of the cultural life of the Galaxy. Lovenbroy is known for its exquisite wines produced from the Bacchus vines, which only mature once every twelve years. Lovenbroy is important for the Galaxy culture because, during the time when it is not raising and harvesting grapes and other crops, it makes important cultural contributions. They have created parks and farms and left sizable forests for hunting. They offer skiing, bob-sledding, and ice skating in the spring while it is still cold. They also create fine furniture, sculpture, and art. During the summer, they offer beach parties, drama, and symphonies. The land is full of minerals, which led Boge to land a force to strip-mine some of the resources. Lovenbroy fought back, but it took a year, and it lost many men. This has left Lovenbroy short-handed for this year’s grape harvest. It also took a financial toll on Lovenbroy, and it had to borrow money from Croanie, mortgage its crops, and export its artwork. The loan is due during the harvest year, and without enough men to pick the grapes, Croanie will come in and take over half the vineyard land and mine it. Croanie is under obligation to Boge, and Boge is behind the scheme of sending “exchange students” supposedly to d’Land but really to Lovenbroy to take its minerals. "
              },
              {
                "worker_id": "9",
                "uid": "5eecd525b99b4c098873d1b84d8594ef",
                "response_text": "Lovenbroy is a small planet that depends on its grape crop and winemaking to sustain its economy. It is important to the story because a man from Lovenbroy asks Retief for help getting labor to harvest their grapes so they can pay their debts to Croanie. This interaction leads Retief to further investigate a series of events that has been set into motion wherein soldiers, weapons, and drilling equipment are being transported in disguise. In trying to right the wrongs that he discovers, Retief is also able to send two-thousand men to help with the harvest. Lovenbroy is also significant because it is where Retief is sent as punishment for his actions, though he doesn’t seem to mind being stationed on the agreeable planet. \n"
              },
              {
                "worker_id": "6",
                "uid": "89f91bacbaa542399d95ad7cd50f72ef",
                "response_text": "Lovenbroy is a beautiful, lush, and rich planet mostly made up of islands. It is the only place where Bacchus grapes can be grown, and its resources are highly coveted. Lovenbroy has five seasons throughout one Lovenbroy year (which is six months longer than a Terrestrial year). Their winters are long and harsh, with little to no sunlight all day long. This forced indoor time led to a very artistic culture springing up. Many spend the winters painting and sculpting. This necessary indoor time has made the Lovenbroy very keen on architecture. Spring is also pretty cold, but warm and light enough to woodwork and play a few sports. Then comes the season of music, where it rains all day but the sun constantly shines. The summer is incredibly hot, which forces people indoors again during the day, but able to play come the evening! Then it’s autumn, which is harvest time for all crops, including the Bacchus grapes every 12 years. \n\tLovenbroy has many rich resources, most likely thanks to its mostly untouched landscape and erratic seasons. The land is ingrained with many minerals that have, so far, remained un-mined. Thanks to these minerals and metals in the soil, the trees (and then harvested timber) that are produced are colored differently. \n\tLovenbroy, being the home of so many invaluable resources, is fought for. A decade before the story began, Lovenbroy was invaded by the Boge who wanted to mine for minerals. After one year of war, the Lovenbroy managed to defeat the Boge, but it left them with a crippled economy and a depleted workforce. Croanie stepped in to help and gave them several loans. However, 10 years later, Lovenbroy is still in debt to Croanie. Harvesting the Bacchus grapes will give them enough revenue to pay off their loans, but they need more harvesters. \n\tLovenbroy is the main source of conflict in this story. Croanie and Boge work together to try and take over Lovenbroy and deplete the land of its resources. \n"
              },
              {
                "worker_id": "8",
                "uid": "ce65bca558e94733a2a713d042040902",
                "response_text": "Lovenbroy is a planet known for its vast vineyards of Bacchus vines used to produce delicious red and black wines. The vineyards cover mountains, stretch along riversides, and snake through beautiful gardens. Fertile grass springs up throughout the vineyards, and every twelve years, the entire population comes together to celebrate the crop and harvest the fruit together. Lovenbroy also has a rich source of minerals use to enrich their wine, and a few years ago one of their neighbors came to fight for control of these minerals. Lovenbroy ultimately won the battle, but they lost a lot of money and men in the fight, and they had to turn to the planet Croanie for financial assistance. Ultimately, they sold control of the mortgage on their vineyards to Croanie as well, thinking the twelve-year gap between harvests would be enough time to repay the debt. They were wrong, and they send a representative—Hank Arapoulous—to Corps HQ to seek additional labor to help pick the new harvest in time. This visit to Retief’s office kickstarts the chain of events that lead to Retief’s discovery of the Bogan plan to take military action against d’Land."
              }
            ]
          },
          {
            "question_text": "What is Croanie, and why is it important in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "2",
                "uid": "18c9c61e7ecc4132b9ef185ffceda36f",
                "response_text": "Croanie is a member of the Nicodemean Cluster of the Galaxy and is an associate of Boge, a member known to be a troublemaker. They tried to steal minerals from Lovenbroy earlier by attacking them. Croanie is under obligation to Boge. Croanie is the world that gave Lovenbroy a loan when it needed money to help tide it over until its next grape harvest. Croanie gave Lovenbroy a mortgage on its crops and holds a security interest in half of the grape acreage that it will acquire if Lovenbroy cannot meet the loan payment that is coming due. This is the reason that Hank Arapoulous goes to MEDDLE and asks for help obtaining workers to go to Lovenbroy and harvest the crop. It also turns out that Croanie is involved in Boge’s efforts to attack Lovenbroy and gain access to its minerals. Mr. Whaffle reveals to Retief that Croanie is set to receive a shipment of heavy mining equipment, but Croanie is best known for its oceans and fishing and has no ore. In addition, when the Bogan exchange students arrive without their luggage, Mr. Karsh says their luggage is coming from Croanie. When their luggage does arrive, it is full of weapons. The “tractors” that are being shipped to Croanie are really armored vehicles that are continental siege units that carry four men and have a half-megaton/second firepower. Mr. Whaffle reveals that the tractors are for transshipment and that Croanie is in a difficult situation, balance-of-payments-wise, with Boge. There is also an application for 2,000 more “exchange students” to be sent to Croanie.\n"
              },
              {
                "worker_id": "9",
                "uid": "5eecd525b99b4c098873d1b84d8594ef",
                "response_text": "Croanie is a planet that consists mostly of fisheries and is known for their seafood. They loaned another planet, Lovenbroy, some money when they were struggling, and the people of Croanie have also found themselves in debt to Boge, a nearby planet known as a local bully. Because of this, Croanie finds itself deeply entwined in Boge’s web of interplanetary plots by transshipping siege units and/or mining equipment and letting Boge take advantage of their mortgage on Lovenbroy’s best land. \n"
              },
              {
                "worker_id": "6",
                "uid": "89f91bacbaa542399d95ad7cd50f72ef",
                "response_text": "Croanie is another planet that neighbors Lovenbroy and Boge. It is the home of many fisheries and seamen. Croanie has developed an alliance with the Bogans, who attempted to invade Lovenbroy ten years ago. When they failed, the Croanie swooped in and offered loans and assistance to the depleted and wounded Lovenbroy. \n\tLater on down the line, Croanie and the Bogans hatched a plot to take over Lovenbroy and mine their resources. The Croanie use grants and diplomatic immunity to acquire 500 Bolos, model WV M-1. These are essentially outfitted superpowered tanks that have a bulldozer blade attached (hence the ability to label them as tractors) to make demolition easier. Once Croanie acquired the “tractors,” Boge would send over 4,000 young Bogan boys to Lovenbroy who were trained and ready to invade. Together, their siege would completely overwhelm the Lovenbroy and destroy their home. \nThanks to Arapoulous coming to MUDDLE for help, Retief was able to piece together the random bits of the puzzle and thwart their plan. \n"
              },
              {
                "worker_id": "8",
                "uid": "ce65bca558e94733a2a713d042040902",
                "response_text": "Croanie is a mostly-aquatic planet known for its exports of seafood. They provide foot-long prawn to Lovenbroy. They also have close ties to the planet of Boge, whose inhabitants are nicknamed the “Hoodlums of the Nicodemean Cluster.” Croanie owns the mortgage on Lovenbroy’s vast vineyards after a battle over their minerals left them financially wrecked. A Croanie ship brings the luggage bearing the Bogans’ weapons to meet the group of Bogan students who are set to fly to d’Land to attend the Exchange Program. The students are actually soldiers, who will supposedly use the weapons to overtake d’Land. They also are the recipients of a grant from the MEDDLE program that will supply them with 500 tractors—an amount they cannot process with the facilities they have on their planet. They will send the excess tractors to Boge, which will use them in turn to attack d’Land."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 6333,
        "document_length_chars": 38273
      }
    }
  ]
}