{
  "item_metadata": {
    "item_id": "61285",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61285",
      "content": "THE DESERT AND THE STARS\n \n\n BY KEITH LAUMER\n \n\n The Aga Kaga wanted peace—a piece of everything in sight!\n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, November 1962. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n \"I'm not at all sure,\" Under-Secretary Sternwheeler said, \"that I fully understand the necessity for your ... ah ... absenting yourself from your post of duty, Mr. Retief. Surely this matter could have been dealt with in the usual way—assuming any action is necessary.\"\n \n \"I had a sharp attack of writer's cramp, Mr. Secretary,\" Retief said.\n\"So I thought I'd better come along in person—just to be sure I was positive of making my point.\"\n \n \"Eh?\"\n \n \"Why, ah, there were a number of dispatches,\" Deputy Under-Secretary Magnan put in. \"Unfortunately, this being end-of-the-fiscal-year time, we found ourselves quite inundated with reports. Reports, reports, reports—\"\n \n \"Not criticizing the reporting system, are you, Mr. Magnan?\" the Under-Secretary barked.\n \n \"Gracious, no,\" Magnan said. \"I love reports.\"\n \n \"It seems nobody's told the Aga Kagans about fiscal years,\" Retief said. \"They're going right ahead with their program of land-grabbing on Flamme. So far, I've persuaded the Boyars that this is a matter for the Corps, and not to take matters into their own hands.\"\n \n The Under-Secretary nodded. \"Quite right. Carry on along the same lines. Now, if there's nothing further—\"\n \n \"Thank you, Mr. Secretary,\" Magnan said, rising. \"We certainly appreciate your guidance.\"\n \n \"There is a little something further,\" said Retief, sitting solidly in his chair. \"What's the Corps going to do about the Aga Kagans?\"\n \n The Under-Secretary turned a liverish eye on Retief. \"As Minister to Flamme, you should know that the function of a diplomatic representative is merely to ... what shall I say...?\"\n \n \"String them along?\" Magnan suggested.\n \n \"An unfortunate choice of phrase,\" the Under-Secretary said. \"However, it embodies certain realities of Galactic politics. The Corps must concern itself with matters of broad policy.\"\n \n \"Sixty years ago the Corps was encouraging the Boyars to settle Flamme,\" Retief said. \"They were assured of Corps support.\"\n \n \"I don't believe you'll find that in writing,\" said the Under-Secretary blandly. \"In any event, that was sixty years ago. At that time a foothold against Neo-Concordiatist elements was deemed desirable. Now the situation has changed.\"\n \n \"The Boyars have spent sixty years terraforming Flamme,\" Retief said.\n\"They've cleared jungle, descummed the seas, irrigated deserts, set out forests. They've just about reached the point where they can begin to enjoy it. The Aga Kagans have picked this as a good time to move in. They've landed thirty detachments of 'fishermen'—complete with armored trawlers mounting 40 mm infinite repeaters—and another two dozen parties of 'homesteaders'—all male and toting rocket launchers.\"\n \n \"Surely there's land enough on the world to afford space to both groups,\" the Under-Secretary said. \"A spirit of co-operation—\"\n \n \n\n \n \"The Boyars needed some co-operation sixty years ago,\" Retief said.\n\"They tried to get the Aga Kagans to join in and help them beat back some of the saurian wild life that liked to graze on people. The Corps didn't like the idea. They wanted to see an undisputed anti-Concordiatist enclave. The Aga Kagans didn't want to play, either. But now that the world is tamed, they're moving in.\"\n \n \"The exigencies of diplomacy require a flexible policy—\"\n \n \"I want a firm assurance of Corps support to take back to Flamme,\" Retief said. \"The Boyars are a little naive. They don't understand diplomatic triple-speak. They just want to hold onto the homes they've made out of a wasteland.\"\n \n \"I'm warning you, Retief!\" the Under-Secretary snapped, leaning forward, wattles quivering. \"Corps policy with regard to Flamme includes no inflammatory actions based on outmoded concepts. The Boyars will have to accommodate themselves to the situation!\"\n \n \"That's what I'm afraid of,\" Retief said. \"They're not going to sit still and watch it happen. If I don't take back concrete evidence of Corps backing, we're going to have a nice hot little shooting war on our hands.\"\n \n The Under-Secretary pushed out his lips and drummed his fingers on the desk.\n \n \"Confounded hot-heads,\" he muttered. \"Very well, Retief. I'll go along to the extent of a Note; but positively no further.\"\n \n \"A Note? I was thinking of something more like a squadron of Corps Peace Enforcers running through a few routine maneuvers off Flamme.\"\n \n \"Out of the question. A stiffly worded Protest Note is the best I can do. That's final.\"\n \n Back in the corridor, Magnan turned to Retief. \"When will you learn not to argue with Under-Secretaries? One would think you actively disliked the idea of ever receiving a promotion. I was astonished at the Under-Secretary's restraint. Frankly, I was stunned when he actually agreed to a Note. I, of course, will have to draft it.\" Magnan pulled at his lower lip thoughtfully. \"Now, I wonder, should I view with deep concern an act of open aggression, or merely point out an apparent violation of technicalities....\"\n \n \"Don't bother,\" Retief said. \"I have a draft all ready to go.\"\n \n \"But how—?\"\n \n \"I had a feeling I'd get paper instead of action,\" Retief said. \"I thought I'd save a little time all around.\"\n \n \"At times, your cynicism borders on impudence.\"\n \n \"At other times, it borders on disgust. Now, if you'll run the Note through for signature, I'll try to catch the six o'clock shuttle.\"\n \n \"Leaving so soon? There's an important reception tonight. Some of our biggest names will be there. An excellent opportunity for you to join in the diplomatic give-and-take.\"\n \n \"No, thanks. I want to get back to Flamme and join in something mild, like a dinosaur hunt.\"\n \n \"When you get there,\" said Magnan, \"I hope you'll make it quite clear that this matter is to be settled without violence.\"\n \n \"Don't worry. I'll keep the peace, if I have to start a war to do it.\"\n \n \n\n \n On the broad verandah at Government House, Retief settled himself comfortably in a lounge chair. He accepted a tall glass from a white-jacketed waiter and regarded the flamboyant Flamme sunset, a gorgeous blaze of vermillion and purple that reflected from a still lake, tinged the broad lawn with color, silhouetted tall poplars among flower beds.\n \n \"You've done great things here in sixty years, Georges,\" said Retief.\n\"Not that natural geological processes wouldn't have produced the same results, given a couple of hundred million years.\"\n \n \"Don't belabor the point,\" the Boyar Chef d'Regime said. \"Since we seem to be on the verge of losing it.\"\n \n \"You're forgetting the Note.\"\n \n \"A Note,\" Georges said, waving his cigar. \"What the purple polluted hell is a Note supposed to do? I've got Aga Kagan claim-jumpers camped in the middle of what used to be a fine stand of barley, cooking sheep's brains over dung fires not ten miles from Government House—and upwind at that.\"\n \n \"Say, if that's the same barley you distill your whiskey from, I'd call that a first-class atrocity.\"\n \n \"Retief, on your say-so, I've kept my boys on a short leash. They've put up with plenty. Last week, while you were away, these barbarians sailed that flotilla of armor-plated junks right through the middle of one of our best oyster breeding beds. It was all I could do to keep a bunch of our men from going out in private helis and blasting 'em out of the water.\"\n \n \"That wouldn't have been good for the oysters, either.\"\n \n \"That's what I told 'em. I also said you'd be back here in a few days with something from Corps HQ. When I tell 'em all we've got is a piece of paper, that'll be the end. There's a strong vigilante organization here that's been outfitting for the last four weeks. If I hadn't held them back with assurances that the CDT would step in and take care of this invasion, they would have hit them before now.\"\n \n \n\n \n \"That would have been a mistake,\" said Retief. \"The Aga Kagans are tough customers. They're active on half a dozen worlds at the moment. They've been building up for this push for the last five years. A show of resistance by you Boyars without Corps backing would be an invitation to slaughter—with the excuse that you started it.\"\n \n \"So what are we going to do? Sit here and watch these goat-herders take over our farms and fisheries?\"\n \n \"Those goat-herders aren't all they seem. They've got a first-class modern navy.\"\n \n \"I've seen 'em. They camp in goat-skin tents, gallop around on animal-back, wear dresses down to their ankles—\"\n \n \"The 'goat-skin' tents are a high-polymer plastic, made in the same factory that turns out those long flowing bullet-proof robes you mention. The animals are just for show. Back home they use helis and ground cars of the most modern design.\"\n \n The Chef d'Regime chewed his cigar.\n \n \"Why the masquerade?\"\n \n \"Something to do with internal policies, I suppose.\"\n \n \"So we sit tight and watch 'em take our world away from us. That's what I get for playing along with you, Retief. We should have clobbered these monkeys as soon as they set foot on our world.\"\n \n \"Slow down, I haven't finished yet. There's still the Note.\"\n \n \"I've got plenty of paper already. Rolls and rolls of it.\"\n \n \"Give diplomatic processes a chance,\" said Retief. \"The Note hasn't even been delivered yet. Who knows? We may get surprising results.\"\n \n \"If you expect me to supply a runner for the purpose, you're out of luck. From what I hear, he's likely to come back with his ears stuffed in his hip pocket.\"\n \n \"I'll deliver the Note personally,\" Retief said. \"I could use a couple of escorts—preferably strong-arm lads.\"\n \n The Chef d'Regime frowned, blew out a cloud of smoke. \"I wasn't kidding about these Aga Kagans,\" he said. \"I hear they have some nasty habits. I don't want to see you operated on with the same knives they use to skin out the goats.\"\n \n \"I'd be against that myself. Still, the mail must go through.\"\n \n \"Strong-arm lads, eh? What have you got in mind, Retief?\"\n \n \"A little muscle in the background is an old diplomatic custom,\" Retief said.\n \n The Chef d'Regime stubbed out his cigar thoughtfully. \"I used to be a pretty fair elbow-wrestler myself,\" he said. \"Suppose I go along...?\"\n \n \"That,\" said Retief, \"should lend just the right note of solidarity to our little delegation.\" He hitched his chair closer. \"Now, depending on what we run into, here's how we'll play it....\"\n \n \n\n II\n \n Eight miles into the rolling granite hills west of the capital, a black-painted official air-car flying the twin flags of Chief of State and Terrestrial Minister skimmed along a foot above a pot-holed road. Slumped in the padded seat, the Boyar Chef d'Regime waved his cigar glumly at the surrounding hills.\n \n \"Fifty years ago this was bare rock,\" he said. \"We've bred special strains of bacteria here to break down the formations into soil, and we followed up with a program of broad-spectrum fertilization. We planned to put the whole area into crops by next year. Now it looks like the goats will get it.\"\n \n \"Will that scrubland support a crop?\" Retief said, eyeing the lichen-covered knolls.\n \n \"Sure. We start with legumes and follow up with cereals. Wait until you see this next section. It's an old flood plain, came into production thirty years ago. One of our finest—\"\n \n The air-car topped a rise. The Chef dropped his cigar and half rose, with a hoarse yell. A herd of scraggly goats tossed their heads among a stand of ripe grain. The car pulled to a stop. Retief held the Boyar's arm.\n \n \"Keep calm, Georges,\" he said. \"Remember, we're on a diplomatic mission. It wouldn't do to come to the conference table smelling of goats.\"\n \n \"Let me at 'em!\" Georges roared. \"I'll throttle 'em with my bare hands!\"\n \n A bearded goat eyed the Boyar Chef sardonically, jaw working. \"Look at that long-nosed son!\" The goat gave a derisive bleat and took another mouthful of ripe grain.\n \n \"Did you see that?\" Georges yelled. \"They've trained the son of a—\"\n \n \"Chin up, Georges,\" Retief said. \"We'll take up the goat problem along with the rest.\"\n \n \"I'll murder 'em!\"\n \n \"Hold it, Georges. Look over there.\"\n \n A hundred yards away, a trio of brown-cloaked horsemen topped a rise, paused dramatically against the cloudless pale sky, then galloped down the slope toward the car, rifles bobbing at their backs, cloaks billowing out behind. Side by side they rode, through the brown-golden grain, cutting three narrow swaths that ran in a straight sweep from the ridge to the air-car where Retief and the Chef d'Regime hovered, waiting.\n \n Georges scrambled for the side of the car. \"Just wait 'til I get my hands on him!\"\n \n Retief pulled him back. \"Sit tight and look pleased, Georges. Never give the opposition a hint of your true feelings. Pretend you're a goat lover—and hand me one of your cigars.\"\n \n The three horsemen pulled up in a churn of chaff and a clatter of pebbles. Georges coughed, batting a hand at the settling dust. Retief peeled the cigar unhurriedly, sniffed, at it and thumbed it alight. He drew at it, puffed out a cloud of smoke and glanced casually at the trio of Aga Kagan cavaliers.\n \n \"Peace be with you,\" he intoned in accent-free Kagan. \"May your shadows never grow less.\"\n \n \n\n \n The leader of the three, a hawk-faced man with a heavy beard, unlimbered his rifle. He fingered it, frowning ferociously.\n \n \"Have no fear,\" Retief said, smiling graciously. \"He who comes as a guest enjoys perfect safety.\"\n \n A smooth-faced member of the threesome barked an oath and leveled his rifle at Retief.\n \n \"Youth is the steed of folly,\" Retief said. \"Take care that the beardless one does not disgrace his house.\"\n \n The leader whirled on the youth and snarled an order. He lowered the rifle, muttering. Blackbeard turned back to Retief.\n \n \"Begone, interlopers,\" he said. \"You disturb the goats.\"\n \n \"Provision is not taken to the houses of the generous,\" Retief said.\n\"May the creatures dine well ere they move on.\"\n \n \"Hah! The goats of the Aga Kaga graze on the lands of the Aga Kaga.\" The leader edged his horse close, eyed Retief fiercely. \"We welcome no intruders on our lands.\"\n \n \"To praise a man for what he does not possess is to make him appear foolish,\" Retief said. \"These are the lands of the Boyars. But enough of these pleasantries. We seek audience with your ruler.\"\n \n \"You may address me as 'Exalted One',\" the leader said. \"Now dismount from that steed of Shaitan.\"\n \n \"It is written, if you need anything from a dog, call him 'sir',\" Retief said. \"I must decline to impute canine ancestry to a guest. Now you may conduct us to your headquarters.\"\n \n \"Enough of your insolence!\" The bearded man cocked his rifle. \"I could blow your heads off!\"\n \n \"The hen has feathers, but it does not fly,\" Retief said. \"We have asked for escort. A slave must be beaten with a stick; for a free man, a hint is enough.\"\n \n \"You mock me, pale one. I warn you—\"\n \n \"Only love makes me weep,\" Retief said. \"I laugh at hatred.\"\n \n \"Get out of the car!\"\n \n Retief puffed at his cigar, eyeing the Aga Kagan cheerfully. The youth in the rear moved forward, teeth bared.\n \n \"Never give in to the fool, lest he say, 'He fears me,'\" Retief said.\n \n \"I cannot restrain my men in the face of your insults,\" the bearded Aga Kagan roared. \"These hens of mine have feathers—and talons as well!\"\n \n \"When God would destroy an ant, he gives him wings,\" Retief said.\n\"Distress in misfortune is another misfortune.\"\n \n The bearded man's face grew purple.\n \n Retief dribbled the ash from his cigar over the side of the car.\n \n \"Now I think we'd better be getting on,\" he said briskly. \"I've enjoyed our chat, but we do have business to attend to.\"\n \n The bearded leader laughed shortly. \"Does the condemned man beg for the axe?\" he enquired rhetorically. \"You shall visit the Aga Kaga, then. Move on! And make no attempt to escape, else my gun will speak you a brief farewell.\"\n \n The horsemen glowered, then, at a word from the leader, took positions around the car. Georges started the vehicle forward, following the leading rider. Retief leaned back and let out a long sigh.\n \n \"That was close,\" he said. \"I was about out of proverbs.\"\n \n \"You sound as though you'd brought off a coup,\" Georges said. \"From the expression on the whiskery one's face, we're in for trouble. What was he saying?\"\n \n \"Just a routine exchange of bluffs,\" Retief said. \"Now when we get there, remember to make your flattery sound like insults and your insults sound like flattery, and you'll be all right.\"\n \n \"These birds are armed. And they don't like strangers,\" Georges said.\n\"Maybe I should have boned up on their habits before I joined this expedition.\"\n \n \"Just stick to the plan,\" Retief said. \"And remember: a handful of luck is better than a camel-load of learning.\"\n \n \n\n \n The air car followed the escort down a long slope to a dry river bed and across it, through a barren stretch of shifting sand to a green oasis set with canopies.\n \n The armed escort motioned the car to a halt before an immense tent of glistening black. Before the tent armed men lounged under a pennant bearing a lion couchant in crimson on a field verte.\n \n \"Get out,\" Blackbeard ordered. The guards eyed the visitors, their drawn sabers catching sunlight. Retief and Georges stepped from the car onto rich rugs spread on the grass. They followed the ferocious gesture of the bearded man through the opening into a perfumed interior of luminous shadows. A heavy odor of incense hung in the air, and the strumming of stringed instruments laid a muted pattern of sound behind the decorations of gold and blue, silver and green. At the far end of the room, among a bevy of female slaves, a large and resplendently clad man with blue-black hair and a clean-shaven chin popped a grape into his mouth. He wiped his fingers negligently on a wisp of silk offered by a handmaiden, belched loudly and looked the callers over.\n \n Blackbeard cleared his throat. \"Down on your faces in the presence of the Exalted One, the Aga Kaga, ruler of East and West.\"\n \n \"Sorry,\" Retief said firmly. \"My hay-fever, you know.\"\n \n The reclining giant waved a hand languidly.\n \n \"Never mind the formalities,\" he said. \"Approach.\"\n \n Retief and Georges crossed the thick rugs. A cold draft blew toward them. The reclining man sneezed violently, wiped his nose on another silken scarf and held up a hand.\n \n \"Night and the horses and the desert know me,\" he said in resonant tones. \"Also the sword and the guest and paper and pen—\" He paused, wrinkled his nose and sneezed again. \"Turn off that damned air-conditioner,\" he snapped.\n \n He settled himself and motioned the bearded man to him. The two exchanged muted remarks. Then the bearded man stepped back, ducked his head and withdrew to the rear.\n \n \"Excellency,\" Retief said, \"I have the honor to present M. Georges Duror, Chef d'Regime of the Planetary government.\"\n \n \"Planetary government?\" The Aga Kaga spat grape seeds on the rug. \"My men have observed a few squatters along the shore. If they're in distress, I'll see about a distribution of goat-meat.\"\n \n \"It is the punishment of the envious to grieve at anothers' plenty,\" Retief said. \"No goat-meat will be required.\"\n \n \"Ralph told me you talk like a page out of Mustapha ben Abdallah Katib Jelebi,\" the Aga Kaga said. \"I know a few old sayings myself. For example, 'A Bedouin is only cheated once.'\"\n \n \"We have no such intentions, Excellency,\" Retief said. \"Is it not written, 'Have no faith in the Prince whose minister cheats you'?\"\n \n \"I've had some unhappy experiences with strangers,\" the Aga Kaga said.\n\"It is written in the sands that all strangers are kin. Still, he who visits rarely is a welcome guest. Be seated.\"\n \n \n\n III\n \n Handmaidens brought cushions, giggled and fled. Retief and Georges settled themselves comfortably. The Aga Kaga eyed them in silence.\n \n \n\n \n \"We have come to bear tidings from the Corps Diplomatique Terrestrienne,\" Retief said solemnly. A perfumed slave girl offered grapes.\n \n \"Modest ignorance is better than boastful knowledge,\" the Aga Kaga said. \"What brings the CDT into the picture?\"\n \n \"The essay of the drunkard will be read in the tavern,\" Retief said.\n\"Whereas the words of kings....\"\n \n \"Very well, I concede the point.\" The Aga Kaga waved a hand at the serving maids. \"Depart, my dears. Attend me later. You too, Ralph. These are mere diplomats. They are men of words, not deeds.\"\n \n The bearded man glared and departed. The girls hurried after him.\n \n \"Now,\" the Aga Kaga said. \"Let's drop the wisdom of the ages and get down to the issues. Not that I don't admire your repertoire of platitudes. How do you remember them all?\"\n \n \"Diplomats and other liars require good memories,\" said Retief. \"But as you point out, small wisdom to small minds. I'm here to effect a settlement of certain differences between yourself and the planetary authorities. I have here a Note, which I'm conveying on behalf of the Sector Under-Secretary. With your permission, I'll read it.\"\n \n \"Go ahead.\" The Aga Kaga kicked a couple of cushions onto the floor, eased a bottle from under the couch and reached for glasses.\n \n \"The Under-Secretary for Sector Affairs presents his compliments to his Excellency, the Aga Kaga of the Aga Kaga, Primary Potentate, Hereditary Sheik, Emir of the—\"\n \n \"Yes, yes. Skip the titles.\"\n \n Retief flipped over two pages.\n \n \"... and with reference to the recent relocation of persons under the jurisdiction of his Excellency, has the honor to point out that the territories now under settlement comprise a portion of that area, hereinafter designated as Sub-sector Alpha, which, under terms of the Agreement entered into by his Excellency's predecessor, and as referenced in Sector Ministry's Notes numbers G-175846573957-b and X-7584736 c-1, with particular pertinence to that body designated in the Revised Galactic Catalogue, Tenth Edition, as amended, Volume Nine, reel 43, as 54 Cygni Alpha, otherwise referred to hereinafter as Flamme—\"\n \n \"Come to the point,\" the Aga Kaga cut in. \"You're here to lodge a complaint that I'm invading territories to which someone else lays claim, is that it?\" He smiled broadly, offered dope-sticks and lit one.\n\"Well, I've been expecting a call. After all, it's what you gentlemen are paid for. Cheers.\"\n \n \"Your Excellency has a lucid way of putting things,\" Retief said.\n \n \"Call me Stanley,\" the Aga Kaga said. \"The other routine is just to please some of the old fools—I mean the more conservative members of my government. They're still gnawing their beards and kicking themselves because their ancestors dropped science in favor of alchemy and got themselves stranded in a cultural dead end. This charade is supposed to prove they were right all along. However, I've no time to waste in neurotic compensations. I have places to go and deeds to accomplish.\"\n \n \"At first glance,\" Retief said, \"it looks as though the places are already occupied, and the deeds are illegal.\"\n \n \n\n \n The Aga Kaga guffawed. \"For a diplomat, you speak plainly, Retief. Have another drink.\" He poured, eyeing Georges. \"What of M. Duror? How does he feel about it?\"\n \n Georges took a thoughtful swallow of whiskey. \"Not bad,\" he said. \"But not quite good enough to cover the odor of goats.\"\n \n The Aga Kaga snorted. \"I thought the goats were overdoing it a bit myself,\" he said. \"Still, the graybeards insisted. And I need their support.\"\n \n \"Also,\" Georges said distinctly, \"I think you're soft. You lie around letting women wait on you, while your betters are out doing an honest day's work.\"\n \n The Aga Kaga looked startled. \"Soft? I can tie a knot in an iron bar as big as your thumb.\" He popped a grape into his mouth. \"As for the rest, your pious views about the virtues of hard labor are as childish as my advisors' faith in the advantages of primitive plumbing. As for myself, I am a realist. If two monkeys want the same banana, in the end one will have it, and the other will cry morality. The days of my years are numbered, praise be to God. While they last, I hope to eat well, hunt well, fight well and take my share of pleasure. I leave to others the arid satisfactions of self-denial and other perversions.\"\n \n \"You admit you're here to grab our land, then,\" Georges said. \"That's the damnedest piece of bare-faced aggression—\"\n \n \"Ah, ah!\" The Aga Kaga held up a hand. \"Watch your vocabulary, my dear sir. I'm sure that 'justifiable yearnings for territorial self-realization' would be more appropriate to the situation. Or possibly 'legitimate aspirations, for self-determination of formerly exploited peoples' might fit the case. Aggression is, by definition, an activity carried on only by those who have inherited the mantle of Colonial Imperialism.\"\n \n \"Imperialism! Why, you Aga Kagans have been the most notorious planet-grabbers in Sector history, you—you—\"\n \n \"Call me Stanley.\" The Aga Kaga munched a grape. \"I merely face the realities of popular folk-lore. Let's be pragmatic; it's a matter of historical association. Some people can grab land and pass it off lightly as a moral duty; others are dubbed imperialist merely for holding onto their own. Unfair, you say. But that's life, my friends. And I shall continue to take every advantage of it.\"\n \n \"We'll fight you!\" Georges bellowed. He took another gulp of whiskey and slammed the glass down. \"You won't take this world without a struggle!\"\n \n \"Another?\" the Aga Kaga said, offering the bottle. Georges glowered as his glass was filled. The Aga Kaga held the glass up to the light.\n \n \"Excellent color, don't you agree?\" He turned his eyes on Georges.\n \n \"It's pointless to resist,\" he said. \"We have you outgunned and outmanned. Your small nation has no chance against us. But we're prepared to be generous. You may continue to occupy such areas as we do not immediately require until such time as you're able to make other arrangements.\"\n \n \"And by the time we've got a crop growing out of what was bare rock, you'll be ready to move in,\" the Boyar Chef d'Regime snapped. \"But you'll find that we aren't alone!\"\n \n \n\n \n \"Quite alone,\" the Aga said. He nodded sagely. \"Yes, one need but read the lesson of history. The Corps Diplomatique will make expostulatory noises, but it will accept the fait accompli . You, my dear sir, are but a very small nibble. We won't make the mistake of excessive greed. We shall inch our way to empire—and those who stand in our way shall be dubbed warmongers.\"\n \n \"I see you're quite a student of history, Stanley,\" Retief said. \"I wonder if you recall the eventual fate of most of the would-be empire nibblers of the past?\"\n \n \"Ah, but they grew incautious. They went too far, too fast.\"\n \n \"The confounded impudence,\" Georges rasped. \"Tells us to our face what he has in mind!\"\n \n \"An ancient and honorable custom, from the time of Mein Kampf and the Communist Manifesto through the Porcelain Wall of Leung. Such declarations have a legendary quality. It's traditional that they're never taken at face value.\"\n \n \"But always,\" Retief said, \"there was a critical point at which the man on horseback could have been pulled from the saddle.\"\n \n \" Could have been,\" the Aga Kaga chuckled. He finished the grapes and began peeling an orange. \"But they never were. Hitler could have been stopped by the Czech Air Force in 1938; Stalin was at the mercy of the primitive atomics of the west in 1946; Leung was grossly over-extended at Rangoon. But the onus of that historic role could not be overcome. It has been the fate of your spiritual forebears to carve civilization from the wilderness and then, amid tearing of garments and the heaping of ashes of self-accusation on your own confused heads, to withdraw, leaving the spoils for local political opportunists and mob leaders, clothed in the mystical virtue of native birth. Have a banana.\"\n \n \"You're stretching your analogy a little too far,\" Retief said. \"You're banking on the inaction of the Corps. You could be wrong.\"\n \n \"I shall know when to stop,\" the Aga Kaga said.\n \n \"Tell me, Stanley,\" Retief said, rising. \"Are we quite private here?\"\n \n \"Yes, perfectly so,\" the Aga Kaga said. \"None would dare to intrude in my council.\" He cocked an eyebrow at Retief. \"You have a proposal to make in confidence? But what of our dear friend Georges? One would not like to see him disillusioned.\"\n \n \"Don't worry about Georges. He's a realist, like you. He's prepared to deal in facts. Hard facts, in this case.\"\n \n The Aga Kaga nodded thoughtfully. \"What are you getting at?\"\n \n \"You're basing your plan of action on the certainty that the Corps will sit by, wringing its hands, while you embark on a career of planetary piracy.\"\n \n \"Isn't it the custom?\" the Aga Kaga smiled complacently.\n \n \"I have news for you, Stanley. In this instance, neck-wringing seems more in order than hand-wringing.\"\n \n The Aga Kaga frowned. \"Your manner—\"\n \n \"Never mind our manners!\" Georges blurted, standing. \"We don't need any lessons from goat-herding land-thieves!\"\n \n The Aga Kaga's face darkened. \"You dare to speak thus to me, pig of a muck-grubber!\"",
      "metadata": {
        "title": "The Desert and the Stars",
        "author": "Keith Laumer",
        "passage_id": "61285",
        "uid": "f8162edda8394d38a5d474ea7fe45079",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "2",
                "uid": "0a3381cd0b3c4213bebb7dd6957d565d",
                "response_text": "As the story opens, Retief, the Minister to Flamme, is meeting with other members of the Corps Diplomatique Terrestrienne, including Under-Secretary Sternwheeler and Deputy Under-Secretary Magnan. The men discuss Retief’s plan to visit Flamme in person to deal with the growing conflict between the Boyars, who have been living on Flamme for sixty years, and the Aga Kagans. The latter recently arrived on Flamme and began taking over land that the Boyars are farming. The Aga Kagans appear to be goat herders, living in tents and allowing their goats to graze on land that the Boyars use for crops, but in reality, the Aga Kagans have weapons, including 40 mm infinite repeaters and rocket launchers. Retief wants to offer the Boyars the support of the Corps, but Sternwheeler will only go so far as to authorize a “stiffly worded Protest Note.” With foresight, Retief has already drafted a note because he anticipated the Corps would respond with paperwork rather than action. \t\n\tRetief travels to Flamme and meets with Georges Duror, the Boyar Chef d’Regime. Georges indicates that he has been holding back his men who want to attack the Aga Kagans for taking their land, and Retief reminds Georges that if the Boyars act without backing from the Corps, they are likely to be destroyed. Retief also tells Georges that the goats and tents are just for show; the Aga Kagans have a modern navy and bullet-proof cloaks, and on their home planet, they travel via modern helis and ground cars. Georges seems discouraged by this news, but Retief reminds him he has the Note and asks him to give diplomacy a chance.\n\tRetief and Georges travel to meet with the head of the Aga Kagans to deliver the Note. On the way, Georges points out the progress that the Boyars have made on Flamme. They stop their air-car when Georges sees a herd of goats in a grain field, and three Aga Kagan horsemen confront them. Retief asks them to take him and Georges to their leader, and they do. Retief introduces Georges as from the Planetary government to the leader, Stanley, and offers to read the Note. He begins with a series of titles until Stanley tells him to skip them. Retief flips two pages and begins a long, legalistic description of relocated people until Stanley cuts him off. Stanley says the Boyars will be accused of imperialism if they attack the Aga Kagans but offers to allow the Boyars to stay until they can make other arrangements. Stanley reveals that the Aga Kagans are slowly creating an empire, and he expects the Corps won’t do anything about it. Georges and Stanley exchange heated insults. \n"
              },
              {
                "worker_id": "10",
                "uid": "08ce9506221e4b6c8e164e2c5a4cbc02",
                "response_text": "Boyars have spent 60 years terraforming the planet of Flamme, and were assured support from the Corps in their endeavors to colonize the planet from the beginning. A second group, called the Aga Kagan, have begun to move into the planet to do what the Boyars have been told is fishing and homesteading. However, they have landed only males on the planet as well as rocket launchers, suggesting they are mounting an armed takeover.\n\nHigher officials in the Corps (the Under-Secretary) are now walking back their support of the Boyar, to the dismay of Retief - a diplomatic Minister to the planet. Retief has a history of working with the Boyar, and is irritated that the Corps are not willing to be any more engaged in helping them than writing a strongly worded note.\n\nRetief and the Chief d’Regime of the Boyar, Georges, travel on a diplomatic mission via a hovercar to deliver the Note to the Aga Kagan. They encounter a party of three Aga Kagan in the foothills as they travel west, and after a very tense and offensive interaction between the parties are escorted to the leader - Exalted Ruler - of the Aga Kagan, Stanley.\n\nStanley is in an opulent tent being served by slave women that feed and provide for the men. Retief and Georges deliver the Note from the Corps and speak with Stanley largely in proverbs until Stanley persuades them to speak more directly. Georges is hot tempered, and overcome with irritation through the conversation with Stanley about the Aga Kagan moving onto Flamme - ultimately leaving the tent. Retief remains curious about Stanley’s motivations and discovers that he is intent on continuing to invade, no matter the consequences. The story ends with the temper of Stanley flaring up, potentially starting a war on planet Flamme.\n"
              },
              {
                "worker_id": "6",
                "uid": "178d39bd67594214a50f706778fe525b",
                "response_text": "Reteif, the Minister to Flamme, approaches an Under-Secretary about the potential invasion that is happening on Flamme. He informs him of the Aga Kagans presence on the planet, and the Boyers very unhappy reaction. He assures the Under-Secretary that he has calmed the Boyers and asked for no action presently, but he wants to know what the Corps will do in response. After delving into the history of the situation--the Corps mainly stays out of the Aga Kagans imperialistic ways--, they reach an agreement to deliver a Protest Note to the Aga Kagans on behalf of the Corps. However, that’s all they will do. \nRetief returns to Flamme and visits with Georges, the Chef d’Regime of the Boyers. They sit in the Governor House, drinking barley whiskey, and discussing the Aga Kagan invasion. Georges informs him of the goat-issue, the ruined oyster patch, while Retief reveals that the Aga Kagan came armed and ready to fight. Georges wants to fight back, but Retief cautions him. Citing the Note, Retief believes they can solve this without any violence. \nThey take off in a car to the Aga Kagans’ territory, past the fertile fields and beautiful lakes. They see goats running through a wheat field, further angering Georges. They are stopped by three Aga Kagans, the leader of which is Blackbeard, and Retief speaks to them in their native language. Using proverbs and confusing language, he gains entry into their camp and the smooth-faced Aga Kagans deliver them to their leader, the Aga Kaga. They are all armed, but Retief advises Georges on how to speak to the leader and reminds him to stick to the plan. \nThey arrive at a large black tent. The Aga Kaga is lounging with several female slaves surrounding him, doting on his every need. He has blue-black hair and he’s very well-dresseed.  they discuss his plans to invade and how they are up for grabs, at least according to the Aga Kaga. The Aga Kaga claims the Boyars are truly the squatters, not his people. They converse in proverbs and diplomatic terms, until Retief brings out the Protest Note. Then they discuss the historical relevance to his conquering ways, and how the Aga Kaga, or Stanley, believes he will win without any protest from the Corps. \nGeorges makes fun of the Aga Kaga, and his words become more and more aggressive. Reteif finds it impossible that the Corps will simply sit back and watch him take over this planet. It’s clear that Retief has some sort of ulteriour motive in this argument. The story ends with the argument evolving into yelling and harsh words. \n"
              },
              {
                "worker_id": "3",
                "uid": "e6191be38a0a4b2790abdf3f34fb4127",
                "response_text": "Two groups, the Boyars and Aga Kagans, are fighting for control of Flamme, a planet the Boyars terraformed. It is up to the humans to act as mediators in this conflict, which they do under the ribbon of the Corps Diplomatique Terrestrienne. Retief, a member of the Corps, wants to give the Boyars official Corps support, but the Under-Secretary is hesitant to say anything too definite and offers to write a note. After the meeting, Magnan invites Retief to a reception later that day with a lot of figure-heads, but Retief wants to get back to Flamme, where he will hopefully keep war from breaking out.  On Flamme, Retief talks to Georges, a Boyar leader. Retief tries to convince Georges to give a diplomatic approach a shot, and advises him on how to proceed. The two of them head out of the capitol, discussing the countryside as Georges expresses his frustration about goats. Retief tries to keep Georges calm and takes his time to unwrap a cigar before he greets the Aga Kagans that approach. After some formalities, Retief explains that they have come to talk with the Aga Kagan leaders. They continue speaking in idioms, but Retief seems to have insulted the Aga Kagans. Retief and Georges eventually make it out of the situation, being led to the Aga Kagan headquarters. Once they arrive, the Aga Kagan known as Blackbeard orders Retief and Georges out of their car, and they are introduced to \"the Exalted One, the Aga Kaga, ruler of the East and West\". Then, the discussion in proverbs continues. Retief introduces his friend as \"M. Georges Duror, Chef d'Regime of the Planetary government\", referring to him as a planetary leader as a power play. This upsets the Aga Kaga, who doesn't consider Georges important. The three eventually sit to discuss the involvement of the Corps, and Retief pulls out the note from the sector's Under-Secretary. Just the statement of titles took at least two pages of the note, and the rest of the note was just as wordy, which frustrated the Aga Kaga, who smugly admitted he had been expecting this complaint. The Aga Kaga, who says to call him Stanley, is thankful that Retief speaks plainly for a diplomat. It turns out Stanley is trying to put up an image for his fellow people but isn't as dedicated to the plan as the others. His primary goal seems to be to live pleasurably while he is alive, but does admit he is there to take over the planet, although he insists it isn't aggressive of him to do. Aga Kaga tries to distract Georges' complaints by admiring his whiskey glass, but threatens the Boyars in the same breath. Retief and Stanley speak in thinly veiled threats citing various historical events, but eventually Retief says that the Corps will be forced to retaliate. It is with this that Georges stands up to defend himself and the story ends with tensions running high. \n"
              }
            ]
          },
          {
            "question_text": "Compare and contrast Georges and Retief.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "2",
                "uid": "0a3381cd0b3c4213bebb7dd6957d565d",
                "response_text": "The two men have dealt with each other prior to the events in the story; Retief addresses Georges by his first name, so they know each other fairly well. However, Retief’s position is higher than Georges’s position. Retief works for the Corps Diplomatique Terrestrienne; Georges works for the Planetary government. Retief knows information about the Aga Kagans that Georges doesn’t know, such as the fact that they are armed, have bulletproof cloaks, and have modern technology on their home planet. He has advised Georges about handling the situation with the Aga Kagans, urging him to prevent the Boyars from attacking the Aga Kagans, and Georges trusts Retief to secure assistance for them. Retief is sympathetic to the Boyars and their situation, trying to persuade Under-Secretary Sternwheeler to support them. When Retief tells Georges that he will personally deliver the Note to the Aga Kagans, Georges wants to help Retief and volunteers to go with him; Retief agrees. It is Retief who develops the plan for handling the Aga Kagans. Georges is impulsive, which leads Retief to keep watch on him. When they encounter the goats in the grain field, Retief has to convince Georges not to hurt the animals, and when the horsemen ride through the grain, Retief has to hold him back again. Retief is calmer in stressful situations and reminds Georges of their strategy: to make their flattery sound like insults and their insults sound like flattery. Georges seems unsure of himself and comments that he should have learned more about their habits before accompanying Retief. Retief has to translate what the Aga Kagans say for Georges in order for him to know what is going on. When the two men meet with Stanley, Retief maintains his calm demeanor, while Georges loses his temper."
              },
              {
                "worker_id": "10",
                "uid": "08ce9506221e4b6c8e164e2c5a4cbc02",
                "response_text": "Retief is a diplomatic Minister to Flamme and has strategic plans guiding his desire to see the Boyar continue to inhabit the planet Flamme. Georges is the Chief d’Regime of the Boyar who has an offensive hot temper and hatred of the Aga Kagan that flares routinely while he accompanies Retief to meet with the Aga Kagan. In this way, their contrasting approaches to interacting with the Aga Kagan are a very suspenseful part of the story.\n\nThe two of them desire a similar outcome - for the Boyar to continue to inhabit Flamme and for the Aga Kagan to leave. Georges and Retief have had a history of working together that provides a sense of camaraderie between them, and Retief desires to help Georges achieve his goals on the planet.\n"
              },
              {
                "worker_id": "6",
                "uid": "178d39bd67594214a50f706778fe525b",
                "response_text": "Retief is the Minister to Flamme, a very diplomatic position. Georges is the Boyar Chef d’Regime, the Boyers’ leader and governor. Retief is a quirky man. His progressive nature and strong morals force him to attempt to save Flamme from the Aga Kagans invasion. However, his manner of doing so is sneaky and tricky, using proverbs to establish himself and make his way to the Aga. Georges, on the other hand, is a little more hot-headed. Although he has been patient so far in waiting for Retief’s aid, he wishes to destroy the invaders and is struggling to hold back his men. When they confront the Aga Kaga, Retief takes the diplomatic approach, while Georges essentially yells at him. Although Georges may be the leader of the Boyers, Retief is the one who devises the plan and leads them to the Aga Kaga. "
              },
              {
                "worker_id": "3",
                "uid": "e6191be38a0a4b2790abdf3f34fb4127",
                "response_text": "Georges, the Boyar Chef d'Regime, has been on the planet Flamme for sixty years, overseeing its terraforming. He is understandably frustrated with the moves that the Aga Kagans are making on the territory of Boyar, and is upset at the amount of damage that the Aga Kagans are causing, as it took a long time to terraform the planet to make it what it is today. Retief is willing to get involved in the issue and backs Georges up but he goes with the flow, acting as a calm source of energy in the political sphere. It is Retief that works to convince Georges that he should consider a diplomatic approach to handling the situation, and travels to the Corps himself to make sure this is an option. Georges gets frustrated easily, as we see with the goats, and Retief is there to calm him down and remind him of the demeanor that will give him a better chance at the negotiating table. Retief speaks Kagan and is well-versed in their cultural norms, which is very useful for the purposes of negotiation. It also makes him very adept at making the Aga Kagans angry, which he does as soon as they encounter each other. On a more surface level, they are members of different groups of people, but they both hold some kind of political status within their groups respectively. "
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "2",
                "uid": "0a3381cd0b3c4213bebb7dd6957d565d",
                "response_text": "The story’s beginning takes place at the headquarters for the Corps Diplomatique Terrestrienne where Retief works, but the rest of the story takes place on the planet Flamme. Sixty years earlier, the Boyars settled on Flamme and set about making it suitable for farming by clearing the jungle, descumming the seas, irrigating the deserts, and setting out forests. For sixty years, the Boyars inhabited the planet by themselves, with only the saurian wildlife presenting a danger to them. Flamme is now a thriving planet. It has a Government House with comfortable lounge furniture, waiters in white jackets, colorful flowers, a lake, a lawn, and colorful flowerbeds. It also has beautiful sunsets. Outside the capital, there are rolling hills of granite. Flamme’s main industry seems to be agriculture; fifty years ago they had bare rock, but they bred special strains of bacteria that broke the rock down to soil where they raised legumes and then grains. The Boyars also have oyster breeding beds. There are roads, although they have pot-holes, and air-cars for transportation. The Aga Kaban headquarters is a large black tent featuring air conditioning and a pennant featuring a lion “couchant in crimson on a field verte.” It has the smell of incense, and someone is playing stringed instruments inside. There are colorful decorations in gold, blue, silver, and green. The Aga Kaba are accustomed to the finer things in life; Stanley even blows his nose on silk cloth. Their foods include grapes, oranges, and bananas, and their beverages include whiskey. Everything about the Aga Kaba’s leader’s tent suggests wealth and luxury.\n"
              },
              {
                "worker_id": "10",
                "uid": "08ce9506221e4b6c8e164e2c5a4cbc02",
                "response_text": "The story is set on the planet of Flamme, which has been terraformed over the last sixty years into a habitable landscape for crop culture and fishing. It opens in the Corps offices where Retief meets with the Under-Secretary.\n\nRetief travels to a fancy government house of the Boyar Chief d’Regime, Georges, that includes a waitstaff and an expansive verandah.\n\nThe diplomatic party travels eight miles west of the capital in a black official air-car flying twin flags of Chief of State and Terrestrial Minister. It continues on some unknown distance through granite hills to the opulent tent of the Exalted Ruler of the Aga Kaga. The tent is outfitted with rich rugs, stringed instruments playing and female slaves serving the men. The rest of the story takes place in this tent.\n"
              },
              {
                "worker_id": "6",
                "uid": "178d39bd67594214a50f706778fe525b",
                "response_text": "Much of The Desert and the Stars by Keither Laumer takes place on a previously barren, uninhabitable planet made fertile by the Boyars. After almost 100 years dedicated to terraforming the planet Flamme, the Boyars finally succeeded in making the planet habitable. With very advanced technology, they made the ground ripe and fertile, wheat stalks and barley floating in the wind. Oysters lie in the pools of water, and the great boulders and rock formations that will soon be eroded by a special bacteria will eventually host more crops. Their sunsets are striking and colorful, with beautiful poplar trees and well-maintained flower beds. \nRetief stays at the Government House with Georges, the Boyar Chef d’Regime. The house overlooks a lake and is surrounding by beautiful gardens. \nThe Aga Kagans have taken over more of the rocky areas, introducing goats into the ecosystem. Their unwanted presence takes away from the belabored beauty that the Boyars created. \n"
              },
              {
                "worker_id": "3",
                "uid": "e6191be38a0a4b2790abdf3f34fb4127",
                "response_text": "Most of the story takes place on Flamme, a planet occupied by the Boyars, the people who terraformed it, but more recently also occupied by the Aga Kagans. There is also a presence of the people from Earth, who work under the umbrella of the Corps Diplomatique Terrestrienne. In the capital city of Flamme, the view from the Government House is gorgeous, with various trees and flowers planted that seem to glow in the purple and red sunset of the planet. Outside of the capital, among the hills, it is less beautified and the streets have potholes. This area used to be covered entirely in rock, but the hills were created by the terraforming and fertilization technology of the Boyars. There are a lot of goats on these hills now, because of the Aga Kagans, and past this area there are stretches of sand and other green areas, which is where the Aga Kagan leaders are. \n"
              }
            ]
          },
          {
            "question_text": "What is the role of history in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "2",
                "uid": "0a3381cd0b3c4213bebb7dd6957d565d",
                "response_text": "The history of Flamme itself is of great relevance to its value to both the Boyars and the Aga Kagans. When the Boyars settled the planet sixty years ago, it was habitable but unable to support much agriculture. They have spent sixty years terraforming Flamme, clearing jungles, descumming seas, irrigating deserts, and planting forests. Fifty years ago, the Boyars learned how to breed a special strain of bacteria that breaks down the granite that covered much of the surface. The granite breaks down to soil, and the Boyars add broad-spectrum fertilizer to make the land arable. The Boyars now have many fields of crops and are continuing to develop new sections for more. Their many years of intensive work in creating farming land and growing crops gives them a vested interest in their settlement.\nThe Aga Kagans are involved in empire-building. They have sent what appear to be goat herders and fishermen to Flamme to begin taking over the land. The goat herders are all male and have rocket launchers. They present a false appearance as homesteaders who lack access to modern technology; in reality, their tents are high-polymer plastic, and their robes are bullet-proof. On their home planet, they have helis and ground cars. The homesteaders set up camp in the middle of farm fields, allow their goats to graze on the crops, and cook their sheep’s brains over dung fires. The fishermen are actually the Aga Kagan navy who come equipped with 40 mm infinite repeaters. The CDT knows that the Aga Kagans have been using this same method of invasion for the past five years in six other worlds. The Aga Kagans hide their modern technology in the places they are invading to dupe the people they are intruding on and to please the older conservatives in their government. \nThe Aga Kagans’ approach to empire-building is based on their knowledge of Earth history. While their society has modern technology, their false appearance of third world trappings can be used to justify their invasions into “more advanced” societies. Stanley admits the Aga Kagans move into an area after others have done the hard work of building the community and civilization so that the Aga Kagans can enjoy the fruits of the others’ labors. By appearing to be a third world civilization, the Aga Kagans can defend their actions and gain empathy with a claim of “legitimate aspirations, for self-determination of formerly exploited peoples.” Stanley also acknowledges his familiarity with empire-builders on Earth and claims he won’t make their mistake of going “too far, too fast.” He couches their approach as “an ancient and honorable custom” and references Mein Kampf, the Communist Manifesto, and Leung’s the Porcelain Wall. Based on the histories of the men behind these works, Stanley knows that the CDT will follow the practice of appeasement and allow the Aga Kagans to make their little land-grabs until they are positioned so that they cannot be stopped.\n"
              },
              {
                "worker_id": "10",
                "uid": "08ce9506221e4b6c8e164e2c5a4cbc02",
                "response_text": "Stanley manipulates a historically exploited group, the Aga Kagan, to gain power. Stanley appears to be interested in exploiting whatever means necessary to acquire such power, and has positioned himself as the Exalted Ruler of the Aga Kagan to do so. He speaks negatively about the Aga Kagan and their elders which he pays lip service to, but ultimately executes his own strategies that may or may not be in line with the historical actions of their people. Stanley uses the history of the Aga Kagan as formerly exploited people to place the Corps into a complicated diplomatic situation to get his way that he relishes in and laughs about during the diplomatic visit from Retief and Georges."
              },
              {
                "worker_id": "6",
                "uid": "178d39bd67594214a50f706778fe525b",
                "response_text": "The leader of the Aga Kagans uses history as a way to justify his actions and prove to himself and others that he will face little to no resistance in the process. He references colonial imperialism, colonization, and some of the most hated figures in history as his predecessors. By relying on the Corps silence, he truly believes that he will be able to conquer Flamme, destroy the Boyars, and do all this without any humanitarian uprising. \nBy taking it slow and biding their times, the Aga Kagans will acquire their empire slowly but surely. Based on previous knowledge, the Aga truly believes that the Corps will simply accept their invasion, so long as they don’t move too quickly. He cites Hitler, Leung, and Stalin as references: these people moved too far too fast. \nHistory also sets up the present conflict. Sixty years earlier, the Corps encouraged and asked the Boyars to terraform Flamme and transform it into something beautiful. The Boyars did so, believing the Corps wwere on their side. Now, half a century later with the Aga Kagans encroaching on their territory, the Boyars are waiting for their previously promised Corps support and coming up empty. Interestingly enough, the Boyars asked the Aga Kagans to co-settle Flamme with them, but both the Corps and the Aga Kagans refused. \n"
              },
              {
                "worker_id": "3",
                "uid": "e6191be38a0a4b2790abdf3f34fb4127",
                "response_text": "Flamme had been a wasteland, but was terraformed by the Boyars. The planet itself has a lot of history, which is part of the current conflict. The Aga Kagans had not wanted to help terraform the planet, but now that the hard work was done over many decades, they wanted to move in. History also plays a role in communication more generally. The Aga Kagans communicate in proverbs, which act as idioms referencing specific historical events. The Aga Kagans are also familiar with the history of other cultures, and aim to control the narrative of the history of various planets, deciding who is considered a warmonger versus labeling their own takeovers in a positive light. The Aga Kaga knows a lot about the history of Earth as well, and cites a number of historical events to Reteif during their impassioned discussion, along with names of famous historical manifestos. The Aga Kaga tries to use these historical events as points in an analogy, much like the proverbs his people communicate with regularly.  "
              }
            ]
          },
          {
            "question_text": "What is the role of the Aga Kagans in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "2",
                "uid": "0a3381cd0b3c4213bebb7dd6957d565d",
                "response_text": "The Aga Kagans are an empire-building society that has been increasing their presence in six other worlds by the time they appear on Flamme. The Aga Kagans send in men disguised as goat herders and fishermen who are actually armed and equipped with modern accessories. The Aga Kagans have a plan to build their empire by invading other worlds following the model of Adolf Hitler, but they plan to avoid his mistake of moving “too far, too fast.” The Aga Kagan leader, Stanley, is well-educated and a manipulator. He plays to the older conservative Aga Kagans by allowing the third-world trappings of goat herders to be used while he actually has disdain for their traditional values, but his charade gives him what he wants. The Aga Kagans wait until an area has done the hard work of building its civilization and becoming sustainable before he moves his men in. Although the CDT is aware of the Aga Kagans’ actions, it wants to avoid warfare and meets the intrusions with diplomacy, but all the while, the Aga Kagans are ensconcing themselves for a permanent takeover of the places where they have intruded.\n"
              },
              {
                "worker_id": "10",
                "uid": "08ce9506221e4b6c8e164e2c5a4cbc02",
                "response_text": "In the story, the Aga Kagan are portrayed as antagonists to the Boyar. They appear to be manipulated by Stanley into actions that may no longer be entirely in line with the beliefs of the Aga Kagan elders.\nThe Aga Kagans are a group that has been moving onto the planet Flamme for the past five years. They’ve landed military equipment that suggests they are willing to move in violently if necessary, but have not yet been met with resistance from the Boyar who have been living on the planet for sixty years. \n\n"
              },
              {
                "worker_id": "6",
                "uid": "178d39bd67594214a50f706778fe525b",
                "response_text": "The Aga Kagans are a conquering people, known for their planet-grabbing tendencies. They have currently set up shop on the Boyer-populated planet, Flamme. After the Boyers spent 60 years redoing the planet and making it fertile and inhabitable, the Aga Kagans swooped in and are plotting an extremely slow invasion. They arrived with long robes and goat-skin tents, as well as lots and lots of goats. However, these robes and tents are actually made out of a special bullet-proof material. The goats were just for show. \nWith an incredible arsenal, an army of “homesteaders,” and armor to match, the Aga Kagans are fully prepared to invade the Boyers. They are the antagonist of the story, especially their leader, the Aga Kaga or Stanley, as he likes to be called. \n"
              },
              {
                "worker_id": "3",
                "uid": "e6191be38a0a4b2790abdf3f34fb4127",
                "response_text": "The Aga Kagans seem to be making a move on the territory that the Boyars consider theirs. The Aga Kagans making a claim on this land could be an act of war, and the Corps wants to avoid a war as much as possible. They ruin some of what the Boyars have created, including an oyster breeding bed. They're on at least six planets and have spent at least the past five years trying to expand their territories. In this way, they act as the antagonists of the story, as a group that presents a challenge for the Boyars and the people from Earth to work against. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4890,
        "document_length_chars": 29242
      }
    }
  ]
}