{
  "item_metadata": {
    "item_id": "61405",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61405",
      "content": "DOWN TO THE WORLDS OF MEN\n \n\n BY ALEXEI PANSHIN\n \n\n The ancient rule was sink or swim—swim in the miasma of a planet without spaceflight, or sink to utter destruction!\n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, July 1963. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n I\n \n The horses and packs were loaded before we went aboard the scoutship. The scout bay is no more than a great oversized airlock with a dozen small ships squatting over their tubes, but it was the last of the Ship that I might ever see, so I took a long final look from the top of the ramp.\n \n There were sixteen of us girls and thirteen boys. We took our places in the seats in the center of the scout. Riggy Allen made a joke that nobody bothered to laugh at, and then we were all silent. I was feeling lost and just beginning to enjoy it when Jimmy Dentremont came over to me. He's red-headed and has a face that makes him look about ten. An intelligent runt like me.\n \n He said what I expected. \"Mia, do you want to go partners if we can get together when we get down?\"\n \n I guess he thought that because we were always matched on study I liked him. Well, I did when I wasn't mad at him, but now I had that crack he'd made about being a snob in mind, so I said, \"Not likely. I want to come back alive.\" It wasn't fair, but it was a good crack and he went back to his place without saying anything.\n \n My name is Mia Havero. I'm fourteen, of course, or I wouldn't be telling this. I'm short, dark and scrawny, though I don't expect that scrawniness to last much longer. Mother is very good looking. In the meantime, I've got brains as a consolation.\n \n After we were all settled, George Fuhonin, the pilot, raised the ramps. We sat there for five minutes while they bled air out of our tube and then we just ... dropped. My stomach turned flips. We didn't have to leave that way, but George thinks it's fun to be a hot pilot.\n \n Thinking it over, I was almost sorry I'd been stinking to Jimmy D. He's the only competition I have my own age. The trouble is, you don't go partners with the competition, do you? Besides, there was still that crack about being a snob.\n \n The planet chosen for our Trial was called Tintera. The last contact the Ship had had with it—and we were the ones who dropped them—was almost 150 years ago. No contact since. That had made the Council debate a little before they dropped us there, but they decided it was all right in the end. It didn't make any practical difference to us kids because they never tell you anything about the place they're going to drop you. All I knew was the name. I wouldn't have known that much if Daddy weren't Chairman of the Council.\n \n I felt like crawling in a corner of the ship and crying, but nobody else was breaking down, so I didn't. I did feel miserable. I cried when I said good-by to Mother and Daddy—a real emotional scene—but that wasn't in public.\n \n \n\n \n It wasn't the chance of not coming back that bothered me really, because I never believed that I wouldn't. The thought that made me unhappy was that I would have to be on a planet for a whole month. Planets make me feel wretched.\n \n The gravity is always wrong, for one thing. Either your arches and calves ache or every time you step you think you're going to trip on a piece of fluff and break your neck. There are vegetables everywhere and little grubby things just looking for you to crawl on. If you can think of anything creepier than that, you've got a real nasty imagination. Worst of all, planets stink. Every single one smells—I've been on enough to know that. A planet is all right for a Mud-eater, but not for me.\n \n We have a place in the Ship like that—the Third Level—but it's only a thousand square miles and any time it gets on your nerves you can go up a level or down a level and be back in civilization.\n \n When we reached Tintera, they started dropping us. We swung over the sea from the morning side and then dropped low over gray-green forested hills. Finally George spotted a clear area and dropped into it. They don't care what order you go in, so Jimmy D. jumped up, grabbed his gear and then led his horse down the ramp. I think he was still smarting from the slap I'd given him.\n \n In a minute we were airborne again. I wondered if I would ever see Jimmy—if he would get back alive.\n \n It's no game we play. When we turn fourteen, they drop us on the nearest colonized planet and come back one month later. That may sound like fun to you, but a lot of us never come back alive.\n \n Don't think I was helpless. I'm hell on wheels. They don't let us grow for fourteen years and then kick us out to die. They prepare us. They do figure, though, that if you can't keep yourself alive by the time you're fourteen, you're too stupid, foolish or unlucky to be any use to the Ship. There's sense behind it. It means that everybody on the Ship is a person who can take care of himself if he has to. Daddy says that something has to be done in a closed society to keep the population from decaying mentally and physically, and this is it. And it helps to keep the population steady.\n \n I began to check my gear out—sonic pistol, pickup signal so I could be found at the end of the month, saddle and cinches, food and clothes. Venie Morlock has got a crush on Jimmy D., and when she saw me start getting ready to go, she began to check her gear, too. At our next landing, I grabbed Ninc's reins and cut Venie out smoothly. It didn't have anything to do with Jimmy. I just couldn't stand to put off the bad moment any longer.\n \n The ship lifted impersonally away from Ninc and me like a rising bird, and in just a moment it was gone. Its gray-blue color was almost the color of the half-overcast sky, so I was never sure when I saw it last.\n \n \n\n II\n \n The first night was hell, I guess because I'm not used to having the lights out. That's when you really start to feel lonely, being alone in the dark. When the sun disappears, somehow you wonder in your stomach if it's really going to come back. But I lived through it—one day in thirty gone.\n \n I rode in a spiral search pattern during the next two days. I had three things in mind—stay alive, find people and find some of the others. The first was automatic. The second was to find out if there was a slot I could fit into for a month. If not, I would have to find a place to camp out, as nasty as that would be. The third was to join forces, though not with that meatball Jimmy D.\n \n No, he isn't really a meatball. The trouble is that I don't take nothing from nobody, especially him, and he doesn't take nothing from nobody, especially me. So we do a lot of fighting.\n \n I had a good month for Trial. My birthday is in November—too close to Year End Holiday for my taste, but this year it was all right. It was spring on Tintera, but it was December in the Ship, and after we got back we had five days of Holiday to celebrate. It gave me something to look forward to.\n \n In two days of riding, I ran onto nothing but a few odd-looking animals. I shot one small one and ate it. It turned out to taste pretty good, though not as good as a slice from Hambone No. 4, to my mind the best meat vat on the Ship. I've eaten things so gruey-looking that I wondered that anybody had the guts to try them in the first place and they've turned out to taste good. And I've seen things that looked good that I couldn't keep on my stomach. So I guess I was lucky.\n \n On the third day, I found the road. I brought Ninc down off the hillside, losing sight of the road in the trees, and then reaching it in the level below. It was narrow and made of sand spread over a hard base. Out of the marks in the sand, I could pick out the tracks of horses and both narrow and wide wheels. Other tracks I couldn't identify.\n \n One of the smartest moves in history was to include horses when they dropped the colonies. I say \"they\" because, while we did the actual dropping, the idea originated with the whole evac plan back on Earth. Considering how short a time it was in which the colonies were established, there was not time to set up industry, so they had to have draft animals.\n \n The first of the Great Ships was finished in 2025. One of the eight, as well as the two that were being built then, went up with everything else in the Solar System in 2041. In that sixteen years 112 colonies were planted. I don't know how many of those planets had animals that could have been substituted but, even if they had, they would have had to be domesticated from scratch. That would have been stupid. I'll bet that half the colonies would have failed if they hadn't had horses.\n \n \n\n \n We'd come in from the west over the ocean, so I traveled east on the road. That much water makes me nervous, and roads have to go somewhere.\n \n I came on my first travelers three hours later. I rounded a tree-lined bend, ducking an overhanging branch, and pulled Ninc to a stop. There were five men on horseback herding a bunch of the ugliest creatures alive.\n \n They were green and grotesque. They had squat bodies, long limbs and knobby bulges at their joints. They had square, flat animal masks for faces. But they walked on their hind legs and they had paws that were almost hands, and that was enough to make them seem almost human. They made a wordless, chilling, lowing sound as they milled and plodded along.\n \n I started Ninc up again and moved slowly to catch up with them. All the men on horseback had guns in saddle boots. They looked as nervous as cats with kittens. One of them had a string of packhorses on a line and he saw me and called to another who seemed to be the leader. That one wheeled his black horse and rode back toward me.\n \n He was a middle-aged man, maybe as old as my Daddy. He was large and he had a hard face. Normal enough, but hard. He pulled to a halt when we reached each other, but I kept going. He had to come around and follow me. I believe in judging a person by his face. A man can't help the face he owns, but he can help the expression he wears on it. If a man looks mean, I generally believe that he is. This one looked mean. That was why I kept riding.\n \n He said, \"What be you doing out here, boy? Be you out of your head? There be escaped Losels in these woods.\"\n \n I told you I hadn't finished filling out yet, but I hadn't thought it was that bad. I wasn't ready to make a fight over the point, though. Generally, I can't keep my bloody mouth shut, but now I didn't say anything. It seemed smart.\n \n \"Where be you from?\" he asked.\n \n I pointed to the road behind us.\n \n \"And where be you going?\"\n \n I pointed ahead. No other way to go.\n \n He seemed exasperated. I have that effect sometimes. Even on Mother and Daddy, who should know better.\n \n We were coming up on the others now, and the man said, \"Maybe you'd better ride on from here with us. For protection.\"\n \n He had an odd way of twisting his sounds, almost as though he had a mouthful of mush. I wondered whether he were just an oddball or whether everybody here spoke the same way. I'd never heard International English spoken any way but one, even on the planet Daddy made me visit with him.\n \n One of the other outriders came easing by then. I suppose they'd been watching us all the while. He called to the hard man.\n \n \"He be awfully small, Horst. I doubt me a Losel'd even notice him at all. We mought as well throw him back again.\"\n \n The rider looked at me. When I didn't dissolve in terror as he expected, he shrugged and one of the other men laughed.\n \n The hard man said to the others, \"This boy will be riding along with us to Forton for protection.\"\n \n I looked down at the plodding, unhappy creatures they were driving along and one looked back at me with dull, expressionless golden eyes. I felt uncomfortable.\n \n I said, \"I don't think so.\"\n \n What the man did then surprised me. He said, \"I do think so,\" and reached for the rifle in his saddle boot.\n \n I whipped my sonic pistol out so fast that he was caught leaning over with the rifle half out. His jaw dropped. He knew what I held and he didn't want to be fried.\n \n I said, \"Ease your rifles out and drop them gently to the ground.\"\n \n They did, watching me all the while with wary expressions.\n \n When all the rifles were on the ground, I said, \"All right, let's go.\"\n \n They didn't want to move. They didn't want to leave the rifles. I could see that. Horst didn't say anything. He just watched me with narrowed eyes. But one of the others held up a hand and in wheedling tones said, \"Look here, kid....\"\n \n \"Shut up,\" I said, in as mean a voice as I could muster, and he did. It surprised me. I didn't think I sounded that mean. I decided he just didn't trust the crazy kid not to shoot.\n \n After twenty minutes of easy riding for us and hard walking for the creatures, I said, \"If you want your rifles, you can go back and get them now.\" I dug my heels into Ninc's sides and rode on. At the next bend I looked back and saw four of them holding their packhorses and the creatures still while one beat a dust-raising retreat down the road.\n \n I put this episode in the \"file and hold for analysis\" section in my mind and rode on, feeling good. I think I even giggled once. Sometimes I even convince myself that I'm hell on wheels.\n \n \n\n III\n \n When I was nine, my Daddy gave me a painted wooden doll that my great-grandmother brought from Earth. The thing is that inside it, nestled one in another, are eleven more dolls, each one smaller than the last. I like to watch people when they open it for the first time.\n \n My face must have been like that as I rode along the road.\n \n The country leveled into a great rolling valley and the trees gave way to great farms and fields. In the fields, working, were some of the green creatures, which surprised me since the ones I'd seen before hadn't seemed smart enough to count to one, let alone do any work.\n \n But it relieved me. I thought they might have been eating them or something.\n \n I passed two crossroads and started to meet more people, but nobody questioned me. I met people on horseback, and twice I met trucks moving silently past. And I overtook a wagon driven by the oldest man I've seen in my life. He waved to me, and I waved back.\n \n Near the end of the afternoon I came to the town, and there I received a jolt that sickened me.\n \n By the time I came out on the other side, I was sick. My hands were cold and sweaty and my head was spinning, and I wanted to kick Ninc to a gallop.\n \n I rode slowly in, looking all around, missing nothing. The town was all stone, wood and brick. Out of date. Out of time, really. There were no machines more complicated than the trucks I'd seen earlier. At the edge of town, I passed a newspaper office with a headline pasted in the window—INVASION! I remember that. I wondered about it.\n \n But I looked most closely at the people. In all that town, I didn't see one girl over ten years old and no grown-up women at all. There were little kids, there were boys and there were men, but no girls. All the boys and men wore pants, and so did I, which must have been why Horst and his buddies assumed I was a boy. It wasn't flattering; but I decided I'd not tell anybody different until I found what made the clocks tick on this planet.\n \n But that wasn't what bothered me. It was the kids. My God! They swarmed. I saw a family come out of a house—a father and four children. It was the most foul thing I've ever seen. It struck me then—these people were Free Birthers! I felt a wave of nausea and I closed my eyes until it passed.\n \n \n\n \n The first thing you learn in school is that if it weren't for idiot and criminal people like these, Earth would never have been destroyed. The evacuation would never have had to take place, and eight billion people wouldn't have died. There wouldn't have been eight billion people. But, no. They bred and they spread and they devoured everything in their path like a cancer. They gobbled up all the resources that Earth had and crowded and shoved one another until the final war came.\n \n I am lucky. My great-great-grandparents were among those who had enough foresight to see what was coming. If it hadn't been for them and some others like them, there wouldn't be any humans left anywhere. And I wouldn't be here. That may not scare you, but it scares me.\n \n What happened before, when people didn't use their heads and wound up blowing the Solar System apart, is something nobody should forget. The older people don't let us forget. But these people had, and that the Council should know.\n \n For the first time since I landed on Tintera, I felt really frightened. There was too much going on that I didn't understand. I felt a blind urge to get away, and when I reached the edge of town, I whomped Ninc a good one and gave him his head.\n \n I let him run for almost a mile before I pulled him down to a walk again. I couldn't help wishing for Jimmy D. Whatever else he is, he's smart and brains I needed.\n \n How do you find out what's going on? Eavesdrop? That's a lousy method. For one thing, people can't be depended on to talk about the things you want to hear. For another, you're likely to get caught. Ask somebody? Who? Make the mistake of bracing a fellow like Horst and you might wind up with a sore head and an empty pocket. The best thing I could think of was to find a library, but that might be a job.\n \n I'd had two bad shocks on this day, but they weren't the last. In the late afternoon, when the sun was starting to sink and a cool wind was starting to ripple the tree leaves, I saw the scoutship high in the sky. The dying sun colored it a deep red. Back again? I wondered what had gone wrong.\n \n I reached down into my saddlebag and brought out my contact signal. The scoutship swung up in the sky in a familiar movement calculated to drop the stomach out of everybody aboard. George Fuhonin's style. I triggered the signal, my heart turning flips all the while. I didn't know why he was back, but I wasn't really sorry.\n \n The ship swung around until it was coming back on a path almost over my head, going in the same direction. Then it went into a slip and started bucking so hard that I knew this wasn't hot piloting at all, just plain idiot stutter-fingered stupidity at the controls. As it skidded by me overhead, I got a good look at it and knew that it wasn't one of ours. Not too different, but not ours.\n \n \n\n \n One more enigma. Where was it from? Not here. Even if you know how, and we wouldn't tell these Mud-eaters how, a scoutship is something that takes an advanced technology to build.\n \n \n\n \n I felt defeated and tired. Not much farther along the road, I came to a campsite with two wagons pulled in for the night, and I couldn't help but pull in myself. The campsite was large and had two permanent buildings on it. One was a well enclosure and the other was little more than a high-walled pen. It didn't even have a roof.\n \n I set up camp and ate my dinner. In the wagon closest to me were a man, his wife and their three children. The kids were running around and playing, and one of them ran close to the high-walled pen. His father came and pulled him away.\n \n The kids weren't to blame for their parents, but when one of them said hello to me, I didn't even answer. I know how lousy I would feel if I had two or three brothers and sisters, but it didn't strike me until that moment that it wouldn't even seem out of the ordinary to these kids. Isn't that horrible?\n \n About the time I finished eating, and before it grew dark, the old man I had seen earlier in the day drove his wagon in. He fascinated me. He had white hair, something I had read about in stories but had never seen before.\n \n When nightfall came, they started a large fire. Everybody gathered around. There was singing for awhile, and then the father of the children tried to pack them off to bed. But they weren't ready to go, so the old man started telling them a story. In the old man's odd accent, and sitting there in the campfire light surrounded by darkness, it seemed just right.\n \n It was about an old witch named Baba Yaga who lived in the forest in a house that stood on chicken legs. She was the nasty stepmother of a nice little girl, and to get rid of the kid, she sent her on a phony errand into the deep dark woods at nightfall. I could appreciate the poor girl's position. All the little girl had to help her were the handkerchief, the comb and the pearl that she had inherited from her dear dead mother. But, as it turned out, they were just enough to defeat nasty old Baba Yaga and bring the girl safely home.\n \n I wished for the same for myself.\n \n The old man had just finished and they were starting to drag the kids off to bed when there was a commotion on the road at the edge of the camp. I looked but my eyes were adjusted to the light of the fire and I couldn't see far into the dark.\n \n A voice there said, \"I'll be damned if I'll take another day like this one, Horst. We should have been here hours ago. It be your fault we're not.\"\n \n Horst growled a retort. I decided that it was time for me to leave the campfire. I got up and eased away as Horst and his men came up to the fire, and cut back to where Ninc was parked. I grabbed up my blankets and mattress and started to roll them up. I had a pretty good idea now what they used the high-walled pen for.\n \n I should have known that they would have to pen the animals up for the night. I should have used my head. I hadn't and now it was time to take leave.\n \n I never got the chance.\n \n \n\n \n I was just heaving the saddle up on Ninc when I felt a hand on my shoulder and I was swung around.\n \n \"Well, well. Horst, look who we have here,\" he called. It was the one who'd made the joke about me being beneath the notice of a Losel. He was alone with me now, but with that call the others would be up fast.\n \n I brought the saddle around as hard as I could and then up, and he went down. He started to get up again, so I dropped the saddle on him and reached inside my jacket for my gun. Somebody grabbed me then from behind and pinned my arms to my side.\n \n I opened my mouth to scream—I have a good scream—but a rough smelly hand clamped down over it before I had a chance to get more than a lungful of air. I bit down hard—5000 lbs. psi, I'm told—but he didn't let me go. I started to kick, but Horst jerked me off my feet and dragged me off.\n \n When we were behind the pen and out of earshot of the fire, he stopped dragging me and dropped me in a heap. \"Make any noise,\" he said, \"and I'll hurt you.\"\n \n That was a silly way to put it, but somehow it said more than if he'd threatened to break my arm or my head. It left him a latitude of things to do if he pleased. He examined his hand. There was enough moonlight for that. \"I ought to club you anyway,\" he said.\n \n The one I'd dropped the saddle on came up then. The others were putting the animals in the pen. He started to kick me, but Horst stopped him.\n \n \"No,\" he said. \"Look through the kid's gear, bring the horse and what we can use.\"\n \n The other one didn't move. \"Get going, Jack,\" Horst said in a menacing tone and they stood toe to toe for a long moment before Jack finally backed down. It seemed to me that Horst wasn't so much objecting to me being kicked, but was rather establishing who did the kicking in his bunch.\n \n But I wasn't done yet. I was scared, but I still had the pistol under my jacket.\n \n Horst turned back to me and I said, \"You can't do this and get away with it.\"\n \n He said, \"Look, boy. You may not know it, but you be in a lot of trouble. So don't give me a hard time.\"\n \n He still thought I was a boy. It was not time to correct him, but I didn't like to see the point go unchallenged. It was unflattering.\n \n \"The courts won't let you get away with this,\" I said. I'd passed a courthouse in the town with a carved motto over the doors: EQUAL JUSTICE UNDER THE LAW or TRUTH OUR SHIELD AND JUSTICE OUR SWORD or something stuffy like that.\n \n He laughed, not a phony, villian-type laugh, but a real laugh, so I knew I'd goofed.\n \n \"Boy, boy. Don't talk about the courts. I be doing you a favor. I be taking what I can use of your gear, but I be letting you go. You go to court and they'll take everything and lock you up besides. I be leaving you your freedom.\"\n \n \"Why would they be doing that?\" I asked. I slipped my hand under my jacket.\n \n \"Every time you open your mouth you shout that you be off one of the Ships,\" Horst said. \"That be enough. They already have one of you brats in jail in Forton.\"\n \n I was about to bring my gun out when up came Jack leading Ninc, with all my stuff loaded on. I mentally thanked him.\n \n He said, \"The kid's got some good equipment. But I can't make out what this be for.\" He held out my pickup signal.\n \n Horst looked at it, then handed it back. \"Throw it away,\" he said.\n \n I leveled my gun at them—Hell on Wheels strikes again! I said, \"Hand that over to me.\"\n \n Horst made a disgusted sound.\n \n \"Don't make any noise,\" I said, \"or you'll fry. Now hand it over.\"\n \n I stowed it away, then paused with one hand on the leather horn of the saddle. \"What's the name of the kid in jail in Forton.\"\n \n \"I can't remember,\" he said. \"But it be coming to me. Hold on.\"\n \n I waited. Then suddenly my arm was hit a numbing blow from behind and the gun went flying. Jack pounced after it and Horst said, \"Good enough,\" to the others who'd come up behind me.\n \n I felt like a fool.\n \n Horst stalked over and got the signal. He dropped it on the ground and said in a voice far colder than mine could ever be, because it was natural and mine wasn't, \"The piece be yours.\" Then he tromped on it until it cracked and fell apart.\n \n Then he said, \"Pull a gun on me twice. Twice.\" He slapped me so hard that my ears rang. \"You dirty little punk.\"\n \n I said calmly, \"You big louse.\"\n \n It was a time I would have done better to keep my mouth shut. All I can remember is a flash of pain as his fist crunched against the side of my face and then nothing.\n \n Brains are no good if you don't use them.",
      "metadata": {
        "title": "Down to the Worlds of Men",
        "author": "Alexei Panshin",
        "passage_id": "61405",
        "uid": "24bd0bfd7655417d9dc72f6eec65e559",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "104",
                "uid": "8ae98e9c174643e8a6c42be06fd58733",
                "response_text": "The story begins on a scoutship with 29 fourteen-year-olds. The narrator of the story is Mia Havero, she is short and skinny. Her father is the Chairman of the Council. The fourteen-year-olds are being dropped on a planet called Tintera for their Trial. \n\n\nMia details her dislike of the planet. She rides on her horse Ninc for three days before she comes across other people. The men and Mia get into a disagreement because she does not want to join them. Mia proceeds to point her weapon and them. She tells them to drop their rifles on the ground and only lets them return to retrieve them once Mia and the men are a 20-minute ride away from the weapons. \n\nMia continues on riding her horse and passes a town where she meets more people. Eventually, Mia ends up at a campsite where she intends to rest and eat. However, the men who she encountered before and flashed her weapon at, find her at the campsite. She is grabbed from behind. The men have their grip on her, preventing her from escaping from them. The men destroy her pickup signal and she is punched in the face by one of the men. \n"
              },
              {
                "worker_id": "103",
                "uid": "308f87dd950a424cbd907c08a38dcdba",
                "response_text": "First we see the main character, Mia, in a scoutship, where she and another fifteen girls and thirteen boys are being sent to the planet Tintera for their Trial. All of the inhabitants at the age of fourteen will be send to the Trial where they have to survive thirty days on a colonized planet. Those make to the end and are brought back by the ship are considered as useful to the society while those that cannot make it are not. \n\nMia spends the first night by her own after declining Jimmy Dentremont’s invitation, a boy who is also on the Trial, to become partners, and avoiding Venie Morlock, a girl on Trial and has a crush on Jimmy Dentremont. Finally on the third day, Mia goes on the road, travelling east with her horse, Ninc. She meets Horst and his group of men. After they threaten her to go along with them, she pulls out her gun before they do. So she tells them to drop their weapons and walk along with her. Later she lets them go back to retrieve their guns. Afterwards, she gets to a village where she is shocked again. Here she sees the Free Birthers who destroyed Earth. But apparently, they seem to have forgotten what horrifying things they have done to Earth, to mankind. Then later, Mia sees the scoutship again, but the driver is not one of theirs, which is weird.\n\nAs she gets to a campsite, she pulls herself in. There she sees a family with three kids. They have a campfire and tell bedtime stories. Not long after, Horst and his group get here as well. Mia tries to escape, but she can’t and is caught by Horst. She tries to use her gun again when they take her pickup signal, but this time she gets caught and is knocked unconscious. "
              },
              {
                "worker_id": "102",
                "uid": "39b3a3738b364bb0b930ab1941093374",
                "response_text": "Mia Havero is a fourteen year old girl who lives on a spaceship home to a human civilization. She, along with twenty eight other young adults are about to be dropped off on a colonized planet Tintera, where they will undergo their Trial. Members of the Ship’s population, upon turning fourteen, are dropped off on a planet with a horse, food and clothes, a pistol, and a pickup signal so that they may be picked up a month later, forced to survive on their wits and skills. \n\tJimmy Dentremont, one of the children about to be dropped off whom Mia considers to be of similar intelligence as herself, approaches her and asks if she wants to partner up during the trial. She teasingly refuses, and Jimmy disembarks the ship to begin his trial. Mia is dropped off at another location with her horse Ninc, and we learn of her dislike for planets: she is unaccustomed to the gravity, the fauna, and the smell.  \n\tOn her third day of riding, Mia discovers a road and five men herding grotesque green creatures. As she catches up with them, she notices that they are armed. Their leader, who she judges to have a mean face, invites her to ride with them to Forton. When she refuses, he gestures towards his rifle; however, she quickly draws her sonic pistol and forces the men to disarm. Twenty minutes of riding later, she leaves the men, allowing them to return for their weapons. \n\tMia enters a town whereupon she encounters a family with four children and realizes that the population of the planet engage in unregulated reproduction. She is disgusted by this behaviour, remembering that it was such behaviour that led to the overpopulation of Earth and the need to evacuate onto the Great Ships. Overhead, she notices a scout ship, similar to the one that dropped her off on Tintera, and wonders what it is doing there. \n\tNow at a campsite, Mia rests and observes the interaction between an old man and a family with three children. He tells the children the tale of Baba Yaga, an evil witch who lived in a house that stood on chicken legs. Baba Yaga’s stepdaughter is sent to live with her, and foils her stepmother’s attempt to get rid of her. \n\tSuddenly, Mia notices commotion at the edge of the camp, and realizes that the five men whom she held at gunpoint earlier had arrived. As she makes to leave, one of the men pins her and calls over the others. He tells Mia that it is obvious she is from a Ship, and that one of her friends was imprisoned in Forton. Mia quickly levels her gun at him, asking for the name of her friend. As he stalls, she is struck by another one of the men, and her pickup signal is destroyed shortly before she is knocked out.\n"
              },
              {
                "worker_id": "101",
                "uid": "95215f5ccaec46e091924e2317b7e810",
                "response_text": "Mia is a fourteen year old girl aboard Earth's ship after the planet's evacuation. When all children on the ship turn fourteen, they go through the Trial, where they are dropped on a random colonized planet and told to survive on their own for a month. Mia is waiting to be dropped on Tintera, a planet that has had little to no contact with the ship for over a century. She is accompanied by other children that she has known, some friends, most of them she is indifferent about. Once Mia is dropped onto Tintera along with her horse Ninc, she gets through the first night feeling frightened and lonely. For the next few days, she roams the planet in search of people to stick with. As she explores, she notes that Tintera is home to odd animals. Mia eventually finds a road and travels down it, meeting a group of men on horseback. The men question Mia, calling her a boy, and insist that she join them. Mia declines, to which the men draw their weapons at her. However, she raises her sonic pistol at them and is able to get away. Mia continues until she reaches a town, where she discovers that the people there are Free Birthers: people who were blamed for Earth's downfall and have multiple children. Mia is shocked by this, determined to find out more about the planet. Later that night, she comes across a campsite where she decides to turn in. She is surrounded by families and an old man who tells a story by the campfire about Baba Yaga, a wicked stepmother who sends her stepdaughter on a dangerous quest into the woods. As bedtime approaches, the men on horseback from earlier return, where they find Mia and attack her, robbing her of her gear and horse. Mia insults the men and is then knocked out."
              }
            ]
          },
          {
            "question_text": "What was Mia taught about Earth being destroyed?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "104",
                "uid": "8ae98e9c174643e8a6c42be06fd58733",
                "response_text": "Mia is taught that those who destroyed Earth were not smart and that they deserve punishment for their actions. According to her, Earth was evacuated because of overpopulation. People had too many children that required more resources than Earth was capable of providing. Consequently, there was a fight over the remaining resources that caused a war. \n\nMia has great-great-grandparents that were among those who anticipated the destruction of Earth and prepared to leave. \n\nIn addition, Mia talks about how humans left Earth. She says there were Great Ships built around 2025. The Great Ships and other things went into the Solar System in 2041. The humans that escaped established 112 colonies in the first 16 years. During this retelling of what she was taught, she emphasizes that horses were important to the success of the new colonies. \n"
              },
              {
                "worker_id": "103",
                "uid": "308f87dd950a424cbd907c08a38dcdba",
                "response_text": "Mia knows that there was a evac plan on Earth long ago, the evac plan needed to be implemented and colonies had to be established in a very short amount of time. In 2025, first of the eight Great Ships was finished. Then before 2041, 112 colonies were created. Mia believes that bringing horses to the colonies was an important factor that lead to the success of those colonies. Even those few planets could have had substitutes for horses, they had to be domesticated and trained. \n\nLater we acknowledge that Mia has learned about the Free Birthers in school. They destroyed Earth. Those Free Birthers basically just bred and spread, and the population on earth reached 8 billion. With so many people, resources became limited, which in the end lead to the war that destroyed Earth, and 8 billion people died along with the blow up of the Solar System. Thus, without those Free Birthers, there would never be 8 billion people on Earth, then the evac plan would never take place, and those 8 billion people would not have to die. If his great-great-grandparents did not have the foresight he did, Mia might not even be alive. "
              },
              {
                "worker_id": "102",
                "uid": "39b3a3738b364bb0b930ab1941093374",
                "response_text": "Mia is taught that, ultimately, Earth’s destruction is attributable to Free Birthers, those who have an unregulated number of children. Because of the resulting overpopulation, the resources of Earth were consumed and contested, resulting in the death of eight billion people and the final war which tore apart the solar system in 2041. The first of the Great Ships, like the one on which Mia lives, was built sixteen years prior, and, in the intervening years, 112 colonies had been established. \n"
              },
              {
                "worker_id": "101",
                "uid": "95215f5ccaec46e091924e2317b7e810",
                "response_text": "Mia was taught, along with all young students, that Earth was destroyed due to an overpopulation problem. \"Free Birthers\" are to blame for the destruction of Earth; these are people that had multiple children, and according to what Mia was taught, used up all the limited resources that Earth had. By a certain point, Earth had become too overcrowded, with over eight billion people as a population. This ultimately led to a final war, and an evacuation."
              }
            ]
          },
          {
            "question_text": "What about the planet Tintera does Mia note is different than what she is used to?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "104",
                "uid": "8ae98e9c174643e8a6c42be06fd58733",
                "response_text": "Mia discusses how she does not like different planets for many reasons, gravity included. In addition, she does not like the idea of animals that can crawl on her or vegetation existing unintentionally. She also does not like the smells of different planets. When Mia sees individuals with more than one child, she becomes nauseous at the sight. To Mia, that seems reckless to have so many children as she is taught that it was the cause of Earth’s destruction. Another occurrence that Mia finds interesting is when she sees an old man during her travels. She is fascinated by his white hair, which she notes that she had never seen in person before. "
              },
              {
                "worker_id": "103",
                "uid": "308f87dd950a424cbd907c08a38dcdba",
                "response_text": "Firstly, the planet Tintera has not been in contact with the Ship for almost 150 years. For the first two days in her Trial she sees nothing except some odd looking animals. To her surprise, they actually taste good, while some other good looking things do not taste so good. She also notices the ugly animals that Horst and his men are herding. Secondly, the town shocks her. Everything there are out of date. The truck she saw is the most advanced machine they have. The newspaper at the rear of the town has “invasion” printed on them. There are literally no women older than 10 years old, only men, boys and kids. She feels weird. But after she sees the swarming kids, she realizes that those people are Free Birthers. She feels sick by what she sees in this sight since they are the ones that basically destroyed Earth. Moreover, to her surprises, they don’t even seem to remember about the things that they’ve done to Earth at all. "
              },
              {
                "worker_id": "102",
                "uid": "39b3a3738b364bb0b930ab1941093374",
                "response_text": "Mia harbors a dislike for planets, particularly because she is unaccustomed to certain aspects. Specifically, she feels the attractive force gravity is different from on the ship where she lives. She is unfamiliar with the ubiquitous vegetation and the fauna. Furthermore, Mia mentions that she is not used to having the lights go out, suggesting that the lights on the ship stay on at all times. Most of all, however, she dislikes the smell of planets. Though there is a relatively small space on her ship on the third level which bear semblance to planets, it is different from Tintera in that Mia is able to leave when she feels uncomfortable. \n\tAdditionally, Tintera’s human culture is different from on the ship. Whereas the inhabitants of the ship are bound by a culture which prohibits unregulated reproduction, the people of Tintera are Free Birthers unconcerned with such matters. When Mia discovers this, she feels nauseated and disgusted at their behaviour. \n"
              },
              {
                "worker_id": "101",
                "uid": "95215f5ccaec46e091924e2317b7e810",
                "response_text": "Tintera has many differences from the life on the ship that Mia is used to. Firstly, and as is similar for all planets, it has an unpleasant smell in its atmosphere. The seasons are also different; despite it being December on the ship, it is spring on Tintera. The planet also has animals that Mia is not used to seeing; for example, the strange creatures that she sees being herded by the men on horseback. The biggest difference that Mia notes about Tintera is that here, people have multiple children who roam about freely. This goes against the rules of the Council and frightens Mia. "
              }
            ]
          },
          {
            "question_text": "What happens at fourteen for the inhabitants of the Ship and why?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "104",
                "uid": "8ae98e9c174643e8a6c42be06fd58733",
                "response_text": "At fourteen years old, the inhabitants of the Ship are put through a Trial. During the trial, they are dropped off at the nearest colonized planet and then picked up a month later if they manage to survive on the planet. Each of the fourteen-year-olds are dropped off in separate locations on the planet. They are given a pick signal device so the scoutship that escorted them to the planet is able to locate them at the end of their 30-day Trial period. \n\nThe purpose of the trial according to the Chairman of the Council is because a closed society needs a way to ensure the physical and mental of its populations. In addition, it helps to maintain a suitable number of individuals in the population. Those that are unable to survive their Trial are presumed to be not fit for life on the Ship.  \n"
              },
              {
                "worker_id": "103",
                "uid": "308f87dd950a424cbd907c08a38dcdba",
                "response_text": "At the age of fourteen, each of the inhabitants of the Ship are supposed to have their Trial. Simply stated, they will be dropped at a colonized planet that is the nearest to them for a month, and for this whole thirty days, the inhabitants will try to keep themselves alive. They can do this on their own, with partners, or join forces. Each of the inhabitants is provided with a sonic pistol, pickup signal, saddle, cinches, food and clothes. One month later, the Ship will come back to get them according to their pickup signal. It is important to note that, while they have all been prepared and trained to survive, some of them are still not able to make it out alive. According to the society, they are incapable of presenting themselves as useful to the Ship if they cannot make it out alive. Mia understands that this whole process is for the good of the society. And since they have all been through this training, everyone on the Ship – the society – are able to take care of themselves if they ever have to do so. Moreover, this process prevents the society from decaying, both in the mind and in the body as well as to keep a steady population. "
              },
              {
                "worker_id": "102",
                "uid": "39b3a3738b364bb0b930ab1941093374",
                "response_text": "At fourteen, the inhabitants of the Ship undergo their Trial, a month-long period in which they must survive on the nearest inhabited planet by themselves. Though Mia Havero, the first-person narrator of the story, expects to return safely to the ship after the duration of her Trial, many do not survive. For her trial, Mia is left on the planet Tintera with her horse, Ninc, food and clothes, and a pickup signal.\n\tThe rationale behind the trial, as Mia presents it, is to screen for those inhabitants of the ship able to take care of themselves. Those who are unable to look after themselves and thereby fail the trial are not sufficiently prepared for life on the Ship. Additionally, Mia’s father, the chairman of the council of the ship, tells her that it is to prevent its population from decaying mentally and physically, as well as to maintain the population. \n"
              },
              {
                "worker_id": "101",
                "uid": "95215f5ccaec46e091924e2317b7e810",
                "response_text": "When children on the ship turn fourteen, they are dropped on a planet that has been colonized. They are left alone for a month to fend for themselves and survive, then are picked up again by the ship. The children are prepared beforehand, and trained in survival and fighting in order to stand a chance at the Trial. However, not everyone makes it. The Ship's reasoning behind this is to ensure that every individual is able to take care of themselves and be properly skilled. Mia's father has also suggested other motives, including maintaining a steady population and keeping it from decreasing its value mentally and physically."
              }
            ]
          },
          {
            "question_text": "Who is Horst and what is his relationship with Mia?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "104",
                "uid": "8ae98e9c174643e8a6c42be06fd58733",
                "response_text": "Horst, along with his four companions, is a man that Mia meets on the planet Tintera. He, along with his companions, were on horses and shepherding animals in front of them. Mia describes him as a middle-aged man with a large build. Mia analyzes his face and decides that she does not want to interact with him because his face looks mean. \n\nHorst, incorrectly, assumes Mia is a boy and asks her questions. Horst asserts that Mia will ride along with the men to the town of Forton. However, Mia disagrees with that statement and Horst does not like the response. Horst begins to bring out his rifle, but Mia grabs her sonic pistol before he is able to do so. She holds them at gunpoint until they drop their weapons. \n\nAfter this confrontation, Horst and Mia do not see each other again until they both end up at the same campsite. At the campsite, Horst and his companions bind Mia’s arms together to prevent her from escaping them. They look through her stuff and threaten her. \n"
              },
              {
                "worker_id": "103",
                "uid": "308f87dd950a424cbd907c08a38dcdba",
                "response_text": "Horst was herding some weird looking creatures with his group of men when Mia came across them on the road during her third day of stay. Horst seems to be middle-aged and he is large with a mean looking face. When Mia ride passes him, she wanted to continue going since she thought he is mean. But he follows and asks her where she is from and going. He wants her to ride with them for protection, but Mia refuses. Interestingly, he thinks Mia is a boy. Before Horst could pull out his gun, Mia pulls out her gun first. She tells them to leave their weapons and ride along, which they did surprisingly. After a while, she tells them they can go back to gather their weapons. She finds this quite amusing. \n\nMia never thought of meeting Horst again. But as she is about to stay at a campsite for the night, she heard Horst and his group of men’s voice. She tries to run, but gets caught by one of Horst’s man. She tries to scream for help, but before she could do so, her mouth gets covered by Horst. Mia still has the gun with her, so she threatens Horst to hand her the pickup signal since this is her only way of getting contact with the Ship when they are to be brought back. After he handed it to her, she asks for the name of the kid in jail. But before she could get an answer, she gets hit and lost her gun. Horst has the pickup signal now. He smashes it until it fells apart. Then after calling him a “big louse” she is knocked out. "
              },
              {
                "worker_id": "102",
                "uid": "39b3a3738b364bb0b930ab1941093374",
                "response_text": "Horst is a man whom Mia meets on her third day on Tintera. He wields a gun which he keeps in his saddle boots, and is roughly the age of Mia’s father. Mia describes his face as mean-looking, from which she surmises that he is mean. He and his team of four others are tasked with herding a group of ugly green creatures with squat figures and lanky limbs. \nOn his first encounter with Mia, he mistakes her for a boy and encourages her to join his team on the ride to Forton. However, when she refuses, he reaches for his gun before Mia quickly unholsters her weapon and aims it at him. She holds him and his team at gunpoint, forcing them to disarm, and makes them ride with her for twenty minutes before letting them go. \nLater, Mia is at a camp when she notices the arrival of Horst and his team. One of them recognizes her and signals Horst over. As she fights with this other man, Horst subdues her and threatens to harm her. As the other man beats Mia, Horst intervenes and tells him to stop, asserting his leadership of the group. Mia threatens to report Horst to the courts, which causes him to laugh and point out that she is obviously not from Tintera. As Horst is distracted with one of the other men, Mia pulls her gun on him and asks him a question. As he stalls, another man strikes her, and Horst quickly renders her unconscious. \n"
              },
              {
                "worker_id": "101",
                "uid": "95215f5ccaec46e091924e2317b7e810",
                "response_text": "Horst is one of the riders that Mia encounters at her arrival on Tintera. He is a middle-aged man with a mean and threatening demeanor. Horst has violent intentions with Mia; he initially offers to take her along with the team of men for protection, but upon Mia's refusal, threatens her with his rifle. Mia is able to intimidate him with her own weapons, but later that night the men return by the campfire, where Mia is attacked by Horst and robbed. Mia initially only dislikes Horst, because of his mean aura and the fact that he refers to her as a boy; however, as Horst's violence is demonstrated more throughout the story, she becomes fearful of him, though still determined to stand up to him."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5005,
        "document_length_chars": 26160
      }
    }
  ]
}