{
  "item_metadata": {
    "item_id": "61434",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61434",
      "content": "\n\n\n\nProduced by Greg Weeks, Mary Meehan and the Online\nDistributed Proofreading Team at http://www.pgdp.net\nMIGHTIEST QORN\nBY KEITH LAUMER\nSly, brave and truculent, the Qornt\n   \n  held all humans in contempt—except one!\n \n  [Transcriber's Note: This etext was produced from\n   \n  Worlds of If Science Fiction, July 1963.\n   \n  Extensive research did not uncover any evidence that\n   \n  the U.S. copyright on this publication was renewed.]\nI\n \n  Ambassador Nitworth glowered across his mirror-polished, nine-foot\nplatinum desk at his assembled staff.\n \n  \"Gentlemen, are any of you familiar with a race known as the Qornt?\"\n \n  There was a moment of profound silence. Nitworth leaned forward,\nlooking solemn.\n \n  \"They were a warlike race known in this sector back in Concordiat\ntimes, perhaps two hundred years ago. They vanished as suddenly as\nthey had appeared. There was no record of where they went.\" He paused\nfor effect.\n \n  \"They have now reappeared—occupying the inner planet of this system!\"\n \n  \"But, sir,\" Second Secretary Magnan offered. \"That's uninhabited\nTerrestrial territory....\"\n \n  \"Indeed, Mr. Magnan?\" Nitworth smiled icily. \"It appears the Qornt do\nnot share that opinion.\" He plucked a heavy parchment from a folder\nbefore him, harrumphed and read aloud:\n \n  His Supreme Excellency The Qorn, Regent of Qornt, Over-Lord of the\nGalactic Destiny, Greets the Terrestrials and, with reference to the\npresence in mandated territory of Terrestrial squatters, has the honor\nto advise that he will require the use of his outer world on the\nthirtieth day. Then will the Qornt come with steel and fire. Receive,\nTerrestrials, renewed assurances of my awareness of your existence,\nand let Those who dare gird for the contest.\n \n  \"Frankly, I wouldn't call it conciliatory,\" Magnan said.\n \n  Nitworth tapped the paper with a finger.\n \n  \"We have been served, gentlemen, with nothing less than an Ultimatum!\"\n \n  \"Well, we'll soon straighten these fellows out—\" the Military Attache\nbegan.\n \n  \"There happens to be more to this piece of truculence than appears on\nthe surface,\" the Ambassador cut in. He paused, waiting for interested\nfrowns to settle into place.\n \n  \"Note, gentlemen, that these invaders have appeared on terrestrial\ncontrolled soil—and without so much as a flicker from the instruments\nof the Navigational Monitor Service!\"\n \n  The Military Attache blinked. \"That's absurd,\" he said flatly. Nitworth\nslapped the table.\n \n  \"We're up against something new, gentlemen! I've considered every\nhypothesis from cloaks of invisibility to time travel! The fact is—the\nQornt fleets are indetectible!\"\nThe Military Attache pulled at his lower lip. \"In that case, we can't\ntry conclusions with these fellows until we have an indetectible drive\nof our own. I recommend a crash project. In the meantime—\"\n \n  \"I'll have my boys start in to crack this thing,\" the Chief of the\nConfidential Terrestrial Source Section spoke up. \"I'll fit out a\ncouple of volunteers with plastic beaks—\"\n \n  \"No cloak and dagger work, gentlemen! Long range policy will be\nworked out by Deep-Think teams back at the Department. Our role will\nbe a holding action. Now I want suggestions for a comprehensive,\nwell rounded and decisive course for meeting this threat. Any\nrecommendation?\"\n \n  The Political Officer placed his fingertips together. \"What about a\nstiff Note demanding an extra week's time?\"\n \n  \"No! No begging,\" the Economic Officer objected. \"I'd say a calm,\ndignified, aggressive withdrawal—as soon as possible.\"\n \n  \"We don't want to give them the idea we spook easily,\" the Military\nAttache said. \"Let's delay the withdrawal—say, until tomorrow.\"\n \n  \"Early tomorrow,\" Magnan said. \"Or maybe later today.\"\n \n  \"Well, I see you're of a mind with me,\" Nitworth nodded. \"Our plan of\naction is clear, but it remains to be implemented. We have a population\nof over fifteen million individuals to relocate.\" He eyed the\nPolitical Officer. \"I want five proposals for resettlement on my desk\nby oh-eight-hundred hours tomorrow.\" Nitworth rapped out instructions.\nHarried-looking staff members arose and hurried from the room. Magnan\neased toward the door.\n \n  \"Where are you going, Magnan?\" Nitworth snapped.\n \n  \"Since you're so busy, I thought I'd just slip back down to Com Inq. It\nwas a most interesting orientation lecture, Mr. Ambassador. Be sure to\nlet us know how it works out.\"\n \n  \"Kindly return to your chair,\" Nitworth said coldly. \"A number of\nchores remain to be assigned. I think you, Magnan, need a little field\nexperience. I want you to get over to Roolit I and take a look at these\nQornt personally.\"\n \n  Magnan's mouth opened and closed soundlessly.\n \n  \"Not afraid of a few Qornt, are you, Magnan?\"\n \n  \"Afraid? Good lord, no, ha ha. It's just that I'm afraid I may lose my\nhead and do something rash if I go.\"\n \n  \"Nonsense! A diplomat is immune to heroic impulses. Take Retief along.\nNo dawdling, now! I want you on the way in two hours. Notify the\ntransport pool at once. Now get going!\"\n \n  Magnan nodded unhappily and went into the hall.\n \n  \"Oh, Retief,\" Nitworth said. Retief turned.\n \n  \"Try to restrain Mr. Magnan from any impulsive moves—in any\ndirection.\"\nII\n \n  Retief and Magnan topped a ridge and looked down across a slope\nof towering tree-shrubs and glossy violet-stemmed palms set among\nflamboyant blossoms of yellow and red, reaching down to a strip of\nwhite beach with the blue sea beyond.\n \n  \"A delightful vista,\" Magnan said, mopping at his face. \"A pity we\ncouldn't locate the Qornt. We'll go back now and report—\"\n \n  \"I'm pretty sure the settlement is off to the right,\" Retief said. \"Why\ndon't you head back for the boat, while I ease over and see what I can\nobserve.\"\n \n  \"Retief, we're engaged in a serious mission. This is not a time to\nthink of sightseeing.\"\n \n  \"I'd like to take a good look at what we're giving away.\"\n \n  \"See here, Retief! One might almost receive the impression that you're\nquestioning Corps policy!\"\n \n  \"One might, at that. The Qornt have made their play, but I think it\nmight be valuable to take a look at their cards before we fold. If I'm\nnot back at the boat in an hour, lift without me.\"\n \n  \"You expect me to make my way back alone?\"\n \n  \"It's directly down-slope—\" Retief broke off, listening. Magnan\nclutched at his arm.\n \n  There was a sound of crackling foliage. Twenty feet ahead, a leafy\nbranch swung aside. An eight-foot biped stepped into view, long, thin,\ngreen-clad legs with back-bending knees moving in quick, bird-like\nsteps. A pair of immense black-lensed goggles covered staring eyes set\namong bushy green hair above a great bone-white beak. The crest bobbed\nas the creature cocked its head, listening.\n \n  Magnan gulped audibly. The Qornt froze, head tilted, beak aimed\ndirectly at the spot where the Terrestrials stood in the deep shade of\na giant trunk.\n \n  \"I'll go for help,\" Magnan squeaked. He whirled and took three leaps\ninto the brush.\n \n  A second great green-clad figure rose up to block his way. He spun,\ndarted to the left. The first Qornt pounced, grappled Magnan to its\nnarrow chest. Magnan yelled, threshing and kicking, broke free,\nturned—and collided with the eight-foot alien, coming in fast from the\nright. All three went down in a tangle of limbs.\n \n  Retief jumped forward, hauled Magnan free, thrust him aside and\nstopped, right fist cocked. The two Qornt lay groaning feebly.\n \n  \"Nice piece of work, Mr. Magnan,\" Retief said. \"You nailed both of\nthem.\"\n\"Those undoubtedly are the most bloodthirsty, aggressive, merciless\ncountenances it has ever been my misfortune to encounter,\" Magnan said.\n\"It hardly seems fair. Eight feet tall\nand\nfaces like that!\"\n \n  The smaller of the two captive Qornt ran long, slender fingers over\na bony shin, from which he had turned back the tight-fitting green\ntrousers.\n \n  \"It's not broken,\" he whistled nasally in passable Terrestrial, eyeing\nMagnan through the heavy goggles, now badly cracked. \"Small thanks to\nyou.\"\n \n  Magnan smiled loftily. \"I daresay you'll think twice before interfering\nwith peaceable diplomats in future.\"\n \n  \"Diplomats? Surely you jest.\"\n \n  \"Never mind us,\" Retief said. \"It's you fellows we'd like to talk\nabout. How many of you are there?\"\n \n  \"Only Zubb and myself.\"\n \n  \"I mean altogether. How many Qornt?\"\n \n  The alien whistled shrilly.\n \n  \"Here, no signalling!\" Magnan snapped, looking around.\n \n  \"That was merely an expression of amusement.\"\n \n  \"You find the situation amusing? I assure you, sir, you are in perilous\nstraits at the moment. I\nmay\nfly into another rage, you know.\"\n \n  \"Please, restrain yourself. I was merely somewhat astonished—\" a small\nwhistle escaped—\"at being taken for a Qornt.\"\n \n  \"Aren't you a Qornt?\"\n \n  \"I? Great snail trails, no!\" More stifled whistles of amusement escaped\nthe beaked face. \"Both Zubb and I are Verpp. Naturalists, as it\nhappens.\"\n \n  \"You certainly\nlook\nlike Qornt.\"\n \n  \"Oh, not at all—except perhaps to a Terrestrial. The Qornt are\nsturdily built rascals, all over ten feet in height. And, of course,\nthey do nothing but quarrel. A drone caste, actually.\"\n \n  \"A caste? You mean they're biologically the same as you?\"\n \n  \"Not at all! A Verpp wouldn't think of fertilizing a Qornt.\"\n \n  \"I mean to say, you are of the same basic stock—descended from a\ncommon ancestor, perhaps.\"\n \n  \"We are all Pud's creatures.\"\n \n  \"What are the differences between you, then?\"\n \n  \"Why, the Qornt are argumentive, boastful, lacking in appreciation\nfor the finer things of life. One dreads to contemplate descending to\ntheir\nlevel.\"\n \n  \"Do you know anything about a Note passed to the Terrestrial Ambassador\nat Smorbrod?\" Retief asked.\nThe beak twitched. \"Smorbrod? I know of no place called Smorbrod.\"\n \n  \"The outer planet of this system.\"\n \n  \"Oh, yes. We call it Guzzum. I had heard that some sort of creatures\nhad established a settlement there, but I confess I pay little note to\nsuch matters.\"\n \n  \"We're wasting time, Retief,\" Magnan said. \"We must truss these chaps\nup, hurry back to the boat and make our escape. You heard what they\nsaid.\"\n \n  \"Are there any Qornt down there at the harbor, where the boats are?\"\nRetief asked.\n \n  \"At Tarroon, you mean? Oh, yes. Planning some adventure.\"\n \n  \"That would be the invasion of Smorbrod,\" Magnan said. \"And unless we\nhurry, Retief, we're likely to be caught there with the last of the\nevacuees!\"\n \n  \"How many Qornt would you say there are at Tarroon?\"\n \n  \"Oh, a very large number. Perhaps fifteen or twenty.\"\n \n  \"Fifteen or twenty what?\" Magnan looked perplexed.\n \n  \"Fifteen or twenty Qornt.\"\n \n  \"You mean that there are only fifteen or twenty individual Qornt in\nall?\"\n \n  Another whistle. \"Not at all. I was referring to the local Qornt only.\nThere are more at the other Centers, of course.\"\n \n  \"And the Qornt are responsible for the ultimatum—unilaterally?\"\n \n  \"I suppose so; it sounds like them. A truculent group, you know. And\ninterplanetary relations\nare\nrather a hobby of theirs.\"\n \n  Zubb moaned and stirred. He sat up slowly, rubbing his head. He spoke\nto his companion in a shrill alien clatter of consonants.\n \n  \"What did he say?\"\n \n  \"Poor Zubb. He blames me for his bruises, since it was my idea to\ngather you as specimens.\"\n \n  \"You should have known better than to tackle that fierce-looking\ncreature,\" Zubb said, pointing his beak at Magnan.\n \n  \"How does it happen that you speak Terrestrial?\" Retief asked.\n \n  \"Oh, one picks up all sorts of dialects.\"\n \n  \"It's quite charming, really,\" Magnan said. \"Such a quaint, archaic\naccent.\"\n \n  \"Suppose we went down to Tarroon,\" Retief asked. \"What kind of\nreception would we get?\"\n \n  \"That depends. I wouldn't recommend interfering with the Gwil or the\nRheuk; it's their nest-mending time, you know. The Boog will be busy\nmating—such a tedious business—and of course the Qornt are tied up\nwith their ceremonial feasting. I'm afraid no one will take any notice\nof you.\"\n \n  \"Do you mean to say,\" Magnan demanded, \"that these ferocious Qornt, who\nhave issued an ultimatum to the Corps Diplomatique Terrestrienne—who\nopenly avow their occupied world—would ignore Terrestrials in their\nmidst?\"\n \n  \"If at all possible.\"\n \n  Retief got to his feet.\n \n  \"I think our course is clear, Mr. Magnan. It's up to us to go down and\nattract a little attention.\"\nIII\n \n  \"I'm not at all sure we're going about this in the right way,\" Magnan\npuffed, trotting at Retief's side. \"These fellows Zubb and Slun—Oh,\nthey seem affable enough, but how can we be sure we're not being led\ninto a trap?\"\n \n  \"We can't.\"\n \n  Magnan stopped short. \"Let's go back.\"\n \n  \"All right,\" Retief said. \"Of course there may be an ambush—\"\n \n  Magnan moved off. \"Let's keep going.\"\n \n  The party emerged from the undergrowth at the edge of a great\nbrush-grown mound. Slun took the lead, rounded the flank of the\nhillock, halted at a rectangular opening cut into the slope.\n \n  \"You can find your way easily enough from here,\" he said. \"You'll\nexcuse us, I hope—\"\n \n  \"Nonsense, Slun!\" Zubb pushed forward. \"I'll escort our guests to Qornt\nHall.\" He twittered briefly to his fellow Verpp. Slun twittered back.\n \n  \"I don't like it, Retief,\" Magnan whispered. \"Those fellows are\nplotting mischief.\"\n \n  \"Threaten them with violence, Mr Magnan. They're scared of you.\"\n \n  \"That's true. And the drubbing they received was well-deserved. I'm a\npatient man, but there are occasions—\"\n \n  \"Come along, please,\" Zubb called. \"Another ten minutes' walk—\"\n \n  \"See here, we have no interest in investigating this barrow,\" Magnan\nannounced. \"We wish you to take us direct to Tarroon to interview your\nmilitary leaders regarding the ultimatum!\"\n \n  \"Yes, yes, of course. Qornt Hall lies here inside the village.\"\n \n  \"This is Tarroon?\"\n \n  \"A modest civic center, sir, but there are those who love it.\"\n \n  \"No wonder we didn't observe their works from the air,\" Magnan\nmuttered. \"Camouflaged.\" He moved hesitantly through the opening.\n \n  The party moved along a wide, deserted tunnel which sloped down\nsteeply, then leveled off and branched. Zubb took the center branch,\nducking slightly under the nine-foot ceiling lit at intervals with what\nappeared to be primitive incandescent panels.\n \n  \"Few signs of an advanced technology here,\" Magnan whispered. \"These\ncreatures must devote all their talents to warlike enterprise.\"\n \n  Ahead, Zubb slowed. A distant susurration was audible, a sustained\nhigh-pitched screeching. \"Softly, now. We approach Qornt Hall. They\ncan be an irascible lot when disturbed at their feasting.\"\n \n  \"When will the feast be over?\" Magnan called hoarsely.\n \n  \"In another few weeks, I should imagine, if, as you say, they've\nscheduled an invasion for next month.\"\n \n  \"Look here, Zubb.\" Magnan shook a finger at the tall alien. \"How is it\nthat these Qornt are allowed to embark on piratical ventures of this\nsort without reference to the wishes of the majority?\"\n \n  \"Oh, the majority of the Qornt favor the move, I imagine.\"\n \n  \"These few hotheads are permitted to embroil the planet in war?\"\n \n  \"Oh, they don't embroil the planet in war. They merely—\"\n \n  \"Retief, this is fantastic! I've heard of iron-fisted military cliques\nbefore, but this is madness!\"\n \n  \"Come softly, now.\" Zubb beckoned, moving toward a bend in the\nyellow-lit corridor. Retief and Magnan moved forward.\nThe corridor debouched through a high double door into a vast oval\nchamber, high-domed, gloomy, paneled in dark wood and hung with\ntattered banners, scarred halberds, pikes, rusted longswords, crossed\nspears over patinaed hauberks, pitted radiation armor, corroded power\nrifles, the immense mummified heads of horned and fanged animals. Great\nguttering torches in wall brackets and in stands along the length\nof the long table shed a smoky light that reflected from the mirror\npolish of the red granite floor, gleamed on polished silver bowls and\npaper-thin glass, shone jewel-red and gold through dark bottles—and\ncast long flickering shadows behind the fifteen trolls at the board.\n \n  Lesser trolls—beaked, bush-haired, great-eyed—trotted briskly,\nbird-kneed, bearing steaming platters, stood in groups of\nthree strumming slender bottle-shaped lutes, or pranced an\nintricate-patterned dance, unnoticed in the shrill uproar as each of\nthe magnificently draped, belted, feathered and jeweled Qornt carried\non a shouted conversation with an equally noisy fellow.\n \n  \"A most interesting display of barbaric splendor,\" Magnan breathed.\n\"Now we'd better be getting back.\"\n \n  \"Ah, a moment,\" Zubb said. \"Observe the Qornt—the tallest of the\nfeasters—he with the head-dress of crimson, purple, silver and pink.\"\n \n  \"Twelve feet if he's an inch,\" Magnan estimated. \"And now we really\nmust hurry along—\"\n \n  \"That one is chief among these rowdies. I'm sure you'll want a word\nwith him. He controls not only the Tarroonian vessels but those from\nthe other Centers as well.\"\n \n  \"What kind of vessels? Warships?\"\n \n  \"Certainly. What other kind would the Qornt bother with?\"\n \n  \"I don't suppose,\" Magnan said casually, \"that you'd know the type,\ntonnage, armament and manning of these vessels? And how many units\ncomprise the fleet? And where they're based at present?\"\n \n  \"They're fully automated twenty-thousand-ton all-purpose dreadnaughts.\nThey mount a variety of weapons. The Qornt are fond of that sort of\nthing. Each of the Qornt has his own, of course. They're virtually\nidentical, except for the personal touches each individual has given\nhis ship.\"\n \n  \"Great heavens, Retief!\" Magnan exclaimed in a whisper. \"It sounds as\nthough these brutes employ a battle armada as simpler souls might a set\nof toy sailboats!\"\n \n  Retief stepped past Magnan and Zubb to study the feasting hall. \"I can\nsee that their votes would carry all the necessary weight.\"\n \n  \"And now an interview with the Qorn himself,\" Zubb shrilled. \"If you'll\nkindly step along, gentlemen....\"\n \n  \"That won't be necessary,\" Magnan said hastily, \"I've decided to refer\nthe matter to committee.\"\n \n  \"After having come so far,\" Zubb said, \"it would be a pity to miss\nhaving a cosy chat.\"\n \n  There was a pause.\n \n  \"Ah ... Retief,\" Magnan said. \"Zubb has just presented a most\ncompelling argument....\"\nRetief turned. Zubb stood gripping an ornately decorated power pistol\nin one bony hand, a slim needler in the other. Both were pointed at\nMagnan's chest.\n \n  \"I suspected you had hidden qualities, Zubb,\" Retief commented.\n \n  \"See here, Zubb! We're diplomats!\" Magnan started.\n \n  \"Careful, Mr. Magnan; you may goad him to a frenzy.\"\n \n  \"By no means,\" Zubb whistled. \"I much prefer to observe the frenzy\nof the Qornt when presented with the news that two peaceful Verpp\nhave been assaulted and kidnapped by bullying interlopers. If there's\nanything that annoys the Qornt, it's Qornt-like behavior in others. Now\nstep along, please.\"\n \n  \"Rest assured, this will be reported!\"\n \n  \"I doubt it.\"\n \n  \"You'll face the wrath of Enlightened Galactic Opinion!\"\n \n  \"Oh? How big a navy does Enlightened Galactic Opinion have?\"\n \n  \"Stop scaring him, Mr. Magnan. He may get nervous and shoot.\" Retief\nstepped into the banquet hall, headed for the resplendent figure at\nthe head of the table. A trio of flute-players broke off in mid-bleat,\nstaring. An inverted pyramid of tumblers blinked as Retief swung past,\nfollowed by Magnan and the tall Verpp. The shrill chatter at the table\nfaded.\n \n  Qorn turned as Retief came up, blinking three-inch eyes. Zubb stepped\nforward, gibbered, waving his arms excitedly. Qorn pushed back his\nchair—a low, heavily padded stool—and stared unwinking at Retief,\nmoving his head to bring first one great round eye, then the other, to\nbear. There were small blue veins in the immense fleshy beak. The bushy\nhair, springing out in a giant halo around the grayish, porous-skinned\nface, was wiry, stiff, moss-green, with tufts of chartreuse fuzz\nsurrounding what appeared to be tympanic membranes. The tall head-dress\nof scarlet silk and purple feathers was slightly askew, and a loop of\npink pearls had slipped down above one eye.\n \n  Zubb finished his speech and fell silent, breathing hard.\n \n  Qorn looked Retief over in silence, then belched.\n \n  \"Not bad,\" Retief said admiringly. \"Maybe we could get up a match\nbetween you and Ambassador Sternwheeler. You've got the volume on him,\nbut he's got timbre.\"\n \n  \"So,\" Qorn hooted in a resonant tenor. \"You come from Guzzum, eh? Or\nSmorbrod, as I think you call it. What is it you're after? More time?\nA compromise? Negotiations? Peace?\" He slammed a bony hand against the\ntable. \"The answer is\nno\n!\"\n \n  Zubb twittered. Qorn cocked an eye, motioned to a servant. \"Chain that\none.\" He indicated Magnan. His eyes went to Retief. \"This one's bigger;\nyou'd best chain him, too.\"\n \n  \"Why, your Excellency—\" Magnan started, stepping forward.\n \n  \"Stay back!\" Qorn hooted. \"Stand over there where I can keep an eye on\nyou.\"\n \n  \"Your Excellency, I'm empowered—\"\n \n  \"Not here, you're not!\" Qorn trumpeted. \"Want peace, do you? Well, I\ndon't want peace! I've had a surfeit of peace these last two centuries!\nI want action! Loot! Adventure! Glory!\" He turned to look down the\ntable. \"How about it, fellows? It's war to the knife, eh?\"\nThere was a momentary silence from all sides.\n \n  \"I guess so,\" grunted a giant Qornt in iridescent blue with\nflame-colored plumes.\n \n  Qorn's eyes bulged. He half rose. \"We've been all over this,\" he\nbassooned. He clamped bony fingers on the hilt of a light rapier. \"I\nthought I'd made my point!\"\n \n  \"Oh, sure, Qorn.\"\n \n  \"You bet.\"\n \n  \"I'm convinced.\"\n \n  Qorn rumbled and resumed his seat. \"All for one and one for all, that's\nus.\"\n \n  \"And you're the one, eh, Qorn?\" Retief commented.\n \n  Magnan cleared his throat. \"I sense that some of you gentlemen are not\nconvinced of the wisdom of this move,\" he piped, looking along the\ntable at the silks, jewels, beaks, feather-decked crests and staring\neyes.\n \n  \"Silence!\" Qorn hooted. \"No use your talking to my loyal lieutenants\nanyway,\" he added. \"They do whatever I convince them they ought to do.\"\n \n  \"But I'm sure that on more mature consideration—\"\n \n  \"I can lick any Qornt in the house.\" Qorn said. \"That's why I'm Qorn.\"\nHe belched again.\n \n  A servant came up staggering under a weight of chain, dropped it with a\ncrash at Magnan's feet. Zubb aimed the guns while the servant wrapped\nthree loops around Magnan's wrists, snapped a lock in place.\n \n  \"You next!\" The guns pointed at Retief's chest. He held out his arms.\nFour loops of silvery-gray chain in half-inch links dropped around\nthem. The servant cinched them up tight, squeezed a lock through the\nends and closed it.\n \n  \"Now,\" Qorn said, lolling back in his chair, glass in hand. \"There's a\nbit of sport to be had here, lads. What shall we do with them?\"\n \n  \"Let them go,\" the blue and flame Qornt said glumly.\n \n  \"You can do better than that,\" Qorn hooted. \"Now here's a suggestion:\nwe carve them up a little—lop off the external labiae and pinnae,\nsay—and ship them back.\"\n \n  \"Good lord! Retief, he's talking about cutting off our ears and sending\nus home mutilated! What a barbaric proposal!\"\n \n  \"It wouldn't be the first time a Terrestrial diplomat got a trimming,\"\nRetief commented.\n \n  \"It should have the effect of stimulating the Terries to put up a\nreasonable scrap,\" Qorn said judiciously. \"I have a feeling that\nthey're thinking of giving up without a struggle.\"\n \n  \"Oh, I doubt that,\" the blue-and-flame Qornt said. \"Why should they?\"\n \n  Qorn rolled an eye at Retief and another at Magnan. \"Take these two,\"\nhe hooted. \"I'll wager they came here to negotiate a surrender!\"\n \n  \"Well,\" Magnan started.\n \n  \"Hold it, Mr. Magnan,\" Retief said. \"I'll tell him.\"\n \n  \"What's your proposal?\" Qorn whistled, taking a gulp from his goblet.\n\"A fifty-fifty split? Monetary reparations? Alternate territory? I can\nassure you, it's useless. We Qornt\nlike\nto fight.\"\n \n  \"I'm afraid you've gotten the wrong impression, your Excellency,\"\nRetief said blandly. \"We didn't come to negotiate. We came to deliver\nan Ultimatum.\"\n \n  \"What?\" Qorn trumpeted. Behind Retief, Magnan spluttered.\n \n  \"We plan to use this planet for target practice,\" Retief said. \"A new\ntype hell bomb we've worked out. Have all your people off of it in\nseventy-two hours, or suffer the consequences.\"\nIV\n \n  \"You have the gall,\" Qorn stormed, \"to stand here in the center of\nQornt Hall—uninvited, at that—and in chains—\"\n \n  \"Oh, these,\" Retief said. He tensed his arms. The soft aluminum links\nstretched and broke. He shook the light metal free. \"We diplomats like\nto go along with colorful local customs, but I wouldn't want to mislead\nyou. Now, as to the evacuation of Roolit I—\"\nZubb screeched, waved the guns. The Qornt were jabbering.\n \n  \"I told you they were brutes,\" Zubb shrilled.\n \n  Qorn slammed his fist down on the table. \"I don't care what they are!\"\nhe honked. \"Evacuate, hell! I can field eighty-five combat-ready ships!\"\n \n  \"And we can englobe every one of them with a thousand Peace Enforcers\nwith a hundred megatons/second firepower each.\"\n \n  \"Retief.\" Magnan tugged at his sleeve. \"Don't forget their superdrive.\"\n \n  \"That's all right. They don't have one.\"\n \n  \"But—\"\n \n  \"We'll take you on!\" Qorn French-horned. \"We're the Qorn! We glory in\nbattle! We live in fame or go down in—\"\n \n  \"Hogwash,\" the flame-and-blue Qorn cut in. \"If it wasn't for you, Qorn,\nwe could sit around and feast and brag and enjoy life without having to\nprove anything.\"\n \n  \"Qorn, you seem to be the fire-brand here,\" Retief said. \"I think the\nrest of the boys would listen to reason—\"\n \n  \"Over my dead body!\"\n \n  \"My idea exactly,\" Retief said. \"You claim you can lick any man in\nthe house. Unwind yourself from your ribbons and step out here on the\nfloor, and we'll see how good you are at backing up your conversation.\"\nMagnan hovered at Retief's side. \"Twelve feet tall,\" he moaned. \"And\ndid you notice the size of those hands?\"\n \n  Retief watched as Qorn's aides helped him out of his formal trappings.\n\"I wouldn't worry too much, Mr. Magnan. This is a light-Gee world. I\ndoubt if old Qorn would weigh up at more than two-fifty standard pounds\nhere.\"\n \n  \"But that phenomenal reach—\"\n \n  \"I'll peck away at him at knee level. When he bends over to swat me,\nI'll get a crack at him.\"\n \n  Across the cleared floor, Qorn shook off his helpers with a snort.\n \n  \"Enough! Let me at the upstart!\"\n \n  Retief moved out to meet him, watching the upraised backward-jointed\narms. Qorn stalked forward, long lean legs bent, long horny feet\nclacking against the polished floor. The other aliens—both servitors\nand bejeweled Qornt—formed a wide circle, all eyes unwaveringly on the\ncombatants.\n \n  Qorn struck suddenly, a long arm flashing down in a vicious cut at\nRetief, who leaned aside, caught one lean shank below the knee. Qorn\nbent to haul Retief from his leg—and staggered back as a haymaker took\nhim just below the beak. A screech went up from the crowd as Retief\nleaped clear.\n \n  Qorn hissed and charged. Retief whirled aside, then struck the alien's\noff-leg in a flying tackle. Qorn leaned, arms windmilling, crashed to\nthe floor. Retief whirled, dived for the left arm, whipped it behind\nthe narrow back, seized Qorn's neck in a stranglehold and threw his\nweight backward. Qorn fell on his back, his legs squatted out at an\nawkward angle. He squawked and beat his free arm on the floor, reaching\nin vain for Retief.\n \n  Zubb stepped forward, pistols ready. Magnan stepped before him.\n \n  \"Need I remind you, sir,\" he said icily, \"that this is an official\ndiplomatic function? I can brook no interference from disinterested\nparties.\"\n \n  Zubb hesitated. Magnan held out a hand. \"I must ask you to hand me your\nweapons, Zubb.\"\n \n  \"Look here,\" Zubb began.\n \n  \"I\nmay\nlose my temper,\" Magnan hinted. Zubb lowered the guns, passed\nthem to Magnan. He thrust them into his belt with a sour smile, turned\nback to watch the encounter.\n \n  Retief had thrown a turn of violet silk around Qorn's left wrist, bound\nit to the alien's neck. Another wisp of stuff floated from Qorn's\nshoulder. Retief, still holding Qorn in an awkward sprawl, wrapped\nit around one outflung leg, trussed ankle and thigh together. Qorn\nflopped, hooting. At each movement, the constricting loop around his\nneck, jerked his head back, the green crest tossing wildly.\n \n  \"If I were you, I'd relax,\" Retief said, rising and releasing his grip.\nQorn got a leg under him; Retief kicked it. Qorn's chin hit the floor\nwith a hollow clack. He wilted, an ungainly tangle of over-long limbs\nand gay silks.\n \n  Retief turned to the watching crowd. \"Next?\" he called.\n \n  The blue and flame Qornt stepped forward. \"Maybe this would be a good\ntime to elect a new leader,\" he said. \"Now, my qualifications—\"\n \n  \"Sit down,\" Retief said loudly. He stepped to the head of the table,\nseated himself in Qorn's vacated chair. \"A couple of you finish\ntrussing Qorn up for me.\"\n \n  \"But we must select a leader!\"\n \n  \"That won't be necessary, boys. I'm your new leader.\"\n\"As I see it,\" Retief said, dribbling cigar ashes into an empty wine\nglass, \"you Qornt like to be warriors, but you don't particularly like\nto fight.\"\n \n  \"We don't mind a little fighting—within reason. And, of course, as\nQornt, we're expected to die in battle. But what I say is, why rush\nthings?\"\n \n  \"I have a suggestion,\" Magnan said. \"Why not turn the reins of\ngovernment over to the Verpp? They seem a level-headed group.\"\n \n  \"What good would that do? Qornt are Qornt. It seems there's always one\namong us who's a slave to instinct—and, naturally, we have to follow\nhim.\"\n \n  \"Why?\"\n \n  \"Because that's the way it's done.\"\n \n  \"Why not do it another way?\" Magnan offered. \"Now, I'd like to suggest\ncommunity singing—\"\n \n  \"If we gave up fighting, we might live too long. Then what would\nhappen?\"\n \n  \"Live too long?\" Magnan looked puzzled.\n \n  \"When estivating time comes there'd be no burrows for us. Anyway, with\nthe new Qornt stepping on our heels—\"\n \n  \"I've lost the thread,\" Magnan said. \"Who are the new Qornt?\"\n \n  \"After estivating, the Verpp moult, and then they're Qornt, of course.\nThe Gwil become Boog, the Boog become Rheuk, the Rheuk metamorphosize\ninto Verpp—\"\n \n  \"You mean Slun and Zubb—the mild-natured naturalists—will become\nwarmongers like Qorn?\"\n \n  \"Very likely. 'The milder the Verpp, the wilder the Qorn,' as the old\nsaying goes.\"\n \n  \"What do Qornt turn into?\" Retief asked.\n \n  \"Hmmmm. That's a good question. So far, none have survived Qornthood.\"\n \n  \"Have you thought of forsaking your warlike ways?\" Magnan asked. \"What\nabout taking up sheepherding and regular church attendance?\"\n \n  \"Don't mistake me. We Qornt like a military life. It's great sport to\nsit around roaring fires and drink and tell lies and then go dashing\noff to enjoy a brisk affray and some leisurely looting afterward. But\nwe prefer a nice numerical advantage. Not this business of tackling you\nTerrestrials over on Guzzum—that was a mad notion. We had no idea what\nyour strength was.\"\n \n  \"But now that's all off, of course,\" Magnan chirped. \"Now that we've\nhad diplomatic relations and all—\"\n \n  \"Oh, by no means. The fleet lifts in thirty days. After all, we're\nQornt; we have to satisfy our drive to action.\"\n \n  \"But Mr. Retief is your leader now. He won't let you!\"\n \n  \"Only a dead Qornt stays home when Attack day comes. And even if\nhe orders us all to cut our own throats, there are still the other\nCenters—all with their own leaders. No, gentlemen, the Invasion is\ndefinitely on.\"\n \n  \"Why don't you go invade somebody else?\" Magnan suggested. \"I could\nname some very attractive prospects—outside my sector, of course.\"\n \n  \"Hold everything,\" Retief said. \"I think we've got the basis of a deal\nhere....\"\nV\n \n  At the head of a double column of gaudily caparisoned Qornt, Retief\nand Magnan strolled across the ramp toward the bright tower of the CDT\nSector HQ. Ahead, gates opened, and a black Corps limousine emerged,\nflying an Ambassadorial flag under a plain square of white.\n \n  \"Curious,\" Magnan commented. \"I wonder what the significance of the\nwhite ensign might be?\"\n \n  Retief raised a hand. The column halted with a clash of accoutrements\nand a rasp of Qornt boots. Retief looked back along the line. The high\nwhite sun flashed on bright silks, polished buckles, deep-dyed plumes,\nbutts of pistols, the soft gleam of leather.\n \n  \"A brave show indeed,\" Magnan commented approvingly. \"I confess the\nidea has merit.\"\n \n  The limousine pulled up with a squeal of brakes, stood on two fat-tired\nwheels, gyros humming softly. The hatch popped up. A portly diplomat\nstepped out.\n \n  \"Why, Ambassador Nitworth,\" Magnan glowed. \"This is very kind of you.\"\n \n  \"Keep cool, Magnan,\" Nitworth said in a strained voice. \"We'll attempt\nto get you out of this.\"\n \n  He stepped past Magnan's out-stretched hand and looked hesitantly at\nthe ramrod-straight line of Qornt, eighty-five strong—and beyond, at\nthe eighty-five tall Qornt dreadnaughts.\n \n  \"Good afternoon, sir ... ah, Your Excellency,\" Nitworth said, blinking\nup at the leading Qornt. \"You are Commander of the Strike Force, I\nassume?\"\n \n  \"Nope,\" the Qornt said shortly.\n \n  \"I ... ah ... wish to request seventy-two hours in which to evacuate\nHeadquarters,\" Nitworth plowed on.\n \n  \"Mr. Ambassador.\" Retief said. \"This—\"\n \n  \"Don't panic, Retief. I'll attempt to secure your release,\" Nitworth\nhissed over his shoulder. \"Now—\"\n \n  \"You will address our leader with more respect!\" the tall Qornt hooted,\neyeing Nitworth ominously from eleven feet up.\n \n  \"Oh, yes indeed, sir ... your Excellency ... Commander. Now, about the\ninvasion—\"\n \n  \"Mr. Secretary,\" Magnan tugged at Nitworth's sleeve.\n \n  \"In heaven's name, permit me to negotiate in peace!\" Nitworth snapped.\nHe rearranged his features. \"Now your Excellency, we've arranged to\nevacuate Smorbrod, of course, just as you requested—\"\n \n  \"Requested?\" the Qornt honked.\n \n  \"Ah ... demanded, that is. Quite rightly of course. Ordered.\nInstructed. And, of course, we'll be only too pleased to follow any\nother instructions you might have.\"\n \n  \"You don't quite get the big picture, Mr. Secretary,\" Retief said.\n\"This isn't—\"\n \n  \"Silence, confound you!\" Nitworth barked. The leading Qornt looked at\nRetief. He nodded. Two bony hands shot out, seized Nitworth and stuffed\na length of bright pink silk into his mouth, then spun him around and\nheld him facing Retief.\n \n  \"If you don't mind my taking this opportunity to brief you, Mr.\nAmbassador,\" Retief said blandly. \"I think I should mention that this\nisn't an invasion fleet. These are the new recruits for the Peace\nEnforcement Corps.\"\n \n  Magnan stepped forward, glanced at the gag in Ambassador Nitworth's\nmouth, hesitated, then cleared his throat. \"We felt,\" he said, \"that\nthe establishment of a Foreign Brigade within the P. E. Corps structure\nwould provide the element of novelty the Department has requested\nin our recruiting, and at the same time would remove the stigma of\nTerrestrial chauvinism from future punitive operations.\"\n \n  Nitworth stared, eyes bulging. He grunted, reaching for the gag, caught\nthe Qornt's eye on him, dropped his hands to his sides.\n \n  \"I suggest we get the troops in out of the hot sun,\" Retief said.\nMagnan edged close. \"What about the gag?\" he whispered.\n \n  \"Let's leave it where it is for a while,\" Retief murmured. \"It may save\nus a few concessions.\"\nAn hour later, Nitworth, breathing freely again, glowered across his\ndesk at Retief and Magnan.\n \n  \"This entire affair,\" he rumbled, \"has made me appear to be a fool!\"\n \n  \"But we who are privileged to serve on your staff already know just how\nclever you are,\" Magnan burbled.\n \n  Nitworth purpled. \"You're skirting insolence, Magnan,\" he roared. \"Why\nwas I not informed of the arrangements? What was I to assume at the\nsight of eighty-five war vessels over my headquarters, unannounced?\"\n \n  \"We tried to get through, but our wavelengths—\"\n \n  \"Bah! Sterner souls than I would have quailed at the spectacle!\"\n \n  \"Oh, you were perfectly justified in panicking—\"\n \n  \"I did\nnot\npanic!\" Nitworth bellowed. \"I merely adjusted to the\napparent circumstances. Now, I'm of two minds as to the advisability of\nthis foreign legion idea of yours. Still, it may have merit. I believe\nthe wisest course would be to dispatch them on a long training cruise\nin an uninhabited sector of space—\"\n \n  The office windows rattled. \"What the devil!\" Nitworth turned, stared\nout at the ramp where a Qornt ship rose slowly on a column of pale blue\nlight. The vibration increased as a second ship lifted, then a third.\n \n  Nitworth whirled on Magnan. \"What's this! Who ordered these recruits to\nembark without my permission?\"\n \n  \"I took the liberty of giving them an errand to run, Mr. Secretary,\"\nRetief said. \"There was that little matter of the Groaci infiltrating\nthe Sirenian System. I sent the boys off to handle it.\"\n \n  \"Call them back at once!\"\n \n  \"I'm afraid that won't be possible. They're under orders to maintain\ntotal communications silence until completion of the mission.\"\n \n  Nitworth drummed his fingers on the desk top. Slowly, a thoughtful\nexpression dawned. He nodded.\n \n  \"This may work out,\" he said. \"I\nshould\ncall them back, but since\nthe fleet is out of contact, I'm unable to do so, correct? Thus I can\nhardly be held responsible for any over-enthusiasm in chastising the\nGroaci.\"\n \n  He closed one eye in a broad wink at Magnan. \"Very well, gentlemen,\nI'll overlook the irregularity this time. Magnan, see to it the\nSmorbrodian public are notified they can remain where they are. And\nby the way, did you by any chance discover the technique of the\nindetectable drive the Qornt use?\"\n \n  \"No, sir. That is, yes, sir.\"\n \n  \"Well? Well?\"\n \n  \"There isn't any. The Qornt were there all the while. Underground.\"\n \n  \"Underground? Doing what?\"\n \n  \"Hibernating—for two hundred years at a stretch.\"\nOutside in the corridor, Magnan came up to Retief, who stood talking to\na tall man in a pilot's coverall.\n \n  \"I'll be tied up, sending through full details on my—our—your\nrecruiting theme, Retief,\" Magnan said. \"Suppose you run into the city\nto assist the new Verpp Consul in settling in.\"\n \n  \"I'll do that, Mr. Magnan. Anything else?\"\n \n  Magnan raised his eyebrows. \"You're remarkably compliant today, Retief.\nI'll arrange transportation.\"\n \n  \"Don't bother, Mr. Magnan. Cy here will run me over. He was the pilot\nwho ferried us over to Roolit I, you recall.\"\n \n  \"I'll be with you as soon as I pack a few phone numbers, Retief,\" the\npilot said. He moved off. Magnan followed him with a disapproving eye.\n\"An uncouth sort, I fancied. I trust you're not consorting with his\nkind socially.\"\n \n  \"I wouldn't say that, exactly,\" Retief said. \"We just want to go over a\nfew figures together.\"\n",
      "metadata": {
        "title": "Mightiest Qorn",
        "author": "Keith Laumer",
        "passage_id": "61434",
        "uid": "3b89dad4494941419ae5948cb69688e1",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "3",
                "uid": "c8c9a7b4890d4a2fb3513818f65e8e6a",
                "response_text": "Ambassador Nitworth, the local head of the government for the Terrestrials, has received an ultimatum from a species called the Qornt. The Qornt want to take over the planet that the Terrestrials currently occupy. This is surprising because the whereabouts of the Qornt have been unknown for the past two centuries. The Ambassador orders Second Secretary Magnan to travel to Roolit I, the planet where the Qornt are now, to investigate the situation in person. Retief is sent to go with Magnan, with orders from the Ambassador to avoid Magnan from doing anything impulsive. When they arrive, Retief wants to investigate the situation on the surface, whereas Magnan would have been happy to take one look and return to his office. As Retief is insisting on taking a look, the two men are spotted by two eight-foot-tall creatures and a skirmish starts. After Retief pulls Magnan from the fight, and some bickering takes place, the men learn that these two creatures are Verpp, not Qornt. They ask if they know about the Ultimatum sent to the Ambassador—the men call the outer planet Smorbrod, but those on Roolit I call it Guzzum. Zubb and Slun (the Verpp) say that they aren’t caught up on political matters, so they don’t have anything to say about the upcoming invasion, but they do give the men information about where they are. Tarroon is the town they are closest to, where there are 15-20 Qornt, and Zubb and Slun say that the Qornt would mostly ignore Terrestrials, which makes Retief think they should walk right in. Magnan is afraid of a trap, but they head into the underground Qornt village. Once they make it to Qornt Hall, the group walks through a tunnel into a huge room with high ceilings, where the walls are plastered with weapons and other spoils of battle. It was a trap: the Verpp walk the men into the dining hall where the Qornt are having a feast, hoping that the Qornt would be mad at the men for interfering with the Verpp. It turns out the Qornt are even larger than the Verpp (twelve feet tall), and Qorn (the lead Qornt) is insistent that there will be no peace, because he is hungry for battle, so he ties up the men. Retief threatens them saying the Terrestrials intended to use Roolit I to test a bomb, and breaks out of his chains in the chaos—the differences in gravity between the planets means that the men are very strong, even if they are much smaller than the Verpp and Qornt. Retief ties up Qorn and declares himself the new leader. The Qornt explain that Verpp molt into Qornt after a few other stages of metamorphosis, and that the Qornt are very driven by a need for battle. Upon return to the outer planet, we learn that Retief has supposedly recruited the Qornt for the Peace Enforcement Corps, and sends them out to battle, circumventing Nitworth’s authority. \n"
              },
              {
                "worker_id": "6",
                "uid": "4324af88ddbe406e8eda8b359e05aada",
                "response_text": "\tAmbassador Nitworth of the Terrestrials receives an undetectable message from the Qornt. This communication states that they will soon invade the CDT and pillage the surrounding area in 30 days time. The Qornt are known for their warlike tendencies and battle-hardy population, but they disappeared without a trace around 200 years ago. Despite their sudden reappearance on Terrestrial territory, the Terrestrials caught no sight of them on their Navigational Monitor Service. \n\tThe Ambassador and his military decide to evacuate their land, an incredible feat thanks to their 15 million Terrestrials. They give themselves one day to plan their move, before announcing it to the general population. \n\tMagnan, one of the Ambassador's men, is ordered to explore Roolit and find the Qorn. Magnan, though hesitant, is forced to accept and take Retief with him. As they explore, they come across two Verpp, Zubb and Slun. After a quick battle, Magnan and Retief win and speak to the Verpp as their captives. Their race is a peaceful one, focused on exploring nature and other species. \n\tZubb and Slun escort them to the Qornt den, where they are feasting. Slun leaves them outside of Qornt Hall, located in Tarroon.  Zubb guides them into the grand chamber, where the Qornt are in the midst of their weeks-long feast. The bejeweled hall features Qornt of different sizes and statuses. Qorn, the chief, is seated above them all in a headdress and plumage. Zubb explains that each Qornt has their own fully-automated dreadnought, AKA warship. \n\tAfter hearing about their weaponry and seeing the Qornt in all their beastly glory, Magnan decides to retreat. Zubb, however, betrays them and pulls out two guns. He announces their arrival after forcing the Terrestrials in. Qorn belches in response. The Qornt chain the two Terrestrials. \n\tThe chief boasts about what the Qornt will do to the Terrestrials and squanders Magnan’s hopes for surrender or peace. However, the other Qornt are not in agreement. They seem fairly nonchalant about the matter. They understand that this is their duty as Qornt, but they also would rather feast and boast than fight. \n\tRetief claims that the Terrestrials will use Tarroon as a target for their new hell bomb. He delivers his own ultimatum to the Qornt, breaking the chains around his wrists. Taroon’s gravity and atmosphere lighten the weight, hence Retief’s ability to break the chains. Retief challenges Qorn to a battle, despite Qorn’s greater size and stature. \n\tRetief wins, ties Qorn up, and names himself their new leader. The Qornt still plan on invading the Terrestrials, however, and Retief must find a solution. It’s revealed that the Verpp transforms into the Qornt like a caterpillar becomes a butterfly. They reach a solution, however. The Qornt become the new task force for the Peace Enforcement Corps. The Verpp establish their own Consul in the city. Ambassador Nitworth is pleased with this turn of events, and the Qornt are sent on a mission right away."
              },
              {
                "worker_id": "5",
                "uid": "436f20272bd0499ab8f90ce2c2904a8c",
                "response_text": "A diplomatic corps of humans (Terrestrials) receives an ultimatum from the Qornt warlike alien race telling them to evacuate a planet or be destroyed. The alien race appeared suddenly and undetected by the humans. Two men, Mangan and Retief, are dispatched to the alien planet to investigate while an evacuation plan can be developed.\n\nMangan and Retief come upon two aliens who they mistake for Qornt but are actually Verpp. They are able to capture them and they lead the men to the Qornt community. Once their their captives turn on them and capture the men, binding them in chains.\n\nThe Qornt leader is uninterested in diplomatic discussions and is intent on invading the human planet. At this point Retief breaks his bonds which are only weak aluminum and defeats the Qornt leader in physical combat. Retief convinces the remaining Qornt to abandon the invasion plan and elect himself as their leader.\n\nWhen the human ambassador returns to discuss the evacuation, Mangan and Retief inform him that the Qornt have remarkably been folded into the Terrestrial Peace Corps and have been sent out on mission. Retief and Mangan will now be in charge of recruitment of Alien races into the human community."
              },
              {
                "worker_id": "1",
                "uid": "d5777b4560e34e20bb0a4e1d2d3cc5ad",
                "response_text": "Ambassador Nitworth appears in front of his staff to announce that the Qornt, a race that disappeared 200 years ago, has suddenly reappeared and is making demands. One of the most alarming facts about this assault is that the Qornt were able to appear on the planet without detection by any of the equipment the earth men use. \n\nWhen Magnan tries to sneak out of the meeting without an assignment, Nitworth sends him and Ratief to check out the Qornt in person. Within moments of their arrival at the site, a Qornt steps out of the bushes. Magnan immediately tries to escape, but another alien appears and the two Qornts stop him from running away. He is able to defend himself and knocks them both to the ground. \n\nThe aliens agree to take Magnan and Ratief to Qornt Hall to speak with Qorn, the leader. Once they reach the hall, the Qornt escorts pull out a couple of weapons and point them at Magnan. They want to tell Qorn that the two men have assaulted them and tried to kidnap them. Inside the meeting place, the wild-looking leader tells Ratief and Magnan that he has zero intention of negotiating a peace deal between the Qornts and the humans. Instead, he wants adventure and action. \n\nIt becomes clear that Qorn is forcing his men to go to war although some of them are not interested in the battle. Qorn argues that he is the ultimate leader, and it makes no difference if his subordinates agree with his decisions or not. \n\nRatief and Magnan were sent to the Qornts to negotiate the earth men's surrender, but Ratief completely changes the plan. He tells the leader that they want to deliver an ultimatum of their own. They will bomb the planet in a few days’ time, regardless of whether the Qornts have left it or not. \n\nQorn insists that his troops are ready for war, but one of his subordinates cuts in to tell him that many of the other Qornts would prefer to feast and enjoy themselves without going to battle for no good reason. Ratief challenges Qorn to a fight, and he eventually gets the alien in a stranglehold. After Ratief wins, he claims himself leader of the Qornts. \n\nSeveral of the Qornts declare that they must go to war regardless of who their leader is. They were made for fighting even though they didn’t like their past leader’s decision to attack the earthmen. Magnan suggests that the group goes elsewhere to invade, and Ratief agrees.  \n\nAmbassador Nitworth shows up to save Ratief and Magnan, completely unaware that they have taken over the Qornts. The men explain to their boss that they have established the Foreign Brigade, and the Qornts will now work for them. They have been sent off on a far away mission. Ratief and Magnan also tell Nitworth that the Qornts never left the planet. They were hibernating underground for 200 years.\n"
              }
            ]
          },
          {
            "question_text": "What is the relationship between Magnan and Retief, and how does it shift throughout the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "3",
                "uid": "c8c9a7b4890d4a2fb3513818f65e8e6a",
                "response_text": "Magnan and Retief are the men selected to go to the planet where the Qornt are based in order to investigate. Although Magnan was the first person assigned to the job, he is less comfortable out in the field compared to Retief, who ends up making most of the decisions. There is a tension here as they continue their adventure, with Magnan being scared and Retief encouraging him forward, and Retief saving Magnan when he is pinned by the Verpp. Magnan is the one who is explicitly a diplomat, but Retief takes over most conversations—not only does he push the mission forward and insist on following the Verpp to the Qornt, but he eventually declares himself leader of the Qornt. Even when Ambassador Nitworth demands information from Magnan near the end, it is Retief who responds—he wants the Ambassador to know that he is the one calling the shots, even if it has been behind the scenes. It’s clear that Magnan has either not understood this, as if he were being tricked, or he is just not good at giving credit where credit is due, because he refers to the plan as his own recruiting scheme, correcting himself to say it was a group effort, even though it was all Retief’s idea. At the very end of the story, Retief complies to all of Magnan’s requests in an uncharacteristic way—the interpretation is left open, but there is a possibility Retief is hiding something and intends to return as a military leader with the Qornt and perhaps attack the Terrestrials. \n"
              },
              {
                "worker_id": "6",
                "uid": "4324af88ddbe406e8eda8b359e05aada",
                "response_text": "\tMagnan is a hesitant man, very aware of himself. His anxiety about the situation at hand is in direct relation to his self-preservation instincts. Retief, on the other hand, is far bolder, willing to sacrifice himself and his safety to explore, solve the issue, or reach a solution. At first, Retief makes fun of Magnan and his hesitancy. Often, Retief has to goad or tease Magnan just to make him come along with him. \n\tAfter Magnan takes down both the Verpps, Retief’s respect for him grows, if only incrementally. Their sarcastic and snarky manner only grows as the story progresses. As they continue on their mission, Magnan continues to question Retief’s ever-present bravery, but this only propels him forward. \n\tOnce Retief challenges Qorn to a duel, Magnan instantly tries to hold him back and questions his train of thought. After hearing Retief’s plan, Magnan backs off and watches his comrade take down the chief. \n\tNow that Retief is their new leader, he and Magnan brainstorm with the Qornt about how to solve the issue at hand. Magnan always leads with the idea of peace, while Retief looks for other solutions. \n\tAlthough they experience some difficulties in the beginning, Magnan and Retief develop a friendly relationship where they are able to question each other, keep the other one safe, and bounce ideas off of each other.\n"
              },
              {
                "worker_id": "5",
                "uid": "436f20272bd0499ab8f90ce2c2904a8c",
                "response_text": "Mangan and Retief begin their adventure on the planet at odds with each other. Mangan is in favor of leaving the planet while Retief proposing investigating further the more they learn. Mangan is diplomatic and risk-averse in his interaction while Retief prefers action.\n\nRetief is the cleverer of the two men and understands that although the Verpp and Qornt look imposing, the lower gravity on the planet renders them ineffectual physically. He uses this knowledge to his advantage to defeat Qorn, the leader of the Qornt and bluff the remainder of the population into establishing himself as their leader. Mangan, originally the leader of the expedition falls into line behind Retief's lead. By the end of the story Retief has accomplished a striking victory and now is beginning to view Mangan as another clueless dignitary like Nitworth and begins to discuss his future plans with the lower-class pilot, Cy."
              },
              {
                "worker_id": "1",
                "uid": "d5777b4560e34e20bb0a4e1d2d3cc5ad",
                "response_text": "Magnan and Ratief are sent to investigate the Qornt together. Before they leave, Ambassador Nitworth tells Ratief to make sure that Magnan does not do anything foolish or compulsive. \n\nHowever, as soon as they land on the planet, Magnan accuses Ratief of going against the boss’s policies. Ratief tells Magnan to give him an hour to investigate the Qornts and to leave without him if he’s not back in time. Ratief is clearly the braver of the two men. Yet, Magnan is able to show off his own skills and courage when the Qornts show up unexpectedly and jump out from behind a bush. Magnan knocks the aliens down without much thought. \n\nMagnan tries to convince Ratief to go back to their ship, but Ratief refuses and instead says that it’s their job to go get the Qornts’ attention. Although the two Qornts agree to bring them to their leader, Magnan is concerned that the Qornts are secretly plotting an attack against the diplomats. His doubts about their kindness have merit. The two Qornt escorts end up pulling out weapons and threatening the men. This time, it’s Ratief who uses caution and tells Magnan not to scare the Qornts because they may get nervous and shoot. \n\nRatief takes charge of the mission and leaves Magnan’s opinions about the situation out when he tells the Qorn that the two earthmen have come with an ultimatum. He completely changes his boss’s message and tries to scare the Qornts into leaving. When the leader refuses, Ratief challenges him to a duel and comes out victorious. Ratief then nominates himself to be the new leader of the group.\n\nMagnan is stunned by Ratief’s cavalier attitude, but he is supportive of his colleague. He trusts Ratief to make good decisions, even when his actions seem outlandish. \n"
              }
            ]
          },
          {
            "question_text": "Who is Magnan and how does his attitude shift throughout the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "3",
                "uid": "c8c9a7b4890d4a2fb3513818f65e8e6a",
                "response_text": "Second Secretary Magnan was selected by Ambassador Nitworth to travel to Roolit I to investigate the Qornt. Magnan does not have much field experience and is surprised by this assignment, and had been trying to get out of doing anything related to the Qornt issue when it was handed to him. He resigns himself to the task and Retief is assigned to go along with him. When they get to the planet, Magnan is clearly anxious—he remarks on the quality of the view and states his intent to head back to finish the mission, but Retief doesn’t let him give up so early. When the men are spotted by some creatures, and he tries to run for help, he is instead jumped by the creatures and Retief has to tear him free. This gives Magnan some confidence, and has a much more arrogant attitude towards the Verpp. He flaunts his title as diplomat and tries to assert as much dominance as he can. Once he learns that these are Verpp and not Qornt, he is preoccupied by the confusing details of the story: how many Qornt there are, and things like that. Once the group starts towards the Qornt’s village, however, he becomes nervous again, no longer with the upper hand. He is not sure if he is walking into a trap, and becomes more and more nervous until the trap is revealed. Once at gunpoint standing in front of the Qornt, however, he has enough confidence to pry at the division between the Qornt who want war and those who aren’t sold on the idea yet. Once Retief threatens the Qornt and a fight commences, Magnan still tries to talk his way out of Zubb shooting the men, gains confidence again, and insists on taking the guns. Once Qorn has been tied up, Magnan suggests putting the Verpp in charge, and asks the Qornt if there are alternatives to militaristic life that they would consider. Eventually they all make it back to where the story started, and he seems more passive again, until the Ambassador is on board with Retief’s plan, and Magnan starts ordering Retief around again, though Retief’s behavior has shifted in response. "
              },
              {
                "worker_id": "6",
                "uid": "4324af88ddbe406e8eda8b359e05aada",
                "response_text": "\tMagnan is one of Ambassador Nitworth’s men, assumedly part of his military brigade. When Nitworth commands him to take Retief on a journey to find the Qornt, he balks and asks not to. He is essentially the literary version of a scaredy-cat. \n\tThroughout their journey, Retief has to come up with different encouragements or tricks to keep Magnan going, usually involving putting him in harm’s way. At first, Magnan’s self-preservation is what drives him forward. But as the story progresses, he soon grows to care for Retief in a purely platonic way. This development means he also tries to protect Retief in his own way, usually by questioning his choices and insisting safety comes first. \n\tAt the end, Magnan becomes a much braver man and negotiates with the Qornt himself. He constantly pushes for the idea of peace, not only for his own self-preservation but also for those around him. His basic instincts remain, but they expand to include the rest of the Terrestrials as well as the other races.\n"
              },
              {
                "worker_id": "5",
                "uid": "436f20272bd0499ab8f90ce2c2904a8c",
                "response_text": "Mangan is the Second Secretary in the Terrestrial Diplomatic Corp. He answers to Ambassador Nitworth. He is chosen to perform reconnaissance on the alien planet along with Retief. Initially, Mangan is a by-the-books officer with something of a cowardly streak not wanting to engage in any risky action. Throughout his time on the planet, Mangan is continually proposing that they retreat before being pushed on by Retief.\n\nEventually when Mangan is nearly captured by the Verpp, he physically overpowers them. Eventually, Mangan is influenced by Retief's bravado and guile and aids him in deceiving the Qorn into joining the Terrestrial military complex.\n\nMangan also has a prejudiced view of social class (not unlike the Verpp) disapproving of Retief socializing with a mere pilot. This limitation prevents Mangan from seeing the bigger picture of the situation unlike Retief."
              },
              {
                "worker_id": "1",
                "uid": "d5777b4560e34e20bb0a4e1d2d3cc5ad",
                "response_text": "At the beginning of the story, Magnan, the diplomat, takes on very little responsibility. He listens to Nitworth’s declarations about an unknown enemy invading their territory, and he is unphased. He tells Nitworth that it seems like everything is under control, so he is just going to head out. Nitworth sends him to check on the Qornt in person, and he is deeply unhappy with the assignment.\n\nUpon arrival, Magnan immediately tries to get out of doing any work by telling Ratief that they can’t locate the group. He doesn’t see it as his responsibility to save the earth men from the invaders. \n\nHowever, when the Qornts appear in front of him, he wastes no time in defending himself and his colleague and knocks them to the ground. After spending more time with the Qornts and getting to know them and their society better, Magnan becomes more invested in what happens to them and how the earth men handle their invasion. He fully supports Ratief when he asks Qorn to prove that he is in fact the strongest and again when Ratief claims the leadership role for himself. Magnan knows that everything Ratief is doing is against Nitworth’s orders, but he trusts Ratief to make good decisions, and the whole ordeal is very entertaining. \n"
              }
            ]
          },
          {
            "question_text": "Why are the men so convinced that the Qornt have an extreme tactical advantage? What do we know about the military mindset and tools of the group?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "3",
                "uid": "c8c9a7b4890d4a2fb3513818f65e8e6a",
                "response_text": "Because they Qornt have been underground for two centuries while they molted from the Verpp stage of their life cycle, they have gone undetected by the Terrestrials in this time. This led the Terrestrials to believe that the Qornt possessed superior technology of some kind, as they seemed to have reappeared out of nowhere. However, this is not the case, and it was merely that the group remained dormant for a long time. There are rumors of stealth technology and superior ships, including a superdrive, but not much firsthand information until Magnan and Retief make it to the surface of Roolit I, the planet that the Qornt are currently occupying. It is true that the Verpp and Qornt are physically larger than the Terrestrials, but the systems of gravity on the different planets means that the smaller Terrestrials are actually stronger and have a kind of advantage on Roolit I. The Verpp tell Magnan that the Qornt have huge, powerful warships that have a variety of weapon types. Not only this, but each Qornt has his own ship, which means that there is a large fleet of these. It comes to Magnan as a surprise, then, that the Qornt are not worried about diplomatic negotiation, but instead just seem to have an impulse that drives them to be in battle. "
              },
              {
                "worker_id": "6",
                "uid": "4324af88ddbe406e8eda8b359e05aada",
                "response_text": "\tWhen the Qornt reappears after a 200-year hiatus, Ambassador Nitworth and his men are terrified because their radars are unable to find them. Because of this, and the Qornt’s leader’s claim about their unrivaled weaponry, the men are sure of their demise. They gather their forces to come up with five different relocation plans and decide to execute the best one in 24 short hours. \n\tWith a population of 15 million Terrestrials, relocation is a mighty feat. By choosing relocation, it’s clear that Ambassador Nitworth and his men have no faith in their fleet’s ability against the Qornt’s. \n\tLater on, when Retief and Magnan are with the Zubb and the Qornt, we discover that each Qornt has his own dreadnought. Zubb talks them up as well, explaining in detail about these fully automated warships. He also mentions their super drive and their unstoppable army. However, Retief is smart enough to figure out that since they’ve been underground for 200 years, they wouldn’t have access to all of this new technology. The Qornt are still a warring species, though, advanced technology or not. \n\tSince the leader and his men were not in line, their power fell dramatically. Retief was able to become their new leader with relative ease. He also appeases their warlike ways by assigning them to the Peace Enforcement Corps.\n"
              },
              {
                "worker_id": "5",
                "uid": "436f20272bd0499ab8f90ce2c2904a8c",
                "response_text": "The men are convinced of Qornt superiority due to the fact that they appeared on the planet undetected by their instruments. Later, Mangan and Retief learn that the Qornt command a massive armada of warships that would be a imposing threat to the Terrestrials.\n\nThe military mindset of the Terrestrials is similarly aggressive as the Qornt. They are intent on countering the perceived threat but seeing that they are facing a technologically superior foe, they seek to surrender and save their population."
              },
              {
                "worker_id": "1",
                "uid": "d5777b4560e34e20bb0a4e1d2d3cc5ad",
                "response_text": "The humans’ tools are unable to detect the Qornts’ invasion at the beginning of the story, so they assume that they have far more advanced equipment. It is obvious that they have never before seen an arrival go completely undetected by their tools. At the end of the story, however, the truth that the Qornts were hibernating underground for 200 years comes to light. Therefore, the earth men did not “miss” their invasion, they just didn’t know that there were dozens of them buried underground. \n\nThe Qornts are self-proclaimed lovers of war. The original Qorn says that he has no desire for peace between his people and the earthlings because he much prefers adventure and action, regardless of the potential loss of life. Although some of his subordinates do not agree with his decision to battle the earth men, they do acknowledge that war is an essential part of the Qornts’ society. \n\nThe Qornts are not always Qornts. Before they are Qornts, they are Verpp, and before that they are Rheuk, and before that, Boog, etc. No one survives the Qornt stage because the Qornt love military life. \n"
              }
            ]
          },
          {
            "question_text": "Who are the Qornt and how do they relate to the other groups in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "3",
                "uid": "c8c9a7b4890d4a2fb3513818f65e8e6a",
                "response_text": "The Qornt is a race of aliens known for their militaristic tendencies that seemed to disappear two centuries ago. They are of particular issue because they have reappeared and written to the Terrestrials saying they would take over the planet that the Terrestrials are on. We eventually learn that the Qornt are but one stage in a longer life cycle, in which Gwil become Boog, who become Rheuk, who become Verpp, who eventually become Qornt after the two hundred year estivation period. It is only in this stage that they become antagonistic and warlike, but they do not know what happens after this stage because Qornt are expected to die in battle, and none have survived long enough to know what happens. The Qornt themselves are twelve feet tall and troll-like, with very bushy fur, huge eyes, and beaks. They are very comfortable with their militaristic traditions—when we meet them, they are in the midst of a large feast that they partake in before going to war. They boast the spoils of battle on display in their great hall, and wear intricate headdresses to show their power. After a skirmish with the men on Roolit I, in which Qorn (the lead Qornt) is replaced in power by Retief, they eventually make it to the outer planets where they have presumably been recruited into the Peace Enforcement Corps.\n"
              },
              {
                "worker_id": "6",
                "uid": "4324af88ddbe406e8eda8b359e05aada",
                "response_text": "\tThe Qornt are a large, bird-like, warring species with scary beaks and large eyes. They are similar in looks to the Verpp but much larger and scarier. \n\tAs it turns out, the Qornt and several other species undergo a sort of metamorphosis, similar to a caterpillar becoming a butterfly in our reality. Just as the caterpillar burrows itself in a cocoon, the Verpp burrow, molt, and then re-emerge as Qornt. However, the Verpp aren’t born. They are initially of the Gwil species. The Gwil transform into the Boog, which then transform into the Rheuk, and then they become the Verpp. \n\tSadly, it’s unknown what the Qornt might become during their transformation. No Qornt has ever survived long enough to experience the next metamorphosis if there is one. They always die in battle, supposedly to make room for the Verpp to burrow again. \n"
              },
              {
                "worker_id": "5",
                "uid": "436f20272bd0499ab8f90ce2c2904a8c",
                "response_text": "The Qornt are an antagonistic alien race that have been rediscovered on the planet of Roolit I. They are a warlike race and have delivered an ultimatum to the Terrestrial inhabitants of Smorbrod that if they do not evacuate, they will invade. They are physically imposing, standing over 10 feet tall with a birdlike appearance.\n\nIn reality the Qornt are related to all of the other alien races on Roolit I. Each seperate race is a developmental stage of a single species. The Gwil become Boog, the Boog become Rheuk, which become Verpp which eventually become Qornt. The Qornt are predisposed to warlike tendencies so that they tend to die off and complete their life cycle in order to make room for new Qornt that develop from the Verpp. If they did not do this overpopulation would become an issue when they need to hibernate underground for 200 years. "
              },
              {
                "worker_id": "1",
                "uid": "d5777b4560e34e20bb0a4e1d2d3cc5ad",
                "response_text": "The Qornt originally lived in the Concordiate times, about 200 years ago. They vanished suddenly, and no historians know where it was that they went. However, Magnan and Ratief learn from the aliens that they were simply hibernating for two centuries. They never actually left the planet. \n\nThe Qornt are led by His Supreme Excellency The Qorn, Regent of the Qornt, Over-Lord of the Galactic Destiny. They are about eight feet tall, stand on two green legs, and move like birds. They have bushy green hair and white beaks. They love to attack other species and engage in dangerous action and war. \n\nQornt is the final stage in a long line of evolution of the being. The two beings that Magnan and Ratief meet are not actually Qornts, but Verpps. They are actually offended that the earth men mistake them for Qornts because they believe the similar but different creatures are argumentative and lowly. They are all “pud’s creatures,” but they view themselves distinctly based on their place in the evolution of the being. No one survives the Qornt stage because they are always  engaging in war. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 6260,
        "document_length_chars": 38795
      }
    }
  ]
}