{
  "item_metadata": {
    "item_id": "61467",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "61467",
      "content": "MUCK MAN\n \n\n BY FREMONT DODGE\n \n\n The work wasn't hard, but there were some sacrifices. You had to give up hope and freedom—and being human!\n \n [Transcriber's Note: This etext was produced from Worlds of If Science Fiction, November 1963. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n I\n \n The girl with the Slider egg glittering in her hair watched the bailiff lead Asa Graybar out of the courtroom. He recognized her as old Hazeltyne's daughter Harriet, no doubt come to see justice done. She didn't have the hothouse-flower look Asa would have expected in a girl whose father owned the most valuable of the planetary franchises. She was not afraid to meet his eye, the eye of a judicially certified criminal. There was, perhaps, a crease of puzzlement in her brow, as if she had thought crimes were committed by shriveled, rat-faced types, and not by young biological engineers who still affected crewcuts.\n \n Tom Dorr, Hazeltyne's general manager, was her escort. Asa felt certain, without proof, that Dorr was the man who had framed him for the charge of grand theft by secreting a fresh Slider egg in his laboratory. The older man stared at Asa coldly as he was led out of the courtroom and down the corridor back to jail.\n \n Jumpy, Asa's cellmate, took one look at his face as he was put back behind bars.\n \n \"Guilty,\" Jumpy said.\n \n Asa glared at him.\n \n \"I know, I know,\" Jumpy said hastily. \"You were framed. But what's the rap?\"\n \n \"Five or one.\"\n \n \"Take the five,\" Jumpy advised. \"Learn basket-weaving in a nice air-conditioned rehab clinic. A year on a changeling deal will seem a lot longer, even if you're lucky enough to live through it.\"\n \n Asa took four steps to the far wall of the cell, stood there briefly with his head bent and turned to face Jumpy.\n \n \"Nope,\" Asa said softly. \"I'm going into a conversion tank. I'm going to be a muck man, Jumpy. I'm going out to Jordan's Planet and hunt Slider eggs.\"\n \n \"Smuggling? It won't work.\"\n \n Asa didn't answer. The Hazeltyne company had gone after him because he had been working on a method of keeping Slider eggs alive. The Hazeltyne company would be happy to see him mark time for five years of so-called social reorientation. But if he could get out to Jordan's Planet, with his physiology adapted to the environment of that wretched world, he could study the eggs under conditions no laboratory could duplicate. He might even be able to cause trouble for Hazeltyne.\n \n His only problem would be staying alive for a year.\n \n \n\n \n An interview with a doctor from the Conversion Corps was required for all persons who elected changeling status. The law stated that potential changelings must be fully informed of the rights and hazards of altered shape before they signed a release. The requirement held whether or not the individual, like Asa, was already experienced.\n \n By the time humanity traveled to the stars, medical biology had made it possible to regenerate damaged or deficient organs of the body. Regeneration was limited only by advanced age. Sometime after a man's two hundredth year his body lost the ability to be coaxed into growing new cells. A fifth set of teeth was usually one's last. As long as senescence could be staved off, however, any man could have bulging biceps and a pencil waist, if he could pay for the treatment.\n \n Until the medical associations declared such treatments unethical there was even a short fad of deliberate deformities, with horns at the temples particularly popular.\n \n From regeneration it was a short step to specialized regrowth. The techniques were perfected to adapt humans to the dozen barely habitable worlds man had discovered. Even on Mars, the only planet outside Earth in the solar system where the human anatomy was remotely suitable, a man could work more efficiently with redesigned lungs and temperature controls than he could inside a pressure suit. On more bizarre planets a few light-years away the advantages of changeling bodies were greater.\n \n Unfortunately for planetary development companies, hardly anyone wanted to become a changeling. High pay lured few. So a law was passed permitting a convicted criminal to earn his freedom by putting in one year as a changeling for every five years he would otherwise have had to spend in rehabilitation.\n \n \"What types of changelings do you have orders for right now, doctor?\" Asa asked the man assigned to his case. It would look suspicious if he asked for Jordan's Planet without some preliminary questions.\n \n \"Four,\" answered the doctor.\n \n \"Squiffs for New Arcady. Adapted for climbing the skycraper trees and with the arm structure modified into pseudo-wings or gliding. Then we need spiderinos for Von Neumann Two. If you want the nearest thing we have to Earth, there's Caesar's Moon, where we'd just have to double your tolerance for carbon monoxide and make you a bigger and better gorilla than the natives. Last, of course, there's always a need for muck men on Jordan's Planet.\"\n \n The doctor shrugged, as if naturally no one could be expected to choose Jordan's Planet. Asa frowned in apparent consideration of the alternatives.\n \n \"What's the pay range?\" he asked.\n \n \"Ten dollars a day on Caesar's Moon. Fifteen on New Arcady or Von Neumann Two. Twenty-five on Jordan's.\"\n \n Asa raised his eyebrows.\n \n \"Why such a difference? Everyone knows about muck men living in the mud while they hunt Slider eggs. But don't your conversions make the changeling comfortable in his new environment?\"\n \n \"Sure they do,\" said the doctor. \"We can make you think mud feels better than chinchilla fur and we can have you jumping like a grasshopper despite the double gravity. But we can't make you like the sight of yourself. And we can't guarantee that a Slider won't kill you.\"\n \n \"Still,\" Asa mused aloud, \"it would mean a nice bankroll waiting at the end of the year.\"\n \n He leaned forward to fill in the necessary form.\n \n \n\n \n Since it was cheaper to transport a normal human than to rig special environments in a spaceship, every planet operated its own conversion chambers. On the space freighter that carried him from Earth Asa Graybar was confined to a small cabin that was opened only for a guard to bring meals and take out dirty dishes. He was still a prisoner.\n \n Sometimes he could hear voices in the passageway outside, and once one of them sounded like a woman's. But since women neither served on spaceships nor worked in the dome settlements on harsher worlds, he decided it was his imagination. He might have been dead cargo for all he learned about space travel.\n \n Nevertheless his time was not wasted. He had as a companion, or cellmate, another convict who had elected conversion to muck man. More important, his companion had done time on Jordan's Planet before and had wanted to return.\n \n \"It's the Slider eggs,\" explained Kershaw, the two-time loser. \"The ones you see on Earth knock your eyes out, but they've already begun to die. There's nothing like a fresh one. And I'm not the first to go crazy over them. When I was reconverted and got home I had nine thousand dollars waiting for me. That'll buy a two-year-old egg that flashes maybe four times a day. So I stole a new one and got caught.\"\n \n Asa had held a Slider egg in his hand as he gazed into it. He could understand. The shell was clear as crystal, taut but elastic, while the albumen was just as clear around the sparkling network of organic filaments that served as a yolk. Along these interior threads played tiny flashes of lightning, part of some unexplained process of life. Electrical instruments picked up static discharges from the egg, but the phenomenon remained a mystery.\n \n Hardly anyone faced with the beauty of a Slider's egg bothered to question its workings. For a few expectant moments there would be only random, fitful gleamings, and then there would be a wild coruscation of light, dancing from one filament to the next in a frenzy of brilliance.\n \n It took about four years for a Slider egg to die. Beauty, rarity and fading value made the eggs a luxury item like nothing the world had ever seen. If Asa had found a means of keeping them alive it would have made him wealthy at the expense of the Hazeltyne monopoly.\n \n \"You know what I think?\" Kershaw asked. \"I think those flashes are the egg calling its momma. They sparkle like a million diamonds when you scoop one out of the muck, and right away a Slider always comes swooping out of nowhere at you.\"\n \n \"I've been meaning to ask you,\" Asa said. \"How do you handle the Sliders?\"\n \n Kershaw grinned.\n \n \"First you try to catch it with a rocket. If you miss you start leaping for home. All this time you're broadcasting for help, you understand. When the Slider catches you, you leap up while it buries its jaws in the mud where you were just standing. You dig your claws in its back and hang on while it rolls around in the mud. Finally, if the 'copter comes—and if they don't shoot off your head by mistake—you live to tell the tale.\"\n \n \n\n II\n \n Asa Graybar kept his normal form on Jordan's Planet just long enough to learn the discomfort of double gravity. He was told he needed another physical examination and was taken right in to a doctor. His heart was pounding to keep his blood circulating on this massive world, but the doctor had apparently learned to make allowances.\n \n \"Swallow this,\" said the doctor after making a series of tests.\n \n Asa swallowed the capsule. Two minutes later he felt himself beginning to lose consciousness.\n \n \"This is it!\" he thought in panic.\n \n He felt someone ease him back down onto a wheeled stretcher. Before consciousness faded completely he realized that no one got a chance to back out of becoming a changeling, that he was on his way to the conversion tank right now.\n \n When he finally awoke he felt well rested and very comfortable. But for a long time he was afraid to open his eyes.\n \n \"Come on, Graybar,\" said a deep, booming voice. \"Let's test our wings.\"\n \n It was not Kershaw's voice, but it had to be Kershaw. Asa opened his eyes.\n \n Everyone had seen pictures of muck men. It was different having one stand beside you. Kershaw looked much like an enormous frog except that his head was still mostly human. He was sitting on webbed feet, his lower legs bent double under huge thighs, and his trunk tilted forward so that his arms dangled to the ground. The arms were as thick around as an ordinary man's legs. The hands had become efficient scoops, with broad fingers webbed to the first joint and tipped with spade-like claws. The skin was still pinkish but had become scaly. Not a thread of hair showed anywhere on the body, not even on the head.\n \n This, Asa realized, was what he looked like himself.\n \n It would have been more bearable if the head had not retained strong traces of humanity. The nostrils flared wide and the jaws hardly emerged from the neck, but the ears were human ears and the eyes, under those horny ridges, were human eyes. Asa felt sure that the eyes could still weep.\n \n He started to walk forward and tipped over on his side. Kershaw laughed.\n \n \"Come to daddy, babykins,\" Kershaw said, holding out his hands. \"Only try hopping this time. And take it easy.\"\n \n Asa pushed himself upright with one arm and tried a small hop. Nerve and muscle coordination was perfect. He found himself leaping as high as Kershaw's head.\n \n \"That's the way,\" Kershaw said approvingly. \"Now get this on and we'll go outside.\"\n \n Asa snapped on a belt and breech cloth combination that had flaps of fabric dangling from the belt in front and behind. He followed as Kershaw pushed open a sliding door to lead the way out of the room where they had been left to revive from conversion.\n \n \n\n \n They went into a courtyard partly covered by a roof projecting from the Hazeltyne company's dome settlement. The far half of the courtyard was open to the gray drizzle that fell almost ceaselessly from the sky of Jordan's Planet and turned most of its surface into marsh and mud flats. A high wall enclosed the far portion of the courtyard. Ranged along the wall were thirty stalls for muck men.\n \n From fifty yards across the courtyard a muck man bounded over to them in two leaps. Attached to a harness across his shoulders and chest were a gun and a long knife.\n \n \"Names?\" he growled. He was a foot taller than Graybar and big everywhere in proportion.\n \n \"Kershaw. I'm back, Furston.\"\n \n \"I'm Graybar.\"\n \n \"Kershaw again? Just start in where you left off, sucker. Come on, you.\" He pointed to Asa and leaped to the open portion of the courtyard.\n \n \"Do what he says,\" Kershaw whispered to Graybar. \"He's sort of a trusty and warden and parole officer rolled into one.\"\n \n Asa was put through a series of exercises to get him used to his distorted body, to teach him how to leap and how to dig. He was shown how to operate the radio he would carry and how to fire the pencil-slim rockets of this gun. Finally he was told to eat a few berries from a native vine. He did so and immediately vomited.\n \n Furston laughed.\n \n \"That's to remind you you're still a man,\" Furston said, grinning.\n\"Everything that grows on this planet is poison. So if you got any ideas of hiding out till your term is up, forget 'em. Right here is where you eat.\"\n \n Asa turned without a word and hopped feebly away from Furston. He lifted his head to breathe deeply and saw two humans watching him from an observation tower on the roof.\n \n He leaped twenty feet into the air for a closer look.\n \n Gazing at him with repugnance, after witnessing the end of his session with Furston, were Harriet Hazeltyne and general manager Tom Dorr.\n \n The girl's presence merely puzzled Asa, but Dorr's being here worried him. Dorr had tried to get rid of him once and was now in an excellent position to make the riddance permanent.\n \n At supper that night, squatting on the ground beside a low table with the dozen other muck men operating from the dome, Asa asked what the two were doing out here.\n \n \"The girl will inherit this racket some day, won't she?\" asked one of the others. \"She wants to see what kind of suckers are making her rich.\"\n \n \"Maybe that guy Dorr brought her along to show her what a big wheel he is,\" said one of the others. \"Just hope he doesn't take over the operations.\"\n \n \n\n III\n \n Next morning Furston passed out guns, knives, radios, and pouches to carry any eggs the muck men found. He gave each man a compass and assigned the sectors to be worked during the day. Finally he called Graybar aside.\n \n \"In case you don't like it here,\" Furston said, \"you can get a week knocked off your sentence for every egg you bring in. Now get out there and work that muck.\"\n \n Furston sent Graybar and Kershaw out together so that the veteran could show Asa the ropes. Asa had already learned that the wall around the courtyard was to keep Sliders out, not muck men in. He leaped over it and hopped along after Kershaw.\n \n Feet slapping against the mud, they went about five miles from the Hazeltyne station, swimming easily across ponds too broad to jump. The mud, if not precisely as pleasant to the touch as chinchilla fur, was not at all uncomfortable, and the dripping air caressed their skins like a summer breeze back on Earth. Tiny, slippery creatures skidded and splashed out of their way. Finally Kershaw stopped. His experienced eye had seen a trail of swamp weeds crushed low into the mud.\n \n \"Keep your eyes open,\" Kershaw said. \"There's a Slider been around here lately. If you see something like an express train headed our way, start shooting.\"\n \n At each leap along the trail they peered quickly around. They saw no Sliders, but this meant little, for the beasts lived under the mud as much as on top of it.\n \n Kershaw halted again when they came to a roughly circular area some ten yards in diameter where the weeds had been torn out and lay rotting in the muck.\n \n \"We're in luck,\" he said as Asa skidded to a stop at his side. \"An egg was laid somewhere here within the last week. These places are hard to spot when the new weeds start growing.\"\n \n Kershaw took a long look around.\n \n \"No trouble in sight. We dig.\"\n \n They started at the center of the cleared area, shoveling up great gobs of mud with their hands and flinging them out of the clearing. Usually a muck man dug in a spiral out from the center, but Graybar and Kershaw dug in gradually widening semi-circles opposite each other. They had to dig four feet deep, and it was slow going until they had a pit big enough to stand in. Each handful of mud had to be squeezed gently before it was thrown away, to make sure it didn't conceal an egg. As he worked, Asa kept thinking what an inefficient system it was. Everything about the operation was wrong.\n \n \"Got it!\" Kershaw shouted. He leaped out of the pit and started wiping slime off a round object the size of a baseball. Asa jumped out to watch.\n \n \"A big one,\" Kershaw said. He held it, still smeared with traces of mud, lovingly to his cheek, and then lifted it to eye level. \"Just look at it.\"\n \n \n \n A SLIDER EGG\n \n \n \n The egg was flashing with a mad radiance, like a thousand diamonds being splintered under a brilliant sun. Static crackled in Asa's earphones and he thought of what Kershaw had said, that the scintillation of an egg was an effect of its calls to a mother Slider for help. Asa looked around.\n \n \"Jump!\" he shouted.\n \n At the edge of the clearing a segmented length of greenish black scales, some two feet thick and six feet high, had reared up out of the weeds. The top segment was almost all mouth, already opened to show row upon row of teeth. Before Asa could draw his gun the Slider lowered its head to the ground, dug two front flippers into the mud and shot forward.\n \n Asa leaped with all his strength, sailing far out of the clearing. While he was still in the air he snapped the mouthpiece of his radio down from where it was hinged over his head. As he landed he turned instantly, his gun in his hand.\n \n \"Calling the 'copter!\" he spoke rapidly into the mouthpiece. \"Kershaw and Graybar, sector eight, five miles out. Hurry!\"\n \n \"Graybar?\" asked a voice in his earphone. \"What's up?\"\n \n \"We've got an egg but a Slider wants it back.\"\n \n \"On the way.\"\n \n Asa hopped back to the clearing. Kershaw must have been bowled over by the Slider's first rush, for he was trying to hop on one leg as if the other had been broken. The egg lay flickering on top of the mud where Kershaw had dropped it. The Slider, eight flippers on each side working madly, was twisting its thirty feet of wormlike body around for another charge.\n \n Aiming hastily, Asa fired a rocket at the monster's middle segment. The rocket smashed through hard scales and exploded in a fountain of gray flesh. The Slider writhed, coating its wound in mud, and twisted toward Asa. He leaped to one side, firing from the air and missing, and saw the Slider turn toward the patch of weeds where he would land. His legs were tensed to leap again the moment he hit the mud, but he saw the Slider would be on top of him before he could escape. As he landed he thrust his gun forward almost into the mouth of the creature and fired again.\n \n \n\n \n Even as he was knocked aside into the muck, Asa's body was showered with shreds of alien flesh scattered by the rocket's explosion. Desperately pushing himself to his feet, he saw the long headless body shiver and lie still.\n \n \n\n \n Asa took a deep breath and looked around.\n \n \"Kershaw!\" he called. \"Where are you?\"\n \n \"Over here.\" Kershaw stood briefly above the weeds and fell back again. Asa leaped over to him.\n \n \"Thanks,\" Kershaw said. \"Muck men stick together. You'll make a good one. I wouldn't have had a chance. My leg's busted.\"\n \n \"The helicopter ought to be here pretty soon,\" Asa said. He looked over at the dead Slider and shook his head. \"Tell me, what are the odds on getting killed doing this?\"\n \n \"Last time I was here there was about one mucker killed for every six eggs brought out. Of course you're not supposed to stand there admiring the eggs like I did while a Slider comes up on you.\"\n \n Asa hopped over to the egg, which was still full of a dancing radiance where it rested on the mud. He scooped a hole in the muck and buried the egg.\n \n \"Just in case there are any more Sliders around,\" he explained.\n \n \"Makes no difference,\" said Kershaw, pointing upward. \"Here comes the\n'copter, late as usual.\"\n \n The big machine circled them, hovered to inspect the dead Slider, and settled down on broad skids. Through the transparent nose Asa could see Tom Dorr and Harriet Hazeltyne. The company manager swung the door open and leaned out.\n \n \"I see you took care of the Slider,\" he said. \"Hand over the egg.\"\n \n \"Kershaw has a broken leg,\" Asa said. \"I'll help him in and then I'll get the egg.\"\n \n While Kershaw grabbed the door frame to help pull himself into the helicopter, Asa got under his companion's belly and lifted him by the waist. He hadn't realized before just how strong his new body was. Kershaw, as a muck man, would have weighed close to three hundred pounds on Earth, close to six hundred here.\n \n Dorr made no move to help, but the girl reached under Kershaw's shoulder and strained to get him in. Once he was inside, Asa saw, the cabin was crowded.\n \n \"Are you going to have room for me too?\" he asked.\n \n \"Not this trip,\" Dorr answered. \"Now give me the egg.\"\n \n Asa didn't hesitate. \"The egg stays with me,\" he said softly.\n \n \"You do what I tell you, mucker,\" said Dorr.\n \n \"Nope. I want to make sure you come back.\" Asa turned his head to Harriet. \"You see, Miss Hazeltyne, I don't trust your friend. You might ask him to tell you about it.\"\n \n Dorr stared at him with narrowed eyes. Suddenly he smiled in a way that worried Asa.\n \n \"Whatever you say, Graybar,\" Dorr said. He turned to the controls. In another minute the helicopter was in the sky.\n \n \n\n \n A round trip for the helicopter should have taken no more than twenty minutes, allowing time for Kershaw to be taken out at the settlement.\n \n After an hour passed Asa began to worry. He was sure Dorr would return for the egg. Finally he realized that Dorr could locate the egg approximately by the body of the dead Slider. Dorr could return for the egg any time with some other muck man to dig for it.\n \n Asa pulled down the mouthpiece of his radio.\n \n \"This is Graybar, calling the helicopter,\" he said. \"When are you coming?\"\n \n There was no answer except the hum of carrier wave.\n \n If he tried to carry the egg back, Asa knew, Sliders would attack him all along the way. A man had no chance of getting five miles with an egg by himself. He could leave the egg here, of course. Even so he would be lucky if he got back, following a hazy compass course from which he and Kershaw had certainly deviated on their outward trip. There were no landmarks in this wilderness of bog to help him find his way. The workers were supposed to home in on radio signals, if they lost their bearings, but Dorr would deny him that help.\n \n What was the night like on Jordan's Planet? Maybe Sliders slept at night. If he could stay awake, and if he didn't faint from hunger in this strange new body, and if the Sliders left him alone....\n \n A whirring noise made Asa jump in alarm.\n \n Then he smiled in relief, for it was the helicopter, the blessed helicopter, coming in over the swamp. But what if it was Dorr, coming back alone to dispose of him without any witnesses? Asa leaped for the carcass of the dead Slider and took shelter behind it.\n \n No machine-gun blast of rockets came from the helicopter. The big machine swooped low dizzily, tilted back in an inexpert attempt to hover, thumped down upon the mud and slid forward. As Asa jumped aside, the landing skids caught against the Slider's body and the helicopter flipped forward on its nose, one of the rotor blades plunging deep into the mud.\n \n Asa leaped forward in consternation. Not only was his chance of safe passage back to the settlement wrecked, but now he would have the extra burden of taking care of the pilot. When he reached the nose of the helicopter he saw that the pilot, untangling herself from the controls to get up, was Harriet Hazeltyne.\n \n \n\n IV\n \n \"Are you hurt?\" Asa asked her. She reached for his shoulder to steady herself as she climbed out of the machine.\n \n \"I guess not,\" she said. \"But taking a fall in this gravity is no fun. From the way my face feels I ought to be getting a black eye pretty soon.\"\n \n \"What happened?\"\n \n \"I made a fool of myself.\" She made a face back in the direction of the settlement. \"Dorr wasn't going to come after you. He said anyone who talked back to him should try arguing with the Sliders.\"\n \n She looked up at the machine-gun on the helicopter.\n \n \"They feed at night, you know. And they eat their own kind,\" she said.\n\"The Slider you killed would draw them like ants to jam.\"\n \n Asa glanced around quickly to make sure no Sliders had already come. He eyed the helicopter with distaste at the thought of what a flimsy fort it would make.\n \n \"Anyway,\" Harriet said, \"I told him he couldn't just leave you here and we started arguing. I lost my temper. He thought he had brought me to Jordan's Planet on a fancy tour. I told him the real reason I was here was to check up for my father on the way he was running things and there seemed to be a lot wrong. So he told me very politely I could run things to suit myself and he walked off.\"\n \n She shrugged, as if to indicate that she had made a mess of things.\n \n \"And you took the helicopter by yourself,\" Asa said, as if he could hardly believe it yet.\n \n \"Oh, back on Earth I can make a helicopter do stunts. But I wasn't used to this gravity. I don't suppose you could make this machine stand up straight?\"\n \n Asa tugged at the body of the Slider until he got it off the skids of the plane. He pulled with all his strength at the rotor blade sunk in the mud, but the weight of the helicopter was upon it and the mud held it with a suction of its own. After a few minutes he had to give up.\n \n \"We fight off the Sliders, then,\" she said, as matter of factly as if that problem was settled. \"If it's any comfort, I know how to handle the machine-gun.\"\n \n \"Nope. In this drizzle, at night, the Sliders would be on us before we could see them. We've got to try to get back.\" He stood in thought while she stared at him patiently. \"What happened to the other muck men who went out today?\" he asked.\n \n \"They were called in when the 'copter came out the first time. Some of them may not have got back yet.\"",
      "metadata": {
        "title": "Muck Man",
        "author": "Fremont Dodge",
        "passage_id": "61467",
        "uid": "cc0c681db1a447bda048ed181919b50a",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "10",
                "uid": "ae7b3f80b0e74b22abf9e6841729ba0b",
                "response_text": "Asa Graybar is a biological engineer who studies keeping Slider eggs alive and he is accused of a crime at the opening of the story. He thinks he was framed by Tom Dorr, Hazeltyne’s general manager.\nHe was offered one year as a “changeling” on another planet or 5 years in rehabilitation on Earth. He elects to do the one year, and thinks that he will get into smuggling Slider eggs on Jordan’s planet. Being a changeling is not a highly sought after line of work, but it pays well, and the people who do it have organs and body parts regenerated to better suit specialized tasks.\nAsa travels to Jordan’s planet on a spaceship with a cellmate, Kershaw, who got caught stealing a Slider egg and is returning to serve more time. When they arrive they are both “converted” into muck men, with the forms of frogs and scaly, pink skin. Their task is to collect Slider eggs and bring them back to the base which is watched over by a warden, Furston.\nAsa and Kershaw go out together for the first time into the mud so Kershaw can teach Asa how to find Slider eggs. They find one, and are immediately attacked by a Slider that disables one of Kershaw’s legs. Kershaw calls for helicopters to come get them. Tom Dorr is operating the helicopter that comes to collect Kershaw in the field, and demands that Asa also give him the egg they found. Asa refuses to ensure his own safety that they would come back to get him as soon as they dropped off Kershaw.\nBack at the base Tom Dorr refuses to go back into the field to rescue Asa and gets into an argument with Harriet Hazeltyne (taking over charge of all operations for her father), and storms off. Harriet goes into the field to save Asa herself, but accidentally crashes the helicopter because she is not used to the double force of gravity. \nAsa is unable to right the helicopter, and they think it is unlikely they will be able to use its machine guns to keep them safe while the Sliders come to feed on the dead Slider they are near to in the night. They must get back to the base somehow, and the story ends with them contemplating how they might do this.\n"
              },
              {
                "worker_id": "2",
                "uid": "0e8792aec84f492983a858ecf4a2c40d",
                "response_text": "Asa Graybar is a biological engineer researching Slider eggs and was set up to be convicted of trying to steal one, most likely by Tom Dorr, the Hazeltyne company’s general manager. Asa can serve five years in a rehabilitation clinic or one year working as a changeling on another planet. Asa chooses to work one year as a muck man on Jordan’s Planet where the Slider eggs are harvested. Medical advancements allow doctors to adapt humans to work in the environments of the other planets, so Asa will have to undergo the change, making him a changeling. \n\tAsa travels to Jordan on a freighter but is kept locked up as a prisoner. His cellmate is Kershaw, a man who has worked as a muck man in the past. He loved Slider eggs so much that when he returned to Earth, he tried to steal a new one because they flashed so much more than the two-year-old egg that he could afford with his $9000 in earnings. Kershaw tells Asa that he thinks the slider egg flashes are the egg calling their mothers and explains how they handle the Sliders that attack when muck men remove an egg from the mud. \n\tOn Jordan, Asa has second thoughts but realizes that there is no turning back on becoming a changeling. Awakening after his transformation, Asa finds Kershaw waiting for him, and he helps Asa learn to hop rather than walk since they have the physical features of frogs now. Furston, the trusty/warden/parole officer, sends Kershaw to work and Asa for training. He also gives Asa some berries to eat that make him vomit; Furston tells him this is to make the point that everything that grows on the planet is poisonous, and Asa shouldn’t get the idea that he can hide out until his term is up because he would starve to death. As he leaves, Asa sees two humans watching him from an observation tower and hops up to see who they are: Harriet Hazeltyne and Tom Dorr. \n\tFurston has Kershaw take Asa out to show him the ropes. Kershaw finds an egg, and Asa warns him to jump when he sees a Slider coming. Kershaw breaks a leg, and Asa manages to kill the Slider. When the helicopter arrives, Harriet and Tom Dorr are aboard. Asa refuses to give them the egg until he loads Kershaw. Then Dorr says there isn’t room for Asa, and they will come back for him. Asa keeps the egg as insurance for them to return but later realizes that Dorr can come back later with another mucker.\n\tFinally, the helicopter returns, but it crashes. Harriet was flying it because Dorr refused to come back for Asa. She tells Asa that a dead Slider attracts other Sliders that will feed on it. Asa tries to upright the helicopter but can’t, so they either have to stay and fight off the Sliders or try to make their way back to the facility.\n"
              },
              {
                "worker_id": "3",
                "uid": "1db23050872f4a97b87d352096e8dfd0",
                "response_text": "At the start of the story, Asa Graybar has been convicted of a crime he believes he has been framed for: keeping a rare, fresh Slider egg in a lab. His options for punishment are five years in a \"social reorientation\" program or one year working on a different planet after modifying his body to function in a different environment. Asa's cellmate seems to think this is the much more dangerous option, but it's the one Asa chooses. The technology of the time allows for regeneration of cells, extending people's lives and allowing them to modify their anatomy to fit a different environment. Asa wants to go to Jordan's Planet specifically, and there is always need for workers there because it is dangerous, so he is able to get a post there. Kershaw, another convict, is on the same trip--he has done this work before. The two men are most interested in the eggs of a creature called a Slider. The eggs have beautiful clear shells and seem to discharge lightning, in a way the humans do not yet understand--being muck men on Jordan's Planet means hunting for these eggs. The eggs die over the course of four years, and Asa wants to find a way to preserve them--this would be a hit to the Hazeltyne monopoly, which Asa believes is the source of his being framed. After arriving on Jordan's Planet, Asa and Kershaw head to the conversion tanks and their bodies are modified to suit the planet. The result is frog-like with pinkish scaly skin and a pair of wings. Asa learns he has to hop instead of walk, and Kershaw gives him pointers as they head to meet Furston, the man who would assign them their jobs. Hazeltyne's daughter (Harriet) and general manager (Tom Dorr), who had been present at Asa's trial, watched as Asa trained--it seems Asa's not the only one who dislikes Dorr. Asa is given supplies to go on a muck trip with Kershaw so that he does not go on his first trip solo. Once they find a safe location, they start to dig for eggs, and Kershaw finds one. As it flashes, the mother Slider starts to run towards the men who run for their lives and call the rescue helicopter. Kershaw manages to drop the egg, and the two men fight under attack by the Slider. Asa recovers the egg as the helicopter arrives with Tom Dorr and Harriet inside, and Asa is worried by Dorr's demeanor. There is only space for one of the men in the helicopter but Asa seems to have been abandoned as he waits for the return. It turns out Dorr didn't think it was worth going back for Asa because he talked back to him. Eventually Harriet Hazeltyne makes it to him, but she crashes the helicopter because although she is a great pilot on Earth, she is not used to the gravity on this planet. "
              },
              {
                "worker_id": "9",
                "uid": "bc76d5e3a98a4f06b92b39de0ed2ff5b",
                "response_text": "Asa Graybar is convicted of stealing a slider egg from Hazeltyne Company. He believes he has been framed by Tom Dorr, Hazeltyne’s general manager, who has brought the owner’s daughter Harriet to the courtroom. Asa is given his choice of two sentences; rather than a relatively comfortable five years in a rehab clinic, Asa opts for a year as a changeling so that he can go to Jordan’s Planet and study slider eggs. He believes his work with eggs prompted the Hazeltyne Company to frame him.\n\nAsa chooses to go to Jordan’s Planet, where the eggs come from. On his way there, he meets Kershaw, a repeat muck man infatuated with the eggs.  Both men are turned into muck men: large, mutated creatures with some oddly unsettling human facial features. Humans have discovered how to prolong life and regenerate organs, which has also led to the changeling process, where convicts can be physiologically altered to be suited for life on other planets. \n\nAsa is trained to use his new body and reckon with the double gravity on the planet. The next day, Kershaw shows Asa the ropes until Kershaw finds an egg. His appreciation of it clouds his judgement, and Asa realizes just in time that Kershaw warned him that the sliders typically attack when the eggs are removed. A slider injures Kershaw’s leg, and Asa jumps out of the way and calls for help before killing the slider in the nick of time. \n\nWhen a helicopter arrives, Tom Dorr and Harriet are in it. Asa insists that they should take the injured Kershaw and he should stay with the egg, since they both won’t fit in the helicopter. Dorr demands that Asa give him the egg, but Asa refuses. The helicopter leaves Asa alone with the egg. \n\nAsa starts to get worried when the helicopter hasn’t returned an hour later, and hopes the sliders don’t attack at night. The helicopter comes back, but it lands clumsily and sticks in the mud. Harriet explains that she is a skilled pilot, but not in this gravity. She also details how she and Dorr argued because he wanted to leave Asa there and let the sliders (who do feed at night, on their own kind like the dead one near Asa) have at him. She told Dorr that she didn’t like how he was running her father’s business, and he told her to run it and stormed off. \n\nAs the passage ends, Asa and Harriet are in the midst of a dicey situation. He can’t lift the helicopter up, and he doesn’t think they’d have a chance of fighting off the sliders in the rain - they’ll have to try to make their way back. He asks Harriet where the rest of the muck men are, and she says they were all called back when the first helicopter came out, but that some may not be back yet. \n"
              }
            ]
          },
          {
            "question_text": "What settings does the story take place in?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "10",
                "uid": "ae7b3f80b0e74b22abf9e6841729ba0b",
                "response_text": "The story opens on Earth and then travels to Jordan’s planet.\nJordan’s planet is the place where Asa goes as a changeling to be a muck man. \nThere is a base on Jordan's planet which has a laboratory for converting prisoners into muck men, living quarters and kitchen, and a courtyard with high walls to keep the Sliders out. The surface of the planet is mud and the force of gravity is twice that on Earth. Asa's conversion into a frog-like person is necessary to survive there.\n\n"
              },
              {
                "worker_id": "2",
                "uid": "0e8792aec84f492983a858ecf4a2c40d",
                "response_text": "The story takes place in the future when humans have traveled to the stars, and medical advancements have enabled humans to regenerate damaged or deficient organs, enabling them to live until about two hundred years of age. The events in the story take place in several locations. It all begins on Earth in a courtroom where Asa Graybar has just been found guilty. From there, Asa is taken down a corridor to his jail cell, which is very small because it only takes Asa four steps to reach the other side. Once Asa decides to become a changeling and work as a muck man on Jordan’s Planet, he ships to the planet on a space freighter where he is kept in a cell for the entire trip but can hear voices in the corridor. \n\tWhen they reach Jordan’s Planet, Asa experiences the discomfort of the double gravity that makes his heart pound to keep his blood circulating. After his conversion to a changeling, Asa goes outside the company’s dome settlement with Kershaw. There was a constant gray drizzle, and most of the planet’s surface was marsh, mud flats, and ponds. On the roof of the settlement building, there is an observation tower. Muck men eat at tables that are low enough to accommodate their froglike physiology. Out in the mud where the muck men work, there are small, slippery creatures. There were also large, segmented creatures called Sliders who lay the eggs that the muck men harvest and attack them when they take an egg. \n\n"
              },
              {
                "worker_id": "3",
                "uid": "1db23050872f4a97b87d352096e8dfd0",
                "response_text": "This story takes place on two separate planets, and the ship that the protagonist takes to travel between the two. The first is Earth, where Asa Graybar is convicted of a crime he did not commit. We see small pieces of the courtroom and prison that Asa visits for some time, but the focus is on the second planet. Jordan's Planet, a planet covered in mud and swamp creatures, has gravity twice as strong as that of Earth. Humans have a hard time dealing with the extra gravity and the mud, so those that stay to do work on the planet undergo medical procedures to make them more like giant frogs to allow them to swim through patches of mud that are too big to jump over. Jordan's Planet is significant because of the animals that live there, more specifically the Sliders and the eggs that they lay. These eggs have great value on Earth, so Hazeltyne, a tycoon on Earth, has built a settlement on Jordan's Planet as a place to train convicts working to recover the eggs for his own personal gain. "
              },
              {
                "worker_id": "9",
                "uid": "bc76d5e3a98a4f06b92b39de0ed2ff5b",
                "response_text": "The story takes place in a courtroom on Earth, a jail cell, an unspecified room where a medical exam takes place, a transport ship, and several locations on Jordan’s Planet. On Jordan’s Planet, the story moves from the medical office where the changeling conversions happen, a walled and partially covered courtyard where Asa does his training that houses multiple muck man-sized stalls, an office where Dorr and Harriet and the human higher ups work, and the muddy swamps where the muck men search for eggs. Jordan’s Planet is muddy and treacherous, with double gravity. The story is set at an unspecified time in the future, when interplanetary travel and extreme biological mutations are commonplace and human lifespans average two-hundred years. \n"
              }
            ]
          },
          {
            "question_text": "What happens to Tom Dorr in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "10",
                "uid": "ae7b3f80b0e74b22abf9e6841729ba0b",
                "response_text": "Asa thinks Tom framed him for the crime at the opening of the story. Tom is present on Jordan’s planet when Asa arrives to begin his one year term as a muck man. \nTom is providing a tour of Jordan’s planet to Harriet Hazeltyne, who is taking over her father’s operations and wants to investigate how Toms is running things. Tom and Harriet get into an argument on Jordan’s planet and Tom leaves in anger. It is unclear what his final fate is after leaving, though it is likely he will be removed from his post.\n"
              },
              {
                "worker_id": "2",
                "uid": "0e8792aec84f492983a858ecf4a2c40d",
                "response_text": "Tom Dorr is the general manager of the Hazeltyne company. He is thought to be responsible for Asa Graybar’s arrest and conviction for theft of a Slider egg by planting an egg in Asa’s lab. Dorr travels to Jordan’s Planet with Harriet Hazeltyne; he thinks she is there for a tour, but she is really there on behalf of her father to see how Dorr is running the company’s settlement on the planet because it seemed that things were not in order. Dorr flies the helicopter to pick up Asa and Kershaw when the Slider attacks them, but Dorr tells Asa there isn’t room for him on that trip. Dorr then refuses to go back to pick up Asa, which leads to an argument with Harriet. When she tells him the real reason she is there, he quits his job, telling her that she can run things to suit herself.\n"
              },
              {
                "worker_id": "3",
                "uid": "1db23050872f4a97b87d352096e8dfd0",
                "response_text": "Tim Dorr is present at Asa's trial at the beginning of the story, and Asa thinks that he is responsible for framing him for a crime he did not commit. We do not see him again until Asa is on Jordan's Planet, performing a number of exercises to acclimate him to the new environment and his new body. He is in the helicopter that arrives to rescue Kershaw and Asa when they are attacked while recovering an egg but makes no effort to help them into the helicopter and demands to take the egg from them, but when Asa refuses, Dorr heads back to the settlement with Kershaw and doesn't come back for Asa as he should; it is up to Harriet to decide Asa was worth retrieving. "
              },
              {
                "worker_id": "9",
                "uid": "bc76d5e3a98a4f06b92b39de0ed2ff5b",
                "response_text": "Tom Dorr is the general manager and right hand man to the leader of the Hazeltyne company. Asa believes that Dorr framed him due to his work with slider egg lifespans. Asa sees him escorting Harriet Hazeltyne at his trial, and then encounters them again on Jordan Planet after he becomes a muck man. Dorr is flying the helicopter that comes to retrieve Asa and Kershaw and the egg, and has brought Harriet along. Dorr asks for the egg but Asa insists on lifting the injured Kershaw into the helicopter first. Realizing that he won’t fit in there with them, Asa says he’ll hold onto the egg. Dorr tells him to do as he’s told, but Asa tells Harriet that he doesn’t trust Dorr to come back for him and suggests she ask him why. They take off, and Dorr tells Harriet that he won’t go back for Asa and will instead let him try his luck with the sliders. He and Harriet argue about this and the fact that he thought Harriet was there to get a grand tour from him while she said that she was there to check up on how he was running things for her father, and that she was unimpressed by what she saw. Dorr tells her she should run it herself, and walks off. \n"
              }
            ]
          },
          {
            "question_text": "What is the relationship like between Asa and Kershaw?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "10",
                "uid": "ae7b3f80b0e74b22abf9e6841729ba0b",
                "response_text": "They meet as cellmates on their way to Jordan’s planet to convert to muck men. They convert into frog-like forms together. Kershaw is assigned to pick up where he left off as a return prisoner and Asa is taught how to operate in his new body.\nKershaw teaches Asa the ropes of how to collect slider eggs as a muck man. One muck man is killed for about every 6 Slider eggs that are found, and it is extremely dangerous. During their first time out they have to fight a Slider and Kershaw breaks his leg, relying on Asa to save him. This task bonds them together as they must trust each other with their lives.\n"
              },
              {
                "worker_id": "2",
                "uid": "0e8792aec84f492983a858ecf4a2c40d",
                "response_text": "Asa and Kershaw have a friendly relationship. When they are in a cell together on the flight to Jordan’s Planet, Kershaw tells Asa what it is like to work there because he has worked there before. He is going back because he was caught stealing a new Slider egg that he couldn’t resist because it was so beautiful. Kershaw tells Asa his theory that the flashes of the eggs are the eggs calling to their mothers because when muck men take one out of the muck, a Slider always comes right away. Kershaw helps Asa learn how to hop after Kershaw’s transformation, and he gives him helpful advice about doing what Furston says. Kershaw also teaches Asa how to recognize when Sliders have been in an area recently and when an egg has recently been laid. When Kershaw finds the egg, Asa saves him by yelling for him to jump and then shooting the Slider and radioing for the helicopter. When the aircraft arrives, Asa carries Kershaw and puts him on board.\n"
              },
              {
                "worker_id": "3",
                "uid": "1db23050872f4a97b87d352096e8dfd0",
                "response_text": "Asa and Kershaw are both convicted criminals with an interest in Slider eggs, though Asa believes he has been framed. The two of them meet because they are on the same transport to Jordan's Planet, reporting for a year of service as muck men to avoid five years of rehabilitation. Kershaw has been to Jordan's Planet before, so he becomes a mentor to Asa and gives him tips on who the various figureheads are at the settlement, and on how to do the job safely. The two of them go on a mission together once they arrive so that Asa can learn the ropes. Asa supports Kershaw as they are attacked by a Slider after Kershaw is injured. Kershaw believes in the mantra that muck men stick together and look out for each other and this allowed the men to warm up to each other very quickly, and the way the story is set up it seems they will be close friends as their story continues.\n"
              },
              {
                "worker_id": "9",
                "uid": "bc76d5e3a98a4f06b92b39de0ed2ff5b",
                "response_text": "Asa and Kershaw have a friendly relationship. Asa empathizes with Kershaw’s obsession with the eggs, and Kershaw serves as a mentor to Asa since he has already done time as a muck man on Jordan Planet. Kershaw is glad to have not only tips and training from Kershaw, but insight into the eggs themselves, which Kershaw loves and Asa is determined to study and learn more about. Their relationship is relatively jovial, especially considering their circumstances, and they look out for each other. After Kershaw finds the egg and is injured by the slider, he is grateful to Asa for saving his life and Asa is protective of him, insisting that Kershaw get into the helicopter first. \n"
              }
            ]
          },
          {
            "question_text": "What is the significance of the egg to the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "10",
                "uid": "ae7b3f80b0e74b22abf9e6841729ba0b",
                "response_text": "The Slider egg is a captivating object that has a clear shell, and light of various colors flash inside it. They are laid by Sliders on Jordan’s planet and are collected by prisoners that are stationed there. The eggs only live for about 4 years, which makes them in demand. If they could be stabilized to live longer they would be even more valuable.\nTheir use is never discussed and the people in the story do not reveal why they are so valuable. Asa is working on a method to keep the eggs alive for longer at the opening of the story, but does not continue in that task during the plot.\n"
              },
              {
                "worker_id": "2",
                "uid": "0e8792aec84f492983a858ecf4a2c40d",
                "response_text": "\n\tThe Slider egg is a thing of such beauty that the Hazeltyne company that harvests and sells it is one of the most valuable franchises of all the planets. The eggs have a crystal clear shell and albumen, and the yolk is a sparkling network of filaments that flash like lightning. The eggs live for about four years, and their rarity and fading value makes them a luxury item.  The supposed theft of one of these eggs led to the arrest and conviction of Asa Graybar, a biological engineer with the company. Kershaw describes them as sparkling like a million diamonds when they are first pulled out of the mud, and even after spending a year as a muck man, he risks arrest again when he steals a new one that he can’t resist. For his sentence, he chooses to become a muck man again, even though the work is extremely dangerous. The eggs are so valuable as to justify the expense of building a settlement on Jordan’s Planet to harvest them.  \n"
              },
              {
                "worker_id": "3",
                "uid": "1db23050872f4a97b87d352096e8dfd0",
                "response_text": "The events of the story are centered around Slider eggs. Sliders are creatures that live in the swamps on Jordan's Planet that have eight flippers on each side of their bodies, and are very protective of their eggs. They feed at nighttime, and consume members of their own species. In contrast, the eggs themselves are like magnificent works of art, with crystal clear shells and yolks that seem to emit electricity. These flashes of light start as the eggs are pulled out of the mud by the humans, and some suspect it is a way for the egg to signal to its mother that it is being handled by someone else. It is the flashes that seem to trigger the Slider attacks that often kill muck men working on the surface. Kershaw's time on Jordan's Planet made him obsessed with these eggs, and drove him to come back after he tried to steal one again. They die over the course of four years and Asa's goal is to find a way to preserve them, so he wants to study them at their source. The reason he is headed to Jordan's Planet is because he was accused (and convicted, though he believes he was framed) of hiding an egg in a lab. These eggs are also the key to the monopoly that Hazeltyne has, as a tycoon on Earth.   "
              },
              {
                "worker_id": "9",
                "uid": "bc76d5e3a98a4f06b92b39de0ed2ff5b",
                "response_text": "The egg is very significant to the story, as Asa was framed and convicted in the first place for his work with the eggs, his decision to undergo changeling conversion is centered around studying the eggs, and his new situation on Jordan Planet is centered around the collecting of slider eggs. Additionally, the eggs are what draw Kershaw into the story, as he was taken in by their allure during his last stint as a muck man, and got arrested again for stealing an egg. The eggs are also the source of wealth for the Hazeltyne Company. The first image the story gives us is a slider egg glittering in Harriet Hazeltyne’s hair. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4735,
        "document_length_chars": 26600
      }
    }
  ]
}