{
  "item_metadata": {
    "item_id": "62039",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "62039",
      "content": "THE LORELEI DEATH\n \n\n by NELSON S. BOND\n \n \n Far out in limitless Space she plied her deadly trade ... a Lorelei of the void, beckoning spacemen to death and destruction with her beautiful siren lure.\n \n [Transcriber's Note: This etext was produced from Planet Stories Winter 1941. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Chip Warren stood before an oblong of glass set into one wall of the spaceship Chickadee II , stared at what he saw reflected therefrom—and frowned. He didn't like it. Not a bit! It was too—too—\n \n He turned away angrily, ripped the offending article from about his neck, and chose another necktie from the rack. This one was brighter, gaudier, much more in keeping with the gaiety of his mood. He emitted a grunt of satisfaction, spun from the mirror to face his two companions triumphantly.\n \n \"There! How do you like that ?\"\n \n Syd Palmer, short and chubby, tow-headed and liquid-blue of eye, always languid save when engaged in the solution of some engineering problem concerned with the space vessel he mothered like a brooding hen, moaned insultingly and forced a shudder.\n \n \"Sunspots! Novae! Flying comets! And he wears 'em around his neck!\"\n \n \"You,\" Chip told him serenely, \"have no appreciation of beauty. What do you think of it, Padre?\"\n \n \"Salvation\" Smith, a tall, gangling scarecrow garbed in rusty black, a lean-jawed, hawkeyed man with tumbled locks of silver framing his weathered cheeks like a halo, concealed his grin poorly. \"Well, my boy,\" he admitted, \"there is some Biblical precedent for your—ahem!—clamorous raiment. 'So Joseph made for himself a coat which was of many colors—'\"\n \n \"Both of you,\" declared Chip, \"give me a pain in the pants! Stick-in-the-muds! Here we are in port for the first time in months, cargo-bins loaded to the gunwales with enough ekalastron to make us rich for life—and you sit here like a pair of stuffed owls!\n \n \"Well, not me! I'm going to take a night off, throw myself a party the likes of which was never seen around these parts. Put a candle in the window, chilluns, 'cause li'l' Chip won't be home till the wee, sma' hours!\"\n \n Syd chuckled.\n \n \"O.Q., big shot. But don't get too cozy with any of those joy-joint entertainers. Remember what happened to poor old Dougal MacNeer!\"\n \n Salvation said soberly, \"Syd's just fooling, my boy. But I would be careful if I were you. We're in the Belt, you know. The forces of law and order do not always govern these wild outposts of civilization as well as might be hoped. The planetoids are dens of iniquity, violent and unheeding the words of Him who rules all—\"\n \n The old man's lips etched a straight line, reminding Chip that Salvation Smith was not one of those milk-and-water missionaries who espoused the principle of \"turning the other cheek\" to evildoers. Salvation was not the ordained emissary of any church. A devoutly religious man with the heart of an adventurer, he had taken upon himself the mission of carrying to outland tribes the story of the God he worshipped.\n \n That his God was the fierce Yahveh of the Old Testament, a God of anger and retribution, was made evident by the methods Salvation sometimes employed in winning his converts. For not only was Salvation acknowledged the most pious man in space; he was also conceded to be the best hand with a gun!\n \n Now Chip gave quiet answer. \"I know, Padre: I'll be careful. Well, Syd—sure you won't change your mind and come along?\"\n \n \"No can do, chum. The spaceport repair crew's still smearing this jalopy with ek. Got to stay and watch 'em.\"\n \n \"O.Q. I'm off alone, then. See you later!\"\n \n And, whistling, Chip Warren stepped through the lock of the Chickadee onto the soil of the asteroid Danae.\n \n \n\n \n Danae was, thought Chip as he strolled along briskly toward the town beyond the spaceport, a most presentable hunk of rock. Nice lucentite Dome ... good atmo ... a fine artificial grav system based on Terra normal. It seemed to be a popular little fueling-stop, too, for its cradle-bins were laden with vessels from every planet in the System, and as he gained the main drag he found himself rubbing shoulders with citizens of every known world. Lumbering, albino Venusians, petal-headed Martians, Jovian runts, greenies from far Uranus, Earthman—all were here.\n \n Quite a likely place, he thought happily, to chuck a brawl. A brilliantly gleaming xenon sign before him welcomed visitors to:\n \n \n XU'UL'S SOLAREST Barroom—Casino—Dancing 100—Lovely Hostesses—100\n \n He entered, and was immediately deluged by a bevy of charm-gals vying for the privilege of: (1) helping him beat the roulette wheel; (2) helping him drink the house dry, and/or (3) separating him as swiftly as possible from the credits in his money belt.\n \n Chip shook them off, gently but firmly. He wanted a good time, true; but he wanted it solo. The main cabaret was too crowded; he passed through it and another equally blatant room wherein twoscore Venusians were straining the structure with a native \"sing-stomp,\" and ended up finally, with a sigh of relief, in a small, dimly-lighted private bar unfrequented by anyone save a bored and listless Martian bartender.\n \n The chrysanthemum-pated son of the desertland roused himself as Chip entered, rustled his petals and piped a ready greeting.\n \n \"Welcoom, ssirr! Trrink, pleasse?\"\n \n This was more like it! Chip grinned.\n \n \"Scotch,\" he said. \" Old Spaceman. And let's have a new bottle, Curly. None of that doctored swill.\"\n \n \"Of courrsse, ssirr!\" piped the bar-keep aggrievedly. He pushed a bottle across the mahogany; Chip flipped a golden credit-token back at him.\n \n \"Tell me when I've guzzled this, and I'll start work on another.\" He took a deep, appreciative sniff. \"And don't let any of those dizzy dolls in here,\" he ordered. \"I've got a lot of back drinking to catch up on, and I don't want to be disturbed— Hey! \"\n \n In his alarm, he almost dropped the bottle. For the door suddenly burst open, and in its frame loomed a figure in Space Patrol blues. A finger pointed in Chip's direction and a bull-o'-Bashan voice roared:\n \n \" Stop! Bartender—grab that man! He's a desperate criminal, wanted on four planets for murder!\"\n \n \n\n \n Shock momentarily immobilized Chip. Not so the bartender. He was, it seemed, an ardent pacifist. With a bleat of panic fear he scampered from his post, his metallic stilts clattering off in the distance. Chip's accuser moved forward from the shadows; dim light illumined his features. And—\n \n \" Johnny! \" Chip's voice lifted in a note of jubilant surprise.\n\"Johnny Haldane—you old scoundrel! Where in the void did you drop from?\"\n \n The S.S.P. man chuckled and returned Chip's greeting with a bone-grinding handclasp.\n \n \"I might ask the same of you, chum! Lord, it's been ages since we've crossed 'jectory! When I saw you meandering across the Casino, you could have knocked me down with a jetblast! What's new? Is old Syd still with you?\"\n \n \"We're still shipmates. But he's back at the spaceport. The jerry-crew is plating our crate with ek, and—\"\n \n \"Ek! Plating a private cruiser!\" Haldane stared at him in astonishment, then whistled. \"Sweet Sacred Stars, you must be filthy with credits to be able to coat an entire ship with ekalastron!\"\n \n \"You,\" boasted Chip, \"ain't heard nothing yet!\" And he told him how they had discovered an entire mountain of the previous new element, No.\n97 in the periodic table, on frigid Titania, satellite of far Uranus.\n\"It was touch-and-go for a while,\" he admitted, \"whether we'd be the luckiest three guys in space—or the deadest! But we passed through the flaming caverns like old Shadrach in the Bible—remember?—and here we are!\"\n [1]\n \n Haldane was exuberant. \"A mountain of ekalastron!\" he gloated.\n\"That's the greatest contribution to spaceflight since Biggs' velocity-intensifier!\" It was no overstatement. \"Element No. 97 was a metal so light that a man could carry in one hand enough to coat the entire hull of a battleship—yet so adamant that a gossamer film of it would deflect a meteor! A metal strong enough to crush diamonds to ash—but so resilient that, when properly treated, it would rebound like rubber! What are you going to do with it, Chip? Put it on the open market?\"\n \n Warren shook his head.\n \n \"Not exactly. We talked it over carefully—Syd and Salvation and I—and we decided there are some space-rats to whom it shouldn't be made available. Privateers and outlaws, you know. So we turned control of the mines over to the Space Patrol at Uranus, and visiphoned the Earth authorities we were bringing in one cargo—\"\n \n \"Visiphoned!\" interrupted Haldane sharply. \"Did you say visiphoned?\"\n \n \"Why—why, yes.\"\n \n \"From where?\"\n \n \"Oh, just before we reached the Belt. We don't have a very strong transmitter, you know. Sa-a-ay, what's all the excitement, pal? Did we do something that was wrong?\"\n \n Haldane frowned worriedly. \"I don't know, Chip. It wasn't anything wrong , but what you did was damned dangerous. For if your message was intercepted, you may have played into the very hands of—the Lorelei!\"\n \n \n\n \n Chip stared at his friend bewilderedly for a moment. Then he grinned.\n\"Hey—I must be getting slightly whacky in my old age. I stand here with an unopened bottle in my hands and hear things! For a minute I thought you said 'Lorelei.' The Lorelei, my space-cop friend, is a myth. An old Teutonic myth about a beautiful damsel who sits out in the middle of a sea on a treacherous rock, combing her golden locks, warbling and luring her fascinated admirers to destruction.\"\n \n He grunted. \"A dirty trick, if you ask me. Catch a snort of this alleged Scotch, pal, and I'll torture your eardrums with the whole, sad story.\" He started to sing. \"' Ich weiss nicht was soll es bedeuten —'\"\n \n The Patrolman laid a hand on his arm, silenced him.\n \n \"It's not funny, Chip. You've described the Lorelei exactly. That's how she got her name. An incredibly beautiful woman who wantonly lures space-mariners to their death.\n \n \"The only difference is that her 'rock' is an asteroid somewhere in the Belt—and she does not sing, she calls! She began exercising her vicious appeal about two months ago, Earth reckoning. Since then, no less than a dozen spacecraft—freighters, liners, even one Patrolship—have fallen prey to her wiles. Their crews have been brutally murdered, their cargos stolen.\"\n \n \"Wait a minute!\" interrupted Chip shrewdly. \"How do you know about her if the crews have been murdered?\"\n \n \"She has a habit of locking the controls,\" explained Haldane, \"and setting ravaged ships adrift. Apparently there is no room on her hideout—wherever it is—for empty hulks. One of these ships was salvaged by a courageous cabin-boy who hid from the Lorelei and her pirate band beneath a closetful of soiled linens in the laundry. He described her. His description goes perfectly with less accurate glimpses seen over the visiphones of several score spacecraft!\"\n \n Chip said soberly, \"So it's no joke, eh, pal? Sorry I popped off. I thought you were pulling my leg. Where do I come into this mess, though?\"\n \n \"Ekalastron!\" grunted Johnny succinctly. \"A jackpot prize for any corsair! And you advertised a cargo of it over the etherwaves! The Lorelei will be waiting for you with her tongue hanging out. The only thing for you to do, kid, is go back to Jupiter or Io as fast as you can get there. Make the Patrol give you a convoy—\"\n \n A sudden light danced in Chip Warren's eyes. It was a light Syd Palmer would have groaned to see—for it usually presaged trouble. It was a bright, hard, reckless light.\n \n \"Hold your jets, Johnny!\" drawled Chip. \"Aren't you forgetting one thing? In a couple more hours, I can face the Lorelei and her whole mob—and be damned to them! She can't touch the Chickadee , because it's being plated right now!\"\n \n Haldane snapped his fingers in quick remembrance.\n \n \"By thunder, you're right! Her shells will ricochet off the Chickadee's hull like hail off a tin roof. Chip, are you in any hurry to reach Earth? I thought not. What do you say we go after the Lorelei together ! I'll swear you in as a Deputy Patrolman; we'll take the Chickadee and—\"\n \n \"It's a deal!\" declared Chip promptly. \"You got any idea where this Lorelei's hangout is?\"\n \n \"That's why I'm here on Danae. I got a tip that one of the Lorelei's men put in here for supplies. I hoped maybe I could single him out somehow, follow him when he jetted for his base, and in that way— Chip! Look out! \"\n \n \n\n \n Haldane shouted and moved at the same time. His arm lashed out wildly, thrusting, smashing Chip to the floor in a sprawling heap. The as-yet unopened bottle was now violently opened; it splintered into a thousand shards against a wall.\n \n Bruised and shaken, Chip lifted his head to see what had caused Johnny's alarm. Even as he did so, the dull gloom of the bar was blazoned with searing effulgence. A lancet of flame leaped from the dark, rearward doorway, burst in Johnny Haldane's face!\n \n The Patrolman cried once, a choking cry that died in a mewling whimper. His unused pistol slipped from slackening fingers, and he sagged to the floor. Again crimson lightning laced the shadows; Haldane's body jerked, and the air was raw with the hot, sickening stench of charred flesh.\n \n With an instinct born of bitter years, Chip had come to his knees behind the shelter of the mahogany bar. But now his own flame-pistol was in his hand, and a dreadful rage was mingled with the agony in his heart. Reckless of results, he sprang to his feet, gun spewing livid death into the shadows.\n \n His blast found a mark. For an instant flame haloed a human face drawn in inhuman pain. A heavy, sultry, bestial face, already puckered with one long, ugly scar that ran from right temple to jawbone, now newly scarred with the red brand of Chip's marksmanship.\n \n Then, before Chip could fire again, came the rasp of pounding footsteps. The man turned and fled. Chip bent over his fallen friend, seeking, with hands that did not even feel the heat, fluttering life beneath still smoldering cloth.\n \n He felt—nothing. Johnny was dead.\n \n A snarl of sheer animal rage burst from Chip's lips. Someone would pay for this; pay dearly! Help was coming now. He himself would lead the hue-and-cry that would track a foul murderer to his lair. He spun as the footsteps drew nearer.\n \n \"Hurry!\" he cried. \"This way! Follow me—\"\n \n In a bound, he hurdled the bar, lingered at the door only long enough to let the others mark his course. For they had burst into the room, now, a full score of them. Excited, hard-bitten dogs of space, quick-triggered and willing. Once more he cried for help.\n \n \"After him! Come on! He—\"\n \n And then—disaster struck! For a reedy voice broke from the van of the mob. The voice of the Martian bartender.\n \n \"That's him!\" he piped sibilantly. \"That's the man! He's a desperate criminal, wanted on four planets for murder! The Patrolman came to arrest him— and now he's murdered the Spacie !\"\n \n \n\n \n II\n \n The stunning injustice of that accusation came close to costing Chip Warren his life. For a split second he stood motionless in the doorway, gaping lips forming denial. Words which were never to be uttered, for suddenly a raw-boned miner wrenched a Moeller from its holster, leveled and fired.\n \n The hot tongue of death licked hungrily at the young spaceman's cheek, scorched air crackled in his eardrums. Now was no time to squander in vain argument. Chip ducked, spun, and hurled himself through the doorway. There still remained one hope. That he might catch the real murderer, and in that way clear himself....\n \n But the door led to a small, deserted vestibule, and it to an alleyway behind Xu'ul's Solarest. Viewing that maze of byways and passages, Chip knew his hope was futile. There remained but one thing to do. Get out of here. But quick!\n \n It was no hard task. The labyrinth swallowed him as it had engulfed the scarred killer; in a few minutes even the footsteps of his pursuers could no longer be heard. And Chip worked his cautious way back to the spaceport, and to the bin wherein was cradled the Chickadee .\n \n Syd Palmer looked up in surprise as Chip let himself in the electro-lock. The chubby engineer gasped, \"Salvation, look what the cat drug in! His high-flying Nibs! What's the matter, Chip? Night-life too much for you?\"\n \n \"Never mind that now!\" panted Chip. \"Is this tin can ready to roll? Warm the hypos. We're lifting gravs—\"\n \n Palmer said anxiously, \"Now, wait a minute! The men haven't quite finished plating the hull, Chip!\"\n \n \"Can't help that! We've got important business. In a very few minutes— Ahh! There he goes now!\" Chip had gone to the perilens the moment he entered the ship; now he saw in its reflector that which he had expected. The gushing orange spume of a spaceship roaring from its cradle. \"Hurry, Syd!\"\n \n There were a lot of things Syd Palmer wanted to ask. He wanted to know who went where ; he was bursting with curiosity about the \"important business\" which had brought his pal back from town in such a rush; his keen eye also had detected a needle-gun burn on Chip's coat-sleeve. But he was too good a companion to waste time now on such trivia.\n \n \"O.Q.,\" he snapped. \"It's your pigeon!\"\n \n And he disappeared. They heard his voice calling to the workmen, the scuff of equipment being disengaged from the Chickadee's hull, the thin, high whine of warming hypatomics. Salvation looked at Warren quizzically.\n \n \"It smells,\" he ventured gently, \"like trouble.\"\n \n \"It is trouble,\" Chip told him. \"Plenty trouble!\"\n \n \"In that case—\" said the old man mildly—\"I guess I'd better get the rotor stripped for action.\" He stepped to the gunnery turret, dropped the fore-irons and stripped their weapon for action. \"'Be ye men of peace,'\" he intoned, \"'but gird firmly thy loins for righteous battle!' Thus saith the Lord God which is Jehovah. Selah!\"\n \n Then came Syd's cry from the depths of the hyporoom.\n \n \"All set, Chip! Lift gravs!\"\n \n Warren's finger found a stud. And with a gusty roar the Chickadee rocketed into space on a pillar of flame.\n \n \n\n \n Two hours later, Chip was still following the bright pinpoint of scarlet which marked the course of his quarry.\n \n In the time that had elapsed since their take-off, he had told his friends the whole story. When he told about the Lorelei, Salvation Smith's seamy old features screwed up in a perplexed grimace. \"A woman pirate in the Belt, son? I find it hard to believe. Yet—\" And when he described the death of Johnny Haldane, anger smoldered in the missionary's eyes, and Syd Palmer's hands knotted into tight, white fists. Said Syd, \"A man with a scar, eh? Well, we'll catch him sooner or later. And when we do—\" His tone boded no good to the man who had slain an old and loved friend.\n \n \"As a matter of fact,\" offered Salvation, \"we've got him now. Any time you say the word, Chip. We're faster than he is. We can close in on him in five minutes.\"\n \n \"I know,\" nodded Warren grimly. \"But we won't do it—yet. I'm borrowing a bit of Johnny's strategy. I've been plotting his course. As soon as I'm sure of his destination, we'll take care of him . But our first and most vital problem is to locate the Lorelei's hideaway.\"\n \n Syd said, \"That's all right with me, chum. I like a good scrap as much as the next guy. Better, maybe. But this isn't our concern, strictly speaking. What we ought to do is report this matter to the Space Patrol, let them take care of it.\"\n \n Salvation shook his head.\n \n \"That's where you're mistaken, Sydney. This is very much our concern. So much so, in fact, that we dare not make port again until it's cleared up. I think you have forgotten that it is not the scar-faced man who is wanted for the killing of Haldane—but Chip!\"\n \n \"B-but—\" gasped Palmer—\"b-but that's ridiculous! Chip and Johnny were old buddies. Lifelong friends!\"\n \n \"Nevertheless, the circumstantial evidence indicates Chip's guilt. Twenty men saw him standing over Johnny's dead body, with a flame-pistol in his hand. And the barkeep heard Johnny 'arrest' Chip and accuse him of murder!\"\n \n Chip said ruefully, \"That's right, Syd. It was only a joke, but it backfired. The bartender thought Johnny meant it. He scooted out of there like a bat out of Hades. I'm in it up to my neck unless we can bring back evidence that Scarface actually did the killing. And that may not be so easy.\"\n \n He stirred restlessly. \"But we'll cross that bridge when we come to it. Right now our job is to keep this rat in sight. We've gone farther already than I expected we would.\" He turned to the old preacher.\n\"Where do you think we're going, Padre? Out of the Belt entirely?\"\n \n \"I've been wondering that myself, son. I don't know for sure, of course, but it looks to me as if we're going for the Bog. If so, you'd better keep a weather-eye peeled.\"\n \n \"The Bog!\" Chip had never penetrated the planetoids so deeply before, but he knew of the Bog by hearsay. All men did. A treacherous region of tightly packed asteroids, a mad and whirling scramble of the gigantic rocks which, aeons ago, had been a planet. Few spacemen dared penetrate the Bog. Of those who did dare, few returned to tell the tale. \"The Bog! Say! I'd better keep a sharp lookout!\"\n \n He turned to the perilens once more, fastened an eye to its lens. And then—\n \n \"Syd!\" he cried. \"Salvation! Look! She—she—!\"\n \n He pressed the plunger that transferred the perilens image to the central viewscreen. And as he did so, a phantom filled the area which should have revealed yawning space, gay with the spangles of a myriad glowing orbs. The vision of an unbelievably beautiful girl, the golden-crowned embodiment of a man's fondest dreaming, eyes wide with an indistinguishable emotion, arms stretched wide in mute appeal.\n \n And from the throats of all came simultaneous recognition.\n \n \" The Lorelei! \"\n \n \n\n \n At the same moment came a plea from the enchantress of space through a second medium. For no reason anyone could explain, the ship's telaudio wakened to life; over it came to their ears the actual words of the girl:\n \n \" Help! Oh, help! Can anyone hear me? Help —\"\n \n Even though he knew this to be only a ruse, a deliberate, dastardly trap set for the unwary, Chip Warren's pulse leaped in hot response to that desperate plea. Even with the warning of Johnny Haldane fresh in his memory, some gallantry deep within him spurred him to the aid of this lovely vision. Here was a woman a man could live for, fight for, die for! A woman like no other in the universe.\n \n Then common sense came to his rescue. He wrenched his gaze from the tempting shadow, cried: \"Kill that wavelength! Tune the lens on another beam, Syd!\"\n \n Palmer, bedazzled but obedient, spun the dial of the perilens . Despite his vastly improved science Man had never yet succeeded in devising a transparent medium through which to view the void wherein he soared; the perilens was a device which translated impinging light-waves into a picture of that which lay outside the ship's hull. When or where electrical disturbances existed in space, its frequency could be changed for greater clarity. This was what Syd now attempted.\n \n But to no avail! For it mattered not which cycle he tuned to—the image persisted. Still on the viewscreen that pleading figure beckoned piteously. And still the cabin rang to the prayers of that heart-tugging voice:\n \n \" Help! Oh, help! Can anyone hear me? Help —\"\n \n Gone, now, was any fascination that thrilling vision might previously have held for Chip Warren. Understanding of their plight dawned coldly upon him, and his brow became dark with anger.\n \n \" We're blanketed! Flying blind! Salvation, radio a general alarm! Syd, jazz the hypos to max. Shift trajectory to fourteen-oh-three North and loft ... fire No. 3 jet....\"\n \n He had hurled himself into the bucket-shaped pilot's seat; now his fingers played the controls like those of a mad organist. The Chickadee groaned from prow to stern, trembled like a tortured thing as he thrust it into a rising spiral.\n \n It was a desperate chance he was taking. Increasing his speed thus, it was certain he would be spotted by the man he had been following; the flaming jets of the Chickadee must form a crimson arch against black space visible for hundreds—thousands!—of miles. Nor was there any way of knowing what lay in the path Chip thus blindly chose. Titanic death might loom on every side. But they had to fight clear of this spot of blindness, clear their instruments....\n \n And then it came! A jarring concussion that smashed against the prow of the Chickadee like a battering ram. Chip flew headlong out of his bucket to spreadeagle on the heaving iron floor. He heard, above the grinding plaint of shattered steel the bellowing prayer of Salvation Smith:\n \n \"We've crashed! 'Into Thy hands, O Lord of old—'\"\n \n Then Syd's angry cry, \"Crashed, hell! He's smashed us with a tractor-blast!\"\n \n Chip stared at his companion numbly.\n \n \"But—but that's impossible! We're plated with ek! A tractor-cannon couldn't hurt us—\"\n \n \" Half-plated! \" howled Syd savagely. \"And those damn fools started working from the stern of the Chickadee ! We're vulnerable up front, and that's where he got us! In a minute this can will be leaking like a sieve. I'll get out bulgers. Hold 'er to her course, Chip!\"\n \n He dove for the lockers wherein were hung the space-suits, tore them hastily from their hangers. Chip again spun the perilens vernier. No good! No space ... no stars ... just a beautiful phantom crying them to certain doom. By now he was aware that from a dozen sprung plates air was seeping, but he fought down despair. While there remained hope, a man had to keep on fighting.\n \n He scrambled back into the bucket-seat, experimented with controls that answered sluggishly. Salvation had sprung to the rotor-gun, was now angrily jerking its lanyard, lacing the void with death-dealing bursts that had no mark. The old man's eyes were brands of fire, his white hair clung wetly to his forehead. His rage was terrible to behold.\n \n \"'Yes, truly shall I destroy them!'\" he cried, \"'who loose their stealth upon me like a thief from the night—'\"\n \n Then suddenly there came a second and more frightful blow. The straining Chickadee stopped as though pole-axed by a gigantic fist. Stopped and shuddered and screamed in metal agony. This time inertia flung Chip headlong, helpless, into the control racks. Brazen studs took the impact of his body; crushing pain banded about his temples, and a red wetness ran into his eyes, blurring and blinding him, burning.\n \n For an instant there flamed before him a universe of incandescent stars, weaving, shimmering, merging. The vision of a woman whose hair was a golden glory....\n \n After that—nothing!\n \n \n\n \n III\n \n From a billion miles away, from a bourne unguessable thousands of light-years distant, came the faint, far whisper of a voice. Nearer and nearer it came, and ever faster, till it throbbed upon Chip's eardrums with booming savagery.\n \n \"—coming to, now. Good! We'll soon find out—\"\n \n Chip opened his eyes, too dazed, at first, to understand the situation in which he found himself. Gone was the familiar control-turret of the Chickadee , gone the bulger into which he had so hastily clambered. He lay on the parched, rocky soil of a—a something. A planetoid, perhaps. And he was surrounded by a motley crew of strangers: scum of all the planets that circle the Sun....\n \n Then recollection flooded back upon him, sudden and complete. The chase ... the call of the fateful Lorelei ... the crash! New strength, born of anger, surged through him. He lifted his head.\n \n \"My—my companions?\" he demanded weakly.\n \n The leader of those who encircled him, a mighty hulk of a man, massive of shoulder and thigh, black-haired, with an unshaven blue jaw, raven-bright eyes and a jutting, aquiline nose like the beak of a hawk, loosed a satisfied grunt.\n \n \"Ah! Back to normal, eh, sailor? Damn near time!\"\n \n Climbing to his feet sent a swift wave of giddiness through Chip—but he managed it. He fought down the vertigo which threatened to overwhelm him, and confronted the big man boldly.\n \n \"What,\" he stormed, \"is the meaning of this?\"\n \n The giant stared at him for a moment, his jaw slack. Then his raven-bright eyes glittered; he slapped a trunklike thigh and guffawed in boisterous mirth.\n \n \"Hear that?\" he roared to his companions. \"Quite a guy, ain't he?\n'What's the meanin' o' this?' he asks! Game little fightin' cock, hey?\" Then he sobered abruptly, and a grim light replaced the amusement in his eyes. Here was not a man to be trifled with, Chip realized. His tone assumed a biting edge. \"The meanin' is, my bucko,\" he answered mirthlessly, \"that you've run afoul o' your last reef. Unless you have a sane head on your shoulders, and you're willing to talk fast and straight!\"\n \n \"Talk?\"\n \n \"Don't stall. We've already unloaded your bins. We found it. And a nice haul, too. Thanks for lettin' us know it was on the way.\" The burly one chuckled coarsely. \"We'd have took it, anyway, but you helped matters out by comin' to us.\"\n \n Johnny Haldane had been right, then. Chip remembered his friend's ominous warning. \"—if your message was intercepted, you may have played into the hands of—\" He said slowly, \"Then you are the Lorelei's men?\"\n \n \"The who? Never mind that, bucko, just talk. That ekalastron—where did it come from?\"\n \n And it occurred to Warren suddenly that although the big man did hold the whip hand, he was still not in possession of the most important secret of all! While the location of the ekalastron mine remained a secret, a deadlock existed.\n \n \"And if I won't tell—?\" he countered shrewdly.\n \n \"Why, then, sailor—\" The pirate leader's hamlike fists tightened, and a cold light glinted in his eyes—\"why, then I guess maybe I'll have to beat it out o' you!\"",
      "metadata": {
        "title": "The Lorelei Death",
        "author": "Nelson S. Bond",
        "passage_id": "62039",
        "uid": "b44307a5a85f405e8cfd226fc2b21c05",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "6",
                "uid": "faba8d4b0a8044c6b3dded264cbe0e2d",
                "response_text": "Chip Warren and his crew of Salvation Smith, a righteous missionary, and Syd Palmer, mechanic, have landed in the Belt on their spaceship Chickadee II after discovering a mountain of ekalastron, a highly sought-after material. Their new fortune is cause for celebration, so Chip picks out a flashy tie, which Syd and Salvation both make fun of him for, and sets off to get a drink. Syd and Salvation do not join him, as the repairmen were still encasing their ship with ekalastron. \nThe asteroid Danae has a gravity that’s modeled after Earth, a good atmosphere, and features a wide variety of interplanetary species. Chip walks into Xu’ul’s Solarest and strolls past all the charm-gals, busy cabarets, and the native sing-stomp, before arriving in an empty, private bar. The Martian bartender serves him a new bottle of Scotch but is quickly frightened when a member of the Space Patrol steps in and accuses Chip of murder. The Martian runs off before the cop reveals himself to be Johnny Haldane, Chip’s old friend. After catching up briefly, Chip tells Johnny about their find on Titania and explains that they turned it all over to the Space Patrol, before visiphoning Earth. At this, Johnny becomes upset and explains that their message could have been intercepted by the mythic Lorelei. Chip laughs him off, but Johnny explains that for the past two months a beautiful blonde woman has been luring spacemen to their doom and stealing all their cargo. They decide to take on the Lorelei together, especially now that the Chickadee will be plated with ekalastron, an impenetrable material. Johnny claims he knows one of Lorelei’s men is on Danae right now getting more supplies, so they could follow him back to their base. As he says that, Johnny saves Chip by throwing him to the floor and sacrificing himself. He is killed by an assailant with a scar on his face. Chip tries to save his friend, but the bartender rushes back in with a horde of people, claiming Chip is the murder. Chip runs away, chasing after the true killer, but loses him. He runs back to the Chickadee, and they quickly take off, even though the plating was only halfway finished. Syd and Salvation question him, and he explains the situation, as they follow the scarred man to the Bog, an extremely dangerous asteroid-ridden area. As Chip attempts to look through the perilens, a beautiful woman pops up, crying for help: the Lorelei. Chaos ensues, and they try to get her off their transmission, while a blast rocks the hull. The Chickadee crashed, and Chip wakes up to see a large man standing above him. He and his men question Chip about the ekalastron, but Chip won’t reveal its location. The story ends with the pirate threatening to torture Chip. \n"
              },
              {
                "worker_id": "3",
                "uid": "6b4b5819b40a46eb8b1bd0a56b6e15b2",
                "response_text": "Chip Warren, of the spaceship Chickadee II, is preparing for a solo night out on the asteroid Danae. Syd Palmer is a friend of his, and Salvation Smith is a missionary who handles a gun famously well: they warn Chip to be careful of the dangers of the Belt on his night out. Chip heads to the casino on the surface of the asteroid, passing members of many races as he heads to the small private bar in the back of the casino, empty except for a Martian bartender. As soon as he gets his scotch, someone bursts in yelling for Chip's arrest. After the bartender runs away, Chip recognizes Johnny Haldane, an old friend. They talk about Chip's recent discovery of an entire mountain's worth of No. 97, or ekalastron, a light and strong metal worth a lot of money. Instead of selling to anyone, Chip, Syd, and Salvation had sent a message to Earth about the cargo, and would handle the details later. Johnny is immediately concerned that \"the Lorelai\" may have intercepted this message--a pirate group much like the sirens who distract ships in the ocean, but in space. As Chip laughs at the idea of a mythical creature being involved, Johnny stops him to explain all of the related destruction that's happened in the past two months--only one person had escaped alive. Johnny explains that the ekalastron would be quite the prize for the Lorelai, and Chip needed to find protection. Chip reminds Johnny that his ship was being plated and could be indestructable, so they decide to go after the Lorelei together. Just then, there is an attack: Johnny is hit in the face with flame while pushing Chip out of the way. Johnny dies and the attacker flees when he hears footsteps, leaving Chip calling for help. Unfortunately, the Martian bartender thought Johnny's murder accusation had been serious, had gone to get help, and now assumes Chip is responsible for Johnny's death. A miner shoots at Chip, who runs to catch the real murderer to save himself. When he gets back to the Chickadee, he yells at Syd to get the ship moving, and spots the ship the murderer is leaving on. They move the ship as quickly as they can, and Chip catches his friends up as they fly towards the Bog, a region densely packed with asteroids. As they approach, they spot a phantom that is undeniably the Lorelei, calling for help. They try to modify their viewing equipment to get rid of the image, but she stays and keeps calling, and the ship was hit in the part that hadn't yet been plated. They are hit again and the men eventually pass out. As Chip comes to, he finds himself on the surface of a planet surrounded by pirates who laugh at him and explain that they want his ekalastron--they had intercepted Chip's message to Earth, but they still want to know where he got it.  "
              },
              {
                "worker_id": "2",
                "uid": "6fdc54c20d4f4eeab5cf5db9c84f4cb8",
                "response_text": "Chip Warren is going to celebrate discovering a mountain of ekalastron by drinking scotch while the other crewmen, Syd Palmer and Salvation Smith, stay with the ship. Chip enters a bar where he orders his scotch when the door bursts open and a voice yells for the bartender to grab Chip, stating he is wanted for murder on four planets. Terrified, the bartender flees the bar, and Chip faces his accuser, who is actually his old friend Johnny Haldane, a Space Patrol officer playing a joke on him. They talk, and Chip explains he is plating his ship with the ek they found. When Chip says they visiphoned Earth authorities they were bringing in a cargo of ek, Haldane stops him and explains how dangerous that is, warning he might have set himself up to be a victim of the Lorelei.\n       Chip believes the Lorelei is a myth, but Haldane tells him it is real. In the last two months, a dozen spacecraft have been taken, their crews murdered, and the cargo stolen. Haldane urges Chip to go back to Jupiter or Io with a Space Patrol escort, but Chip reminds him that his ship will be invincible. Haldane then encourages Chip to join him in Chip’s spacecraft to take down the Lorelei together. Haldane is looking for one of the Lorelei’s men who is on the asteroid for supplies and will follow the man to the Lorelei base.\n       Suddenly, Haldane throws Chip aside as a flame shot hits the scotch. The gun fires again, burning Haldane’s face and killing him. Chip fires off a shot at the assailant, making him flee, and checks on Haldane, but the man is already dead. Then the bartender bursts into the bar with a mob behind him, pointing out Chip as the murderer wanted on four planets. He accuses Chip of killing Haldane since he is standing over the man’s body with his flame gun.\n       Chip runs from the bar back to his ship and tells the men to take off right away. They haven’t finished plating the ship with ek, but Chip needs to catch the assailant to prove his innocence. As they travel, Chip looks through the perilens and sees a beautiful blonde woman who motions for them to come to her. Her voice comes through the ship’s audio, and she implores the men to help her. No matter what frequency he uses with his perilens, all he can see is her image. They are hit with a tractor-blast. Chip is stunned his ship is damaged, but Syd reminds him they hadn’t finished applying the ek. When the ship is hit again, Chip slams into the instrument panel and loses consciousness.\n       Regaining consciousness, Chip is lying on the ground, surrounded by several men. The leader tells him they have unloaded his cargo and demands that Chip tell them where they found the ek, threatening to beat the information out of him if Chip refuses.\n"
              },
              {
                "worker_id": "8",
                "uid": "f38a974ce3f6447b8b9662221cc4c144",
                "response_text": "Chip Warren and his shipmates Syd Palmer and \"Salvation\" Smith dock at the Donae asteroid spaceport to refuel and allow their jerry-crew to plate the ship, the Chickadee II, with a protective layer of ekalastron--a powerfully strong, resilient metal of which the team had recently discovered a massive store which they planned to turn over to Space Patrol. As the crew work to cover the ship with the thin metal, Chip goes into the nearby town to celebrate his discovery. He finds Xu'ul's Solarest, a place where citizens from every planet in the Solar System could drink, gamble, and dance together; Chip, however, wants to be alone so he finds a quiet bar manned by a Martian bartender who gives him a bottle of Scotch. Soon, Chip's reverie is disturbed by a loud man accusing him of being a wanted murderer, which frightens the bartender into fleeing the room. Chip's accuser turns out to be his old friend Johnny Haldane, and they laugh and drink together as they catch up. Chip tells Johnny about his ekalastron discovery and about his intentions to deliver his cargo to authorities on Earth. As a Space Patrol officer himself, Johnny warns Chip that his communications with Earth may have been intercepted by the space siren Lorelei and her crew of pirates. At first, Chip shrugs off this suggestion, as he considers Lorelei to be only a myth, but Johnny reveals he is actually on Donae tracking one of her men. Remembering the protective qualities of the ekalastron coating his ship, Chip invites Johnny to join him on the Chickadee II, and they will hunt Lorelei and her crew together. After making this agreement, the two men are suddenly attacked, presumably by the man Johnny is pursuing, and he shoots and kills Johnny. Enraged, Chip flees the bar in pursuit of Johnny's killer with a horde of men tailing him, since the bartender believed Chip was the actual murderer thanks to Johnny's earlier joke. Chip runs back to the ship, and they begin their pursuit of Lorelei's man, despite the ekalastron coating being incomplete. Chip and his team realize they must catch the man in order to find evidence proving Chip's innocence in Johnny's murder. Along the way, they enter The Bog, a region of tightly packed asteroids, where Chip spots Lorelei through the ship's perilens. In an attempt to escape her broadcast, Chip exposes the Chickadee's location to the enemy ship, which quickly takes down the Chickadee II with a couple of crushing blasts. After Chip wakes up, he discovers he has been captured by Lorelei's people, who press him for information as to the whereabouts of the rest of the ekalastron. There is no sign of his shipmates."
              }
            ]
          },
          {
            "question_text": "Who or what is the Lorelei?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "6",
                "uid": "faba8d4b0a8044c6b3dded264cbe0e2d",
                "response_text": "The Lorelei was first an ancient myth that plagued all spacemen. It was a Teutonic myth, similar to the sirens of ancient Greece, about a gorgeous blonde woman who combed her hair and sang to those around her. Her position on the rock lured all the men to their doom, as they would crash around her. That is where the Lorelei originated. In this turn of events, the story has evolved into a present-day pirating crew using the original myth to draw spacemen in. For the past two months, according to Space Patrolman Johnny Haldane, a pirate crew has a beautiful blonde woman calling for help to lure at least a dozen spaceships in before they kill the crew and capture all of their cargo. The pirates then turn on all of the control locks and send the empty ships back out, as they have no space for them in their current base. The Lorelei and her crew intercepted Chip’s message about the ekalastron and set their sights on his ship as their next target. "
              },
              {
                "worker_id": "3",
                "uid": "6b4b5819b40a46eb8b1bd0a56b6e15b2",
                "response_text": "The Lorelei is what Chip refers to as a myth, which his friend Johnny insists is true. According to the original stories, there was a woman who sat on a rock in the middle of a sea distracting people who went by, like the classic siren myths. Johnny had been tracking some of the related crewmen and was investigating a lead when he ran into Chip. Johnny explained the two months of destruction that had occured, including the testimony of the one survivor found in the wreckage of a ship. This myth was being tied to a lot of pirating in the area, with particularly powerful ships. This is why Johnny didn't dare try to attack the Lorelei until he learned the Chip's ship had special plating on it that could protect them. In some sense, the Lorelei is both a myth and also a symbol representing a specific cluster of pirating. "
              },
              {
                "worker_id": "2",
                "uid": "6fdc54c20d4f4eeab5cf5db9c84f4cb8",
                "response_text": "In literature, the Lorelei is an old Teutonic myth about a beautiful woman on a rock in the middle of the sea. She sings and uses her beauty to lure sailors to her where their ships are then destroyed on the rock. In the story, the Lorelei is a trap created by a group of pirates. They manage to fill spaceships’ perilenses with the image of a beautiful young woman with a “come hither” look about her, motioning for the ship to approach her. Her voice is projected through the ships’ audio systems, and she entreats the space sailors to come to her aid. In the past two months, a dozen ships have fallen prey to the trap; the crews were murdered, the cargo stolen, and the empty vessels set adrift back into space. On one ship, however, a cabin boy avoided detection and lived to describe the Lorelei’s appearance and the attack. When the Lorelei image appears in the Chickadee’s perilens, Chip changes to a different frequency, but her image is on all of them; thus, the ship is flying blindly through space. This makes the Chickadee an easy target for the pirates to hit with their tractor-blast and take over. For Chip, though, the pirates know about his discovery of ek, so in addition to taking his cargo, they want to know the location of the remaining ek and plan to beat him until he gives them the information they want."
              },
              {
                "worker_id": "8",
                "uid": "f38a974ce3f6447b8b9662221cc4c144",
                "response_text": "According to Chip, Lorelei is an old Teutonic myth about a beautiful, golden-haired damsel who sits on a rock in the middle of the sea, drawing in admirers to their ultimate doom. However, his space-cop friend Johnny informs Chip that the myth of Lorelei is very real, but instead of the middle of the sea, she makes her perch on an unknown asteroid in the middle of the Belt where she lures space-mariners to their death. Since she and her crew of pirates began attacking from the Belt, they have destroyed a dozen freighters, liners, and Patrolships, murdered their crew and stolen their cargo. Because she has no room on her hideout for ravaged ships, she locks the controls and sends them back into space as a kind of calling card. Johnny warns Chip that Lorelei and her crew will likely be waiting to ambush the Chickadee II as it passes through the Belt, and that is why they plan to join forces against her. However, one of Lorelei's men kills Johnny before they can, leading Chip to chase him down. During the chase, Lorelei appears on the Chickadee's perilens and entrances the men."
              }
            ]
          },
          {
            "question_text": "Who is Johnny Haldane and what happens to him throughout the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "6",
                "uid": "faba8d4b0a8044c6b3dded264cbe0e2d",
                "response_text": "Johnny Haldane is a member of the Space Patrol and one of Chip’s old friends. They talk briefly about their previous adventures and running into each other all across space, which speaks highly of their close bond. He arrives on Dandae to track one of the Lorelei’s crew, hoping to follow him all the way back to their hideout. However, while there, he runs into Chip and makes a grand entrance, accusing him of murder. This causes the bartender to scurry away, so they sit and talk in private while nursing a bottle of scotch. After chatting for a bit, Chip reveals to Johnny that his crew found a mountain of ekalastron and they gave it back to the Space Patrol, as private users might have abused the material. All is well and good until Johnny hears that Chip used his visiphone to get in touch with Earth authorities, which Johnny immediately protests. Evidently, the Lorelei tracks people through visiphone messages and could have intercepted his. They decide to take on the Lorelei together, tracking the crew member back to their base and using Chip’s newly-plated ship for protection. However, before they can move, a man comes in with a scar on his face and shoots at the two of them. Johnny saves Chip’s life by pushing him out of the way but is killed by the blast. "
              },
              {
                "worker_id": "3",
                "uid": "6b4b5819b40a46eb8b1bd0a56b6e15b2",
                "response_text": "Johnny Haldane is a type of space-cop who is following a lead about the Lorelei, which has brought him to the asteroid Danae in an attempt to intercept a supply run. He is friends with Chip, though they have not seen each other in some time. However, they have a friendly rapport, as he was the one who burst into the bar at the beginning of the story, accusing Chip of murder and calling for his arrest as a way to get his attention. He explains everything he knows about the recent attacks that the Loreli has been accused of recently, and they two of them decide to pursue the case together in Chip's fancy newly-protected ship before Johnny dies in a skirmish at the bar by the hand of a man with a scar on his face. Besides the information about the Lorelei, the other lasting impact he has on his story is his false accusation of Chip when he greets him: because everyone else took this seriously, it means Chip is being chased and accused of murder for the duration of the story. \n"
              },
              {
                "worker_id": "2",
                "uid": "6fdc54c20d4f4eeab5cf5db9c84f4cb8",
                "response_text": "Johnny Haldane is a member of the Space Patrol and an old friend of Chip Warren. He is a strong, brave man with a sense of humor. He startles Chip by bursting into the bar and jokingly yelling for someone to grab Chip because he’s wanted for murder. Haldane is impressed to learn that Chip is plating his cruiser with ekalastron and learning of his cargo, asks if Chip will sell it on the open market. When Chip explains they turned the mines over to the Space Patrol at Uranus and visiphoned Earth about their cargo, Haldane informs Chip that he might be in serious danger from the Lorelei. At first, Chip thinks Haldane is talking about the myth, but Haldane explains about the Lorelei image luring ships that are then taken by pirates. The pirates take the cargo and murder everyone on board. Since it started two months ago, the sting has captured a dozen ships. Haldane urges Chip to change his plans and go to Jupiter or Io instead of Earth. But when Chip reminds him his ship is being plated with ekalastron, Haldane offers to deputize Chip to go after the Lorelei together. Haldane explains that one of the Lorelei’s men is on the asteroid now picking up supplies; Haldane is trying to find him so he can follow him back to his base. Suddenly, Haldane thrusts Chip aside, and a flame shot smashes Chip’s drink bottle on the bar. Another shot is fired into Haldane’s face, killing him.\n\tLater, though, Chip’s memories of Haldane help him. He remembers Haldane’s strategy of plotting his prey’s course, and when he is sure of the destination, taking care of him. Chip applies this strategy to the assailant he is chasing, rather than racing up and overtaking him. He wants to find the Lorelei and destroy it to protect everyone in space, in addition to capturing the assailant who can clear his name. It is also Haldane’s warning of the Lorelei that enables Chip to respond without being drawn in by her beckoning. He knows the fate that awaits them if they approach her and immediately takes action that he hopes will prevent them from falling into the pirates’ clutches.\n"
              },
              {
                "worker_id": "8",
                "uid": "f38a974ce3f6447b8b9662221cc4c144",
                "response_text": "Johnny is a space cop with Space Patrol and an old friend of Chip Warren. He speaks with a deep voice, has a powerful handshake, and dresses in the blue uniform of Space Patrol. Johnny is in the casino when he sees Chip walking to the private bar, so he follows him there so the two can catch up. When Johnny enters the bar, he jokes that Chip is a murderer wanted on four planets, a joke the Martian bartender takes to heart after Johnny's death. When Chip and Johnny reunite, Johnny is impressed by Chip's discovery of ekalastron, and even more excited later when Chip offers to use his ek-coated ship to pursue Lorelei and her crew. Johnny comes to Donae in pursuit of one of Lorelei's men after receiving a tip about him traveling there on a supply run. After Johnny provides Chip with information about the truth of Lorelei's existence as well as her violent recent history in space, the two strike up the aforementioned plan to join forces and bring Lorelei to justice. No sooner is this plan hatched, than an unknown assailant--presumably Lorelei's crew member Johnny had been pursuing--begins shooting at the two men in the bar. Johnny sustains a blast to the face and immediately dies. Because of the joke Johnny had told earlier about Chip being a murderer, the Martian bartender believes Chip has killed Johnny. Angered and shaken, Chip pursues Johnny's killer with a horde of men close on heels who believe Chip is the actual killer."
              }
            ]
          },
          {
            "question_text": "What is ekalastron or No. 97?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "6",
                "uid": "faba8d4b0a8044c6b3dded264cbe0e2d",
                "response_text": "Ekalastron is the element No. 97 on the period table. It is an incredibly valuable material due to its properties. It’s an incredibly light metal, and yet it is also impenetrable. Johnny claims that it’s strong enough that a simple film of ekalastron would deflect an entire meteor. Of course, because of this, any amount of ekalastron could make a person very wealthy. Chip and his crew find an entire mountain of ekalastron on the chilly Titania, a satellite off of Uranus. They decided to turn over their find to the Uranus Space Patrol, and then let the Earth authorities know that they were bringing in some cargo. "
              },
              {
                "worker_id": "3",
                "uid": "6b4b5819b40a46eb8b1bd0a56b6e15b2",
                "response_text": "Ekalastron is a recently discovered element that takes up No. 97 on the periodic table. It is an extremely light metal that is also very strong and resiliant, so it could be worth a lot of money to the right people. Chip and his crew had found a mountain of it, which they had collected and begun to use to plate their ship to protect it from attack. The pirates who capture Chip at the end had intercepted Chip's message to Earth about the delivery of the shipment, but it seemed what they were really after was information on the location where Chip had mined this resource. This was worth far more, which made Chip realize he still had an advantage in the discussions.\n"
              },
              {
                "worker_id": "2",
                "uid": "6fdc54c20d4f4eeab5cf5db9c84f4cb8",
                "response_text": "Ekalastron (ek) is a recently discovered new element; on the periodic table, it is No. 97. Ek is extremely valuable due to its characteristics. It is such a lightweight metal that a man can carry enough in one hand to coat the entire hull of a battleship. Yet even the slightest layer of ek is strong enough to deflect a meteor. It is strong enough to crush the hardest materials but at the same time so resilient that it can rebound like rubber. A ship coated in ek will be invincible, so the element is highly desired by both government agencies and criminals alike. Chip’s men have a cargo of it, and all three will be rich for the rest of their lives.\n\tThe element has far-reaching implications for whoever has it; in the wrong hands, it will enable criminals like space pirates to attack and plunder with impunity. In the hands of the government and the Space Patrol, ek will ensure the safety of public officers and officials, guaranteeing that criminal elements will never be able to damage their ships. It also ensures tremendous wealth for whoever owns it. The ek shows the true character of Chip, Syd, and Salvation; while they take enough for their own wants and needs, they turn over the balance to the Space Patrol of Uranus, providing that organization with the opportunity to benefit from it and preventing it from falling into the wrong hands. They also notify Earth that they are bringing a cargo of ek, presumably to arrange a private sale to the government or law enforcement, again keeping the valuable mineral out of the hands of those who would use it for unlawful gain.\n"
              },
              {
                "worker_id": "8",
                "uid": "f38a974ce3f6447b8b9662221cc4c144",
                "response_text": "Ekalastron, colloquially referred to as \"ek\", is a light, but extremely durable metal discovered in vast quantities in the fiery mines of Uranus' moon Titania by Chip Warren and the crew of the Chickadee II. The metal is so strong that even a small sliver of it is sufficient to deflect a meteor striking a ship. It can easily crush diamonds into ash. For all of these reasons, ekalastron is a highly sought-after and valuable element (Number 97 on the periodic table). After discovering a mountain of ekalastron within the mines of Titania, Chip and his crew turns the reserves over to Space Patrol authorities on Uranus and begin the journey back to Earth, where they plan to deliver their ship's cargo of the element. To protect themselves on the journey, they stop at a spaceport on Donae where a jerry-crew begins covering the ship with a thin coat of ekalastron. Johnny Haldane offers to deputize Chip as a member of Space Patrol when he realizes his ship has this level of protection, so that Chip may help him in his pursuit of Lorelei and her band of pirates. Johnny warns Chip that her crew may have already intercepted his transmission to Earth revealing the cargo he is carrying, and they might be lying in wait to ambush Chip on his way back home; therefore, the two have a shared interest in working together. After Chip is captured by Lorelei's men, they demand to know where the rest of the ekalastron stores are."
              }
            ]
          },
          {
            "question_text": "Who is Salvation Smith, and what is his significance in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "6",
                "uid": "faba8d4b0a8044c6b3dded264cbe0e2d",
                "response_text": "Salvation Smith is a highly-religious man and a missionary. However, his god is not a gentle one. Salvation Smith is a scarecrow of a man, tall and lean, who dresses in all black with wavy gray hair. He believed in spreading the word of Yahveh of the Old Testament and took his words to heart. Salvation did not turn away from evil, in fact, he was one of the best shooters in space. Salvation Smith stays behind with Syd Palmer at the beginning of the story, after wisely warning Chip to be careful during his night on the town. Chip and Syd both respect Salvation for his knowledge, faith, and strength, so he is usually listened to. \nIn the end, Salvation helps Chip escape from the authorities and men wrongfully pursuing him and tries to save them from destruction when they encounter the Lorelei. However, the story ends without a complete resolution for Salvation. The readers are unsure if he survived the crash, or if he’d been taken hostage by the pirates. Salvation Smith is often a voice of reason, as well as a great companion throughout the story. \n"
              },
              {
                "worker_id": "3",
                "uid": "6b4b5819b40a46eb8b1bd0a56b6e15b2",
                "response_text": "Salvation Smith is the father of Chip Warren. He is a tall thin man on the older side, with silver hair and a bit of a sickly look to him. His role in the story is that of a missionary; although not affiliated with any church in particular, he is determined to tell the story of his own faith and has enough motivation to do so independently, as part of an adventure. \"his God was the fierce Yahveh of the Old Testament, a God of anger and retribution\" His reputation was two-fold: extreme religiousness but also excellent at handling a weapon. "
              },
              {
                "worker_id": "2",
                "uid": "6fdc54c20d4f4eeab5cf5db9c84f4cb8",
                "response_text": "Salvation Smith is an older gentleman on the Chickadee II crew. He is a tall, rangy man, hawkeyed and gray-haired, with weathered cheeks, who wears black. He is devoutly religious although he is not affiliated with any church. He often integrates Biblical scriptures and analogies in his speech. With the heart of an explorer, Smith has given himself the mission of taking the message of the God he worships to the places they travel in space. Smith doesn’t focus on the merciful, loving New Testament nature of God but rather the Old Testament nature of God as angry and vengeful. In addition, Smith is an excellent marksman and mans the gunnery turret of the Chickadee. Although he works with Chip and Syd, he is also their friend. Smith warns Chip to be careful when he goes out for a drink on Danae, and when Chip returns in a panic to leave immediately, Smith remains calm and supportive. Recognizing trouble is ahead, he immediately prepares the weapon in the gunnery turret for use. \n       Smith is also a wise advisor; when Syd says they should turn the whole matter of chasing the pirate/assailant to the Space Patrol, Smith is the one who points out that they can’t port anywhere until they can clear Chip because Chip is wanted for the murder of Haldane. The circumstantial evidence against Chip is strong, and 20 witnesses saw him standing over the dead body with a weapon drawn. Furthermore, the bartender heard Haldane “accuse” Chip of murder. When the assailant leads them deeper into space than Chip has ever gone, he asks Smith where he thinks they are headed, and Smith predicts it’s the Bog where asteroids are prevalent and difficult to avoid. \n"
              },
              {
                "worker_id": "8",
                "uid": "f38a974ce3f6447b8b9662221cc4c144",
                "response_text": "Salvation Smith is a tall, gangly missionary with a lean jaw, long, silver hair, weathered cheeks, and the heart of an adventurer. He is one of the crew members of the Chickadee. Although he is prone to quoting scripture and warning his crewmates of the violence and iniquities of the planetoids they visit, Salvation is not officially ordained through the church. However, his devout religious beliefs compel him to bring the story of his God to outland tribes. The God he worships is \"the fierce Yahveh of the Old Testament,\" and Salvation sometimes resorts to strong-arm methods in bringing converts to his faith; he is quite gifted with a gun. Because of their affection for him, Chip and Syd call him \"Padre.\" When Chip returns to the ship to chase down Lorelei's goon who had killed Johnny, Salvation mans the gunnery turret and prepares for battle. When Syd wants to abandon the effort to catch the goon, Salvation stands with Chip, reminding Syd that authorities believe Chip was responsible for Johnny's death. When the goon takes advantage of the distraction employed by Lorelei, Salvation lets loose with the gunfire, shooting at an invisible target."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5096,
        "document_length_chars": 29900
      }
    }
  ]
}