{
  "item_metadata": {
    "item_id": "62198",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "62198",
      "content": "QUEST OF THIG\n \n\n By BASIL WELLS\n \n \n Thig of Ortha was the vanguard of the conquering \"HORDE.\" He had blasted across trackless space to subdue a defenseless world—only to meet on Earth emotions that were more deadly than weapons.\n \n [Transcriber's Note: This etext was produced from Planet Stories Fall 1942. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Thig carefully smoothed the dark sand and seaweed of the lonely beach over the metal lid of the flexible ringed tunnel that linked the grubby ship from another planet with the upper air. He looked out across the heaving waters of the Sound toward Connecticut. He stared appraisingly around at the luxuriant green growth of foliage further inland; and started toward the little stretch of trees and brush, walking carefully because of the lesser gravitation.\n \n Thig was shorter than the average Earthman—although on Ortha he was well above the average in height—but his body was thick and powerfully muscled. His skull was well-shaped and large; his features were regular, perhaps a trifle oversize, and his hair and eyes were a curiously matching blend of reddish brown. Oddest of all, he wore no garments, other than the necessary belt and straps to support his rod-like weapon of white metal and his pouches for food and specimens.\n \n The Orthan entered the narrow strip of trees and crossed to the little-used highway on the other side. Here he patiently sat down to wait for an Earthman or an Earthwoman to pass. His task now was to bring a native, intact if possible, back to the carefully buried space cruiser where his two fellows and himself would drain the creature's mentality of all its knowledge. In this way they could learn whether a planet was suited for colonization by later swarms of Orthans.\n \n Already they had charted over a hundred celestial bodies but of them all only three had proven worthy of consideration. This latest planet, however, 72-P-3 on the chart, appeared to be an ideal world in every respect. Sunlight, plenty of water and a dense atmospheric envelope made of 72-P-3 a paradise among planets.\n \n The explorer from another world crouched into the concealment of a leafy shrub. A creature was approaching. Its squat body was covered with baggy strips of bluish cloth and it carried a jointed rod of metal and wood in its paw. It walked upright as did the men of Ortha.\n \n Thig's cold eyes opened a trifle wider as he stared into the thing's stupid face. It was as though he was looking into a bit of polished metal at the reflection of himself!\n \n The Earthman was opposite now and he must waste no more precious time. The mighty muscles of the Orthan sent him hurtling across the intervening space in two prodigious bounds, and his hands clamped across the mouth and neck of the stranger....\n \n \n\n \n Lewis Terry was going fishing. For a week the typewriter mill that had ground out a thousand assorted yarns of the untamed West and the frigid desolation of the Northwoods had been silent. Lewis wondered if he was going stale. He had sat every day for eight hours in front of that shiny-buttoned bane of the typist, but there were no results. Feebly he had punched a key two days ago and a $ sign had appeared. He hadn't dared touch the machine since.\n \n For Mr. Terry, that hard-hitting writer of two-gun action, had never been further west of Long Island than Elizabeth, and he had promised his wife, Ellen, that he would take the three children and herself on a trailer tour of the West that very summer. Since that promise, he could not write a word. Visions of whooping red-skinned Apaches and be-chapped outlaws raiding his little trailer home kept rolling up out of his subconscious. Yet he had to write at least three novelets and a fistful of short stories in the next two weeks to finance the great adventure—or the trip was off.\n \n So Lewis left the weathered old cottage in the early dawn and headed for his tubby old boat at the landing in an attempt to work out a salable yarn....\n \n \"Hey!\" he shouted as a naked man sprang out of the bushes beside the road. \"What's the trouble?\"\n \n Then he had no time for further speech, the massive arms of the stranger had wound around him and two hamlike hands shut off his speech and his wind. He fought futilely against trained muscles. The hand clamping his throat relaxed for a moment and hacked along the side of his head. Blackness flooded the brain of Lewis, and he knew no more.\n \n \n\n \n \"There it is,\" announced Thig, dropping the limp body of the captured Earthman to the metal deck-plates. \"It is a male of the species that must have built the cities we saw as we landed.\"\n \n \"He resembles Thig,\" announced Kam. \"But for the strange covering he wears he might be Thig.\"\n \n \"Thig will be this creature!\" announced Torp. \"With a psychic relay we will transfer the Earthman's memories and meager store of knowledge to the brain of Thig! He can then go out and scout this world without arousing suspicion. While he is gone, I will take Kam and explore the two inner planets.\"\n \n \"You are the commander,\" said Thig. \"But I wish this beast did not wear these clumsy sheathing upon his body. On Ortha we do not hamper the use of our limbs so.\"\n \n \"Do not question the word of your commander,\" growled Torp, swelling out his thick chest menacingly. \"It is for the good of our people that you disguise yourself as an Earthman.\"\n \n \"For the good of the Horde,\" Thig intoned almost piously as he lifted Terry's body and headed for the laboratory.\n \n Service for the Horde was all that the men of Ortha knew. Carefully cultured and brought to life in the laboratories of their Horde, they knew neither father nor mother. Affection and love were entirely lacking in their early training and later life. They were trained antlike from childhood that only the growth and power of the Horde were of any moment. Men and women alike toiled and died like unfeeling robots of flesh and bone for the Horde. The Horde was their religion, their love-life, their everything!\n \n So it was that the bodies of the Earthman and the Orthan were strapped on two parallel tables of chill metal and the twin helmets, linked to one another by the intricacies of the psychic relay, put upon their heads.\n \n For ten hours or more the droning hum of the relay sucked Terry's brain dry of knowledge. The shock upon the nervous system of the Earthman proved too violent and his heart faltered after a time and stopped completely. Twice, with subtle drugs they restored pseudo-life to his body and kept the electrical impulses throbbing from his tortured brain, but after the third suspension of life Thig removed his helmet.\n \n \"There is nothing more to learn,\" he informed his impassive comrades.\n\"Now, let us get on with the plastic surgery that is required. My new body must return to its barbaric household before undue attention is aroused. And when I return I will take along some of the gleaming baubles we found on the red planet—these people value them highly.\"\n \n An hour later, his scars and altered cartilage already healed and painless, Thig again scraped sand over the entrance to the space ship and set out along the moonlit beach toward the nearest path running inland to his home.\n \n Memory was laying the country bare about him, Terry's own childhood memories of this particular section of Long Island. Here was the place where Jake and Ted had helped him dig for the buried treasure that old 'Notch-ear' Beggs had told them so exactly about. Remembrance of that episode gave Thig an idea about the little lump of jewels in his pocket. He had found them in a chest along the beach!\n \n He was coming up on the porch now and at the sound of his foot on the sagging boards the screen door burst open and three little Earth-creatures were hugging at his legs. An odd sensation, that his acquired memories labeled as pleasure, sent a warm glow upward from around his heart.\n \n Then he saw the slender red-haired shape of a woman, the mate of the dead man he knew, and confusion struck his well-trained brain. Men had no mates on Ortha, sex had been overthrown with all the other primitive impulses of barbarism; so he was incapable of understanding the emotions that swept through his acquired memory.\n \n Unsteadily he took her in his arms and felt her warm lips pressed, trembling, against his own. That same hot wave of pulsing blood choked achingly up into his throat.\n \n \"Lew, dear,\" Ellen was asking, \"where have you been all day? I called up at the landing but you were not there. I wanted to let you know that Saddlebag Publications sent a check for $50 for \"Reversed Revolvers\" and three other editors asked for shorts soon.\"\n \n \n\n \n \"Shoulda got a hundred bucks for that yarn,\" grunted Thig, and gasped.\n \n For the moment he had been Lewis Terry and not Thig! So thoroughly had he acquired the knowledge of Terry that he found himself unconsciously adopting the thinking and mannerism of the other. All the better this way, he realized—more natural.\n \n \"Sorry I was late,\" he said, digging into his pocket for the glittering baubles, \"but I was poking around on the beach where we used to hunt treasure and I found an old chest. Inside it I found nothing but a handful of these.\"\n \n He flashed the jewels in front of Ellen's startled eyes and she clung, unbelieving, to his arm.\n \n \"Why, Lew,\" she gasped, \"they're worth a fortune! We can buy that new trailer now and have a rebuilt motor in the car. We can go west right away.... Hollywood, the Grand Canyon, cowboys!\"\n \n \"Uh huh,\" agreed the pseudo Lewis, memories of the ferocious savages and gunmen of his stories rendering him acutely unhappy. Sincerely he hoped that the west had reformed.\n \n \"I saved some kraut and weiners,\" Ellen said. \"Get washed up while I'm warming them up. Kids ate all the bread so I had to borrow some from the Eskoes. Want coffee, too?\"\n \n \"Mmmmmm,\" came from the depths of the chipped white wash-basin.\n \n \n\n \n \"Home again,\" whispered Ellen as she stood beside Thig twelve weeks later and gazed tearfully at the weathered little gray house. She knelt beside the front stoop and reached for the key hidden beneath it.\n \n \"The west was wonderful; tremendous, vast and beautiful,\" she went on as they climbed the steps, \"but nowhere was there any place as beautiful as our own little strip of sky and water.\"\n \n Thig sank into a dusty old swing that hung on creaking chains from the exposed rafters of the porch roof. He looked down at the dusty gray car and the bulbous silvery bulk of the trailer that had been their living quarters for almost three months. Strange thoughts were afloat in the chaos of his cool Orthan brain.\n \n Tonight or tomorrow night at the latest he must contact his two fellows and report that Earth was a planetary paradise. No other world, including Ortha, was so well-favored and rich. An expeditionary force to wipe the grotesque civilizations of Earth out of existence would, of course, be necessary before the first units of new Hordes could be landed. And there Thig balked. Why must they destroy these people, imperfect though their civilization might be, to make room for the Hordes?\n \n Thig tried to tell himself that it was the transmitted thoughts of the dead Earthman that made him feel so, but he was not too sure. For three months he had lived with people who loved, hated, wept and sacrificed for reasons that he had never known existed. He had learned the heady glory of thinking for himself and making his own decisions. He had experienced the primitive joy of matching his wits and tongue against the wits of other unpredictable human beings. There was no abrupt division of men and women into definite classes of endeavor. A laborer thought the same thoughts that a governor might think. Uncertainty added zest to every day's life.\n \n The Orthan had come to question the sole devotion of the individual to the Horde to the exclusion of all other interests. What, he wondered, would one new world—or a hundred—populated by the Hordes add to the progress of humanity? For a hundred thousand years the Orthan civilization had remained static, its energies directed into certain well-defined channels. They were mindless bees maintaining their vast mechanical hives.\n \n There was that moment on the brink of the Grand Canyon when Ellen had caught his arm breathlessly at all the beauty spread away there beneath them. There were mornings in the desert when the sun painted in lurid red the peaks above the harsh black-and-whites of the sagebrush and cactus slopes. There was the little boy, his body burning with fever, who nestled trustingly against his tense man's body and slept—the son of Ellen and the man he had destroyed.\n \n Thig groaned. He was a weakling to let sentimentality so get the better of his judgment. He would go now to the space ship and urge them to blast off for Ortha. He sprang off the porch and strode away down the road toward the beach.\n \n The children ran to him; wanted to go along. He sent them away harshly but they smiled and waved their brown little hands. Ellen came to the door and called after him.\n \n \"Hurry home, dear,\" she said. \"I'll have a bite ready in about an hour.\"\n \n He dared not say anything, for his voice would have broken and she would have known something was wrong. She was a very wise sort of person when something was troubling him. He waved his stubby paw of a hand to show that he had heard, and blindly hurried toward the Sound.\n \n Oddly enough, as he hurried away along the narrow path through the autumn woods, his mind busied itself with a new epic of the west that lived no longer. He mentally titled it: \"Rustlers' Riot\" and blocked in the outlines of his plot. One section of his brain was that of the careless author of gunslinging yarns, a section that seemed to be sapping the life from his own brain. He knew that the story would never be written, but he toyed with the idea.\n \n So far had Thig the emotionless, robot-being from Ortha drifted from the unquestioning worship of the Horde!\n \n \n\n \n \"You have done well,\" announced Torp when Thig had completed his report on the resources and temperatures of various sections of Terra. \"We now have located three worlds fit for colonization and so we will return to Ortha at once.\n \n \"I will recommend the conquest of this planet, 72-P-3 at once and the complete destruction of all biped life upon it. The mental aberrations of the barbaric natives might lead to endless complications if they were permitted to exist outside our ordered way of life. I imagine that three circuits of the planet about its primary should prove sufficient for the purposes of complete liquidation.\"\n \n \"But why,\" asked Thig slowly, \"could we not disarm all the natives and exile them on one of the less desirable continents, Antarctica for example or Siberia? They are primitive humans even as our race was once a race of primitives. It is not our duty to help to attain our own degree of knowledge and comfort?\"\n \n \"Only the good of the Horde matters!\" shouted Torp angrily. \"Shall a race of feeble-witted beasts, such as these Earthmen, stand in the way of a superior race? We want their world, and so we will take it. The Law of the Horde states that all the universe is ours for the taking.\"\n \n \"Let us get back to Ortha at once, then,\" gritted out Thig savagely.\n\"Never again do I wish to set foot upon the soil of this mad planet. There are forces at work upon Earth that we of Ortha have long forgotten.\"\n \n \"Check the blood of Thig for disease, Kam,\" ordered Torp shortly. \"His words are highly irrational. Some form of fever perhaps native to this world. While you examine him I will blast off for Ortha.\"\n \n Thig followed Kam into the tiny laboratory and found a seat beside the squat scientist's desk. His eyes roamed over the familiar instruments and gauges, each in its own precise position in the cases along the walls. His gaze lingered longest on the stubby black ugliness of a decomposition blaster in its rack close to the deck. A blast of the invisible radiations from that weapon's hot throat and flesh or vegetable fiber rotted into flaky ashes.\n \n The ship trembled beneath their feet; it tore free from the feeble clutch of the sand about it, and they were rocketing skyward. Thig's broad fingers bit deep into the unyielding metal of his chair. Suddenly he knew that he must go back to Earth, back to Ellen and the children of the man he had helped destroy. He loved Ellen, and nothing must stand between them! The Hordes of Ortha must find some other world, an empty world—this planet was not for them.\n \n \"Turn back!\" he cried wildly. \"I must go back to Earth. There is a woman there, helpless and alone, who needs me! The Horde does not need this planet.\"\n \n Kam eyed him coldly and lifted a shining hypodermic syringe from its case. He approached Thig warily, aware that disease often made a maniac of the finest members of the Horde.\n \n \"No human being is more important than the Horde,\" he stated baldly.\n\"This woman of whom you speak is merely one unit of the millions we must eliminate for the good of the Horde.\"\n \n Then it was that Thig went berserk. His fists slashed into the thick jaw of the scientist and his fingers ripped at the hard cords overlying the Orthan's vital throat tubes. His fingers and thumb gouged deep into Kam's startled throat and choked off any cry for assistance before it could be uttered.\n \n Kam's hand swept down to the holster swung from his intricate harness and dragged his blaster from it. Thig's other hand clamped over his and for long moments they swayed there, locked together in silent deadly struggle. The fate of a world hung in the balance as Kam's other hand fought against that lone arm of Thig.\n \n \n\n \n The scales swung in favor of Kam. Slowly the flaring snout of his weapon tilted upward until it reached the level of Thig's waist. Thig suddenly released his grip and dragged his enemy toward him. A sudden reversal of pressure on Kam's gun hand sent the weapon swivelling about full upon its owner's thick torso. Thig's fingers pressed down upon Kam's button finger, down upon the stud set into the grip of the decomposition blaster, and Kam's muscles turned to water. He shrieked.\n \n Before Thig's eyes half of his comrade's body sloughed away into foul corruption that swiftly gave way to hardened blobs of dessicated matter. Horror for what he had done—that he had slain one of his own Horde—made his limbs move woodenly. All of his thoughts were dulled for the moment. Painfully slow, he turned his body around toward the control blister, turned around on leaden feet, to look full into the narrowed icy eyes of his commander.\n \n He saw the heavy barrel of the blaster slashing down against his skull but he could not swing a fraction of an inch out of the way. His body seemed paralyzed. This was the end, he thought as he waited stupidly for the blow to fall, the end for Ellen and the kids and all the struggling races of Earth. He would never write another cowboy yarn—they would all be dead anyhow soon.\n \n Then a thunderclap exploded against his head and he dropped endlessly toward the deck. Blows rained against his skull. He wondered if Torp would ever cease to hammer at him and turn the deadly ray of the weapon upon him. Blood throbbed and pounded with every blow....\n \n \n\n \n Bam, Bam, Bam, the blood pounded in his ears. Like repeated blows of a hammer they shook his booming head. No longer was Torp above him. He was in the corner of the laboratory, a crumpled blood-smeared heap of bruised flesh and bone. He was unfettered and the blood was caked upon his skull and in his matted hair. Torp must have thought he had killed him with those savage blows upon the head.\n \n Even Torp, thought Thig ruefully, gave way to the primitive rage of his ancestors at times; but to that very bit of unconscious atavism he now owed his life. A cool-headed robot of an Orthan would have efficiently used the blaster to destroy any possibility of remaining life in his unconscious body.\n \n Thig rolled slowly over so that his eye found the door into the control room. Torp would be coming back again to dispose of their bodies through the refuse lock. Already the body of Kam was gone. He wondered why he had been left until last. Perhaps Torp wished to take cultures of his blood and tissues to determine whether a disease was responsible for his sudden madness.\n \n The cases of fragile instruments were just above his head. Association of memories brought him the flash of the heavy blaster in its rack beneath them. His hand went up and felt the welcome hardness of the weapon. He tugged it free.\n \n In a moment he was on his knees crawling across the plates of the deck toward the door. Halfway across the floor he collapsed on his face, the metal of the gun making a harsh clang. He heard the feet of Torp scuffle out of silence and a choked cry in the man's throat squalled out into a senseless whinny.\n \n Thig raised himself up on a quivering elbow and slid the black length of the blaster in front of him. His eyes sought the doorway and stared full into the glaring vacant orbs of his commander. Torp leaned there watching him, his breath gurgling brokenly through his deep-bitten lips. The clawing marks of nails, fingernails, furrowed his face and chest. He was a madman!\n \n The deadly attack of Thig; his own violent avenging of Kam's death, and now the apparent return of the man he had killed come to life had all served to jolt his rigidly trained brain from its accustomed groove. The shock had been too much for the established thought-processes of the Orthan.\n \n So Thig shot him where he stood, mercifully, before that vacant mad stare set him, too, to gibbering and shrieking. Then he stepped over the skeleton-thing that had been Torp, using the new strength that victory had given him to drive him along.\n \n He had saved a world's civilization from extinction! The thought sobered him; yet, somehow, he was pleased that he had done so. After all, it had been the Earthwoman and the children he had been thinking of while he battled Kam, a selfish desire to protect them all.\n \n He went to the desk where Torp had been writing in the ship's log and read the last few nervously scrawled lines:\n  Planet 72-P-3 unfit for colonization. Some pernicious disease that strikes at the brain centers and causes violent insanity is existent there. Thig, just returned from a survey of the planet, went mad and destroyed Kam. In turn I was forced to slay him. But it is not ended. Already I feel the insidious virus of....\n \n \n And there his writing ended abruptly.\n \n Thig nodded. That would do it. He set the automatic pilot for the planet Ortha. Unless a rogue asteroid or a comet crossed the ship's path she would return safely to Ortha with that mute warning of danger on 72-P-3. The body of Torp would help to confirm his final message.\n \n Then Thig crossed the cabin to the auxiliary life boat there, one of a half-dozen space ships in miniature nested within the great ship's hull, and cut free from the mother vessel.\n \n He flipped the drive lever, felt the thrumming of the rockets driving him from the parent ship. The sensation of free flight against his new body was strangely exhilerating and heady. It was the newest of the emotions he had experienced on Earth since that day, so many months before, when he had felt the warmness of Ellen's lips tight against his.\n \n \n Thig flipped the drive lever, felt the thrumming of the rockets driving him from the parent ship.\n \n\n \n He swung about to the port, watched the flaming drive-rockets of the great exploratory ship hurl it toward far-away Ortha, and there was no regret in his mind that he was not returning to the planet of his first existence.\n \n He thought of the dull greys and blacks of his planet, of the monotonous routine of existence that had once been his—and his heart thrilled to the memories of the starry nights and perfect exciting days he had spent on his three month trip over Earth.\n \n He made a brief salute to the existence he had known, turned with a tiny sigh, and his fingers made brief adjustments in the controls. The rocket-thrum deepened, and the thin whistle of tenuous air clutching the ship echoed through the hull-plates.\n \n He thought of many things in those few moments. He watched the roundness of Earth flatten out, then take on the cup-like illusion that all planets had for an incoming ship. He reduced the drive of his rockets to a mere whisper, striving to control the impatience that crowded his mind.\n \n He shivered suddenly, remembering his utter callousness the first time he had sent a space ship whipping down toward the hills and valleys below. And there was a sickness within him when he fully realized that, despite his acquired memory and traits, he was an alien from outer space.\n \n He fingered the tiny scars that had completely obliterated the slight differences in his appearance from an Earthman's, and his fingers trembled a bit, as he bent and stared through the vision port. He said a brief prayer in his heart to a God whose presence he now felt very deeply. There were tears in the depths of his eyes, then, and memories were hot, bitter pains.\n \n \n\n \n Earth was not far below him. As he let gravity suck him earthward, he heaved a gasp of relief. He was no longer Thig, a creature of a Horde's creation, but Lewis Terry, writer of lurid gun-smoking tales of the West. He must remember that always. He had destroyed the real Terry and now, for the rest of his life, he must make up to the dead man's family.\n \n The knowledge that Ellen's love was not really meant for him would be a knife twisting in his heart but for her sake he must endure it. Her dreams and happiness must never be shattered.\n \n The bulge of Earth was flattening out now and he could see the outlines of Long Island in the growing twilight.\n \n A new plot was growing in the brain of Lewis Terry, a yarn about a cowboy suddenly transported to another world. He smiled ironically. He had seen those other worlds. Perhaps some day he would write about them....\n \n He was Lewis Terry! He must remember that!",
      "metadata": {
        "title": "Quest of Thig",
        "author": "Basil Wells",
        "passage_id": "62198",
        "uid": "c9a0ca8952b64bd6a83f7e4ccf8673b9",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "9",
                "uid": "6c42c4ec7ed94153a7a021f9253d2bd0",
                "response_text": "Three aliens from the planet Ortha, Thig, Kam and their Commander, Torp, have landed on Long Island to see if Earth is viable for the Orthans to take over. Thig captures a passing man, an author named Lewis Terry, and brings him back to the spaceship, where Torp decides that Thig should impersonate Terry to learn more about Earth. Terry’s knowledge is transferred to Thig, a process that kills Terry and arms Thig with with all of his memories. He is given plastic surgery to look like Terry, and he goes to live with Terry’s family. \n\nHe is greeted by Terry’s three young children and his wife, Ellen; the children’s affection and Ellen’s kiss lead to sensations that confuse but excite Thig. The story then jumps ahead 12 weeks to when they return from their vacation, Thig having experienced many new emotions and sensations and having become very attached to Terry’s family. He knows that he must report to his Orthan colleagues, but has misgivings about doing so. Upon his arrival back to the ship, he tells Torp that Earth is ideal for their purposes, and Torp commends him and says he’ll recommend that Ortha take it over and eradicate the humans. Thig suggests that they instead disarm and exile the humans, and train them in the ways of Ortha. Torp responds angrily that they don’t need to waste their time with anyone outside the Orthan “Horde”. He asks Kam to check his blood for disease. \n\nThig realizes that he loves Ellen and wants to protect her and the earthlings and says as much to Kam, who attempts to subdue him. After a struggle over Kam’s blaster, Thig kills him. Torp sees what he has done and flies into the type of rage Orthans don’t ascribe to, bludgeoning Thig until he thinks he is dead. Thig takes a blaster from a case above him and kills Torp. He reads in the ship log that Torp has written that Earth is not viable, because it infected Thig with a disease that led to him killing Kam and made it necessary for Torp to kill him. Thig puts the ship on autopilot toward Ortha, takes one of the small auxiliary ships, and heads back to Earth. \n\nHe experiences many emotions, and regrets how callous he was when he first arrived on Earth and captured Lewis Terry. He vows to live as Terry in repayment to his family, and thinks knowing that Ellen doesn’t really love him, Thig, will be his punishment while he strives to make her happy. As he heads toward Long Island, the idea for a story develops in his mind. This one is about a cowboy that visits other worlds, worlds like the ones Thig has seen. He thinks maybe he could write this, and then reminds himself to remember that he is Lewis Terry now. "
              },
              {
                "worker_id": "8",
                "uid": "bd30ab4f5afe47f3ac3eadeeb32329fc",
                "response_text": "The story begins with the protagonist Thig, who is an alien from the planet Ortha, on a mission to investigate Earth’s suitability to be colonized by the conquering Horde he represents. Thig is a bit shorter than the average human with a thick, muscular body and reddish hair. His spaceship is hidden below the sand at a Long Island beach, and after he emerges, he hides behind the brush along a nearby road. He sees a human that looks remarkably like himself. This human turns out to be a Western writer named Lewis Terry, who lives nearby with his wife and children. Lew, as his wife calls him, had been out fishing as he tried to plot out new stories to fund his proposed trip out West, where he could gather research to make his writing more believable. Thig knocks him out and takes him back to his ship, where he and his fellow Orthans Kam and Torp begin the process of transferring Lew’s memories, thoughts, and emotions into Thig’s mind. This allows him to disguise himself as he researches Earth’s environment and the humans that populate it. After undergoing plastic surgery to better mimic Lew’s appearance, Thig returns to Lew’s home, guided by his memories of the past and human emotions. Thig meets Lew’s children and experiences emotions of love for the first time. These feelings are further complicated when he meets Ellen, Lew’s wife, who kisses him and floods Thig’s new Lew-mind with romantic emotions. Thig shows Ellen the treasures he has brought with him from Mars, and Ellen says they can now afford to pay for their trip out West. They spend the next three months exploring the West, during which time Thig plunges deeper into human emotion and is overwhelmed by the beauty of Earth. Upon his return to the ship, Thig attempts to convince Kam and Torp to change their plans about destroying humankind, and they think Thig has contracted some kind of disease. When Kam goes to test Thig, Thig kills him with a decomposition blaster; in turn, Torp beats Thig until he thinks he has killed him. Torp then returns to his desk and makes a note that Earth is probably not suitable for the Horde due to a mysterious disease that had overtaken Thig. Thig kills Torp and returns to Earth in an escape vessel, sending the ship back to Ortha with Torp’s message. Torp goes back to Ellen and the children, intending to spend the rest of his life living as Lewis Terry.\n"
              },
              {
                "worker_id": "1",
                "uid": "d7342d28b97f4f29a4be52847bb124da",
                "response_text": "Thig appears naked on Long Island and waits for an Earthman to come near. Lewis Terry, a writer of Westerns, walks by Thig. He went out on his boat to fish, and Thig jumps out at Terry and kills him.\nThig is excited to help his people, the Orthans, discover a new place to inhabit. On planet Ortha, everything is done to serve the Horde. The creatures have no families. They instead devote their lives to society. \nOn the spaceship, Thig takes over Terry’s body and gains all of his knowledge. He then undergoes surgery to correct the scars that Terry sustained during the attack. When he exits the spaceship, Thig is surprised to learn that he now holds all of Terry’s childhood memories and understandings about the world around him. \n\nHe approaches Terry’s home and is greeted by his children and his wife. Thig feels pleasure from this interaction, something he has never experienced before. When Ellen talks to Thig, he naturally responds like Terry would without even thinking about it. The family heads out on a vacation in the West.\n\nAfter several weeks, Thig’s family arrives back at home. He loved building relationships with his wife and children, and soon he will need to talk to his fellow Orthans and let them know that Earth is a perfect place for them to take over. He worries about what will become of Terry’s family. Thig enjoys being an Earthman because he is allowed to feel and express emotions and experience the uncertainty of life that does not exist on Ortha. \n\nWhen Thig leaves the house to go to the spaceship, his mind keeps coming up with ideas for new Western novels. He can’t help it since he still has many of Terry’s old thoughts. Torp decides it’s time to head back to Ortha. He will recommend killing all humans. Thig disagrees, and Torp becomes angry. He assumes that Thig has contracted a disease, and he tells Kam to test him. The ship blasts off, and in a fit of rage, Thig chokes Kam. They wrestle over Kam’s weapon, and Thig makes Kam shoot himself in the torso. Torp comes into the room and hits Thig over the head with a gun. \n\nTorp leaves Thig bleeding and alone in the laboratory. When he wakes up, he is injured, but he manages to grab a weapon. When Torp comes back in the room, he begins shrieking. Thig shoots the commander. \n\nThig finds Torp’s note that says that Earth holds some disease that causes insanity, and therefore it is not appropriate for colonization. He sets the spaceship for Ortha and takes an auxiliary ship back to Earth. Happiness overtakes him as he heads back to his new home. He has zero regrets about leaving Ortha forever. Thig now believes in God, and realizes that his duty is to take care of Terry’s family for the rest of his life. He thinks up a Western plot about a cowboy who visits another planet.\n"
              },
              {
                "worker_id": "2",
                "uid": "d78fc65b687e4755b39ca056bb20445e",
                "response_text": "\nThig and two other Orthans, Torp and Kam, are traveling the galaxy looking for another planet that the Orthans can populate. When they reach Earth, Thig goes out to look for a human specimen that he can capture and take back to the space cruiser to drain the person’s memory and knowledge to help them determine whether Earth will be a suitable planet for Orthan colonization. Thig captures Lewis Terry, a fiction writer with writer’s block and taking the day off to go fishing. Terry bears an uncanny likeness to Thig, and Torp decides to transfer Terry’s knowledge to Thig and have Thig explore Earth to determine whether it will be appropriate for the Orthans. They make the transfer, but Terry dies. They perform plastic surgery to make Thig look even more like Terry; then Thig returns to Terry’s home.\n\nTerry’s children and wife greet him, and Thig realizes he has a warm response to them even though Orthans have no emotions or sentimentality. When Terry’s wife, Ellen, tells him he received a check for $50 for one of her stories, Thig immediately comments that the story was worth $100—and is stunned to realize he is thinking like Terry, not himself. He shows Ellen the stones he dug up from an old wooden box that he remembered learning about in Terry’s childhood, and she exclaims they are worth a fortune and will finance a travel trailer and their trip out West.\n\nAfter returning from their western trip, Thig realizes he needs to report back to Torp about whether Earth is an appropriate planet for the Orthans. He knows it is perfect and that the Orthans will destroy every Earth person, and he begins to wonder why they would have to destroy them. As he makes his way to the space cruiser, he comes up with a new Western story to write.\n\nWhen Thig makes his report to Torp, Torp agrees that Earth is perfect for the Orthans and grows angry when Thig asks if they couldn’t just disarm the Earth people rather than destroying all of them. Torp orders Kam to check Thig’s blood for disease. The space cruiser blasts off, and Thig thinks about Ellen and her children with Lewis Terry and realizes he loves them and must protect them. He tells Torp and Kam to turn back—that there is a woman who needs him and the Horde from Ortha doesn’t need Earth. Thig fights and kills Kam, but Torp realizes what is happening and catches Thig off-guard. Torp beats Thig almost to death, and when Thig regains consciousness, he kills Torp and returns to Earth via a lifeboat. Thig decides that he must be Lewis Terry, not Thig, from now on, and he begins to develop another story about the old West."
              }
            ]
          },
          {
            "question_text": "Who is Thig and what happens to him throughout the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "9",
                "uid": "6c42c4ec7ed94153a7a021f9253d2bd0",
                "response_text": "Thig is the protagonist of the story, a native of the planet Ortha. He is described as shorter than an average human man (though tall for an Orthan man), and thick-bodied with well-developed muscles, average-to-large facial features, and reddish brown eyes. At the beginning of the story, he and two other Orthans, Kam and Torp, are on a mission to find planets considered viable for the Orthans to take over. Thig kidnaps a human man, Lewis Terry, and the Orthans transfer his memories to Thig and surgically alter him to look like Terry. Thig assumes his identity and joins his family posing as Terry. He begins to feel new sensations and emotions around Terry’s wife, Ellen, and their kids, and travels with them on a three-month vacation during which he learns what it feels like to be human and to care for a family. When they return and he must make his report to the other Orthans, he truthfully reports that Earth would be ideal to take over but has second thoughts when Torp says he’ll recommend that they conquer Earth and decimate the population. When his pleas to consider just disarming and exiling the humans are met with scorn, Thig becomes angry and ultimately realizes that he loves Ellen and wants to go back to save Earth. He kills both of his Orthan colleagues and sends the ship back toward Ortha as he takes an auxiliary ship back to Long Island. Along the way, he experiences many emotions including regret for his former callousness and taking Lewis Terry away from his family. Instead of the robotic being who initially exhibited coldness and indifference at the beginning of the story, he now experiences remorse and selflessness as he decides to give Ellen and the kids the life they deserve even though he’ll always know who he is and what he has done. "
              },
              {
                "worker_id": "8",
                "uid": "bd30ab4f5afe47f3ac3eadeeb32329fc",
                "response_text": "Thig is an Orthan from the planet Ortha, who visits Earth on a research mission with fellow Horde members Kam and Torp. Thig looks very similar to his research victim, a Western fiction writer named Lewis Terry, except he is a bit shorter, has a thick, muscular body, and has unusual reddish-brown hair on his head that matches his eyebrow hair. He wears no clothes, except some straps and pockets used for carrying his weapons and food; he is disturbed by Lew’s human clothes, which he considers impractical. Thig captures Lew and Kam and Torp help him transfer his memories, thoughts, and human emotions to better disguise himself as he researches Earth’s suitability for Horde habitation. Throughout the story, Thig struggles with processing his newly-acquired human emotions as they conflict with the mind programming of the Horde, which tells him that all of life is to be lived exclusively for the benefit and maintenance of the Horde. Thig goes on a three-month excursion with Lew’s family, during which time he falls in love with Ellen and discovers the beauty of Earth. He tries to convince Kam and Torp to abandon their mission, and when they try to test Thig for disease, he kills them both and returns to Earth to spend his existence as Lewis Terry."
              },
              {
                "worker_id": "1",
                "uid": "d7342d28b97f4f29a4be52847bb124da",
                "response_text": "Thig is an Orthan who has spent his entire life devoted to the Horde. He has no family or friends, and he has never experienced love or real emotions. He is essentially part of an ant colony, and he spends every day working for the good of society and neglecting his own individuality. \n\nThig is sent to Earth to investigate whether the planet will be a good place to relocate the Orthans. He must find a human and kill him in order to take over his mind and body . Thig quickly finds his victim in Lewis Terry, chokes him, takes him back to the ship, and gains all of his knowledge and his appearance.\nThig is originally on Earth strictly for the mission, but once he joins Terry’s family, he immediately begins to have feelings for Terry’s wife, Ellen, and his three children. As Terry, Thig is affectionate, he takes part in real conversations, and he thinks about plots for Western novels. \n\nHe truly discovers the joy of living on Earth on his three month vacation with Terry’s family. They take in the landscape and enjoy their time together. \n\nWhen he returns, he knows he has to tell Torp and Kam, two other Orthans on the mission, that Earth is a paradise and the other Orthans would love it. However, he wants nothing to do with the mass killing of humans. Although he originally follows through with his plan and returns to the spaceship, he almost immediately regrets his decision. He does not want to see Earth taken over by the Orthans. He finds the strength to fight off Kam and Torp and heads back to Earth, his new home. \nThig realizes that his entire outlook on life has changed, and he can’t go back to being a cog in a machine. He feels real guilt for killing Terry, and he knows the only way to make it up to him is to take care of Ellen and the children for the rest of his life. He will leave the Orthans to colonize another planet, but he feels positive that they will stay away from Earth when the spaceship with two dead bodies returns to his home planet with a note that says that Earth carries a deadly disease. \n"
              },
              {
                "worker_id": "2",
                "uid": "d78fc65b687e4755b39ca056bb20445e",
                "response_text": "Thig is a man from Ortha who travels around the galaxy with two other men, looking for another planet that the Orthans can occupy. He lands on Earth and captures a human, Lewis Terry, to take to the space cruiser. Thig looks so much like the human that the Orthans decide to transfer the human’s knowledge and memories to Thig and let him explore the planet in the guise of the man. When Thig encounters the human’s family, he begins to have warm feelings for them, although all feelings and emotions have been removed from the Orthans for hundreds of thousands of years. After the family spends three months on a trip out West, Thig has changed. Instead of thinking only of the good of the Horde of Orthans, he now questions that single-minded devotion and considers the Orthans mindless bees who don’t know the pleasure of thinking for themselves and making their own decisions as the Earthmen do. When the family returns home from the trip out West, he reports what he has learned to Torp, who declares that the planet is suitable and the humans must be destroyed. Thig asks if the Orthans couldn’t just disarm the humans and exile them to a less desirable continent, and Torp thinks he must be sick and orders Kam to check Thig’s blood for disease. As they launch into space, Thig is overwhelmed with the desire to protect Ellen; he realizes he loves her. After defeating Kam and Torp and heading back to Earth, he realizes that he thinks like Lewis Terry and must BE Lewis Terry. His Orthan values and identity no longer matter."
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "9",
                "uid": "6c42c4ec7ed94153a7a021f9253d2bd0",
                "response_text": "The story is set in multiple locations, including Long Island, New York, an Orthan spaceship and smaller auxiliary ship, parts of the American West, and outer space. The ship from Ortha lands on Long Island in New York, and this is where Thig captures Lewis Terry and takes him to the Orthans’ spaceship, before settling in with his family, posing as Terry. This area of Long Island is near the beach and the sound, and is described as lush and green. The Terry family lives in a small grey house that is somewhat run down. While we don’t travel out west on the Terry family vacation, we do experience bits of it in Thig’s memory, including the Grand Canyon in Arizona and unspecified desert terrain. The story then takes us back to the ship, and a small laboratory aboard the ship, and then inside a smaller ship as it heads back to Long Island. \n"
              },
              {
                "worker_id": "8",
                "uid": "bd30ab4f5afe47f3ac3eadeeb32329fc",
                "response_text": "Lew’s family lives near a beach on Long Island. When the story begins, Thig emerges from his spaceship, which is buried below this beach. He sees dense, green brush beyond the beach running along a highway with little traffic. This is where he chooses to hide and waits to overtake Lew. Thig’s interactions with Kam and Torp take place on the spaceship below the beach surface; this is also where they kill Lew during the brain transfer with Thig. Thig reunites as Lew with Ellen and their children at their beach home and joins them on an epic, three-month journey out West where he sees the Grand Canyon and is overwhelmed by the beauty of the desert with its sagebrush and cacti and variety of colors. Later, Torp charts a path back to Ortha, where they will report their findings. Thig kills Torp and Kam aboard the spaceship, and then he commandeers an escape vessel to make his way back to Earth and back to Ellen and the children."
              },
              {
                "worker_id": "1",
                "uid": "d7342d28b97f4f29a4be52847bb124da",
                "response_text": "Most of the story, The Quest of Thig, takes place on Long Island. When Thig first appears on Earth, he is standing in the seaweed and sand, looking out at the Long Island Sound. There are trees and lots of greenery along the shoreline. He notes that this planet appears to be perfect for the Orthans because it has sunlight, lots of water, and a dense atmosphere. \n\nTerry’s little gray house has a dilapidated front porch and a screen door. There is an old swing that creaks when it’s used. The family owns a gray car and a trailer.  Ellen makes simple meals for her family in their kitchen. \nDuring the family’s trip out West, they visit the Grand Canyon where they see red dunes in the desert and sagebrush and cacti. \n\nThe other setting in the story is the Orthans’ spaceship. When Thig takes Terry’s body back to his spaceship to take over his body and mind, there are two parallel metal tables in the operation room. Both Thig and Terry’s body wear helmets to transfer the information from one to the other. Later in the story, Thig is taken to the laboratory on the ship to get his blood checked for a disease. The lab is neatly set up with instruments hanging from the wall and weapons hanging from the ceiling. There is also a control room on board. The space ship also has six auxiliary miniature spaceships nested inside the larger vessel. \n"
              },
              {
                "worker_id": "2",
                "uid": "d78fc65b687e4755b39ca056bb20445e",
                "response_text": "There are three settings in the story, two of which are present in the story and the third is remembered. The first setting is the space cruiser that brings the Orthans to Earth. The space cruiser lands on a beach across the Sound from Connecticut. It is buried in the sand to prevent it from being seen by the Earthmen. It contains a laboratory with instruments and gauges that enable the Orthans to capture the memories and knowledge of another species. It is also outfitted with their decomposition blasters that reduce living organisms to flaky ashes. There is also a control room where Torp guides the space cruiser on its travels through the galaxy and keeps the ship’s log detailing its journeys and findings. Wastes are disposed of with a refuse lock. The ship carries auxiliary lifeboats, which are basically miniatures of the larger ship, for emergencies.\n\nThe setting on Earth is based in Connecticut where the space cruiser lands on a beach. There is sand at the beach, trees and shrubs, highways, and other manmade features. It also features Lewis Terry’s cottage where he lives with his family. It is a weathered small gray house with sagging boards, a front porch, and a porch swing. When the family visits the West, they stop at the Grand Canyon, and Thig is breathless when he sees its beauty. He also notes the sun-painted red peaks in the desert and beautiful starry nights.\n\nThig remembers Ortha as dull, gray, and black and associates it with a monotonous routine.\n"
              }
            ]
          },
          {
            "question_text": "How do the ways of Ortha differ from those Thig discovers on Earth?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "9",
                "uid": "6c42c4ec7ed94153a7a021f9253d2bd0",
                "response_text": "The society on Ortha has discarded what they consider to be primal or barbaric tendencies and customs. Their children are raised in laboratories never knowing their parents and are not shown love or affection. They are taught to value loyalty to the Orthan “Hordes” over everything, and to believe that they are entitled to anything in the universe that they desire, with no regard to those outside the Hordes. They don’t have mates or have sex, though they do walk around naked. Free thought and primal urges are discouraged, and Orthan society has attempted to filter out any behavior they consider to be barbaric in favor of a robotic, obedient populace. By contrast, Thig discovers that humans feel the full gamut of emotions, think for themselves, and feel empathy rather than the dispassionate callousness Ortha demands. \n"
              },
              {
                "worker_id": "8",
                "uid": "bd30ab4f5afe47f3ac3eadeeb32329fc",
                "response_text": "The Orthans are a race totally committed to the advancement of the Horde, which travels around the universe seeking to find new planets to overthrow and inhabit. Over the years, their minds have been programmed to think only of the good of the Horde, with no thought to sentimental emotions or feelings. When Thig receives Lewis Terry’s mind, he also receives his mentality, his thoughts, his memories, and his emotions. He experiences for the first time how humans feel. He describes the warmth of hugging Lew’s children, and the choking-warm sensation of kissing his wife, Ellen. He feels awe when standing before the Grand Canyon and learns to feel excitement about the unpredictability of human behavior and emotion. He feels love, hate, and sadness. All of these emotions stand in stark contrast to the Orthan way of life, which is carefully regimented and devoid of any of these kinds of feelings."
              },
              {
                "worker_id": "1",
                "uid": "d7342d28b97f4f29a4be52847bb124da",
                "response_text": "On Ortha, the aliens are raised in the laboratories of their Horde. The Orthans function in a collective society. They do not believe in the individual. There are no families, no romantic relationships or sex, and no friends. Everything that is done must be done for the greater society, much like an ant farm. The Orthans are looking for a new planet to colonize, and they send out Torp, Kam, and Thig on the mission.\n\nOrthans are incapable of feeling emotions and all of their primitive impulses have been done away with. The aliens are part of a strict caste system where they are only allowed to have certain thoughts according to their position in the Horde. They have acted this way for over one hundred thousand years. \n\nOrthans believe they are superior to Earthmen, whom they see as feeble and weak. They believe they have the right to take whatever planet is best for them, and killing billions of Earthmen means nothing to them. \n"
              },
              {
                "worker_id": "2",
                "uid": "d78fc65b687e4755b39ca056bb20445e",
                "response_text": "On Ortha, men are loyal to the Horde, and that is all they care about. They are cultured and brought to life in laboratories, so there are no fathers or mothers and no affection and love. From childhood on, males and females in Ortha are taught that the only important thing is the growth and power of the Horde. Men and women have no feelings outside of their devotion to the Horde. Men have no mates and children, which prevents Thig from first understanding the warm feeling that sweeps over him when Lewis Terry’s children greet him and Ellen kisses him on the first night he goes to their home. On Ortha, men have no independent ideas or interests; everything they think and do is to maintain the Horde. For this reason, their civilization has remained static for a hundred thousand years.\n\nOn Earth, men and women love each other and marry and have children. Men are focused on the well-being of their families and their own lives rather than on the well-being of their population as a whole. Earthmen have independent thoughts and make their own decisions. People are unpredictable, and uncertainty adds interest to everyday life.\n"
              }
            ]
          },
          {
            "question_text": "Who is Ellen and how does she affect Thig and his choices?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "9",
                "uid": "6c42c4ec7ed94153a7a021f9253d2bd0",
                "response_text": "Ellen is the wife of Lewis Terry, and she is described as slender with red hair. When Thig assumes Terry’s identity, some of the first sensations he experiences result from Ellen kissing him. On their travels throughout the American West, Thig bonds with her and with her children. He learns to understand new experiences and emotions throughout his time with Ellen, and he observes that she seems to know how he’s feeling without him telling her. When Thig ultimately realizes that he wants to go back to Earth, it is because he loves Ellen and wants to save her and humanity. It is Ellen he thinks about as he returns to Earth and feels the sting of regret that he killed her husband, and decides to spend the rest of her life making it up to her. "
              },
              {
                "worker_id": "8",
                "uid": "bd30ab4f5afe47f3ac3eadeeb32329fc",
                "response_text": "Ellen is Lewis Terry’s wife, whom Thig meets after receiving Lew’s memories, thoughts, and emotions. From the moment he feels Ellen’s embrace and her kiss, he experiences emotions he has never felt before. He travels with her and the children out West, where she demonstrates the feeling of breathless wonder at the beauty of nature when they visit the Grand Canyon. He feels love for Ellen, and that feeling changes everything Thig thought he knew. When he returns to the ship after spending three months with Ellen, he feels the strong urge to return to her and spend the rest of his life with her. He abandons the call of the Horde and completely rejects his old way of living. He would rather spend his life feeling things that are new and with purpose as opposed to the pointless conquering of his old life."
              },
              {
                "worker_id": "1",
                "uid": "d7342d28b97f4f29a4be52847bb124da",
                "response_text": "Ellen is Lewis Terry’s red-headed wife, and she has a major impact on Thig and his way of thinking. In the beginning, Thig is only interested in finding a new home for his people, the Orthans. However, from their first hug alone, Thig begins to have feelings for Ellen. He likes the way that she offers him food and coffee and knows when something is bothering him. He is pleased with her excitement when he shows her the treasure he found at the beach. Thig loves spending the three months with Ellen and her children in their trailer exploring the West. She appreciates the beautiful landscape of the Grand Canyon, but she also acknowledges that there isn’t anything more beautiful in the world than their little piece of land and sky at home. \n\nThig realizes he has to kill Kam and Torp, his fellow Orthans, when he can’t stand the thought of leaving Ellen behind for good. He has experienced love and fun and curiosity with her, and he can’t go back to his old life as a member of the Horde. He loves Ellen, and he is willing to risk it all to be with her and take care of her, especially because he is the reason she is alone without a partner to look out for her. \n"
              },
              {
                "worker_id": "2",
                "uid": "d78fc65b687e4755b39ca056bb20445e",
                "response_text": "Ellen is Lewis Terry’s wife who unknowingly makes Thig fall in love. Ellen is a supportive wife who celebrates her husband’s accomplishments when he sells a story. She is excited when Thig shows her the gems they can use to finance their trip out West. Ellen thinks of her husband’s needs, and rather than fussing at him when he comes home late, she asks where he has been but immediately shifts to caring for his needs. Thig enjoys sharing the beautiful views of the West with Ellen, and he likes matching wits with her. From her, he learns what he and other Orthans are missing by not having meaningful relationships with members of the opposite sex. Thig is touched by her sensitivity to his moods and her understanding when something is troubling him. When Torp announces that Earth is a perfect planet for the Orthans to take over, Thig knows this means they will kill all the humans. He thinks of Ellen as helpless and alone and cannot bear to be separated from her; he wants to return to her and protect her. He realizes he loves her and that he will sacrifice his Orthan identity to be with her and support her dreams and happiness."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4607,
        "document_length_chars": 26219
      }
    }
  ]
}