{
  "item_metadata": {
    "item_id": "62212",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "62212",
      "content": "PRISON PLANET\n \n\n By BOB TUCKER\n \n \n To remain on Mars meant death from agonizing space-sickness, but Earth-surgery lay days of flight away. And there was only a surface rocket in which to escape—with a traitorous Ganymedean for its pilot.\n \n [Transcriber's Note: This etext was produced from Planet Stories Fall 1942. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n \"Listen, Rat!\" Roberds said, \"what I say goes around here. It doesn't happen to be any of your business. I'm still in possession of my wits, and I know Peterson can't handle that ship. Furthermore Gladney will be in it too, right along side of that sick girl in there! And Rat, get this: I'm going to pilot that ship. Understand? Consulate or no Consulate, job or no job, I'm wheeling that crate to Earth because this is an emergency. And the emergency happens to be bigger than my position, to me at any rate.\" His tone dropped to a deadly softness.\n\"Now will you kindly remove your stinking carcass from this office?\"\n \n Unheeding, Rat swung his eyes around in the gloom and discovered the woman, a nurse in uniform. He blinked at her and she returned the look, wavering. She bit her lip and determination flowed back. She met the stare of his boring, off-colored eyes. Rat grinned suddenly. Nurse Gray almost smiled back, stopped before the others could see it.\n \n \"Won't go!\" The Centaurian resumed his fight. \"You not go, lose job, black-listed. Never get another. Look at me. I know.\" He retreated a precious step to escape a rolled up fist. \"Little ship carry four nice. Rip out lockers and bunks. Swing hammocks. Put fuel in water tanks. Live on concentrates. Earth hospital fix bellyache afterwards, allright. I pilot ship. Yes?\"\n \n \"No!\" Roberds screamed.\n \n Almost in answer, a moan issued from a small side room. The men in the office froze as Nurse Gray ran across the room. She disappeared through the narrow door.\n \n \"Peterson,\" the field manager ordered, \"come over here and help me throw this rat out....\" He went for Rat. Peterson swung up out of his chair with balled fist. The outlander backed rapidly.\n \n \"No need, no need, no need!\" he said quickly. \"I go.\" Still backing, he blindly kicked at the door and stepped into the night.\n \n \n\n \n When the door slammed shut Roberds locked it. Peterson slumped in the chair.\n \n \"Do you mean that, Chief? About taking the ship yourself?\"\n \n \"True enough.\" Roberds cast an anxious glance at the partly closed door, lowered his voice. \"It'll cost me my job, but that girl in there has to be taken to a hospital quickly! And it's her luck to be landed on a planet that doesn't boast even one! So it's Earth ... or she dies. I'd feel a lot better too if we could get Gladney to a hospital, I'm not too confident of that patching job.\" He pulled a pipe from a jacket pocket. \"So, might as well kill two birds with one stone ... and that wasn't meant to be funny!\"\n \n Peterson said nothing, sat watching the door.\n \n \"Rat has the right idea,\" Roberds continued, \"but I had already thought of it. About the bunks and lockers. Greaseball has been out there all night tearing them out. We just might be able to hop by dawn ... and hell of a long, grinding hop it will be!\"\n \n The nurse came out of the door.\n \n \"How is she?\" Roberds asked.\n \n \"Sleeping,\" Gray whispered. \"But sinking....\"\n \n \"We can take off at dawn, I think.\" He filled the pipe and didn't look at her. \"You'll have to spend most of the trip in a hammock.\"\n \n \"I can take it.\" Suddenly she smiled, wanly. \"I was with the Fleet. How long will it take?\"\n \n \"Eight days, in that ship.\"\n \n Roberds lit his pipe, and carefully hid his emotions. He knew Peterson was harboring the same thoughts. Eight days in space, in a small ship meant for two, and built for planetary surface flights. Eight days in that untrustworthy crate, hurtling to save the lives of that girl and Gladney.\n \n \"Who was that ... man? The one you put out?\" Gray asked.\n \n \"We call him Rat,\" Roberds said.\n \n She didn't ask why. She said: \"Why couldn't he pilot the ship, I mean? What is his record?\"\n \n Peterson opened his mouth.\n \n \"Shut up, Peterson!\" the Chief snapped. \"We don't talk about his record around here, Miss Gray. It's not a pretty thing to tell.\"\n \n \"Stow it, Chief,\" said Peterson. \"Miss Gray is no pantywaist.\" He turned to the nurse. \"Ever hear of the Sansan massacre?\"\n \n Patti Gray paled. \"Yes,\" she whispered. \"Was Rat in that?\"\n \n Roberds shook his head. \"He didn't take part in it. But Rat was attached to a very important office at the time, the outpost watch. And when Mad Barry Sansan and his gang of thugs swooped down on the Ganymedean colony, there was no warning. Our friend Rat was AWOL.\n \n \"As to who he is ... well, just one of those freaks from up around Centauria somewhere. He's been hanging around all the fields and dumps on Mars a long time, finally landed up here.\"\n \n \"But,\" protested Miss Gray, \"I don't understand? I always thought that leaving one's post under such circumstances meant execution.\"\n \n The Chief Consul nodded. \"It does, usually. But this was a freak case. It would take hours to explain. However, I'll just sum it up in one word: politics. Politics, with which Rat had no connection saved him.\"\n \n The girl shook her head, more in sympathy than condemnation.\n \n \"Are you expecting the others in soon?\" she asked. \"It wouldn't be right to leave Peterson.\"\n \n \"They will be in, in a day or two. Peterson will beat it over to Base station for repairs, and to notify Earth we're coming. He'll be all right.\"\n \n Abruptly she stood up. \"Goodnight gentlemen. Call me if I'm needed.\"\n \n Roberds nodded acknowledgement. The door to the side room closed behind her. Peterson hauled his chair over to the desk. He sniffed the air.\n \n \"Damned rat!\" he whispered harshly. \"They ought to make a law forcing him to wear dark glasses!\"\n \n Roberds smiled wearily. \"His eyes do get a man, don't they?\"\n \n \"I'd like to burn 'em out!\" Peterson snarled.\n \n \n\n \n Rat helped Greaseball fill the water tanks to capacity with fuel, checked the concentrated rations and grunted.\n \n Greaseball looked over the interior and chuckled. \"The boss said strip her, and strip her I did. All right, Rat, outside.\" He followed the Centaurian out, and pulled the ladder away from the lip of the lock. The two walked across the strip of sandy soil to the office building. On tiptoes, Greaseball poked his head through the door panel. \"All set.\"\n \n Roberds nodded at him. \"Stick with it!\" and jerked a thumb at Rat outside. Grease nodded understanding.\n \n \"Okay, Rat, you can go to bed now.\" He dropped the ladder against the wall and sat on it. \"Good night.\" He watched Rat walk slowly away.\n \n Swinging down the path towards his own rambling shack, Rat caught a sibilant whisper. Pausing, undecided, he heard it again.\n \n \"Here ... can you see me?\" A white clad arm waved in the gloom. Rat regarded the arm in the window. Another impatient gesture, and he stepped to the sill.\n \n \"Yes?\"—in the softest of whispers. The voices of the men in droning conversation drifted in. \"What you want?\"\n \n Nothing but silence for a few hanging seconds, and then: \"Can you pilot that ship?\" Her voice was shaky.\n \n He didn't answer, stared at her confused. He felt her fear as clearly as he detected it in her words.\n \n \"Well, can you?\" she demanded.\n \n \"Damn yes!\" he stated simply. \"It now necessary?\"\n \n \"Very! She is becoming worse. I'm afraid to wait until daylight. And ... well, we want you to pilot it! She refuses to risk Mr. Roberds' job. She favors you.\"\n \n Rat stepped back, astonished. \"She?\"\n \n Nurse Gray moved from the window and Rat saw the second form in the room, a slight, quiet figure on a small cot. \"My patient,\" Nurse Gray explained. \"She overheard our conversation awhile ago. Quick, please, can you?\"\n \n Rat looked at her and then at the girl on the cot. He vanished from the window. Almost immediately, he was back again.\n \n \"When?\" he whispered.\n \n \"As soon as possible. Yes. Do you know...?\" but he had gone again. Nurse Gray found herself addressing blackness. On the point of turning, she saw him back again.\n \n \"Blankets,\" he instructed. \"Wrap in blankets. Cold—hot too. Wrap good!\" And he was gone again. Gray blinked away the illusion he disappeared upwards.\n \n She ran over to the girl. \"Judith, if you want to back down, now is the time. He'll be back in a moment.\"\n \n \"No!\" Judith moaned. \"No!\" Gray smiled in the darkness and began wrapping the blankets around her. A light tapping at the window announced the return of Rat. The nurse pushed open the window wide, saw him out there with arms upstretched.\n \n \"Grit your teeth and hold on! Here we go.\" She picked up the blanketed girl in both arms and walked to the window. Rat took the girl easily as she was swung out, the blackness hid them both. But he appeared again instantly.\n \n \"Better lock window,\" he cautioned. \"Stall, if Boss call. Back soon....\" and he was gone.\n \n To Nurse Gray the fifteen minute wait seemed like hours, impatient agonizing hours of tight-lipped anxiety.\n \n \n\n \n Feet first, she swung through the window, clutching a small bag in her hands. She never touched ground. Rat whispered \"Hold tight!\" in her ear and the wind was abruptly yanked from her! The ground fell away in a dizzy rush, unseen but felt, in the night! Her feet scraped on some projection, and she felt herself being lifted still higher. Wind returned to her throat, and she breathed again.\n \n \"I'm sorry,\" she managed to get out, gaspingly. \"I wasn't expecting that. I had forgotten you—\"\n \n \"—had wings,\" he finished and chuckled. \"So likewise Greaseball.\" The pale office lights dropped away as they sped over the field. On the far horizon, a tinge of dawn crept along the uneven terrain.\n \n \"Oh, the bag!\" she gasped. \"I've dropped it.\"\n \n He chuckled again. \"Have got. You scare, I catch.\"\n \n She didn't see the ship because of the wind in her eyes, but without warning she plummeted down and her feet jarred on the lip of the lock.\n\"Inside. No noise, no light. Easy.\" But in spite of his warning she tripped in the darkness. He helped her from the floor and guided her to the hammocks.\n \n \"Judith?\" she asked.\n \n \"Here. Beside you, trussed up so tight I can hardly breathe.\"\n \n \"No talk!\" Rat insisted. \"Much hush-hush needed. Other girl shipshape. You make likewise.\" Forcibly he shoved her into a hammock. \"Wrap up tight. Straps tight. When we go, we go fast. Bang!\" And he left her.\n \n \"Hey! Where are you going now?\"\n \n \"To get Gladney. He sick too. Hush hush!\" His voice floated back.\n \n \"Where has he gone?\" Judith called.\n \n \"Back for another man. Remember the two miners who found us when we crashed? The burly one fell off a rock-bank as they were bringing us in. Stove in his ribs pretty badly. The other has a broken arm ... happened once while you were out. They wouldn't let me say anything for fear of worrying you.\"\n \n \n\n \n The girl did not answer then and a hushed expectancy fell over the ship. Somewhere aft a small motor was running. Wind whistled past the open lock.\n \n \"I've caused plenty of trouble haven't I?\" she asked aloud, finally.\n\"This was certainly a fool stunt, and I'm guilty of a lot of fool stunts! I just didn't realize until now the why of that law.\"\n \n \"Don't talk so much,\" the nurse admonished. \"A lot of people have found out the why of that law the hard way, just as you are doing, and lived to remember it. Until hospitals are built on this forlorn world, humans like you who haven't been properly conditioned will have to stay right at home.\"\n \n \"How about these men that live and work here?\"\n \n \"They never get here until they've been through the mill first. Adenoids, appendix', all the extra parts they can get along without.\"\n \n \"Well,\" Judith said. \"I've certainly learned my lesson!\"\n \n Gray didn't answer, but from out of the darkness surrounding her came a sound remarkably resembling a snort.\n \n \"Gray?\" Judith asked fearfully.\n \n \"Yes?\"\n \n \"Hasn't the pilot been gone an awfully long time?\"\n \n Rat himself provided the answer by alighting at the lip with a jar that shook the ship. He was breathing heavily and lugging something in his arms. The burden groaned.\n \n \"Gladney!\" Nurse Gray exclaimed.\n \n \"I got.\" Rat confirmed. \"Yes, Gladney. Damn heavy, Gladney.\"\n \n \"But how?\" she demanded. \"What of Roberds and Peterson?\"\n \n \"Trick,\" he sniggered. \"I burn down my shack. Boss run out. I run in. Very simple.\" He packed Gladney into the remaining hammock and snapped buckles.\n \n \"And Peterson?\" she prompted.\n \n \"Oh yes. Peterson. So sorry about Peterson. Had to fan him.\"\n \n \" Fan him? I don't understand.\"\n \n \"Fan. With chair. Everything all right. I apologized.\" Rat finished up and was walking back to the lock. They heard a slight rustling of wings as he padded away.\n \n He was back instantly, duplicating his feat of a short time ago. Cursing shouts were slung on the night air, and the deadly spang of bullets bounced on the hull! Some entered the lock. The Centaurian snapped it shut. Chunks of lead continued to pound the ship. Rat leaped for the pilot's chair, heavily, a wing drooping.\n \n \"You've been hurt!\" Gray cried. A small panel light outlined his features. She tried to struggle up.\n \n \"Lie still! We go. Boss get wise.\" With lightning fingers he flicked several switches on the panel, turned to her. \"Hold belly. Zoom!\"\n \n Gray folded her hands across her stomach and closed her eyes.\n \n Rat unlocked the master level and shoved!\n \n \n\n \n \"Whew!\" Nurse Gray came back to throbbing awareness, the all too familiar feeling of a misplaced stomach attempting to force its crowded way into her boots plaguing her. Rockets roared in the rear. She loosened a few straps and twisted over. Judith was still out, her face tensed in pain. Gray bit her lip and twisted the other way. The Centaurian was grinning at her.\n \n \"Do you always leave in a hurry?\" she demanded, and instantly wished she hadn't said it. He gave no outward sign.\n \n \"Long-time sleep,\" he announced. \"Four, five hours maybe.\" The chest strap was lying loose at his side.\n \n \"That long!\" she was incredulous. \"I'm never out more than three hours!\" Unloosening more straps, she sat up, glanced at the control panel.\n \n \"Not taking time,\" he stated simply and pointed to a dial. Gray shook her head and looked at the others.\n \n \"That isn't doing either of them any good!\"\n \n Rat nodded unhappily. \"What's her matter—?\" pointing.\n \n \"Appendix. Something about this atmosphere sends it haywire. The thing itself isn't diseased, but it starts manufacturing poison. Patient dies in a week unless it is taken out.\"\n \n \"Don't know it,\" he said briefly.\n \n \"Do you mean to say you don't have an appendix?\" she demanded.\n \n Rat folded his arms and considered this. \"Don't know. Maybe yes, maybe no. Where's it hurt?\"\n \n Gray pointed out the location. The Centaurian considered this further and drifted into long contemplation. Watching him, Gray remembered his eyes that night ... only last night ... in the office. Peterson had refused to meet them. After awhile Rat came out of it.\n \n \"No,\" he waved. \"No appendix. Never nowhere appendix.\"\n \n \"Then Mother Nature has finally woke up!\" she exclaimed. \"But why do Centaurians rate it exclusively?\"\n \n Rat ignored this and asked one of her. \"What you and her doing up there?\" He pointed back and up, to where Mars obliterated the stars.\n \n \"You might call it a pleasure jaunt. She's only seventeen. We came over in a cruiser belonging to her father; it was rather large and easy to handle. But the cruise ended when she lost control of the ship because of an attack of space-appendicitis. The rest you know.\"\n \n \"So you?\"\n \n \"So I'm a combination nurse, governess, guard and what have you. Or will be until we get back. After this, I'll probably be looking for work.\" She shivered.\n \n \"Cold?\" he inquired concernedly.\n \n \"On the contrary, I'm too warm.\" She started to remove the blanket. Rat threw up a hand to stop her.\n \n \"Leave on! Hot out here.\"\n \n \"But I'm too hot now. I want to take it off!\"\n \n \"No. Leave on. Wool blanket. Keep in body heat, yes. Keep out cold, yes. Keep in, keep out, likewise. See?\"\n \n Gray stared at him. \"I never thought of it that way before. Why of course! If it protects from one temperature, it will protect from another. Isn't it silly of me not to know that?\" Heat pressing on her face accented the fact.\n \n \"What is your name?\" she asked. \"Your real one I mean.\"\n \n He grinned. \"Big. You couldn't say it. Sound like Christmas and bottlenose together real fast. Just say Rat. Everybody does.\" His eyes swept the panel and flashed back to her. \"Your name Gray. Have a front name?\"\n \n \"Patti.\"\n \n \"Pretty, Patti.\"\n \n \"No, just Patti. Say, what's the matter with the cooling system?\"\n \n \"Damn punk,\" he said. \"This crate for surface work. No space. Cooling system groan, damn punk. Won't keep cool here.\"\n \n \"And ...\" she followed up, \"it will get warmer as we go out?\"\n \n Rat turned back to his board in a brown study and carefully ignored her. Gray grasped an inkling of what the coming week could bring.\n \n \"But how about water?\" she demanded next. \"Is there enough?\"\n \n He faced about. \"For her—\" nodding to Judith, \"and him—\" to Gladney,\n\"yes. Sparingly. Four hours every time, maybe.\" Back to Gray. \"You, me ... twice a day. Too bad.\" His eyes drifted aft to the tank of water. She followed. \"One tank water. All the rest fuel. Too bad, too bad. We get thirsty I think.\"\n \n \n\n \n They did get thirsty, soon. A damnable hot thirst accented by the knowledge that water was precious, a thirst increased by a dried-up-in-the-mouth sensation. Their first drink was strangely bitter; tragically disappointing. Patti Gray suddenly swung upright in the hammock and kicked her legs. She massaged her throat with a nervous hand, wiped damp hair from about her face.\n \n \"I have to have a drink.\"\n \n Rat stared at her without answer.\n \n \"I said, I have to have a drink!\"\n \n \"Heard you.\"\n \n \"Well...?\"\n \n \"Well, nothing. Stall. Keep water longer.\"\n \n She swung a vicious boot and missed by inches. Rat grinned, and made his way aft, hand over hand. He treaded cautiously along the deck. \"Do like this,\" he called over his shoulder. \"Gravity punk too. Back and under, gravity.\" He waited until she joined him at the water tap.\n \n They stood there glaring idiotically at each other.\n \n She burst out laughing. \"They even threw the drinking cups out!\" Rat inched the handle grudgingly and she applied lips to the faucet.\n \n \"Faugh!\" Gray sprang back, forgot herself and lost her balance, sat down on the deck and spat out the water. \"It's hot! It tastes like hell and it's hot! It must be fuel!\"\n \n Rat applied his lips to the tap and sampled. Coming up with a mouthful he swished it around on his tongue like mouthwash. Abruptly he contrived a facial contortion between a grin and a grimace, and let some of the water trickle from the edges of his mouth. He swallowed and it cost him something.\n \n \"No. I mean yes, I think. Water, no doubt. Yes. Fuel out, water in. Swish-swush. Dammit, Greaseball forget to wash tank!\"\n \n \"But what makes it so hot?\" She worked her mouth to dry-rinse the taste of the fuel.\n \n \"Ship get hot. Water on sun side. H-m-m-m-m-m-m.\"\n \n \"H-m-m-m-m-m-m-m what?\"\n \n \"Flip-flop.\" He could talk with his hands as well. \"Hot side over like pancake.\" Rat hobbled over to the board and sat down. An experimental flick on a lever produced nothing. Another flick, this time followed by a quivering jar. He contemplated the panel board while fastening his belt.\n \n \"H-m-m-m-m-m-m,\" the lower lip protruded.\n \n Gray protested. \"Oh, stop humming and do something! That wa—\" the word was queerly torn from her throat, and a scream magically filled the vacancy. Nurse Gray sat up and rubbed a painful spot that had suddenly appeared on her arm. She found her nose bleeding and another new, swelling bruise on the side of her head. Around her the place was empty. Bare.\n \n No, not quite. A wispy something was hanging just out of sight in the corner of the eye; the water tap was now moulded upward , beads glistening on its handle. The wispy thing caught her attention again and she looked up.\n \n Two people, tightly wrapped and bound in hammocks, were staring down at her, amazed, swinging on their stomachs. Craning further, she saw Rat. He was hanging upside down in the chair, grinning at her in reverse.\n \n \"Flip-flop,\" he laconically explained.\n \n \"For cripes sakes, Jehosaphat!\" Gladney groaned. \"Turn me over on my back! Do something!\" Gray stood on tiptoes and just could pivot the hammocks on their rope-axis.\n \n \"And now, please, just how do I get into mine?\" she bit at Rat.\n \n \n\n \n Existence dragged. Paradoxically, time dropped away like a cloak as the sense of individual hours and minutes vanished, and into its place crept a slow-torturing substitute. As the ship revolved, monotonously, first the ceiling and then the floor took on dullish, maddening aspects, eyes ached continuously from staring at them time and again without surcease. The steady, drumming rockets crashed into the mind and the walls shrieked malevolently on the eyeballs. Dull, throbbing sameness of the poorly filtered air, a growing taint in the nostrils. Damp warm skin, reeking blankets. The taste of fuel in the mouth for refreshment. Slowly mounting mental duress. And above all the drumming of the rockets.\n \n Once, a sudden, frightening change of pitch in the rockets and a wild, sickening lurch. Meteor rain. Maddening, plunging swings to the far right and left, made without warning. A torn lip as a sudden lurch tears the faucet from her mouth. A shattered tooth.\n \n \"Sorry!\" Rat whispered.\n \n \"Shut up and drive!\" she cried.\n \n \"Patti ...\" Judith called out, in pain.\n \n Peace of mind followed peace of body into a forgotten limbo of lost things, a slyly climbing madness directed at one another. Waspish words uttered in pain, fatigue and temper. Fractiousness. A hot, confined, stale hell. Sleep became a hollow mockery, as bad water and concentrated tablets brought on stomach pains to plague them. Consciousness punctured only by spasms of lethargy, shared to some extent by the invalids. Above all, crawling lassitude and incalescent tempers.\n \n Rat watched the white, drawn face swing in the hammock beside him. And his hands never faltered on the controls.\n \n Never a slackening of the terrific pace; abnormal speed, gruelling drive ... drive ... drive. Fear. Tantalizing fear made worse because Rat couldn't understand. Smothered moaning that ate at his nerves. Grim-faced, sleep-wracked, belted to the chair, driving!\n \n \"How many days? How many days!\" Gray begged of him thousands of times until the very repetition grated on her eardrums. \"How many days?\" His only answer was an inhuman snarl, and the cruel blazing of those inhuman eyes.\n \n She fell face first to the floor. \"I can't keep it up!\" she cried. The sound of her voice rolled along the hot steel deck. \"I cant! I cant!\"\n \n A double handful of tepid water was thrown in her face. \"Get up!\" Rat stood over her, face twisted, his body hunched. \"Get up!\" She stared at him, dazed. He kicked her. \"Get up!\" The tepid water ran off her face and far away she heard Judith calling.... She forced herself up. Rat was back in the chair.\n \n \n\n \n Gladney unexpectedly exploded. He had been awake for a long time, watching Rat at the board. Wrenching loose a chest strap he attempted to sit up.\n \n \"Rat! Damn you Rat, listen to me! When're you going to start braking , Rat?\"\n \n \"I hear you.\" He turned on Gladney with dulled eyes. \"Lie down. You sick.\"\n \n \"I'll be damned if I'm going to lie here and let you drive us to Orion! We must be near the half-way line! When are you going to start braking?\"\n \n \"Not brake,\" Rat answered sullenly. \"No, not brake.\"\n \n \" Not brake? \" Gladney screamed and sat bolt upright. Nurse Gray jumped for him. \"Are you crazy, you skinny rat?\" Gray secured a hold on his shoulders and forced him down. \"You gotta brake! Don't you understand that? You have to, you vacuum-skull!\" Gray was pleading with him to shut-up like a good fellow. He appealed to her. \"He's gotta brake! Make him!\"\n \n \"He has a good point there, Rat,\" she spoke up. \"What about this half-way line?\"\n \n He turned to her with a weary ghost of the old smile on his face. \"We passed line. Three days ago, maybe.\" A shrug of shoulders.\n \n \"Passed!\" Gray and Gladney exclaimed in unison.\n \n \"You catch on quick,\" Rat nodded. \"This six day, don't you know?\"\n \n Gladney sank back, exhausted. The nurse crept over to the pilot.\n\"Getting your figures mixed, aren't you?\"\n \n Rat shook his head and said nothing.\n \n \"But Roberds said eight days, and he—\"\n \n \"—he on Mars. I here. Boss nuts, too sad. He drive, it be eight days. Now only six.\" He cast a glance at Judith and found her eyes closed.\n\"Six days, no brake. No.\"\n \n \"I see your point, and appreciate it,\" Gray cut in. \"But now what? This deceleration business ... there is a whole lot I don't know, but some things I do!\"\n \n Rat refused the expected answer. \"Land tonight, I think. Never been to Earth before. Somebody meet us, I think.\"\n \n \"You can bet your leather boots somebody will meet us!\" Gladney cried. Gray turned to him. \"The Chief'll have the whole planet waiting for you !\" He laughed with real satisfaction. \"Oh yes, Rat, they'll be somebody waiting for us all right.\" And then he added: \"If we land.\"\n \n \"Oh, we land.\" Rat confided, glad to share a secret.\n \n \"Yeah,\" Gladney grated. \"But in how many little pieces?\"\n \n \"I've never been to Earth before. Nice, I think.\" Patti Gray caught something new in the tone and stared at him. Gladney must have noticed it, too.\n \n The Centaurian moved sideways and pointed. Gray placed her eyes in the vacated position.\n \n \"Earth!\" she shouted.\n \n \"Quite. Nice. Do me a favor?\"\n \n \"Just name it!\"\n \n \"Not drink long time. Some water?\"\n \n Gray nodded and went to the faucet. The drumming seemed remote, the tension vanished. She was an uncommonly long time in returning, at last she appeared beside him, outstretched hands dry.\n \n \"There isn't any left, Rat.\"\n \n Rat batted his tired eyes expressively. \"Tasted punk,\" he grinned at her.\n \n She sat down on the floor suddenly and buried her face.\n \n \"Rat,\" she said presently, \"I want to ask you something, rather personal? Your ... name. 'Rat'? Roberds told me something about your record. But ... please tell me, Rat. You didn't know the attack was coming, did you?\"\n \n He grinned again and waggled his head at her. \"No. Who tell Rat?\" Suddenly he was deadly serious as he spoke to her. \"Rat a.w.o.l., go out to help sick man alone in desert. Rat leave post. Not time send call through. Come back with man, find horrible thing happen.\"\n \n \"But why didn't you explain?\"\n \n He grinned again. \"Who believe? Sick man die soon after.\"\n \n Gladney sat up. He had heard the conversation between the two. \"You're right, Rat. No one would have believed you then, and no one will now. You've been safe enough on Mars, but the police will nab you as soon as you get out of the ship.\"\n \n \"They can't!\" cried Patti Gray. \"They can't hurt him after what he's done now.\"\n \n The Centaurian grinned in a cynical way.\n \n \"Police not get me, Gladney. Gladney's memory damn punk, I think. Earth pretty nice place, maybe. But not for Rat.\"\n \n Gladney stared at him for minutes. Then: \"Say, I get it ... you're—\"\n \n \"Shut up!\" Rat cut him off sharply. \"You talk too much.\" He cast a glance at Nurse Gray and then threw a meaning look at Gladney.",
      "metadata": {
        "title": "Prison Planet",
        "author": "Bob Tucker",
        "passage_id": "62212",
        "uid": "1449de85dded4df2ad91922bcf4f5588",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "105",
                "uid": "a85b0c819f7d48adb493fca1552589c4",
                "response_text": "There is a gravely sick girl on a spaceship near Mars and the crew argues what to do. Roberds decides to pilot the ship to Earth breaking the command due to an emergency. Rat argues with him and wants to pilot the ship himself, which leads to him being forced to leave. Roberds and Peterson then explain to nurse Gray, who is looking after the sick girl, that Rat left his post once and therefore didn't warn anyone about the Sansan massacre, so now he is out of favor. The nurse, nevertheless, visits Rat in secret and asks to pilot the ship. She says the sick wants him to and Rat takes Judith, the sick girl covered in blankets, and the nurse to the hammocks on his wings. The girls then wait for him to return with another sick man who was injured after finding and saving the crashed girls in the past. Judith feels bad for breaking the law and causing so much trouble by leaving Earth, now her appendix hurts and they have to take charge of the ship and travel to a hospital on Earth. Rat returns with sick Gladney and learns that Judith and Patti Gray were attacked during their cruise to space, which is the reason they got to Mars. The trip begins, soon everyone gets thirsty and hot, Gray is hurt when the ship moves between a meteor rain, she is devastated with suffering. Rat refuses to brake and is going to make the trip in six days instead of eight. He then tells his part of the story about the Sansan massacre - he left the post to save a sick man but nobody believed it back then."
              },
              {
                "worker_id": "104",
                "uid": "423ccaf069444c4591c95b3f308bea98",
                "response_text": "The story begins with Roberds yelling that he is going to pilot the ship no matter the consequences. Roberds is saying that an ill girl needs to be taken to a hospital and that he plans to take her to Earth where she can be treated. He then asks Patti for the status of Judith and she communicates that Judith is holding in but will not be able to do so for long as her health continues to fail. \n\nSeparately, Rat and Greaseball are helping complete tasks to prepare the ship for its flight to Earth. Once they are done, Greaseball tells Rat that he can go to bed. As Rat is heading to his bed, Patti whispers to him through a window. She does not want to wait to fly to Earth and asks Rat to take them instead. Rat readily agrees to do so and begins to enact their escape plan. He flies both of the girls to the ship and instructs them to be quiet on the ship so they do not attract attention. Before they head off on their trip, Rat says he is going to get Gladney and bring him too as he is also sick. When Rat returns to the ship with Gladney, they are found out and the ship begins to be attacked. One of Rat’s wings is damaged in the process. Rat pilots the ship to a very fast takeoff and they head towards Earth. At the beginning of the trip, Rat finds out that Judith is ill because of her appendix. \n\nPatti continues talking to Rat and answering questions about herself and Judith. During the conversation with Rat, she begins to realize the trip is going to be very uncomfortable as the cooling system is not working and they have a very limited supply of water. Patti becomes dehydrated and grows increasingly upset about the conditions on the cramped ship. In exasperation, she repeatedly asks him how many more days they have to spend on the ship. \n\nGladney suddenly wakes up and in an excited manner tells Rat that he needs to begin braking. Gladney begins asking Patti for help in convincing Rat to apply the brakes to make sure they get to Earth safely. Rat explains that he is cutting the trip time down from an expected 78 days to just 6 days with no breaks. Suddenly, they spot Earth in the distance. Patti starts to ask Rat about the attack that the Chief mentioned earlier and Rat says that he was just trying to help someone but knew no one would listen to his story. Gladney interrupts the conversation and taunts Rat that he will be arrested when they get to Earth to the dismay of Patti. Rat replies by cryptically stating that Earth seems like a nice place but not one for him. \n"
              },
              {
                "worker_id": "107",
                "uid": "8a4398bf16a741a5ab16c6053276effb",
                "response_text": "Gladney and Judith are two ill patients who require surgery on Earth. A Centaurian named Rat asks the Chief Consul Roberds if he can pilot the ship, but the field manager angrily denies him the opportunity. He asks Peterson to help get rid of Rat, and Rat leaves quickly. Roberds is determined to take the ship for himself because both patients will get the necessary treatment, and he mentions that Greaseball has stayed up all night, tearing the bunks and lockers out to prepare. Nurse Gray comes back after checking on the patient, and he tells her that she will be sleeping in a hammock for their eight-day trip. Gray asks about Rat, to which Peterson explains that he was part of the Sansan massacre. Rat was a member of the outpost watch, but he went AWOL from the Ganymedean colony when Mad Barry Sansan attacked and was saved by politics. Gray tells Roberds to call her if needed and then leaves the room. The story cuts to Rat helping Greaseball fill the water tanks with fuel and check the concentrated rations. Just as Rat is about to go to bed, Nurse Gray gets his attention and tells him that her patient wants him to pilot the ship. He instructs the nurse to wrap Judith up and takes them to the ship by flying. After dropping both of them inside, Rat leaves to transport Gladney. Judith laments about having learned her lesson the hard way and notices that the pilot has been gone for a long time. Just then, Rat returns with Gladney after tricking Roberds and Peterson by burning down his shack. Rat then takes off with the ship. They get thirsty from the heat, but there is only one water tank because the rest is full of fuel. The water they drink is hot because the ship itself is heating up. Gray realizes that the hammocks have also turned upside down. The ship is hell as the journey continues because of the uncomfortable conditions, lack of sleep, and increasing heat. However, Rat continues to drive the ship. Even when Nurse Gray continuously asks him how long the trip is and breaks down, he makes her get up. Gladney wants Rat to brake too, but he refuses and explains that this is a six-day journey. He also says that they will land tonight. Nurse Gray asks him about his knowledge of the attack in the Sansan massacre; Rat responds that he left his post to help a sick man in the desert when the attack happened. Gladney tells him that the police will get him the moment they land, while Rat only grins and says that Earth is not a place for Rat. Gladney realizes what he implies, but Rat tells him to shut up because he talks too much. "
              },
              {
                "worker_id": "101",
                "uid": "dbf448d1e6e1428fadb192c5d62c60a8",
                "response_text": "The story opens on Mars, with Chief Roberds and Peterson speaking to Rat, a Centaurian. Peterson refuses to allow Rat to pilot an emergency surface ship to Earth after several people have fallen sick due to a space illness. The two argue briefly, before Rat storms out. As Peterson and the Chief discuss the fate of the ship, and advise that Roberds pilot the ship despite it possibly costing him his job, nurse Patti Gray appears in the doorway. She tells them that her patient, seventeen year old Judith, is falling ill quickly and asks when the trip was planned to take place. She also asks about Rat, and it is revealed that he has a record due to his role in the Sansan massacre, where he abandoned his post, causing destruction to their colony. Roberds plans to take off at dawn. However, that night, Patti finds Rat and asks him to pilot the ship; Judith requested him specifically and they fear waiting until dawn. Rat agrees, and carries them to the ship using his wings. He additionally brings Gladney along, who is also sick. As the ship prepares to take off, they are suddenly attacked with bullets. Rat is injured slightly but they manage to get away. On the ship, Rat asks Patti what is wrong with Judith, and she replies saying that she has appendicitis; Rat remarks that Centaurians do not have an appendix. There are challenges on the ship, namely the temperature and the lack of water supply; Patti and Rat are only allowed two drinks a day, and the water remains hot. As time passes, the crew begins to go mad, and Gladney erupts in rage, telling Rat to begin braking the ship. Rat reveals that they had long since passed the halfway mark, and he does not intend to brake. Gladney angrily tells Rat that the police will be waiting for him on Earth."
              }
            ]
          },
          {
            "question_text": "What is the relationship between Judith and Patti Gray?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "105",
                "uid": "a85b0c819f7d48adb493fca1552589c4",
                "response_text": "Patti Gray is Judith's nurse, governess, guard and everything of that kind. Judith is only seventeen and they are pretty close with Patti. The least watches over the sick, reports her condition and fulfills the girl's request like asking Rat to pilot the ship. Judith relies on her nurse, she calls for her when in pain and tells her how sorry she is for causing trouble. Judith's call makes Patti get up even when she herself is in pain. She is anxious for the girl not making it to the hospital. The two stick together as they crashed together after an attack on their spaceship and have to return to Earth together. "
              },
              {
                "worker_id": "104",
                "uid": "423ccaf069444c4591c95b3f308bea98",
                "response_text": "Patti is implied to have a caring role over Judith, such as a governess that can also be seen as a nurse or protector. Patti is helping take care of Judith as she is currently ill. She worries a great deal about Judith’s health and is doing everything possible to try to get her to help faster. They were previously on a ship together but it crashed. The trip was meant to be a vacation trip and the cruiser ship was owned by Judith’s father. Patti takes on a caring role for Judith as she tries to reassure her that the decision they made to leave early has been done. "
              },
              {
                "worker_id": "107",
                "uid": "8a4398bf16a741a5ab16c6053276effb",
                "response_text": "Judith and Patti Gray share a caring relationship. Patti Gray is a combination guard, nurse, and governess to the seventeen year old girl. Nurse Gray cares for Judith for most of the trip and constantly checks up on her to make sure her condition is not worse than it already is. The two of them are very close as well. When Judith feels guilty about the foolish stunt she causes and the consequences she faces, Gray tells her that it is not her fault because others have also experienced the same. Even though she could have chosen to stay until Roberds piloted the ship, she agreed to ask Rat to pilot the ship because of Judith’s choice of which pilot she wants to fly her. This action shows that she is very considerate of Judith’s opinions and wants."
              },
              {
                "worker_id": "101",
                "uid": "dbf448d1e6e1428fadb192c5d62c60a8",
                "response_text": "Patti Gray is a maternal figure of sorts to Judith. She accompanies her on her trip to Mars, and when Judith becomes ill, Patti becomes her caretaker, aided by her nursing skills. Patti Gray looks after Judith, staying by her side throughout the night and then joining her on the ship when Rat comes to retrieve them. Judith is young, only seventeen, and because of this looks to Patti when she is ill, calling for her several times on the ship."
              }
            ]
          },
          {
            "question_text": "What is the relationship between Rat and Patti Gray?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "105",
                "uid": "a85b0c819f7d48adb493fca1552589c4",
                "response_text": "From the very beginning Patti is keen one Rat. When their gazes first meet she almost smiles back. She has to hide her goodwill as Rat is despised by the crew of the ship. The nurse is interested in his background and asks Roberds and Peterson. After learning about him leaving the post she wonders why he wasn't executed and feel sympathy for Rat. She visits him in secret to ask to pilot the ship, because her and the sick girl need to get to Earth as fast as possible and believe he can help. Rat does everything in a fast and well-organized way and plans to reach Earth in six days without brakes. He instructs Patti to cover herself in blankets not to get too hot and decides how the water will be distributed. He also tells about trying to save a man being the reason for him leaving the post and Patti feels even more sympathy. Nevertheless, during the journey they have a fight when she starts panicking and demanding water and Rat beats her. He tries to enforce his rules on the ship and others ask him to brake, Patti hurts herself during Rat's manoeuvres between the meteorites but she stands it. "
              },
              {
                "worker_id": "104",
                "uid": "423ccaf069444c4591c95b3f308bea98",
                "response_text": "Rat and Patti Gray first meet when Rat is being yelled at by Roberds. They exchange short glances and small smiles during this initial meeting. Patti asks for Rat’s help to get to Earth quicker instead of waiting for Roberds to take them. Rat agrees to help them readily accepts the request, quickly putting into action an escape plan. When Patti wakes up on the ship after the abrupt take off, she and Rat have a friendly conversation. Rat continuously smiles throughout the conversation and appears to be very friendly and happy to help Judith. "
              },
              {
                "worker_id": "107",
                "uid": "8a4398bf16a741a5ab16c6053276effb",
                "response_text": "Patti Gray is initially curious about Rat, prompting her to ask Roberds about his past. Once she asks Rat to pilot the ship, she is hesitant of him as a pilot. The two of them eventually converse once the ship takes off. They discuss the illness that Gladney and Judith are suffering from. She is curious about Rat's name, but he does not tell her because it is too long. He is also helpful, instructing Gray to keep the wool blanket on to preserve body heat and keep out the cold. Even when she swings a boot at him, he takes her to the water faucet and explains why the water is so hot. However, despite being helpful, Rat is quite rough towards Gray too. When she rolls along the deck and has a breakdown about not being able to keep up, he throws a handful of water into her face. He then kicks her to get up too. When he points out Earth to them, she is extremely grateful towards him for getting them to the planet so fast. Rat and Patti Gray do not share a very personal relationship. However, she learns more about him throughout their trip, and the two of them support each other in their own ways. \n"
              },
              {
                "worker_id": "101",
                "uid": "dbf448d1e6e1428fadb192c5d62c60a8",
                "response_text": "Patti Gray is wary of Rat and his history. She first asks Roberds and the Chief about Rat's name, and learns the story of Rat and his betrayal during the Sansan massacre. Despite being aware of this, Patti still reaches out to Rat and asks him to pilot the ship to Earth, at the request of Judith. Patti, being unknowledgeable of piloting ships, must listen to Rat's orders reluctantly. However, she still asks him about his life and eventually his side of the story at the massacre. Patti Gray becomes increasingly frustrated with Rat due to the conditions on the ship, particularly with the water supply. She maintains a respectful relationship with Rat despite her suspicions remaining."
              }
            ]
          },
          {
            "question_text": "What is the importance of the crashing of the ship of Judith's father?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "105",
                "uid": "a85b0c819f7d48adb493fca1552589c4",
                "response_text": "The crashing of the ship brings Judith and Patti to Mars where they meet two miners and then the whole crew of the spaceship including Rat. Judith wouldn't get that sick and lose the means to return to Earth if the ship didn't crash. The miners wouldn't suffer after helping the girls. Therefore, Judith wouldn't learn the lesson of breaking the law and leaving Earth.  The crashing also leads to the necessity of Rat piloting the ship and all the party suffering from heat and thirst. The whole situation of danger and limitless occurs because the ship crashed and the girl gets sick on Mars, so she needs to get to Earth immediately. "
              },
              {
                "worker_id": "104",
                "uid": "423ccaf069444c4591c95b3f308bea98",
                "response_text": "The ship crashed because Judith was piloting the ship and began to experience the symptoms of her appendicitis. It is unknown whether Judith’s father survived the crash. It is implied that the man that Rat helped in the desert is perhaps Judith’s father. Rat helping that man is what caused him to be declared AWOL and why he might have authorities after him for his failure to report to duty. If the ship had not crashed then Judith’s father would not have been alone and injured in the desert, and Rat would not have been AWOL trying to help the man. "
              },
              {
                "worker_id": "107",
                "uid": "8a4398bf16a741a5ab16c6053276effb",
                "response_text": "The crashing of the ship of Judith’s father is what sets up the story. Nurse Gray explains that Judith took her father’s cruiser as a pleasure jaunt and came over. Although the ship is supposed to be large and easy to handle, the journey ended after Judith lost control of the ship because of an attack of space-appendicitis. The ship's crashing is what leads her to be on Mars, and it is also the cause of her illness because she has not gone through the same mill that the men who live and work there have gone through. This past event also sets up the current events of Rat speed-driving the ship back to Earth to save her life. "
              },
              {
                "worker_id": "101",
                "uid": "dbf448d1e6e1428fadb192c5d62c60a8",
                "response_text": "Judith's father's ship crashing leaves Judith and Patti Gray stranded on Mars. She initially wanted to recklessly travel to Mars, Gray coming along with her, and used her father's ship because it was easy to navigate. However, she was soon attacked by space-appendicitis and lost control of the ship, causing it to crash. This is significant because Judith and Patti Gray no longer have a way home, with Judith's illness becoming worse. They are desperate to return to Earth and thus resort to taking the ship with Rat as their pilot. "
              }
            ]
          },
          {
            "question_text": "What happens to Patti Gray throughout the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "105",
                "uid": "a85b0c819f7d48adb493fca1552589c4",
                "response_text": "The story starts with Patti looking after the sick girl. She hears the dispute of the crew about the future steps and gets involved. She learns out about Rat's past and the mistake of leaving his post which led to a massacre. Nevertheless, she and the girl decide to ask him to pilot the ship, hoping it will help the sick get on Earth in time. Patti gets sympathetic towards Rat from the beginning and keeps trying to talk to him. She keeps being by Judith. Rat bring her to the hammocks on his wings and she is frightened for a second. She follows his orders and advices until her suffering gets intense. During the trip with Rat as a pilot she has to drink only twice a day to keep water and she feels extremely thirsty. She also hurts herself when the ship suddenly moves from one side to another. Water tastes like fuel to her and she gets mad at Rat for not naming the amount of days. Then she learns about Rat's point of view on the past situation with the massacre and becomes even more sympathetic towards him. "
              },
              {
                "worker_id": "104",
                "uid": "423ccaf069444c4591c95b3f308bea98",
                "response_text": "Patti Gray is in a room listening to an argument when she hears Judith moaning from a different room and goes to tend to her aid. After attending to Judith she goes back to talk to Roberds. She informs Patti that Rat went AWOL during a very important battle. The Chief Consul explains that unrelated politics is what saved Rat from execution for abandoning his post. After her inquiry about Rat, Patti says goodnight to everyone and returns to her room for the night. Patti secretly converses with Rat and asks him to fly Judith and her to Earth right away instead of waiting for Roberds. Rat agrees to do so and flies Judith to the ship. After Rat grabs and takes Judith to the ship, Patti anxiously awaits for him to return. He eventually returns and flies her to the ship too. When they get to the ship Patti reassures Judith that there is no use in mulling over the decision to take the ship now and tries to calm her down. \n\nBecause Rat pilots the ship to a very fast takeoff, Patti, Judith, and Gladney pass out due to the forces. Patti eventually wakes up and is surprised to find out how long she was out, she then begins to talk to Rat. During the trip, Patti becomes thirsty because of the very limited supply of water and she becomes irritated when Rat tells her she cannot drink more water. She grows increasingly upset about the conditions on the ship. When informed by Gladney that Rat is traveling at an excessive speed without necessary breaking, Patti tells Rat that he needs to explain how he is going to deaccelerate. She’s interrupted when they suddenly spot Earth. She goes to get Rat water as requested but returns to tell him that there is no more water left. \n"
              },
              {
                "worker_id": "107",
                "uid": "8a4398bf16a741a5ab16c6053276effb",
                "response_text": "Throughout the story, Patti Gray is forced to endure many of the harsh conditions on the ship while having to take care of her patients. She initially mentions that she was once part of the Fleet and is used to harsh conditions. However, Nurse Gray is also never able to sleep more than three hours due to her patients and having to constantly check up on their conditions whenever they are in pain. Although Nurse Gray is determined and confident to see Judith get better, there are also parts where she begins to lose her sanity. She is upset that there is only one tank of boiling hot water and the difficulty of getting into a hammock in space. Later, as their journey reaches the end, Nurse Gray begins to go mad from the horrid conditions on the ship and falls face-first onto the floor. Once the end is near, and with some support from Rat, she is extremely happy to see Earth again. Nurse Gray is also able to calm down and resume asking Rat questions. "
              },
              {
                "worker_id": "101",
                "uid": "dbf448d1e6e1428fadb192c5d62c60a8",
                "response_text": "Patti Gray is a nurse to Judith on Mars. She updates Peterson and the Chief on Judith's status, and asks them about Rat and why he is not allowed to pilot the ship to Earth. Patti learns that Rat was involved in treason back when the Sansan massacre happened. Later that night, Patti finds Rat and asks him to pilot the ship to Earth as soon as possible. Rat later retrieves Judith and Patti and takes them aboard the ship, where they take off. Rat and Patti talk on the ship, asking each other questions, and Patti faces several hardships on the ship, including the lack of water and the uncomfortable temperature. As the journey continues, it becomes unbearable for Patti."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4751,
        "document_length_chars": 27563
      }
    }
  ]
}