{
  "item_metadata": {
    "item_id": "62244",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "62244",
      "content": "GALACTIC GHOST\n \n\n By WALTER KUBILIUS\n \n \n The Flying Dutchman of space was a harbinger of death. But Willard wasn't superstitions. He had seen the phantom—and lived.\n \n [Transcriber's Note: This etext was produced from Planet Stories Winter 1942. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n The only friend in space Willard had ever known was dying. Dobbin's lips were parched and his breath came spasmodically. The tips of his fingers that had so many times caressed the control board of the Mary Lou were now black as meteor dust.\n \n \"We'll never see Earth again,\" he whispered feebly, plucked weakly at the cover.\n \n \"Nonsense!\" Willard broke in hurriedly, hoping that the dying man would not see through the lie. \"We've got the sun's gravity helping us drift back to Earth! We'll be there soon! You'll get well soon and we'll start to work again on a new idea of mine....\" His voice trailed helplessly away and the words were lost. It was no use.\n \n The sick man did not hear him. Two tears rolled down his cheeks. His face contorted as he tried to withhold a sob.\n \n \"To see Earth again!\" he said weakly. \"To walk on solid ground once more!\"\n \n \"Four years!\" Willard echoed faintly. He knew how his space mate felt. No man can spend four years away from his home planet, and fail to be anguished. A man could live without friends, without fortune, but no man could live without Earth. He was like Anteus, for only the feel of the solid ground under his feet could give him courage to go among the stars.\n \n Willard also knew what he dared not admit to himself. He, too, like Dobbin, would never see Earth again. Perhaps, some thousand years from now, some lonely wanderers would find their battered hulk of a ship in space and bring them home again.\n \n Dobbin motioned to him and, in answer to a last request, Willard lifted him so he faced the port window for a final look at the panorama of the stars.\n \n Dobbin's eyes, dimming and half closed, took in the vast play of the heavens and in his mind he relived the days when in a frail craft he first crossed interstellar space. But for Earth-loneliness Dobbin would die a happy man, knowing that he had lived as much and as deeply as any man could.\n \n Silently the two men watched. Dobbin's eyes opened suddenly and a tremor seized his body. He turned painfully and looked at Willard.\n \n \"I saw it!\" his voice cracked, trembling.\n \n \"Saw what?\"\n \n \"It's true! It's true! It comes whenever a space man dies! It's there!\"\n \n \"In heaven's name, Dobbin,\" Willard demanded, \"What do you see? What is it?\"\n \n Dobbin lifted his dark bony arm and pointed out into star-studded space.\n \n \"The Ghost Ship!\"\n \n Something clicked in Willard's memory. He had heard it spoken of in whispers by drunken space men and professional tellers of fairy tales. But he had never put any stock in them. In some forgotten corner of Dobbin's mind the legend of the Ghost Ship must have lain, to come up in this time of delirium.\n \n \"There's nothing there,\" he said firmly.\n \n \"It's come—for me!\" Dobbin cried. He turned his head slowly toward Willard, tried to say something and then fell back upon the pillow. His mouth was open and his eyes stared unseeing ahead. Dobbin was now one with the vanished pioneers of yesterday. Willard was alone.\n \n For two days, reckoned in Earth time, Willard kept vigil over the body of his friend and space mate. When the time was up he did what was necessary and nothing remained of Harry Dobbin, the best friend he had ever had. The atoms of his body were now pure energy stored away in the useless motors of the Mary Lou .\n \n \n\n \n The weeks that followed were like a blur in Willard's mind. Though the ship was utterly incapable of motion, the chance meteor that damaged it had spared the convertors and assimilators. Through constant care and attention the frail balance that meant life or death could be kept. The substance of waste and refuse was torn down and rebuilt as precious food and air. It was even possible to create more than was needed.\n \n When this was done, Willard immediately regretted it. For it would be then that the days and the weeks would roll by endlessly. Sometimes he thought he would go mad when, sitting at the useless control board, which was his habit, he would stare for hours and hours in the direction of the Sun where he knew the Earth would be. A great loneliness would then seize upon him and an agony that no man had ever known would tear at his heart. He would then turn away, full of despair and hopeless pain.\n \n Two years after Dobbin's death a strange thing happened. Willard was sitting at his accustomed place facing the unmoving vista of the stars. A chance glance at Orion's belt froze him still. A star had flickered! Distinctly, as if a light veil had been placed over it and then lifted, it dimmed and turned bright again. What strange phenomena was this? He watched and then another star faded momentarily in the exact fashion. And then a third! And a fourth! And a fifth!\n \n Willard's heart gave a leap and the lethargy of two years vanished instantly. Here, at last, was something to do. It might be only a few minutes before he would understand what it was, but those few minutes would help while away the maddening long hours. Perhaps it was a mass of fine meteorites or a pocket of gas that did not disperse, or even a moving warp of space-light. Whatever it was, it was a phenomena worth investigating and Willard seized upon it as a dying man seizes upon the last flashing seconds of life.\n \n Willard traced its course by the flickering stars and gradually plotted its semi-circular course. It was not from the solar system but, instead, headed toward it. A rapid check-up on his calculations caused his heart to beat in ever quickening excitement. Whatever it was, it would reach the Mary Lou .\n \n Again he looked out the port. Unquestionably the faint mass was nearing his ship. It was round in shape and almost invisible. The stars, though dimmed, could still be seen through it. There was something about its form that reminded him of an old-fashioned rocket ship. It resembled one of those that had done pioneer service in the lanes forty years ago or more. Resembled one? It was one! Unquestionably, though half-invisible and like a piece of glass immersed in water, it was a rocket ship.\n \n But the instruments on the control board could not lie. The presence of any material body within a hundred thousand miles would be revealed. But the needle on the gauge did not quiver. Nothing indicated the presence of a ship. But the evidence of his eyes was incontestable.\n \n Or was it? Doubt gripped him. Did the loneliness of all these years in space twist his mind till he was imagining the appearance of faint ghost-like rocket ships?\n \n The thought shot through his mind like a thunder bolt. Ghost Ship! Was this the thing that Dobbin had seen before he died? But that was impossible. Ghost Ships existed nowhere but in legends and tall tales told by men drunk with the liquors of Mars.\n \n \"There is no ship there. There is no ship there,\" Willard told himself over and over again as he looked at the vague outline of the ship, now motionless a few hundred miles away.\n \n Deep within him a faint voice cried, \" It's come—for me! \" but Willard stilled it. This was no fantasy. There was a scientific reason for it. There must be! Or should there be? Throughout all Earth history there had been Ghost Ships sailing the Seven Seas—ships doomed to roam forever because their crew broke some unbreakable law. If this was true for the ships of the seas, why not for the ships of empty space?\n \n He looked again at the strange ship. It was motionless. At least it was not nearing him. Willard could see nothing but its vague outline. A moment later he could discern a faint motion. It was turning! The Ghost Ship was turning back! Unconsciously Willard reached out with his hand as if to hold it back, for when it was gone he would be alone again.\n \n But the Ghost Ship went on. Its outline became smaller and smaller, fainter and fainter.\n \n Trembling, Willard turned away from the window as he saw the rocket recede and vanish into the emptiness of space. Once more the dreaded loneliness of the stars descended upon him.\n \n \n\n \n Seven years passed and back on Earth in a small newspaper that Willard would never see there was published a small item:\n \n \" Arden, Rocketport —Thirteen years ago the Space Ship Mary Lou under John Willard and Larry Dobbin left the Rocket Port for the exploration of an alleged planetoid beyond Pluto. The ship has not been seen or heard from since. J. Willard, II, son of the lost explorer, is planning the manufacture of a super-size exploration ship to be called Mary Lou II , in memory of his father.\"\n \n Memories die hard. A man who is alone in space with nothing but the cold friendship of star-light looks back upon memories as the only things both dear and precious to him.\n \n Willard, master and lone survivor of the Mary Lou , knew this well for he had tried to rip the memories of Earth out of his heart to ease the anguish of solitude within him. But it was a thing that could not be done.\n \n And so it was that each night—for Willard did not give up the Earth-habit of keeping time—Willard dreamed of the days he had known on Earth.\n \n In his mind's eye, he saw himself walking the streets of Arden and feeling the crunch of snow or the soft slap of rainwater under his feet. He heard again, in his mind, the voices of friends he knew. How beautiful and perfect was each voice! How filled with warmth and friendship! There was the voice of his beautiful wife whom he would never see again. There were the gruff and deep voices of his co-workers and scientists.\n \n Above all there were the voices of the cities, and the fields and the shops where he had worked. All these had their individual voices. Odd that he had never realized it before, but things become clearer to a man who is alone.\n \n Clearer? Perhaps not. Perhaps they become more clouded. How could he, for example, explain the phenomena of the Ghost Ship? Was it really only a product of his imagination? What of all the others who had seen it? Was it possible for many different men under many different situations to have the same exact illusion? Reason denied that. But perhaps space itself denies reason.\n \n Grimly he retraced the legend of the Ghost Ship. A chance phrase here and a story there put together all that he knew:\n \n Doomed for all eternity to wander in the empty star-lanes, the Ghost Ship haunts the Solar System that gave it birth. And this is its tragedy, for it is the home of spacemen who can never go home again. When your last measure of fuel is burnt and your ship becomes a lifeless hulk—the Ghost will come—for you!\n \n And this is all there was to the legend. Merely a tale of some fairy ship told to amuse and to while away the days of a star-voyage. Bitterly, Willard dismissed it from his mind.\n \n Another year of loneliness passed. And still another. Willard lost track of the days. It was difficult to keep time for to what purpose could time be kept. Here in space there was no time, nor was there reason for clocks and records. Days and months and years became meaningless words for things that once may have had meaning. About three years must have passed since his last record in the log book of the Mary Lou . At that time, he remembered, he suffered another great disappointment. On the port side there suddenly appeared a full-sized rocket ship. For many minutes Willard was half-mad with joy thinking that a passing ship was ready to rescue him. But the joy was short-lived, for the rocket ship abruptly turned away and slowly disappeared. As Willard watched it go away he saw the light of a distant star through the space ship. A heart-breaking agony fell upon him. It was not a ship from Earth. It was the Ghost Ship, mocking him.\n \n Since then Willard did not look out the window of his craft. A vague fear troubled him that perhaps the Ghost Ship might be here, waiting and watching, and that he would go mad if he saw it.\n \n How many years passed he could not tell. But this he knew. He was no longer a young man. Perhaps fifteen years has disappeared into nothing. Perhaps twenty. He did not know and he did not care.\n \n \n\n \n Willard awoke from a deep sleep and prepared his bed. He did it, not because it was necessary, but because it was a habit that had long been ingrained in him through the years.\n \n He checked and rechecked every part of the still functioning mechanism of the ship. The radio, even though there was no one to call, was in perfect order. The speed-recording dials, even though there was no speed to record, were in perfect order. And so with every machine. All was in perfect order. Perfect useless order, he thought bitterly, when there was no way whatever to get sufficient power to get back to Earth, long forgotten Earth.\n \n He was leaning back in his chair when a vague uneasiness seized him. He arose and slowly walked over to the window, his age already being marked in the ache of his bones. Looking out into the silent theater of the stars, he suddenly froze.\n \n There was a ship, coming toward him!\n \n For a moment the reason in his mind tottered on a balance. Doubt assailed him. Was this the Ghost Ship come to torment him again? But no phantom this! It was a life and blood rocket ship from Earth! Starlight shone on it and not through it! Its lines, window, vents were all solid and had none of the ghost-like quality he remembered seeing in the Ghost Ship in his youth.\n \n \n\n \n For another split second he thought that perhaps he, too, like Dobbin, had gone mad and that the ship would vanish just as it approached him.\n \n The tapping of the space-telegrapher reassured him.\n \n \"CALLING SPACE SHIP MARY LOU,\" the message rapped out, \"CALLING SPACE SHIP MARY LOU.\"\n \n With trembling fingers that he could scarcely control, old Willard sent the answering message.\n \n \"SPACE SHIP MARY LOU REPLYING. RECEIVED MESSAGE. THANK GOD!\"\n \n He broke off, unable to continue. His heart was ready to burst within him and the tears of joy were already welling in his eyes. He listened to the happiest message he had ever heard:\n \n \"NOTICE THAT SPACE SHIP MARY LOU IS DISABLED AND NOT SPACE WORTHY. YOU ARE INVITED TO COME ABOARD. HAVE YOU SPACE SUIT AND—ARE YOU ABLE TO COME?\"\n \n Willard, already sobbing with joy, could send only two words.\n \n \"YES! COMING!\"\n \n The years of waiting were over. At last he was free of the Mary Lou . In a dream like trance, he dressed in his space suit, pathetically glad that he had already checked every detail of it a short time ago. He realized suddenly that everything about the Mary Lou was hateful to him. It was here that his best friend died, and it was here that twenty years of his life were wasted completely in solitude and despair.\n \n He took one last look and stepped into the air-lock.\n \n The Earth-ship, he did not see its name, was only a hundred yards away and a man was already at the air-lock waiting to help him. A rope was tossed to him. He reached for it and made his way to the ship, leaving the Mary Lou behind him forever.\n \n Suddenly the world dropped away from him. Willard could neither see nor say anything. His heart was choked with emotion.\n \n \"It's all right,\" a kindly voice assured him, \"You're safe now.\"\n \n He had the sensation of being carried by several men and then placed in bed. The quiet of deep sleep descended upon him.\n \n \n\n \n He woke many times in the following days, but the privations of the passing years had drained his strength and his mind, had made him so much of a hermit that the presence of other men frightened him to the point of gibbering insanity.\n \n He knew that the food and drink were drugged, for after eating he never remembered seeing the men enter the room to care for him and to remove the dirty dishes. But there was enough sanity in his mind to also realize that, without the gradual reawakening of his senses to the value of human companionship, he might not be able to stand the mental shock of moving about among his people back on Earth.\n \n During those passing days, he savored each new impression, comparing it with what he remembered from that age-long past when he and his friends had walked on Earth's great plains and ridden on the oceans' sleek ships or flown with the wings of birds over the mountain ranges. And each impression was doubly enjoyable, for his memory was hazy and confused.\n \n Gradually, though, his mind cleared; he remembered the past, and he no longer was afraid of the men who visited him from time to time. But there was a strangeness about the men that he could not fathom; they refused to talk about anything, any subject, other than the actual running of the great ship. Always, when he asked his eager questions, they mumbled and drifted away.\n \n And then in his third week on the rescue ship, he went to sleep one night while peering from the port hole at the blue ball of Earth swimming in the blackness of space. He slept and he dreamed of the years he had spent by himself in the drifting, lifeless hulk of the Mary Lou . His dreams were vivid, peopled with men and women he had once known, and were horrible with the fantasies of terror that years of solitary brooding had implanted deep in his mind.\n \n \n\n \n He awoke with a start and a cry of alarm ran through him as he thought that perhaps he might still be in the Mary Lou . The warm, smiling face of a man quickly reassured him.\n \n \"I'll call the captain,\" the space man said. \"He said to let him know when you came to.\"\n \n Willard could only nod in weak and grateful acceptance. It was true! He pressed his head back against the bed's pillows. How soft! How warm! He yawned and stretched his arms as a thrill of happiness shot through his entire body.\n \n He would see Earth again! That single thought ran over and over in his mind without stopping. He would see Earth again! Perhaps not this year and perhaps not the next—for the ship might be on some extra-Plutonian expedition. But even if it would take years before it returned to home base Willard knew that those years would fly quickly if Earth was at the end of the trail.\n \n Though he had aged, he still had many years before him. And those years, he vowed, would be spent on Earth and nowhere else.\n \n The captain, a pleasant old fellow, came into the room as Willard stood up and tried to walk. The gravity here was a bit different from that of his ship, but he would manage.\n \n \"How do you feel, Space Man Willard?\"\n \n \"Oh, you know me?\" Willard looked at him in surprise, and then smiled,\n\"Of course, you looked through the log book of the Mary Lou .\"\n \n The captain nodded and Willard noticed with surprise that he was a very old man.\n \n \"You don't know how much I suffered there,\" Willard said slowly, measuring each word. \"Years in space—all alone! It's a horrible thing!\"\n \n \"Yes?\" the old captain said.\n \n \"Many times I thought I would go completely mad. It was only the thought and hope that some day, somehow, an Earth-ship would find me and help me get back to Earth. If it was not for that, I would have died. I could think of nothing but of Earth, of blue green water, of vast open spaces and the good brown earth. How beautiful it must be now!\"\n \n A note of sadness, matched only by that of Willard's, entered the captain's eyes.\n \n \"I want to walk on Earth just once—then I can die.\"\n \n Willard stopped. A happy dreamy smile touched his lips.\n \n \"When will we go to Earth?\" he asked.\n \n The Captain did not answer. Willard waited and a strange memory tugged at him.\n \n \"You don't know,\" the Captain said. It was not a question or a statement. The Captain found it hard to say it. His lips moved slowly.\n \n Willard stepped back and before the Captain told him, he knew .\n \n \"Matter is relative,\" he said, \"the existent under one condition is non-existent under another. The real here is the non-real there. All things that wander alone in space are gradually drained of their mass and energy until nothing is left but mere shells. That is what happened to the Mary Lou . Your ship was real when we passed by twenty years ago. It is now like ours, a vague outline in space. We cannot feel the change ourselves, for change is relative. That is why we became more and more solid to you, as you became more and more faint to any Earth-ship that might have passed. We are real—to ourselves. But to some ship from Earth which has not been in space for more than fifteen years—to that ship, to all intents and purposes, we do not exist.\n \n \"Then this ship,\" Willard said, stunned, \"you and I and everything on it...\"\n \n \"... are doomed,\" the Captain said. \"We cannot go to Earth for the simple reason that we would go through it!\"\n \n The vision of Earth and green trees faded. He would never see Earth again. He would never feel the crunch of ground under feet as he walked. Never would listen to the voices of friends and the songs of birds. Never. Never. Never....\n \n \"Then this is the Ghost Ship and we are the Ghosts!\"\n \n \"Yes.\"",
      "metadata": {
        "title": "Galactic Ghost",
        "author": "Walter Kubilius",
        "passage_id": "62244",
        "uid": "a874b17ac3c447a8bca3a4866fd46401",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "2",
                "uid": "56b403ac01614b7abb9bfed487d67a5c",
                "response_text": "John Willard and Larry Dobbin are astronauts who have been in space for four years on the rocket Mary Lou, and as Dobbin is dying, he regrets that he will not see Earth again. Willard assures him that they will make it back, but he knows that they will never make it back because their ship was damaged by a meteor. Although the ship can still carry out functions to support life, it is not navigable. After Willard helps Dobbin look at the stars one more time, Dobbin cries out that it’s true—when an astronaut is dying, the Ghost Ship comes for him. \n\nWillard recycles Dobbin’s body but feels regretful about it. He longs to see the Earth again and walk on it, but he knows this will never happen and feels intensely lonely. After two years, a strange thing happens. Willard is looking at the stars, and it seems that they are winking at him. Something seems to be moving toward him, and it turns out to be an ancient ship. Willard’s gauges do not register the ship’s presence although he sees it with his own eyes, and Willard realizes that it is the Ghost Ship coming for him. Strangely enough, however, the ship turns away and moves away from him.\n\nSeven years later, a newspaper on Earth publishes a story that Willard’s son, J. Willard II, plans to build a larger version of his father’s ship, the Mary Lou II, in memory of his father, but Willard Sr. is unaware of this. He continues to experience excruciating loneliness and dreams about his life on Earth—the people he knew, the sounds, and the cities. One day a giant rocket ship comes alongside the Mary Lou, and Willard is thrilled that he has been discovered. But the vessel turns away and leaves. Willard notices that he can see starlight through the ship and realizes it is the Ghost Ship. \n\nOne day he sees another ship and, at first, fears the Ghost Ship has returned. The new ship looks solid, though, and it contacts him, addressing the Mary Lou by name. Willard believes that this ship will take him back to Earth and eagerly boards it. Willard is kept drugged for a while but eventually is alert enough to speak with the captain. When Willard asks when they will return to Earth, the captain explains that they cannot return because matter in space loses its mass and energy until nothing is left. If they tried to return to Earth, they would pass through it. Willard then realizes he is on the Ghost Ship, and he is one of its Ghosts.  \n\n"
              },
              {
                "worker_id": "6",
                "uid": "074ca2c3e3d74240a0b1045c7d2a4ddd",
                "response_text": "Galactic Ghost begins with death. John Willard is taking care of his co-pilot and best friend, Larry Dobbin as he dies. A meteor struck their rocket ship, the Mary Lou, and damaged both her and Dobbin. As Dobbin dies, Willard gently takes care of him and lifts him up to the port so he can see the stars one last time. Just before he passes, Dobbin cries out and says he saw the infamous ghost ship. It steals dying spacemen who have no hope of returning to Earth, cursing them to spend the rest of their lives as ghosts in space. \nAfter Dobbin passes, Willard watches over him for two days before removing his body and turning it into energy for the useless engine in the Mary Lou. Although the ship is livable, it is not flyable. Taking careful diligence to check every part of the ship, Willard manages to keep the Mary Lou from completely shutting down. He transforms waste into food and learns to survive. \nTwo years of great loneliness and despair pass. As Willard looks out the port, he sees blinking stars. Excited, he investigates and realizes that it was an old-fashioned spaceship from decades ago. He soon sees that half of it is invisible, hence the blinking star phenomenon. As the ship gets closer, his sensors remain quiet. Putting it all together, he concludes that this is the Ghost Ship, but pushes the thought away, claiming it’s impossible. Slowly, the ship turns around and travels away from him. \nFlash forward seven more years and a newspaper published a story about Willard and Dobbin on Earth. Sadly, he would never get to see it. Willard’s son was about to create his own ship called Mary Lou II to honor his father. Willard spends his years alone trying to survive and also trying to fight off his memories of home, as they torture him. He kept up with the days and nights of Earth for many years and made his bed. But the memories of his old friends, the cities he lived in, and the crunch of snow beneath his feet drove him mad. Quickly, he lost track of the days. Another ship came and went, torturing him with hope yet again. \nAlmost twenty years passed and he grew more anguished every day. A ship came toward him and asked if he wanted to board, seeing as his ship was unlivable. Grateful he had checked the space suit beforehand, Willard traveled to the other ship and quickly fell into a deep sleep, exhausted by his years of solitude. After being drugged and evaded, Willard finally gets to speak to the captain of the ship on the third week who reveals that this is the Ghost Ship. Willard was only able to perceive the Ghost Ship because he and the Mary Lou were already ghosts, faded to the human eye. They are only shells on the Ghost Ship, and Willard is doomed to join them forever. "
              },
              {
                "worker_id": "8",
                "uid": "19a129cfd0d047e78d112906f9f2ab1f",
                "response_text": "John Willard's and Larry Dobbin's ship the \"Mary Lou\" had been damaged by a meteor during its mission to explore a small planet beyond Pluto, and Willard and Dobbin are waiting to die in space. Eventually, Dobbin dies, and he claims to see the fabled \"Ghost Ship\" seconds before his passing. After Dobbin's death, Willard manages to stay alive thanks to the machines that could convert waste into food and air. Willard spends two years alone, lost in hopeless thought and agony. Eventually, he sees a blinking shape in the distance, which he soon determines is an old-fashioned rocket ship. However, his instruments indicate there is no ship despite what he sees. Willard oscillates between doubting his own vision and believing there must be a scientific explanation for it. As he struggles with these thoughts, the ship leaves, and Willard spends seven years alone. Meanwhile, back on Earth, a newspaper from his hometown of Arden publishes an obituary of Willard and Dobbin indicating Willard’s son’s intention to build a “Mary Lou II.” Willard recalls memories with his wife and co-workers and the feeling of walking around Arden. He thinks about the legend of the Ghost Ship, which is said to come for the spacemen who die in space alone. A few years pass, and Willard sees the Ghost Ship pass close to him and turn away again, appearing to taunt him. He begins to lose track of time and guesses that as many as twenty years pass; he spends his days going through the motions of managing the ship as he feels himself aging physically. Then, he sees a ship approach, and this time it is a real ship. The ship sends out a rescue calls and retrieves Willard from the “Mary Lou.” Willard spends the next few days reacquainting himself with human interaction and struggling with the horrible memories of his decades in solitude. Then, he starts to realize something is off about the crew of the ship that rescued him. They will not engage him in any conversation other than the operations of the ship. When Willard meets the captain later, he reveals he actually is on the Ghost Ship after all. It only appeared solid to Willard the more the “Mary Lou” lost its mass and energy and itself became a kind of “ghost ship” through its aimless wandering through space. Willard realizes he is dead and will never again return to Earth. "
              },
              {
                "worker_id": "9",
                "uid": "d466958b3024460b9dc5ba330affa09e",
                "response_text": "John Willard and Larry Dobbin are the lone space explorers aboard the Mary Lou, a ship that can’t move due to meteor damage. As the story begins, WIllard tries to comfort Dobbin as Dobbin dies. Before passing away, Dobbin sees what he believes to be “The Ghost Ship”, a fabled ship that comes for dying spacemen. Willard believes Ghost Ships are just fairy tales and that Dobbin was delirious. \n\nTwo years later, Willard sees what looks like a partially invisible rocket ship, though his ship’s control board shows no sign of anything. As the ship turns away and disappears, Willard wonders if he imagined it or if it could be The Ghost Ship, but decides that is impossible. \n\nSeven more years go by, and we read a small article from Willard and Dobbin’s hometown newspaper (that we are told Willard will never see), about the thirteenth anniversary of Willard and Dobbin embarking on their mission, how they have never been heard from again, and how Willard’s son is having a large spaceship manufactured in his father’s honor. \n\nBack on the Mary Lou, Willard can’t help but dream of his Earth days each night. He grows more and more despondent and thinks about Ghost Ships. He stops looking out the window, and isn’t sure if fifteen or twenty years have passed. He wonders if he has gone mad when he sees a ship coming. Everything changes when he realizes that it’s a real ship that taps out a real message on his space-telegrapher.\n\nThe other ship invites him to come aboard and he gratefully accepts, boarding it and immediately falling asleep. Over the next few weeks he drifts in and out of consciousness, knowing that he must be being drugged but also realizing it would be difficult for him to acclimate to being around others so soon. His memories start to come back and his mind starts to clear, and he notices that none of the men caring for him want to give him any information or answer his questions. \n\nAfter Willard awakens fully, one of the men says he’ll get the captain, who wanted to see Willard when he came to. The captain comes to see him, and Willard notices that he is very old. He tells the captain that he can’t wait to get to Earth and asks when they’ll go. The captain explains that after floating around in space for as long as they and Willard have, things and people lose their mass and energy. Willard hadn’t yet lost his twenty years ago, which is why their ship didn’t look fully formed to him then. Now that he has, he is just a shell like them and can see them fully. \n\nAs Willard puts the pieces together, the captain explains that they can’t go to Earth because they would pass right through it. Willard realizes that this is, in fact, a Ghost Ship, and that they are the ghosts, and the captain confirms this. \n"
              }
            ]
          },
          {
            "question_text": "What is the significance of memories in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "2",
                "uid": "56b403ac01614b7abb9bfed487d67a5c",
                "response_text": "Both Dobbin and Willard have memories of Earth that sadden them and make them lonely. As Dobbin is dying, he remembers his life on Earth, and his greatest regret is that he will never see it again. Dobbin is satisfied with his life and experiences, but his Earth-loneliness prevents him from dying a happy man. Willard is also pained by his memories of Earth and what he has lost and will never have again. Alone in space, Willard considers his memories the only things of value to him. Because his memories cause him so much pain, Willard tries to ignore them or remove them, but they return in his dreams. His memories in his dreams are full of sensory details and other details that he did not notice when he was on Earth. However, when Willard is drugged and sleeping on the Ghost Ship, his dreams are of memories from the years he spent on the Mary Lou, and his dreams about people that he knew are unpleasant. Willard believes that if he could walk on Earth one more time, he would die a happy man."
              },
              {
                "worker_id": "6",
                "uid": "074ca2c3e3d74240a0b1045c7d2a4ddd",
                "response_text": "Memories are both joys for Willard as well as his greatest anguish. The memories of his time on Earth, the sound of his friend’s voices, the feel of the ground beneath his feet, and even the sounds of the buildings and the city torture him since it gives him something to hope for. \nHe is not able to let go of his life because he longs to survive and live out the rest of his days on Earth. He spends almost 20 years alone while in space, holding on to his memories to keep him going. Unlike Dobbin, memories became Willard’s constant companion and the only thing that lasted with him throughout his time aboard the Mary Lou. \nIn the end, though, his memories basically haunted and tormented him. He would push them away, only to dream of them at night. His memories broke him and, without anyone beside him, Willard slowly faded away into nothing more than a shell of a man. \n"
              },
              {
                "worker_id": "8",
                "uid": "19a129cfd0d047e78d112906f9f2ab1f",
                "response_text": "Memories function as a link to reality for Willard. The more he struggles to stay sane during his long periods of isolation, the more he relies on his vivid memories of Earth—walking along the streets of Arden, hearing the voices of his co-workers and scientists he used to know, the voices of his friends and wife–to keep him alive. Even as the “Mary Lou” slowly begins to lose its energy and shape and become a “ghost ship”, Willard is not aware that this process is even happening because his memories keep him grounded in a kind of reality. In this reality, his memories keep Willard alive because Willard believes he is alive and that a real ship has come to save him. The idea of returning to Earth and seeing those memories come to life again keeps Willard going for all those decades."
              },
              {
                "worker_id": "9",
                "uid": "d466958b3024460b9dc5ba330affa09e",
                "response_text": "Memories are very significant in the story, because they both sustain Willard’s will to keep going and torment him when he is at his lowest points. He dreams of his Earth days at night and longs to hear the voices of his friends, family, and coworkers, and to see Earth again. When he is rescued by The Ghost Ship, he tells the Captain that the idea of seeing Earth is all that has kept him going. His Earth memories have also made him feel even lonelier as he has floated through space, and now on The Ghost Ship his memories of being stranded on the Mary Lou haunt him in his nightmares. His memories have alternately been a struggle and a lifeline, but are ultimately what have kept him connected to his humanity. \n"
              }
            ]
          },
          {
            "question_text": "Who is Larry Dobbin, and what happens to him?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "2",
                "uid": "56b403ac01614b7abb9bfed487d67a5c",
                "response_text": "John Willard considers Larry Dobbin his best friend. They are both astronauts in a rocket ship that was on a voyage past Pluto to explore a possible planetoid. Their ship was struck by a meteor and can no longer fly, so they are drifting through space. When the story opens, Dobbin is dying. His breathing is erratic, and his fingertips are black. Dobbin has accepted his impending death, but Willard tries to convince Dobbin that he is not dying and that they will return to Earth. Dobbin longs to return to Earth and regrets that he will not see it again. He remembers his first space flight as Willard raises him to look out the port window at the stars. Before he dies, Dobbin declares that the Ghost Ship has come for him. He points to it out the window, but Willard does not see it. Willard believes that Dobbin has gone mad. Dobbin then dies. Dobbin is mentioned in a newspaper account thirteen years after the men left on their voyage when Willard’s son builds a larger version of their ship called the Mary Lou II. The article indicates they were never heard from again. \n"
              },
              {
                "worker_id": "6",
                "uid": "074ca2c3e3d74240a0b1045c7d2a4ddd",
                "response_text": "Larry Dobbin is John Willard’s right-hand man abroad the space ship Mary Lou. They blasted off from Rocket Port nine years before the beginning of the story. They went to space to explore the possibility of another planetoid hidden beyond Pluto. \nLarry Dobbin, as Willard’s companion and confidante, operated the Mary Lou from the control board, possibly co-piloting with Willard. \nHowever, less than five years into their adventure, the Mary Lou was struck by a meteor, which damaged the Mary Lou to no repair but only in certain areas. The meteor did not damage the assimilators and convertors, which meant the ship was livable, but not moveable. However, assumedly during the meteor strike, Dobbin was severely injured. At the beginning of the story, he is dying and sees a ship far in the distance. He claims it’s the ghost ship coming to take him away. After spotting the ship, Dobbin quickly passes. Willard mourns respectfully and follows the vigil ritual. Two days later, Willard disposed of Dobbin’s body, and his atoms were converted into pure energy for the Mary Lou. "
              },
              {
                "worker_id": "8",
                "uid": "19a129cfd0d047e78d112906f9f2ab1f",
                "response_text": "Larry Dobbin is Willard’s closest friend and fellow explorer who joins Willard on the “Mary Lou.” Their mission is to journey to a small planet that lies beyond Pluto. At some point in their expedition, a meteor hits their ship and damages it, causing the “Mary Lou” to drift through unknown space, unable to return to Earth. Dobbin becomes sick during this period, and Willard realizes he is going to die. Dobbin hopes to return to Earth prior to his death, and Willard entertains this fantasy in order to give him some hope and peace before his passing. Dobbin remembers his first journey into space, and as he peers out into the abyss towards the end of his life, he exclaims that he sees the Ghost Ship—a legend amongst sailors and spacemen who claim people see such a ship in the moments before death. Dobbin dies shortly after announcing his vision, and Willard is left alone."
              },
              {
                "worker_id": "9",
                "uid": "d466958b3024460b9dc5ba330affa09e",
                "response_text": "Larry Dobbin (called “Harry Dobbin” by Willard) is the other space explorer on the Mary Lou with Willard. They embarked on a voyage to explore a planetoid beyond Pluto, and were never heard from on Earth again. As the story begins, they are four years into the mission and Dobbin is dying of an unspecified illness that has turned his finger tips black and made it difficult for him to breathe or speak. Willard lifts him to the window of the ship so he can see the stars one last time, and Dobbin says he sees The Ghost Ship and that it has come for him because he is dying. Willard assures him that isn’t the case as Dobbin passes away. Willard keeps vigil over Dobbin’s remains for two days before disposing of them in the ship’s engine. \n"
              }
            ]
          },
          {
            "question_text": "What is the significance of Ghost Ships in the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "2",
                "uid": "56b403ac01614b7abb9bfed487d67a5c",
                "response_text": "There are legends and tall tales about the Ghost Ships, told mainly by drunken men and professional storytellers. Willard remembers that there are stories on Earth about Ghost Ships that sail the Seven Seas. The story goes that the crews of Ghost Ships have broken a particular law, and their punishment is to roam forever. The Ghost Ship in space is said to be the home of spacemen who could not return to Earth. When Dobbin is dying, he claims to see the Ghost Ship and that it has come for him, but when Willard looks for the ship, he does not see it. Later, when Willard sees the Ghost Ship for himself for the first time, he tries to convince himself it is not really there. He remembers the stories about oceangoing Ghost Ships and reasons that there could also be Ghost Ships in space. When the Ghost Ship turns to leave, Willard is almost sorry to see it go because he has been so lonely. When the Ghost Ship appears to Willard for the second time, it has pulled alongside the Mary Lou, and Willard thinks it is a real ship. Only when the Ghost Ship abruptly speeds away and Willard sees stars shining through it does Willard realize it was the Ghost Ship, and he believes it is mocking him. With his third sighting of the Ghost Ship, Willard immediately thinks it is the Ghost Ship but then convinces himself it is not when it messages him. After he is on the ship, he realizes it is indeed the Ghost Ship and that he is now a Ghost. \n"
              },
              {
                "worker_id": "6",
                "uid": "074ca2c3e3d74240a0b1045c7d2a4ddd",
                "response_text": "The Ghost Ship is a tale told by spacemen to frighten each other or warn them of this grave possibility. Many of those that came close to death in space, or those who witnessed others dying with no hope of a return to earth, mentioned seeing a ghost ship. A faint outline of a ship that had come to take them away forever. Before Dobbin’s death at the story of the story, he tells Willard that he sees the ghost ship. \nThis ghost ship serves as another form of torture for Willard during his many years of solitude. The ghost ship would essentially check up on him, float by and see if he was still alive or not. This gave Willard false hope as he would dream that the ghost ship was a real rocket ship that was coming to rescue him. In the end, Willard is taken away by a ghost ship, though he thinks it’s a rescue ship initially, and he is doomed to forever fly through the solar system as a ghost and nothing more. There is no hope for his return to Earth. The men of the ghost ship are truly ghosts, invisible to the naked eye and only visible to those on their deathbeds. \n"
              },
              {
                "worker_id": "8",
                "uid": "19a129cfd0d047e78d112906f9f2ab1f",
                "response_text": "The Ghost Ship is a legend that sailors and space travelers alike have claimed people see in the moments before they die at sea or in space. In the seconds before Dobbin dies in Willard’s arms, he looks out the window of the “Mary Lou” and claims to see the Ghost Ship himself. Throughout Willard’s long periods of solitude aboard the “Mary Lou”, he thinks he sees the Ghost Ship several times. First, from a distance, as a blinking light advancing closer and closer before turning back and sailing off into dark space; later, he thinks he sees the ship return, only this time it passes nearer before turning back and leaving again. With each return of the Ghost Ship, Willard believes he sees it clearer than he had before. After decades adrift in space, Willard believes a ship has finally come to rescue him. He does not think it is the Ghost Ship because it is solid, and he is greeted by a crew of people. However, the captain explains that the longer a vessel spends lost in space, the more it loses itself and slips into a kind of un-reality, along with those aboard. The more the “Mary Lou” drifted into this space, the more real the Ghost Ship became to Willard. Willard realizes that the “Mary Lou” has become a “ghost ship” herself."
              },
              {
                "worker_id": "9",
                "uid": "d466958b3024460b9dc5ba330affa09e",
                "response_text": "Ghost Ships frame the story and the idea of them haunts Willard on and off throughout it. At the beginning, when Dobbin exclaims that he sees a Ghost Ship prior to his death, Willard tells himself that it was a hallucination from somewhere deep in his dying friend’s subconscious, just the result of the memory of an old legend. However, the idea of a Ghost Ship never really leaves Willard’s mind throughout the rest of the story. When he sees a partially transparent rocket ship that turns away and disappears, he wonders if it could be a Ghost Ship but talks himself out of it. Later he wonders if it was a ghost ship that was “mocking him”. When he is rescued by a ship that looks more real, the thought still crosses his mind that it could be a Ghost Ship and he again shuts the idea down. Ultimately, Ghost Ships are incredibly significant in the story, because it turns out that both the Mary Lou, and his rescue ship/new home, while not exactly like the tall tale, are, in effect, Ghost Ships. \n"
              }
            ]
          },
          {
            "question_text": "What is the relationship between Dobbin and Willard?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "2",
                "uid": "56b403ac01614b7abb9bfed487d67a5c",
                "response_text": "Larry Dobbin and John Willard are astronauts together in space on a mission to explore a planetoid beyond Pluto. When a meteor damages their rocket, they both realize they will never return to Earth. Willard considers Dobbin the best friend he has ever had friend, and when Dobbin is dying, Willard tries to keep his spirits up by telling him that he has a new plan for a way for them to return to Earth. When Dobbin wants to see the stars one last time before he dies, Willard raises him so that he can see them out the port window. When Dobbins sees the Ghost Ship and says that it has come for him, Willard assures him that nothing is there. After Dobbin dies, Willard holds a wake for him for two days before he recycles Dobbin’s body because the ship can still break down waste and refuse to create food and air. Afterward, Willard regrets disposing of Dobbin’s body. With Dobbin gone, Willard experiences great pain and loneliness. Eventually, Willard sees the Ghost Ship and knows that his friend was right about it."
              },
              {
                "worker_id": "6",
                "uid": "074ca2c3e3d74240a0b1045c7d2a4ddd",
                "response_text": "Dobbin and Willard are close friends, companions, and colleagues. As they co-pilot and run the Mary Lou together in outer space, their relationship continued to develop. Willard even said that Dobbin was his sole friend in space. Being the only two people on board the Mary Lou brought them closer together and helped their relationship evolve. \nAlthough the reader does not see them together much, the effects of Dobbin on Willard are very evident and show how close the two of them were. Willard watched over his body for two Earth days before respectfully disposing of it. This dedication to his brethren shows how close the two of them became. \n"
              },
              {
                "worker_id": "8",
                "uid": "19a129cfd0d047e78d112906f9f2ab1f",
                "response_text": "John Willard and Larry Dobbin are both spacemen piloting the “Mary Lou” on a mission to explore a small planet far away from Earth, past Pluto. Due to their isolation and sheer amount of time spent together, they become close friends. In fact, they are the only friends each other has ever had in outer space. Following the meteor strike that disables their ship, Willard understands Dobbin’s desire to return to Earth as well as the importance of having hope that such a return would one day be possible. Willard offers Dobbin support in his dying moments, holding him up so he can see out the window. This is when Dobbin sees the Ghost Ship right before passing away. Dobbin’s vision would influence Willard’s struggle between belief and disbelief throughout the remainder of his time in space."
              },
              {
                "worker_id": "9",
                "uid": "d466958b3024460b9dc5ba330affa09e",
                "response_text": "Dobbin and Willard are the two space explorers aboard the Mary Lou, a ship bound to explore past Pluto. At the beginning of the story, Willard describes Dobbin as his only friend in space, and the best friend he ever had. The loss of Dobbin sends Willard into a spiral of loneliness and depression that lasts decades, as Dobbin was his only companion and connection to Earth. Dobbin only survives the first few paragraphs of the story, but he continues to have an influence on his colleague and friend. Dobbin believed he saw The Ghost Ship before he died, and the idea of that sticks with Willard throughout the rest of his journey aboard the Mary Lou and beyond, despite his skepticism. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 3810,
        "document_length_chars": 21173
      }
    }
  ]
}