{
  "item_metadata": {
    "item_id": "62349",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "62349",
      "content": "The Blue Behemoth\n \n\n By LEIGH BRACKETT\n \n \n Shannon's Imperial Circus was a jinxed space-carny leased for a mysterious tour of the inner worlds. It made a one-night pitch on a Venusian swamp-town—to find that death stalked it from the jungle in a tiny ball of flame.\n \n [Transcriber's Note: This etext was produced from Planet Stories May 1943. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Bucky Shannon leaned forward across the little hexagonal table. He knocked over the pitcher of thil , but it didn't matter. The pitcher was empty. He jabbed me in the breastbone with his forefinger, not very hard. Not hard enough to jar the ribs clean loose, just enough to spring them.\n \n \"We,\" he said, \"are broke. We are finished, through. Washed up and down the drain.\" He added, as an afterthought, \"Destitute.\"\n \n I looked at him. I said sourly, \"You're kidding!\"\n \n \"Kidding.\" Shannon put his elbows on the table and peered at me through a curtain of very blond hair that was trying hard to be red. \"He says I'm kidding! With Shannon's Imperial Circus, the Greatest Show in Space, plastered so thick with attachments....\"\n \n \"It's no more plastered than you are.\" I was sore because he'd been a lot quicker grabbing the pitcher. \"The Greatest Show in Space. Phooey! I've wet-nursed Shannon's Imperial Circus around the Triangle for eleven years, and I know. It's lousy, it's mangy, it's broken-down! Nothing works, from the ship to the roustabouts. In short, it stinks!\"\n \n I must have had the pitcher oftener than I thought. Nobody insults Buckhalter Shannon's Imperial Circus to Buckhalter Shannon's face unless he's tired and wants a long rest in a comfy fracture-frame.\n \n Shannon got up. He got up slowly. I had plenty of time to see his grey-green eyes get sleepy, and hear the quarter-Earth-blood Martian girl wailing about love over by the battered piano, and watch the slanting cat-eyes of the little dark people at the tables swing round toward us, pleased and kind of hungry.\n \n I had plenty of time to think how I only weigh one-thirty-seven to Shannon's one-seventy-five, and how I'm not as young as I used to be.\n \n I said, \"Bucky. Hold on, fella. I....\"\n \n Somebody said, \"Excuse me, gentlemen. Is one of you Mister Buckhalter Shannon?\"\n \n Shannon put his hands down on his belt. He closed his eyes and smiled pleasantly and said, very gently:\n \n \"Would you be collecting for the feed bill, or the fuel?\"\n \n I shot a glance at the newcomer. He'd saved me from a beating, even if he was a lousy bill-collecter; and I felt sorry for him. Bucky Shannon settled his shoulders and hips like a dancer.\n \n The stranger was a little guy. He even made me look big. He was dressed in dark-green synthesilk, very conservative. There was a powdering of grey in his hair and his skin was pink, soft, and shaved painfully clean. He had the kind of a face that nice maiden-ladies will trust with their last dime. I looked for his strong-arm squad.\n \n There didn't seem to be any. The little guy looked at Shannon with pale blue eyes like a baby, and his voice was softer than Bucky's.\n \n He said, \"I don't think you understand.\"\n \n I felt cold, suddenly, between the shoulders. Somebody scraped a chair back. It sounded like he'd ripped the floor open, it was so quiet. I got my brassies on, and my hands were sweating. Bucky Shannon sighed, and let his fist start traveling, a long, deceptive arc.\n \n Then I saw what the little guy was holding in his hand.\n \n I yelled and knocked the table over into Bucky. It made a lot of noise. It knocked him sideways and down, and the little dark men jumped up, quivering and showing their teeth. The Martian girl screamed.\n \n Bucky heaved the table off his lap and cursed me. \"What's eating you, Jig? I'm not going to hurt him.\"\n \n \"Shut up,\" I said. \"Look what he's got there. Money!\"\n \n The little guy looked at me. He hadn't turned a hair. \"Yes,\" he said.\n\"Money. Quite a lot of it. Would you gentlemen permit me to join you?\"\n \n Bucky Shannon got up. He grinned his pleasantest grin. \"Delighted. I'm Shannon. This is Jig Bentley, my business manager.\" He looked down at the table. \"I'm sorry about that. Mistaken identity.\"\n \n The little guy smiled. He did it with his lips. The rest of his face stayed placid and babyish, almost transparent. I realized with a start that it wasn't transparent at all. It was the most complete dead-pan I ever met, and you couldn't see into those innocent blue eyes any more than you could see through sheet metal.\n \n I didn't like him. I didn't like him at all. But he had money. I said,\n\"Howdy. Let's go find a booth. These Marshies make me nervous, looking like hungry cats at a mouse-hole.\"\n \n The little guy nodded. \"Excellent idea. My name is Beamish. Simon Beamish. I wish to—ah—charter your circus.\"\n \n \n\n \n I looked at Bucky. He looked hungrier than the Marshies did. We didn't say anything until we got Beamish into a curtained booth with a fresh pitcher of thil on the table. Then I cleared my throat.\n \n \"What exactly did you have in mind, Mr. Beamish?\"\n \n Beamish sipped his drink, made a polite face, and put it down. \"I have independent means, gentlemen. It has always been my desire to lighten the burden of life for those less fortunate....\"\n \n Bucky got red around the ears. \"Just a minute,\" he murmured, and started to get up. I kicked him under the table.\n \n \"Shut up, you lug. Let Mister Beamish finish.\"\n \n He sat down, looking like a mean dog waiting for the postman. Beamish ignored him. He went on, quietly,\n \n \"I have always held that entertainment, of the right sort, is the most valuable aid humanity can have in its search for the alleviation of toil and boredom....\"\n \n I said, \"Sure, sure. But what was your idea?\"\n \n \"There are many towns along the Venusian frontiers where no entertainment of the— proper sort has been available. I propose to remedy that. I propose to charter your circus, Mister Shannon, to make a tour of several settlements along the Tehara Belt.\"\n \n Bucky had relaxed. His grey-green eyes began to gleam. He started to speak, and I kicked him again.\n \n \"That would be expensive, Mister Beamish,\" I said. \"We'd have to cancel several engagements....\"\n \n He looked at me. I was lying, and he knew it. But he said,\n \n \"I quite understand that. I would be prepared....\"\n \n The curtains were yanked back suddenly. Beamish shut up. Bucky and I glared at the head and shoulders poking in between the drapes.\n \n It was Gow, our zoo-man—a big, ugly son-of-a-gun from a Terran colony on Mercury. I was there once. Gow looks a lot like the scenery—scowling, unapproachable, and tough. His hands, holding the curtains apart, had thick black hair on them and were not much larger than the hams of a Venusian swamp-rhino.\n \n He said, \"Boss, Gertrude's actin' up again.\"\n \n \"Gertrude be blowed,\" growled Bucky. \"Can't you see I'm busy?\"\n \n Gow's black eyes were unpleasant. \"I'm tellin' you, Boss, Gertrude ain't happy. She ain't had the right food. If something....\"\n \n I said, \"That'll all be taken care of, Gow. Run along now.\"\n \n He looked at me like he was thinking it wouldn't take much timber to fit me for a coffin. \"Okay! But Gertrude's unhappy. She's lonesome, see? And if she don't get happier pretty soon I ain't sure your tin-pot ship'll hold her.\"\n \n He pulled the curtains to and departed. Bucky Shannon groaned. Beamish cleared his throat and said, rather stiffly,\n \n \"Gertrude?\"\n \n \"Yeah. She's kind of temperamental.\" Bucky took a quick drink. I finished for him.\n \n \"She's the star attraction of our show, Mr. Beamish. A real blue-swamp Venusian cansin . The only other one on the Triangle belongs to Savitt Brothers, and she's much smaller than Gertrude.\"\n \n She was also much younger, but I didn't go into that. Gertrude may be a little creaky, but she's still pretty impressive. I only hoped she wouldn't die on us, because without her we'd have a sicker-looking circus than even I could stand.\n \n Beamish looked impressed. \"A cansin . Well, well! The mystery surrounding the origin and species of the cansin is a fascinating subject. The extreme rarity of the animal....\"\n \n We were getting off the subject. I said tactfully, \"We'd have to have at least a hundred U.C.'s.\"\n \n It was twice what we had any right to ask. I was prepared to dicker. Beamish looked at me with that innocent dead pan. For a fraction of a second I thought I saw something back of his round blue eyes, and my stomach jumped like it was shot. Beamish smiled sweetly.\n \n \"I'm not much of a bargainer. One hundred Universal Credits will be agreeable to me.\" He dragged out a roll as big as my two fists, peeled off half a dozen credit slips, and laid them on the table.\n \n \"By way of a retainer, gentleman. My attorney and I will call on you in the morning with a contract and itinerary. Good night.\"\n \n We said good night, trying not to drool. Beamish went away. Bucky made grab for the money, but I beat him to it.\n \n \"Scram,\" I said. \"There are guys waiting for this. Big guys with clubs. Here.\" I gave him a small-denomination slip I'd been holding out. \"We can get lushed enough on this.\"\n \n Shannon has a good vocabulary. He used it. When he got his breath back he said suddenly,\n \n \"Beamish is pulling some kind of a game.\"\n \n \"Yeah.\"\n \n \"It may be crooked.\"\n \n \"Sure. And he may be screwball and on the level. For Pete's sake!\" I yelled. \"You want to sit here till we all dry up and blow away?\"\n \n Shannon looked at me, kind of funny. He looked at the bulge in my tunic where the roll was. He raked back his thick light hair.\n \n \"Yeah,\" he said. \"I hope there'll be enough left to bribe the jury.\" He poked his head outside. \"Hey, boy! More thildatum !\"\n \n \n\n \n It was pretty late when we got back to the broken-down spaceport where Shannon's Imperial Circus was crouching beneath its attachments. Late as it was, they were waiting for us. About twenty of them, sitting around and smoking and looking very ugly.\n \n It was awfully lonesome out there, with the desert cold and restless under the two moons. There's a smell to Mars, like something dead and dried long past decay, but still waiting. An unhappy smell. The blown red dust gritted in my teeth.\n \n Bucky Shannon walked out into the glare of the light at the entrance to the roped-off space around the main lock. He was pretty steady on his feet. He waved and said, \"Hiya, boys.\"\n \n They got up off the steps, and the packing cases, and came toward us. I grinned and got into my brassies. We felt we owed those boys a lot more than money. It grates on a man's pride to have to sneak in and out of his own property through the sewage lock. This was the first time in weeks we'd come in at the front door.\n \n I waved the money in their faces. That stopped them. Very solemnly, Bucky and I checked the bills, paid them, and pocketed the receipts. Bucky yawned and stretched sleepily.\n \n \"Now?\" he said.\n \n \"Now,\" I said.\n \n We had a lot of fun. Some of the boys inside the ship came out to join in. We raised a lot of dust and nobody got killed, quite. We all went home happy. They had their money, and we had their blood.\n \n The news was all over the ship before we got inside. The freaks and the green girl from Tethys who could roll herself like a hoop, and Zurt the muscle man from Jupiter, and all the other assorted geeks and kinkers and joeys that make up the usual corny carnie were doing nip-ups in the passageways and drooling over the thought of steer and toppings.\n \n Bucky Shannon regarded them possessively, wiping blood from his nose.\n\"They're good guys, Jig. Swell people. They stuck by me, and I've rewarded them.\"\n \n I said, \"Sure,\" rather sourly. Bucky hiccoughed.\n \n \"Let's go see Gertrude.\"\n \n I didn't want to see Gertrude. I never got over feeling funny going into the brute tank, especially at night or out in space. I'm a city guy, myself. The smell and sound of wildness gives me goose bumps. But Bucky was looking stubborn, so I shrugged.\n \n \"Okay. But just for a minute. Then we go beddy-bye.\"\n \n \"You're a pal, Jif. Bes' li'l' guy inna worl'....\"\n \n The fight had just put the topper on him. I was afraid he'd fall down the ladder and break his neck. That's why I went along. If I hadn't.... Oh, well, what's a few nightmares among friends?\n \n It was dark down there in the tank. Way off at the other end, there was a dim glow. Gow was evidently holding Gertrude's hand. We started down the long passageway between the rows of cages and glassed-in tanks and compression units.\n \n Our footsteps sounded loud and empty on the iron floor. I wasn't near as happy as Shannon, and my skin began to crawl a little. It's the smell, I think; rank and sour and wild. And the sound of them, breathing and rustling in the dark, with the patient hatred walled around them as strong as the cage bars.\n \n Bucky Shannon lurched against me suddenly. I choked back a yell, and then wiped the sweat off my forehead and cursed. The scream came again. A high, ragged, whistling screech like nothing this side of hell, ripping through the musty darkness. Gertrude, on the wailing wall.\n \n It had been quiet. Now every brute in the place let go at the same time. My stomach turned clear over. I called Gertrude every name I could think of, and I couldn't hear myself doing it. Presently a great metallic clash nearly burst my eardrums, and the beasts shut up. Gow had them nicely conditioned to that gong.\n \n \n\n \n But they didn't quiet down. Not really. They were uneasy. You can feel them inside you when they're uneasy. I think that's why I'm scared of them. They make me feel like I'm not human as I thought—like I wanted to put my back-hair up and snarl. Yeah. They were uneasy that night, all of a sudden....\n \n Gow glared at us as we came up into the lantern light. \"She's gettin' worse,\" he said. \"She's lonesome.\"\n \n \"That's tough,\" said Bucky Shannon. His grey-green eyes looked like an owl's. He swayed slightly. \"That's sure tough.\" He sniffled.\n \n I looked at Gertrude. Her cage is the biggest and strongest in the tank and even so she looked as though she could break it open just taking a deep breath. I don't know if you've ever seen a cansin . There's only two of them on the Triangle. If you haven't, nothing I can say will make much difference.\n \n They're what the brain gang calls an \"end of evolution.\" Seems old Dame Nature had an idea that didn't jell. The cansins were pretty successful for a while, it seems, but something gummed up the works and now there's only a few left, way in the deep-swamp country, where even the Venusians hardly ever go. Living fossils.\n \n I wouldn't know, of course, but Gertrude looks to me like she got stuck some place between a dinosaur and a grizzly bear, with maybe a little bird blood thrown in. Anyway, she's big.\n \n I couldn't help feeling sorry for her. She was crouched in the cage with her hands—yeah, hands—hanging over her knees and her snaky head sunk into her shoulders, looking out. Just looking. Not at anything. Her eyes were way back in deep horny pits, like cold green fire.\n \n The lantern light was yellow on her blue-black skin, but it made the mane, or crest, of coarse wide scales that ran from between her eyes clear down to her flat, short tail, burn all colors. She looked like old Mother Misery herself, from way back before time began.\n \n Gow said softly, \"She wants a mate. And somebody better get her one.\"\n \n Bucky Shannon sniffled again. I said irritably, \"Be reasonable, Gow! Nobody's ever seen a male cansin . There may not even be any.\"\n \n Gertrude screamed again. She didn't move, not even to raise her head. The sadness just built up inside her until it had to come out. That close, the screech was deafening, and it turned me all limp and cold inside. The loneliness, the sheer stark, simple pain....\n \n Bucky Shannon began to cry. I snarled, \"You'll have to snap her out of this, Gow. She's driving the rest of 'em nuts.\"\n \n He hammered on his gong, and things quieted down again. Gow stood looking out over the tank, sniffing a little, like a hound. Then he turned to Gertrude.\n \n \"I saved her life,\" he said. \"When we bought her out of Hanak's wreck and everybody thought she was too hurt to live, I saved her. I know her. I can do things with her. But this time....\"\n \n He shrugged. He was huge and tough and ugly, and his voice was like a woman's talking about a sick child.\n \n \"This time,\" he said, \"I ain't sure.\"\n \n \"Well for Pete's sake, do what you can. We got a charter, and we need her.\" I took Shannon's arm. \"Come to bed, Bucky darlin'.\"\n \n He draped himself over my shoulder and we went off. Gow didn't look at us. Bucky sobbed.\n \n \"You were right, Jig,\" he mumbled. \"Circus is no good. I know it. But it's all I got. I love it, Jig. Unnerstan' me? Like Gow there with Gertrude. She's ugly and no good, but he loves her. I love....\"\n \n \"Sure, sure,\" I told him. \"Stop crying down my neck.\"\n \n We were a long way from the light, then. The cages and tanks loomed high and black over us. It was still. The secret, uneasy motion all around us and the scruffing of our feet only made it stiller.\n \n Bucky was almost asleep on me. I started to slap him. And then the mist rose up out of the darkness in little lazy coils, sparkling faintly with blue, cold fire.\n \n I yelled, \"Gow! Gow, the Vapor snakes! Gow—for God's sake!\"\n \n I started to run, back along the passageway. Bucky weighed on me, limp and heavy. The noise burst suddenly in a deafening hell of moans and roars and shrieks, packed in tight by the metal walls, and above it all I could hear Gertrude's lonely, whistling scream.\n \n I thought, \" Somebody's down here. Somebody let 'em out. Somebody wants to kill us! \" I tried to yell again. It strangled in my throat. I sobbed, and the sweat was thick and cold on me.\n \n One of Bucky's dragging, stumbling feet got between mine. We fell. I rolled on top of him, covering his face, and buried my own face in the hollow of his shoulder.\n \n The first snake touched me. It was like a live wire, sliding along the back of my neck. I screamed. It came down along my cheek, hunting my mouth. There were more of them, burning me through my clothes.\n \n Bucky moaned and kicked under me. I remember hanging on and thinking,\n\"This is it. This is it, and oh God, I'm scared!\"\n \n Then I went out.\n \n \n\n II\n \n Kanza the Martian croaker, was bending over me when I woke up. His little brown face was crinkled with laughter. He'd lost most of his teeth, and he gummed thak -weed. It smelt.\n \n \"You pretty, Mis' Jig,\" he giggled. \"You funny like hell.\"\n \n He slapped some cold greasy stuff on my face. It hurt. I cursed him and said, \"Where's Shannon? How is he?\"\n \n \"Mis' Bucky okay. You save life. You big hero, Mis' Jig. Mis' Gow come nickuhtime get snakes. You hero. Haw! You funny like hell!\"\n \n I said, \"Yeah,\" and pushed him away and got up. I almost fell down a couple of times, but presently I made it to the mirror over the washstand—I was in my own cell—and I saw what Kanza meant. The damned snakes had done a good job. I looked like I was upholstered in Scotch plaid. I felt sick.\n \n Bucky Shannon opened the door. He looked white and grim, and there was a big burn across his neck. He said:\n \n \"Beamish is here with his lawyer.\"\n \n I picked up my shirt. \"Right with you.\"\n \n Kanza went out, still giggling. Bucky closed the door.\n \n \"Jig,\" he said, \"those vapor worms were all right when we went in. Somebody followed us down and let them out. On purpose.\"\n \n I hurt all over. I growled, \"With that brain, son, you should go far. Nobody saw anything, of course?\" Bucky shook his head.\n \n \"Question is, Jig, who wants to kill us, and why?\"\n \n \"Beamish. He realizes he's been gypped.\"\n \n \"One hundred U.C.'s,\" said Bucky softly, \"for a few lousy swampedge mining camps. It stinks, Jig. You think we should back out?\"\n \n I shrugged. \"You're the boss man. I'm only the guy that beats off the creditors.\"\n \n \"Yeah,\" Bucky said reflectively. \"And I hear starvation isn't a comfortable death. Okay, Jig. Let's go sign.\" He put his hand on the latch and looked at my feet. \"And—uh—Jig, I....\"\n \n I said, \"Skip it. The next time, just don't trip me up, that's all!\"\n \n We had a nasty trip to Venus. Gertrude kept the brute tank on edge, and Gow, on the rare occasions he came up for air, went around looking like a disaster hoping to happen. To make it worse, Zurt the Jovian strong-man got hurt during the take-off, and the Mercurian cave-cat had kittens.\n \n Nobody would have minded that, only one of 'em had only four legs. It lived just long enough to scare that bunch of superstitious dopes out of their pants. Circus people are funny that way.\n \n Shannon and I did a little quiet sleuthing, but it was a waste of time. Anybody in the gang might have let those electric worms out on us. It didn't help any to know that somebody, maybe the guy next to you at dinner, was busy thinking ways to kill you. By the time we hit Venus, I was ready to do a Brodie out the refuse chute.\n \n Shannon set the crate down on the edge of Nahru, the first stop on our itinerary. I stood beside him, looking out the ports at the scenery. It was Venus, all right. Blue mud and thick green jungle and rain, and a bunch of ratty-looking plastic shacks huddling together in the middle of it. Men in slickers were coming out for a look.\n \n I saw Beamish's sleek yacht parked on a cradle over to the left, and our router's runabout beside it. Bucky Shannon groaned.\n \n \"A blue one, Jig. A morgue if I ever saw one!\"\n \n I snarled, \"What do you want, with this lousy dog-and-pony show!\" and went out. He followed. The gang was converging on the lock, but they weren't happy. You get so you can feel those things. The steamy Venus heat was already sneaking into the ship.\n \n While we passed the hatchway to the brute tank, I could hear Gertrude, screaming.\n \n \n\n \n The canvasmen were busy setting up the annex, slopping and cursing in the mud. The paste brigade was heading for the shacks. Shannon and I stood with the hot rain running off our slickers, looking.\n \n I heard a noise behind me and looked around. Ahra the Nahali woman was standing in the mud with her arms up and her head thrown back, and her triangular mouth open like a thirsty dog. She didn't have anything on but her blue-green, hard scaled hide, and she was chuckling. It didn't sound nice.\n \n You find a lot of Nahali people in side-shows, doing tricks with the electric power they carry in their own bodies. They're Venusian middle-swampers, they're not human, and they never forget it.\n \n Ahra opened her slitted red eyes and looked at me and laughed with white reptilian teeth.\n \n \"Death,\" she whispered. \"Death and trouble. The jungle tells me. I can smell it in the swamp wind.\"\n \n The hot rain sluiced over her. She shivered, and the pale skin under her jaw pulsed like a toad's, and her eyes were red.\n \n \"The deep swamps are angry,\" she whispered. \"Something has been taken. They are angry, and I smell death in the wind!\"\n \n She turned away, laughing, and I cursed her, and my stomach was tight and cold. Bucky said,\n \n \"Let's eat if they have a bar in this dump.\"\n \n We weren't half way across the mud puddle that passed as a landing field when a man came out of a shack on the edge of the settlement. We could see him plainly, because he was off to one side of the crowd.\n \n He fell on his knees in the mud, making noises. It took him three or four tries to get our names out clear enough to understand.\n \n Bucky said, \"Jig—it's Sam Kapper.\"\n \n We started to run. The crowd, mostly big unshaken miners, wheeled around to see what was happening. People began to close in on the man who crawled and whimpered in the mud.\n \n Sam Kapper was a hunter, supplying animals to zoos and circuses and carnivals. He'd given us good deals a couple of times, when we weren't too broke, and we were pretty friendly.\n \n I hadn't seen him for three seasons. I remembered him as a bronzed, hard-bitten guy, lean and tough as a twist of tung wire. I felt sick, looking down at him.\n \n Bucky started to help him up. Kapper was crying, and he jerked all over like animals I've seen that were scared to death. Some guy leaned over and put a cigarette in his mouth and lighted it for him.\n \n I was thinking about Kapper, then, and I didn't pay much attention. I only caught a glimpse of the man's face as he straightened up. I didn't realize until later that he looked familiar.\n \n We got Kapper inside the shack. It turned out to be a cheap bar, with a couple of curtained booths at the back. We got him into one and pulled the curtain in a lot of curious faces. Kapper dragged hard on the cigarette. The man that gave it to him was gone.\n \n Bucky said gently, \"Okay, Sam. Relax. What's the trouble?\"\n \n \n\n \n Kapper tried to straighten up. He hadn't shaved. The lean hard lines of his face had gone slack and his eyes were bloodshot. He was covered with mud, and his mouth twitched like a sick old man's.\n \n He said thickly, \"I found it. I said I'd do it, and I did. I found it and brought it out.\"\n \n The cigarette stub fell out of his mouth. He didn't notice it. \"Help me,\" he said simply. \"I'm scared.\" His mouth drooled.\n \n \"I got it hidden. They want to find out, but I won't tell 'em. It's got to go back. Back where I found it. I tried to take it, but they wouldn't let me, and I was afraid they'd find it....\"\n \n He reached suddenly and grabbed the edge of the table. \"I don't know how they found out about it, but they did. I've got to get it back. I've got to....\"\n \n Bucky looked at me. Kapper was blue around the mouth. I was scared, suddenly. I said, \"Get what back where?\"\n \n Bucky got up. \"I'll get a doctor,\" he said. \"Stick with him.\" Kapper grabbed his wrist. Kapper's nails were blue and the cords in his hands stood out like guy wires.\n \n \"Don't leave me. Got to tell you—where it is. Got to take it back. Promise you'll take it back.\" He gasped and struggled over his breathing.\n \n \"Sure,\" said Bucky. \"Sure, well take it back. What is it?\"\n \n Kapper's face was horrible. I felt sick, listening to him fight for air. I wanted to go for a doctor anyway, but somehow I knew it was no use. Kapper whispered,\n \n \" Cansin . Male. Only one. You don't know...! Take him back.\"\n \n \"Where is it, Sam?\"\n \n I reached across Bucky suddenly and jerked the curtain back. Beamish was standing there. Beamish, bent over, with his ear cocked. Kapper made a harsh strangling noise and fell across the table.\n \n Beamish never changed expression. He didn't move while Bucky felt Kapper's pulse. Bucky didn't need to say anything. We knew.\n \n \"Heart?\" said Beamish finally.\n \n \"Yeah,\" said Bucky. He looked as bad as I felt. \"Poor Sam.\"\n \n I looked at the cigarette stub smoldering on the table. I looked at Beamish with his round dead baby face. I climbed over Shannon and pushed Beamish suddenly down into his lap.\n \n \"Keep this guy here till I get back,\" I said.\n \n Shannon stared at me. Beamish started to get indignant. \"Shut up,\" I told him. \"We got a contract.\" I yanked the curtains shut and walked over to the bar.\n \n I began to notice something, then. There were quite a lot of men in the place. At first glance they looked okay—a hard-faced, muscular bunch of miners in dirty shirts and high boots.\n \n Then I looked at their hands. They were dirty enough. But they never did any work in a mine, on Venus or anywhere else.\n \n The place was awfully quiet, for that kind of a place. The bartender was a big pot-bellied swamp-edger with pale eyes and thick white hair coiled up on top of his bullet head. He was not happy.\n \n I leaned on the bar. \" Lhak ,\" I said. He poured it, sullenly, out of a green bottle. I reached for it, casually.\n \n \"That guy we brought in,\" I said. \"He sure has a skinful. Passed out cold. What's he been spiking his drinks with?\"\n \n \" Selak ,\" said a voice in my ear. \"As if you didn't know.\"\n \n I turned. The man who had given Kapper the cigarette was standing behind me. And I remembered him, then.",
      "metadata": {
        "title": "The Blue Behemoth",
        "author": "Leigh Brackett",
        "passage_id": "62349",
        "uid": "6a2fe8cefb6c45e984a87ee0bb1b8183",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "105",
                "uid": "2c5add235d404c4f81bac16a7fd14cc0",
                "response_text": "Bucky Shannon, a space circus owner, and his business manager, Jig Bentley, have a dispute over the business' financial hardships. Suddenly, a little man interferes. Mistaking him for a bill-collector, Bucky starts a fight, when Jig notices money in the man's hands. Simon Beamish, the little man, is planning to invest in the circus and make its tour to other towns. He agrees to pay much more than the real cost is, Bucky and Jig suspect some kind of a game there, but they need money. The two go to their circus and are finally able to pay the performers. After having some fun all together, the two go to see Gertrude, a huge cansin, the main attraction, who was earlier reported to be unhappy. Upon entry, Jig feels uneasy, frightened and sorry for Gertrude, who is in desperate need of a mate. The sorrow of this creature makes the whole team sad and uneasy, full of pity, and no one could help, even Gow who saved her and is the closest to her. Exiting her tank, Jig has to carry Bucky, who is crying at the view and falling asleep at the same time. On their way, the two face the Vapor snakes let out by someone, they fall, and the snakes cover their bodies. Gow saves the two and they are burnt but alive, trying to find out who let the snakes out to hurt them and suspecting Beamish. Then the whole gang goes to Venus to meet Beamish, and there is a feeling of discontent coming from the gang and mixed with Gertrude's screams all the way. Further, the Nahali woman from the gang claims to smell death and trouble. Then they meet Sam, a hunter selling them animals until three seasons ago, and now he is crying and scared. Turns out, he has found the only male cansin and wants to take it back to prevent trouble, though he is afraid of people wanting to take the cansin from him. Suddenly, Jig discovers Beamish listening to the conversation and Sam dies. Jig then notices the suspicious silence and too much of a crowd in the bar and recognizes the man who gave Sam a cigarette a while ago. "
              },
              {
                "worker_id": "106",
                "uid": "603f0ef947f64d9b8cd28845bb471455",
                "response_text": "Jig Bentley and his business partner Bucky Shannon run a zoo together in space. Their ship is currently stationed on Mars. Bucky is the owner of the zoo and Jig is his right hand man. Both they and the zoo are broken. That is until one night they are visited by Simon Beamish, a mysteriously rich man who offers them 100 U.C's to charter their circus to perform on Venus. They agree, but the night before they're set to leave, they pay a visit to their main attraction, a cansin, a beast native to Venus, named Gertrude. While they are down in the area where they keep the various monsters that perform in their show, along with the zookeeper named Gow, a group of vapour snakes are released on the pair. Some unknown person let these beasts free, in an effort to kill the duo. Jig takes Bucky away from the closed off area, saving his life, then blacks out. Later they wake up, speculating over who would want to kill them. They make the trip to Venus, while Gertrude is becoming restless. She is lonely and needs a mate. If she doesn't get one, Gow fears she might break out and wreak havoc. They arrive in Venus, where Ahra, one of the performers tells Jig that something has been taken from Venus, and death is coming. Jig then notices a run down Sam Kepper, a hunter he is acquainted with. Kepper falls and the pair rush over to him. A mystery man gives Kepper a cigarette, then leaves. They bring him into a bar, where Kepper tells him that he has found and acquired  a male cansin. Kepper tells Jig that he must take it back. Soon after this, he falls unconscious. Just then, Beamish arrives at their table. Jig walks over to the bar, noticing the group of men that are in the bar. Jig asks the barman what Kepper was drinking, and when he turns around, he notices the man that gave Kepper the cigarette. \nTHE END. "
              },
              {
                "worker_id": "104",
                "uid": "833bf34190cd4adba351ef710d797d1c",
                "response_text": "The Blue Behemoth story begins with Bucky Shannon and Jig sitting around a table talking about how they are not doing well with their business. Jig insults the circus and notably upsets Bucky who responds with violence. Before Bucky can hurt Jig too bad, they are interrupted by a stranger. The stranger is offering the two a lot of money for their circus. Jig does not feel comfortable with the stranger but is willing to set aside his uneasiness because they desperately need the money that the stranger is offering. They begin to listen to what the stranger is offering – a charter to their circus for money and negotiate details about monetary compensation. Gow interrupts their conversation to complain about Gertrude, a member of their circus, not acting right. When they let it slip that Gertrude is a cansin, an extremely rare animal, Beamish appears impressed by the news. Beamish agrees to the terms of the contract and leaves Bucky and Jig. \n\nOnce he leaves, Jig implies that they have to pay people back before they can enjoy a large amount of money they have come into. They return to the spaceport where Bucky’s Imperial Circus is lounging around, there are about twenty of them sitting there. While in the spaceport, Bucky expresses that he wants to go see Gertrude. Jig does not. They go down a dark hallway in search of Gertrude. Jig smells a sour and wild scent emanating in the area. They hear loud screaming and can sense that Gertrude is suffering because she cannot find someone to mate. Jig emphatically tells Gow that it is impossible because a male cansin has never been seen nor proven to exist. \n\nSoon chaos is let loose. Vapor snakes are somehow let out and Jig and Bucky attempt to run away. Bucky causes Jig to stumble and the snakes are able to get to them, burning them through their clothes. They pass out and wake up in a cell with injuries. Bucky says that someone had to have let the snakes out. He wants to know why someone wanted to kill them. They are unable to figure out who did it. Someone named Sam comes up to them and then they start running towards him because they realize they recognize him. They get Sam into a shack and ask him what happened. Sam is desperately trying to communicate that he found a male cansin and wants them to take it back. He then appears to pass out and they find Beamish standing behind a curtain. Jig notices that there is something unusual about the audience at the bar and tries to explain the situation. \n"
              },
              {
                "worker_id": "101",
                "uid": "876d8e6c28a04c49b25e1d72413c4be0",
                "response_text": "Bucky Shannon and Jig are the heads of Shannon's Imperial Circus, a circus that tours around space. They are sitting in a bar, defeated due to the lack of success in their circus. Bucky and Jig are out of money with their circus in pathetic condition. They are then interrupted by a small man who asks for Bucky, holding a large amount of money. Bucky introduces himself and Jig, and the man introduces himself as Beamish. Beamish has taken an interest in Shannon's Imperial Circus and offers to charter it, proposing that the circus make a tour on the settlements along the Tehara Belt, on Venus. Jig, not wanting to seem too desperate or reveal the state of the circus to Beamish, is hesitant at first, saying they would have to cancel on events. The three are interrupted by Gow, the circus' zoo-keeper, who informs Bucky that Gertrude, a Venusian cansin that is the star of the circus, is not doing well. Beamish is impressed at the presence of a cansin, given there is only one other animal of the species. Jig names a price of one hundred U.C's for Beamish to join the partnership. Though a large amount of money, Jig advises that it is reserved for the men they owe it to. Bucky and Jig return to the circus spaceport, where they meet a group of men and give them money, then proceed to beat the group of men up. Once inside, Bucky convinces Jig to see Gertrude with him, and once they see her, they notice that she is in terrible condition. Gow informs them that Gertrude wants a mate, which is practically impossible because there are only two known cansins. Jig tells Gow to do what he can to help Gertrude, as him and Bucky head to bed. Once they start to rest, they wake in a panic as the Vapor snakes attack them, having escaped in the night. Jig awakes, injured, and Bucky concludes that they have been sabotaged by whoever let the snakes out. They suspect Beamish as the culprit, but sign his contract anyway out of a need for money. They then go on their trip to Venus, stopping at Nahru and meeting with Beamish and the gang. On their way to a bar, they come across Sam Kapper, a hunter who supplies animals to attractions. Kapper is in visible pain. They take him into the bar, asking him what had happened. Kapper eventually tells them that he has found a male cansin, but before he can say where, he dies. Beamish is found to be listening in on the conversation."
              }
            ]
          },
          {
            "question_text": "What are Bucky's and Jig's attitudes towards their circus?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "105",
                "uid": "2c5add235d404c4f81bac16a7fd14cc0",
                "response_text": "Bucky, the owner, is of a rather idealistic opinion of the circus. He considers it great and he loves the participants as they are loyal and good. Jig is rather realistic, he knows the circus is broken and lousy, with Gertrude, the huge cansin, being the only worthy creature, though even she is old. Jig is also not that fond of many creatures, he sees them as ugly, some scary, some absurd. The state of Gertrude made Bucky cry, and soon he confessed that he actually knows that the circus is not great, but he loves it no matter what. Jig tried to be practical and asked Gow to snap Gertrude out of this state for the good of the circus. Nevertheless, even Jig was touched by the creature's appearance and gaze full of grief, her screams made him tremble. The Nahali woman, claiming to smell death, made Jig feel anxious and scared. Throughout the story Jig keeps feeling uneasy around the creatures and tries to avoid them, limiting the interactions to business. Bucky, at the same time, sympathizes with them and tries to get closer. "
              },
              {
                "worker_id": "106",
                "uid": "603f0ef947f64d9b8cd28845bb471455",
                "response_text": "Bucky and Jig's attitudes towards the cirsus are very different. Jig thinks over the circus as a dump. It is merely a means of staying afloat financially for him. The things of the performers as uncivilised, unintelligent and below him. He looks down upon their superstitions and beliefs. He hates the beasts that are used in the circus, as they somehow make him feel less human. He hates that the circus itself is run down, as they are broke. \nBucky on the other hand loves the circus. He thinks of the performers as family. It is his pride and joy and he is willing to fight anyone who says otherwise, including Jig. He checks up on Gertrude, clearly showing his affection for her. He knows that the circus is run down, but he loves it still. It's like his child. \n"
              },
              {
                "worker_id": "104",
                "uid": "833bf34190cd4adba351ef710d797d1c",
                "response_text": "Jig shouts at Bucky that he knows the circus is in a lousy and mangy state where nothing is working. He is not satisfied with the circus and believes that it “stinks”. Bucky also states that he does not believe the circus is doing well, though he is not happy when Jig agrees with these assertions enthusiastically. Gertrude is a member of their circus and they describe her as temperamental. While they do not believe the circus is doing well, they feel loyal to the members of their circus. Bucky relates to Jig that he is happy they have been loyal to him and he wants to reward them for that. Bucky loves the circus no matter how ugly or no good the members appear or act. "
              },
              {
                "worker_id": "101",
                "uid": "876d8e6c28a04c49b25e1d72413c4be0",
                "response_text": "Bucky and Jig have a soft spot for their circus, having run it for eleven years. Jig is aware of the state of the circus, with Bucky in slight denial but eventually accepting its condition. What once was the Greatest Show in Space has become a broken, unappealing attraction. However, due to the amount of time that Bucky and Jig have devoted to the circus, it is their only source of purpose and income. Despite the unhopeful state of the circus, they both try to remain optimistic about improving it, leading to their contract with Beamish and their concern over Gertrude. "
              }
            ]
          },
          {
            "question_text": "What happens to Jig throughout the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "105",
                "uid": "2c5add235d404c4f81bac16a7fd14cc0",
                "response_text": "Jig argues with Bucky, the owner of the circus, whose director is the former. Jig is drunk and is careless enough to insult the circus. He almost gets beaten when a stranger interferes. Jig feels pity towards his savior at first, but then he sees a sum of money in the man’s hands. Jig stops Bucky and the three of them begin to discuss business. Jig tries to show off the circus and asks for more money than it’s worth. He is suspicious of the man, but they make a deal. Then, Jig goes together with Bucky to pay the members of the gang and they have fun. After that, the two friends go to check on Gertrude, the main attraction. The creature’s depressing appearance makes Jig feel uneasy and pitiful, he has to carry Bucky, who is crying and falling asleep, away from the cage. Then both are attacked by Vapor snakes and Jig appears a hero by covering Bucky. He finds himself bitten all over and looking ridiculous, but at least alive. He encounters Bucky and they try to learn who wanted to kill them both. Then they go to Venus to meet Beamish, Jig feels the gang’s unhappiness with the travel, and he feels uneasy himself. The Nahali woman and her death predictions make him even more scared. Then they meet Sam who used to hunt animals for their circus, his terrible appearance makes Jig feel sick. Then together with Bucky, he tries to help the hunter by asking questions in the nearby bar. Jig feels even more scared and sick when Sam starts choking and his mouth gets blue. Jig wants to rush for a doctor, but finds Beamish listening behind the curtain. When Sam dies, Jig starts understanding and suspecting something, he talks to the bartender and suddenly recognizes the man who gave a cigarette to Sam.\n"
              },
              {
                "worker_id": "106",
                "uid": "603f0ef947f64d9b8cd28845bb471455",
                "response_text": "We hear the story from Jig’s perspective. We first meet Jig when he is talking with Bucky. He insults the circus to Bucky, and just as Bucky goes to give Jig a beating, they are met by Beamish. Jig tells Beamish that they will charter out their circus to him for 100 U.C's. Jig is really pushing his luck with this offer, ready to haggle, but Beamish agrees on the fee. When Bucky tries to take the money as soon as they get it, Beamish has to take it from him, giving it to the various men waiting outside to be paid. He and Bucky get into a fight with the men for having not played them in so long. Eventually, they all go home. He agrees to go see Gertrude with Bucky, which he hates. He looks at Gertrude, and can't help feeling sorry for her. He tries to carry Bucky back to their cells but they get attacked on the way. He awakens to Kanza the Martian Croaker. He talks briefly with Kanza before finding Bucky. They discuss who might've tried to assassinate them. They soon make the journey to Venus, where he is told by Ahra the Nahali woman that something has been taken from Venus, and death is coming. He sees Sam Kepper, and runs over to him when he falls. He brings him into the bar where Sam tells Jig that he has found a male cansin, and that Jig must return it to the wild for him. He walks over to the bar, where he talks with the bartender, and then turns around to see the man who gave Kepper the cigarette. "
              },
              {
                "worker_id": "104",
                "uid": "833bf34190cd4adba351ef710d797d1c",
                "response_text": "Jig is Bucky Shannon’s business manager and he is not always treated well by Bucky. Bucky likes to threaten Jig physically with violence. At the beginning of the story, Jig negotiates with Beamish about the terms of a contract for chartering Bucky’s circus. He is able to secure a high paycheck for himself and Bucky. After the meeting and when they receive the money, Jig goes to pay the members of the circus. \n\nWhile on the spaceport, Jig reluctantly goes with Bucky to see Gertrude who is in severe distress. Somehow, the vapor snakes are let out and they are coming after Jig and Bucky. Jig tries to run away to safety but he is tripped and pinned down by Bucky. This allows the vapor snakes to come and attack him which burn him through his clothes. He passes out due to this incident and wakes up in a cell with many injuries. \n\nLater, while on the planet Venus, Jig and Bucky run into Sam Kapper, someone they recognize. Sam tries to excitedly tell the two that there is a male cansin before he passes out and is perceived to be dead. Jig goes to pull back the curtains in the small area that they have been talking to Sam and finds Beamish hiding behind the curtains. He pulls the curtain back defiantly and walks to the bar to order a drink. During this walk, he notices that the audience for this situation is unusual. They looked out of place for the location and the setting. When he orders a drink and makes polite conversation, he sees a man that he had encountered earlier and realizes that he remember the man. \n"
              },
              {
                "worker_id": "101",
                "uid": "876d8e6c28a04c49b25e1d72413c4be0",
                "response_text": "Jig works with Bucky to run Shannon's Imperial Circus. At the beginning of this story, he talks with Bucky about his pessimism toward the circus and how hopeless the prospect is. He then meets Beamish, who offers to work with Bucky on conducting a Venusian tour of their circus. Jig decides to manipulate Beamish into thinking that the circus is more successful than it actually is, and manages to negotiate a large sum of one hundred U.C's ahead of the contract. Later that day, Jig returns to the circus with Bucky, where they pay men at the entrance before fighting them. Jig then sees Gertrude and heads to bed, where he is attacked by loose Vapor snakes. The next day, the contract is officially signed, and Jig travels to Venus, where he meets Sam Kapper at his first stop. "
              }
            ]
          },
          {
            "question_text": "What is the significance of Jig and Bucky meeting Beamish on the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "105",
                "uid": "2c5add235d404c4f81bac16a7fd14cc0",
                "response_text": "The first encounter between Beamish and the two occurred when Jig and Bucky were at the point of a fight. Beamish prevented them from this unnecessary action, and soon he saved the circus. The circus was broke, the performers were discontent with not getting their bills, the construction was loose, etc. There would be no tour and existence of the circus overall without this encounter. Being able to pay the gang, Jig and Bucky could show up without being afraid or ashamed to show up in their circus and keep doing business. This encounter was also somehow connected with the attempt to kill the two by letting the vapor snakes out. The trip to Venus in the end was also caused by this encounter, as it was the place where Beamish awaited for his partners and the gang. Therefore, he was somehow connected with them meeting Sam, a hunter supplying animals for the circus, and his eventual weird death. Beamish listening to their dialogue and overall investing in a broke circus creates a suspicion of his actions having some hidden reason. Together with the unhappiness of the gang and one creature smelling death, Beamish's unclear intentions seem scheming and threatening, adding to the intrigue of the whole story. "
              },
              {
                "worker_id": "106",
                "uid": "603f0ef947f64d9b8cd28845bb471455",
                "response_text": "The meeting of Jig, Bucky and Beamish is very significant in the story. When we meet Jig and Bucky, they are in deep financial trouble. They have absolutely no money at all. When they are approached by Beamish, Jig can tell that there's something strange about him. He seems to have no emotion at all in his face. Beamish offers to charter out their circus for 100 U.C's. It's unclear where Beamish's money comes from. Because they get the money, the duo are finally able to pay back the men that they have been avoiding for weeks. They take the ship to Venus, where they hope this trip will help them escape financial ruin. Because they are in Venus, they are able to meet Kepper, who tells them about the stolen cansin. \n"
              },
              {
                "worker_id": "104",
                "uid": "833bf34190cd4adba351ef710d797d1c",
                "response_text": "Beamish’s entrance was a welcome interruption to Jig because it distracted and stopped Bucky from hitting him. Beamish is wanting to offer Bucky and Jig money to charter their circus for a tour of different settlements along the Tehara Belt. They would have never gone to Venus if not by the order of Beamish and thus they never would have met up with Sam as they did in the story. It is significant that they meet Beamish because according to the same Beamish is a male cansin and previously Bucky and Jig did not believe they existed anymore. "
              },
              {
                "worker_id": "101",
                "uid": "876d8e6c28a04c49b25e1d72413c4be0",
                "response_text": "Beamish gives Jig and Bucky a new opportunity for their circus. Before meeting Beamish, they were out of luck, their circus in lousy condition and no money to live off of or improve their attraction. However, when Beamish comes into the picture, they are offered a new chance to showcase their circus. Though the offer is a bit shady and not completely promising, Bucky and Jig prefer it over their current situation. Taking up Beamish's offer leads Bucky and Jig to a new tour on Venus."
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "105",
                "uid": "2c5add235d404c4f81bac16a7fd14cc0",
                "response_text": "The story begins in the middle of some bar or club with a girl playing piano and drinks being served. When Beamish joined them, the three moved to a booth - a quieter place there. After the conversation, Jig and Bucky go to circus. At first, they meet the whole gang, coming through the main entrance. Then they move to the tank of a huge special creature, Gertrude, which is located a bit afar. On the way back home, outside the tank, the two were attacked by snakes. They woke up in different rooms, taken care of by Kanza the Martian croaker after being bitten by snakes and brought there by Gow, a member of the circus gang. Very soon they all together with the gang set off to Venus on a space ship to meet Beamish. On Venus the gang walked towards a local bar and the story ends there. "
              },
              {
                "worker_id": "106",
                "uid": "603f0ef947f64d9b8cd28845bb471455",
                "response_text": "The story takes place on multiple planets. The story first begins when Jig and Bucky are in a bar, on Mars. It is where their ship, which holds \"Shannon's Imperial Circus\" is stationed. It is being kept in the spaceport. Mars is described as desertlike, and cold. It has an odd smell to it, like something that was once rotten is now dried up. There is red dust everywhere. There are two moon which hang in the sky. The tank in which they keep Gertrude is dark. All the bests of the performance stay there. It is as quiet as the grave. There is a ladder to climb down to get into the tank. Inside, there are rows of cages and glass tanks which hold the beasts. Jig and Bucky each have their own cells on the ship. The story then moves to Venus, where the terrain in jungle. The mud is blue and the rainy green jungle is tick. It's very hot. There are various small shacks that are dotted around. they go into one shack which turns out to be a rundown bar. there are booths in the back which are curtained off for privacy. "
              },
              {
                "worker_id": "104",
                "uid": "833bf34190cd4adba351ef710d797d1c",
                "response_text": "At the beginning of the story, they are on Mars which is described as having a smell of decay. Bucky Shannon and Jig are sitting around at a table in an establishment. When Beamish enters the story, they move to a curtained booth for more privacy. Once Beamish leaves, the two go back to their spaceport that is in bad shape. Bucky’s Imperial Circus was lounging underneath the spaceport’s attachments. It is late at night when they return to the spaceport. \n\nWhen the two go to see Gertrude, they walk down a long passageway that is riddled with cages, tanks, and compression units. The floor is made of iron and causes footsteps to be amplified. \n\nAfter the situation with the vapor snakes, they head towards Venus and stop first stop at Nahru. Venus is described as having unbearable steamy heat. \n"
              },
              {
                "worker_id": "101",
                "uid": "876d8e6c28a04c49b25e1d72413c4be0",
                "response_text": "The first part of the story takes place in a dark bar on Mars, where Bucky and Jig sit among groups of people. After meeting Beamish, they return to their circus, kept in a spaceport. Inside their ship, they have a tank where they keep their zoo animals, including Gertrude. The tank is dark, cramped, and smelly, which does not appeal to Jig. After being attacked by the snakes, Jig awakes in his own cell, and the ship takes off to Venus. They land in Nahru, a swampy place with blue mud and a large thick jungle. The end of the story takes place in a small, shack-like bar in Nahru."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5046,
        "document_length_chars": 28021
      }
    }
  ]
}