{
  "item_metadata": {
    "item_id": "62619",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "62619",
      "content": "THE AVENGER\n \n\n By STUART FLEMING\n \n \n Karson was creating a superman to fight the weird super-monsters who had invaded Earth. But he was forgetting one tiny thing—like calls to like.\n \n [Transcriber's Note: This etext was produced from Planet Stories Spring 1944. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n Peter Karson was dead. He had been dead for some time now, but the dark blood was still oozing from the crushed ruin of his face, trickling down into his sodden sleeve, and falling, drop by slow drop, from his fingertips. His head was tilted over the back of the chair at a queer, unnatural angle, so that the light made deep pools of shadow where his eyes had been.\n \n  There was no sound in the room except for the small splashing the blood made as it dropped into the sticky pool on the floor. The great banks of machinery around the walls were silent. I knew that they would never come to life again.\n \n  I rose and walked over to the window. Outside, the stars were as before: tiny, myriad points of light, infinitely far away. They had not changed, and yet they were suddenly no longer friendly. They were cold and alien. It was I who had changed: something inside me was dead, like the machinery, and like Peter.\n \n  It was a kind of indefinable emptiness. I do not think it was what Peter called an emotion; and yet it had nothing to do with logic, either. It was just an emptiness—a void that could not be filled by eating or drinking.\n \n  It was not a longing. I had no desire that things should be otherwise than they were. I did not even wish that Peter were not dead, for reason had told me that he had to die. That was the end of it.\n \n  But the void was still there, unexplainable and impossible to ignore. For the first time in all my life I had found a problem that I could not solve. Strange, disturbing sensations stirred and whispered within me, nagging, gnawing. And suddenly—something moved on the skin of my cheek. I raised a hand to it, slowly.\n \n  A tear was trickling down my cheek.\n \n \n \n\n \n Young Peter Karson put the last black-print down and sighed with satisfaction. His dream was perfect; the Citadel was complete, every minutest detail provided for—on paper. In two weeks they would be laying the core, and then the metal giant itself would begin to grow, glittering, pulsing with each increment of power, until at last it lay finished, a living thing.\n \n Then there would remain only the task of blasting the great, shining ship out into the carefully-calculated orbit that would be its home. In his mind's eye he could see it, slowly wheeling, like a second satellite, about the Earth; endlessly gathering knowledge into its insatiable mechanisms. He could see, too, the level on level of laboratories and storerooms that filled its interlocking segments; the meteor deflectors, the air renewal system, the mighty engines at the stern—all the children of his brain.\n \n Out there, away from the muffling, distorting, damnable blanket of atmosphere, away from Earth's inexorable gravitational pull, would be a laboratory such as man had never seen. The ship would be filled with the sounds of busy men and women, wresting secrets from the reluctant ether. A new chemistry, a new physics; perhaps even a new biochemistry.\n \n A discordant note suddenly entered his fantasy. He looked up, conscious of the walls of his office again, but could see nothing unusual. Still, that thin, dark whisper of dread was at the back of his mind. Slowly, as if reluctantly compelled, he turned around to face the window at his back.\n \n There, outside the window, fifty stories up, a face was staring impassively in at him. That was the first impression he got; just a face, staring. Then he saw, with a queer, icy chill, that the face was blood-red and subtly inhuman. It tapered off into a formless, shriveled body.\n \n For a moment or an eternity it hung there, unsupported, the bulging eyes staring at him. Then it grew misty at the edges. It dissolved slowly away and was gone.\n \n \"Lord!\" he said.\n \n He stared after it, stunned into immobility. Down in the street somewhere, a portable video was shrilling a popular song; after a moment he heard the faint swish of a tube car going past. Everything was normal. Nothing, on examination, seemed to have changed. But the world had grown suddenly unreal.\n \n One part of his brain had been shocked into its shell. It was hiding from the thing that had hurt it, and it refused to respond. But the other part was going calmly, lucidly on, quite without his volition. It considered the possibility that he had gone temporarily insane, and decided that this was probable.\n \n Hardly knowing what he did, he found a cigarette and lit it. His hands were shaking. He stared at them dully, and then he reached over to the newsbox on his desk, and switched it on.\n \n There were flaring red headlines.\n \n Relief washed over him, leaving him breathless. He was horrified, of course, but only abstractedly. For the moment he could only be glad that what he had seen was terrible reality rather than even more terrible illusion.\n \n \n INVADERS APPEAR IN BOSTON. 200 DEAD\n \n Then lines of type, and farther down:\n \n \n 50 CHILDREN DISAPPEAR FROM PARIS MATERNITY CENTER\n \n He pressed the stud. The roll was full of them.\n \n \n MOON SHIP DESTROYED IN TRANSIT NO COMMUNICATION FROM ANTARCTICA IN 6 HOURS STRANGE FORCE DEFLECTS PLANES FROM SAHARA AREA WORLD POLICE MOBILIZING\n \n The item below the last one said:\n \n Pacifica, June 7—The World Police are mobilizing, for the first time in fifty years. The order was made public early this morning by R. Stein, Secretary of the Council, who said in part:\n \n \"The reason for this ... order must be apparent to all civilized peoples. For the Invaders have spared no part of this planet in their depredations: they have laid Hong Kong waste; they have terrorized London; they have destroyed the lives of citizens in every member state and in every inhabited area. There can be few within reach of printed reports or my words who have not seen the Invaders, or whose friends have not seen them.\n \n \"The peoples of the world, then, know what they are, and know that we face the most momentous struggle in our history. We face an enemy superior to ourselves in every way .\n \n \"Since the Invaders first appeared in Wood River, Oregon, 24 hours ago, they have not once acknowledged our attempts to communicate, or in any way taken notice of our existence as reasoning beings. They have treated us precisely as we, in less enlightened days, might have treated a newly-discovered race of lower animals. They have not attacked our centers of government, nor immobilized our communications, nor laid siege to our defenses. But in instance after instance, they have done as they would with us. They have examined us, dissected us, driven us mad, killed us with no discernable provocation; and this is more intolerable than any normal invasion.\n \n \"I have no fear that the people of Earth will fail to meet this challenge, for there is no alternative. Not only our individual lives are threatened, but our existence as a race. We must, and will, destroy the Invaders!\"\n \n Peter sank back in his chair, the full shock of it striking him for the first time.\n \n \" Will we?\" he asked himself softly.\n \n \n\n \n It was only two stories down the moving ramp to Lorelei Cooper's laboratory. Peter took it in fifteen seconds, running, and stumbled to a halt in front of the door marked \"Radiation.\" She had set her door mechanism to \"Etaoin Shrdlu,\" principally because he hated double-talk. He mouthed the syllables, had to repeat them because he put an accent in the wrong place, and squeezed through the door as soon as it opened far enough to admit him.\n \n Lorelei, beautiful in spite of dark-circled eyes and a smear of grease on her chin, looked up from a huge ledger at the end of the room. One blonde eyebrow arched in the quizzical expression he knew so well.\n \n \"What makes, Peter my love?\" she asked, and bent back to the ledger. Then she did a double-take, looked at his face intently, and said,\n\"Darling, what's wrong?\"\n \n He said, \"Have you seen the news recently?\"\n \n She frowned. \"Why, no—Harry and I have been working for thirty-six hours straight. Haven't seen anybody, haven't heard anything. Why?\"\n \n \"You wouldn't believe me. Where's your newsbox?\"\n \n She came around the desk and put her hands on his shoulders. \"Pete, you know I haven't one—it bores me or upsets me, depending on whether there's trouble or not. What—\"\n \n \"I'm sorry, I forgot,\" he said. \"But you have a scanner?\"\n \n \"Yes, of course. But really, Pete—\"\n \n \"You'll understand in a minute. Turn it on, Lorelei.\"\n \n She gazed at him levelly for a moment, kissed him impulsively, and then walked over to the video panel on the wall and swept a mountain of papers away from in front of it. She turned the selector dial to \"News\" and pressed the stud.\n \n A faint wash of color appeared on the panel, strengthened slowly, and suddenly leapt into full brilliance.\n \n Lorelei caught her breath.\n \n It was a street scene in the Science City of Manhattan, flooded by the warm spring sunshine. Down on the lowest level, visible past the transport and passenger tubes, the parks and moving ways should have been dotted with colorful, holiday crowds. The people were there, yes but they were flowing away in a swiftly-widening circle. They disappeared into buildings, and the ways snatched them up, and in a heartbeat they were gone.\n \n There were left only two blood-red, malignant monstrosities somehow defiling the air they floated in; and below them, a pitiful huddle of flesh no longer recognizable as human beings. They were not dead, those men and women, but they wanted to be. Their bodies had been impossibly joined, fused together into a single obscene, floundering mass of helpless protoplasm. The thin moaning that went up from them was more horrible than any cry of agony.\n \n \"The Invaders are here, citizens,\" the commentator was saying in a strangled voice. \"Stay off the streets. Hide yourselves. Stay off the streets....\" His voice droned on, but neither of them heard it.\n \n \n\n \n Lorelei buried her head on his chest, clutching at him desperately.\n\"Peter!\" she said faintly. \"Why do they broadcast such things?\"\n \n \"They have to,\" he told her grimly. \"There will be panics and suicides, and they know it; but they have to do it. This isn't like a war, where the noncombatants' morale has to be kept up. There aren't going to be any noncombatants, this time. Everybody in the world has to know about them, so that he can fight them—and then it may not be enough.\"\n \n The viewpoint of the teleo sender changed as the two red beings soared away from their victims and angled slowly up the street. Peter reached out to switch off the scanner, and froze. The girl felt his muscles tense abruptly, looked back at the scene. The Invaders were floating up the sloping side of a tall, pure white structure that dominated the rest.\n \n \"That's the Atlas building,\" she said unbelievingly. \"Us!\"\n \n \"Yes.\"\n \n Silently, they counted stories as the two beings rose. Forty-five ... forty-six ... forty-seven ... forty-eight. Inevitably, they halted. Then they faded slowly. It was impossible to say whether they had gone through the solid wall, or simply melted away.\n \n The man and woman clung together, waiting.\n \n There was a thick, oppressive silence, full of small rustlings and other faint sounds that were no longer normal. Then, very near, a man screamed in a high, inhuman voice. The screamed dwindled into a throaty gurgle and died, leaving silence again.\n \n Peter's lips were cold with sweat. Tiny nerves in his face and arms were jumping convulsively. His stomach crawled. He thrust the girl away from him and started toward the inner room.\n \n \"Wait here,\" he mouthed.\n \n She was after him, clinging to his arms. \"No, Peter! Don't go in there! Peter! \" But he pushed her away again, woodenly, and stalked forward.\n \n There was a space in the middle of the room where machinery had been cleared away to make room for an incompleted setup. Peter walked down the narrow aisle, past bakelite-sheathed mechanisms and rows of animal cages, and paused just short of it.\n \n The two red beings were there, formless bodies hazy in midair, the distorted, hairless skulls in profile, staring at something outside his range of vision.\n \n \n\n \n Peter forced himself forward another step. Little Harry Kanin, Lorelei's assistant, was crumpled in a corner, half supported by the broad base of an X-ray chamber. His face was flaccid and bloated. His glazed eyes, impassive yet somehow pleading, stared at nothingness straight ahead of him.\n \n The Invaders ignored Peter, staring expressionlessly down at Kanin. In a moment Peter realized what they were doing to him. He stood, paralyzed with horror, and watched it happen.\n \n The little man's body was sagging, ever so slowly, as if he were relaxing tiredly. His torso was telescoping, bit by bit; his spread legs grew wider and more shapeless, his cheeks caved in and his skull grew gradually flatter.\n \n When it was over, the thing that had been Kanin was a limp, boneless puddle of flesh. Peter could not look at it.\n \n There was a scream in his throat that would not come out. He was beyond fear, beyond agony. He turned to the still-hovering monsters and said in a terrible voice, \"Why? Why?\"\n \n The nearest being turned slowly to regard him. Its lips did not move, but there was a tiny sound in Peter's brain, a thin, dry whispering.\n \n The scream was welling up. He fought it down and listened.\n \n \" Wurnkomellilonasendiktolsasangkanmiamiamimami.... \"\n \n The face was staring directly into his, the bulging eyes hypnotic. The ears were small, no more than excresences of skin. The narrow lips seemed sealed together; a thin, slimy ichor drooled from them. There were lines in the face, but they were lines of age, not emotion. Only the eyes were alive.\n \n \" ... raswilopreatadvuonistuwurncchtusanlgkelglawwalinom.... \"\n \n \"I can't understand,\" he cried wildly. \"What do you want?\"\n \n \" ... morofelcovisyanmamiwurlectaunntous. \"\n \n He heard a faint sound behind him, and whirled. It was the first time he had realized that Lorelei had followed him. She stood there, swaying, very pale, looking at the red Invaders. Her eyes swiveled slowly....\n \n \" Opreniktoulestritifenrelngetnaktwiltoctpre. \"\n \n His voice was hoarse. \"Don't look! Don't—Go back!\" The horrible, mindless noise in his throat was almost beyond his power to repress. His insides writhed to thrust it out.\n \n She didn't see him. Her eyes glazed, and she dropped limply to the floor.\n \n The scream came out then. Before he knew, even, that he could hold it back no longer, his mouth was wide open, his muscles tensed, his fingernails slicing his palms. It echoed with unbelievable volume in the room. It was a scream to split eardrums; a scream to wake the dead.\n \n \n\n \n Somebody said, \"Doctor!\"\n \n He wanted to say, \"Yes, get a doctor. Lorelei—\" but his mouth only twitched feebly. He couldn't seem to get it to work properly.\n \n He tried again. \"Doctor.\"\n \n \"Yes?\" A gentle, masculine voice.\n \n He opened his eyes with an effort. There was a blurred face before him; in a moment it grew clearer. The strong, clean-shaven chin contrasted oddly with the haggard circles under the eyes. There was a clean, starched odor.\n \n \"Where am I?\" he said. He tried to turn his head, but a firm hand pressed him back into the sheets.\n \n \"You're in a hospital. Just lie quietly, please.\"\n \n He tried to get up again. \"Where's Lorelei?\"\n \n \"She's well, and you'll see her soon. Now lie quietly. You've been a very sick man.\"\n \n Peter sank back in the bed. The room was coming into focus. He looked around him slowly. He felt very weak, but perfectly lucid.\n \n \"Yes....\" he said. \"How long have I been here, Doctor?\"\n \n The man hesitated, looked at him intently. \"Three months,\" he said. He turned and gave low-voiced instructions to a nurse, and then went away.\n \n Peter's head began spinning just a little. Glass clinked from a metal stand near his head; the nurse bent over him with a glass half full of milky fluid. It tasted awful, but she made him drink it all.\n \n In a moment he began to relax, and the room got fuzzy again. Just before he drifted off, he said sleepily, \"You can't—fool me. It's been more —than three—months.\"\n \n He was right. All the nurses, and even Dr. Arnold, were evasive, but he kept asking them why he couldn't see Lorelei, and finally he wormed it out of them. It had been nine and a half months, not three, and he'd been in a coma all that time. Lorelei, it seemed, had recovered much sooner.\n \n \"She was only suffering from ordinary shock,\" Arnold explained.\n\"Seeing that assistant of hers—it was enough to knock anybody out, especially a woman. But you stood actual mental contact with them for approximately five minutes. Yes, we know—you talked a lot. It's a miracle you're alive, and rational.\"\n \n \"But where is she?\" Peter complained. \"You still haven't explained why I haven't been able to see her.\"\n \n Arnold frowned. \"All right,\" he said. \"I guess you're strong enough to take it. She's underground, with the rest of the women and children, and a good two-thirds of the male population. That's where you'll go, as soon as you're well enough to be moved. We started digging in six months ago.\"\n \n \"But why?\" Peter whispered.\n \n Arnold's strong jaw knotted. \"We're hiding,\" he said. \"Everything else has failed.\"\n \n Peter couldn't think of anything to say. Dr. Arnold's voice went on after a moment, musingly. \"We're burrowing into the earth, like worms. It didn't take us long to find out we couldn't kill them. They didn't even take any notice of our attempts to do so, except once. That was when a squadron of the Police caught about fifty of them together at one time, and attacked with flame guns and a new secret weapon. It didn't hurt them, but it annoyed them. It was the first time they'd been annoyed, I think. They blew up half a state, and it's still smoldering.\"\n \n \"And since then?\" Peter asked huskily.\n \n \"Since then, we've been burrowing. All the big cities.... It would be an impossible task if we tried to include all the thinly-populated areas, of course, but it doesn't matter. By the time we excavate enough to take care of a quarter of the earth's population, the other three-quarters will be dead, or worse.\"\n \n \"I wonder,\" Peter said shakily, \"if I am strong enough to take it.\"\n \n Arnold laughed harshly. \"You are. You've got to be. You're part of our last hope, you see.\"\n \n \"Our last hope?\"\n \n \"Yes. You're a scientist.\"\n \n \"I see,\" said Peter. And for the first time, he thought of the Citadel . No plan leaped full-born into his mind, but, maybe , he thought, there's a chance ....\n \n \n\n \n It wasn't very big, the thing that had been his shining dream. It lay there in its rough cradle, a globe of raw dura-steel not more than five hundred meters in diameter, where the Citadel was to have been a thousand. It wouldn't house a hundred scientists, eagerly delving into the hinterland of research. The huge compartments weren't filled with the latest equipment for chemical and physical experiment; instead, there was compressed oxygen there, and concentrated food, enough to last a lifetime.\n \n It was a new world, all by itself; or else it was a tomb. And there was one other change, one that you couldn't see from the outside. The solid meters of lead in its outer skin, the shielding to keep out cosmic rays, were gone.\n \n A man had just finished engraving the final stroke on its nameplate, to the left of the airlock— The Avenger . He stepped away now, and joined the group a little distance away, silently waiting.\n \n Lorelei said, \"You can't do it. I won't let you! Peter—\"\n \n \"Darling,\" he began wearily.\n \n \"Don't throw your life away! Give us time—there must be another way.\"\n \n \"There's no other way,\" Peter said. He gripped her arms tightly, as if he could compel her to understand by the sheer pressure of his fingers.\n\"Darling, listen to me. We've tried everything. We've gone underground, but that's only delaying the end. They still come down here, only not as many. The mortality rate is up, the suicide rate is up, the birth rate is down, in spite of anything we can do. You've seen the figures: we're riding a curve that ends in extinction fifty years from now.\n \n \"They'll live, and we'll die, because they're a superior race. We're a million years too far back even to understand what they are or where they came from. Besides them, we're apes. There's only one answer.\"\n \n She was crying now, silently, with great racking sobs that shook her slender body. But he went remorselessly on.\n \n \"Out there, in space, the cosmics change unshielded life. They make tentacles out of arms; or scales out of hair; or twelve toes, or a dozen ears—or a better brain. Out of those millions of possible mutations, there's one that will save the human race. We can't fight them , but a superman could. That's our only chance. Lorelei—darling—don't you see that?\"\n \n She choked, \"But why can't you take me along?\"\n \n He stared unseeingly past her wet, upturned face. \"You know why,\" he said bitterly. \"Those rays are strong. They don't only work on embryos; they change adult life forms, too. I have one chance in seven of staying alive. You'd have one chance in a million of staying beautiful. I couldn't stand that. I'd kill myself, and then humanity would die, too. You'd be their murderer.\"\n \n Her sobs gradually died away. She straightened slowly until he no longer had to support her, but all the vitality and resilience was gone out of her body. \"All right,\" she said in a lifeless voice. \"You'll come back, Peter.\"\n \n He turned away suddenly, not trusting himself to kiss her goodbye. A line from an old film kept echoing through his head. \" They'll come back—but not as boys !\"\n \n We'll come back, but not as men.\n \n We'll come back, but not as elephants.\n \n We'll come back, but not as octopi.\n \n \n\n \n He was trembling violently. He ran the last few steps, stumbled into the airlock, and pressed the stud that would seal the door behind him. We'll come back.... He heard the massive disk sink home, closing him off. Then he sank down on the floor of the airlock and put his head in shaking hands.\n \n After a while he roused himself, closed the inner door of the lock behind him, and walked down the long corridor into the control chamber. The shining banks of keys were there, waiting for his touch; he slumped down before them and listlessly closed the contact of the visiplate.\n \n He swung its field slowly, scanning for the last time the bare walls of the underground chamber, making sure that all the spectators had retired out of the way of the blast. Then his clawed fingers poised over the keys, hovered a moment, and thrust down.\n \n Acceleration pressed him deep into his chair. In the visiplate, the heavy doors that closed the tunnel above him flashed back, one by one. The energy-charged screen flickered off to let him pass, and closed smoothly behind him. The last doors, cleverly camouflaged, slipped back into place and then dwindled in the distance. It was done.\n \n He flashed on out, past the moon, past Mars, over the asteroid belt. The days merged into weeks, then months, and finally, far out, The Avenger curved into an orbit and held it. The great motors died, and the silence pressed in about him.\n \n Already he could feel the invisible rays burning resistlessly through his flesh as if it were water, shifting the cells of his body, working its slow, monstrous alchemy upon him. Peter waited until the changes were unmistakably evident in his skin and hair, and then he smashed all the mirrors in the ship.\n \n The embryos were pulsing with unnatural life, even in the suspended animation of their crystal cells. One by one he allowed them to mature, and after weeks or years destroyed the monstrosities that came from the incubators. Time went by, meaninglessly. He ate when he was hungry, slept when his driving purpose let him, and worked unceasingly, searching for the million-to-one chance.\n \n He stared sometimes through changed eyes at the tiny blue star that was Earth, wondering if the race he had left behind still burrowed in its worm-tunnels, digging deeper and deeper away from the sunlight. But after a time he ceased even to wonder.\n \n And one changeling-child he did not destroy. He fed knowledge to its eager brain, and watched it through the swift years, with a dawning hope....\n \n \n\n \n Peter closed the diary. \"The rest you know, Robert,\" he said.\n \n \"Yes,\" I told him. \"I was that child. I am the millionth mutation you were searching for.\"\n \n His eyes glowed suddenly in their misshapen sockets. \"You are. Your brain is as superior to mine as mine is to an anthropoid's. You solve instinctively problems that would take our mechanical computers hours of work. You are a superman.\"\n \n \"I am without your imperfections,\" I said, flexing my arms.\n \n He rose and strode nervously over to the window. I watched him as he stood there, outlined against the blazing galaxies. He had changed but little in the years that I had known him. His lank gray hair straggled over his sunken eyes; his cheeks were blobbed with excresences of flesh; one corner of his mouth was drawn up in a perpetual grin. He had a tiny sixth finger on his left hand.\n \n He turned again, and I saw the old scar on his cheek where I had once accidentally drawn one of my talons across his face.\n \n \"And now,\" he said softly, \"we will go home. I've waited so long—keeping the control chamber and the engine room locked away from you, not telling you, even, about Earth until now—because I had to be sure. But now, the waiting is over.\n \n \"They're still there, I'm sure of it—the people, and the Invaders. You can kill the Invaders, Robert.\"\n \n He looked at me, a little oddly, almost as if he had some instinctive knowledge of what was to come. But he went on swiftly, \"On Earth we had a saying: 'Fight fire with fire.' That is the way it will be with you. You are completely, coldly logical, just as they are. You can understand them, and so you can conquer them.\"\n \n I said, \"That is the reason why we will not go back to Earth.\"\n \n He stared at me, his jaw slack, his hands trembling. \"What—what did you say?\"\n \n I repeated it patiently.\n \n \"But why?\" he cried, sinking down into the chair before me. In an instant all the joy had gone out of him. I could not understand his suffering, but I could recognize it.\n \n \"You yourself have said it,\" I told him. \"I am a being of logic, just as the beings who have invaded your planet are. I do not comprehend the things which you call hate, fear, joy and love, as they do not. If I went to Earth, I would use your people to further my knowledge, just as the invaders do. I would have no reason to kill the invaders. They are more nearly kin to me than your people.\"\n \n \n\n \n Peter's eyes were dull, his limbs slumped. For a moment I thought that the shock had deranged his mind.\n \n His voice trembled when he said, \"But if I ask you to kill them, and not my people?\"\n \n \"To do so would be illogical.\"\n \n He waved his hands helplessly. \"Gratitude?\" he muttered.\n \n \"No, you don't understand that, either.\"\n \n Then he cried suddenly, \"But I am your friend, Robert!\"\n \n \"I do not understand 'friend,'\" I said.\n \n I did understand \"gratitude,\" a little. It was a reciprocal arrangement: I did what Peter wished, so long as I did not actively want to do otherwise, because he had done things for me. Very well, then we must not go back. It was very simple, but I knew that he could not comprehend it.\n \n I tried to explain it to him, however. But he only stared at me, with an expression on his face that I had never seen there before, and that, somehow, I did not like to see. It was disquieting, and so I hastened to the end that I knew was inevitable.",
      "metadata": {
        "title": "The Avenger",
        "author": "Stuart Fleming",
        "passage_id": "62619",
        "uid": "384bebda025848fbb1babfd3dfa1def2",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "107",
                "uid": "68b25a55ece94644acbc50b3905aa760",
                "response_text": "Peter Karson has finished planning out the blueprint for the Citadel. He is excited to see it be built and go off into space to collect new information. Something suddenly snaps him out of his fantasy. Fifty stories above the window, there is a blood-red and subtly inhuman face staring back at him. The face slowly disappears, but he is stunned by the image. He then shakingly lights a cigarette and turns on the newsbox to see that an invader has appeared in Boston. More disasters are listed below, and the World Police announces that the Invaders have already begun terrorizing the world since they appeared twenty-four hours ago. Peter is doubtful that they can take down the Invaders and goes to Lorelei Cooper’s laboratory. Lorelei does not know what is happening because Harry and she have been working for thirty-six hours straight. She does not have a newsbox, but he tells her to turn on her scanner to see the news. The panel shows the Science City of Manhattan, but the Invaders have come and snatched up men and women. Slowly, two Invaders make their way to the Atlas building, where Peter and Lorelei are. He goes into the inner room, even though she yells at him not to go. The Invaders have reduced Harry to nothing but a puddle of flesh, and Peter begins to ask why they are doing this desperately. They whisper to him in a strange language; he suddenly realizes that Lorelei has followed him. She drops to the floor after looking at the Invaders, which makes Peter scream. When he awakes again, a doctor named Arnold tells him to lie back down and that he is in a hospital. Although Dr. Arnold initially tells him that he has been in the hospital for three months, he eventually finds out that it has already been nine and a half months since he went into his coma. All of the survivors are underground because nobody knew how to kill the Invaders. Peter is considered their last hope because he is a scientist, and he thinks back to his plan of the Citadel. The ship is built, and it is called The Avenger instead. Lorelei tries to plead with Peter, but he refuses and says that it must be him who finds a superman that can destroy the Invaders. He goes into space until the ship curves into orbit. Peter kills many of the changeling children, but he allows one to live. The child is named Robert and is considered to be a super-intelligent being. Peter is hopeful that the changeling can kill the Invaders, but Robert says he will not return to Earth. He explains that they are like kin to him, and he logically has no reason to kill him. Peter is shocked and tries to plead with Robert, but the superman does not understand emotions. Robert does not feel good about the expression on Peter’s face, and he hastens to an inevitable end. "
              },
              {
                "worker_id": "105",
                "uid": "13e4195812ae4aaf9e3dc2e204c88832",
                "response_text": "Blood is dripping from a dead body in the room, Peter Karson. The story moves to the past, when young Peter finished the project of 'Citadel' - a spaceship to set off to an orbit. 'Citadel' was supposed to be a huge well-equipped laboratory, the first of its kind. While imagining the greatness of the creation, Peter felt dread and saw a face staring at him outside the window, fifty stories up. The face was scary and inhuman, the body hung without support for a while and then disappeared. Everything around was normal and Peter was worried he had gone mad. Then he saw the red headlines in the newspapers about appearing invaders and disappearing people. Cities worldwide were attacked and the World Police were mobilizing. The news proclaimed that the greatest enemy was to be faced and defeated. Peter rushed downstairs to Lorelei's laboratory, who had been working without breaks and hadn't seen the news. After Peter's agonized pleas, Lorelei turned on the news and saw a video of people becoming an unrecognizable joined mass, helpless and suffering. Then the two saw their own building in the news and halted. Peter went towards the inner room despite Lorelei's protests. He saw two aliens staring at Harry, Lorelei's assistant, and turning him into a boneless mess. Peter was so shocked that he screamed \"why?\" and heard some incomprehensible whisper in his head in response. Suddenly, Peter saw that Lorelei had followed him and her body dropped to the floor. Peter screamed inhumanely loudly and faded. He woke up in a hospital, the doctor said he had been very sick for three months and that Lorelei was fine. When Peter kept asking, he finally learned that he had been in a coma for more than nine months because of the rather long contact he had had with the invaders. Lorelei was simply shocked and recovered much faster. Arnold, the doctor, finally decided that Peter was strong enough to learn the truth and told about the part of humanity hiding underground as killing the aliens turned out to be impossible. Peter was needed as a scientist. His 'Citadel' project contained everything necessary to live a lifetime, it was a new independent world to save the rest of humanity. So, it was renamed 'The Avenger' and finished, as life underground was not a solution but a delay. Lorelei was in despair because of Peter boarding the ship and wanted to follow, but the rays were strong and even Peter had low chances of staying alive. When 'The Avenger' reached orbit, Peter felt the rays burning his flesh and smashed the mirrors to allow the embryos to mature. After a long time Peter told the story to Robert, the mutation-child with a superior brain who could destroy the invaders. Robert refused to go to Earth as his brain was logical and saw no reasons to destroy the Invaders. Peter didn't understand and the inevitable end approached. "
              },
              {
                "worker_id": "101",
                "uid": "4991ed96ed744108a19c0d35dc2b278d",
                "response_text": "The story opens with the character Peter Karson dead, as the narrator, identity unknown, contemplates their emptiness after killing him. The narrator says that they do not regret doing so, but they are unable to explain their emotions as they feel a tear rolling down their cheek. The story then goes back to a younger Peter as he finishes his project, the development of the Citadel spaceship. He suddenly hears a strange whisper within his brain, and he turns around to see a face with a shriveled body staring at him through the window. The creature slowly dissolves and disappears, and Peter is left stunned. He finds breaking news of invasions all over the world, murdering hundreds of civilians. The invaders, according to Secretary of the Council, are from outer space, and the World Police is attempting to destroy them. Peter rushes downstairs to find Lorelei, his lover, in the laboratory. She is unaware of the news, and upon seeing footage of the gruesome attacks, she is shocked, and they soon see the invaders approaching their building from the television. Peter steps into another room, seeing the two creatures with their focus on Harry Kanin, Lorelei's assistant. To Peter's horror, Harry quickly becomes a limp pile of flesh. Peter confronts the creatures but only hears foreign whispers, as Lorelei drops to the floor behind him. Peter lets out a scream, and wakes up in a hospital. The doctor tells him that he has been there in a coma for over nine months, and that Lorelei had recovered from shock. The doctor then tells Peter that society has moved to living underground in order to avoid the invaders; Peter, as a scientist, is their last hope. Later, Peter approaches the newly crafted spaceship, titled The Avenger, which lacks the typical shield to protect one from cosmic rays. Lorelei begs Peter not to go, but he believes it is necessary, and too much of a risk for Lorelei to join him. He boards the ship with the mission to create a \"superman\" to ultimately defeat the invaders; the plan is to allow the cosmic rays to mutate several embryos on board, hopefully creating a strong enough being. As The Avenger leaves and goes into orbit, Peter begins feeling the effects of the rays as his skin and hair mutates. As time passes, he allows the embryos to develop, destroying all but one. He raises the embryo as it develops into a person, and the story jumps many years later, as the child becomes a man named Robert. Peter had raised Robert, with a superior brain and logical ability, to be the defeater of the invaders. Informing Robert of the plan to return back to Earth, Robert surprisingly refuses. Peter is taken aback, and Robert explains that he is not able to comprehend the emotions that would lead him to kill the invaders and save Earthmen. Peter begs helplessly, and Robert ultimately feels it inevitable to kill him. "
              },
              {
                "worker_id": "104",
                "uid": "72390ad4618043a38ee6f05e56c34f24",
                "response_text": "The story begins with a young Peter Karson, a scientist, working on a ship. He finishes his work for the moment and turns on the news to discover horrifying imagery and chaos being reported. He runs to Lorelei Cooper’s laboratory to go share the disturbing news with her. Lorelei and Peter have a romantic relationship. He asks Lorelei to turn on the news and she is shocked by the imagery that is being detailed. Both Peter and Lorelei become stunned when they realize that the invaders to Earth are headed towards their building. They hold each other in stunned silence until they hear a scream from Lorelei’s assistant, Harry Kanin. Peter goes out to investigate and discovers the Invaders turning Harry’s body into nothing but flesh. Unbeknownst to Peter, Lorelei followed him and when the Invaders are done with Harry they begin to focus on her to Peter’s terror.\n\nPeter then wakes up in a hospital bed. After much prodding, he is eventually informed that he has been in a coma for a little over nine months. He is told that humans are losing the fight against the Invaders and have retreated to living underground. He is soon informed that he must gain back his strength because as a scientist he is much needed in the fight against the Invaders.\n\nThe story then goes into detail about how Peter has been chosen to go to space on the Avenger ship and raise a viable embryo that has successfully mutated due to cosmic rays. The resulting person will then be used to fight against the Invaders. He does this while orbiting space on the ship. He destroys the inappropriate creations and keeps one embryo that sees as potential. That would grow up to be Robert. Many years have passed as he raises Robert. Eventually, he tells Robert the story of how he was created and details the mission that he is meant to carry out. Robert has great brain prowess due to his mutations and Peter is hopeful that he will be able to successfully fight against the invaders.\n\nHowever, Robert soon informs Peter that he will not go through with the plan. He reasons that he does not experience emotion and has no reason to care for the humans on Earth. Peter is greatly upset as he realizes his life’s work failed and Earth will not be able to save. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "107",
                "uid": "68b25a55ece94644acbc50b3905aa760",
                "response_text": "The story is first set inside Peter’s office. There is a window that he initially sees the Invader through. The window can see up to fifty stories high. There is also a desk with a newsbox on it, where he lights his cigarette. His office also has a chair. Many places worldwide are mentioned too, such as London, Hong Kong, Paris, and Boston. Lorelei’s laboratory is two stories down the moving ramp. It is behind a door marked “Radiation”, and there is also a door mechanism with a password set to “Etaoin Shrdlu”. Lorelei owns a scanner, a video panel on the wall that is initially covered in papers. There is also an inner room with an X-ray chamber. The building they are in is called the Atlas building. After Peter wakes from his coma, the story is set in a hospital underground. There is a metal stand and a bed for Peter to lie on. When he goes off with the mission to bring back a superman, the ship exits from the underground launch chamber and goes into space. Peter goes past the Moon, past Mars, and over the asteroid belt. From his distance, Earth is a tiny blue star. "
              },
              {
                "worker_id": "105",
                "uid": "13e4195812ae4aaf9e3dc2e204c88832",
                "response_text": "The story begins in a silent room with only blood dripping from Peter Karson's dead body. The stars are visible from the window. Then the story goes back in time, to when Peter was a young scientist. He was completing the project of 'Citadel' on paper and imagining his creation. It was supposed to be a huge metal laboratory-spaceship. The ship was to have many levels of laboratories and storerooms, the meteor deflectors, the air renewal system and the mighty engines. Suddenly, Peter felt some kind of dread around, he looked out from the window of his office and saw a horrible creature fifty stories up. Then he took the newspapers from his newsboy and saw the headlines about the invaders. He rushed two floors down through the staircase to the radioactive laboratory, where Lorelei, his girlfriend, was working. She was in the forest corner with a huge ledger. The two went to the scanner to watch the news and suddenly saw their own building, a tall, pure white structure. The silence was oppressive. Peter moved towards the inner room and confronted the aliens. Then he woke up in a sort of hospital after a long coma, he couldn't understand where he was and for how long. All the major cities were destroyed. People were digging to hide underground, but it was a delay rather than a solution. A new ship 'The Avenger' was built following the model of 'Citadel'. 'The Avenger' wasn't that big as 'Citadel' was supposed to be, it was a steel globe with compressed oxygen and concentrated food enough for a lifetime. Peter boarded the ship and sealed the door, then he sank down on the floor, knowing his low chances of staying alive. He closed the inner door and walked to the control room. He turned the keys and was pressed into the chair. He passed the moon and Mars and reached orbit. He felt the rays burning him there and broke the windows. For years he watched the embryos grow until Robert, the needed mutation, appeared. Peter fed him with knowledge for years. Earth was a tiny blue star far away, where many more years passed. When Robert refused to save the Earth, everything came to an end. "
              },
              {
                "worker_id": "101",
                "uid": "4991ed96ed744108a19c0d35dc2b278d",
                "response_text": "The beginning of the story takes place on Earth, in the Atlas building in the science city Manhattan. The building is a tall, white structure, with about fifty floors. The building contains both Peter's office, where he works on the Citadel, and Lorelei's laboratory, located two stories below. The laboratory contains several rooms, scattered with machinery and papers, with a video panel on the wall. After Peter's encounter with the invaders, he wakes up in a hospital, and he is then taken to the relocated city underground. The final part of the story takes place aboard The Avenger, a ship like others, except supplied with sufficient food and without cosmic ray shields. "
              },
              {
                "worker_id": "104",
                "uid": "72390ad4618043a38ee6f05e56c34f24",
                "response_text": "The story begins in a laboratory in New York City where Peter is working on a ship in his part of the building. Upon seeing disturbing news on the TV, he runs to Lorelei’s lab which is further down into the building. The building they both work in is the Atlas building. After the Invaders attack their building and seemingly kill Lorelei, Peter wakes up in a hospital room. He is able to leave and meet up with Lorelei – who is actually alive- in an underground city once he recovers. Peter then goes on a mission to orbit space on the Avenger ship in hopes of finding an embryo that has mutated in a manner that could help save Earth. This process takes years and he reaches an old age completing this mission on the ship. "
              }
            ]
          },
          {
            "question_text": "What is the relationship between Peter and Lorelei?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "107",
                "uid": "68b25a55ece94644acbc50b3905aa760",
                "response_text": "Peter and Lorelei are romantically involved with each other. When Lorelei sees Peter, she calls him “my love” and “darling.” She puts her hands on his shoulders too and kisses him impulsively as a sign of affection. Peter cares greatly about Lorelei, too, as she was the first person he went to find after seeing the news about the Invaders. When he tries to investigate, she clings to him and pleads for him not to go. However, she follows along too, and he is horrified at what might happen to her. After Lorelei passes out, Peter cannot help but let out a scream. Even when he wakes up from his coma, the first thing he thinks about is Lorelei and repeatedly asks where she is. Lorelei continues to beg Peter not to leave on The Avenger and asks him to reconsider. He does not want to go, but he tells her that it is the only solution. She cries, and he goes on remorselessly even though it hurts him. Lorelei wants to come along too; Peter cares too much and tells her that he could not stand seeing her change from somebody beautiful because of the rays. Although they say farewell to each other and Lorelei affirms that he will come back, Peter does not trust himself to kiss her goodbye. "
              },
              {
                "worker_id": "105",
                "uid": "13e4195812ae4aaf9e3dc2e204c88832",
                "response_text": "Peter and Lorelei are in love. They care for each other a lot - Lorelei begs Peter not to go towards any danger, and he doesn't want her to follow. They are also very tender and find tranquility in each other. In face of danger they embrace each other or kiss. The two also work together in the same building within a two floors distance. They know each other's habits - the lock on the laboratory, the lack of newsboy at Lorelei's. Peter worries for her more than for himself, and losing his girlfriend means his own death to him, that's the reason he gives for her not to follow him to the orbit. He also considers Lorelei very beautiful even when tired, and her beauty matters a lot for him - he says he won't handle its loss on the spaceship."
              },
              {
                "worker_id": "101",
                "uid": "4991ed96ed744108a19c0d35dc2b278d",
                "response_text": "Peter and Lorelei are romantically involved. Their relationship is loving and serious, which is apparent from their first interaction in the story as Peter meets her in the laboratory. Peter feels protective over Lorelei, especially given the recent invasions and dangers. When Lorelei appears to be hurt by the invaders, Peter lets out a shrilling scream and blacks out. The two are very close and cannot stand to be without each other, shown when Lorelei begs Peter to stay and not board The Avenger. However, out of love for Lorelei and concern for her safety, Peter leaves anyway."
              },
              {
                "worker_id": "104",
                "uid": "72390ad4618043a38ee6f05e56c34f24",
                "response_text": "Peter Karson and Lorelei are both scientists that work in the same building. They have a romantic relationship with each other. Lorelei is very keen on not being separated from Peter and is frightened every time he risks his life. Peter is a strong figure in their relationship and does his best to calm Lorelei, but also prepare her for the dangerous reality they face. He constantly tries to protect her as best as he can and prevent her from coming into harm’s way. "
              }
            ]
          },
          {
            "question_text": "Describe The Avenger ship and its importance to the future of civilization.",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "107",
                "uid": "68b25a55ece94644acbc50b3905aa760",
                "response_text": "The Avenger ship is what is built from Peter’s shining dream. It is much smaller than his initial blueprint, a globe of raw-dura steel no more than five hundred meters in diameter. It cannot house a thousand scientists, and the huge compartments are not filled with the latest equipment for experiments. Instead, it is filled with compressed oxygen and concentrated food to last a lifetime. There is also a control room, engine room, airlock, and inner lock. The Avenger ship is essential because it is the key to finding a superman who can save human civilization. Since the Invaders have caused the remaining population to burrow underground, this ship carries all hopes for the future. Peter believes that there is a chance that one embryo will be genetically modified enough to become a changeling who can save humanity. That is why he is willing to take the chance on the ship and realize his dream, even if it is not the dream he initially had in mind. "
              },
              {
                "worker_id": "105",
                "uid": "13e4195812ae4aaf9e3dc2e204c88832",
                "response_text": "'The Avenger' is built in accordance with the model of 'Citadel' but for other purposes. 'The Avenger' is not that huge, it's a steel globe with oxygen and food enough for a lifetime. It is also supposed tot ravel to that well-calculated orbit. There, the strong rays will help the embryos grow into mutations, one of which will defeat the invaders. The ship stays on the orbit for years with all the embryos and Peter, who broke the mirrors to raise the embryos under the rays. That one embryo, Robert, is like a superman, he follows only logic and has a superior brain,  same as the Invaders. The idea is that this superman is similar to Aliens but raised by humans, so he will help fight the Invaders. The plan goes wrong, when Robert refuses. "
              },
              {
                "worker_id": "101",
                "uid": "4991ed96ed744108a19c0d35dc2b278d",
                "response_text": "The Avenger ship is the last hope for civilization in light of the fatal invasions; though society has moved underground, it does not keep them completely safe, and they will inevitably lose. However, the goal of The Avenger is to create a superhuman that can return to Earth and defeat the invaders. The ship will do so through mutation via cosmic rays, which are purposely allowed to beam through the ship. Aboard The Avenger are multiple embryos, all which will undergo different mutations, and Peter is responsible for monitoring their development and ultimately finding one fit enough to destroy the invaders on Earth."
              },
              {
                "worker_id": "104",
                "uid": "72390ad4618043a38ee6f05e56c34f24",
                "response_text": "The Avenger ship is built to feed and house someone for an extremely long time. It has great importance to the future of the human race on Earth because of the mission that Peter has been tasked with caring out while on the ship. Peter is meant to find an embryo that has been appropriately mutated by cosmic rays in space and then to raise that life to adulthood. The goal is to produce a person that has advantages over a normal human being. The thinking is that this new human would be able to successfully fight against the Invaders and save Earth. "
              }
            ]
          },
          {
            "question_text": "Who is Robert, and what are his traits in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "107",
                "uid": "68b25a55ece94644acbc50b3905aa760",
                "response_text": "Robert is the one changeling child that Peter did not destroy. He is described to have an eager brain, and Peter keeps feeding knowledge to it. Robert also has a superior brain, capable of instinctively solving problems that would take mechanical computers hours of work. Physically, Robert also has talons. However, despite being a successful superman, Robert does not understand anything emotional. He refuses to go back to Earth to destroy the Invaders, citing that he is a being of logic. Robert says that he will use the people on Earth for his own gain, which the Invaders are already doing. Therefore, he finds it illogical when Peter asks him to kill the Invaders and not his people. Even when Peter says that he is his friend, Robert says he does not understand and believes that gratitude is a reciprocal arrangement. "
              },
              {
                "worker_id": "105",
                "uid": "13e4195812ae4aaf9e3dc2e204c88832",
                "response_text": "Robert was raised on 'The Avenger'. He was one of many embryos brought by the ship into space to be raised under the strong rays. Such an upbringing causes mutations, and people planned to create a mutant similar to the Invaders - a superior logical brain, who can understand and conquer the Invaders. This was the only hope for the humanity to be saved as they couldn't defeat the Aliens with their own forces. Robert is that one right mutation, a superman. There was a flaw in the calculations though, as a coldly logical being Robert has no reasons for destroying the Aliens. He doesn't have feeling, so he doesn't have compassion towards the humans to help them. Moreover, as the Invaders are easy for him to understand, he is rather on their side. He cares for Peter as much as he can, but his gratitude can't overcome his lack of desire to do something. After Peter's death, he can't feel emotions either but he feels some emptiness inside, which shows he has developed some warmth towards Peter. This emptiness has no reasons and no solutions, which puzzles Robert for the first time in his life. "
              },
              {
                "worker_id": "101",
                "uid": "4991ed96ed744108a19c0d35dc2b278d",
                "response_text": "Robert is the final embryo that Peter allows to develop on The Avenger. He has spent his entire life on the ship with Peter, and has absorbed knowledge through him for years. Consequently, and in tandem with the cosmic ray mutations, Robert's brain is superior and advanced, with the ability to solve any problem and think with perfect logic. Because of his advanced knowledge, Robert is unable to feel emotions, including love, hate, and fear. This leads Robert to not understand the mission that Peter has set out for him, and he refuses despite his intelligence."
              },
              {
                "worker_id": "104",
                "uid": "72390ad4618043a38ee6f05e56c34f24",
                "response_text": "Robert is the embryo that Peter selected to raise on the Avenger ship. He was deemed as having the best likelihood of successfully fighting against the Invaders due to his mutations. Unfortunately, he does not agree to complete the mission he was destined to complete. Peter describes him.  as being a superman as he is able to solve complex problems faster than even computers. Physically he is described as having talons. Mentally, he is coldly logical. He does experience emotions the same way as humans and does show loyalty to the human race. He does not understand nor like Peter’s reaction to the news that he will not be carrying out the mission to save Earth. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4842,
        "document_length_chars": 28006
      }
    }
  ]
}