{
  "item_metadata": {
    "item_id": "62997",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "62997",
      "content": "Saboteur of Space\n \n\n By ROBERT ABERNATHY\n \n \n Fresh power was coming to Earth, energy which would bring life to a dying planet. Only two men stood in its way, one a cowardly rat, the other a murderous martyr; both pawns in a cosmic game where death moved his chessmen of fate—and even the winner would lose.\n \n [Transcriber's Note: This etext was produced from Planet Stories Spring 1944. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Ryd Randl stood, slouching a little, in the darkened footway, and watched the sky over Dynamopolis come alive with searchlights. The shuttered glow of Burshis' Stumble Inn was only a few yards off to his right, but even that lodestone failed before the novel interest of a ship about to ground in the one-time Port of Ten Thousand Ships.\n \n Now he made out the flicker of the braking drive a mile or so overhead, and presently soft motor thunder came down to blanket the almost lightless city with sound. A beam swayed through the throbbing darkness, caught the descending ship and held it, a small gleaming minnow slipping through the dark heavens. A faint glow rose from Pi Mesa, where the spaceport lay above the city, as a runway lighted up—draining the last reserves of the city's stored power, but draining them gladly now that, in those autumn days of the historic year 819, relief was in sight.\n \n Ryd shrugged limply; the play was meaningless to him. He turned to shuffle down the inviting ramp into the glowing interior of Burshis' dive.\n \n The place was crowded with men and smoke. Perhaps half the former were asleep, on tables or on the floor; but for the few places like Burshis' which were still open under the power shortage, many would have frozen, these days, in the chilly nights at fourteen thousand feet. For Dynamopolis sprawled atop the world, now as in the old days when it had been built to be the power center of North America.\n \n The rocket blasts crescendoed and died up on Pi Mesa as Ryd wedged himself with difficulty into the group along the bar. If anyone recognized him, they showed it only by looking fixedly at something else. Only Burshis Yuns kept his static smile and nodded with surprising friendliness at Ryd's pinched, old-young face.\n \n Ryd was startled by the nod. Burshis finished serving another customer and maneuvered down the stained chrome-and-synthyl bar. Ryd was heartened.\n \n \"Say, Burshis,\" he started nervously, as the bulky man halted with his back to him. But Burshis turned, still smiling, shaking his head so that his jowls quivered.\n \n \"No loans,\" he said flatly. \"But just one on the house, Ryd.\"\n \n The drink almost spilled itself in Ryd's hand. Clutching it convulsively, he made his eyes narrow and said suspiciously, \"What you setting 'em up for, Burshis? It's the first time since—\"\n \n Burshis' smile stayed put. He said affably, \"Didn't you hear that ship that just came down on the Mesa? That was the ship from Mars—the escort they were sending with the power cylinder. The power's coming in again.\" He turned to greet a coin-tapping newcomer, added over his shoulder: \"You know what that means, Ryd. Some life around here again. Jobs for all the bums in this town—even for you.\"\n \n He left Ryd frowning, thinking fuzzily. A warming gulp seemed to clear his head. Jobs. So they thought they could put that over on him again, huh? Well, he'd show them. He was smart; he was a damn good helio man—no, that had been ten years ago. But now he was out of the habit of working, anyway. No job for Ryd Randl. They gave him one once and then took it away. He drank still more deeply.\n \n The man on Ryd's immediate right leaned toward him. He laid a hand on his arm, gripping it hard, and said quietly: \"So you're Ryd Randl.\"\n \n \n\n \n Ryd had a bad moment before he saw that the face wasn't that of any plain-clothes man he knew. For that matter, it didn't belong to anybody he had ever known—an odd, big-boned face, strikingly ugly, with a beak-nose that was yet not too large for the hard jaw or too bleak for the thin mouth below it. An expensive transparent hat slanted over the face, and from its iridescent shadows gleamed eyes that were alert and almost frighteningly black. Ryd noted that the man wore a dark-gray cellotex of a sort rarely seen in joints like Burshis'.\n \n \"Suppose we step outside, Ryd. I'd like to talk to you.\"\n \n \"What's the idea?\" demanded Ryd, his small store of natural courage floated to the top by alcohol.\n \n The other seemed to realize that he was getting ahead of himself. He leaned back slightly, drew a deep breath, and said slowly and distinctly. \"Would you care to make some money, my friend?\"\n \n \" Huh? Why, yeh—I guess so—\"\n \n \"Then come with me.\" The hand still on his arm was insistent. In his daze, Ryd let himself be drawn away from the bar into the sluggish crowd; then he suddenly remembered his unfinished drink, and made frantic gestures. Deliberately misunderstanding, the tall stranger fumbled briefly, tossed a coin on the counter-top, and hustled Ryd out, past the blue-and-gold-lit meloderge that was softly pouring out its endlessly changing music, through the swinging doors into the dark.\n \n Outside, between lightless buildings, the still cold closed in on them. They kept walking—so fast that Ryd began to lose his breath, long-accustomed though his lungs were to the high, thin air.\n \n \"So you're Ryd Randl,\" repeated the stranger after a moment's silence.\n\"I might have known you. But I'd almost given up finding you tonight.\"\n \n Ryd tried feebly to wrench free, stumbled. \"Look,\" he gasped. \"If you're a cop, say so!\"\n \n The other laughed shortly. \"No. I'm just a man about to offer you a chance. For a come-back, Ryd—a chance to live again.... My name—you can call me Mury.\"\n \n Ryd was voiceless. Something seemed increasingly ominous about the tall, spare man at his side. He wished himself back in Burshis' with his first free drink in a month. The thought of it brought tears to his eyes.\n \n \"How long have you been out of a job, Ryd?\"\n \n \"Nine ... ten years. Say, what's it to you?\"\n \n \"And why, Ryd?\"\n \n \"Why...? Look, mister, I was a helio operator.\" He hunched his narrow shoulders and spread his hands in an habitual gesture of defeat. \"Damn good one, too—I was a foreman ten years ago. But I don't have the physique for Mars—I might just have made it then , but I thought the plant was going to open again and—\"\n \n And that was it. The almost airless Martian sky, with its burning actinic rays, is so favorable for the use of the helio-dynamic engine. And after the middle of the eighth century, robot labor gave Mars its full economic independence—and domination. For power is—power; and there is the Restriction Act to keep men on Earth even if more than two in ten could live healthily on the outer world.\n \n \"Ten years ago,\" Mury nodded as if satisfied. \"That must have been the Power Company of North America—the main plant by Dynamopolis itself, that shut down in December, 809. They were the last to close down outside the military bases in the Kun Lun.\"\n \n Ryd was pacing beside him now. He felt a queer upsurge of confidence in this strange man; for too long he had met no sympathy and all too few men who talked his language. He burst out: \"They wouldn't take me, damn them! Said my record wasn't good enough for them. That is, I didn't have a drag with any of the Poligerents.\"\n \n \"I know all about your record,\" said Mury softly.\n \n Ryd's suspicions came back abruptly, and he reverted to his old kicked-dog manner. \"How do you know? And what's it to you?\"\n \n \n\n \n All at once, Mury came to a stop, and swung around to face him squarely, hard eyes compelling. They were on an overpass, not far from where the vast, almost wholly deserted offices of the Triplanet Freighting Company sprawled over a square mile of city. A half-smile twisted Mury's thin lips.\n \n \"Don't misunderstand me, Ryd—you mean nothing at all to me as an individual. But you're one of a vast mass of men for whom I am working—the billions caught in the net of a corrupt government and sold as an economic prey to the ruthless masters of Mars. This, after they've borne all the hardships of a year of embargo, have offered their hands willingly to the rebuilding of decadent Earth, only to be refused by the weak leaders who can neither defy the enemy nor capitulate frankly to him.\"\n \n Ryd was dazed. His mind had never been constructed to cope with such ideas and the past few years had not improved its capabilities. \"Are you talking about the power cylinder?\" he demanded blurrily.\n \n Mury cast a glance toward the Milky Way as if to descry the Martian cargo projectile somewhere up among its countless lights. He said simply, \"Yes.\"\n \n \"I don't get it,\" mumbled Ryd, frowning. He found words that he had heard somewhere a day or so before, in some bar or flophouse: \"The power cylinder is going to be the salvation of Earth. It's a shot in the arm—no, right in the heart of Earth industry, here in Dynamopolis. It will turn the wheels and light the cities and—\"\n \n \"To hell with that!\" snapped Mury, suddenly savage. His hands came up slightly, the fingers flexing; then dropped back to his sides. \"Don't you know you're repeating damnable lies?\"\n \n Ryd could only stare, cringing and bewildered. Mury went on with a passion shocking after his smooth calm:\n \n \"The power shell is aid, yes—but with what a price! It's the thirty pieces of silver for which the venal fools who rule our nations have sold the whole planet to Mars. Because they lack the courage and vision to retool Earth's plants and factories for the inescapable conflict, they're selling us out—making Earth, the first home of man, a colony of the Red Planet. Do you know what Earth is to the great Martian land-owners? Do you? \" He paused out of breath; then finished venomously, \"Earth is a great pool of labor ready to be tapped, cheaper than robots—cheap as slaves !\"\n \n \"What about it?\" gulped Ryd, drawing away from the fanatic. \"What you want me to do about it?\"\n \n Mury took a deep breath and straightened his shoulders. His face was once more bleakly impassive; only the mouth was an ugly line. \"We're going to do something about it, you and I. Tonight. Now.\"\n \n Ryd was nearly sober. And wholly terrified. He got out chokingly,\n\"What's that mean?\"\n \n \"The power shell—isn't coming in as planned.\"\n \n \"You can't do that.\"\n \n \" We can,\" said Mury with a heavy accent on the first word. \"And there are fifty thousand credits in it for you, Ryd. Are you with us?\"\n \n Suspicion was chill reality now in Ryd's mind. And he knew one thing certainly—if he refused now to accompany Mury, he would be killed, by this man or another of his kind. For the secret power known only as We never took chances. Whispered-of, terrible, and world-embracing, desperate upshot of the times in its principles of dynamitism, war, and panclasm—that was We .\n \n The question hung in the air for a long moment. Then Ryd, with an effort, said, \"Sure.\" A moment later it struck him that the monosyllabic assent was suspicious; he added quickly, \"I got nothing to lose, see?\" It was, he realized, the cold truth.\n \n \"You won't lose,\" said Mury. He seemed to relax. But the menace with which he had clothed himself clung, as he turned back on the way they had come.\n \n Ryd followed dog-like, his feet in their worn shoes moving without his volition. He was frightened. Out of his very fright came a longing to placate Mury, assure him that he, Ryd, was on the same side whatever happened....\n \n After some steps he stole a sidelong glance at his tall companion, and whined, \"Where ... where we going now?\"\n \n Mury paused in his long stride, removed a hand from a pocket of the gray topcoat that wrapped him as in somber thoughts. Wordlessly, he pointed as Ryd had known he would—toward where a pale man-made dawn seemed breaking over Pi Mesa.\n \n \n\n II\n \n \"One blow for freedom!\" said Mury with caught breath. His voice fell upon air scarcely stilled since the sodden thump of the blow that had killed the guard.\n \n The body lay between them, face down on the graveled way in the inky moon-shadow. On one side Pi Mesa stretched away two hundred yards to drop sharply into the night; on the other was the unlighted mass of the long, continuous, low buildings that housed now unused fuel pumps and servicing equipment. Looking down at the dead huddle at his feet, a little stunned by the reality of this, Ryd knew that he was in it now. He was caught in the machinery.\n \n Mury hefted the length of steel in his hand once more, as if testing the weight that had crushed a man's skull so easily. Then, with a short wrist-flip, he sent it flying into the dried weeds which had over-grown the aero field on the mesa's rim during the summer months after State order had grounded all fliers in America.\n \n \"All right, Ryd,\" he said coolly. \"Trade clothes with this fellow. I've brought you this far—you're taking me the rest of the way.\"\n \n The rest of the way.\n \n Ryd was still panting, and his side was paining from the strenuous exertion of the long climb up the side of the mountain, far from the guarded highway. His fingers, numbed by the cold of the high, thin air, shook as he knelt and fumbled with the zippers of the dead guard's uniform. The belted gun, however, was heavy and oddly comforting as he clumsily buckled it about his hips. He knew enough of weapons to recognize this as, not the usual paralyzer, but a flame pistol, powerful and deadly. He let his hand linger on its butt; then strong fingers tightened on his bony wrist, and he looked up with a start into the sardonic black eyes of the Panclast.\n \n \"No use now for firearms,\" said Mury. \"All the guns we could carry wouldn't help us if we were caught out there. That gun is just a stage property for the little play we're going to give in about three minutes—when you'll act a guardsman escorting me, a Poligerent of Dynamopolis, aboard the towship Shahrazad .\"\n \n For a moment Ryd felt relief—he had hazily imagined that Mury's hatred of Mars and all things Martian might have led him to try to sabotage the Martian warship which lay somewhere on the runways beyond the long, low buildings, and which would be closely guarded. But the towship would also be guarded ... he shivered in the cold, dry night air.\n \n Mury had melted into the shadow a few yards away. There was a light scraping, then a green flame sputtered, briefly lighting up his hands and face, and narrowing at once to a thin, singing needle of light. He had turned a pocket electron torch against the lock-mechanism of a small, disused metal door.\n \n \n\n \n Ryd watched in painful suspense. There was no sound in his ears save for the hard, dry shrilling of the ray as it bit into the steel. It seemed to be crying: run, run —but he remembered the power that knew how to punish better than the law, and stood still, shivering.\n \n The lock gave way and the door slipped aside. A light went on inside, and Ryd's heart stopped, backfired, and started again, raggedly. The same automatic mechanism that had turned the lights on had started the air-fresher, which picked up speed with a soft whine, sweeping out the long-stale atmosphere. Mury motioned to Ryd to follow him in.\n \n \n\n \n It was still musty in the narrow passage, between the closely-pressing walls, beneath the great tubes and cable sheathings that fluted the ceiling overhead. A stairway spiraled up on the right to the control cupola somewhere overhead; even in the airtight gallery a thin film of dust lay on every step. Up there were the meters and switches of the disused terminal facilities of the spaceport; beyond the metal door marked CAUTION, just beyond the stairwell, lay the long runway down which the ships of space had glided to be serviced, refueled, and launched into the sky once more by now dormant machines.\n \n \"Wait,\" said Mury succinctly; he vanished up the spiral stair, his long legs taking two steps at a time. After an aching minute's silence, he was back. All was clear as seen from the turret-windows overhead.\n \n They emerged in shadow, hugging the wall. Almost a quarter of a mile to the right the megalith of the Communications Tower, crowned with many lights where the signal-men sat godlike in its summit. Its floodlights shed a vast oval of light out over the mesa, where the mile-long runways—no longer polished mirror-like as in the days of Dynamopolis' glory—stretched away into the darkness of the table land. A handful of odd ships—mere remnant of the hundreds that Pi Mesa port had berthed—huddled under the solenoid wickets, as if driven together by the chill of the thin, knife-like wind that blew across the mesa.\n \n As the two paced slowly across the runways, Ryd had a sense of protective isolation in the vast impersonality of the spaceport. Surely, in this Titanic desolation of metal slabs and flat-roofed buildings, dominated by the one great tower, total insignificance must mean safety for them.\n \n And indeed no guard challenged them. There were armed men watching for all intruders out on the desert beyond the runways, but once inside, Ryd's borrowed blue seemed to serve as passport enough. Nonetheless, the passport's knees were shaking when they stood at last, inconspicuous still, at the shadowed base of the Communications Tower.\n \n Not far off, a half-dozen dignitaries, huddled close together in the midst of these Cyclopean man-made things that dwarfed their policies, their principles and ambitions, stood talking rather nervously with two officers, aristocratically gaudy in the scarlet of the Martian Fleet. Blue-clad guardsmen of Earth watched from a distance—watched boredly enough.\n \n And out on the steel-stripped tarmac, under the solenoid of Number Two Runway, lay a towship, backed like a stegosaur with its massive magnets—the Shahrazad , panting like a dragon amid rolling clouds of steam. She was plainly ready to go into space. The bottom dropped out of Ryd's stomach before he realized that a warning at least must be sounded before the ship could lift. But that might come any moment now.\n \n \"Relax,\" said Mury in a low voice. \"Nothing's gone wrong. We'll be aboard the Shahrazad when she lifts.\" For a moment his black eyes shifted, hardening, toward Runway Four. The Martian warship lay there beyond the solenoid, a spiteful hundred-foot swordfish of steel, with blind gunvalves, row on row, along its sleek sides and turret-blisters. It had not yet been tugged onto the turntable; it could not be leaving again very soon, though Earth weight was undoubtedly incommoding its crew. About it a few figures stood that were stiffly erect and immobile, as tall as tall men. From head to toe they were scarlet.\n \n \"Robots!\" gasped Ryd, clutching his companion's arm convulsively.\n\"Martian soldier robots!\"\n \n \"They're unarmed, harmless. They aren't your police with built-in weapons. Only the humans are dangerous. But we've got to move. For God's sake, take it easy.\"\n \n Ryd licked dry lips. \"Are we going—out into space?\"\n \n \"Where else?\" said Mury.\n \n \n\n \n The official-looking individual in the expensive topcoat and sport hat had reached the starboard airlock of the towship before anyone thought to question his authorization, escorted as he was by a blue-uniformed guardsman. When another sentry, pacing between runways a hundred yards from the squat space vessel, paused to wonder, it was—as it came about—just a little too late.\n \n The guard turned and swung briskly off to intercept the oddly-behaving pair, hand crowding the butt of his pistol, for he was growing uneasy. His alarm mounted rapidly, till he nearly sprained an ankle in sprinting across the last of the two intervening runways, between the solenoid wickets. Those metal arches, crowding one on the other in perspective, formed a tunnel that effectively shielded the Shahrazad's airlocks from more distant view; the gang of notables attracted by the occasion was already being shepherded back to safety by the Communications guards, whose attention was thus well taken up.\n \n The slight man in guardsman's blue glanced over his shoulder and vanished abruptly into the circular lock. His companion wheeled on the topmost step, looking down with some irritation on his unhandsome face, but with no apparent doubt of his command of the situation.\n \n \"Yes?\" he inquired frostily.\n \n \"What goes on here?\" snapped the guard, frowning at the tall figure silhouetted against the glow in the airlock. \"The crew's signaled all aboard and the ship lifts in two minutes. You ought to be—\"\n \n \"I am Semul Mury, Poligerent for the City of Dynamopolis,\" interrupted the tall man with asperity. \"The City is naturally interested in the delivery of the power which will revivify our industries.\" He paused, sighed, shifting his weight to the next lower step of the gangway. \"I suppose you'll want to re-check my credentials?\"\n \n The guard was somewhat confused; a Poligerent, in ninth-century bureaucracy, was a force to be reckoned with. But he contrived to nod with an appearance of brusqueness.\n \n Fully expecting official papers, signed and garnished with all the pompous seals of a chartered metropolis, the guard was dazed to receive instead a terrific left-handed foul to the pit of the stomach, and as he reeled dizzily, retching and clawing for his gun, to find that gun no longer holstered but in the hand of the self-styled Poligerent, pointing at its licensed owner.\n \n \"I think,\" Mury said quietly, flexing his left wrist with care the while his right held the gun steady, \"that you'd better come aboard with us.\"\n \n The guard was not more cowardly than the run of politically-appointed civic guardsmen. But a flame gun kills more frightfully than the ancient electric chair. He complied, grasping the railing with both hands as he stumbled before Mury up the gangway—for he was still very sick indeed, wholly apart from his bewilderment, which was enormous.\n \n Above, Ryd Randl waited in the lock, flattened against the curved wall, white and jittering. The inner door was shut, an impenetrable countersunk mirror of metal.\n \n \"Cover him, Ryd,\" ordered Mury flatly. In obedience Ryd lugged out the heavy flame pistol and pointed it; his finger was dangerously tremulous on the firing lever. He moistened his lips to voice his fears; but Mury, pocketing the other gun, threw the three-way switch on the side panel, the switch that should have controlled the inner lock.\n \n Nothing happened.\n \n \"Oh, God. We're caught. We're trapped!\" The outer gangway had slid up, the lock wheezed shut, forming an impenetrable crypt of niosteel.\n \n \n\n \n Mury smiled with supernal calm. \"We won't be here long,\" he said. Then, to quiet Ryd's fears, he went on: \"The central control panel and the three local switches inside, between, and outside the locks are on the circuit in that order. Unless the locks were closed from the switch just beyond the inner lock, that lock will open when the central control panel is cut out in preparation for lifting.\"\n \n Almost as he paused and drew breath, a light sprang out over the switch he had closed and the inner lock swung silently free of its gaskets. Ryd felt a trembling relief; but Mury's voice lashed out like a whip as he slipped cat-like into the passage.\n \n \"Keep him covered. Back out of the lock.\"\n \n Ryd backed—the white, tense face of the prisoner holding his own nervous gaze—and, almost out of the lock, stumbled over the metal pressure rings. And the gun was out of his unsure grip, clattering somewhere near his slithering feet, as he started to fall.\n \n He saw the guardsman hurl himself forward; then he was flung spinning, back against the engine-room door. In a flash, even as he struggled to keep on his feet, he saw the man in the airlock coming up from a crouch, shifting the pistol in his right hand to reach its firing lever; he saw Mury sidestep swiftly and throw the master control switch outside.\n \n The inner lock whooshed shut, barely missing Ryd. At the same instant, the flame gun lighted locks and passage with one terrific flash, and a scorched, discolored spot appeared on the beveled metal of the opposite lock a foot from Mury's right shoulder.\n \n \"You damned clumsy little fool—\" said Mury with soft intensity. Then, while the air around the metal walls still buzzed and snapped with blue sparks, he whirled and went up the control-room gangway in two quick bounds. Even as he went the flame gun thundered again in the starboard airlock.\n \n Mury was just in time, for the pilot had been about to flash \"Ready\" to the Communications Tower when the explosions had given him pause. But the latter and his two companions were neither ready nor armed; clamped in their seats at the controls, already marked, they were helpless in an instant before the leveled menace of the gun. And the imprisoned guardsman, having wasted most of his charges, was helpless, too, in his little cell of steel.\n \n \"It's been tried before,\" said one of the masked men. He had a blond, youthful thatch and a smooth healthy face below the mask, together with an astrogator's triangled stars which made him ex officio the brains of the vessel. \"Stealing a ship—it can't be done any more.\"\n \n \"It's been done again,\" said Mury grimly. \"And you don't know the half of it. But—you will. I'll need you. As for your friends—\" The gun muzzle shifted slightly to indicate the pilot and the engineer. \"Out of those clamps. You're going to ride this out in the portside airlock.\"\n \n He had to repeat the command, in tones that snapped with menace, before they started with fumbling, rebellious hands to strip their armor from themselves. The burly engineer was muttering phrases of obscene fervor; the weedy young pilot was wild-eyed. The blond astrogator, sitting still masked and apparently unmoved, demanded:\n \n \"What do you think you're trying to do?\"\n \n \"What do you think?\" demanded Mury in return. \"I'm taking the ship into space. On schedule and on course—to meet the power shell.\" The flame gun moved with a jerk. \"And as for you—what's your name?\"\n \n \"Yet Arliess.\"\n \n \"You want to make the trip alive, don't you, Yet Arliess?\"\n \n The young astrogator stared at him and at the gun through masking goggles; then he sank into his seat with a slow shudder. \"Why, yes,\" he said as if in wonder, \"I do.\"\n \n \n\n III\n  Shahrazad drove steadily forward into deep space, vibrating slightly to the tremendous thrust of her powerful engines. The small, cramped cabin was stiflingly hot to the three armored men who sat before its banked dials, watching their steady needles.\n \n Ryd had blacked out, darkness washing into his eyes and consciousness draining from his head, as the space ship had pitched out into emptiness over the end of the runway on Pi Mesa and Mury had cut in the maindrive. Pressure greater than anything he had ever felt had crushed him; his voice had been snatched from his lips by those terrible forces and lost beneath the opening thunder of the three-inch tubes. Up and up, while the acceleration climbed to seven gravities—and Ryd had lost every sensation, not to regain them until Earth was dropping away under the towship's keel.\n \n A single gravity held them back and down in the tilted seats, and the control panels seemed to curve half above them, their banks of lights confused with the stars coldly through the great nose window. In the control room all sounds impinged on a background made up of the insect hum of air-purifiers, the almost supersonic whine of the fast-spinning gyroscopes somewhere behind them, the deep continuous growl of the engines.\n \n Mury's voice broke through that steady murmur, coming from Ryd's right.\n\"You can unfasten your anticlamps, Ryd,\" he said dryly. \"That doesn't mean you,\" to the young navigator, on his other hand as he sat in the pilot's seat with his pressure-clamps thrown back and his gloved hands free to caress the multiplex controls before him. Clipped to the sloping dash at his left elbow was a loaded flame gun.\n \n Ryd emerged, with much bungling, from his padded clamps, and shook his head groggily as he ran a hand through his slightly thinning hair. He ventured shakily, \"Where are we?\"\n \n Mury smiled slightly. \"Only our astrogator,\" he indicated Arliess, still masked and fettered, \"can tell you that with precision. I understand only enough of astrogational practice to make sure that he is holding to the course outlined on the log. For that matter ... he is an intelligent young man and if he were not blinded by notions of duty to an outworn system.... We are now somewhere near the orbit of the Moon. Isn't that right, Arliess?\"\n \n The other did not seem to hear; he sat staring blindly before him through his goggles at the slowly-changing chart, where cryptic lights burned, some moving like glowing paramecia along fine-traced luminous tracks.\n \n Mury too sat silent and immobile for a minute or more. Then, abruptly, he inclined his universal chair far to the right, and his long frame seemed to tense oddly. His finger stabbed out one of the sparks of light.\n \n \"What's that, Arliess?\"\n \n The astrogator broke his silence. \"A ship.\"\n \n \"I know that well enough. What ship?\"\n \n \"I supposed you had examined the log. It would have told you that that's the liner Alborak , out of Aeropolis with a diplomatic mission for Mars.\"\n \n Mury shook his head regretfully. \"That won't wash, Arliess. Even if you suppose her off course, no liner aspace ever carried a tenth of that drive.\"\n \n \"I don't know what you're talking about,\" said Arliess. But his voice was raw and unsteady.\n \n \"I'm talking about this. That ship is a warship, and it's looking for us—will intercept us inside of twenty minutes at the most!\"",
      "metadata": {
        "title": "Saboteur of Space",
        "author": "Robert Abernathy",
        "passage_id": "62997",
        "uid": "461db7c7fa384ceea25277d6121a06bb",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "1",
                "uid": "9eeb8aaf73a6401681d90ab51e25eee5",
                "response_text": "It’s the year 819, and a man named Ryd Randl who lives in Dynamopolis, a city in North America, goes to a dive bar. The place is crowded with many men because Dynamopolis is experiencing a power shortage, and they would freeze outside. Burshis, the owner of the bar, gives Ryd a free drink and explains that a ship from Mars just brought power back. He is expecting there to be a big boom in the economy soon, which will lead to jobs for people like Ryd. Ryd is not easily convinced of this good news. \nThe ugly and tall man sitting next to Ryd recognizes him. Once outside, Mury introduces himself and asks Ryd if he wants to make some money. He explains that he can offer Ryd a comeback. Ryd has been jobless for ten years, but before that he was a helio operator. Since then, Mars has become fully independent, and all the work moved there. Mury says that he is working for the hundreds of men who have been put out by the corrupt government on Mars. Although Ryd and all the other Earthmen have been told that the new power cylinder being installed will create jobs and bring back the power, Mury argues that isn’t truly the case. He insists that Earthmen are essentially slaves to Mars’s landowners, and in order to stop that from happening, they must stop the power cylinder from landing on Earth. \nThe two men arrive at Pi Mesa, and Mury kills a guard. Ryd steals his clothing and his flame pistol so that they can get on the ship unnoticed. Ryd must pretend to be a guard escorting Mury, the Poligerent of Dynamopolis aboard the Shahrazad. The two men sneak into the controlled area through a metal door, make it to the Communications Tower, and speak with a guard. Mury offers to show his credentials as Poligerent, and surprises the guard with a punch to the gut. Mury takes the officer’s gun, points it at him, and demands he accompany them. \n\nRyd nervously points his flame pistol at the guard and drops his weapon. The weapon goes off and its flame hits some machinery. This gives the pilot pause, and Mury hurries to the control room and takes over the situation. There are three workers there who become his hostages. He explains to the men that he’s taking Shahrazad into space to meet the power shell. \n\nWhen the ship takes off, Ryd passes out from the pressure of the acceleration. When he wakes, Mury assures him that they are on the right path, somewhere near the orbit of the Moon. However, Mury quickly finds out that his masterful plan has been foiled when one of his prisoners, the astrogator, informs him that a ship named the Alboroak is approaching, and it’s about to intercept them. \n"
              },
              {
                "worker_id": "2",
                "uid": "3296d96a653a4b8e889f5fcbf5f265ba",
                "response_text": "The story begins with the landing of a Martian ship on Earth, where electrical power has reached a critical shortage. The Martian ship reportedly carries a power cylinder that will restore power on Earth, enabling businesses to reopen and people to regain their jobs. Ryd Randl sees the ship landing just before he enters the Burshis’ Stumble Inn which has power and where many men are staying to keep from freezing to death outside. Ryd lost his job ten years ago, and apparently, he has asked for loans from many people in the bar because they will not look him in the eye. The bar owner gives him a free drink but refuses to offer him a loan if Ryd asks him for one. A stranger approaches Ryd and seems to know, although Ryd does not know the stranger. The stranger asks Ryd to step outside with him and offers Ryd a way to make money. The stranger’s name is Mury, and he is a Poligerent. Mury claims to be working for all the Earthmen who lost their jobs when the government made a deal with Mars. The Martians have sent a power cylinder to Earth that is supposed to restore power to Earth; however, Mury explains that the people who rule Earth’s nations have sold the planet in exchange for the device because Earth will become a colony of Mars. He claims that the Martians view Earth as a ready labor pool of slaves. Mury wants Ryd to help him prevent the power shell from reaching Earth. Ryd doesn’t want to agree to help but knows that if he doesn’t, Mury will kill him.\n\tMury and Ryd go to the airstrip where the Martian ship and its township have landed. Mury kills a guard and orders Ryd to don the uniform; he plans for Ryd to act as his escort to the towship so that he can go aboard. In their guises, Ryd and Mury make their way to the township unaccosted until one guard becomes suspicious and confronts them. When Mury offers to show him his credentials, Mury hits him in the stomach and brings him aboard the towship. The pilots and an astrogator are in the cockpit when Mury enters and sends the pilots out. The ship takes off, and when it nears the orbit of the Moon, Ryd comes to and asks where they are. Mury and the astrogator notice a bright light on the radar screen which indicates a ship. The astrogator claims it is a ship on a diplomatic mission for Mars, but Mury claims it is a warship because of its speed. He says the ship is looking for them and will intercept them in twenty minutes.\n"
              },
              {
                "worker_id": "10",
                "uid": "9373b3f3c8e940d6a70979f7cc4c2599",
                "response_text": "Some time in the future, Earth has sold the planet to Mars and become a colony of the Red Planet. This causes unrest for laborers who feel Mars is allowing Earth to degrade so that they can export human labor to Mars at very low cost. In the city of Dynamopolis, their main industry is distributing power, which once made them the power center of North America. \n\nThere is a spaceport, Pi Mesa, that receives essential supplies for Earth to continue existing, such as the power cylinder send from Mars as aid to Earth that is rumored to have landed there.  The power shell means an end to an electrical blackout the people of Earth are currently suffering from and the creation of jobs for the people of Dynamopolis.\n\nA scary figure named Mury meets Ryd Randl, a helio operator currently out of work, at the Stumble Inn bar in Dynamopolis. Mury forces Ryd into a grand plan to board a Martian spaceship on Pi Mesa to intercept a power shell in outer space and stop it from being delivered to Earth. Mury wishes to start a sort of revolution on Earth for it to become independent from Mars again, and describes that there is an “inescapable conflict” coming between Earth and Mars.\n\nMury and Ryd invade the Pi Mesa spaceport by killing a guard, and taking his clothes to disguise Ryd as a guard escorting Mury. This disguise works for a time until one of the Martian guards senses something is wrong and tries to stop them. They narrowly make it aboard a towship called Shahrazad which they believe is going into space to retrieve a power shell to bring down to Earth. They force the captain and crew into an airlock, except for the astronavigator named Arliess, who Mury forces to continue working by holding their planned course. \n\nWhen they blast off into outer space, Mury spots a Martian warship which may confirm his suspicion that Mars was about to begin a war with Earth. This is where the story ends.\n\n"
              },
              {
                "worker_id": "6",
                "uid": "d6e875b0130741eb81f012b3d25a97bc",
                "response_text": "Set in the 800s 14,000 feet in the sky, Ryd Randl gets his first free drink of the month. He walks into Burshis’ Stumble Inn where the bartender, Burshis, hands him a drink. There’s buzz about the arrival of power from Mars. Dynamopolis has been desolate for at least a decade. This center lacked power and many lost their jobs over it. So, this new deal struck with Mars is giving people hope again. Randl laughs it off, however. He was laid off 10 years ago and gave up on finding another job.  \nThe beak-nosed, scary man next to him drags Randl outside, after paying for his drink and offering him money. He introduces himself as Mury and proposes a deal. A revolutionary, Mury wants to stop the shipment to protect Earthmen from becoming Martian slaves. He needs Randl’s help, and he’ll pay 50,000 credits. Ryd agrees, and they make the trek to Pi Mesa. Mury kills a guard on the way up, and Ryd changes into his clothes, flame pistol included. Now Mury will pretend to be a Poligerent of Dynamopolis so they can board the Shahrazad. \nThey break into the spaceport successfully and continue on. Their disguises work for the most part, though Ryd’s nervous behavior makes them suspicious. Making their way down the runways, they finally arrive at the Communications Tower. On the tarmac lay Shahrazad, but guards both human and robot were everywhere. They made it onto the airlock before another guard took notice. He rushes after them and asks them who they are. Mury turns and tells him his credentials, then offers to show him ID. He then punches him and disarms him. The guard comes onboard as their captive. At first, the switches don’t work, but Mury calms Ryd down. When the central control panel is cut, then the ship will take off.  \nRyd is supposed to be covering the guard when he slips and drops his weapon. The guard picks it up but is soon defeated. Mury forces the young pilot, Yet Arliess, to take off, while he sends the other two men to the airlock. The pilot does as he says, and all is well until Mury notices something on the map. There’s a bright light, one that wasn’t there before. A warship was coming for them, and although Arliess tried to lie, Mury saw straight through it. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "1",
                "uid": "9eeb8aaf73a6401681d90ab51e25eee5",
                "response_text": "The story takes place in Dynamopolis, a city in North America, in the year 819. The city is flooded with searchlights, although there is very little power to go around. The Terrestrials must gather at the local bar, Stumble Inn, if they do not want to freeze to death. At one point, Dynamopolis was a wealthy city, known as the Port of Ten Thousand Ships. About ten years ago, the Power Company of North America and the Triplanet Freighting Company were shut down, and the majority of the Terrestrials lost their jobs. The only people with political power are the Poligerents, and unless a Terrestrial knows one of them, he or she is likely left without a way to make ends meet. The Terrestrials were recently told that the power will be restored once the power shell is put on Earth. The air is thin, but the Terrestrials have become accustomed to it.\n\nPi Mesa is the spaceport that hovers over the city. There are still unused ships hovering there from the days where it was an important port with lots of action. Just outside of Pi Mesa there are hundreds of low buildings that are abandoned because they are no longer useful. They contain fuel pumps and servicing equipment, and they serve as a constant reminder of the life the Terrestrials once lived. \n\nWhen Ryd and Mury break into the land patrolled by the guards in blue in the spaceport, they find narrow passages, spiral staircases, and cool metal walls covered in dust. The Communications Tower is nearby, and it is guarded by signal-men.  The soldier robots that are on patrol are about as tall as the average Terrestrial, and they are scarlet colored. They are unarmed and are mostly there to scare intruders away. \n\nMury and Ryd aim to get on a ship called Shahrazad, which rests on the Number Two Runway, waiting for takeoff. When they enter the ship, they find that the cabin is very hot and full of dials and needles. There is a curved control panel in front, and the ship makes a humming sound because of all of the air-purifiers onboard. \n\nMars is an important setting in the story, although the characters do not actually travel there. Mars is almost airless, so it is very easy to run a helio-dynamic engine. On Mars, they use robots for labor, and due to a law that has been passed, Terrestrials are forced to stay on Earth. \n"
              },
              {
                "worker_id": "2",
                "uid": "3296d96a653a4b8e889f5fcbf5f265ba",
                "response_text": "The story is set in the city of Dynamopolis on Earth in the historic year 819.  Dynamopolis was built to be the power center of North America. Earth is in a deep recession with many men out of work for almost a decade because Earth can no longer produce power for the whole planet. Ryd Randl sees a spaceship landing at the unused airstrip just as he enters Burshis’ Stumble Inn. This bar is one of the few businesses with power and is filled with men trying to keep from freezing to death outside because it is freezing at an elevation of 14,000 feet. The bar owner expresses optimism for Earth’s economy with the power cylinder from Mars allowing Earth to turn the power back on for many people. The people on Earth have endured years of unemployment and have lost hope after so many years. "
              },
              {
                "worker_id": "10",
                "uid": "9373b3f3c8e940d6a70979f7cc4c2599",
                "response_text": "In the future, Earth is a desolate planet reliant on aid from Mars to continue existing. The atmosphere seems to be controlled by technology, as there is reference to a “man-made dawn” rising over the desert. \n\nThe main settings of the story are:\n\nA dark, smoky bar at the Stumble Inn owned by Burshis, located in the city of Dynamopolis which was once the power center of North America.\n\nPi Mesa, a busy spaceport in the desert on Earth that has many runways and a Control Tower. It serves as a place for supply ships to land with aid from Mars. \n\nAboard the martian space towship called Shahrazad that blasts off from Pi Mesa and enters outer space. It has a small crew and is suggested to be a small ship used for towing other cargo.\n\n"
              },
              {
                "worker_id": "6",
                "uid": "d6e875b0130741eb81f012b3d25a97bc",
                "response_text": "Saboteur of Space by Robert Abernathy takes place in Dynamopolis in the year 819. Dynamopolis was built to act as the largest power center in North America. But the real question was where they would put it. Humanity had already conquered and filled much of Earth’s territory. So, they built Dynamopolis in the sky, specifically at an altitude of 14,000 feet. \nAround the early 800s, Dynamopolis took a turn for the worse. Despite being the largest power center in North America, Dynamopolis lost its power. Businesses, companies, and factories started shutting down and resources dwindled. Dynamopolis is now desolate and freezing, due to the high altitude and lack of power. The street lamps don’t work and only a few businesses--including Burshis’ Stumble Inn--are allowed to keep the lights and heat on.\n"
              }
            ]
          },
          {
            "question_text": "How does Mury handle himself throughout the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "1",
                "uid": "9eeb8aaf73a6401681d90ab51e25eee5",
                "response_text": "Mury is a tall and ugly man with a great deal of confidence. When he finds Ryd in the bar, he immediately asks him to step outside and confronts him with a proposition. He is not overly concerned about getting caught talking about rebellion, and he is resolute about his decision to try and take over the spaceship that is about to take off. \nMury immediately gains Ryd’s trust when he sympathizes with him about losing his job ten years ago. They are on the same team, angry about the way the Terrestrials have been treated since all of the jobs moved to Mars. He is forceful with Ryd, and he stares at him intensely whenever he is questioned. Mury claims to work for all the men who have been disadvantaged by the corrupt government. He coldly tells Ryd that he means nothing to Mury as an individual, and he is only interested in saving the Terrestrials from becoming the Martians’ slaves. He believes that Earth is about to become a colony of Mars, and he is willing to risk his life to see that plan foiled. \n\nMury’s tough attitude and willingness to act is demonstrated when he kills a guard by crushing his skull. He is unbothered by the incident and sees it as his only choice. Later, he pretends to be Poligerent for the City of Dynamopolis for a moment, only so that he can punch another guard in the stomach, take his firearm, and shoot him. \n\nMury is able to stay calm when Ryd loses his cool. Even when Ryd accidentally fires his weapon inside the central control panel room, Mury focuses on the mission at hand. When he finally takes control of the three men on board the Shahrazad and demands that they takeoff for Mars immediately, he is unfazed by their refusal. He snaps at the pilot and the other two workers and points his gun at them to indicate that he is dead serious about killing them if they do not comply. \n\nMury is so sure of himself that it comes as a big surprise when the pilot tells him that he must not have looked at the log for the day. The Alborak is on a diplomatic mission to Mars, and it is something that Mury overlooked. He does not realize that the ship is fully aware that the Shahrazad has been hijacked, and it’s coming right for them. \n"
              },
              {
                "worker_id": "2",
                "uid": "3296d96a653a4b8e889f5fcbf5f265ba",
                "response_text": "Mury conducts himself with confidence and the assurance that he is right and on the right side. When he meets Ryd in the bar, he immediately recognizes him and asks to speak with him. Mury is on a mission and believes it is one that will vindicate many Earthmen. Mury also understands Ryd, and when Ryd is reluctant to work with him, Mury offers him money which Ryd can hardly refuse after so many years of unemployment. Mury is sure that he is right and does not hesitate to use violent means to meet his ends. He believes the governments of the Earth’s nations have sold out to the Martians and that the Martians will use the Earthmen as cheap slave labor. Mury often comes across as angry and upset at the agreement the government leaders made with Mars. Mury convinces the blond astrogator of the township to help him return the ship to space. When it becomes evident there is a warship moving toward them, he maintains his calm even though he estimates the ship will reach them in twenty minutes or less. "
              },
              {
                "worker_id": "10",
                "uid": "9373b3f3c8e940d6a70979f7cc4c2599",
                "response_text": "Mury takes a certain level of control over Ryd at the beginning of the story by coaxing him to leave the bar and forcing him to perform his bidding by maintaining a fear that he will have Ryd killed if he does not obey.\n\nMury is not forthcoming with his plan, preferring to play a controlling mastermind role - only telling Ryd details as they are necessary for him to know. Mury is willing to kill to accomplish his plan which he does to obtain a guards uniform to carry out his plan.\n\nMury maintains a sense of control through the whole story until the very end when he unexpectedly sees a Martian warship which clearly startles him.\n"
              },
              {
                "worker_id": "6",
                "uid": "d6e875b0130741eb81f012b3d25a97bc",
                "response_text": "Mury, which may not be his real name, is a revolutionary man. He makes himself clear at the beginning; he doesn’t care about individuals, but Earthmen as a whole. With a bony face, large nose, and expensive clothing, Mury makes an impression. He’s confident and sure of himself, until the last moment of the story when he is thwarted by the young pilot. \nWhen he picks up Ryd, he uses intimidation tactics and more to influence his decision. He killed one guard along the way up the mountain and possibly another one on the ship. He pretends to be a higher-up of society to sneak onto the ship and succeeds. He believes in Earthmen and revivifying Dynamopolis. He’s driven by halting this power deal between Dynamopolis and Mars to prevent any Earthmen from becoming nothing more than cheap labor. \n"
              }
            ]
          },
          {
            "question_text": "Why are so many Earthmen desolate?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "1",
                "uid": "9eeb8aaf73a6401681d90ab51e25eee5",
                "response_text": "The Earthmen are desolate because their ability to support themselves has been taken away by the people in power. Like many others, Ryd was a helio engineer, and he made a good living in the North American city of Dynamopolis. However, about a decade ago, all of the buildings were shuttered, and the Port of Ten Thousand Ships, Pi Mesa, was essentially closed. The people who live in Dynamopolis were actually luckier than other Terrestrials because theirs was the final port to close. \nThe people in charge discovered that Mars has a thinner atmosphere, and they decided to move all of the work to the red planet. However, they did not transport the Terrestrials to a new land and give them an opportunity to continue working. Instead, they created robots who could easily do the humans’ jobs for a lot less money. \nElectricity is hard to come by on Dynamopolis, and the energy that is left goes to Pi Mesa. Although people like the local bartender, Burshis, believe the people in power when they say that energy will soon be restored when the power cylinder is brought to Earth, others, like Mury and Ryd, are much more skeptical. They see the writing on the wall: the Terrestrials will continue to be used and abused, and all of the much-needed resources will go towards Mars, the new frontier. \n"
              },
              {
                "worker_id": "2",
                "uid": "3296d96a653a4b8e889f5fcbf5f265ba",
                "response_text": "Many Earthmen are desolate because the economy is so bad. Many of them lost their jobs up to a decade ago and have not been able to find work since then. Many businesses are shut down since they don’t have the power to operate. Many of the men in the bar must be homeless as Ryd thinks to himself that Burshis’ bar is one of the few open places, and approximately half of the men inside are asleep on the tables or on the floor to get out of the cold so they don’t freeze to death. The loss of power occurred because helio-dynamic engines worked so much better in the Martian atmosphere and because robot labor made Mars fully independent economically. Furthermore, the government issued the Restriction Act to keep Earthmen on Earth and prevent them from moving to Mars or elsewhere to seek employment. The men in charge of Earth’s governments have also made a deal with Mars for the power cell to restore power to Earth, but in exchange, Earth will be a Martian colony, making Earthmen slaves to Martians for all practical purposes."
              },
              {
                "worker_id": "10",
                "uid": "9373b3f3c8e940d6a70979f7cc4c2599",
                "response_text": "They do not have jobs and the planet appears to be totally reliant on the aid being provided by Mars. Since the planet Earth was sold to Mars, they have become a colony to Mars. Some people on Earth (represented by Mury) are of the opinion that Earth’s government is not acting in a way that benefits their lives, thus leaving them in desolation because the current relationship between the planets allows Mars to pay people from Earth extremely low wages.\n"
              },
              {
                "worker_id": "6",
                "uid": "d6e875b0130741eb81f012b3d25a97bc",
                "response_text": "Although it was originally the largest power center, lack of resources, funding, and jobs have led Dynamopolis down a dark path. Many people were laid off as the power plants shut down, including the 809 shutdown of the Power Company of North America. \nThe space station, landing pad, and runway hovers above Dynamopolis. Pi Mesa is the only working spaceport in Dynamopolis. \nThe lack of power and the Restriction Act forced everything to stop. Earthmen weren’t allowed to go to Mars, even though they had full economic independence and the space to support them. So, now Dynamopolis is making a deal with Mars: power for labor. After losing all their jobs (a power center with no power),  it was no wonder that the earthmen wound up in the situation that they did. \n"
              }
            ]
          },
          {
            "question_text": "Describe the character of Ryd.",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "1",
                "uid": "9eeb8aaf73a6401681d90ab51e25eee5",
                "response_text": "Ryd is a resentful and skeptical person because he has been without a job for at least ten years. His only solace comes from drinking at Burshis’ Stumble Inn, where he can pretend that no one knows him and have a nice chat with the bar owner. \n\nHe knows he was a good helio engineer, and he is fully aware that he did not deserve to have his job ripped from his hands. When the bartender suggests that he will have a new job soon, Ryd thinks to himself that anyone who wants to give him a job can screw off. He has been without one for too long to even know how to manage it. \n\nRyd is also skeptical of people around him. When Mury approaches him at the bar, he notices right away that Mury seems out of place in the way that he’s dressed. He also gives Mury an attitude when the man starts a conversation with him. He has learned not to trust many people, so he acts contrary to his natural intuition when he listens to Mury and almost immediately believes he has his best interest in mind.\n\nRyd is not a trained spy or someone who has a lot of experience with committing crimes, so he is very out of place on his mission with Mury. He is jumpy, anxious, and concerned for his safety throughout the job. He is so uncomfortable holding a weapon that he actually drops his flame pistol in a control room and nearly starts a fire. He leaves the dirty work to Mury, and he does not offer to shoot anyone or engage in combat or do anything that isn’t directly asked of him. Ryd goes along for the ride because he is afraid that Mury will kill him if he backs out of the mission, and he also realizes that Mury’s plan may be the only thing that saves men like him from becoming slaves. \n"
              },
              {
                "worker_id": "2",
                "uid": "3296d96a653a4b8e889f5fcbf5f265ba",
                "response_text": "Ryd is a man who lost his job a decade ago and still feels badly about it since he hasn’t been able to find a job since then. He is somewhat angry about losing his job because it wasn’t lost through any wrongdoing on his part but because he was a helio operator, and helios worked much better on Mars. He has a reputation now for asking people for loans, so when they see him, no one wants to look him in the eye for fear that he will ask for yet more money. When the owner of Burshis points out that the power cylinder from Mars will bring back jobs, Ryd acknowledges to himself that there won’t be any jobs for him; he is out of the habit of working now. Ryd has a mostly fearful outlook on life now. When Mury wants to speak with him outside the bar, Ryd is suspicious and worries that Mury might be a police officer. Ryd also feels that no one is sympathetic with him; when he did try to get another job, he was turned down because he wasn’t allied with the Poligerents. After Ryd mentions the power cylinder as the salvation of Earth, Mury lets him know that this view is based on lies because the deal is based on Earth becoming a colony of Mars. When Ryd is reluctant to help Mury, the mention of money helps sway him to help as does the thought that they will kill him now that he knows so much if he doesn’t help. At the same time, Ryd wants to help Mury to win his approval. Ryd goes along with Mury’s plans, not because he believes in the cause but because he is afraid. Ryd remains fearful and uncertain in each part of the plan as they carry it out, and he relies on Mury’s calm, cool demeanor and assurances to keep from falling apart.\n"
              },
              {
                "worker_id": "10",
                "uid": "9373b3f3c8e940d6a70979f7cc4c2599",
                "response_text": "Ryd Randl was a helio operator, who lost his job some time ago. He is struggling like many other people on Earth because of the black out power outages and inability to find work. His eagerness to get new work causes him to take risks, and get involved with Mury’s revolutionary plan. Ryd comes across as a law-abiding Earth citizen who is deeply uncomfortable with the crimes Mury ropes him into, but goes along with them in order to be paid.\n\n"
              },
              {
                "worker_id": "6",
                "uid": "d6e875b0130741eb81f012b3d25a97bc",
                "response_text": "Ryd is an Earthman who has been out of work for the past decade. His struggles with finding another job, making enough money to get by, and general hardships have made him somewhat bitter and static. Ryd is first introduced on cold Dynamopolis when he’s entering a pub, knowing he can’t pay for anything. He’s lucky to get his first free drink of the month, and he savors his alcohol. \nAlthough Ryd looked for a new job at first, he soon grew to resent the institution and men that had forced him out of his position. He was a helio operator, and a damn good one according to him, and enjoyed his job. Now, after being out of work for 10 years, he’d rather stick it to the man than beg for a new position. \nThroughout his adventure with Mury, Ryd falters on the occasion. He is not cowardly, but he is certainly not as experienced or as dangerous as Mury. However, since Ryd has nothing to lose--truly, no house, no job, no family--he can do whatever Mury asks him to, though he will pester him with questions along the way. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5099,
        "document_length_chars": 29731
      }
    }
  ]
}