{
  "item_metadata": {
    "item_id": "63048",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63048",
      "content": "Wanderers of the Wolf Moon\n \n\n By NELSON S. BOND\n \n \n They were marooned on Titan, their ship wrecked, the radio smashed. Yet they had to exist, had to build a new life on a hostile world. And the man who assumed command was Gregory Malcolm, the bespectacled secretary—whose only adventures had come through the pages of a book.\n \n [Transcriber's Note: This etext was produced from Planet Stories Spring 1944. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Sparks snapped off the switches and followed him to the door of the radio turret. Sparks was a stunted, usually-grinning, little redhead named Hannigan. But he wasn't grinning now. He laid an anxious hand on Greg's arm. \"If I was you,\" he said, \"if I was you, Malcolm, I don't think I'd say nothing to the boss about this. Not just yet, anyhow.\"\n \n Greg said, \"Why not?\"\n \n Sparks spluttered and fussed and made heavy weather of answering.\n \n \"Well, for one thing, it ain't important. It would only worry him. And then there's the womenfolks, they scare easy. Which of course they ain't no cause to. Atmospherics don't mean nothing. I've rode out worse storms than this—plenty of times. And in worse crates than the Carefree .\"\n \n Greg studied him carefully from behind trim plasta-rimmed spectacles. He drew a deep breath. He said levelly, \"So it's that bad, eh, Sparks?\"\n \n \"What bad? I just told you—\"\n \n \"I know. Sparks, I'm not a professional spaceman. But I've studied astrogation as few Earthlubbers have. It's been my hobby for years. And I think I know what we're up against.\n \n \"We hit a warp-eddy last night. We've been trapped in a vortex for more than eight hours. Lord only knows how many hundreds of thousands of miles we've been borne off our course. And now we've blasted into a super-ionized belt of atmospherics. Your radio signals are blanketed. You can't get signals in or out. We're a deaf-mute speck of metal being whirled headlong through space. Isn't that it?\"\n \n \"I don't know what—\" began Sparks hotly. Then he stopped, studied his companion thoughtfully, nodded. \"O.Q.,\" he confessed, \"that's it. But we ain't licked yet. We got three good men on the bridge. Townsend ... Graves ... Langhorn. They'll pull out of this if anybody can. And they ain't no sense in scaring the Old Man and his family.\"\n \n \"I won't tell them,\" said Greg. \"I won't tell them unless I have to. But between you and me, what are the odds against us, Sparks?\"\n \n The radioman shrugged.\n \n \"Who knows? Vortices are unpredictable. Maybe the damn thing will toss us out on the very spot it picked us up. Maybe it will give us the old chuckeroo a million miles the other side of Pluto. Maybe it will crack us up on an asteroid or satellite. No way of telling till it happens.\"\n \n \"And the controls?\"\n \n \"As useless,\" said Sparks, \"as a cow in a cyclone.\"\n \n \"So?\"\n \n \"We sit tight,\" said Sparks succinctly, \"and hope.\"\n \n Malcolm nodded quietly. He took off his spectacles, breathed on them, wiped them, replaced them. He was tall and fair; in his neat, crisply pressed business suit he appeared even slimmer than he was. But there was no nervousness in his movements. He moved measuredly. \"Well,\" he said, \"that appears to be that. I'm going up to the dining dome.\"\n \n Sparks stared at him querulously.\n \n \"You're a queer duck, Malcolm. I don't think you've got a nerve in your body.\"\n \n \"Nerves are a luxury I can't afford,\" replied Greg. \"If anything happens—and if there's time to do so—let me know.\" He paused at the door. \"Good luck,\" he said.\n \n \"Clear ether!\" said Sparks mechanically. He stared after the other man wonderingly for a long moment, then went back to his control banks, shaking his head and muttering.\n \n \n\n \n Gregory Malcolm climbed down the Jacob's-ladder and strode briskly through the labyrinthine corridors that were the entrails of the space yacht Carefree . He paused once to peer through a perilens set into the ship's port plates. It was a weird sight that met his gaze. Not space, ebony-black and bejewelled with a myriad flaming splotches of color; not the old, familiar constellations treading their ever-lasting, inexorable paths about the perimeter of Sol's tiny universe, but a shimmering webwork of light, so tortured-violet that the eyes ached to look upon it. This was the mad typhoon of space-atmospherics through which the Carefree was now being twisted, topsy-turvy, toward a nameless goal.\n \n He moved on, approaching at last the quartzite-paned observation rotunda which was the dining dome of the ship.\n \n His footsteps slowed as he composed himself to face those within. As he hesitated in the dimly-lighted passage, a trick of lights on glass mirrored to him the room beyond. He could see the others while they were as yet unaware of his presence. Their voices reached him clearly.\n \n J. Foster Andrews, his employer and the employer of the ten thousand or more men and women who worked for Galactic Metals Corporation, dominated the head of the table. He was a plump, impatient little Napoleon. Opposite him, calm, graceful, serene, tastefully garbed and elaborately coiffured even here in deep space, three weeks from the nearest beauty shop, sat his wife, Enid.\n \n On Andrews' right sat his sister, Maud. Not young, features plain as a mud fence, but charming despite her age and homeliness simply because of her eyes; puckish, shrewdly intelligent eyes, constantly aglint with suppressed humor at—guessed Greg—the amusing foibles and frailties of those about her.\n \n She gave her breakfast the enthusiastic attention of one too old and shapeless to be concerned with such folderol as calories and dietetics, pausing only from time to time to share smidgeons of food with a watery-eyed scrap of white, curly fluff beside her chair. Her pet poodle, whom she called by the opprobrious title of \"Cuddles.\"\n \n On J. Foster's left sat his daughter, Crystal. She it was who caused Gregory Malcolm's staid, respectable heart to give a little lurch as he glimpsed her reflected vision—all gold and crimson and cream—in the glistening walls. If Crystal was her name, so, too, was crystal her loveliness.\n \n But—Greg shook his head—but she was not for him. She was already pledged to the young man seated beside her. Ralph Breadon. He turned to murmur something to her as Greg watched; Greg saw and admired and disliked his rangy height, his sturdy, well-knit strength, the rich brownness of his skin, his hair, his eyes.\n \n The sound of his own name startled Greg.\n \n \"Malcolm!\" called the man at the head of the table. \"Malcolm! Now where in blazes is he, anyhow?\" he demanded of no one in particular, everyone in general. He spooned a dab of liquid gold from a Limoges preserve jar, tongued it suspiciously, frowned. \"Bitter!\" he complained.\n \n \"It's the very best Martian honey,\" said his wife.\n \n \"Drylands clover,\" added Crystal.\n \n \"It's still bitter,\" said J. Foster petulantly.\n \n His sister sniffed. \"Nonsense! It's delightful.\"\n \n \"I say it's bitter,\" repeated Andrews sulkily. And lifted his voice again. \" Malcolm! Where are you?\"\n \n \"You called me, sir?\" said Malcolm, moving into the room. He nodded politely to the others. \"Good morning, Mrs. Andrews ... Miss Andrews ... Mr. Breadon....\"\n \n \"Oh, sit down!\" snapped J. Foster. \"Sit down here and stop bobbing your head like a teetotum! Had your breakfast? The honey's no good; it's bitter.\" He glared at his sister challengingly. \"Where have you been, anyway? What kind of secretary are you? Have you been up to the radio turret? How's the market today? Is Galactic up or down?\"\n \n Malcolm said, \"I don't know, sir.\"\n \n \"Fine! Fine!\" Andrews rattled on automatically before the words registered. Then he started, his face turning red. \"Eh? What's that? Don't know! What do you mean, you don't know? I pay you to—\"\n \n \"There's no transmission, sir,\" said Greg quietly.\n \n \"No trans—nonsense! Of course there's transmission! I put a million credits into this ship. Finest space-yacht ever built. Latest equipment throughout. Sparks is drunk, that's what you mean! Well, you hop right up there and—\"\n \n \n\n \n Maud Andrews put down her fork with a clatter. \"Oh, for goodness sakes, Jonathan, shut up and give the boy time to explain! He's standing there with his mouth gaping like a rain-spout, trying to get a word in edgewise! What's the trouble, Gregory?\" She turned to Greg, as Jonathan Foster Andrews wheezed into startled silence. \" That? \"\n \n She glanced at the quartzite dome, beyond which the veil of iridescence wove and cross-wove and shimmered like a pallid aurora.\n \n Greg nodded. \"Yes, Miss Andrews.\"\n \n Enid Andrews spoke languidly from the other end of the table.\n \n \"But what is it, Gregory? A local phenomenon?\"\n \n \"You might call it that,\" said Greg, selecting his words cautiously.\n\"It's an ionized field into which we've blasted. It—it—shouldn't stay with us long. But while it persists, our radio will be blanketed out.\"\n \n Breadon's chestnut head came up suddenly, sharply.\n \n \"Ionization! That means atmosphere!\"\n \n Greg said, \"Yes.\"\n \n \"And an atmosphere means a body in space somewhere near—\" Breadon stopped, bit his lip before the appeal in Malcolm's eyes, tried to pass it off easily. \"Oh, well—a change of scenery, what?\"\n \n But the moment of alarm in his voice had not passed unnoticed. Crystal Andrews spoke for all of them, her voice preternaturally quiet.\n \n \"You're hiding something, Malcolm. What is it? Is there—danger?\"\n \n But Greg didn't have to answer that question. From the doorway a harsh, defiantly strident voice answered for him. The voice of Bert Andrews, Crystal's older brother.\n \n \"Danger? You're damn right there's danger! What's the matter with you folks—are you all deaf, dumb and blind? We've been caught in a space-vortex for hours. Now we're in the H-layer of a planet we can't even see—and in fifteen minutes or fifteen seconds we may all be smashed as flat as pancakes!\"\n \n The proclamation brought them out of their chairs. Greg's heart sank; his vain plea, \"Mr. Andrews—\" was lost in the medley of Crystal's sudden gasp, Enid Andrews' short, choking scream, J. Foster's bellowing roar at his only son.\n \n \"Bert—you're drunk!\"\n \n Bert weaved precariously from the doorway, laughed in his father's face.\n \n \"Sure I'm drunk! Why not? If you're smart you'll get drunk, too. The whole damn lot of you!\" He flicked a derisive hand toward Greg. \"You too, Boy Scout! What were you trying to do—hide the bad news from them? Well, it's no use. Everybody might as well know the worst. We're gone gooses ... geeses ... aw, what the hell! Dead ducks!\" He fell into a chair, sprawled there laughing mirthlessly with fear riding the too-high notes of his laughter.\n \n J. Foster turned to his secretary slowly. His ire had faded; there was only deep concern in his voice.\n \n \"Is he telling the truth, Malcolm?\"\n \n Greg said soberly, \"Partly, sir. He's overstating the danger—but there is danger. We are caught in a space-vortex, and as Mr. Breadon realized, the presence of these ionics means we're in the Heaviside-layer of some heavenly body. But we may not crack up.\"\n \n Maud Andrews glanced at him shrewdly.\n \n \"Is there anything we can do?\"\n \n \"Not a thing. The officers on the bridge are doing everything possible.\"\n \n \"In that case,\" said the older woman, \"we might as well finish our breakfast. Here, Cuddles! Come to momsy!\" She sat down again. Greg looked at her admiringly. Ralph Breadon stroked his brown jaw. He said,\n\"The life-skiffs?\"\n \n \"A last resort,\" said Greg. \"Sparks promised he'd let me know if it were necessary. We'll hope it's not—\"\n \n But it was a vain hope, vainly spoken in the last, vain moment. For even as he phrased the hopeful words, came the sound of swift, racing footsteps up the corridor. Into the dining dome burst Hannigan, eyes hot with excitement. And his cry dispelled Greg's final hopes for safety.\n \n \"Everybody—the Number Four life-skiff— quick ! We've been caught in a grav-drag and we're going to crash!\"\n \n \n\n II\n \n Those next hectic moments were never afterward very clear in Greg Malcolm's memory. He had a confused recollection of hearing Sparks' warning punctuated by a loud, shrill scream which he vaguely identified as emanating from Mrs. Andrews' throat ... he was conscious of feeling, suddenly, beneath his feet the sickening, quickening lurch of a ship out of control, gripped by gravitational forces beyond its power to allay ... he recalled his own voice dinning in his ears as, incredibly, with Sparks, he took command of the hasty flight from the dining dome down the corridor to the aft ramp, up the ramp, across girdered beams in the super-structure to the small, independently motored rocket-skiff cradled there.\n \n He was aware, too, of strangely disconnected incidents happening around him, he being a part of them but seeming to be only a disinterested spectator to their strangeness. Of his forcing Maud Andrews toward the door of the dome ... of her pushing back against him with all the weight of her body ... of her irate voice, \"Cuddles! I forgot him!\" Then the shrill excited yapping of the poodle cradled against her as they charged on down the corridor.\n \n J. Foster waddling beside him, tugging at his arm, panting, \"The officers?\" and his own unfelt assurance. \"They can take care of themselves. It's a general 'bandon ship.\" Enid Andrews stumbling over the hem of a filmy peignoir ... himself bending to lift her boldly and bodily, sweating palms feeling the warm animal heat of her excited body hot beneath them ... Crystal Andrews stopping suddenly, crying,\n\"'Tina!\" ... and Hannigan's reply, \"Your maid? I woke her. She's in the life-skiff.\" Bert Andrews stopping suddenly, being sick in the middle of the corridor, his drunkenness losing itself in the thick, sure nausea of the ever-increasing unsteadiness beneath their feet.\n \n Then the life-skiff, the clang of metal as Hannigan slammed the port behind the last of them, the fumbling for a lock-stud, the quick, grateful pant of the miniature hypos, and a weird feeling of weightlessness, rushingness, hurtlingness as his eardrums throbbed and his mouth tasted brassy and bloody with the fierce velocity of their escape.\n \n Sense and meaning returned only when all this ended. As one waking from a nightmare dream, Greg Malcolm returned to a world he could recognize. A tiny world, encased within the walls of a forty-foot life-skiff. A world peopled too scantily. Andrews, his wife and sister, his son and daughter; 'Tina Laney, the maid; Breadon, Hannigan, young Tommy O'Doul, the cabin-boy (though where he had come from, or when, Greg did not know). And himself. In a life-skiff. In space.\n \n Somewhere in space. He looked through the perilens . What he saw then he might better never have seen. For that shimmering pink-ochre veil had wisped away, now, and in the clean, cold, bitter-clear light of a distant sun he watched the death-dive of the yacht Carefree .\n \n Like a vast silver top, spinning heedlessly, wildly, it streaked toward a mottled gray and green, brown and dun, hard and crushing-brutal terrain below. Still at its helm stood someone, for even in that last dreadful moment burst from its nose-jets a ruddy mushroom of flame that tried to, but could not, brake the dizzy fall.\n \n For an instant Greg's eyes, stingingly blinded and wet, thought they glimpsed a wee black mote dancing from the bowels of the Carefree ; a mote that might be another skiff like their own. But he could not be sure, and then the Carefree was accelerating with such violence and speed that the eye could see it only as a flaming silver lance against the ugly earth-carcase beneath, and then it struck and a carmine bud of flame burst and flowered for an instant, and that was all....\n \n And Greg Malcolm turned from the perilens , shaken.\n \n Hannigan said, \"It's over?\" and Greg nodded.\n \n Hannigan said, \"The other skiffs? Did they break free, or were they caught?\"\n \n \"I don't know. I couldn't see for sure.\"\n \n \"You must have seen. Are we the only ones?\"\n \n \"I couldn't see for sure. Maybe. Maybe not.\"\n \n Then a body scrambled forward, pressing through the tightness of other huddled bodies, and there was a hand upon his elbow. \"I'll take over now, Malcolm.\"\n \n \n\n \n It was Ralph Breadon. Gregory looked at him slowly, uncomprehendingly at first. His hand was reluctant to leave the guiding-gear of the small ship which was, now, all that remained to them of civilization and civilization's wondrous accomplishments. He had not realized until this moment that for a while ... for a short, eager, pulse-quickening while ... on his alertness, in his hands, had depended the destinies of ten men and women. But he knew, suddenly and completely, that it was for this single moment his whole lifetime had waited. It was for this brief moment of command that some intuition, some instinct greater than knowledge, had prepared him. This was why he, an Earthlubber, had studied astrogation, made a hobby of the empire of the stars. That he might be fitted to command when all others failed. And now—\n \n And now the moment was past, and he was once again Gregory Malcolm, mild, lean, pale, bespectacled secretary to J. Foster Andrews. And the man at his side was Ralph Breadon, socialite and gentleman sportsman, trained pilot. And in Malcolm the habit of obedience was strong....\n \n \"Very well, sir,\" he said. And he turned over the controls.\n \n What happened then was unfortunate. It might just as well have happened to Malcolm, though afterward no one could ever say with certainty. However that was, either by carelessness or malfortune or inefficiency, once-thwarted disaster struck again at the little party on the life-skiff. At the instant Breadon's hand seized the controls the skiff jerked suddenly as though struck with a ponderous fist, its throbbing motors choked and snarled in a high, rising crescendo of torment that lost itself in supersonic heights, and the ship that had been drifting easily and under control to the planet beneath now dipped viciously.\n \n The misfortune was that too many huddled in the tiny space understood the operation of the life-skiff, and what must be done instantly. And that neither pilot was as yet in control of the ship. Breadon's hand leaped for the Dixie rod, so, too, did Malcolm's—and across both their bodies came the arm of Sparks Hannigan, searching the controls.\n \n In the scramble someone's sleeve brushed the banks of control-keys. The motors, killed, soughed into silence. The ship rocked into a spin. Greg cried out, his voice a strange harshness in his ears; Breadon cursed; one of the women bleated fearfully.\n \n Then Breadon, still cursing, fought all hands from the controls but his own. And the man was not without courage. For all could see plainly, in the illumined perilens , how near to swift death that moment of uncertainty had led them. The skiff, which an instant before had been high in the stratosphere of this unknown planet ... or satellite or whatever it might be ... was now flashing toward hard ground at lightning speed.\n \n \n\n \n Only a miracle, Greg knew, could save them now. An impulse spun his head, he looked at Crystal Andrews. There was no fear in her eyes. Just a hotness and an inexplicable anger. Beside her was the other girl, the maid, 'Tina; she was frankly afraid. Her teeth were clenched in her nether lip, and her eyes were wide and anxious, but she did not cry out.\n \n Only a miracle could save them now. But Breadon's hands performed that miracle; his quick, nerveless, trained hands. A stud here ... a lever there ... a swift wrenching toss of the shoulders. His face twisted back over his shoulder, and his straining lips pulled taut and bloodless away from his teeth. \"Hold tight, folks! We're going to bounce—\"\n \n Then they struck!\n \n But they struck glancingly, as Breadon had hoped, and planned for, and gambled on. They struck and bounced. The frail craft shivered and groaned in metal agony, jarred across harsh soil, bounced again, settled, nosed over and rocked to a standstill. Somewhere forward something snapped with a shrill, high ping! of stress; somewhere aft was the metallic flap-clanging of broken gear trailing behind them. But they were safe.\n \n Breath, held so long that he could not remember its inhalation, escaped Greg's lungs in a long sigh. \"Nice work, Mr. Breadon!\" he cried. \"Oh, nice work!\"\n \n But surprisingly, savagely, Breadon turned on him.\n \n \"It would have been better work, Malcolm, if you'd kept your damned hands off the controls! Now see what you've done? Smashed up our skiff! Our only—\"\n \n \"He didn't do it!\" piped the shrill voice of Tommy O'Doul. \"You done it yourself, Mr. Breadon. Your sleeve. It caught the switch.\"\n \n \"Quiet!\" Breadon, cheeks flushed, reached out smartly, stilled the youngster's defense with a swift, ungentle slap. \"And you, Malcolm—after this, do as you're told, and don't try to assume responsibilities too great for you. All right, everybody. Let's get out and see how bad the damage is.\"\n \n Instinctively Greg had surged a half step forward as Breadon silenced the cabin boy. Now old habit and common-sense halted him. He's overwrought, he reasoned. We're all excited and on edge. We've been to Bedlam. Our nerves are shot. In a little while we'll all be back to normal.\n \n He said quietly, \"Very well, Mr. Breadon.\" And he climbed from the broken skiff.\n \n \n\n \n Hannigan said, \"Looks bad, don't it?\"\n \n \"Very,\" said Malcolm. He fingered a shard of loose metal flapping like a fin from the stern of the skiff. \"Not hopeless, though. There should be an acetylene torch in the tool locker. With that—\"\n \n \"You ought to of poked him,\" said Hannigan.\n \n \"What? Oh, you mean—?\"\n \n \"Yeah. The kid was right, you know. He done it.\"\n \n \"His sleeve, you mean. Well, it was an accident,\" said Greg. \"It could have happened to anyone. And he made a good landing. Considering everything. Anyhow—\" Again he was Gregory Malcolm, serious-faced, efficient secretary. \"Anyhow, we have been thrust into an extremely precarious circumstance. It would be silly to take umbrage at a man's nervous anger. We must have no quarreling, no bickering—\"\n \n \"Umbrage!\" snorted Sparks. \"Bickering! They're big words. I ain't sure I know what they mean. I ain't exactly sure they mean anything .\" He glanced at Greg oddly. \"You're a queer jasper, Malcolm. Back there on the ship, I figured you for a sort of a stuffed-shirt. Yes-man to the boss. And then in the show-down, you come through like a movie hero—for a little while. Then you let that Breadon guy give you the spur without a squawk—\"\n \n Malcolm adjusted his plasta-rimmed spectacles. He said, almost stubbornly, \"Our situation is grave. There must be no bickering.\"\n \n \"Bickering your Aunt Jenny! What do you call that?\"\n \n Sparks jerked a contemptuous thumb toward the group from which they were separated. Upon disembarking, only Greg and Sparks had moved to make a careful examination of their damaged craft. The others, more or less under the direction of Breadon, were making gestures toward removing certain necessaries from the skiff. Their efforts, slight and uncertain as they were, had already embroiled them in argument.\n \n The gist of their argument, so far as Greg Malcolm could determine, was that everyone wanted \"something\" to be done, but no two could agree as to just what that something was, and no one seemed to have any bursting desire to participate in actual physical labor.\n \n J. Foster Andrews, all traces of his former panic and confusion fled, was planted firmly, Napoleonically, some few yards from the open port of the life-skiff, barking impatient orders at little Tommy O'Doul who—as Greg watched—stumbled from the port bearing a huge armload of edibles.\n \n 'Tina, the maid, was in a frenzy of motion, trying to administer to the complaints and demands of Mrs. Andrews (whose immaculate hair-do had suffered in the frenetic minutes of their flight) and Crystal Andrews\n(who knew perfectly well there were sweaters in the life-skiff) and Miss Maud (who wanted a can of prepared dog-food and a can-opener immediately, and look at poor Cuddles, momsy's 'ittle pet was so hungry)!\n \n Bert Andrews was sulkily insisting that it was nonsense to leave the warmth and security of the skiff anyway, and he wished he had a drink, while the harassed, self-appointed commander of the refugee corps was shouting at whomever happened, at any given moment, to capture his divided and completely frantic attention. His orders were masterpieces of confusion, developing around one premise that the castaway crew should immediately set up a camp. Where, how, or with what nonexistent equipment, Breadon did not venture to say.\n \n \"You see what I mean?\" demanded Sparks disgustedly.\n \n \n\n \n Greg Malcolm saw. He also saw other things. That their landing-spot, while excellent for its purpose, was not by any manner of means an ideal campsite. It was a small, flat basin of sandy soil, rimmed by shallow mountains. His gaze sought these hills, looked approvingly on their greenness, upon the multitude of dark pock-marks dotting them. These caves, were they not the habitations of potential enemies, might well become the sanctuaries of spacewrecked men.\n \n He saw, also, a thin ribbon of silver sheering the face of the northern hills. His gaze, rising still skyward, saw other things—\n \n He nodded. He knew, now, where they were. Or approximately. There was but one planet in the solar system which boasted such a phenomenon. The apparent distance of the Sun, judged by its diminished disc, argued his judgment to be correct. The fact that they had surged through an atmospheric belt for some length of time before finally meeting with disaster.\n \n \"Titan,\" he said. \"Hyperion possibly. But probably Titan.\"\n \n Sparks' gaze, following Greg's upward, contracted in an expression of dismay.\n \n \"Dirty cow! You mean that's where we are?\"\n \n \"I believe so. There's Saturn, our mother planet, looming above us as large as a dinner plate. And the grav-drag here is almost Earth norm. Titan has a 3,000 mile diameter. That, combined with the Saturnian tractile constant, would give us a strong pull.\"\n \n Sparks wailed, \"But Titan! Great morning, Malcolm, nobody ever comes to Titan! There ain't no mines here, no colonies, no—\" He stopped suddenly, his eyes widening yet farther. \"And, hey—this place is dangerous ! There are—\"\n \n \"I know it,\" said Greg swiftly, quietly. \"Shut up, Sparks. No use telling the others. If they don't guess it themselves, what they don't know won't alarm them. We've got to do something, though. Get ourselves organized into a defensive community. That's the only way—\"\n \n Ralph Breadon's sharp, dictatorial voice interrupted him. \"Well, Malcolm, stop soldiering and make yourself useful!\"\n \n And J. Foster, not to have his authority usurped, supplemented the order. \"Yes, Malcolm, let's get going! No time for day-dreaming, my man. We want action!\"\n \n Sparks said, \"Maybe you'll get it now, fatty!\" under his breath, and looked at Malcolm hopefully. But his companion merely nodded, moved forward toward the others, quietly obedient to the command.\n \n \"Yes, sir,\" he said.\n \n Hannigan groaned and followed him.\n \n \n\n III\n \n Breadon said, \"All right, Tommy, dump them here. I have a few words to say.\" He glanced about him pompously. \"Now, folks, naturally we want to get away from here as soon as possible. Therefore I delegate you, Sparks, to immediately get a message off. An SOS to the nearest space cruiser.\"\n \n Hannigan grinned. It was not a pleasant grin. He took his time answering. He spat thoughtfully on the ground before him, lifted his head. He said, \"A message, huh?\"\n \n \"That's what I said.\"\n \n \"And what'll I send it with?\" drawled Sparks. \"Tom-toms?\"\n \n Breadon flushed darkly.\n \n \"I believe the life-skiff was equipped with a radio? And theoretically you are a radio operator?\"\n \n \"Finest radio money can buy!\" interpolated J. Foster Andrews proudly.\n\"Put a million credits into the Carefree . Best equipment throughout.\"\n \n Sparks looked from one to another of them, grinned insolently. \"You're both right. I am a radio operator, and there was a radio. But we crashed, remember? On account of some dope's sleeve got caught in the master switch—\"\n \n \"That will do!\" snapped Breadon angrily. He stared at the bandy-legged little redhead. \"You mean the radio was broken?\"\n \n \"It wasn't helped none. The tubes was made out of glass, and glass don't bounce so good.\"\n \n Greg Malcolm said thoughtfully, \"Sparks, can't you fix it?\"\n \n \"Well, mebbe. But not in five minutes. Maybe not in five years. I won't know till I get going on it.\"\n \n Breadon frowned.\n \n \"I'll handle this, Malcolm,\" he crisped. Again to the radioman, \"Well, you get to work on it immediately. And as soon as you get it fixed, send out an SOS advising the patrol where we are—\"\n \n \"Speaking of which,\" insinuated Sparks, \"where are we?\"\n \n Breadon glared at him wrathfully.\n \n \"Why—why on one of the satellites of Saturn, of course. Any fool can see that!\"\n \n \"O.Q. But does any fool know which one? Or shall I tell you it's Titan? And when you know that, then what? Titan wasn't named that on account of it was a pimple. It's a big place. What'll I tell the Patrol? SOS. Stranded in the middle of we-don't-know-where, somewhere on Titan, maybe. They'll be hunting for us till we've got whiskers down to our knees.\"\n \n Breadon's irate look vanished. He looked stricken. He said, \"I—I don't know. We have a compass—\"\n \n Once again it was Gregory Malcolm who entered into the conversation. He had been toying, almost absentmindedly, with a funnel taken from the skiff's stores. Into this he had poured a small portion of water; his right forefinger was pressed to the bottom of the tube, closing it. He said, \"I can answer part of that question now. Enough to cut the search in half, anyway. We're in the northern hemisphere of the satellite.\"\n \n Maud Andrews looked at him sharply as if noticing him for the first time in her life.\n \n \"How,\" she asked, \"did you know that, Malcolm?\"",
      "metadata": {
        "title": "Wanderers of the Wolf Moon",
        "author": "Nelson S. Bond",
        "passage_id": "63048",
        "uid": "13552dab1387407a84a315166e44bb2d",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "102",
                "uid": "3e0585dedd3b428384cd4ca6655fc016",
                "response_text": "Gregory Malcolm is a secretary to J. Foster Andrews, the wealthy leader of the Galactic Metals Corporation. In the control room of Andrews’s space yacht the Carefree, Sparks, the radioman, fails to downplay the seriousness of their situation to Malcolm: the Carefree has been sucked into an unpredictable vortex and the fate of the ship and its occupants is uncertain. \n\tMalcolm approaches the dining room, where Andrews and members of his family are enjoying breakfast. He is unnoticed by his employers, but takes note of Andrews’s beautiful daughter Crystal and her betrothed Ralph Breadon. Suddenly, Andrews calls Malcolm over to complain about the honey and to enquire about the state of the Galactic market. Malcolm, in virtue of the fact that the vortex has blocked communication to and from the Carefree, is unable to answer. Crystal asks Malcolm if they are in danger, but before he is able to answer the question, Crystal’s older brother Bert enters drunkenly and suggests that they are doomed. \nSparks abruptly enters the room and confirms Bert’s drunken suspicion: they have been caught in a gravitation downdraft and must evacuate to a life skiff. On the skiff with members of the Andrews family, Sparks, a cabin-boy, and Breadon, Malcolm navigates above a celestial body and observes the crash of the Carefree. Just as Malcolm surrenders control of the skiff to Breadon, its engines engage and they quickly fall towards the planet. Breadon deftly manipulates the controls, and they land safely. As Malcolm quickly congratulates Breadon on his landing, the latter blames and berates the secretary for the fall. The cabin-boy, however, points out that Breadon’s sleeve was responsible for their descent. \nMalcolm and Sparks examine the damage to the skiff, and Sparks shares his frustrations about Malcolm’s submissive, secretarial behaviour. Malcolm concludes that they are on a rarely-visited, unpopulated, vast, and dangerous moon of Saturn called Titan. Malcolm resolves not to tell the Andrews, fearing that the information would only make them panic. Meanwhile, the Andrews family are in disarray over how best to remove necessities from the skiff.\nBreadon delegates to Sparks the role of establishing communication. Sparks, however, responds poorly and reveals that they are on Titan, and that their chances of rescue are dim. \n"
              },
              {
                "worker_id": "101",
                "uid": "2f4b47afa00044028592e9170e5f5828",
                "response_text": "Gregory Malcolm is the secretary of J. Foster Andrews, a wealthy man in charge of the Galactic Metals Corporation. While aboard their ship, Hannigan, a radio operator and companion of Malcolm, discloses that they have entered a vortex and remain trapped with no transmission or radio signal. Hannigan advises that Malcolm doesn't tell the Andrews family and instead waits until there is more information. Malcolm enters the dining dome, where the Andrews family sits, including Crystal, their daughter who Malcolm admires, and Ralph Breadon, her suitor. J. Foster asks Malcolm for information about the corporation's business, to which Malcolm is unable to answer due to the lack of radio transmission. The Andrews family notices the odd situation outside the ship's port and questions Malcolm further, but a drunk Bert Andrews interrupts, panicking and revealing the dire situation at hand. Malcolm reassures the family that there is no immediate danger yet, but Hannigan then enters, urgently yelling at everyone to board the life skiff due to emergency. The team runs to the life skiff, where Malcolm and Hannigan frantically operate it until Breadon insists on taking over. Breadon gains control but the life skiff still faces danger, and as Malcolm and Hannigan scramble over the controls, Breadon steers the life skiff onto the ground; the team survives but the skiff is wrecked. Breadon blames Malcolm for the crash, and Malcolm leaves the situation alone, which Hannigan discourages. After inspection, Malcolm determines that the team has crashed on the planet Titan."
              },
              {
                "worker_id": "103",
                "uid": "4250e2bbce3947ed90cfd7bb64bbb83f",
                "response_text": "The story starts with Hannigan trying to tell Greg that the atmospherics don’t need to be worried, these are not worth reporting to the boss. However, Greg has studied astrogation and is sure that they are in a vortex. He knows that they have been in the vortex for more than eight hours, but he has no idea how much longer nor how far the ship will go. Agreeing not to tell the boss, Greg goes upstairs to the dining room. Right after he arrives by the door, J. Foster Andrews of Galactic Metals Corporation, starts calling him. He comes in and is asked about the transmission, which he says that there is none. Before he has time to finish explaining himself, Bert Andrews, one of J. Foster Andrews’ son, came in and told everyone that they have been in the vortex for a long time, and they could crash at any moment. J. Foster then turns to confirm with Greg, who explains that it is indeed true, only a bit exaggerated. However, Hannigan comes in and rushes everyone to get on Number Four life-skiff. They are about to crash. \n\nThey all rush to the life-skiff. And Breadon, the person that J. Foster Andrew daughter’s engaged to, tries to get the control from Greg. And in the middle of this, someone hit the control-keys and the motor is killed. Then all of a sudden, Greg, Breadon, and Hannigan all try to reach the control. However, in the end, it is the Breadon that performed the miracle in saving all of them. Later Greg and Hannigan goes to check the ship while others are all doing their own things. Looking around, Greg realizes that they are on Titan, one of Saturn’s satellites. Then Breadon orders Hannigan to send an SOS message to the nearest space cruiser. Hannigan asks Breadon, mockingly, what he should use, and if he knows where they are at. Breadon got stuck with so many questions coming at once, then it is Greg who said: they are on the northern hemisphere of the satellite. "
              },
              {
                "worker_id": "104",
                "uid": "75d2792207894b50b3b6046abc964095",
                "response_text": "The story begins with Sparks and Malcolm discussing their predicament on the ship Carefree. The ship is trapped in a vortex that has blown it off course. Malcolm goes to the rotunda where food is being served to the Andrews family. The Andrews family is surrounding the table, including Crystal, who Malcolm fancies. After some loud talking from the family, eventually, Greg informs them that they are in an ionized field and the transmission does not work. The family becomes quite concerned at the news. The son of Andrews, Bert, walks into the doorway in a drunken manner. He tells everyone that they should be concerned. While Malcolm is trying to calm the family down, Sparks runs into the room yelling at everyone to head towards the life skiff. There is a mad rush towards the life skiff that caused a lot of confusion. The Carefree bursts into flames and Malcolm says that he is unsure if the other skiffs were able to escape in time. \n\nMalcolm is piloting the ship when Breadon commands him to hand over the controls. When he does, Breadon’s sleeve brushes against the control keys causing the motors to be turned off. Many people rush to fix the skiff, but Breadon is ultimately the person who guides the skiff to the ground. Breadon yells at Malcolm for interfering, but the cabin boy, Tommy, defends Malcolm. Breadon continues to belittle Malcolm. Sparks tells Malcolm that he is strange and he needs to defend himself against Breadon. \n\nEveryone disembarks from the ship. Bert tries to give orders, but the orders seem to be nonsensical. Malcolm is the first person to realize where the group has crash-landed. Breadon then commands Sparks to send an SOS message. Sparks mocks him by questioning how he should send a message and where he should say they are located, knowing that Breadon does not have the answer. Breadon is not able to specify exactly where they are located. Malcolm completes an experiment that is able to narrow down which hemisphere of the satellite they are located in, displaying a skill that Breadon does not possess. Maud Andrews is inquisitive of how Malcolm could have possibly been able to know where they crash-landed. \n"
              }
            ]
          },
          {
            "question_text": "Who are the members aboard the life skiff with Malcolm?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "102",
                "uid": "3e0585dedd3b428384cd4ca6655fc016",
                "response_text": "On life skiff number four, the skiff onto which Gregory Malcolm had evacuated were himself, his employers J. Foster Andrews, the head of the Galactic Metals Corporations, and his family: Andrews’s tall and well-styled wife Enid, his plain-featured, out of shape but beautiful-eyed sister Maud, Maud’s poodle Cuddles, Andrews’s drunk son Bert, Andrews’s beautiful daughter Crystal, and the man to whom Crystal was promised, Ralph Breadon. Malcolm describes Ralph as tall and strong-knit, with tanned skin. Also aboard the skiff were the maid of the Andrews family, ‘Tina Laney, a cabin boy named Tommy O’Doul, and the radio engineer of the Carefree named Hannigan, who is also called Sparks. \n"
              },
              {
                "worker_id": "101",
                "uid": "2f4b47afa00044028592e9170e5f5828",
                "response_text": "Accompanying Malcolm on the life skiff are Hannigan, also known as Sparks, who is a radio operator, Tommy, a young cabin-boy, Tina, the maid, and the Andrews family and their company. The Andrews family consists of J. Foster Andrews, Malcolm's employer, his wife Enid, his sister Maud, his daughter Crystal, his son Bert, and Crystal's suitor, Ralph Breadon. The Andrews make up the majority of the members on the life skiff, while Malcom, Hannigan, Tommy, and Tina work under them and attempt to evade disaster. "
              },
              {
                "worker_id": "103",
                "uid": "4250e2bbce3947ed90cfd7bb64bbb83f",
                "response_text": "The members that boarded the life skiff with Malcolm are J. Foster Andrews, his wife, their daughter, the maid, Breadon, Hannigan, young Tommy O’Doul, and a cabin boy, whom Malcolm has no idea where he came from and when. J. Foster Andrews is the employer of people that are working for the Galatic Metals Corporation. His wife is Enid. Their daughter is Crystal, who is engaged to Breadon. Maud, the sister of Andrews is also on board. She and per puppy \"Cuddles\" board the life-skiff together. They were not able to see any other life-skiffs. They are unsure if they did break free of they got caught along with the ship. "
              },
              {
                "worker_id": "104",
                "uid": "75d2792207894b50b3b6046abc964095",
                "response_text": "Those that were able to make it into the life skiff with Malcolm during the emergency include Andrew, Enid, Crystal, Ralph, Maud, Sparks, Tommy O’Doul, and Bert. Bert is Andrew’s son. Enid is the wife of Andrew. Maud is Andrew’s sister. Crystal is Andrew’s daughter. Ralph is the man Crystal is pledged to. Tommy is a cabin boy. Malcolm is Andrew’s secretary. Sparks Hannigan is a radio operator. Tommy, Malcolm, and Sparks are all employees of Andrews’ family. "
              }
            ]
          },
          {
            "question_text": "What is the relationship between Malcolm and Breadon?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "102",
                "uid": "3e0585dedd3b428384cd4ca6655fc016",
                "response_text": "Gregory Malcolm is a secretary to J. Foster Andrews, father of Crystal Andrews, who is promised to Ralph Breadon. Malcolm is attracted to Crystal, and dislikes Breadon’s appearance, though he admires it as well. In the life skiff, Breadon behaves in a domineering manner towards Malcolm, suggesting that he hand over the controls of the skiff. During the transfer of controls, however, Breadon’s sleeve is caught on a switch and causes the skiff to crash towards Titan. During their descent, Malcolm attempts to control their trajectory but is dismissed by Breadon, who successfully lands the skiff on the moon of Saturn. Malcolm quickly congratulates Breadon, but is berated for interfering. Despite this, however, Malcolm later rationalizes Breadon’s arrogant behaviour and maintains to Sparks, the radio engineer, that he holds no grudge against him, seemingly hiding his anger behind his job as a secretary. \n\n"
              },
              {
                "worker_id": "101",
                "uid": "2f4b47afa00044028592e9170e5f5828",
                "response_text": "Malcolm and Breadon have a tense relationship. Malcolm is enamored of Crystal, and admires her beauty and loveliness. However, Ralph Breadon is Crystal's lover, which sets a competitive tone between the two. Malcolm is jealous of Breadon, not only because of his relationship to Crystal but is also threatened by him and his appearance. Their competitive nature is seen in the story, particularly when Breadon overtakes Malcolm's control of the life skiff; the two bicker and fumble over the control of the aircraft, and the life skiff ends up crashing onto Titan. Malcolm commends Breadon for keeping the members alive, but Breadon blames him for the crash, though it was his own sleeve being caught on the control that caused it. Though Malcolm and Breadon have problems with each other, Malcolm is more obedient and tries to avoid additional conflict. "
              },
              {
                "worker_id": "103",
                "uid": "4250e2bbce3947ed90cfd7bb64bbb83f",
                "response_text": "We learn from the beginning of the story, Crystal, J. Foster Andrews’ daughter, is engaged to Breadon. However, Malcolm seems to like her as well, but there’s nothing he can do. Later when Malcolm is talking about the phenomenon of the vortex, Breadon is the first that realizes what Malcolm is implying with the ionized filed. Then, when Hannigan tells them to board the life-skiff, both of them are able to get on it. Malcolm has the control of the life-skiff at first, but then Breadon asks to take over. Just as he is doing that, his sleeve catches the control key and turns the engine off. The ship begins to lose control, and Breadon grabs everyone’s hand off the control except for his. With his skills and training, finally, he is able to land without injuring anyone. Greg is surprised, since he did not believe they could actually be saved. He complements Breadon “nice work,” but Breadon blames him for crashing the ship. So then Hannigan decides to stand up for Malcolm where he asks Breadon if he know which part of what planet they are on. Breadon stuttered, and then Malcolm simply stated that they are on the northern hemisphere of Titan, one of Saturn’s satellite."
              },
              {
                "worker_id": "104",
                "uid": "75d2792207894b50b3b6046abc964095",
                "response_text": "Gregory Malcolm is described as tall and neat, wearing a business suit. He is the secretary of J. Foster Andrews. Ralph Breadon is a socialite and sportsman with previous training as a pilot. He is described as a sturdy man with eyes, hair, and skin the color of chestnuts. Crystal, Andrew’s daughter is pledged to Ralph Breadon. Malcolm is attracted and has feelings towards Crystal, the girl that is meant to be with Breadon. Breadon belittles Malcolm throughout the story. Malcolm does not respond with disdain or anger towards Breadon, instead, he remains calm and obedient. He acknowledges that Breadon has some competencies and skills related to piloting. Malcolm eventually proves to the group that he has more knowledge than Breadon when he is able to approximate their location on Titan. "
              }
            ]
          },
          {
            "question_text": "What is the relationship between the Andrews family and those in their employ?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "102",
                "uid": "3e0585dedd3b428384cd4ca6655fc016",
                "response_text": "Generally, the Andrews family is dismissive of their household staff, which include Gregory Malcolm, ‘Tina Laney, Sparks, and a cabin-boy. J. Foster Andrews, the head of the family, impatiently calls for his secretary, Gregory Malcolm, to complain about the quality of their morning honey. J. Foster learns that Malcolm doesn’t know that state of the Galactic market, but dismisses the reason that Malcolm provides, instead concluding that the radio technician Sparks is drunk. \n\tDuring the evacuation to the life skiff, Crystal Andrews, J. Foster’s daughter, remembers her maid ‘Tina Laney and asks where she is, apparently paying mind to her safety. In contrast, her fiancé Ralph Breadon is dismissive of Malcolm, and later blames him for the life skiff’s crashing into Titan. Upon the cabin-boy’s revelation that it was, in fact, Breadon who inadvertently caused the skiff’s malfunction, Breadon strikes the cabin-boy. \n\tOn Titan, ‘Tina is instructed to remove things from the skiff by the women of the Andrews family, who do not help, and Sparks and Malcolm are harshly instructed to make themselves useful. "
              },
              {
                "worker_id": "101",
                "uid": "2f4b47afa00044028592e9170e5f5828",
                "response_text": "The Andrews family resembles a royal one; they are wealthy and own the monopoly of Galactic Metals Corporation, with over ten thousand employees. The Andrews family is aware of their wealth and power, and treat their employees as significantly inferior to them. They also believe that any problems that arise are due to their employers, and insist that their products are perfect enough to not be subject to any problems. This is shown in the story when Malcolm first sees the Andrews family to update them on the situation at hand, and J. Foster Andrews expects his workers to be able to resolve the issue themselves. "
              },
              {
                "worker_id": "103",
                "uid": "4250e2bbce3947ed90cfd7bb64bbb83f",
                "response_text": "The Andrews family seem to have different attitudes towards their employees. Through the first part of the story, we see that at first J. Foster Andrews is not paying much attention to Greg, who is his employee, even when speaking with him. J. Foster Andrews simply replies “fine” to Greg’s answer of no transmission. Then he realizes what Greg is actually saying and then without allowing Greg to explain what he means by no transmission and how it has happened, he continues to scold them and order Greg to do things. Maud Andres tells him to stop and lets Greg explain himself. Greg on the other hand is very polite. He greets the Andrews family when entering the dining room, and thanks Miss Andrews for letting him to explain himself. On the contrary, later in the story, Breadon does not thank Greg even when he complements Breadon, instead, Breadon just accuses him for the crash just because he touched the control. But still, Greg is being very polite and calm, and it is in strong contrast to Breadon’s anger and rudeness. Lastly, in the end, the readers see that Maud Andrews, the sister of J. Foster Andrews, is very surprised when she hears that Greg knows where they are. "
              },
              {
                "worker_id": "104",
                "uid": "75d2792207894b50b3b6046abc964095",
                "response_text": "J. Foster Andrews employs around ten thousand people for his Galactic Metals Corporation. He is described as Napoleonic, especially when talking towards his employees. He is loud and demanding towards Malcolm and interrupts him many times when he speaks. His sister Maud even remarks that he has to give Malcolm a chance to respond. Maud inquisitively judges Malcolm and the other employees. When the ship is about to crash and everybody is rushing towards the life skiff, the Andrews family has more regard for their pets or fights than for saving others on the ship. \n\nAndrew continuously commands orders from his employees and has no patience for anything but extreme obedience from them. The rest of the family continues to demand the employees take after them once they leave the ship after their crash landing. They are more concerned about their own comfort than the well-being of the employees. Both Ralph and J. Foster take action trying to one-up one another in an attempt to show their power over their employees. Neither wants to be a fool. At the end of the story when Malcolm is able to approximate their location, Maud, a member of the Andrews family, is taken aback by Malcolm's discovery. She reacts as if she is surprised an employee could be smart.\n"
              }
            ]
          },
          {
            "question_text": "Where does the story take place?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "102",
                "uid": "3e0585dedd3b428384cd4ca6655fc016",
                "response_text": "\tThe story begins in the control room of J. Foster Andrews’s space yacht the Carefree, and then proceeds to the dining room. Outside of the Carefreem is a dynamic, glittering web of bright violet light, in stark contrast to the typical black of space. \n\tAs the members of the Andrews family and their household staff escape the Carefree onto a life skiff, the setting changes to the atmosphere of the moon Titan. Now free of the vortex which caused the shimmering lights, the space around their skiff is dark. \n\tAfter their uncontrolled descent onto Titan, the passengers of the skiff find themselves at the foot of a ring of shallow mountains, standing on rough soil. The mountains above are green and lush, with periodic caves along their face. In the sky is an image of Saturn, which causes the gravitational pull on the planet to be similar to Earth’s. More broadly, Titan, the moon they are on, is uninhabited and rarely visited. \n"
              },
              {
                "worker_id": "101",
                "uid": "2f4b47afa00044028592e9170e5f5828",
                "response_text": "The story takes place on the Andrews' family ship. The ship has multiple rooms; Malcolm and Sparks spend their time operating the ship while the Andrews family stays in the dining dome, a much more comfortable and luxurious room. However, once the ship is in distress and close to crashing, everyone on the ship must move to the independent life skiff, a smaller cramped unit. The crew eventually crashes onto the planet Titan, a mountainous, green, cavern-filled planet, though threatening in its uncertainty and lack of colonies. In the atmosphere, Saturn is visible above them, and the gravity is similar to that on Earth."
              },
              {
                "worker_id": "103",
                "uid": "4250e2bbce3947ed90cfd7bb64bbb83f",
                "response_text": "The story first takes place on a ship which has been in a vortex for more than eight hours. It has lost all its radio signals in and out. They are unsure of when they will be toss out, nor the place that they will be tossed out at. Then the readers follow Greg into the dining room where J. Foster Andrews, his family and some others are eating. There he is asked about the communication which he responds with no communication at all. He starts to explain when Hannigan came into the room and tells everyone to get on the life-skiff since the ship is about to crash. Once they get on to the life-skiff, however, because Breadon accidentally hits the control keys with his sleeve, which turns of the motors and they go directly towards the ground. Luckily Breadon is talented and skilled, he is able to perform the miracle that makes the life-skiff bounced and finally landed, without injuring anyone. Even though the life-skiff is a bit broken, it is not too big of a deal. As everyone got off the life-skiff, Breadon calls them together and tells Hannigan to send signals to the nearest space cruiser. Hannigan suggests to him that they aren’t even sure where they are, and the signal system are broken. Then the story ends with Greg telling them that they are on the northern hemisphere of Titan, one of the satellites of Mars. "
              },
              {
                "worker_id": "104",
                "uid": "75d2792207894b50b3b6046abc964095",
                "response_text": "The story begins on the yacht named Carefree, owned by J. Foster Andrews. The ship is stuck in a typhoon that is causing the ship to be twisted and directed towards an unknown location. Carefree has been caught in the space vortex for hours and the ship ends up in the H-layer of an unknown planet. As the ship is about to crash, a group swarm towards a life skiff. The life skiff is forty feet. The life skiff crash lands on one of the satellites of Saturn, on Titan, in the northern hemisphere.  "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5005,
        "document_length_chars": 30098
      }
    }
  ]
}