{
  "item_metadata": {
    "item_id": "63041",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63041",
      "content": "Morgue Ship\n \n\n By RAY BRADBURY\n \n \n This was Burnett's last trip. Three more shelves to fill with space-slain warriors—and he would be among the living again.\n \n [Transcriber's Note: This etext was produced from Planet Stories Summer 1944. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n He heard the star-port grind open, and the movement of the metal claws groping into space, and then the star-port closed.\n \n There was another dead man aboard the Constellation .\n \n Sam Burnett shook his long head, trying to think clearly. Pallid and quiet, three bodies lay on the cold transparent tables around him; machines stirred, revolved, hummed. He didn't see them. He didn't see anything but a red haze over his mind. It blotted out the far wall of the laboratory where the shelves went up and down, numbered in scarlet, keeping the bodies of soldiers from all further harm.\n \n Burnett didn't move. He stood there in his rumpled white surgical gown, staring at his fingers gloved in bone-white rubber; feeling all tight and wild inside himself. It went on for days. Moving the ship. Opening the star-port. Extending the retriever claw. Plucking some poor warrior's body out of the void.\n \n He didn't like it any more. Ten years is too long to go back and forth from Earth to nowhere. You came out empty and you went back full-cargoed with a lot of warriors who didn't laugh or talk or smoke, who just lay on their shelves, all one hundred of them, waiting for a decent burial.\n \n \"Number ninety-eight.\" Coming matter of fact and slow, Rice's voice from the ceiling radio hit Burnett.\n \n \"Number ninety-eight,\" Burnett repeated. \"Working on ninety-five, ninety-six and ninety-seven now. Blood-pumps, preservative, slight surgery.\" Off a million miles away his voice was talking. It sounded deep. It didn't belong to him anymore.\n \n Rice said:\n \n \"Boyohbody! Two more pick-ups and back to New York. Me for a ten-day drunk!\"\n \n Burnett peeled the gloves off his huge, red, soft hands, slapped them into a floor incinerator mouth. Back to Earth. Then spin around and shoot right out again in the trail of the war-rockets that blasted one another in galactic fury, to sidle up behind gutted wrecks of ships, salvaging any bodies still intact after the conflict.\n \n Two men. Rice and himself. Sharing a cozy morgue ship with a hundred other men who had forgotten, quite suddenly, however, to talk again.\n \n Ten years of it. Every hour of those ten years eating like maggots inside, working out to the surface of Burnett's face, working under the husk of his starved eyes and starved limbs. Starved for life. Starved for action.\n \n This would be his last trip, or he'd know the reason why!\n \n \"Sam!\"\n \n Burnett jerked. Rice's voice clipped through the drainage-preservative lab, bounded against glassite retorts, echoed from the refrigerator shelves. Burnett stared at the tabled bodies as if they would leap to life, even while preservative was being pumped into their veins.\n \n \"Sam! On the double! Up the rungs!\"\n \n Burnett closed his eyes and said a couple of words, firmly. Nothing was worth running for any more. Another body. There had been one hundred thousand bodies preceding it. Nothing unusual about a body with blood cooling in it.\n \n \n\n \n Shaking his head, he walked unsteadily toward the rungs that gleamed up into the air-lock, control-room sector of the rocket. He climbed without making any noise on the rungs.\n \n He kept thinking the one thing he couldn't forget.\n  You never catch up with the war.\n \n \n All the color is ahead of you. The drive of orange rocket traces across stars, the whamming of steel-nosed bombs into elusive targets, the titanic explosions and breathless pursuits, the flags and the excited glory are always a million miles ahead.\n \n He bit his teeth together.\n  You never catch up with the war.\n \n \n You come along when space has settled back, when the vacuum has stopped trembling from unleashed forces between worlds. You come along in the dark quiet of death to find the wreckage plunging with all the fury of its original acceleration in no particular direction. You can only see it; you don't hear anything in space but your own heart kicking your ribs.\n \n You see bodies, each in its own terrific orbit, given impetus by grinding collisions, tossed from mother ships and dancing head over feet forever and forever with no goal. Bits of flesh in ruptured space suits, mouths open for air that had never been there in a hundred billion centuries. And they kept dancing without music until you extended the retriever-claw and culled them into the air-lock.\n \n That was all the war-glory he got. Nothing but the stunned, shivering silence, the memory of rockets long gone, and the shelves filling up all too quickly with men who had once loved laughing.\n \n You wondered who all the men were; and who the next ones would be. After ten years you made yourself blind to them. You went around doing your job with mechanical hands.\n \n But even a machine breaks down....\n \n \n\n \n \"Sam!\" Rice turned swiftly as Burnett dragged himself up the ladder. Red and warm, Rice's face hovered over the body of a sprawled enemy official. \"Take a look at this!\"\n \n Burnett caught his breath. His eyes narrowed. There was something wrong with the body; his experienced glance knew that. He didn't know what it was.\n \n Maybe it was because the body looked a little too dead.\n \n Burnett didn't say anything, but he climbed the rest of the way, stood quietly in the grey-metal air-lock. The enemy official was as delicately made as a fine white spider. Eyelids, closed, were faintly blue. The hair was thin silken strands of pale gold, waved and pressed close to a veined skull. Where the thin-lipped mouth fell open a cluster of needle-tipped teeth glittered. The fragile body was enclosed completely in milk-pale syntha-silk, a holstered gun at the middle.\n \n Burnett rubbed his jaw. \"Well?\"\n \n Rice exploded. His eyes were hot in his young, sharp-cut face, hot and black. \"Good Lord, Sam, do you know who this is?\"\n \n Burnett scowled uneasily and said no.\n \n \"It's Lethla!\" Rice retorted.\n \n Burnett said, \"Lethla?\" And then: \"Oh, yes! Kriere's majordomo. That right?\"\n \n \"Don't say it calm, Sam. Say it big. Say it big! If Lethla is here in space, then Kriere's not far away from him!\"\n \n Burnett shrugged. More bodies, more people, more war. What the hell. What the hell. He was tired. Talk about bodies and rulers to someone else.\n \n Rice grabbed him by the shoulders. \"Snap out of it, Sam. Think! Kriere—The All-Mighty—in our territory. His right hand man dead. That means Kriere was in an accident, too!\"\n \n Sam opened his thin lips and the words fell out all by themselves.\n\"Look, Rice, you're new at this game. I've been at it ever since the Venus-Earth mess started. It's been see-sawing back and forth since the day you played hookey in the tenth grade, and I've been in the thick of it. When there's nothing left but seared memories, I'll be prowling through the void picking up warriors and taking them back to the good green Earth. Grisly, yes, but it's routine.\n \n \"As for Kriere—if he's anywhere around, he's smart. Every precaution is taken to protect that one.\"\n \n \"But Lethla! His body must mean something!\"\n \n \"And if it does? Have we got guns aboard this morgue-ship? Are we a battle-cuiser to go against him?\"\n \n \"We'll radio for help?\"\n \n \"Yeah? If there's a warship within our radio range, seven hundred thousand miles, we'll get it. Unfortunately, the tide of battle has swept out past Earth in a new war concerning Io. That's out, Rice.\"\n \n Rice stood about three inches below Sam Burnett's six-foot-one. Jaw hard and determined, he stared at Sam, a funny light in his eyes. His fingers twitched all by themselves at his sides. His mouth twisted,\n\"You're one hell of a patriot, Sam Burnett!\"\n \n Burnett reached out with one long finger, tapped it quietly on Rice's barrel-chest. \"Haul a cargo of corpses for three thousand nights and days and see how patriotic you feel. All those fine muscled lads bloated and crushed by space pressures and heat-blasts. Fine lads who start out smiling and get the smile burned off down to the bone—\"\n \n Burnett swallowed and didn't say anything more, but he closed his eyes. He stood there, smelling the death-odor in the hot air of the ship, hearing the chug-chug-chug of the blood pumps down below, and his own heart waiting warm and heavy at the base of his throat.\n \n \"This is my last cargo, Rice. I can't take it any longer. And I don't care much how I go back to earth. This Venusian here—what's his name? Lethla. He's number ninety-eight. Shove me into shelf ninety-nine beside him and get the hell home. That's how I feel!\"\n \n Rice was going to say something, but he didn't have time.\n \n Lethla was alive.\n \n He rose from the floor with slow, easy movements, almost like a dream. He didn't say anything. The heat-blast in his white fingers did all the necessary talking. It didn't say anything either, but Burnett knew what language it would use if it had to.\n \n Burnett swallowed hard. The body had looked funny. Too dead. Now he knew why. Involuntarily, Burnett moved forward. Lethla moved like a pale spider, flicking his fragile arm to cover Burnett, the gun in it like a dead cold star.\n \n Rice sucked in his breath. Burnett forced himself to take it easy. From the corners of his eyes he saw Rice's expression go deep and tight, biting lines into his sharp face.\n \n Rice got it out, finally. \"How'd you do it?\" he demanded, bitterly.\n\"How'd you live in the void? It's impossible!\"\n \n A crazy thought came ramming down and exploded in Burnett's head. You never catch up with the war!\n \n \n But what if the war catches up with you?\n \n What in hell would Lethla be wanting aboard a morgue ship?\n \n \n\n \n Lethla half-crouched in the midst of the smell of death and the chugging of blood-pumps below. In the silence he reached up with quick fingers, tapped a tiny crystal stud upon the back of his head, and the halves of a microscopically thin chrysalis parted transparently off of his face. He shucked it off, trailing air-tendrils that had been inserted, hidden in the uniform, ending in thin globules of oxygen.\n \n He spoke. Triumph warmed his crystal-thin voice. \"That's how I did it, Earthman.\"\n \n \"Glassite!\" said Rice. \"A face-moulded mask of glassite!\"\n \n Lethla nodded. His milk-blue eyes dilated. \"Very marvelously pared to an unbreakable thickness of one-thirtieth of an inch; worn only on the head. You have to look quickly to notice it, and, unfortunately, viewed as you saw it, outside the ship, floating in the void, not discernible at all.\"\n \n Prickles of sweat appeared on Rice's face. He swore at the Venusian and the Venusian laughed like some sort of stringed instrument, high and quick.\n \n Burnett laughed, too. Ironically. \"First time in years a man ever came aboard the Constellation alive. It's a welcome change.\"\n \n Lethla showed his needle-like teeth. \"I thought it might be. Where's your radio?\"\n \n \"Go find it!\" snapped Rice, hotly.\n \n \"I will.\" One hand, blue-veined, on the ladder-rungs, Lethla paused.\n\"I know you're weaponless; Purple Cross regulations. And this air-lock is safe. Don't move.\" Whispering, his naked feet padded white up the ladder. Two long breaths later something crashed; metal and glass and coils. The radio.\n \n Burnett put his shoulder blades against the wall-metal, looking at his feet. When he glanced up, Rice's fresh, animated face was spoiled by the new bitterness in it.\n \n Lethla came down. Like a breath of air on the rungs.\n \n He smiled. \"That's better. Now. We can talk—\"\n \n Rice said it, slow:\n \n \"Interplanetary law declares it straight, Lethla! Get out! Only dead men belong here.\"\n \n Lethla's gun grip tightened. \"More talk of that nature, and only dead men there will be.\" He blinked. \"But first—we must rescue Kriere....\"\n \n \"Kriere!\" Rice acted as if he had been hit in the jaw.\n \n Burnett moved his tongue back and forth on his lips silently, his eyes lidded, listening to the two of them as if they were a radio drama. Lethla's voice came next:\n \n \"Rather unfortunately, yes. He's still alive, heading toward Venus at an orbital velocity of two thousand m.p.h., wearing one of these air-chrysali. Enough air for two more hours. Our flag ship was attacked unexpectedly yesterday near Mars. We were forced to take to the life-boats, scattering, Kriere and I in one, the others sacrificing their lives to cover our escape. We were lucky. We got through the Earth cordon unseen. But luck can't last forever.\n \n \"We saw your morgue ship an hour ago. It's a long, long way to Venus. We were running out of fuel, food, water. Radio was broken. Capture was certain. You were coming our way; we took the chance. We set a small time-bomb to destroy the life-rocket, and cast off, wearing our chrysali-helmets. It was the first time we had ever tried using them to trick anyone. We knew you wouldn't know we were alive until it was too late and we controlled your ship. We knew you picked up all bodies for brief exams, returning alien corpses to space later.\"\n \n Rice's voice was sullen. \"A set-up for you, huh? Traveling under the protection of the Purple Cross you can get your damned All-Mighty safe to Venus.\"\n \n Lethla bowed slightly. \"Who would suspect a Morgue Rocket of providing safe hiding for precious Venusian cargo?\"\n \n \"Precious is the word for you, brother!\" said Rice.\n \n \"Enough!\" Lethla moved his gun several inches.\n \n \"Accelerate toward Venus, mote-detectors wide open. Kriere must be picked up— now! \"\n \n \n\n \n Rice didn't move. Burnett moved first, feeling alive for the first time in years. \"Sure,\" said Sam, smiling. \"We'll pick him up.\"\n \n \"No tricks,\" said Lethla.\n \n Burnett scowled and smiled together. \"No tricks. You'll have Kriere on board the Constellation in half an hour or I'm no coroner.\"\n \n \"Follow me up the ladder.\"\n \n Lethla danced up, turned, waved his gun. \"Come on.\"\n \n Burnett went up, quick. Almost as if he enjoyed doing Lethla a favor. Rice grumbled and cursed after him.\n \n On the way up, Burnett thought about it. About Lethla poised like a white feather at the top, holding death in his hand. You never knew whose body would come in through the star-port next. Number ninety-eight was Lethla. Number ninety-nine would be Kriere.\n \n There were two shelves numbered and empty. They should be filled. And what more proper than that Kriere and Lethla should fill them? But, he chewed his lip, that would need a bit of doing. And even then the cargo wouldn't be full. Still one more body to get; one hundred. And you never knew who it would be.\n \n He came out of the quick thoughts when he looped his long leg over the hole-rim, stepped up, faced Lethla in a cramped control room that was one glittering swirl of silver levers, audio-plates and visuals. Chronometers, clicking, told of the steady dropping toward the sun at a slow pace.\n \n Burnett set his teeth together, bone against bone. Help Kriere escape? See him safely to Venus, and then be freed? Sounded easy, wouldn't be hard. Venusians weren't blind with malice. Rice and he could come out alive; if they cooperated.\n \n But there were a lot of warriors sleeping on a lot of numbered shelves in the dim corridors of the long years. And their dead lips were stirring to life in Burnett's ears. Not so easily could they be ignored.\n  You may never catch up with the war again.\n \n \n The last trip!\n \n Yes, this could be it. Capture Kriere and end the war. But what ridiculous fantasy was it made him believe he could actually do it?\n \n Two muscles moved on Burnett, one in each long cheek. The sag in his body vanished as he tautened his spine, flexed his lean-sinewed arms, wet thin lips.\n \n \"Now, where do you want this crate?\" he asked Lethla easily.\n \n Lethla exhaled softly. \"Cooperation. I like it. You're wise, Earthman.\"\n \n \"Very,\" said Burnett.\n \n He was thinking about three thousand eternal nights of young bodies being ripped, slaughtered, flung to the vacuum tides. Ten years of hating a job and hoping that some day there would be a last trip and it would all be over.\n \n Burnett laughed through his nose. Controls moved under his fingers like fluid; loved, caressed, tended by his familiar touching. Looking ahead, he squinted.\n \n \"There's your Ruler now, Lethla. Doing somersaults. Looks dead. A good trick.\"\n \n \"Cut power! We don't want to burn him!\"\n \n \n\n \n Burnett cut. Kriere's milky face floated dreamily into a visual-screen, eyes sealed, lips gaping, hands sagging, clutching emptily at the stars.\n \n \"We're about fifty miles from him, catching up.\" Burnett turned to Lethla with an intent scowl. Funny. This was the first and the last time anybody would ever board the Constellation alive. His stomach went flat, tautened with sudden weakening fear.\n \n If Kriere could be captured, that meant the end of the war, the end of shelves stacked with sleeping warriors, the end of this blind searching. Kriere, then, had to be taken aboard. After that—\n \n Kriere, the All-Mighty. At whose behest all space had quivered like a smitten gong for part of a century. Kriere, revolving in his neat, water-blue uniform, emblems shining gold, heat-gun tucked in glossy jet holster. With Kriere aboard, chances of overcoming him would be eliminated. Now: Rice and Burnett against Lethla. Lethla favored because of his gun.\n \n Kriere would make odds impossible.\n \n Something had to be done before Kriere came in.\n \n Lethla had to be yanked off guard. Shocked, bewildered, fooled—somehow. But—how?\n \n Burnett's jaw froze tight. He could feel a spot on his shoulder-blade where Lethla would send a bullet crashing into rib, sinew, artery—heart.\n \n There was a way. And there was a weapon. And the war would be over and this would be the last trip.\n \n Sweat covered his palms in a nervous smear.\n \n \"Steady, Rice,\" he said, matter of factly. With the rockets cut, there was too much silence, and his voice sounded guilty standing up alone in the center of that silence. \"Take controls, Rice. I'll manipulate the star-port.\"\n \n Burnett slipped from the control console. Rice replaced him grimly. Burnett strode to the next console of levers. That spot on his back kept aching like it was sear-branded X. For the place where the bullet sings and rips. And if you turn quick, catching it in the arm first, why—\n \n Kriere loomed bigger, a white spider delicately dancing on a web of stars. His eyes flicked open behind the glassite sheath, and saw the Constellation . Kriere smiled. His hands came up. He knew he was about to be rescued.\n \n Burnett smiled right back at him. What Kriere didn't know was that he was about to end a ten-years' war.\n \n There was only one way of drawing Lethla off guard, and it had to be fast.\n \n Burnett jabbed a purple-topped stud. The star-port clashed open as it had done a thousand times before; but for the first time it was a good sound. And out of the star-port, at Sam Burnett's easily fingered directions, slid the long claw-like mechanism that picked up bodies from space.\n \n Lethla watched, intent and cold and quiet. The gun was cold and quiet, too.\n \n The claw glided toward Kriere without a sound, now, dream-like in its slowness.\n \n It reached Kriere.\n \n Burnett inhaled a deep breath.\n \n The metal claw cuddled Kriere in its shiny palm.\n \n \n\n \n Lethla watched.\n \n He watched while Burnett exhaled, touched another lever and said: \"You know, Lethla, there's an old saying that only dead men come aboard the Constellation . I believe it.\"\n \n \n\n \n And the claw closed as Burnett spoke, closed slowly and certainly, all around Kriere, crushing him into a ridiculous posture of silence. There was blood running on the claw, and the only recognizable part was the head, which was carefully preserved for identification.\n \n That was the only way to draw Lethla off guard.\n \n Burnett spun about and leaped.\n \n The horror on Lethla's face didn't go away as he fired his gun.\n \n Rice came in fighting, too, but not before something like a red-hot ramrod stabbed Sam Burnett, catching him in the ribs, spinning him back like a drunken idiot to fall in a corner.\n \n Fists made blunt flesh noises. Lethla went down, weaponless and screaming. Rice kicked. After awhile Lethla quit screaming, and the room swam around in Burnett's eyes, and he closed them tight and started laughing.\n \n He didn't finish laughing for maybe ten minutes. He heard the retriever claws come inside, and the star-port grind shut.\n \n Out of the red darkness, Rice's voice came and then he could see Rice's young face over him. Burnett groaned.\n \n Rice said, \"Sam, you shouldn't have done it. You shouldn't have, Sam.\"\n \n \"To hell with it.\" Burnett winced, and fought to keep his eyes open. Something wet and sticky covered his chest. \"I said this was my last trip and I meant it. One way or the other, I'd have quit!\"\n \n \"This is the hard way—\"\n \n \"Maybe. I dunno. Kind of nice to think of all those kids who'll never have to come aboard the Constellation , though, Rice.\" His voice trailed off. \"You watch the shelves fill up and you never know who'll be next. Who'd have thought, four days ago—\"\n \n Something happened to his tongue so it felt like hard ice blocking his mouth. He had a lot more words to say, but only time to get a few of them out:\n \n \"Rice?\"\n \n \"Yeah, Sam?\"\n \n \"We haven't got a full cargo, boy.\"\n \n \"Full enough for me, sir.\"\n \n \"But still not full. If we went back to Center Base without filling the shelves, it wouldn't be right. Look there—number ninety-eight is Lethla—number ninety-nine is Kriere. Three thousand days of rolling this rocket, and not once come back without a bunch of the kids who want to sleep easy on the good green earth. Not right to be going back any way—but—the way—we used to—\"\n \n His voice got all full of fog. As thick as the fists of a dozen warriors. Rice was going away from him. Rice was standing still, and Burnett was lying down, not moving, but somehow Rice was going away a million miles.\n \n \"Ain't I one hell of a patriot, Rice?\"\n \n Then everything got dark except Rice's face. And that was starting to dissolve.\n \n Ninety-eight: Lethla. Ninety-nine: Kriere.\n \n He could still see Rice standing over him for a long time, breathing out and in. Down under the tables the blood-pumps pulsed and pulsed, thick and slow. Rice looked down at Burnett and then at the empty shelf at the far end of the room, and then back at Burnett again.\n \n And then he said softly:\n \n \" One hundred. \"",
      "metadata": {
        "title": "Morgue Ship",
        "author": "Ray Bradbury",
        "passage_id": "63041",
        "uid": "0e6185c3ebc5451db91e8dae2dceac7e",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "104",
                "uid": "6026b7dd8d0a41ea927c257ff208c0a6",
                "response_text": "Sam Burnett hears the familiar sounds that indicate another dead body has been retrieved and collected onto the Morgue ship where he works. Burnett is a coroner that works to retrieve dead bodies from space lost in war and bring them back to Earth. He thinks of how his job has emotionally drained him. Rice interrupts his thoughts and yells for Sam to meet with him. Sam climbs up to the control room of the rocket. When he meets Rice, he realizes that the recovered body is an enemy official. Sam is suspicious of the condition of the body when Rice excitedly exclaims that it is the body of Lethla, Kriere’s majordomo. Burnett is indifferent to the revelation. Yet, Rice is excited for the possibility of a high enemy official being dead and the possibility of the war coming to an end; Sam is still jaded. \n\nLethla moves and they realize that he is not dead.  Lethla was able to survive in the void of space with the usage of a well-hidden face mask made of glassite. Lethla threatens the two to not make any moves and communicates his intent to control the ship. Rice tells Lethla to leave because it is against Interplanetary law to mess with a morgue ship. Lethla rebuffs that defense. All the while, Sam is observing the two interact. Lethla lets the two know that Kriere is still alive and is also wearing the same mask that Lethla had worn. He explains that they were attacked near Mars while they were on their way to Venus. They were running out of supplies and decided to trick the morgue ship to continue their trip to Venus. After Lethla explains why and how he got to the morgue ship, he commands them to go pick up Kriere. Sam smiles and complies with Lethla’s orders. \n\nSam thinks over his options and considers getting Lethla and Kriere to Venus so that he can peacefully return to Earth. They spot Kriere in space floating as if he is dead. Sam continues thinking about his options to overpower both Kriere and Lethla and experiences some fear over the possible success of his plan. He begins to sweat nervously but becomes more confident as he puts the plan into action. Sam activates the ship’s claw mechanism to pick up Kriere’s body. As Lethla watches him he mentions a saying about how the ship is meant for dead men and then unexpectedly begins to crush Kriere’s body with the claw, killing Kriere. Lethla is caught off guard but manages to fire his gun at Sam before Rice attacks him. Lethla screams in horror for a time while Burnett uncontrollably laughs. Rice expresses how he doesn’t believe Sam should have killed Kriere. Sam argues that it didn’t matter as long as it was his last trip somehow. Sam dies and becomes the 100 body on the ship, filling it and allowing the ship to return back to Earth fulfilling Sam’s last desire. \n"
              },
              {
                "worker_id": "107",
                "uid": "68dc832c181b4efebf338588ab1fab70",
                "response_text": "Sam Burnett works on the morgue ship called the Constellation. His job involves collecting bodies floating in the void, and he desperately wants to quit after ten long years. He works alongside Rice on the morgue ship. Burnett declares that this mission will be his last, or he will find a reason for it. He is wary about the nature of his job since it is so involved with death. Rice calls him over and explains that the body they just brought in is Lethla, Kriere’s majordomo. Burnett is not very interested, but Rice takes this as a sign that Kriere must be somewhere near too. Rice talks about radioing for help if there is a warship, but Burnett does not care because he is tired of seeing all these bodies. Just before they can continue arguing, it turns out that Lethla is actually alive and reveals that he survived through the use of a face-moulded mask of glassite. Lethla knows they are weaponless and finds the radio, which upsets Rice because only dead men are supposed to be on their ship. Lethla reveals that Kriere is out there too, and he plans to use the morgue ship to rescue him. Rice does not move, but Burnett agrees to the request and goes up to drive the ship. He ponders his plan, thinking how cooperating with Venusians will help him and Rice survive. He also thinks about capturing Kriere and ending the war. They find Kriere floating in space, and Burnett drives the ship up to him. However, he knows that with both Lethla and Kriere on board, they have no chance of overpowering them. Burnett tells Rice to take the controls as he moves to the star-port, and he begins to feel the spot on his back where a bullet will hit him. Kriere is outside, reaching towards the Constellation and smiling. The claw lever is extended and retrieves Kriere, while Burnett tells Lethla that only dead men come aboard the ship. The claw crushes Kriere, leaving only his head preserved for identification. Lethla fires the gun that hits Burnett, but he and Rice retaliate. Soon, Lethla is dead too. Rice tells him that he shouldn’t have done it, but Burnett tells him that he is determined to make this his last trip. He asks Rice if he is one hell of a patriot and dies shortly after. Rice softly declares that Burnett’s body is one-hundred. "
              },
              {
                "worker_id": "101",
                "uid": "74eb2affe64b4f1e974376fbb8bb3691",
                "response_text": "Sam Burnett and his partner, Rice, are aboard the morgue ship Constellation with the goal of retrieving one hundred bodies from space before returning to Earth. They have been working for ten years, and Burnett has become frustrated with the job. He is sick of the repetition and dealing with dead bodies every day, and it has caused him to lose motivation in the war and returning home. The two are at their ninety-seventh body, only needing three more before being able to go home. One day, Burnett and Rice collect a soldier from the void, who they identify as Lethla, the right hand man of Kriere, the head enemy. Rice is excited, noting that Lethla's death indicates an end to the war, but Burnett remains unfazed, when Lethla's body suddenly jumps to life. Lethla had faked his death after an accident in order to board the morgue ship, and he takes Burnett and Rice hostage in an effort to rescue Kriere and go to Venus. Burnett agrees while Rice hesitates; he sees this as an opportunity to catch up with the war and end the trip once and for all. The Constellation reaches Kriere, and Burnett catches Lethla off guard by crushing Kriere with the claw, killing him. Burnett and Rice then fight off Lethla, eventually killing him too. Rice reprimands Burnett, noting that their cargo is not full and is still missing a body. Burnett, still lying down, watches Rice without protest, and Rice kills him for the final body."
              },
              {
                "worker_id": "105",
                "uid": "e521c99af5e44da6bd0cf6b62653846d",
                "response_text": "Three new dead bodies lie before Sam Burnett aboard the Constellation. They add up to a hundred dead warriors aboard,  part of a much greater amount the crew picked up in ten years. Now, the spaceship is going back to Earth to bury them properly, with only two living people making up its crew - Rice and Sam. Sam suddenly starts feeling bad about his job, about all the similar dead bodies, tired of his job. Soon, a new body appears which looks different - \"too dead\". Turns out the dead is Lethla, Kriere's majordomo, signifying the war is somewhere near to the ship with more bodies. Sam and Rice have a short argument then: Rice wants to take advantage of Kriere, the enemy's leader, being on their territory. Sam argues that they should stay away as they are not a battle-cruiser, he is tired of his job, sentimental about the young warriors and willing to go back to Earth. The dispute stops when it turns out that Lethla is alive and aims his gun. Rice is shocked - no one can live in the void, but Lethla did with the help of glassite. The intruder breaks the radio and announces the purpose of his visit: to rescue Kriere. Turns out their ship was attacked and the two escaped in the same life- boat, wearing chrysali-helmets, and headed towards the morgue ship, the only thing nearby, knowing they would be taken in and considered dead. The morgue rocket was the best cover possible to get safely to Venus, but Kriere was still in the void, while Lethla was picked up. \"Constellation\" starts searching for Kriere as Lethla orders with Sam feeling finally alive and happily agreeing. He has a plan for the two to fill the empty shelves in his morgue. Various plans on how to kill the two enemies and end the war keep appearing in Sam's head while he picks up the body. As in slow-motion, the claw picking up the bodies crushes Kriere and Sam is shot by Lethla. Rice beats the least and rushes to Sam, who is happy to stop the war and save many more young warriors at any price. Sam's last though is that he is number one-hundred in this morgue filling an empty shelf.  "
              }
            ]
          },
          {
            "question_text": "Describe what Sam Burnett does for his job.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "104",
                "uid": "6026b7dd8d0a41ea927c257ff208c0a6",
                "response_text": "Sam Burnett is a coroner on the morgue ship Constellation. His job is to go to space and pick up 100 dead warriors and then return to Earth for them to be given a proper burial. When the ship has filled its capacity it returns specifically to New York. Sam has been working at this job for the past ten years. He uses a machine with metal claws to pick the dead bodies from space and then bring them in through the star-port grind. After the bodies are brought onto the ship, if they are not enemy warriors, the bodies are prepared for return to Earth. The bodies are prepared by Sam in a drainage-preservative lab. "
              },
              {
                "worker_id": "107",
                "uid": "68dc832c181b4efebf338588ab1fab70",
                "response_text": "Sam Burnett works on a morgue ship, collecting and preparing bodies of spacemen to bring back to Earth for burials. His duties involve driving the ship, opening the star-port to extend the retriever claw, and plucking dead bodies from the void. The morgue ship is always filled with dead men on the way back to Earth and returns empty to find more soldiers. Burnett is also responsible for the drainage-preservative lab, where the bodies are drained and pumped with preservatives for burial. The bodies are then stored on the shelves, where they are lined up and returned to Earth once there is a full cargo. "
              },
              {
                "worker_id": "101",
                "uid": "74eb2affe64b4f1e974376fbb8bb3691",
                "response_text": "Sam Burnett works on the Constellation, which is a morgue ship designed to collect one hundred space soldiers. Sam Burnett works in the laboratory and is responsible for preparing the bodies after they have died, which consists of any necessary surgeries, pumping out blood, and injecting preservatives. Burnett and his partner, Rice, must meet a certain body count for the Constellation before returning to Earth. The job is a long term one; Burnett is on his tenth year of working on the Constellation."
              },
              {
                "worker_id": "105",
                "uid": "e521c99af5e44da6bd0cf6b62653846d",
                "response_text": "Sam Burnett is one of the two crew members aboard Constellation. For the last ten years he has been traveling in this morgue ship, picking up dead bodies in between Venus and Earth. He moves the ship, stops it at the sight of bodies, picks them up with the ship's extending claw, puts them on the table and inspects, then stocks them on the shelves to take back to Earth when the space is filled and give them a proper burial. The two planets are at war at the moment, so there are plenty of bodies in the void, coming from the crashed ships. Sam also does surgery and helps the bodies preserve. "
              }
            ]
          },
          {
            "question_text": "How does Sam Burnett feel about his job?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "104",
                "uid": "6026b7dd8d0a41ea927c257ff208c0a6",
                "response_text": "Sam Burnett is very jaded by his job. He has spent years returning dead bodies to Earth, lost in a seemingly endless war. He suggests that he began the job with less of a sullen view, but that opinion is forever lost. He no longer has the emotional capacity to acknowledge the individual lives of each lost warrior. Sam feels as if his job is rotting him from the inside and starving him from real life and action. He has no energy or excitement in his actions anymore because of his job causing him to complete it in an almost mechanical way. He becomes numb to the bodies; seeing them and preparing them to be stored is just a regular part of his routine. All Sam wants to do is return back to Earth, dead or alive. "
              },
              {
                "worker_id": "107",
                "uid": "68dc832c181b4efebf338588ab1fab70",
                "response_text": "Sam Burnett is tired of his job and plans to quit. He thinks that ten years is too long to go from Earth to nowhere and that each hour ate him up like maggots inside. Burnett is starved for action, as his only company are the dead soldiers who can no longer speak and Rice. Although he has built up a mental defense by doing his job with mechanical hands, he still has emotions that haunt him. When Rice asks him about Lethla, he has no interest and grows instantly tired. However, Burnett is determined to get out of this job one way or another. This is what motivates him to act out against Lethla and Kriere, even though they are two highly dangerous and important Venusian figures. \n"
              },
              {
                "worker_id": "101",
                "uid": "74eb2affe64b4f1e974376fbb8bb3691",
                "response_text": "Sam Burnett despises his job, noting several times throughout the story that he is eager to end his last trip. Working in a morgue is morbid enough, but being stuck in a ship for ten years has added to it. Burnett no longer sees motivation for much anymore, becoming desensitized to seeing dead body after dead body. He no longer holds excitement about the war because he can only witness its aftermath. Burnett's feelings towards his job are expressed when he blows up at Rice, claiming that he wouldn't care if he returned to Earth as one of the dead bodies on their shelves. "
              },
              {
                "worker_id": "105",
                "uid": "e521c99af5e44da6bd0cf6b62653846d",
                "response_text": "Sam Burnett is tired of his job - it's monotonous and all the bodies seem the same to him. He is also sympathetic to the young warriors being dead. Every new corpse makes him more upset and he can't handle it any longer, he is tired of the war and doesn't want anyone else dead. He wants to return to Earth. He used to be a 'machine' and do his job automatically, but he broke, now he can't handle those corpses. He doesn't feel alive as well, Lethra's arrival, the possibility to end the war, spark life in Sam, they bring some action in. He wants to save all the rest warriors by ending the war not to see more corpses. He is willing to retire no matter which way, even death is a way. "
              }
            ]
          },
          {
            "question_text": "What is the setting of the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "104",
                "uid": "6026b7dd8d0a41ea927c257ff208c0a6",
                "response_text": "The story begins on the morgue ship named Constellation. Sam Burnett is mentally exhausted standing in his white gown in the laboratory room of the ship. In the laboratory there are many shelves stacked upon each other, each numbered with a scarlet color. The shelves are meant to hold the 100 dead bodies that the ship is capable of storing. Once the shelves are filled, the ship is able to return back to New York. The lab is meant for performing the work of draining and preserving the dead bodies for them to then be stored. Sam leaves the laboratory at the request of Rice’s calls. After they realize that Lethla is alive, Lethla orders the two to go find Kriere. They head to the control room full of levers and audio and visual plates where Sam begins to maneuver the ship. It is in the control room that Sam dies on the ship. "
              },
              {
                "worker_id": "107",
                "uid": "68dc832c181b4efebf338588ab1fab70",
                "response_text": "The story is set in space, onboard the Constellation. There are controls to drive the ship, a star-port, and claws that extend out from the ship. There is also a radio for communication and no weapons. There is also a drainage-preservative lab, transparent tables, glass retorts, and refrigerator shelves. The control-room sector of the room has an air-lock and a ladder that goes up to the area where Rice first examines Lethla. The ship also has metal walls and numbered shelves for the dead body. Outside, there is just the void where dead bodies float. However, Kriere and Lethla were able to survive using their masks of glasslite after destroying their life-boat. "
              },
              {
                "worker_id": "101",
                "uid": "74eb2affe64b4f1e974376fbb8bb3691",
                "response_text": "The story takes place aboard the Constellation, a morgue ship following the path of the war between Earth and Venus. The bottom of the ship is a laboratory with a wall full of shelves, one hundred to be exact, each for a body collected from space. The laboratory has a ladder that leads up to the air lock control room, where the rest of space is visible. The ship has a large claw attached on its exterior that is used to retrieve bodies from the void."
              },
              {
                "worker_id": "105",
                "uid": "e521c99af5e44da6bd0cf6b62653846d",
                "response_text": "The story takes places on a space ship which is a morgue called Constellation. It travels back and forth in space between Venus and Earth where war takes place. On the ship there are only two men alive making up its crew and ninety-seven dead bodies filling the designated shelves. The ship has a star-port which opens to let a metal claw pick up bodies in the void and take them inside. There is a table to put the dead on for inspection and surgery. Sam calls the ship 'cozy', it's small. The rungs lead to control-room. There is a radio to maintain connection with Earth. There are no weapons aboard. The enemy corpse is alive and Sam follows him to the visual-screen in. search of Kriere. The ship stops at detecting the body. It's crushed before being taken in, a fight takes place, and the empty shelves are filled, making Rice the only one live aboard. "
              }
            ]
          },
          {
            "question_text": "What is the significance of the phrase “You can never catch up with war” in the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "104",
                "uid": "6026b7dd8d0a41ea927c257ff208c0a6",
                "response_text": "At the beginning of the story, Sam Burnett makes note of the phrase to dictate the endless feeling that he associates with the conflict. He suggests that there is always going to be more bodies no matter how long or how many he retrieves. Even as victory may seem near, there is always another obstacle to face and the war never truly ends. \n\nDuring the middle of the story, Burnett questions whether it is possible for war to catch up on someone. He and Rice work on a non-combative ship and yet have found themselves thrust into a pivotal moment in the conflict that should theoretically not have ever involved them. Sam sticks to his conviction that one can still not catch up with war. \n\nWhile Sam is taking the ship towards Kriere, he thinks about whether he should fully comply with Lethla and Kriere or not to comply with their orders. He realizes that the situation as convoluted as it was, meant that he had unintentionally caught up with the war. That it was a rare and singular opportunity. While one may not be able to purposefully catch up with war, because war is unable to be controlled or predicted, it is possible for one’s path to cross with war. That presents an opportunity to greatly influence the war. \n"
              },
              {
                "worker_id": "107",
                "uid": "68dc832c181b4efebf338588ab1fab70",
                "response_text": "The phrase “you can never catch up with war” means that for Burnett’s job, the war will always leave more casualties for him to clean up. Although he and the Constellation can retrieve as many bodies as they find, there will always be more bodies for them to collect. Even though many ships wave the flags of glory are ahead, Burnett’s job will only ever let him go on the dark, quiet trail of death to examine the wreckage. This wreckage is almost always dead bodies that need to be brought back to Earth. As long as there is war, then the job will never end, and Burnett will never catch up to the growing pile of bodies. \n"
              },
              {
                "worker_id": "101",
                "uid": "74eb2affe64b4f1e974376fbb8bb3691",
                "response_text": "Burnett repeats the phrase \"you can never catch up with the war\" in his mind as a reminder of the mundaneness and somberness of his job. His collection of bodies seems infinite, and the morgue ship follows the path of the war, but never close enough to witness it, only close enough to see the aftermath and pick up after it. Burnett is not able to experience the victories, thrills, or challenges of war. Instead, he sees its destruction and is forced to clean the mess. This phrase holds significance when Burnett decides to seize the opportunity to capture Lethla and Kriere, viewing this as a chance to finally catch up with the war."
              },
              {
                "worker_id": "105",
                "uid": "e521c99af5e44da6bd0cf6b62653846d",
                "response_text": "This phrase is repeated several times which makes it important and emphasized. The phrase reflects Sam's feelings and attitude towards war and his job. He is overwhelmed with constant arrival of dead young bodies and feels bad about the war, he dream about its ending and return home. The phrase reflects on the amount of bodies - there are so many, that it's impossible to catch up. The horrors of war are so intense and they have such a strong impression on Sam that he can't catch up anymore. Later, the phrase gets a different meaning - the morgue ship stayed away from real war dealing with the dead only. Lethra's arrival changes it and brings war to the ship, making it caught up by war without intention. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 3825,
        "document_length_chars": 22559
      }
    }
  ]
}