{
  "item_metadata": {
    "item_id": "63150",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63150",
      "content": "THE SOUL EATERS\n \n\n By WILLIAM CONOVER\n \n \n Firebrand Dennis Brooke had one final chance to redeem himself by capturing Koerber whose ships were the scourge of the Void. But his luck had run its course, and now he was marooned on a rogue planet—fighting to save himself from a menace weapons could not kill.\n \n [Transcriber's Note: This etext was produced from Planet Stories Fall 1944. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n \" And so, my dear ,\" Dennis detected a faint irony in the phrase, \" I'm afraid I can offer no competition to the beauties of five planets—or is it six? With regret I bow myself out, and knowing me as you do, you'll understand the futility of trying to convince me again. Anyway, there will be no temptation, for I'm sailing on a new assignment I've accepted. I did love you.... Good-by. \"\n \n Dennis Brooke had lost count of the times he'd read Marla's last letter, but every time he came to these final, poignant lines, they never failed to conjure a vision of her tawny loveliness, slender as the palms of Venus, and of the blue ecstasy of her eyes, wide with a perpetual wonder—limpid as a child's.\n \n The barbaric rhythms of the Congahua , were a background of annoyance in Dennis' mind; he frowned slightly as the maneuvers of the Mercurian dancer, who writhed among the guests of the notorious pleasure palace, began to leave no doubt as to her intentions. The girl was beautiful, in a sultry, almost incandescent sort of way, but her open promise left him cold. He wanted solitude, somewhere to coordinate his thoughts in silence and salvage something out of the wreck of his heart, not to speak of his career. But Venus, in the throes of a gigantic boom upon the discovery of radio-active fields, could offer only one solitude—the fatal one of her swamps and virgin forests.\n \n Dennis Brooke was thirty, the time when youth no longer seems unending. When the minor adventures of the heart begin to pall. If the loss of Marla left an aching void that all the women of five planets could not fill, the loss of Space, was quite as deadly. For he had been grounded. True, Koerber's escape from the I.S.P. net had not quite been his fault; but had he not been enjoying the joys of a voluptuous Jovian Chamber, in Venus' fabulous Inter-planetary Palace, he would have been ready for duty to complete the last link in the net of I.S.P. cruisers that almost surrounded the space pirate.\n \n A night in the Jovian Chamber, was to be emperor for one night. Every dream of a man's desire was marvelously induced through the skilful use of hypnotics; the rarest viands and most delectable drinks appeared as if by magic; the unearthly peace of an Olympus descended on a man's soul, and beauty ... beauty such as men dreamed of was a warm reality under the ineffable illumination of the Chamber.\n \n It cost a young fortune. But to pleasure mad, boom-ridden Venus, a fortune was a bagatelle. Only it had cost Dennis Brooke far more than a sheaf of credits—it had cost him the severe rebuff of the I.S.P., and most of his heart in Marla.\n \n Dennis sighed, he tilted his red, curly head and drank deeply of the insidious Verbena , fragrant as a mint garden, in the tall frosty glass of Martian Bacca-glas , and as he did so, his brilliant hazel eyes found themselves gazing into the unwinking, violet stare of a young Martian at the next table. There was a smouldering hatred in those eyes, and something else ... envy, perhaps, or was it jealousy? Dennis couldn't tell. But his senses became instantly alert. Danger brought a faint vibration which his superbly trained faculties could instantly denote.\n \n His steady, bronzed hand lowered the drink, and his eyes narrowed slightly. Absorbed in trying to puzzle the sudden enmity of this Martian stranger, he was unaware of the Mercurian Dancer. The latter had edged closer, whirling in prismatic flashes from the myriad semi-precious stones that studded her brief gauze skirt. And now, in a final bid for the spacer's favor she flung herself in his lap and tilted back invitingly.\n \n Some of the guests laughed, others stared in plain envy at the handsome, red-haired spacer, but from the table across, came the tinkling sound of a fragile glass being crushed in a powerful hand, and a muffled Martian curse. Without warning, the Martian was on his feet with the speed of an Hellacorium, the table went crashing to one side as he leaped with deadly intent on the sprawled figure of Dennis Brooke. A high-pitched scream brought instant silence as a Terran girl cried out. Then the Martian's hand reached out hungrily. But Dennis was not there.\n \n \n\n \n Leaping to one side, impervious to the fall of the dancer, he avoided the murderous rush of the Martian youth, then he wheeled swiftly and planted a sledge-hammer blow in that most vulnerable spot of all Martians, the spot just below their narrow, wasp-like waist, and as the Martian half-doubled over, he lefted him with a short jab to the chin that staggered and all but dropped him.\n \n The Martian's violet eyes were black with fury now. He staggered back and sucked in air, his face contorted with excruciating pain. But he was not through. His powerful right shot like a blast straight for Dennis' chest, striking like a piston just below the heart. Dennis took it, flat-footed, without flinching; then he let his right ride over with all the force at his command. It caught the Martian on the jaw and spun him like a top, the pale, imperious face went crimson as he slowly sagged to his knees and rolled to the impeccable mosaics of the floor.\n \n Dennis, breathing heavily, stood over him until the international police arrived, and then he had the surprise of his life. Upon search, the police found a tiny, but fatal silvery tube holstered under his left arm-pit—an atomic-disintegrator, forbidden throughout the interplanetary League. Only major criminals and space pirates still without the law were known to possess them.\n \n \"Looks like your brawl has turned out to be a piece of fool's luck, Brooke!\" The Police Lieutenant favored Dennis with a wry smile. \"If I'm not mistaken this chap's a member of Bren Koerber's pirate crew. Who else could afford to risk his neck at the International, and have in his possession a disintegrator? Pity we have no complete records on that devil's crew! Anyway, we'll radio the I.S.P., perhaps they have details on this dandy!\" He eyed admiringly the priceless Martian embroideries on the unconscious Martian's tunic, the costly border of red, ocelandian fur, and the magnificent black acerine on his finger.\n \n Dennis Brooke shrugged his shoulders, shoulders that would have put to shame the Athenian statues of another age. A faint, bitter smile curved his generous mouth. \"I'm grounded, Gillian, it'd take the capture of Koerber himself to set me right with the I.S.P. again—you don't know Bertram! To him an infraction of rules is a major crime. Damn Venus!\" He reached for his glass of Verbena but the table had turned over during the struggle, and the glass was a shattered mass of gleaming Bacca-glas shards. He laughed shortly as he became conscious of the venomous stare of the Mercurian Dancer, of the excited voices of the guests and the emphatic disapproval of the Venusian proprietor who was shocked at having a brawl in his ultra-expensive, ultra-exclusive Palace.\n \n \"Better come to Headquarters with me, Dennis,\" the lieutenant said gently. \"We'll say you captured him, and if he's Koerber's, the credit's yours. A trip to Terra's what you need, Venus for you is a hoodoo!\"\n \n \n\n \n The stern, white haired I.S.P. Commander behind the immense Aluminil desk, frowned slightly as Dennis Brooke entered. He eyed the six foot four frame of the Captain before him with a mixture of feelings, as if uncertain how to begin. Finally, he sighed as if, having come to a decision, he were forcing himself to speak:\n \n \"Sit down, Dennis. I've sent for you, despite your grounding, for two reasons. The first one you already know—your capture of one of Koerber's henchmen—has given us a line as to his present orbit of piracy, and the means of a check on his activities. But that's not really why I've brought you here.\" He frowned again as if what he had to say were difficult indeed.\n \n \"Marla Starland, your fiancee, accepted an assignment we offered her—a delicate piece of work here on Terra that only a very beautiful, and very clever young lady could perform. And,\" he paused, grimacing,\n\"somewhere between Venus and Terra, the interplanetary spacer bringing her and several other passengers, began to send distress signals. Finally, we couldn't contact the ship any more. It is three days overdue. All passengers, a cargo of radium from Venus worth untold millions, the spacer itself—seem to have vanished.\"\n \n Dennis Brooke's space-tanned features had gone pale. His large hazel eyes, fringed with auburn lashes, too long for a man, were bright slits that smouldered. He stood silent, his hands clenched at his sides, while something cold and sharp seemed to dig at his heart with cruel precision.\n \n \"Marla!\" He breathed at last. The thought of Marla in the power of Koerber sent a wave of anguish that seared through him like an atom-blast.\n \n \"Commander,\" Dennis said, and his rich baritone voice had depths of emotion so great that they startled Commander Bertram himself—and that grizzled veteran of the I.S.P., had at one time or another known every change of torture that could possibly be wrung on a human soul.\n\"Commander, give me one ... one chance at that spawn of unthinkable begetting! Let me try, and I promise you ...\" in his torture, Dennis was unconsciously banging a knotted fist on the chaste, satiny surface of the priceless desk, \"I promise you that I will either bring you Koerber, or forfeit my life!\"\n \n Commander Bertram nodded his head. \"I brought you here for that purpose, son. We have reached a point in our war with Koerber, where the last stakes must be played ... and the last stake is death!\"\n \n He reached over and flipped up the activator on a small telecast set on his desk; instantly the viso-screen lighted up. \"You'll now see a visual record of all we know about the passenger spacer that left Venus with passengers and cargo, as far as we could contact the vessel in space. This, Dennis,\" the Commander emphasized his words, \"is your chance to redeem yourself!\" He fell silent, while the viso-screen began to show a crowded space port on Venus, and a gigantic passenger spacer up-tilted in its cradle.\n \n \n\n \n They watched the parabola it made in its trajectory as it flashed into space and then fell into orbit there beyond the planetary attraction of Venus. On the three-dimensional viso-screen it was uncannily real.\n \n A flight that had taken many hours to accomplish, was shortened on the viso-screen to a matter of minutes. They saw the great, proud interplanetary transport speeding majestically through the starry void, and suddenly, they saw her swerve in a great arc; again she swerved as if avoiding something deadly in space, and point upwards gaining altitude. It was zig-zagging now, desperately maneuvering in an erratic course, and as if by magic, a tiny spot appeared on the transport's side.\n \n Tiny on the viso-screen, the fatal spots must have been huge in actuality. To the Commander of the I.S.P., and to Captain Brooke, it was an old story. Atom-blasts were pitting the spacer's hull with deadly Genton shells. The great transport trembled under the impact of the barrage, and suddenly, the screen went blank.\n \n Commander Bertram turned slowly to face the young I.S.P. captain, whose features were a mask devoid of all expression now, save for the pallor and the burning fire in his eyes.\n \n \"And that's the sixth one in a month. Sometimes the survivors reach Terra in emergency spacers, or are picked up in space by other transports ... and sometimes son ... well, as you know, sometimes they're never seen again.\"\n \n \"When do I leave, Commander!\" Dennis Brooke's voice was like a javelin of ice.\n \n \"Right now, if you wish. We have a new cruiser armored in beryloid with double hull—a new design against Genton shells, but it's the speed of the thing that you'll want to know about. It just about surpasses anything ever invented. Get the figures and data from the coordination room, son; it's serviced and fueled and the crew's aboard.\" He extended his hand. \"You're the best spacer we have—aside from your recklessness—and on your success depends far more than the capture of an outlaw.\" Bertram smiled thinly. \"Happy landing!\"\n \n \n\n II\n \n Their nerves were ragged. Days and days of fruitless search for a phantom ship that seemed to have vanished from space, and an equally elusive pirate whose whereabouts were hidden in the depths of fathomless space.\n \n To all but Captain Brooke, this was a new adventure, their first assignment to duty in a search that went beyond the realm of the inner planets, where men spent sleepless nights in eternal vigilance against stray asteroids and outlaw crews of ruthless vandal ships. Even their cruiser was a new experience, the long, tapering fighter lacked the luxurious offices and appointments of the regular I.S.P. Patrol spacers. It placed a maximum on speed, and all available space was hoarded for fuel. The lightning fast tiger of the space-lanes, was a thing of beauty, but of grim, sleek beauty instinct with power, not the comfortable luxury that they knew.\n \n Day after day they went through their drills, donning space suits, manning battle stations; aiming deadly atom-cannon at empty space, and eternally scanning the vast empty reaches by means of the telecast.\n \n And suddenly, out of the void, as they had all but given up the search as a wild goose chase, a speck was limned in the lighted surface of the viso-screen in the control room. Instantly the I.S.P. cruiser came to life. In a burst of magnificent speed, the cruiser literally devoured the space leagues, until the spacer became a flashing streak. On the viso-screen, the speck grew larger, took on contours, growing and becoming slowly the drifting shell of what had been a transport.\n \n Presently they were within reaching distance, and Captain Brooke commanded through the teleradio from the control room:\n \n \"Prepare to board!\"\n \n Every member of the crew wanted to be among the boarding party, for all but George Randall, the junior member of the crew had served his apprenticeship among the inner planets, Mars, Venus and Terra. He felt nauseated at the very thought of going out there in that vast abyss of space. His young, beardless face, with the candid blue eyes went pale when the order was given. But presently, Captain Brooke named those who were to go beside himself:\n \n \"You, Tom and Scotty, take one emergency plane, and Dallas!\"\n \n \"Yes, Captain!\" Dallas Bernan, the immense third lieutenant boomed in his basso-profundo voice.\n \n \"You and I'll take a second emergency!\" There was a pause in the voice of the Captain from the control room, then: \"Test space suits. Test oxygen helmets! Atom-blasts only, ready in five minutes!\"\n \n George Randall breathed a sigh of relief. He watched them bridge the space to the drifting wreck, then saw them enter what had once been a proud interplanetary liner, now soon to be but drifting dust, and he turned away with a look of shame.\n \n Inside the liner, Captain Dennis Brooke had finished making a detailed survey.\n \n \"No doubt about it,\" he spoke through the radio in his helmet. \"Cargo missing. No survivors. No indication that the repulsion fields were out of order. And finally, those Genton shells could only have been fired by Koerber!\" He tried to maintain a calm exterior, but inwardly he seethed in a cold fury more deadly than any he had ever experienced. Somehow he had expected to find at least one compartment unharmed, where life might have endured, but now, all hope was gone. Only a great resolve to deal with Koerber once and for all remained to him.\n \n Dennis tried not to think of Marla, too great an ache was involved in thinking of her and all he had lost. When he finally spoke, his voice was harsh, laconic:\n \n \"Prepare to return!\"\n \n Scotty Byrnes, the cruiser's nurse, who could take his motors through a major battle, or hell and high water and back again, for that matter, shifted the Venusian weed that made a perpetual bulge on his cheek and gazed curiously at Captain Brooke. They all knew the story in various versions, and with special additions. But they were spacemen, implicit in their loyalty, and with Dennis Brooke they could and did feel safe.\n \n Tom Jeffery, the tall, angular and red-faced Navigator, whose slow, easygoing movements belied the feral persistence of a tiger, and the swiftness of a striking cobra in a fight, led the small procession of men toward the emergency planes. Behind him came Dallas Bernan, third lieutenant, looming like a young asteroid in his space suit, followed by Scotty, and finally Captain Brooke himself. All left in silence, as if the tragedy that had occurred aboard the wrecked liner, had touched them intimately.\n \n \n\n \n Aboard the I.S.P. Cruiser, a surprise awaited them. It was young George Randall, whose excited face met them as soon as they had entered the airlocks and removed the space suits.\n \n \"Captain Brooke ... Captain, recordings are showing on the new 'Jet Analyzers' must be the trail of some spacer. Can't be far!\" He was fairly dancing in his excitement, as if the marvelous work of the new invention that detected the disturbance of atomic jets at great distance were his own achievement.\n \n Dennis Brooke smiled. His own heart was hammering, and inwardly he prayed that it were Koerber. It had to be! No interplanetary passenger spacer could possibly be out here at the intersection of angles Kp\n39 degrees, 12 minutes, Fp 67 degrees of Ceres elliptic plane. None but a pirate crew with swift battle cruisers could dare! This was the dangerous asteroid belt, where even planetoids drifted in eccentric uncharted orbits.\n \n Dennis, Tom Jeffery and Scotty Byrnes raced to the control room, followed by the ponderous Dallas to whom hurry in any form was anathema. There could be no doubt now! The \"Jet Analyzer\" recorded powerful disturbance, atomic—could be nothing else.\n \n Instantly Captain Brooke was at the inter-communication speaker:\n \n \"Crew, battle stations! Engine room, full speed!\"\n \n Scotty Byrnes was already dashing to the engine room, where his beloved motors purred with an ascending hum. Aboard the I.S.P. Cruiser each member of the crew raced to his assigned task without delay. Action impended, and after days and nights of inertia, it was a blessed relief. Smiles appeared on haggard faces, and the banter of men suddenly galvanized by a powerful incentive was bandied back and forth. All but George Randall. Now that action was imminent. Something gripped his throat until he could hardly stand the tight collar of his I.S.P. uniform. A growing nausea gripped his bowels, and although he strove to keep calm, his hands trembled beyond control.\n \n In the compact, super-armored control room, Captain Brooke watched the telecast's viso-screen, with hungry eyes that were golden with anticipation. It seemed to him as if an eternity passed before at last, a black speck danced on the illuminated screen, until it finally reached the center of the viso-screen and remained there. It grew by leaps and bounds as the terrific speed of the cruiser minimized the distance long before the quarry was aware of pursuit.\n \n But at last, when the enemy cruiser showed on the viso-screen, unmistakably for what it was—a pirate craft, it showed by its sudden maneuver that it had detected the I.S.P. cruiser. For it had described a parabola in space and headed for the dangerous asteroid belt. As if navigated by a masterly hand that knew each and every orbit of the asteroids, it plunged directly into the asteroid drift, hoping to lose the I.S.P. cruiser with such a maneuver. Ordinarily, it would have succeeded, no I.S.P. patrol ship would have dared to venture into such a trap without specific orders. But to Dennis Brooke, directing the chase from the control room, even certain death was welcome, if only he could take Koerber with him.\n \n Weaving through the deadly belt for several hours, Dennis saw his quarry slow down. Instantly he seized the chance and ordered a salvo from starboard. Koerber's powerful spacer reeled, dived and came up spewing Genton-shells. The battle was on at last.\n \n From the banked atom-cannon of the I.S.P. Cruiser, a deadly curtain of atomic fire blazed at the pirate craft. A ragged rent back toward midship showed on Koerber's Cruiser which trembled as if it had been mortally wounded. Then Dennis maneuvered his cruiser into a power dive as a rain of Genton-shells swept the space lane above him, but as he came up, a lone shell struck. At such close range, super-armor was ripped, second armor penetrated and the magnificent vessel shook under the detonating impact.\n \n It was then that Dennis Brooke saw the immense dark shadow looming immediately behind Koerber's ship. He saw the pirate cruiser zoom desperately in an effort to break the gravity trap of the looming mass, but too late. It struggled like a fly caught in a spider-web to no avail. It was then that Koerber played his last card. Sensing he was doomed, he tried to draw the I.S.P. Cruiser down with him. A powerful magnetic beam lashed out to spear the I.S.P. Cruiser.\n \n \n\n \n With a wrenching turn that almost threw them out of control, Dennis maneuvered to avoid the beam. Again Koerber's beam lashed out, as he sank lower into the looming mass, and again Dennis anticipating the maneuver avoided it.\n \n \"George Randall!\" He shouted desperately into the speaker. \"Cut all jets in the rocket room! Hurry, man!\" He banked again and then zoomed out of the increasing gravity trap.\n \n \"Randall! I've got to use the magnetic repulsion plates.... Cut all the jets!\" But there was no response. Randall's screen remained blank. Then Koerber's lashing magnetic beam touched and the I.S.P. ship was caught, forced to follow the pirate ship's plunge like the weight at the end of a whiplash. Koerber's gunners sent one parting shot, an atom-blast that shook the trapped cruiser like a leaf.\n \n Beneath them, growing larger by the second, a small world rushed up to meet them. The readings in the Planetograph seemed to have gone crazy. It showed diameter 1200 miles; composition mineral and radio-active. Gravity seven-eighths of Terra. It couldn't be! Unless perhaps this unknown planetoid was the legendary core of the world that at one time was supposed to have existed between Jupiter and Mars. Only that could possibly explain the incredible gravity.\n \n And then began another type of battle. Hearing the Captain's orders to Randall, and noting that no result had been obtained, Scotty Byrnes himself cut the jets. The Magnetic Repulsion Plates went into action, too late to save them from being drawn, but at least they could prevent a crash. Far in the distance they could see Koerber's ship preceding them in a free fall, then the Planetoid was rushing up to engulf them.\n \n \n\n III\n \n The atmosphere was somewhat tenuous, but it was breathable, provided a man didn't exert himself. To the silent crew of the I.S.P. Cruiser, the strange world to which Koerber's magnetic Beam had drawn them, was anything but reassuring. Towering crags jutted raggedly against the sky, and the iridescent soil of the narrow valley that walled in the cruiser, had a poisonous, deadly look. As far as their eyes could reach, the desolate, denuded vista stretched to the horizon.\n \n \"Pretty much of a mess!\" Dennis Brooke's face was impassive as he turned to Scotty Byrnes. \"What's your opinion? Think we can patch her up, or are we stuck here indefinitely?\"\n \n Scotty eyed the damage. The atom-blast had penetrated the hull into the forward fuel chambers and the armor had blossomed out like flower petals. The crash-landing had not helped either.\n \n \"Well, there's a few beryloid plates in the storage locker, Captain, but,\" he scratched his head ruminatively and shifted his precious cud.\n \n \"But what? Speak up man!\" It was Tom Jeffery, his nerves on edge, his ordinarily gentle voice like a lash.\n \n \"But, you may as well know it,\" Scotty replied quietly. \"That parting shot of Koerber's severed our main rocket feed. I had to use the emergency tank to make it down here!\"\n \n For a long moment the four men looked at each other in silence. Dennis Brooke's face was still impassive but for the flaming hazel eyes. Tom tugged at the torn sleeve of his I.S.P. uniform, while Scotty gazed mournfully at the damaged ship. Dallas Bernan looked at the long, ragged line of cliffs.\n \n \"I think we got Koerber, though,\" he said at last. \"While Tom was doing a job of navigation, I had one last glimpse of him coming down fast and out of control somewhere behind those crags over there!\"\n \n \"To hell with Koerber!\" Tom Jeffery exploded. \"You mean we're stuck in this hellish rock-pile?\"\n \n \"Easy, Tom!\" Captain Brooke's tones were like ice. On his pale, impassive face, his eyes were like flaming topaz. \"Where's Randall?\"\n \n \"Probably hiding his head under a bunk!\" Dallas laughed with scorn. His contemptuous remark voiced the feelings of the entire crew. A man who failed to be at his battle-station in time of emergency, had no place in the I.S.P.\n \n \"Considering the gravity of this planetoid,\" Dennis Brooke said thoughtfully, \"it's going to take some blast to get us off!\"\n \n \"Maybe we can locate a deposit of anerioum or uranium or something for our atom-busters to chew on!\" Scotty said hopefully. He was an eternal optimist.\n \n \"Better break out those repair plates,\" Dennis said to Scotty. \"Tom, you get the welders ready. I've got a few entries to make in the log book, and then we'll decide on a party to explore the terrain and try to find out what happened to Koerber's ship. I must know,\" he said in a low voice, but with such passion that the others were startled.\n \n A figure appeared in the slanting doorway of the ship in time to hear the last words. It was George Randall, adjusting a bandaged forehead bumped during the crash landing.\n \n \"Captain ... I ... I wanted ...\" he paused unable to continue.\n \n \"You wanted what?\" Captain Brooke's voice was terse. \"Perhaps you wanted to explain why you weren't at your battle station?\"\n \n \"Sir, I wanted to know if ... if I might help Scotty with the welding job....\" That wasn't at all what he'd intended to say. But somehow the words had stuck in his throat and his face flushed deep scarlet. His candid blue eyes were suspiciously brilliant, and the white bandage with its crimson stains made an appealing, boyish figure. It softened the anger in Brooke's heart. Thinking it over calmly, Dennis realized this was the youngster's first trip into the outer orbits, and better men than he had cracked in those vast reaches of space. But there had been an instant when he'd found Randall cowering in the rocket-room, in the grip of paralyzing hysteria, when he could cheerfully have wrung his neck!\n \n \"Certainly, Randall,\" he replied in a much more kindly tone. \"We'll need all hands now.\"\n \n \"Thank you, sir!\" Randall seemed to hesitate for a moment, opened his mouth to speak further, but feeling the other's calculating gaze upon him, he whirled and re-entered the ship.\n \n \"But for him we wouldn't be here!\" Dallas exclaimed. \"Aagh!\" He shook his head in disgust until the several folds of flesh under his chin shook like gelatin. \"Cowards are hell!\" He spat.\n \n \"Easy, Dallas, Randall's a kid, give 'im a chance.\" Dennis observed.\n \n \"You Captain ... you're defending 'im? Why you had a greater stake in this than we, and he's spoiled it for you!\"\n \n \"Yep,\" Dennis nodded. \"But I'm still keeping my senses clear. No feuds on my ship. Get it!\" The last two words cut like a scimitar.\n \n Dallas nodded and lowered his eyes. Scotty shifted his cud and spat a thin stream of juice over the iridescent ground. One by one they re-entered the cruiser.",
      "metadata": {
        "title": "The Soul Eaters",
        "author": "William Conover",
        "passage_id": "63150",
        "uid": "42ccd388477c4aabbd8cde73b58e97d8",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "105",
                "uid": "87a2a5c010e14561a3d5059e118027f3",
                "response_text": "Dennis Brooke was drinking and watching a dancer along with rereading the last letter of Marla, his fiancee, who accepted a new assignment and left him. At the same time he was regretting being grounded and on bad terms with I.S.P. for a mistake. Suddenly, he felt danger and when the Mercurial dancer approached him, a Martian attempted an attack. After a short fight, Dennis overcame the Martian who turned out to possess a prohibited weapon and supposedly was a space pirate. After capturing the pirate, Dennis was called by I.S.P. commander and told that Marla and her whole spaceship traveling to Terra disappeared, supposedly captured by Koerber, the head of pirates. Dennis begged to be sent for the pirate leader and the commander gave him this chance. They watched a recording of Marla's spaceship zig-zagging and being attacked, which ended with a blank screen. Dennis immediately set out to space on a cruiser. After a long search without success, something appeared on the visa-screen and the crew prepared to board. Nevertheless, no survivors were found and the Captain, Dennis, was out of hope. Everyone left in silence the spot of the tragedy of the attacked spacer. Back on the ship, one of the crew, George Randall, gladly informed that an object was detected. The crew rushed for the object which indeed turned out to be a pirate craft trying to escape the persecutor. Koerber's ship was soon doomed and he caught Dennis' ship with a beam to follow. The ship crashed and the crew found itself in a place without any chance to escape from. The captain ordered to explore the place and see what happened to Koerber for sure, while others will be welding, and the crew reentered the ship."
              },
              {
                "worker_id": "104",
                "uid": "0a266eabe910481da91719c611b2be42",
                "response_text": "Dennis Brooke is recounting the letter Marla has left him and going through the feelings of reading that letter. He goes to the Jovian Chamber, an expensive but pleasure-ridden place. Unfortunately, the Jovian Chamber cost him his relationship with Marla and the rebuff of the I.S.P. He was distracted and not prepared for duty to complete the last link in a net of I.S.P cruisers that were surrounding a space pirate because he was at the Jovian Chamber. While back there, he becomes quite alert because there is a Martian looking at him with pure hatred in his eyes. A dancer flings herself onto his lap and the Martian comes rushing to attack Dennis. Dennis is able to avoid the attack and the police come and take the Martian away. The Martian turns out to be a wanted pirate crew member, and this capture allows Dennis to be positioned in a more favorable view by the commander of the I.S.P. \n\nDennis goes to meet the commander and the commander tells him some troubling news. He states that Marla’s ship is unable to be contacted and is multiple days overdue for contact. The commander tells Dennis that joining the mission would be his opportunity to redeem his reputation and Dennis is readily prepared to accept and wants to leave immediately. They eventually do leave and spend the first couple of days searching in space with no luck. However, they do eventually spot something in the distance and prepare all stations for incoming possibilities. They board a ship finding no survivors and the ship to be without cargo.  When they return to their ship, George excitedly greets them telling them that the radar is picking up a possible trail of a space. Dennis is hopeful that it is Koerber. The crew members hurriedly go to their assigned tasks and their faces are glowing with optimism. The pirate craft they encounter is producing maneuvers to try to lose the cruiser. Dennis is able to avoid attacks from Koerber’s beam for a while. Unfortunately, the I.S.P. ship does get caught in a magnetic beam by Koerber’s ship and is forced to follow the pirate ship’s plunge. \n\nAs they plunge, Dennis is confused by what is beneath them as there is incredible gravity. They eventually fall into a planetoid. When they land, they were questioning whether they are permanently stuck on the unknown planet or if they are able to repair the spacer. \n\nDallas becomes angry because he accuses Randall of them being stranded because Randall did not man his station and act out his orders. Dennis defends Randall asserting that it is no good to feud in a situation as such and that he will not allow it to occur. "
              },
              {
                "worker_id": "101",
                "uid": "0f6eb385578749669bcbb8dd9b03fbc0",
                "response_text": "Dennis Brooke is a captain of the I.S.P who is currently grounded due to his recklessness in capturing Koerber, a deadly space pirate. He spends his days in the Jovian Chamber, a place on Venus where the desires of its men are met constantly; despite this, his mind is only on his fiancee, Marla, whose letter he rereads while she is on a trip to Terra. One night at the chamber, Dennis is suddenly attacked by a strange Martian man, who he fights off and defeats. The police later discover that the Martian man was in possession of a forbidden weapon, inferring that he is part of Koerber's crew. Dennis then meets the I.S.P Commander in his office, where he is informed that a ship, the ship that was supposed to take Marla to Terra, has vanished, and all signs point to Koerber. The Commander gives Dennis a final chance to redeem himself and defeat Koerber for good, equipping him with a crew and an upgraded cruiser that can travel at record speed. Aboard the cruiser, Dennis eventually finds the vanished ship, but unfortunately no hopeful signs of survival from the destruction. Heartbroken by the loss of Marla, Dennis advises his crew to return back, when they notice Koerber's ship approaching. Dennis challenges the ship to a battle, sending cannons and jets to crash into the ship. However, Koerber's ship is quickly approaching the surface of a planet, and Koerber sends a magnetic beam to bring Dennis' cruiser down with him. Dennis panics and orders George Randall, the youngest on the crew, to cut the jets and use magentic repulsion, but Randall does not respond. Another crew member eventually cuts the jets, but not early enough, and the cruiser is stranded on the unknown planet. The crew brainstorms how they can repair the ship and get off the planet, blaming Randall; Dennis scolds the crew for being harsh on Randall as they get to work."
              },
              {
                "worker_id": "107",
                "uid": "857440f4a1d74ff0b96fa9cc5d4554a8",
                "response_text": "Dennis Brooke cannot stop reading the final letter he receives from his fiancee Marla Starland. He is at the Jovian Chamber in the Inter-planetary Palace on Venus, where it is highly regarded as an elusive place that costs a fortune to enter. He drinks and makes eye contact with a young martian, who stares at him back with hatred. A Mercurian dancer flings herself onto his lap, and the Martian leaps up to attack him while the other guests are distracted. Dennis manages to knock the Martian, and the international police find out that the Martian is a member of Bren Koerber’s pirate crew. The Police Lieutenant Gillian mentions that they should radio the I.S.P., but Dennis reveals that he is grounded from the organization. The lieutenant still insists that he come to Terra with him. Later, the I.S.P. commander frowns when he sees Dennis walk into the office. He explains that they brought him here for two reasons. The first reason is tracking down Koerber’s orbit of piracy by capturing one of his henchmen. The second reason is about the disappearance of Marla and the loss of contact with the interplanetary spacer that she was on. In his despair, Dennis begs the commander for one more opportunity to bring back Koerber or die trying. He then sees a visual record of the passenger spacer. They later embark on the trip, and the spacer they are in gets attacked by atom shells. The commander tells Dennis that he can use the new cruiser equipped to deal with these dangers. His expedition is the first assignment for many of the crew members. As they are about to give up, the cruiser finds what is left of a passenger cruiser. Everybody wants to be a part of the boarding party except for George Randall because he still feels nauseous about the idea. Tom, Scotty, and Dallas are chosen to go with Dennis. Dennis finishes creating the survey about the liners left, and they leave. Randall tells them that another spacer is somewhere close behind them, and Dennis hopes it is Koerber. He observes Koerber’s cruiser through the viso-screen, but it suddenly maneuvers once it realizes that the I.S.P. cruiser is nearby too. Although it tries to lose Dennis and his crew, Koerber’s cruiser is unsuccessful, and the two cruisers begin fighting. He sees the shadow behind Koerber’s ship and avoids getting hit by a beam that the enemy cruiser fires. Randall is given orders to cut the engines, but he does not follow them. The cruiser is forced to land in the middle of nowhere of unfamiliar territory. They discuss ways to get out of the area, and Dennis asks to see Randall. They talk briefly, and Dennis treats Randall much more kindly after seeing his first trip into the outer orbits. Even though the others are angry at Randall, he tells them there will be no feuds on the ship, and they re-enter the cruiser. \n"
              }
            ]
          },
          {
            "question_text": "What is the attitude of Dennis towards Marla?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "105",
                "uid": "87a2a5c010e14561a3d5059e118027f3",
                "response_text": "Marla used to be a fiancee of Dennis, but she broke up with him and left for an assignment. Her poignant last letter pained Dennis, but he kept rereading it, delving into drinks, dancers and images of Marla. This condition even caused him to fail his commander and be grounded. The break up left a huge void in Dennis and he had no desire to see other women. The news of her disappearance made Dennis pale and silent, he felt extreme pain, which was soon accompanied by anger towards Koerber. Dennis desired to rush that very second to search for Marla and bring Koerber, risking his own life. All the time without success Dennis was slowly losing hope, and when he didn't find any survivors, he was silent and devastated with the loss of hope to find Marla."
              },
              {
                "worker_id": "104",
                "uid": "0a266eabe910481da91719c611b2be42",
                "response_text": "Dennis recounts how the loss of Marla has left a void in his heart that hurts him. His repeated reading of a letter that she has left him shows that Dennis longs for Marla and wishes to be reunited with her because of his love for her. Dennis clearly has a great love for Marla because he is willing to risk his life to go and find her, hopefully alive. He is anguished by the idea that Marla could be in danger or did die. \n\n"
              },
              {
                "worker_id": "101",
                "uid": "0f6eb385578749669bcbb8dd9b03fbc0",
                "response_text": "Marla is Dennis' fiancee. The two are in love, despite being apart due to business; Marla accepted a mission on the planet Terra, leaving Dennis on Venus. Even though the two are far away from each other, Dennis still cares deeply about Marla and thinks of her often. At the beginning of the story, he is rereading the last letter that Marla wrote him before leaving, and even when at the Jovian Chamber, a palace meant to meet anyone's desires, Dennis can only think of Marla and her beauty. Dennis' feelings towards Marla are also apparent when he gets the news of Marla's ship being seized by Koerber."
              },
              {
                "worker_id": "107",
                "uid": "857440f4a1d74ff0b96fa9cc5d4554a8",
                "response_text": "Dennis loves and adores Marla dearly, to the point where he is willing to risk his life to save her. He is heartbroken over the letter that she initially sent him and cannot bring himself to enjoy anything in the Jovian Chamber. When the commander tells him that his wife has potentially fallen into the hands of Koerber, he does not hesitate to hunt the criminal down for her. He is also very determined because of her, effortlessly taking on his duties as captain and giving out fast orders if it means that they will be reunited sooner. Even though Marla’s letter has already expressed her goodbyes, he does not give up and will do anything to see her again. "
              }
            ]
          },
          {
            "question_text": "What is the importance of the Martian man attacking Dennis?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "105",
                "uid": "87a2a5c010e14561a3d5059e118027f3",
                "response_text": "Dennis was forced to fight back and exit his state of stagnation, caused by being grounded at work and left by fiancee. When he overcame the enemy, the least turned out to be a space pirate, bearing a prohibited weapon. That way Dennis stopped and imprisoned a criminal, who turned out to possess useful information about Koerber's present activities. This helpful action, together with Dennis' personal interest in success of the mission and his skills of a spacer, made the commander give Dennis a chance to redeem himself. For that reason Dennis was sent to search for Koerber and he set out for the adventure."
              },
              {
                "worker_id": "104",
                "uid": "0a266eabe910481da91719c611b2be42",
                "response_text": "The Martian fails to successfully attack Dennis as he is able to maneuver out of the way to prevent a painful or deadly attack. The Martian is captured by the police and they tell Dennis that he had a forbidden weapon on him, an atomic disintegrator. That type of weapon is only found on space pirates or criminals. It turns out that the Martian was a member of a pirate crew, specifically Koerber’s pirate crew. Dennis aiding the capture of this Martian is important because it puts him in a more favorable position with the commander of the I.S.P. "
              },
              {
                "worker_id": "101",
                "uid": "0f6eb385578749669bcbb8dd9b03fbc0",
                "response_text": "Though the Martian man who attacks Dennis seems random, it is later revealed by the Police Lieutenant that the Martian was in possession of an atomic-disintegrator, which is a forbidden weapon. This, in addition to the attack, leads them to suspect that the Martian man is part of Koerber's pirate team. Dennis had previously been grounded by the I.S.P, but his brawl with the Martian man gives him the opportunity to be back on the I.S.P's good side. The Police Lieutenant tells Dennis that if the Martian turned out to be one of Koerber's men, he would allow Dennis to take the credit for his capture, which ends up working."
              },
              {
                "worker_id": "107",
                "uid": "857440f4a1d74ff0b96fa9cc5d4554a8",
                "response_text": "The Martian man attacking Dennis reveals more critical information about Koerber, the criminal’s whereabouts, and how Dennis later becomes involved. Even though Denis is temporarily not allowed to interact with the I.S.P., the Martian man attacking him creates an opportunity for him to go back to the organization. Furthermore, he is also aware of Marla’s situation from going to I.S.P., and he goes immediately to hunt down Koerber. For the commander, this Martian’s attack also means that the location of their lost passengers and cargo must be found soon. The attack sets up the plot for the majority of the story, and it also helps Dennis become motivated enough to go and rescue Marla. \n"
              }
            ]
          },
          {
            "question_text": "What does Dennis do for living and how is he treated at work?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "105",
                "uid": "87a2a5c010e14561a3d5059e118027f3",
                "response_text": "Dennis works as an I.S.P. captain. His commander Bertram calls him son and is compassionate for the los of Marla. The commander values him and estimates as the best spacer. The Police Lieutenant is also friendly towards Dennis and willing to help him redeem, by saying that Dennis captured the pirate. Dennis' crew on the mission after Koerber heard the stories about the Captain and all were curious but silent, as if they were touched by his tragedy. The crew was loyal and trusted the captain. Dennis was sympathetic and full of humanity towards the young George Randall who failed the crew as it was his first mission. This action was a surprise for other members but none protested.\n\n\n"
              },
              {
                "worker_id": "104",
                "uid": "0a266eabe910481da91719c611b2be42",
                "response_text": "Dennis is a young captain for the I.S.P. He is able to pilot an I.S.P. patrol ship with great control. While on the rescue mission trip, Dennis is treated with respect and as the authority figure of the ship. He commands Dallas, and the others, to not start conflicts or feuds on his ship because it is necessary to keep the senses clear in such a dire situation. They respond with respect to his leadership and authority. "
              },
              {
                "worker_id": "101",
                "uid": "0f6eb385578749669bcbb8dd9b03fbc0",
                "response_text": "Dennis is a captain for the I.S.P. Before being grounded, he would aid in missions of varying objectives, patrolling space and most recently on the hunt for space pirate Koerber. When he is being welcomed back to the I.S.P for his next mission, Commander Bertram treats him in a playfully reprimanding manner, but for everyone else on the crew, Dennis is a leader and a guide that they look up to. Running the ship, Dennis efficiently orders the crew to do their respective tasks, and the crew admires his leadership and tries their best to be obedient. "
              },
              {
                "worker_id": "107",
                "uid": "857440f4a1d74ff0b96fa9cc5d4554a8",
                "response_text": "Dennis works for the I.S.P. as a spacer and captain. He is initially grounded by the organization, where he mentions that Commander Bertram has said that an infraction of rules is considered a major offense. However, when Bertram invites him back to pilot one of the liners, any former prejudices are gone. All of his crew trust him completely, and they are all eager to do whatever he assigns them. Even though Bertram considers him reckless, he considers him one of the best spacers that they have present. The other crew members also value his opinion highly, as they all listened when he told them not to feud amongst each other. "
              }
            ]
          },
          {
            "question_text": "Where does the story take place?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "105",
                "uid": "87a2a5c010e14561a3d5059e118027f3",
                "response_text": "The story starts on Venus, in a pleasure palace where Dennis is trying to distract himself from his ex-fiancee and being grounded on his job. After an attack followed by Dennis' victory, he proceeds Headquarters with the police and soon enters the I.S.P. commander's office. From there he immediately sets off to space on a ship, searching for days through the space for any signs of pirates or the disappeared spaceship. The first stop is the remnants of transport lacking any use. The second is a detected pirate spaceship, which the crew starts to follow. The setting of the chase remains in space, and after being engulfed by a Planetoid, the crew find itself in a strange world. The setting was rocky and looked deadly. Only desolate vista was seen around. "
              },
              {
                "worker_id": "104",
                "uid": "0a266eabe910481da91719c611b2be42",
                "response_text": "Dennis is at the Jovian Chamber which is a place that caters to a man’s desire. Then Dennis is taken to the headquarters for the I.S.P, to talk to the commander. He goes to the office of the commander and learns some troubling news about Marla. The crew, along with Dennis and the commander, spend days on a spaceship searching space for Marla’s ship and a pirate ship. When they spot a trail of a spacer, Dennis notes that they are at the intersection of angles Kp at 39 degrees, for 12 minutes, Fp at 67 degrees of Ceres elliptic plane. They fall into an unknown planetoid where the atmosphere is breathable but does not allow for much exertion. "
              },
              {
                "worker_id": "101",
                "uid": "0f6eb385578749669bcbb8dd9b03fbc0",
                "response_text": "The beginning of the story takes place in the Jovian Chamber within the Inter-planetary Palace on Venus, where Dennis is staying after being grounded by the I.S.P. The chamber is a luxurious, royal place with drinks, dancers, and anything a man could desire. After the brawl with a Martian, Dennis goes to the I.S.P Commander's office, where he is given a new mission and cruiser, which is updated with intense speed. Once the mission begins, Dennis spends days on the cruiser, which despite being efficient, lacks comfortable space and offices like the other cruisers do. Eventually, the cruiser crashes onto an unknown planet, with strong gravity, intimidating soils and valleys, and iridescent ground. "
              },
              {
                "worker_id": "107",
                "uid": "857440f4a1d74ff0b96fa9cc5d4554a8",
                "response_text": "The story initially takes place on Venus. The Jovian Chamber is packed, and there is the loud sound of the barbaric rhythms of \"Congahua\" in the background.  There is a beautiful Mercurian dancer who weaves amongst the crowd too. There are also tables to sit and have drinks at. After Venus, the story takes place briefly in Commander Bertram’s office at the I.S.P. There is a large aluminil desk and a small telecast set on it. Then, the story takes place in space as they chase down Koerber's cruiser. The cruiser itself has an engine room, a control room, and bunks for rest. One of the other cruisers they encounter has everything in place, except for a noticeably missing amount of cargo. Finally, when they crash, the place the crew crashes in is very difficult to breathe. There are towering jugs that jut raggedly against the sky and iridescent soil for the narrow valley. The crew is the only people there, and there is just nothing that stretches into the horizon."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4775,
        "document_length_chars": 28194
      }
    }
  ]
}