{
  "item_metadata": {
    "item_id": "63304",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63304",
      "content": "DOUBLECROSS\n \n\n by JAMES Mac CREIGH\n \n \n Revolt was brewing on Venus, led by the descendant of the first Earthmen to land. Svan was the leader making the final plans—plotting them a bit too well.\n \n [Transcriber's Note: This etext was produced from Planet Stories Winter 1944. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n The Officer of the Deck was pleased as he returned to the main lock. There was no reason why everything shouldn't have been functioning perfectly, of course, but he was pleased to have it confirmed, all the same. The Executive Officer was moodily smoking a cigarette in the open lock, staring out over the dank Venusian terrain at the native town. He turned.\n \n \"Everything shipshape, I take it!\" he commented.\n \n The OD nodded. \"I'll have a blank log if this keeps up,\" he said.\n\"Every man accounted for except the delegation, cargo stowed, drivers ready to lift as soon as they come back.\"\n \n The Exec tossed away his cigarette. \" If they come back.\"\n \n \"Is there any question?\"\n \n The Exec shrugged. \"I don't know, Lowry,\" he said. \"This is a funny place. I don't trust the natives.\"\n \n Lowry lifted his eyebrows. \"Oh? But after all, they're human beings, just like us—\"\n \n \"Not any more. Four or five generations ago they were. Lord, they don't even look human any more. Those white, flabby skins—I don't like them.\"\n \n \"Acclimation,\" Lowry said scientifically. \"They had to acclimate themselves to Venus's climate. They're friendly enough.\"\n \n The Exec shrugged again. He stared at the wooden shacks that were the outskirts of the native city, dimly visible through the ever-present Venusian mist. The native guard of honor, posted a hundred yards from the Earth-ship, stood stolidly at attention with their old-fashioned proton-rifles slung over their backs. A few natives were gazing wonderingly at the great ship, but made no move to pass the line of guards.\n \n \"Of course,\" Lowry said suddenly, \"there's a minority who are afraid of us. I was in town yesterday, and I talked with some of the natives. They think there will be hordes of immigrants from Earth, now that we know Venus is habitable. And there's some sort of a paltry underground group that is spreading the word that the immigrants will drive the native Venusians—the descendants of the first expedition, that is—right down into the mud. Well—\" he laughed—\"maybe they will. After all, the fittest survive. That's a basic law of—\"\n \n The annunciator over the open lock clanged vigorously, and a metallic voice rasped: \"Officer of the Deck! Post Number One! Instruments reports a spy ray focused on the main lock!\"\n \n Lowry, interrupted in the middle of a word, jerked his head back and stared unbelievingly at the tell-tale next to the annunciator. Sure enough, it was glowing red—might have been glowing for minutes. He snatched at the hand-phone dangling from the wall, shouted into it.\n\"Set up a screen! Notify the delegation! Alert a landing party!\" But even while he was giving orders, the warning light flickered suddenly and went out. Stricken, Lowry turned to the Exec.\n \n The Executive Officer nodded gloomily. He said, \"You see!\"\n \n \n\n \n \"You see?\"\n \n Svan clicked off the listening-machine and turned around. The five others in the room looked apprehensive. \"You see?\" Svan repeated. \"From their own mouths you have heard it. The Council was right.\"\n \n The younger of the two women sighed. She might have been beautiful, in spite of her dead-white skin, if there had been a scrap of hair on her head. \"Svan, I'm afraid,\" she said. \"Who are we to decide if this is a good thing? Our parents came from Earth. Perhaps there will be trouble at first, if colonists come, but we are of the same blood.\"\n \n Svan laughed harshly. \" They don't think so. You heard them. We are not human any more. The officer said it.\"\n \n The other woman spoke unexpectedly. \"The Council was right,\" she agreed. \"Svan, what must we do?\"\n \n Svan raised his hand, thoughtfully. \"One moment. Ingra, do you still object?\"\n \n The younger woman shrank back before the glare in his eyes. She looked around at the others, found them reluctant and uneasy, but visibly convinced by Svan.\n \n \"No,\" she said slowly. \"I do not object.\"\n \n \"And the rest of us? Does any of us object?\"\n \n Svan eyed them, each in turn. There was a slow but unanimous gesture of assent.\n \n \"Good,\" said Svan. \"Then we must act. The Council has told us that we alone will decide our course of action. We have agreed that, if the Earth-ship returns, it means disaster for Venus. Therefore, it must not return.\"\n \n An old man shifted restlessly. \"But they are strong, Svan,\" he complained. \"They have weapons. We cannot force them to stay.\"\n \n Svan nodded. \"No. They will leave. But they will never get back to Earth.\"\n \n \"Never get back to Earth?\" the old man gasped. \"Has the Council authorized—murder?\"\n \n Svan shrugged. \"The Council did not know what we would face. The Councilmen could not come to the city and see what strength the Earth-ship has.\" He paused dangerously. \"Toller,\" he said, \"do you object?\"\n \n Like the girl, the old man retreated before his eyes. His voice was dull. \"What is your plan?\" he asked.\n \n Svan smiled, and it was like a dark flame. He reached to a box at his feet, held up a shiny metal globe. \"One of us will plant this in the ship. It will be set by means of this dial—\" he touched a spot on the surface of the globe with a pallid finger—\"to do nothing for forty hours. Then—it will explode. Atomite.\"\n \n He grinned triumphantly, looking from face to face. The grin faded uncertainly as he saw what was in their eyes—uncertainty, irresolution. Abruptly he set the bomb down, savagely ripped six leaves off a writing tablet on the table next him. He took a pencil and made a mark on one of them, held it up.\n \n \"We will let chance decide who is to do the work,\" he said angrily. \"Is there anyone here who is afraid? There will be danger, I think....\"\n \n No answer. Svan jerked his head. \"Good,\" he said. \"Ingra, bring me that bowl.\"\n \n Silently the girl picked up an opaque glass bowl from the broad arm of her chair. It had held Venus-tobacco cigarettes; there were a few left. She shook them out and handed the bowl to Svan, who was rapidly creasing the six fatal slips. He dropped them in the bowl, stirred it with his hand, offered it to the girl. \"You first, Ingra,\" he said.\n \n She reached in mechanically, her eyes intent on his, took out a slip and held it without opening it. The bowl went the rounds, till Svan himself took the last. All eyes were on him. No one had looked at their slips.\n \n Svan, too, had left his unopened. He sat at the table, facing them.\n\"This is the plan,\" he said. \"We will go, all six of us, in my ground car, to look at the Earth-ship. No one will suspect—the whole city has been to see it already. One will get out, at the best point we can find. It is almost dusk now. He can hide, surely, in the vegetation. The other five will start back. Something will go wrong with the car—perhaps it will run off the road, start to sink in the swamp. The guards will be called. There will be commotion—that is easy enough, after all; a hysterical woman, a few screams, that's all there is to it. And the sixth person will have his chance to steal to the side of the ship. The bomb is magnetic. It will not be noticed in the dark—they will take off before sunrise, because they must travel away from the sun to return—in forty hours the danger is removed.\"\n \n There was comprehension in their eyes, Svan saw ... but still that uncertainty. Impatiently, he crackled: \"Look at the slips!\"\n \n Though he had willed his eyes away from it, his fingers had rebelled. Instinctively they had opened the slip, turned it over and over, striving to detect if it was the fatal one. They had felt nothing....\n \n And his eyes saw nothing. The slip was blank. He gave it but a second's glance, then looked up to see who had won the lethal game of chance. Almost he was disappointed.\n \n Each of the others had looked in that same second. And each was looking up now, around at his neighbors. Svan waited impatiently for the chosen one to announce it—a second, ten seconds....\n \n Then gray understanding came to him. A traitor! his subconscious whispered. A coward! He stared at them in a new light, saw their indecision magnified, became opposition.\n \n Svan thought faster than ever before in his life. If there was a coward, it would do no good to unmask him. All were wavering, any might be the one who had drawn the fatal slip. He could insist on inspecting every one, but—suppose the coward, cornered, fought back? In fractions of a second, Svan had considered the evidence and reached his decision. Masked by the table, his hand, still holding the pencil, moved swiftly beneath the table, marked his own slip.\n \n In the palm of his hand, Svan held up the slip he had just marked in secret. His voice was very tired as he said, \"I will plant the bomb.\"\n \n \n\n \n The six conspirators in Svan's old ground car moved slowly along the main street of the native town. Two Earth-ship sailors, unarmed except for deceptively flimsy-looking pistols at their hips, stood before the entrance to the town's Hall of Justice.\n \n \"Good,\" said Svan, observing them. \"The delegation is still here. We have ample time.\"\n \n He half turned in the broad front seat next to the driver, searching the faces of the others in the car. Which was the coward? he wondered. Ingra? Her aunt? One of the men?\n \n The right answer leaped up at him. They all are , he thought. Not one of them understands what this means. They're afraid.\n \n \n He clamped his lips. \"Go faster, Ingra,\" he ordered the girl who was driving. \"Let's get this done with.\"\n \n She looked at him, and he was surprised to find compassion in her eyes. Silently she nodded, advanced the fuel-handle so that the clumsy car jolted a trace more rapidly over the corduroy road. It was quite dark now. The car's driving light flared yellowishly in front of them, illuminating the narrow road and the pale, distorted vegetation of the jungle that surrounded them. Svan noticed it was raining a little. The present shower would deepen and intensify until midnight, then fall off again, to halt before morning. But before then they would be done.\n \n A proton-bolt lanced across the road in front of them. In the silence that followed its thunderous crash, a man's voice bellowed: \"Halt!\"\n \n The girl, Ingra, gasped something indistinguishable, slammed on the brakes. A Venusian in the trappings of the State Guard advanced on them from the side of the road, proton-rifle held ready to fire again.\n \n \"Where are you going?\" he growled.\n \n Svan spoke up. \"We want to look at the Earth-ship,\" he said. He opened the door beside him and stepped out, careless of the drizzle. \"We heard it was leaving tonight,\" he continued, \"and we have not seen it. Is that not permitted?\"\n \n The guard shook his head sourly. \"No one is allowed near the ship. The order was just issued. It is thought there is danger.\"\n \n Svan stepped closer, his teeth bared in what passed for a smile. \"It is urgent,\" he purred. His right hand flashed across his chest in a complicated gesture. \"Do you understand?\"\n \n Confusion furrowed the guard's hairless brows, then was replaced by a sudden flare of understanding—and fear. \"The Council!\" he roared.\n\"By heaven, yes, I understand! You are the swine that caused this—\" He strove instinctively to bring the clumsy rifle up, but Svan was faster. His gamble had failed; there was only one course remaining. He hurled his gross white bulk at the guard, bowled him over against the splintery logs of the road. The proton-rifle went flying, and Svan savagely tore at the throat of the guard. Knees, elbows and claw-like nails—Svan battered at the astonished man with every ounce of strength in his body. The guard was as big as Svan, but Svan had the initial advantage ... and it was only a matter of seconds before the guard lay unconscious, his skull a mass of gore at the back where Svan had ruthlessly pounded it against the road.\n \n \n Svan grunted as his fingers constricted brutally.\n \n\n \n Svan rose, panting, stared around. No one else was in sight, save the petrified five and the ground car. Svan glared at them contemptuously, then reached down and heaved on the senseless body of the guard. Over the shoulder of the road the body went, onto the damp swampland of the jungle. Even while Svan watched the body began to sink. There would be no trace.\n \n Svan strode back to the car. \"Hurry up,\" he gasped to the girl. \"Now there is danger for all of us, if they discover he is missing. And keep a watch for other guards.\"\n \n \n\n \n Venus has no moon, and no star can shine through its vast cloud layer. Ensign Lowry, staring anxiously out through the astro-dome in the bow of the Earth-ship, cursed the blackness.\n \n \"Can't see a thing,\" he complained to the Exec, steadily writing away at the computer's table. \"Look—are those lights over there?\"\n \n The Exec looked up wearily. He shrugged. \"Probably the guards. Of course, you can't tell. Might be a raiding party.\"\n \n Lowry, stung, looked to see if the Exec was smiling, but found no answer in his stolid face. \"Don't joke about it,\" he said. \"Suppose something happens to the delegation?\"\n \n \"Then we're in the soup,\" the Exec said philosophically. \"I told you the natives were dangerous. Spy-rays! They've been prohibited for the last three hundred years.\"\n \n \"It isn't all the natives,\" Lowry said. \"Look how they've doubled the guard around us. The administration is co-operating every way they know how. You heard the delegation's report on the intercom. It's this secret group they call the Council.\"\n \n \"And how do you know the guards themselves don't belong to it?\" the Exec retorted. \"They're all the same to me.... Look, your light's gone out now. Must have been the guard. They're on the wrong side to be coming from the town, anyhow....\"\n \n \n\n \n Svan hesitated only a fraction of a second after the girl turned the lights out and stopped the car. Then he reached in the compartment under the seat. If he took a little longer than seemed necessary to get the atomite bomb out of the compartment, none of the others noticed. Certainly it did not occur to them that there had been two bombs in the compartment, though Svan's hand emerged with only one.\n \n He got out of the car, holding the sphere. \"This will do for me,\" he said. \"They won't be expecting anyone to come from behind the ship—we were wise to circle around. Now, you know what you must do?\"\n \n Ingra nodded, while the others remained mute. \"We must circle back again,\" she parroted. \"We are to wait five minutes, then drive the car into the swamp. We will create a commotion, attract the guards.\"\n \n Svan, listening, thought: It's not much of a plan. The guards would not be drawn away. I am glad I can't trust these five any more. If they must be destroyed, it is good that their destruction will serve a purpose.\n \n \n Aloud, he said, \"You understand. If I get through, I will return to the city on foot. No one will suspect anything if I am not caught, because the bomb will not explode until the ship is far out in space. Remember, you are in no danger from the guards.\"\n  From the guards , his mind echoed. He smiled. At least, they would feel no pain, never know what happened. With the amount of atomite in that bomb in the compartment, they would merely be obliterated in a ground-shaking crash.\n \n Abruptly he swallowed, reminded of the bomb that was silently counting off the seconds. \"Go ahead,\" he ordered. \"I will wait here.\"\n \n \"Svan.\" The girl, Ingra, leaned over to him. Impulsively she reached for him, kissed him. \"Good luck to you, Svan,\" she said.\n \n \"Good luck,\" repeated the others. Then silently the electric motor of the car took hold. Skilfully the girl backed it up, turned it around, sent it lumbering back down the road. Only after she had traveled a few hundred feet by the feel of the road did she turn the lights on again.\n \n Svan looked after them. The kiss had surprised him. What did it mean? Was it an error that the girl should die with the others?\n \n There was an instant of doubt in his steel-shackled mind, then it was driven away. Perhaps she was loyal, yet certainly she was weak. And since he could not know which was the one who had received the marked slip, and feared to admit it, it was better they all should die.\n \n He advanced along the midnight road to where the ground rose and the jungle plants thinned out. Ahead, on an elevation, were the rain-dimmed lights of the Earth-ship, set down in the center of a clearing made by its own fierce rockets. Svan's mist-trained eyes spotted the circling figures of sentries, and knew that these would be the ship's own. They would not be as easily overcome as the natives, not with those slim-shafted blasters they carried. Only deceit could get him to the side of the ship.\n \n Svan settled himself at the side of the road, waiting for his chance. He had perhaps three minutes to wait; he reckoned. His fingers went absently to the pouch in his wide belt, closed on the slip of paper. He turned it over without looking at it, wondering who had drawn the first cross, and been a coward. Ingra? One of the men?\n \n \n\n \n He became abruptly conscious of a commotion behind him. A ground car was racing along the road. He spun around and was caught in the glare of its blinding driving-light, as it bumped to a slithering stop.\n \n Paralyzed, he heard the girl's voice. \"Svan! They're coming! They found the guard's rifle, and they're looking for us! Thirty Earthmen, Svan, with those frightful guns. They fired at us, but we got away and came for you. We must flee!\"\n \n He stared unseeingly at the light. \"Go away!\" he croaked unbelievingly. Then his muscles jerked into action. The time was almost up—the bomb in the car—\n \n \"Go away!\" he shrieked, and turned to run. His fists clenched and swinging at his side, he made a dozen floundering steps before something immense pounded at him from behind. He felt himself lifted from the road, sailing, swooping, dropping with annihilating force onto the hard, charred earth of the clearing. Only then did he hear the sound of the explosion, and as the immense echoes died away he began to feel the pain seeping into him from his hideously racked body....\n \n The Flight Surgeon rose from beside him. \"He's still alive,\" he said callously to Lowry, who had just come up. \"It won't last long, though. What've you got there?\"\n \n Lowry, a bewildered expression on his beardless face, held out the two halves of a metallic sphere. Dangling ends of wires showed where a connection had been broken. \"He had a bomb,\" he said. \"A magnetic-type, delayed-action atomite bomb. There must have been another in the car, and it went off. They—they were planning to bomb us.\"\n \n \"Amazing,\" the surgeon said dryly. \"Well, they won't do any bombing now.\"\n \n Lowry was staring at the huddled, mutilated form of Svan. He shuddered. The surgeon, seeing the shudder, grasped his shoulder.\n \n \"Better them than us,\" he said. \"It's poetic justice if I ever saw it. They had it coming....\" He paused thoughtfully, staring at a piece of paper between his fingers. \"This is the only part I don't get,\" he said.\n \n \"What's that?\" Lowry craned his neck. \"A piece of paper with a cross on it? What about it?\"\n \n The surgeon shrugged. \"He had it clenched in his hand,\" he said. \"Had the devil of a time getting it loose from him.\" He turned it over slowly, displayed the other side. \"Now what in the world would he be doing carrying a scrap of paper with a cross marked on both sides?\"",
      "metadata": {
        "title": "Doublecross",
        "author": "James Mac Creigh",
        "passage_id": "63304",
        "uid": "c88a2a397faf4e9a9f1b8bf6aef542db",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "112",
                "uid": "57f8b65bd11d491dbf6c73685c2779d6",
                "response_text": "Svan, a leader of members in the Council on Venus, plots to revolt against the Earthman delegations who are going to bring back the news of the habitability of Venus. Initially, he eavesdrops on the conversation between the Office of the Deck and the Executive Officer, which is about the untrustworthiness of Venusians, the descendants of the first generation of Earthman who migrated to Venus. Svan then initiates a revolting plan against the Earthman.\n\nBy showing this conversation to the group, Svan convinces the members to conduct his plan of not letting the Earthman ship go back to the Earth. In his plan, they will drive near the ship, five people will cause some chaos to attract the guards, and one person will put the delayed-action atomite bomb on the ship. They draw lots to determine when they decide who will put the bomb. However, Svan finds that no one admits to being the one, so he draws a cross on his slip, pretending to be the one who has terrible luck. \n\nAfter assigning the tasks to each person, Svan and his members drive to cross the border, where Svan brings down a native guard. When they separate to let one group cause the commotion and let Svan put the bomb, Svan takes out one bomb and leaves another one in the car. He knows that the bomb on the car will explode and attract the Earthman guards, which is unknown by the other members. He sees the car leave and turns to wait for the explosion. But the car comes back because the native guards found the rifle left by the murdered guard. The members in the car try to pick up Svan to flee from the search of the Earthman when Svan tries his best to run away. The explosion happens. Svan is on the verge of death when the Office of the Deck and the Executive Officer come to see him. They find a slip with a cross drawn on both sides in his hand.\n"
              },
              {
                "worker_id": "111",
                "uid": "06c25c80707044b3852749e8ad4ada4f",
                "response_text": "The story follows two different groups of people. One of these is a crew of humans from earth that arrived on venus with the purpose of scouting and of negotiating with the venus natives to prepare for the arrival of more humans. These natives were in fact the descendants of the first group of humans that arrived on venus. Even though they are humans, their physical appearance has adapted to the venusian atmosphere. When the humans arrive, a group of natives called “The Council” decided to bomb the ship of the humans. To decide the person who would sneak on the ship to plant the bomb, the natives marked a slip with an X and randomly picked slips. When no one came forward, the leader of the natives, Svan, decided to do it himself. Because the person with the X didn’t come forward, Svan didn’t trust his group anymore. Therefore, after the group sneaked past a guard, Svan decided to blow up both the car with his team and the ship. Svan and his team split up, and just as the car’s bomb was going to explode, they returned to Svan because they were caught. This led to all of them getting blown up. When the crew of the human ship found the bodies, they saw that Svan had in fact a slip with X’s on both sides. "
              },
              {
                "worker_id": "113",
                "uid": "a03db93d0a2546a9a773f625aadf7cb8",
                "response_text": "Approximately 4-5 generations ago the first expedition landed on Venus, the descendants of these explorers are called the native Venusians. A delegation from Earth just arrived on Venus, and everyone wonders what is going to happen next now that people know Venus is habitable. \n\nThe Executive Officer - the Exec - and the Officer of the Deck - Lowry -  talk in the Earth-ship’s open lock. The Exec doubts the natives’ friendliness and does not consider them human anymore. Lowry tries to explain that their appearance doesn't affect their amiability. He also tells the Exec that some natives are afraid of the possible wave of immigration from Earth because it can ruin their regular way of life, and some underground group is spreading the word that the consequences will be even worse. Lowry adds that it’s possible but is interrupted by a loud voice notifying them about a spy ray focused on their lock. The Exec alerts their guards and the delegation. \n\nThe ray was used by Svan and five other representatives of the Council - an underground organization fighting against any partnerships with humans. They hear Lowry’s words, and Svan becomes infuriated. He persuades everyone, including Ingra who initially hesitates, that they can’t let the delegation come back to Earth. Svan plans to plant a bomb in the ship, it will detonate on the delegation’s way back, killing everyone. Others are uncertain, so Svan decides to randomly pick the one who will plant the bomb. When he sees that his slip is blank, he thinks that someone is afraid to admit that they had the slip with the cross. So Svan quickly marks his slip and pretends to be the one who was initially chosen. He explains the specifics of their plan: while he will be near the ship, the others will fake a car accident to draw some guards which will allow Svan to get in. Their car is stopped by the State Guard who realizes that Svan is the reason the state of danger was declared. Svan kills the guard and hides the body. He takes one bomb and leaves another one in the car, hoping that the explosion will draw enough attention and punish the five people he now considers fearful traitors. Before the car takes off, Ingra kisses Svan. He waits near the ship fumbling with his slip and wondering who the coward was. Suddenly, he hears the car is driving back. Ingra screams that they were chased, but got away and came back for Svan. He starts running from the car, realizing the bomb inside it is supposed to detonate. The explosion wave knocks him out. Later, he wakes up near a surgeon, who calmly declares that Svan will soon die from the wounds, and shocked Lowry. The surgeon is confused by a paper slip with a cross marked on both sides he found clenched in Svan’s hand. "
              },
              {
                "worker_id": "110",
                "uid": "bf27bc895713472bb5f13a662fb64b0c",
                "response_text": "In James Mac Creigh's short story Doublecross, the actions revolve around two opposing sides of the storyline of the planet Venus. The Officer of the Deck on the Earth spaceship reports to The Executive Officer about a pathetic underground group of dissidents who spread the rumor that immigrants will kill the indigenous Venusians, descendants of the first expedition. During their arrogant conversation, the ship receives news of an attempted attack.\n\tAn underground organization controlled by an indigenous Venusian, Svan, overhears the ship's delegation's conversation about their contemptuous attitude towards the natives. Svan is determined not to let the Earth colonizers leave Venus and destroy the ship before its departure. The council informs the Venusians that only they had the right to decide the course of action. The underground organization agrees that if the Earth ship returned, it would mean disaster for Venus. Therefore, it should not return. Svan plans to sneak aboard at night and attach the Atomit magnetic time bomb to the ship. However, the commander faces the problem of betrayal, indecision, and cowardice among his renegade team. Svan suggests that the operation draws lots to decide who will be honored to perform the most critical part of the plan - the attachment of the bomb. He draws a small cross on one of the random papers in the bowl for the draw. After distributing the pieces of paper, Svan realizes that none of the team members agrees to reveal the brave one, fulfilling his duty to the people of Venus. The current political situation scares the six conspirators to attempt their expedition. After a fight with the guard, Svan and his team successfully make their way to the ship, but a second bomb turns out to be in Svan's possession and put into the car of his subordinates. Not only does Svan plan to explode the colonizers' ship, but also to take out revenge on his crew. As soon as he thinks of killing two birds with one stone: the Earth colonizers and five traitors, one of the team members Ingra, kisses Svan before going on board and wishes him good luck. Svan is thrown into a shudder, realizing that he is making a fatal mistake. As a result of his confusion, both bombs explode: in his pocket and the car of his accomplices. \nDying on the table of an Earth surgeon on the ship he was trying to destroy, Svan overhears a conversation between the Watch assistant Lowry and the doctor. While examining his clothes, he finds a piece of paper with two marked crosses as a symbol that Svan framed himself because of his fiery and distrustful temper."
              }
            ]
          },
          {
            "question_text": "Who is Ingra? What happens to her throughout the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "112",
                "uid": "57f8b65bd11d491dbf6c73685c2779d6",
                "response_text": "Ingra is one of the members in the room where Svan plans his revolt against the Earthman. She initially objects to Svan’s plan, a plan to destroy the Earthman ship with an atomite bomb, but when she sees other people agree with Svan, who is the leader of the revolting group, she takes back her objection. She hands the bowl to Svan, letting him put six slips inside to determine their futures, which is that one of them will put the bomb on the ship. She is also the first one to pick a slip. \n\nWhen the conspirators conduct their plans, she is the one who drives the car. She listens to Svan whenever he orders her to do something, and she kisses him when they separate to conduct different missions. After leaving Svan alone, she drives the car in the opposite direction to Svan, trying to cause a commotion. However, the Earthman guards are searching for them due to the discovery of the left rifle from the murdered Venusian, the native guard Svan killed. With no weapons to fight against the guards, Ingra drives the car back to pick up Svan, wanting to flee with him, but dies in the explosion of the vehicle.\n"
              },
              {
                "worker_id": "111",
                "uid": "06c25c80707044b3852749e8ad4ada4f",
                "response_text": "Ingra is one of the venusian natives that decides to bomb the human ship. At the beginning, she was apprehensive of the plan, but after they spy on the ship and hear what they are saying about them, she and the team decide to go through with the plan. After choosing that Svan would go onto the ship, they leave in a car towards the ship. Before separating from Svan, she decides to kiss him. This made Svan doubt his plan of killing her and the team, but he decides to go through with it. Ingra was supposed to drop the car in a lake, but she decides to go back for Svan after they were noticed by the guards. When she goes to pick up Svan, the bomb in the car goes off and they all die. "
              },
              {
                "worker_id": "113",
                "uid": "a03db93d0a2546a9a773f625aadf7cb8",
                "response_text": "Ingra is one of the members of the underground group curated by the Council. They plan on planting a bomb in the Earth-ship and killing the delegation. She initially hesitates, hoping that the colonists might be friendly, but eventually agrees with the plan. She is driving the car. They get stopped by the State Guard, who says that there is no access to the ship because of some danger. Svan tries to talk to him but soon kills the Venusian in front of the car. When he finally gets out of the car with the bomb, leaving the other one in the seat's compartment, Ingra kisses him and wishes him luck. Shortly after they drive off, the guards start chasing the car. Ingra manages to get away and drive back to Svan, screaming that they all must flee. Svan runs from Ingra, telling her to go away. Seconds later, the car with her and four other members explodes, and they die. "
              },
              {
                "worker_id": "110",
                "uid": "bf27bc895713472bb5f13a662fb64b0c",
                "response_text": "The girl Ingra is one of the members of Svan's underground team, participating in the mission of destroying the Earth ship for the benefit of the Venusians. Being one of the natives whose ancestors came to Venus generations ago, she sympathizes with Svan’s ideas of freedom. However, Ingra is disturbed by Svan’s escalated self-confidence. During the operation, she performs as the car driver. Before Svan is sent to his immediate death, Ingra sends him a good luck kiss, which puzzles Svan at the most inconvenient moment. Due to Ingra’s bold act, Svan is perplexed and acts in nonconformity with his plan. Svan, confident in the betrayal of his subordinates, leaves them to certain death by planting a bomb in the car. However, if not for Ingra’s kiss, he would never have guessed about the miscommunication and the mistake he made on his own."
              }
            ]
          },
          {
            "question_text": "Who is Lowry? What happens to him throughout the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "112",
                "uid": "57f8b65bd11d491dbf6c73685c2779d6",
                "response_text": "Lowry is the Officer of the Deck on the Earthman ship. He has a conversation with the Executive Officer on the main lock, which is eavesdropped on by Svan, the leader of a revolting group. Lowry believes that the Venusians are trustworthy since they are humans with different appearances. Still, he also believes that there may be some fights between Earthmen and Venusians when Earthmen land more colonists on Venus.\n\nWhen Svan, the leader of a rebellious group, and his members drive the car coming towards the ship to plant the bomb, Lowry sees the car light. He is talking to the Executive Officer by then about this secret group called the Council against the Earthman colonies. Even though the Executive Officer highly doubts the loyalty of the Venusians, Lowry still believes that Venusians can be trusted.\n\nAfter Svan is blown away by the explosion of the car, Lowry and a surgeon come to inspect his body. They find the pieces of the bomb. They also find a piece of paper with both sides marked with a cross in his hand. Lowery is confused about the paper's purpose, but he is sure that Svan intended to explode the Earthman ship.\n"
              },
              {
                "worker_id": "111",
                "uid": "06c25c80707044b3852749e8ad4ada4f",
                "response_text": "Lowry is the Officer of the Deck in the ship that has arrived on Venus in order to create relations with the natives and prepare for the arrival of more humans from earth. Lowry believes that the natives are friendly and that there is no need to be worried about them. He then is told that the natives are spying on him and the ship, which makes him rethink the ways of the natives, and that maybe they aren’t as friendly as they seem. "
              },
              {
                "worker_id": "113",
                "uid": "a03db93d0a2546a9a773f625aadf7cb8",
                "response_text": "Lowry is the Officer of the Deck. At the beginning, he talks to the Executive Officer and tries to convince him that the natives are friendly. Lowry also mentions that they are afraid of a possible wave of immigration from Earth which can disrupt their life processes or significantly worsen their quality of life, as some underground group says. He admits that this outcome is possible but gets interrupted by a signal stating that a spy ray is focused on the ship’s main lock - someone heard their conversation. Lowry alerts the delegations and the guards. Later, he sees some lights in the darkness but quickly forgets them. He tells the Exec about the secret group called the Council that must be behind the spy rays. After the car with Ingra and four other members of the Council’s group die in an explosion and Svan is taken in, Lowry confiscates a bomb from him. He breaks the inner wire connection, determines the bomb type, and realizes that it was supposed to detonate on their way back. He stands near the surgeon and Svan, shocked. The surgeon assures him that it was a very positive outcome for them and shows him a slip with a cross marked on both sides, which he finds confusing. "
              },
              {
                "worker_id": "110",
                "uid": "bf27bc895713472bb5f13a662fb64b0c",
                "response_text": "The Officer of the Deck Lowry is the right-hand man of The Executive Officer on the Earth spacecraft that arrived to colonize Venus. He keeps records of the delegation, cargo, ship staff, and their most valuable target - the natives from Venus, Venusians. Lowry obeys all the orders of his commander but is skeptical of The Exec’s point of view about the Venusians. The Executive articulates with intensity that Venusians are less of people than humans due to their transformation following Venus climate over the past generations. He believes that the natives have lost their right to being considered equal to humans after their ancestors’ acclimatization to their new planet. Lowry emphasizes that the natives are not so naive, having a potential fear of colonizers from Earth. Immediately after his remark, an alarm lights up on the ship that the Earthlings are under the scope of a spy ray, proving Lowry’s point about the natives’ naivete. At the end of the story, Lowry bears the burden of shame that all the efforts of the natives are in vain, considering Svan's half-dead body. However, the surgeon assures him that it is better to witness someone else’s death than their own. "
              }
            ]
          },
          {
            "question_text": "What is the setting of the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "112",
                "uid": "57f8b65bd11d491dbf6c73685c2779d6",
                "response_text": "The story happens on Venus. Venus is a habitable planet with a thick layer of clouds. There are two species on Venus, one is Venusians, who are the descendants of the first generation Earthmen coming to Venus, and the other is Earthmen, who come later as a delegation to collaborate with Venusians for the future colonies. \n\nThe story happens in the background of the disharmony between Earthmen and part of the Venusians. There is a secret Venusian group called the Council, where the members fear that the future Earthmen colonies will harm them and deprive them of their living spaces. Therefore, to not let the Earthmen ship bring back the news of the habitability of Venus, the Council orders Svan as a leader to conduct some rebellious plan, which starts the story.\n"
              },
              {
                "worker_id": "111",
                "uid": "06c25c80707044b3852749e8ad4ada4f",
                "response_text": "The story is located on the planet venus.The planet has been colonized by a group of humans that have settled and adapted to the environment of the planet. The planet seems to be very arid, and is covered by a mist that makes it very hard to see. The planet also has a swamp, which is where the natives were supposed to drop their car after dropping off Svan. The planet doesn’t have a moon, which allows for perfect darkness for the natives to attack the ship. \n"
              },
              {
                "worker_id": "113",
                "uid": "a03db93d0a2546a9a773f625aadf7cb8",
                "response_text": "The story is set in the future. All characters are on Venus, where a delegation from Earth recently landed. At the beginning, two officers talk in the ship’s lock. The Exec claims that the Venusians - the descendants of the first expedition that came here approximately a century ago - are not particularly friendly or fully human. Lowry - the Officer of the Deck - explains that many of them are scared of what immigrants from Earth can do with them, admitting that a negative outcome is possible. His speech is interrupted by a voice that tells them a spy ray is focused on the main lock. They are being listened to by six members of an underground group called the Council, who decide to plant a bomb in the ship to kill the delegation on its way back. They drive along the main street of the native town and eventually get stopped by a State Guard. Svan kills him, and they continue driving. At the same time, the two officers are at the bow of the ship, discussing the situation. Soon, when Ingra and the others drive off and then quickly come back for Svan, the car explodes. Its five passengers die, and Svan loses consciousness. The story ends with the surgeon examining Svan’s wounds that turn out to be lethal. He also shows Lowry, who just deactivated the second bomb he had taken from Svan, a slip with two crosses, which he finds puzzling.  "
              },
              {
                "worker_id": "110",
                "uid": "bf27bc895713472bb5f13a662fb64b0c",
                "response_text": "The story unfolds on Venus after humans settled on the planet many generations ago. As a result, these humans have transformed to fit Venus' volatile climate, changing their appearance. The setting opens on the Earthling colonizer spaceship. One may recognize the wooden shacks on the town's outskirts visible from the deck. While dusk was gathering and the underground organization was preparing for an attack, fog covered the swampy area of Venus. Rows of guards lined up around the Earth ship. They were keeping the machine safe from a hundred-yard distance away from it, scaring local onlookers with old-fashioned rifles, who came to be surprised by the ship. As soon as dusk deepened and a misty haze fell on the planet, six oppositionists moved towards the anticipated battle. They were illuminating the narrow and pale road with the yellowish headlights of the trailer. They noticed the twisted vegetation of the surrounding jungle. As they moved, the rain intensified, but the downpour was supposed to subside before midnight. The rain was still drizzling over the marshy area, but this did not prevent Svan from putting his plan into action despite Ingra's persuasions to drown the car in the swamp and create a commotion. As Svan headed toward the midnight road, the ground rose, and the jungle thinned. Looking into the distance, the bright lights of an Earth ship flickered in the rainclouds, landing in the center of a clearing created by its ferocious rockets. Seeing the whirling figures of the sentries, Svan realized they were the ship's guards. Despite their thin-shaft blasters, they wouldn't be as easy to defeat as the natives. He could only board by deception."
              }
            ]
          },
          {
            "question_text": "What is the importance of the slip with a cross?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "112",
                "uid": "57f8b65bd11d491dbf6c73685c2779d6",
                "response_text": "The slip with a cross is used to determine who will be the one to plant the bomb on the ship when Svan, the leader of a rebellious group, assign tasks to each person. However, during the process of drawing lots, when the person who gets the slip with a cross on it should reveal oneself to accept the task, no one admits because Svan, who receives the slip, didn’t see the cross on the other side of the paper. As a result, he mistakenly thinks that the person who received the slip is a coward that does not want to do the task, so he secretly marks another cross on his paper and accepts the mission.\n\nThis misunderstanding of no one accepting the task drives Svan to suspect all the other members as disloyal and cowardly, leading him to decide to put one bomb on the car. He is so furious that he wants them to die for their disloyalty and cowardice while serving as an attraction to the guards. However, when the plan does not go well, and the members come back to seek him, he unavoidably suffers from his deed. The paper is later found to have a cross on both sides, which forms an irony of Svan's behaviors. Ironically, Svan’s suspicion of other people causes their death when he is the real traitor."
              },
              {
                "worker_id": "111",
                "uid": "06c25c80707044b3852749e8ad4ada4f",
                "response_text": "The slip with the cross is very important for the development of the story. When the natives decide to attack the ship, they need one person to get inside and plant the bomb. To choose, they write an X on one of the slips and take turns choosing slips, and the person with the X slip would go. When no one goes forward, Svan volunteers by writing an X on his blank paper, but realizes that there is a coward in the team. This leads to Svan plotting to doublecross his team, and when his plan backfires they all end up dying. When the humans discover the bodies, it is revealed that Svan had a paper with an X on both sides, showing that he was in fact double crossing his team for no reason. "
              },
              {
                "worker_id": "113",
                "uid": "a03db93d0a2546a9a773f625aadf7cb8",
                "response_text": "Svan decides to choose who will plant a bomb in the Earth-ship by taking out paper slips, one of them marked with a cross. When no one admits that their slip is not blank and Svan doesn’t see a cross on his piece of paper, he becomes angry. He thinks that there might be a coward on the team, and eventually, he decides that everyone on the team is fearful and useless. He decides to kill them and later leaves another bomb in a seat compartment of the car when they drive off. When he waits for the car to explode and distract the ship’s guards, he tries to understand who could lie about the slip. When Ingra and others drive back to get Svan and flee, the car explodes, killing the passengers and wounding him. He wakes up near one of the ship’s officers - Lowry - who just deactivated the second bomb and a surgeon who wonders why Svan would be holding a slip with a cross on both sides. Nobody from the team lied to him, and his suspicion ruined the operation. "
              },
              {
                "worker_id": "110",
                "uid": "bf27bc895713472bb5f13a662fb64b0c",
                "response_text": "he slip with the cross represents Svan's anticipation and feelings about his team and the cause they are fighting for together. His trust and strength stem from teamwork. Developing a plan, he hopes for cooperation and courage from each participant. Being the leader, he allows fate to make a choice rather than himself. He puts himself on the same level as his teammates, thus not shifting the responsibility and burden onto someone specific. Not finding a small cross, he is convinced of the idea of being surrounded by traitors and cowards who cannot complete his cunning operation. Enraged, he sees no better solution than revenge. He feels resentment and betrayal, yet his feelings are crossed out with a kiss for good luck from Ingra. After discovering the lost cross, he tries to correct his quick judgment, but it turns out that it's too late. The lost slip symbolizes all the wrong acts of misjudgments in human nature that lead to an insolvable disaster. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 3453,
        "document_length_chars": 19720
      }
    }
  ]
}