{
  "item_metadata": {
    "item_id": "63392",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63392",
      "content": "\n\n\n\nProduced by Greg Weeks, Mary Meehan and the Online\nDistributed Proofreading Team at http://www.pgdp.net\nDoorway to Kal-Jmar\nBy Stuart Fleming\nTwo men had died before Syme Rector's guns\n   \n  to give him the key to the ancient city of\n   \n  Kal-Jmar—a city of untold wealth, and of\n   \n  robots that made desires instant commands.\n \n  [Transcriber's Note: This etext was produced from\n   \n  Planet Stories Winter 1944.\n   \n  Extensive research did not uncover any evidence that\n   \n  the U.S. copyright on this publication was renewed.]\nThe tall man loitered a moment before a garish window display, his eyes\nimpassive in his space-burned face, as the Lillis patrolman passed.\nThen he turned, burying his long chin in the folds of his sand cape,\nand took up the pursuit of the dark figure ahead once more.\n \n  Above, the city's multicolored lights were reflected from the\ntranslucent Dome—a distant, subtly distorted Lillis, through which the\nstars shone dimly.\n \n  Getting through that dome had been his first urgent problem, but now he\nhad another, and a more pressing one. It had been simple enough to pass\nhimself off as an itinerant prospector and gain entrance to the city,\nafter his ship had crashed in the Mare Cimmerium. But the rest would\nnot be so simple. He had to acquire a spaceman's identity card, and he\nhad to do it fast. It was only a matter of time until the Triplanet\nPatrol gave up the misleading trail he had made into the hill country,\nand concluded that he must have reached Lillis. After that, his only\nsafety lay in shipping out on a freighter as soon as possible. He had\nto get off Mars, because his trail was warm, and the Patrol thorough.\n \n  They knew, of course, that he was an outlaw—the very fact of the\ncrashed, illegally-armed ship would have told them that. But they\ndidn't know that he was Syme Rector, the most-wanted and most-feared\nraider in the System. In that was his only advantage.\n \n  He walked a little faster, as his quarry turned up a side street and\nthen boarded a moving ramp to an upper level. He watched until the\nshort, wide-shouldered figure in spaceman's harness disappeared over\nthe top of the ramp, and then followed.\n \n  The man was waiting for him at the mouth of the ascending tunnel.\n \n  Syme looked at him casually, without a flicker of expression, and\nstarted to walk on, but the other stepped into his path. He was quite\nyoung, Syme saw, with a fighter's shoulders under the white leather,\nand a hard, determined thrust to his firm jaw.\n \n  \"All right,\" the boy said quietly. \"What is it?\"\n \n  \"I don't understand,\" Syme said.\n \n  \"The game, the angle. You've been following me. Do you want trouble?\"\n \n  \"Why, no,\" Syme told him bewilderedly. \"I haven't been following you.\nI—\"\n \n  The boy knuckled his chin reflectively. \"You could be lying,\" he said\nfinally. \"But maybe I've made a mistake.\" Then—\"Okay, citizen, you can\nclear—but don't let me catch you on my tail again.\"\n \n  Syme murmured something and turned away, feeling the spaceman's eyes\non the small of his back until he turned the corner. At the next\nstreet he took a ramp up, crossed over and came down on the other side\na block away. He waited until he saw the boy's broad figure pass the\nintersection, and then followed again more cautiously.\n \n  It was risky, but there was no other way. The signatures, the data,\neven the photograph on the card could be forged once Syme got his hands\non it, but the identity card itself—that oblong of dark diamondite,\nglowing with the tiny fires of radioactivity—that could not be\nimitated, and the only way to get it was to kill.\n \n  Up ahead was the Founders' Tower, the tallest building in Lillis. The\nboy strode into the entrance lobby, bought a ticket for the observation\nplatform, and took the elevator. As soon as his car was out of sight in\nthe transparent tube, Syme followed. He put a half-credit slug into the\nmachine, took the punctured slip of plastic that came out. The ticket\nwent into a scanning slot in the wall of the car, and the elevator\nwhisked him up.\nThe tower was high, more than a hundred meters above the highest level\nof the city, and the curved dome that kept air in Lillis was close\noverhead. Syme looked up, after his first appraising glance about the\nplatform, and saw the bright-blue pinpoint of Earth. The sight stirred\na touch of nostalgia in him, as it always did, but he put it aside.\n \n  The boy was hunched over the circular balustrade a little distance\naway. Except for him, the platform was empty. Syme loosened his slim,\ndeadly energy pistol in its holster and padded catlike toward the\nsilent figure.\n \n  It was over in a minute. The boy whirled as he came up, warned by\nsome slight sound, or by the breath of Syme's passage in the still\nair. He opened his mouth to shout, and brought up his arm in a swift,\ninstinctive gesture. But the blow never landed. Syme's pistol spat its\nsilent white pencil of flame, and the boy crumpled to the floor with a\nminute, charred hole in the white leather over his chest.\nSyme stooped over him swiftly, found a thick wallet and thrust it into\nhis pocket without a second glance. Then he raised the body in his arms\nand thrust it over the parapet.\n \n  It fell, and in the same instant Syme felt a violent tug at his wrist.\nBefore he could move to stop himself, he was over the edge. Too late,\nhe realized what had happened—one of the hooks on the dead spaceman's\nharness had caught the heavy wristband of his chronometer. He was\nfalling, linked to the body of his victim!\n \n  Hardly knowing what he did, he lashed out wildly with his other arm,\nfelt his fingertips catch and bite into the edge of the balustrade. His\nbody hit the wall of the tower with a thump, and, a second later, the\ncorpse below him hit the wall. Then they both hung there, swaying a\nlittle and Syme's fingers slipped a little with each motion.\n \n  Gritting his teeth, he brought the magnificent muscles of his arm into\nplay, raising the forearm against the dead weight of the dangling body.\nFraction by slow fraction of an inch, it came up. Syme could feel the\nsweat pouring from his brow, running saltily into his eyes. His arms\nfelt as if they were being torn from their sockets. Then the hook\nslipped free, and the tearing, unbearable weight vanished.\n \n  The reaction swung Syme against the building again, and he almost\nlost his slippery hold on the balustrade. After a moment he heard the\nspaceman's body strike with a squashy thud, somewhere below.\n \n  He swung up his other arm, got a better grip on the balustrade. He\ntried cautiously to get a leg up, but the motion loosened his hold on\nthe smooth surface again. He relaxed, thinking furiously. He could hold\non for another minute at most; then it was the final blast-off.\n \n  He heard running footsteps, and then a pale face peered over the ledge\nat him. He realized suddenly that the whole incident could have taken\nonly a few seconds. He croaked, \"Get me up.\"\n \n  Wordlessly, the man clasped thin fingers around his wrist. The other\npulled, with much puffing and panting, and with his help Syme managed\nto get a leg over the edge and hoist his trembling body to safety.\n \n  \"Are you all right?\"\nSyme looked at the man, nursing the tortured muscles of his arms. His\nrescuer was tall and thin, of indeterminate age. He had light, sandy\nhair, a sharp nose, and—oddly conflicting—pale, serious eyes and a\nhumorous wide mouth. He was still panting.\n \n  \"I'm not hurt,\" Syme said. He grinned, his white teeth flashing in his\ndark, lean face. \"Thanks for giving me a hand.\"\n \n  \"You scared hell out of me,\" said the man. \"I heard a thud. I\nthought—you'd gone over.\" He looked at Syme questioningly.\n \n  \"That was my bag,\" the outlaw said quickly. \"It slipped out of my hand,\nand I overbalanced myself when I grabbed for it.\"\n \n  The man sighed. \"I need a drink.\nYou\nneed a drink. Come on.\" He\npicked up a small black suitcase from the floor and started for the\nelevator, then stopped. \"Oh—your bag. Shouldn't we do something about\nthat?\"\n \n  \"Never mind,\" said Syme, taking his arm. \"The shock must have busted it\nwide open. My laundry is probably all over Lillis by now.\"\n \n  They got off at the amusement level, three tiers down, and found a\ncafe around the corner. Syme wasn't worried about the man he had just\nkilled. He had heard no second thud, so the body must have stayed on\nthe first outcropping of the tower it struck. It probably wouldn't be\nfound until morning.\n \n  And he had the wallet. When he paid for the first round of\nculcha\n, he\ntook it out and stole a glance at the identification card inside. There\nit was—his ticket to freedom. He began feeling expansive, and even\nfriendly toward the slender, mouse-like man across the table. It was\nthe\nculcha\n, of course. He knew it, and didn't care. In the morning\nhe'd find a freighter berth—in as big a spaceport as Lillis, there\nwere always jobs open. Meanwhile, he might as well enjoy himself, and\nit was safer to be seen with a companion than to be alone.\n \n  He listened lazily to what the other was saying, leaning his tall,\ngraceful body back into the softly-cushioned seat.\n \n  \"Lissen,\" said Harold Tate. He leaned forward on one elbow, slipped,\ncaught himself, and looked at the elbow reproachfully. \"Lissen,\" he\nsaid again, \"I trust you, Jones. You're obvi-obviously an adventurer,\nbut you have an honest face. I can't see it very well at the moment,\nbut I hic!—pardon—seem to recall it as an honest face. I'm going to\ntell you something, because I need your help!—help.\" He paused. \"I\nneed a guide. D'you know this part of Mars well?\"\n \n  \"Sure,\" said Syme absently. Out in the center of the floor, an AG\nplate had been turned on. Five Venusian girls were diving and twisting\nin its influence, propelling themselves by the motion of their\ndelicately-webbed feet and trailing long gauzy streamers of synthesilk\nafter them. Syme watched them through narrowed lids, feeling the glow\nof\nculcha\ninside him.\n \n  \"I wanta go to Kal-Jmar,\" said Tate.\n \n  Syme snapped to attention, every nerve tingling. An indefinable sense,\na hunch that had served him well before, told him that something big\nwas coming—something that promised adventure and loot for Syme Rector.\n\"Why?\" he asked softly. \"Why to Kal-Jmar?\"\n \n  Harold Tate told him, and later, when Syme had taken him to his rooms,\nhe showed him what was in his little black suitcase. Syme had been\nright; it was big.\nKal-Jmar was the riddle of the Solar System. It was the only remaining\ncity of the ancient Martian race—the race that, legends said, had\nrisen to greater heights than any other Solar culture. The machines,\nthe artifacts, the records of the Martians were all there, perfectly\npreserved inside the city's bubble-like dome, after God knew how many\nthousands of years. But they couldn't be reached.\n \n  For Kal-Jmar's dome was not the thing of steelite that protected\nLillis: it was a tenuous, globular field of force that defied analysis\nas it defied explosives and diamond drills. The field extended both\nabove and below the ground, and tunneling was of no avail. No one knew\nwhat had happened to the Martians, whether they were the ancestors of\nthe present decadent Martian race, or a different species. No one knew\nanything about them or about Kal-Jmar.\n \n  In the early days, when the conquest of Mars was just beginning, Earth\nscientists had been wild to get into the city. They had observed it\nfrom every angle, taken photographs of its architecture and the robots\nthat still patrolled its fantastically winding streets, and then they\nhad tried everything they knew to pierce the wall.\n \n  Later, however, when every unsuccessful attempt had precipitated a\nbloody uprising of the present-day Martians—resulting in a rapid\ndwindling of the number of Martians—the Mars Protectorate had stepped\nin and forbidden any further experiments; forbidden, in fact, any\nEarthman to go near the place.\n \n  Thus matter had stood for over a hundred years, until Harold Tate.\nTate, a physicist, had stumbled on a field that seemed to be identical\nin properties to the Kal-Jmar dome; and what is more, he had found a\nforce that would break it down.\n \n  And so he had made his first trip to Mars, and within twenty-four\nhours, by the blindest of chances, blurted out his secret to Syme\nRector, the scourge of the spaceways, the man with a thousand credits\non his sleek, tigerish head.\n \n  Syme's smile was not tigerish now; it was carefully, studiedly mild.\nFor Tate was no longer drunk, and it was important that it should not\noccur to him that he had been indiscreet.\n \n  \"This is native territory we're coming to, Harold,\" he said. \"Better\nstrap on your gun.\"\n \n  \"Why. Are they really dangerous?\"\n \n  \"They're unpredictable,\" Syme told him. \"They're built differently, and\nthey think differently. They breathe like us, down in their caverns\nwhere there's air, but they also eat sand, and get their oxygen that\nway.\"\n \n  \"Yes, I've heard about that,\" Tate said. \"Iron oxide—very interesting\nmetabolism.\" He got his energy pistol out of the compartment and\nstrapped it on absently.\n \n  Syme turned the little sand car up a gentle rise towards the tortuous\nhill country in the distance. \"Not only that,\" he continued. \"They\neat the damndest stuff. Lichens and fungi and tumble-grass off the\ndeserts—all full of deadly poisons, from arsenic up the line to\nxopite. They seem intelligent enough—in their own way—but they never\ncome near our cities and they either can't or won't learn Terrestrial.\nWhen the first colonists came here, they had to learn\ntheir\ncrazy\nlanguage. Every word of it can mean any one of a dozen different\nthings, depending on the inflection you give it. I can speak it some,\nbut not much. Nobody can. We don't think the same.\"\n \n  \"So you think they might attack us?\" Tate asked again, nervously.\n \n  \"They\nmight\ndo anything,\" Syme said curtly. \"Don't worry about it.\"\n \n  The hills were much closer than they had seemed, because of Mars'\ndeceptively low horizon. In half an hour they were in the midst of a\nwilderness of fantastically eroded dunes and channels, laboring on\nsliding treads up the sides of steep hills only to slither down again\non the other side.\nSyme stopped the car abruptly as a deep, winding channel appeared\nacross their path. \"Gully,\" he announced. \"Shall we cross it, or follow\nit?\"\n \n  Tate peered through the steelite nose of the car. \"Follow, I guess,\"\nhe offered. \"It seems to go more or less where we're going, and if we\ncross it we'll only come to a couple dozen more.\"\n \n  Syme nodded and moved the sand car up to the edge of the gully. Then he\npressed a stud on the control board; a metal arm extruded from the tail\nof the car and a heavy spike slowly unscrewed from it, driving deep\ninto the sand. A light on the board flashed, indicating that the spike\nwas in and would bear the car's weight, and Syme started the car over\nthe edge.\n \n  As the little car nosed down into the gully, the metal arm left behind\nrevealed itself to be attached to a length of thick, very strong wire\ncable, with a control cord inside. They inched down the almost vertical\nincline, unreeling the cable behind them, and starting minor landslides\nas they descended.\n \n  Finally they touched bottom. Syme pressed another stud, and above, the\nmetal spike that had supported them screwed itself out of the ground\nagain and the cable reeled in.\n \n  Tate had been watching with interest. \"Very ingenious,\" he said. \"But\nhow do we get up again?\"\n \n  \"Most of these gullies peter out gradually,\" said Syme, \"but if we want\nor have to climb out where it's deep, we have a little harpoon gun that\nshoots the anchor up on top.\"\n \n  \"Good. I shouldn't like to stay down here for the rest of my\nnatural life. Depressing view.\" He looked up at the narrow strip of\nalmost-black sky visible from the floor of the gully, and shook his\nhead.\n \n  Neither Syme nor Tate ever had a chance to test the efficiency of their\nharpoon gun. They had traveled no more than five hundred meters, and\nthe gully was as deep as ever, when Tate, looking up, saw a deeper\nblackness blot out part of the black sky directly overhead. He shouted,\n\"Look out!\" and grabbed for the nearest steering lever.\n \n  The car wheeled around in a half circle and ran into the wall of the\ngully. Syme was saying, \"What—?\" when there was a thunderous crash\nthat shook the sturdy walls of the car, as a huge boulder smashed into\nthe ground immediately to their left.\n \n  When the smoky red dust had cleared away, they saw that the left tread\nof the sand car was crushed beyond all recognition.\n \n  Syme was cursing slowly and steadily with a deep, seething anger. Tate\nsaid, \"I guess we walk from here on.\" Then he looked up again and\ncaught a glimpse of the horde of beasts that were rushing up the gully\ntoward them.\n \n  \"My God!\" he said. \"What are those?\"\n \n  Syme looked. \"Those,\" he said bitterly, \"are Martians.\"\n \n  The natives, like all Martian fauna, were multi-legged. Also like all\nMartian fauna, they moved so fast that you couldn't see how many legs\nthey did have. Actually, however, the natives had six legs apiece—or,\nmore properly, four legs and two arms. Their lungs were not as large\nas they appeared, being collapsed at the moment. What caused the bulge\nthat made their torsos look like sausages was a huge air bladder, with\na valve arrangement from the stomach and feeding directly into the\nbloodstream.\n \n  Their faces were vaguely canine, but the foreheads were high, and the\nlips were not split. They did resemble dogs, in that their thick black\nfur was splotched with irregulate patches of white. These patches of\nwhite were subject to muscular control and could be spread out fanwise;\nor, conversely, the black could be expanded to cover the white, which\nhelped to take care of the extremes of Martian temperature. Right now\nthey were mostly black.\n \n  The natives slowed down and spread out to surround the wrecked sand\ncar, and it could be seen that most of them were armed with spears,\nalthough some had the slim Benson energy guns—strictly forbidden to\nMartians.\n \n  Syme stopped cursing and watched tensely. Tate said nothing, but he\nswallowed audibly.\n \n  One Martian, who looked exactly like all the rest, stepped forward and\nmotioned unmistakably for the two to come out. He waited a moment and\nthen gestured with his energy gun. That gun, Syme knew from experience,\ncould burn through a small thickness of steelite if held on the same\nspot long enough.\n\"Come on,\" Syme said grimly. He rose and reached for a pressure suit,\nand Tate followed him.\n \n  \"What do you think they'll—\" he began, and then stopped himself. \"I\nknow. They're unpredictable.\"\n \n  \"Yeah,\" said Syme, and opened the door. The air in the car\nwhooshed\ninto the near-vacuum outside, and he and Tate stepped out.\n \n  The Martian leader looked at them enigmatically, then turned and\nstarted off. The other natives closed in on them, and they all bounded\nalong under the weak gravity.\n \n  They bounded along for what Syme figured as a good kilometer and a\nhalf, and they then reached a branch in the gully and turned down\nit, going lower all the time. Under the light of their helmet lamps,\nthey could see the walls of the gully—a tunnel, now—getting darker\nand more solid. Finally, when Syme estimated they were about nine\nkilometers down, there was even a suggestion of moisture.\n \n  The tunnel debouched at last into a large cavern. There was a\nphosphorescent gleam from fungus along the walls, but Syme couldn't\ndecide how far away the far wall was. He noticed something else, though.\n \n  \"There's air here,\" he said to Tate. \"I can see dust motes in it.\" He\nswitched his helmet microphone from radio over to the audio membrane\non the outside of the helmet. \"\nKalis methra\n,\" he began haltingly,\n\"\nseltin guna getal.\n\"\n \n  \"Yes, there is air here,\" said the Martian leader, startlingly. \"Not\nenough for your use, however, so do not open your helmets.\"\n \n  Syme swore amazedly.\n \n  \"I thought you said they didn't speak Terrestrial,\" Tate said. Syme\nignored him.\n \n  \"We had our reasons for not doing so,\" the Martian said.\n \n  \"But how—?\"\n \n  \"We are telepaths, of course. On a planet which is nearly airless on\nits surface, we have to be. A tendency of the Terrestrial mind is to\nignore the obvious. We have not had a spoken language of our own for\nseveral thousand years.\"\n \n  He darted a glance at Syme's darkly scowling face. His own hairy face\nwas expressionless, but Syme sensed that he was amused. \"Yes, you're\nright,\" he said. \"The language you and your fellows struggled to learn\nis a fraud, a hodge-podge concocted to deceive you.\"\n \n  Tate looked interested. \"But why this—this gigantic masquerade?\"\n \n  \"You had nothing to give us,\" the Martian said simply.\n \n  Tate frowned, then flushed. \"You mean you avoided revealing yourselves\nbecause you—had nothing to gain from mental intercourse with us?\"\n \n  \"Yes.\"\n \n  Tate thought again. \"But—\"\n \n  \"No,\" the Martian interrupted him, \"revealing the extent of our\ncivilization would have spared us nothing at your people's hands. Yours\nis an imperialist culture, and you would have had Mars, whether you\nthought you were taking it from equals or not.\"\n \n  \"Never mind that,\" Syme broke in impatiently. \"What do you want with\nus?\"\n \n  The Martian looked at him appraisingly. \"You already suspect.\nUnfortunately, you must die.\"\nIt was a weird situation, Syme thought. His mind was racing, but as yet\nhe could see no way out. He began to wonder, if he did, could he keep\nthe Martians from knowing about it? Then he realized that the Martian\nmust have received that thought, too, and he was enraged. He stood,\nholding himself in check with an effort.\n \n  \"Will you tell us why?\" Tate asked.\n \n  \"You were brought here for that purpose. It is part of our conception\nof justice. I will tell you and your—friend—anything you wish to\nknow.\"\n \n  Syme noticed that the other Martians had retired to the farther side of\nthe cavern. Some were munching the glowing fungus. That left only the\nleader, who was standing alertly on all fours a short distance away\nfrom them, holding the Benson gun trained on them. Syme tried not to\nthink about the gun, especially about making a grab for it. It was like\ntrying not to think of the word \"hippopotamus.\"\n \n  Tate squatted down comfortably on the floor of the cavern, apparently\nunconcerned, but his hands were trembling slightly. \"First why—\" he\nbegan.\n \n  \"There are many secrets in Kal-Jmar,\" the Martian said, \"among them a\nvery simple catalyzing agent which could within fifty years transform\nMars to a planet with Terrestrially-thick atmosphere.\"\n \n  \"I think I see,\" Tate said thoughtfully. \"That's been the ultimate aim\nall along, but so far the problem has us licked. If we solved it, then\nwe'd have all of Mars, not just the cities. Your people would die out.\nYou couldn't have that, of course.\"\n \n  He sighed deeply. He spread his gloved hands before him and looked\nat them with a queer intentness. \"Well—how about the Martians—the\nKal-Jmar Martians, I mean? I'd dearly love to know the answer to that\none.\"\n \n  \"Neither of the alternatives in your mind is correct. They were not a\nseparate species, although they were unlike us. But they were not our\nancestors, either. They were the contemporaries of our ancestors.\"\n \n  \"Several thousand years ago Mars' loss of atmosphere began to make\nitself felt. There were two ways out. Some chose to seal themselves\ninto cities like Kal-Jmar; our ancestors chose to adapt their bodies to\nthe new conditions. Thus the race split. Their answer to the problem\nwas an evasion; they remained static. Our answer was the true one, for\nwe progressed. We progressed beyond the need of science; they remained\nits slaves. They died of a plague—and other causes.\n \n  \"You see,\" he finished gently, \"our deception has caused a natural\nconfusion in your minds. They were the degenerates, not we.\"\n \n  \"And yet,\" Tate mused, \"you are being destroyed by contact with\nan—inferior—culture.\"\n \n  \"We hope to win yet,\" the Martian said.\n \n  Tate stood up, his face very white. \"Tell me one thing,\" he begged.\n\"Will our two races ever live together in amity?\"\n \n  The Martian lowered his head. \"That is for unborn generations.\" He\nlooked at Tate again and aimed the energy gun. \"You are a brave man,\"\nhe said. \"I am sorry.\"\n \n  Syme saw all his hopes of treasure and glory go glimmering down the\nsights of the Martian's Benson gun, and suddenly the pent-up rage in\nhim exploded. Too swiftly for his intention to be telegraphed, before\nhe knew himself what he meant to do, he hurled himself bodily into the\nMartian.\nIt was like tangling with a draft horse. The Martian was astonishingly\nstrong. Syme scrambled desperately for the gun, got it, but couldn't\ntear it out of the Martian's fingers. And all the time he could almost\nfeel the Martian's telepathic call for help surging out. He heard the\nswift pad of his followers coming across the cavern.\n \n  He put everything he had into one mighty, murderous effort. Every\nmuscle fiber in his superbly trained body crackled and surged with\npower. He roared his fury. And the gun twisted out of the Martian's\niron grip!\n \n  He clubbed the prostrate leader with it instantly, then reversed the\nweapon and snapped a shot at the nearest Martian. The creature dropped\nhis lance and fell without a sound.\n \n  The next instant a ray blinked at him, and he rolled out of the way\nbarely in time. The searing ray cut a swath over the leader's body and\nswerved to cut down on him. Still rolling, he fired at the holder of\nthe weapon. The gun dropped and winked out on the floor.\n \n  Syme jumped to his feet and faced his enemies, snarling like the\ntrapped tiger he was. Another ray slashed at him, and he bent lithely\nto let it whistle over his head. Another, lower this time. He flipped\nhis body into the air and landed upright, his gun still blazing. His\nright leg burned fiercely from a ray-graze, but he ignored it. And\nall the while he was mowing down the massed natives in great swaths,\nseeking out the ones armed with Bensons in swift, terrible slashes,\ndodging spears and other missiles in midair, and roaring at the top of\nhis powerful lungs.\n \n  At last there were none with guns left to oppose him. He scythed down\nthe rest in two terrible, lightning sweeps of his ray, then dropped\nthe weapon from blistered fingers.\n \n  He was gasping for breath, and realized that he was losing air from\nthe seared-open right leg of his suit. He reached for the emergency\nkit at his side, drawing in great, gasping breaths, and fumbled out\na tube of sealing liquid. He spread the stuff on liberally, smearing\nit impartially over flesh and fabric. It felt like liquid hell on the\nburned, bleeding leg, but he kept on until the quick-drying fluid\nformed an airtight patch.\n \n  Only then did he turn, to see Tate flattened against the wall behind\nhim, his hands empty at his sides. \"I'm sorry,\" Tate said miserably. \"I\ncould have grabbed a spear or something, but—I just couldn't, not even\nto save my own life. I—I halfway hoped they'd kill both of us.\"\n \n  Syme glared at him and spat, too enraged to think of diplomacy. He\nturned and strode out of the cavern, carrying his right leg stiffly,\nbut with his feral, tigerish head held high.\n \n  He led the way, wordlessly, back to the wrecked sand car. Tate followed\nhim with a hangdog, beaten air, as though he had just found something\nthat shattered all his previous concepts of the verities in life, and\ndidn't know what to do about it.\n \n  Still silently, Syme refilled his oxygen tank, watched Tate do the\nsame, and then picked up two spare tanks and the precious black\nsuitcase and handed one of the tanks to Tate. Then he stumped around\nto the back of the car and inspected the damage. The cable reel, which\nmight have drawn them out of the gully, was hopelessly smashed. That\nwas that.\nThey started off down the canyon, Syme urging the slighter man to\na fast clip, even though his leg was already stiffening. When they\nfinally reached a climbable spot, Syme was limping badly and Tate was\nobviously exhausted.\n \n  They clambered wearily out onto the level sands again just as the\nsmall, blazing sun was setting. \"Luck,\" grunted Syme. \"Our only chance\nof getting near the city is at night.\" He peered around, shading his\neyes from the sun's glare with a gauntleted hand. \"See that?\"\n \n  Following his pointing finger, Tate saw a faint, ephemeral arc showing\nabove a line of low hills in the distance. \"Kal-Jmar,\" said Syme.\n \n  Tate brightened a little. His body was too filled with fatigue for his\nmind to do any work on the problem that was baffling him, and so it\nreceded into the back of his mind.\n \n  \"Kal-Jmar,\" whispered Syme again.\n \n  There was no twilight. The sun dropped abruptly behind the low horizon,\nand darkness fell, sudden and absolute. Syme picked up the extra oxygen\ntank and the suitcase, checked his direction by a wrist compass, and\nstarted toward the hills. Tate rose wearily to his feet and followed\nagain.\n \n  Two hours later, Kal-Jmar stood before them. They had wormed their\nway past the sentry posts, doing most of the last two hundred meters\non all fours. With skill and luck, and with Syme's fierce, burning\ndetermination, they had managed to escape detection—and there they\nwere. Journey's end.\n \n  Tate stared up at the shining, starlight towers in speechless\nadmiration. If the people who had built this city had been decadent,\nstill their architecture was magnificent. The city was a rhapsody made\nsolid. There was a sense of decay about it, he thought, but it was the\ndecay of supreme beauty, caught at the very verge of dissolution and\npreserved for all eternity.\n \n  \"Well?\" demanded Syme.\n \n  Tate started, shaken out of his dream. He looked down at the black\nsuitcase, a little wonderingly, and then pulled it to him and opened it.\n \n  Inside, carefully wrapped in shock-absorbing tissue, was a fragile\ncontrivance of many tubes and wires, and a tiny parabolic mirror. It\nhad a brand new Elecorp 210 volt battery, and it needed every volt of\nthat tremendous power. Tate made the connections, his hands trembling\nslightly, and set it up on a telescoping tripod. Syme watched him\nclosely, his big body tensed with expectation.\n \n  The field was before them, shimmering faintly in the starlight. It\nlooked unsubstantial as the stuff of dreams, but both men knew that no\npower man possessed, unless it was the thing Tate held, could penetrate\nthat screen.\n \n  Tate set the mechanism up close to the field, aimed it very delicately,\nand closed a minute switch. After a long second, he opened it again.\n \n  Nothing happened.\n \n  The screen was still there, as unsubstantial and as solid as ever.\nThere was no change.\nTate looked worriedly at his wiring, a deep wrinkle appearing between\nhis pale, serious eyes. Syme stood stock-still but quivering with\nrepressed energy, scowling like a thundercloud.\n \n  \"It must be capable of working,\" Tate told himself querulously. \"The\nMartians knew—they wouldn't have tried to stop us if—Wait a minute.\"\nHe paced back and forth, biting his lip. Syme watched him with catlike\neyes, clenching and unclenching his great fists.\n \n  Tate paused. \"I think I have it,\" he said slowly. \"I haven't enough\npower to hetrodyne the whole screen, although that's theoretically\npossible. But there must be weaker portions of the field—doors—set\nto open on the impact of a beam like this one. But I've only got power\nenough for two more tries. Jones, where would you put an entrance, if\nyou'd built Kal-Jmar?\"\n \n  Syme's eyes widened, and he stared around slowly. \"A thousand years\nago?\" he muttered. \"Two thousand? These hills were raised in five\nhundred. We can't go by topography.\n \n  \"In front of one of the main arteries, then. But there are dozens, no\none larger than the other. Did they have dozens of doors?\"\n \n  \"Maybe,\" said Tate. He pointed to the right, where the fairy towers of\nKal-Jmar swept aside to leave a broad avenue. \"It's the nearest—as\ngood as any other.\"\n \n  They walked over to it in silence, and in silence Tate set up his\nequipment once more. He shifted it from side to side, squinting, until\nhe had it lined up exactly on the center of the avenue. Then he took a\nlong breath, and closed the switch again.\n \n  The switch came up. Syme stared with fierce eagerness, eyes ablaze. For\na moment there was nothing, and then—\n \n  Tate clutched the big man's arm. \"Look!\" he breathed.\n \n  Where the ray from Tate's machine had impinged, a faintly-glowing\nspot of violet radiance! As they watched it widened, dilating into a\nperfect circle of violet, enclosing nothingness. The door was opening.\n \n  \"It worked,\" Tate said softly. \"It worked!\"\n \n  Syme shook off his grip impatiently, put his hand to the gun in the\nholster of his suit. Tate was still watching, fascinated. \"Look,\" he\nsaid again. \"The color is changing slightly, falling down the spectrum.\nI think that's a warning signal. When it reaches red, the door will\nclose.\" He moved toward the widening door, like a sleepwalker.\n \n  \"Wait,\" Syme said hoarsely. \"You forgot the machine.\"\n \n  Tate turned, said, \"Oh yes,\" and walked back. Then he saw the gun in\nSyme's hand. His jaw dropped slightly, but he didn't say anything. He\njust stood there, looking dumbly from the gun to Syme's dark face.\n \n  Syme shot him carefully in the chest.\n \n  He dropped like a rag doll, but Syme's aim had been bad. He wasn't dead\nyet. He rolled his eyes up, like a child. His lips moved. In spite of\nhimself, Syme bent forward to listen.\n \n  \"\nYou'll be\n—\nsorry\n,\" Tate said, and died.\n \n  Air was sighing out through the widening hole in the screen. Syme\nstraightened and smiled tolerantly. For a moment, he had been\nunreasonably afraid of what Tate was about to say. Some detail he had\nforgotten, perhaps, something that would trap him now that Tate, the\nman who knew the answers, was dead. But—he'd be sorry!\n \n  For what? Another dead fool?\n \n  He gathered up the delicate mechanism in one arm, and, filling his deep\nlungs, stepped forward through the opening.\nThe towers of dead Kal-Jmar loomed over him in the dusk as he strode\nlike a conqueror down the long-deserted avenue. The city was full of\nthe whisperings of Kal-Jmar's ancient wraiths, but they touched only\na corner of his mind. He was filled to overflowing with the bright,\nglowing joy of conquest. The city was his!\n \n  His boots trod an avenue where no foot had fallen these untold eons,\nyet there was no dust. The city was bright and furbished waiting for\nhim. He was intoxicated.\nThe city was his!\nThere was a gentle ramp leading upward, and Syme followed it, breathing\nin the manufactured air of his pressure suit like wine. All around him,\nthe city blazed with treasures beyond price.\nIt was his!\nThe ramp led to a portal set in the side of a shining needle of a\nbuilding. Syme strode up to the threshold, and the door dilated for\nhim. He stepped inside; the door closed and a soft light glowed on.\n \n  There was air here: good, breathable air. A tiny zephyr of it was\nblowing from some hidden source against his body. Greatly daring, he\nunfastened the helmet of his suit and flung it back. He breathed in a\nlungful of it. God, but it was good after that canned stuff! It was a\nlittle heady; it made his head swim—but it was good air, excellent air!\n \n  He looked around him, measuring, assessing for the first time. This\nroom alone was worth a fortune. There was platinum; in ornaments, set\ninto the walls, in furniture. That would be enough to buy the little\nthings—a new ship, or perhaps even immunity back on Earth. But that\nwas as nothing to the rest of it, the things three worlds would clamor\nfor—the artifacts, the record books, the machines!\n \n  He strode about the room, building plan on grandiose plan. He could\ntake back only a little with him at first; but he could return again\nand again, with Tate's mechanism and new batteries. But he'd explore\nthe city thoroughly before he left. Somewhere there must be weapons. An\ninvincible weapon, perhaps, that a man could carry in his hand. Perhaps\neven a perfect body screen. With that he wouldn't have to steal away\nfrom Mars on a freighter, hiding his loot and his greatness in a dingy\nengine room. He could walk into a Triplanet ship and order its captain\nto take him wherever he chose to go!\nHe stood then in the middle of the room, arms akimbo, his head swimming\nwith glory—and remembered suddenly that he was hungry. He felt in the\ncontainer of his helmet, extracted a couple of food tablets, and popped\nthem into his mouth.\n \n  They would take care of his needs, but they didn't satisfy his hunger.\nNo food tablets for him after this! Steaks, wines, souffles.... His\nmouth began to water at the very thought.\n \n  And then the robot rolled on soundless wheels into the room. Syme\nwhirled and saw it only when it was almost upon him. The thing was\nremarkably lifelike, and for a moment he was startled.\n \n  But it was not alive. It was only a Martian feeding-machine, kept in\nrepair all these millennia by other robots. It was not intelligent,\nand so it did not know that its masters would never return. It did not\nknow, either, that Syme was not a Martian, or that he wanted a steak,\nand not the distilled liquor of the\nxopa\nfungus, which still grew in\nthe subterranean gardens of Kal-Jmar. It was capable only of receiving\nthe mental impulse of hunger, and of responding to that impulse.\n \n  And so when Syme saw it and opened his mouth in startlement, the\nrobot acted as it had done with its degenerate, slothful masters. Its\nflexible feeding tube darted out and half down the man's gullet before\nhe could move to avoid it. And down Syme Rector's throat poured a flood\nof\nxopa\n-juice, nectar to Martians, but swift, terrible death to human\nbeings....\n \n  Outside, the last doorway to Kal-Jmar closed forever, across from the\ncold body of Tate.\n",
      "metadata": {
        "title": "Doorway to Kal-Jmar",
        "author": "Stuart Fleming",
        "passage_id": "63392",
        "uid": "a337a1e6bff94501af5dc059076eec79",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "3",
                "uid": "109a5f45515c40358c74e170e54c8c7c",
                "response_text": "Syme Rector is the most-wanted raider in the Triplanet Patrol system and wants access to the ancient Martian city of Kal-Jmar so that he can steal the priceless objects located there. The city has been abandoned for thousands of years, but no human has been able to enter it. Rector crashed his ship in the Mare Cimmerium and left a false trail for authorities to divert them from following him to Lillis, where he plans to obtain a spaceman’s identity card. This card will enable him to ship out on a freighter flight after he has obtained his stolen goods. \n\nRector follows a young patrolman until he catches him unaware on the observation deck of the Founders’ Tower. Rector shoots him in the chest, steals his wallet, and throws his body over the parapet. However, a hook on the patrolman’s uniform catches Rector, pulling Rector over the parapet. He manages to unhook himself, and just as he estimates he can hold on one minute longer, a man comes and pulls him up. The man is Harold Tate, and he invites Rector to have a drink with him. As they get drunk, Tate confides to Rector that he needs a guide to take him to Kal-Jmar; he has discovered a way to enter the dome surrounding the city. \n\nThe two men set out on their journey and follow a gully they reach. While they are in the lower part, Tate sees something overhead, and a boulder crashes down just to the left of their sand car. A horde of Martians surrounds them and forces the two men to go with them. The leader reveals that the Martians are telepathic and have no need for a spoken language. The Martians want nothing to do with the humans because there is nothing to gain from the humans. The leader tells the men the history of the two species of Martians but says they will kill the men.\n\nWhen the leader pulls his gun on Tate, Rector launches himself against the leader and wrestles away his gun. He shoots the leader and the other Martians as he dodges their shots. The two men then begin walking toward Kal-Jmar and reach the city. Tate uses his device to create a hole in the dome but realizes it isn’t strong enough. Then he thinks of using it where a door would have been, and it works. Rector shoots Tate, and just before he dies, Tate warns him, “You’ll be--sorry.” Rector takes the device and enters the city, noting all the treasures he can steal. He realizes he is hungry and takes two food tablets, but they don’t satisfy him. Then a lifelike robot that is a feeding machine enters and approaches Rector. Rector is startled and opens his mouth, and the robot shoots a feeding tube into Rector’s throat and pours xopa juice into him. The juice is poisonous to humans, and Rector dies immediately. The doorway to Kal-Jmar closes.\n"
              },
              {
                "worker_id": "6",
                "uid": "27b1ac4d9fb6428caab39ce0c567bf3f",
                "response_text": "Syme Rector is one of the most well-known outlaws in the galaxy. After crashing on Mars, he is desperate for a spaceman’s identity card so he can remain in place just a little while longer. He follows a young man until he can murder him with his energy pistol. But as the body falls, so does Syme, who was hooked onto the man’s clothing. He hangs off the ledge of the building as disattaches himself from the boy. His body falls to the group, just as Harold Tate, physicist, rescues Syme. \nWith his victim’s wallet in hand, Syme takes Tate to the bar and orders drinks for the both of them. Tate drunkenly reveals his greatest invention and desire to go to Kal-Jmar to test it out. Syme agrees to take him to the city, with the hopes of glory and money in return. On their journey across Mars, they run into the native Martians and are captured. These terrifying creatures take them deep down into the caverns, where some oxygen is present. Since the Martians are going to kill them, they are able to reveal some of their secrest. They tell them the story of the downfall of Kal-Jmar, show off their telepathic abilities, and more. Syme is able to escape and kill all the Martians, rescuing Tate who was of no help. \nThey continue their journey, now on foot, even though Syme was injured in the fight. Once they reach Kal-Jmar, Tate sets up his equipment. His first try fails, due to the enormity of the force field. His battery power is limited though, and he only has a few more tries left. He figures out that there must be areas where the force field is weaker, doorways in the dome. Tate locates one and they use his invention on it. It works, and the doorway opens. As they move to enter it, Syme reminds Tate to gather his equipment. As he does this, Syme pulls out his gun and shoots Tate in the chest. He steals his equipment and steps through the rapidly closing doorway. \nNow in the great city of Kal-Jmar, he takes his time and explores. The architecture was magnificent and decadent, a true treasure. He imagines all the money he can make off of sealing the artifacts and materials here. \nHe enters a building and discovers oxygen is present. He takes off his spacesuit and breathes in the fresh air. He takes two food tablets to ease his hunger, but it’s not enough. A telepathic Martian robot emerges, still operable thanks to its companions. Its job is to detect hunger and then feed those who need it. After detecting Syme’s hunger, it thrusts a feeding tube down his throat and feeds him poisonous lichen. Syme collapses and dies, leaving Kal-Jmar unexplored and undiscovered.\n"
              },
              {
                "worker_id": "5",
                "uid": "295b67edca644d2ca1c5ebea21bad370",
                "response_text": "Syme Rector is an outlaw looking for safe passage out of the Martian city of Lillis after the crash landing of his ship. He stalks and kills a boy in order to gain access to his identification and attempt to leave the planet and avoid the authorities.\n\nHe meets Harold Tate who is looking for a guide to take him to the ancient city of Kal-Jmar. Syme agrees to take Tate to his proposed location. On the way they meet Martians who they engage and defeat.\n\nOnce they reach Kal-Jmar, Tate is able to open a door to the city. Syme betrays Tate, killing him. However Syme is himself killed when a robot inside the city mistakes him for a hungry Martian and forcibly feeds him poisonous food."
              },
              {
                "worker_id": "1",
                "uid": "be068ba139aa4049bb05ccd0140602be",
                "response_text": "Syme Rector crashes his spaceship in Mare Cimmerium and gets through the translucent dome. He needs to disguise himself as an authority figure to enter the city, and he will need a spaceman’s identity card to do that.\n\nRector worries that the Triplanet Patrol will soon realize that he is an intruder. He follows a young patrolman and shoots him with a flame in the chest. He then takes his identification card and throws his body over the balcony. However, he unknowingly attaches the boy’s clothing to his own, and he begins falling over the railing along with the corpse. He lands on a roof and manages to unhook himself from his victim. \n\nHarold Tate comes along and helps Rector get back to safety. The two earth men grab an alcoholic beverage and discuss some secret plans. Tate wants to visit Kal-Jmar, an ancient Martian city. He believes he has discovered a way to penetrate a dome there that houses the Martians’ incredible machinery, equipment, and records. Rector agrees to go with him. \n\nThe men travel in a sand car and are quickly attacked by a horde of Martians who throw a boulder at them and wreck their car. They surround the vehicle, armed with spears and guns. Syme and Rector go with the Martians underground into a cavern. \n\nThere, they learn that the Martians speak English, and they are also telepathic. The leader informs them that he has to murder them. First, however, he will tell them anything they want to know. The leader reveals that he and the other Martians are not a separate species from the ancients as a popular theory stated. However, they are also not the ancestors of the ancients. The two groups of Martians lived alongside each other for many years, but when Mars’ atmosphere changed quickly, the other group was unable to adapt. \n\nRector’s rage suddenly bubbles up, and he attacks the lead Martian before the thought even crosses his mind. He is able to pull the Martian’s gun out of his hand and he hits him over the head with it. In an incredible rage, Rector takes down every last enemy. \n\nWithout their car, the two men trudge through the sand towards the famous dome. Tate takes out his invention, and after a few tries, it begins working. A hole in the dome opens, and Rector takes out his gun and kills Tate. Rector grabs the machine and goes into the dome. He immediately sets his eyes on platinum, ornaments, machines, books, and records. In his mind, he makes big plans to steal as much as he can carry and sell it immediately. He will come back for bigger items later. \n\nHe sees a robot rolling silently around the room, and Rector realizes that the robot is there to feed the Martians. Before he can even process the realization, the robot approaches Rector and shoves a liquid poisonous fungus down his throat. The dome’s door closes, and Rector dies. "
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "3",
                "uid": "109a5f45515c40358c74e170e54c8c7c",
                "response_text": "The setting of the story is on Mars. It begins in the city of Lillis, which is covered with a translucent steelite dome and is guarded by the Triplanet Patrol. One outstanding feature of the city is its Founders’ Tower, which is the tallest building in Lillis. On the top level, there is an observation deck that looks out over the city. Outside the city is an area called the Mare Cimmerium. The planet has red dust and supports some life, specifically lichens and tumble-grass. It has mountains, canyons, gullies, and deserts.\n\nThe ancient city of Kal-Jmar features prominently in the story. It is an ancient city of the Martian race that was very advanced but is now abandoned. There are machines, records, and other objects left behind, and all are perfectly preserved inside a bubble-like dome that is formed by a force field. Humans have tried to enter the dome using explosives, diamond drills, and even tunnels under the city, but nothing they have tried has penetrated the dome. When Mars was first being conquered, humans tried to get into the city, but their efforts resulted in bloody battles with the current Martians, so eventually, the Mars Protectorate forbade any Earthmen from going near Kal-Jmar. The city has elaborate architecture and features a pair of twin towers. When Rector enters the city, he notices there is no dust, and the air is breathable. Doors open and close automatically. The room Rector enters has platinum ornaments set in the walls and the furniture. \n\nAs Tate and Rector travel toward Kal-Jmar in their sand car outside of Lillis, they note that Mars has a deceptively low horizon. The surface contains a series of dunes, channels, and gullies that they have to cross. The gully they follow is extremely deep and steep, and from the bottom, they can only see a small section of the sky. \n\nWhen the Martians take Tate and Rector to their cavern, it is approximately nine kilometers below the gully they were in. There is a sense of moisture in the tunnel they take to the Martians’ cavern. In the cavern, the walls are covered with a phosphorescent glowing fungus, and there is air, although not enough for the humans to use. Some of the Martians eat the fungus. \n\n"
              },
              {
                "worker_id": "6",
                "uid": "27b1ac4d9fb6428caab39ce0c567bf3f",
                "response_text": "Although the beginning of the story takes place on Venus, it quickly transitions to Mars. Specifically, the long-lost city of Kal-Jmar. \nWith a protective sphere, Kal-Jmar is impenetrable and the myth and folklore surrounding it are grandiose. Kal-Jmar is only one city on Mars (the last ancient city), where the rest of the Martians live. Many Terrestrials tried to access the city, to view the historic artifacts and glorious treasures, but each attempt only lead to infighting on Mars. Soon, the Mars Protectorate forbade Earthmen to travel on Mars, as well as perform any experiments on Kal-Jmar. \nThis city is rich with well-preserved artifacts and snippets of history that many vyed to get their hands on. This story surrounds the mysteries of this city as well as the desire and need to plunder it.\n"
              },
              {
                "worker_id": "5",
                "uid": "295b67edca644d2ca1c5ebea21bad370",
                "response_text": "The story takes place on Mars in the future. The planet has been colonized by humans to the extent that cities such as Lillis are covered with immense domes to protect from the harsh Martian environment.\n\nThe characters in the story head to the ancient Martian domed city of Kal-Jmar. They head across the parched Martian landscape and eventually head down a gully which is filled with moisture and even a phosphorescent type of fungus. Kal-Jmar is filled with treasures but otherwise abandoned."
              },
              {
                "worker_id": "1",
                "uid": "be068ba139aa4049bb05ccd0140602be",
                "response_text": "The story takes place on Mars. There are parts of Mars that have been colonized by earth men, like the city of Lillis, and parts that the current-day Martians still control. One of those areas is Kal-Jmar, an ancient city that earth men know very little about. When Tate and Rector first come across the city, they immediately notice its fantastic architecture. Although it’s in a state of decay, it’s obvious that the ancient city was once beautiful. \n\nThe dome at Kal-Jmar is particularly fantastic. For many years, earth men have tried to figure out how to break through its forcefield. However, the dome is impervious to bombs, and even diamonds cannot break its shell. Inside the dome are all of the relics of the ancient Martian civilization. Records, machines, books, and precious metals are all hidden away behind its walls. \n\nSeveral thousand years before the story starts, the environment on Mars changed. The ancient Martians were unable to adapt and survive, but the current-day Martians understood the changes they needed to make to survive in the new climate. The Martians survive on elements that are plentiful in the area in which they live, like fungus, sand, and lichens. \n"
              }
            ]
          },
          {
            "question_text": "Who is Harold Tate, and what happens to him in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "3",
                "uid": "109a5f45515c40358c74e170e54c8c7c",
                "response_text": "Harold Tate is a physicist who has developed a way to create an opening in the force field dome covering the ancient city of Kal-Jmar. Other humans have tried to enter, but none have succeeded. They have not been able to breach the force field, and efforts to do so led to bloody uprisings of current Martians, so the Mars Protectorate has forbidden any Earthmen to go there. Tate happens to be on the observation deck of the Founders’ Tower when Syme Rector is trying to pull himself back over the parapet after getting pulled over it by the patrolman’s body that he threw over the side. Tate invites Rector to have a drink with him, and when he is drunk, he tells Rector he trusts him because he has an honest face. Tate asks Rector to be his guide to Kal-Jmar and tells him about the device he invented. Tate sees the boulder that the Martians lob toward their sand car when they are in the gully and saves their lives by using a steering level to flip the car around and out of the main path of the boulder.\n\nWhen the Martians take the two men to their subterranean cavern and reveal that they can speak Terrestrial, Tate asks the leader many questions about the Martians. When the leader of the Martians starts to shoot him, Rector saves Tate by hitting the Martian, wrestling his gun away, and shooting the rest of the Martians while Tate cowers against the wall. When they reach Kal-Jmar, Tate uses his device to open the force field, but then Rector shoots him. As he is dying, Tate warns Rector that he will be sorry.\n"
              },
              {
                "worker_id": "6",
                "uid": "27b1ac4d9fb6428caab39ce0c567bf3f",
                "response_text": "Harold Tate is an incredibly smart physicist who discovered the Kal-Jmar solution. More specifically, how to break through the impenetrable forcefield surrounding it. \nA relatively shy man, he is first introduced in the story by saving Syme’s life. He pulls him up off the ledge, and then they run off and get the drink together. There, roused by culcha, he reveals his huge secret to the man he just saved. \nAfter showing him his invention, Syme agrees to guide him to Kal-Jmar. Tate had never been to Mars before, so he desperately needed someone to take him around. \nHis knowledge of the Martian race, when it comes to the scientific side, rivals that of Syme’s, who’d possibly run into them before. However, he is scared of the Martians and their unpredictability. \nAfter they are captured by the Martians, the leader announces their imminent death. While Syme orchestrates their escape by killing all the Martians with an energy gun, Tate stays glued to the wall. His cowardice annoys Syme, who was injured in the fight. \nIn the end, after they reach Kal-Jmar, Tate can open a door in the force field using his ingenus invention. The first time failed, but after careful consideration, he was able to succeed the second time. Once he had opened the field, Syme betrayed him and shot him in the chest with his energy gun.\n"
              },
              {
                "worker_id": "5",
                "uid": "295b67edca644d2ca1c5ebea21bad370",
                "response_text": "Harold Tate meets Syme Rector and joins him for a drink in Lillis. He is in need of a guide to the ancient Martian city of Kal-Jmar. Traveling with Syme, he encounters a Martian resistance to his journey which they are able to overcome. Using technology of his own design, Tate is able to open a door in the outer door to Kal-Jmar. Immediately after this he is  shot and killed by Syme. He warns Syme that he is walking into a dangerous situation but he is ignored."
              },
              {
                "worker_id": "1",
                "uid": "be068ba139aa4049bb05ccd0140602be",
                "response_text": "Harold Tate comes to Rector’s rescue when he desperately needs help. Rector kills a patrolman and throws his body over a bannister. When Rector finds himself injured and unable to climb over the bar, Tate lends him a hand and asks very few questions. The two men get a drink together at a cafe nearby. Tate confesses that he trusts Rector right away due to his honest face, and he asks Rector to be his guide on Mars. \n\nMore specifically, Tate tells Rector that he wants to go to Kal-Jmar, an ancient Martian city that earth men are forbidden from visiting. Tate is a physicist, and he believes he has solved the riddle of the city’s dome. It is an incredible force field that can withstand explosives and diamond drills. Tate believes he invented a machine that will force open the wall of the dome. \n\nWhen the two men are attacked by many Martians on their voyage to Kal-Jmar, Tate does nothing to help Rector defend them. He slumps in the corner and hopes to stay alive without attacking a single alien. Although he is very intelligent, he is not brave when he needs to be. \n\nThe men finally make it to Kal-Jmar, and Tate gets his incredible invention to work after a few tries. He creates an opening in the mysterious dome. Rector quickly kills him before he can even enter the magnificent space, and his only warning is “you'll be sorry.”\n"
              }
            ]
          },
          {
            "question_text": "What are the items that Syme Rector uses that help him survive?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "3",
                "uid": "109a5f45515c40358c74e170e54c8c7c",
                "response_text": "Rector carries a pistol that, when shot, is silent. This enables him to shoot the young patrolman without drawing attention to himself or making people aware that there has been a shooting. In the sand car, Rector relies on the car’s metal arm and thick wire cable to travel down into the gully. He has harpoon guns that he and Tate can use later if they need to climb back out of the gully. After Rector battles with the Martians and shoots them, he uses a tube of sealing liquid that he carries in his emergency kit to seal the tear in his suit so that he stops losing oxygen. He also uses the sealant to close the wound in his leg from the graze of one of the Benson guns the Martians fired at him. Rector and Tate use oxygen tanks and space suits in their journey to Kal-Jmar because there is not enough air for them to breathe without these items. When he is hungry, Rector takes two food tablets that he carries in his helmet."
              },
              {
                "worker_id": "6",
                "uid": "27b1ac4d9fb6428caab39ce0c567bf3f",
                "response_text": "Syme Rector is an outlaw, a man that relies on his wits and his tools to survive. His grand experiences and adventures have taught him several lifetime’s worth of wisdom. His most trusted tool is his handy energy pistol, which he uses many times throughout the story. This gun is powerful and quick and can be found holstered on his hip. \nHe also steals a spaceman’s identity card, someone named Jones, in order to not be caught on Mars. \nHe uses a sand car to travel across Mars and transport Tate to Kal-Jmar. This car is equipped with an anchor, as well as a pulley, so one can safely descend and ascend.\n"
              },
              {
                "worker_id": "5",
                "uid": "295b67edca644d2ca1c5ebea21bad370",
                "response_text": "At one point Syme using a tube of sealing agent to make an airtight seal of a tear in his spacesuit. Syme also carries a gun which he uses to shoot and kill the boy early in the story in order to steal his identification. He also uses the gun on Tate after he gains access to Kal-Jmar. Syme also uses a sand car to navigate the Martian Terrain and guide Tate to the location of Kal-Jmar."
              },
              {
                "worker_id": "1",
                "uid": "be068ba139aa4049bb05ccd0140602be",
                "response_text": "\nRector would be immediately caught and punished if he were captured in the city of Lillis without identification. That’s why the patrolman’s identity card is so important. In order to get it, Rector has to stalk a young and innocent patrolman and murder him in broad daylight. He steals his wallet so that he can use his ID card, and he starts going by the name Jones. \n\nThe sand car is also an important item for Rector because its technology allows Rector and Tate to make their way through the sand and over the gullies of the difficult terrain on Mars. The car actually has metal arms that can go deep into the sand and lift the car up and over obstacles. Unfortunately, the car does not get the duo very far before a group of Martians attacks them and destroys the car. \n\nRector also has to steal the lead alien’s gun in order to defend himself and his partner. He and Tate would perish if he did not have the courage to grab the gun out of the Martian’s grasp and hit him over the head with it. He uses the weapon to murder the rest of the Martians and save Tate’s life and his own.\n\nFinally, the entire mission to Kal-Jmar would be pointless without Tate’s invention. As soon as Tate tells Rector about his work, Rector sees dollar signs. He wants to take advantage of Tate’s knowledge and steal as many goods as possible from the impenetrable dome. As soon as Tate gets the machine to work and Rector knows he can go inside, he murders Tate so he can take everything for himself. \n"
              }
            ]
          },
          {
            "question_text": "Describe the Martians in the story.",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "3",
                "uid": "109a5f45515c40358c74e170e54c8c7c",
                "response_text": "From the humans' perspective, the Martians are strange, unpredictable beings. They eat sand to get their oxygen, and lichens, fungi, and tumble-grass from the deserts, all of which contain substances like arsenic that are deadly poisons to humans. The humans believe the Martians cannot or will not learn their language, Terrestrial, and that they have their own language. In it, every word can have multiple meanings depending on the inflection used by the speaker. In truth, the Martians have been telepathic for several thousand years because the planet is practically airless. They are clever and only pretend not to understand Terrestrial, and they make up their complicated language to deceive the humans. \n\nMartians want no contact with humans because the Martians have nothing to gain from contact with them. They see the humans as imperialistic. They plan to kill Rector and Tate as part of their concept of justice. The Martians know that Kal-Jmar holds the secret that would make Mars have an Earthlike atmosphere within fifty years. The ancient Kal-Jmar Martians were the contemporaries of the current Martians' ancestors. When the atmosphere of Mars began thinning several thousand years earlier, the Kal-Jmar Martians sealed themselves in their dome where they died of plague and other causes, while the other Martians adapted to the change. \n\nThe Martians look like they have six legs but really have four legs and two arms. Their torsos bulge because they have a huge air bladder. They look a bit like dogs but have high foreheads and lips that are not split. They are covered with patches of black and white fur; with their muscles, they can control the patches so that they are primarily black or white, depending on the temperature. They can use weapons and are armed with spears and Benson guns when they confront Rector and Tate. \n\n"
              },
              {
                "worker_id": "6",
                "uid": "27b1ac4d9fb6428caab39ce0c567bf3f",
                "response_text": "The ancient Martians, as is revealed later in the story, faced an urgent dilemma when the atmosphere surrounding Mars changed. They could either hide and make scientific changes to survive. Or they could stay where they were and adapt. One group hid in the city of Kal-Jmar, constructing an impenetrable dome around themselves. They remained the same for many years until a plague wiped out the entire population. \nThe other group was able to survive the atmospheric collapse by changing with it. Their dependence on oxygen lessened. They eat sand to get oxygen, as well as breathing it in the deep caverns below. They can eat poisonous lichens and mushrooms, fungi that would kill any other creature. \nAnd their bodies changed too. Now, they resemble dogs, with fur that changes color depending on the weather. With four legs and two arms, they are incredibly quick creatures. Their stomachs bulged out from their body, due to their evolutionary changes. The Martians are also telepathic, with no current language of their own. They are an incredibly advanced race. They developed air bladders that pumped oxygen from the stomach (sand) directly to the bloodstream. These are the native Martians, and, though energy guns were forbidden on Mars, some of them were armed with them. Others carry spears and other missiles.\n"
              },
              {
                "worker_id": "5",
                "uid": "295b67edca644d2ca1c5ebea21bad370",
                "response_text": "The Martians have 4 legs and 2 arms. They are telepathic which aids in their communication on a planet with very little atmosphere. It is thought that they speak an immensely complex language and cannot speak to humans. This, however, is a deception on the part of the Martians who can speak to humans perfectly well. The Martians who currently live on the planet have adapted to live on the planet with no atmosphere. Their species' ancient contemporaries sealed themselves in cities like Kal-Jmar instead of adapting. "
              },
              {
                "worker_id": "1",
                "uid": "be068ba139aa4049bb05ccd0140602be",
                "response_text": "The ancient Martians and a prolific species. They have thousands of machines and artifacts that they have created, and they preserved all of their equipment and accomplishments inside an impenetrable dome. Now, the current-day Martians protect the dome. The current-day Martians lived alongside the ancient Martians until the atmosphere on Mars changed rapidly and the ancients could not evolve quickly enough. \n\nThe current-day Martians are very different from earth men. Although they breathe oxygen, they also eat sand, fungi, and lichens. They do not come to cities where earth men preside, and they refuse to speak their tongue. The creatures have four legs and two arms, and they move incredibly fast. Their faces resemble dogs, except that they have large foreheads. Thick black fur covers their faces, and using their muscles sometimes turns the fur white. The Martians are also telepathic, but only Tate and Rector learn this fact. The rest of the earth men do not consider it a possibility. The species is very deceitful. They made up a fake language so that the earth men would not know their true tongue, and they pretend they cannot speak terrestrial although they truly can. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 6572,
        "document_length_chars": 37882
      }
    }
  ]
}