{
  "item_metadata": {
    "item_id": "63401",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63401",
      "content": "The Happy Castaway\n \n \n BY ROBERT E. McDOWELL\n \n Being space-wrecked and marooned is tough enough. But to face the horrors of such a planet as this was too much. Imagine Fawkes' terrible predicament; plenty of food—and twenty seven beautiful girls for companions.\n \n [Transcriber's Note: This etext was produced from Planet Stories Spring 1945. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n\n \n Jonathan Fawkes opened his eyes. He was flat on his back, and a girl was bending over him. He detected a frightened expression on the girl's face. His pale blue eyes traveled upward beyond the girl. The sky was his roof, yet he distinctly remembered going to sleep on his bunk aboard the space ship.\n \n \"You're not dead?\"\n \n \"I've some doubt about that,\" he replied dryly. He levered himself to his elbows. The girl, he saw, had bright yellow hair. Her nose was pert, tip-tilted. She had on a ragged blue frock and sandals.\n \n \"Is—is anything broken?\" she asked.\n \n \"Don't know. Help me up.\" Between them he managed to struggle to his feet. He winced. He said, \"My name's Jonathan Fawkes. I'm a space pilot with Universal. What happened? I feel like I'd been poured out of a concrete mixer.\"\n \n She pointed to the wreck of a small space freighter a dozen feet away. Its nose was buried in the turf, folded back like an accordion. It had burst open like a ripe watermelon. He was surprised that he had survived at all. He scratched his head. \"I was running from Mars to Jupiter with a load of seed for the colonists.\"\n \n \"Oh!\" said the girl, biting her lips. \"Your co-pilot must be in the wreckage.\"\n \n He shook his head. \"No,\" he reassured her. \"I left him on Mars. He had an attack of space sickness. I was all by myself; that was the trouble. I'd stay at the controls as long as I could, then lock her on her course and snatch a couple of hours' sleep. I can remember crawling into my bunk. The next thing I knew you were bending over me.\" He paused. \"I guess the automatic deflectors slowed me up or I would have been a cinder by this time,\" he said.\n \n The girl didn't reply. She continued to watch him, a faint enigmatic smile on her lips. Jonathan glanced away in embarrassment. He wished that pretty women didn't upset him so. He said nervously, \"Where am I? I couldn't have slept all the way to Jupiter.\"\n \n The girl shrugged her shoulders.\n \n \"I don't know.\"\n \n \"You don't know!\" He almost forgot his self-consciousness in his surprise. His pale blue eyes returned to the landscape. A mile across the plain began a range of jagged foothills, which tossed upward higher and higher until they merged with the blue saw-edge of a chain of mountains. As he looked a puff of smoke belched from a truncated cone-shaped peak. A volcano. Otherwise there was no sign of life: just he and the strange yellow-headed girl alone in the center of that vast rolling prairie.\n \n \"I was going to explain,\" he heard her say. \"We think that we are on an asteroid.\"\n \n \"We?\" he looked back at her.\n \n \"Yes. There are twenty-seven of us. We were on our way to Jupiter, too, only we were going to be wives for the colonists.\"\n \n \"I remember,\" he exclaimed. \"Didn't the Jupiter Food-growers Association enlist you girls to go to the colonies?\"\n \n She nodded her head. \"Only twenty-seven of us came through the crash.\"\n \n \"Everybody thought your space ship hit a meteor,\" he said.\n \n \"We hit this asteroid.\"\n \n \"But that was three years ago.\"\n \n \"Has it been that long? We lost track of time.\" She didn't take her eyes off him, not for a second. Such attention made him acutely self conscious. She said, \"I'm Ann. Ann Clotilde. I was hunting when I saw your space ship. You had been thrown clear. You were lying all in a heap. I thought you were dead.\" She stooped, picked up a spear.\n \n \"Do you feel strong enough to hike back to our camp? It's only about four miles,\" she said.\n \n \"I think so,\" he said.\n \n \n\n \n Jonathan Fawkes fidgeted uncomfortably. He would rather pilot a space ship through a meteor field than face twenty-seven young women. They were the only thing in the Spaceways of which he was in awe. Then he realized that the girl's dark blue eyes had strayed beyond him. A frown of concentration marred her regular features. He turned around.\n \n On the rim of the prairie he saw a dozen black specks moving toward them.\n \n She said: \"Get down!\" Her voice was agitated. She flung herself on her stomach and began to crawl away from the wreck. Jonathan Fawkes stared after her stupidly. \"Get down!\" she reiterated in a furious voice.\n \n He let himself to his hands and knees. \"Ouch!\" he said. He felt like he was being jabbed with pins. He must be one big bruise. He scuttled after the girl. \"What's wrong?\"\n \n The girl looked back at him over her shoulder. \"Centaurs!\" she said. \"I didn't know they had returned. There is a small ravine just ahead which leads into the hills. I don't think they've seen us. If we can reach the hills we'll be safe.\"\n \n \"Centaurs! Isn't there anything new under the sun?\"\n \n \"Well, personally,\" she replied, \"I never saw a Centaur until I was wrecked on this asteroid.\" She reached the ravine, crawled head foremost over the edge. Jonathan tumbled after her. He hit the bottom, winced, scrambled to his feet. The girl started at a trot for the hills. Jonathan, groaning at each step, hobbled beside her.\n \n \"Why won't the Centaurs follow us into the hills?\" he panted.\n \n \"Too rough. They're like horses,\" she said. \"Nothing but a goat could get around in the hills.\"\n \n The gulley, he saw, was deepening into a respectable canyon, then a gorge. In half a mile, the walls towered above them. A narrow ribbon of sky was visible overhead. Yellow fern-like plants sprouted from the crevices and floor of the canyon.\n \n They flushed a small furry creature from behind a bush. As it sped away, it resembled a cottontail of Earth. The girl whipped back her arm, flung the spear. It transfixed the rodent. She picked it up, tied it to her waist. Jonathan gaped. Such strength and accuracy astounded him. He thought, amazons and centaurs. He thought, but this is the year\n3372; not the time of ancient Greece.\n \n The canyon bore to the left. It grew rougher, the walls more precipitate. Jonathan limped to a halt. High boots and breeches, the uniform of Universal's space pilots, hadn't been designed for walking.\n\"Hold on,\" he said. He felt in his pockets, withdrew an empty cigarette package, crumpled it and hurled it to the ground.\n \n \"You got a cigarette?\" he asked without much hope.\n \n The girl shook her head. \"We ran out of tobacco the first few months we were here.\"\n \n Jonathan turned around, started back for the space ship.\n \n \"Where are you going?\" cried Ann in alarm.\n \n He said, \"I've got a couple of cartons of cigarettes back at the freighter. Centaurs or no centaurs, I'm going to get a smoke.\"\n \n \"No!\" She clutched his arm. He was surprised at the strength of her grip. \"They'd kill you,\" she said.\n \n \"I can sneak back,\" he insisted stubbornly. \"They might loot the ship. I don't want to lose those cigarettes. I was hauling some good burley tobacco seed too. The colonists were going to experiment with it on Ganymede.\"\n \n \"No!\"\n \n He lifted his eyebrows. He thought, she is an amazon! He firmly detached her hand.\n \n The girl flicked up her spear, nicked his neck with the point of it.\n\"We are going to the camp,\" she said.\n \n Jonathan threw himself down backwards, kicked the girl's feet out from under her. Like a cat he scrambled up and wrenched the spear away.\n \n A voice shouted: \"What's going on there?\"\n \n \n\n \n He paused shamefacedly. A second girl, he saw, was running toward them from up the canyon. Her bare legs flashed like ivory. She was barefooted, and she had black hair. A green cloth was wrapped around her sarong fashion. She bounced to a stop in front of Jonathan, her brown eyes wide in surprise. He thought her sarong had been a table cloth at one time in its history.\n \n \"A man!\" she breathed. \"By Jupiter and all its little moons, it's a man!\"\n \n \"Don't let him get away!\" cried Ann.\n \n \"Hilda!\" the brunette shrieked. \"A man! It's a man!\"\n \n A third girl skidded around the bend in the canyon. Jonathan backed off warily.\n \n Ann Clotilde cried in anguish: \"Don't let him get away!\"\n \n Jonathan chose the centaurs. He wheeled around, dashed back the way he had come. Someone tackled him. He rolled on the rocky floor of the canyon. He struggled to his feet. He saw six more girls race around the bend in the canyon. With shouts of joy they flung themselves on him.\n \n Jonathan was game, but the nine husky amazons pinned him down by sheer weight. They bound him hand and foot. Then four of them picked him up bodily, started up the canyon chanting: \" He was a rocket riding daddy from Mars. \" He recognized it as a popular song of three years ago.\n \n Jonathan had never been so humiliated in his life. He was known in the spaceways from Mercury to Jupiter as a man to leave alone. His nose had been broken three times. A thin white scar crawled down the bronze of his left cheek, relic of a barroom brawl on Venus. He was big, rangy, tough. And these girls had trounced him. Girls! He almost wept from mortification.\n \n He said, \"Put me down. I'll walk.\"\n \n \"You won't try to get away?\" said Ann.\n \n \"No,\" he replied with as much dignity as he could summon while being held aloft by four barbarous young women.\n \n \"Let him down,\" said Ann. \"We can catch him, anyway, if he makes a break.\"\n \n Jonathan Fawkes' humiliation was complete. He meekly trudged between two husky females, who ogled him shamelessly. He was amazed at the ease with which they had carried him. He was six feet three and no light weight. He thought enviously of the centaurs, free to gallop across the plains. He wished he was a centaur.\n \n The trail left the canyon, struggled up the precipitate walls. Jonathan picked his way gingerly, hugged the rock. \"Don't be afraid,\" advised one of his captors. \"Just don't look down.\"\n \n \"I'm not afraid,\" said Jonathan hotly. To prove it he trod the narrow ledge with scorn. His foot struck a pebble. Both feet went out from under him. He slithered halfway over the edge. For one sickening moment he thought he was gone, then Ann grabbed him by the scruff of his neck, hauled him back to safety. He lay gasping on his stomach. They tied a rope around his waist then, and led him the rest of the way to the top like a baby on a leash. He was too crestfallen to resent it.\n \n The trail came out on a high ridge. They paused on a bluff overlooking the prairie.\n \n \"Look!\" cried Ann pointing over the edge.\n \n A half dozen beasts were trotting beneath on the plain. At first, Jonathan mistook them for horses. Then he saw that from the withers up they resembled men. Waists, shoulders, arms and heads were identical to his own, but their bodies were the bodies of horses.\n \n \"Centaurs!\" Jonathan Fawkes said, not believing his eyes.\n \n \n\n \n The girls set up a shout and threw stones down at the centaurs, who reared, pawed the air, and galloped to a safe distance, from which they hurled back insults in a strange tongue. Their voices sounded faintly like the neighing of horses.\n \n Amazons and centaurs, he thought again. He couldn't get the problem of the girls' phenomenal strength out of his mind. Then it occurred to him that the asteroid, most likely, was smaller even than Earth's moon. He must weigh about a thirtieth of what he usually did, due to the lessened gravity. It also occurred to him that they would be thirty times as strong. He was staggered. He wished he had a smoke.\n \n At length, the amazons and the centaurs tired of bandying insults back and forth. The centaurs galloped off into the prairie, the girls resumed their march. Jonathan scrambled up hills, skidded down slopes. The brunette was beside him helping him over the rough spots.\n \n \"I'm Olga,\" she confided. \"Has anybody ever told you what a handsome fellow you are?\" She pinched his cheek. Jonathan blushed.\n \n They climbed a ridge, paused at the crest. Below them, he saw a deep valley. A stream tumbled through the center of it. There were trees along its banks, the first he had seen on the asteroid. At the head of the valley, he made out the massive pile of a space liner.\n \n They started down a winding path. The space liner disappeared behind a promontory of the mountain. Jonathan steeled himself for the coming ordeal. He would have sat down and refused to budge except that he knew the girls would hoist him on their shoulders and bear him into the camp like a bag of meal.\n \n The trail debouched into the valley. Just ahead the space liner reappeared. He imagined that it had crashed into the mountain, skidded and rolled down its side until it lodged beside the stream. It reminded him of a wounded dinosaur. Three girls were bathing in the stream. He looked away hastily.\n \n Someone hailed them from the space ship.\n \n \"We've caught a man,\" shrieked one of his captors.\n \n A flock of girls streamed out of the wrecked space ship.\n \n \"A man!\" screamed a husky blonde. She was wearing a grass skirt. She had green eyes. \"We're rescued!\"\n \n \"No. No,\" Ann Clotilde hastened to explain. \"He was wrecked like us.\"\n \n \"Oh,\" came a disappointed chorus.\n \n \"He's a man,\" said the green-eyed blonde. \"That's the next best thing.\"\n \n \"Oh, Olga,\" said a strapping brunette. \"Who'd ever thought a man could look so good?\"\n \n \"I did,\" said Olga. She chucked Jonathan under the chin. He shivered like an unbroken colt when the bit first goes in its mouth. He felt like a mouse hemmed in by a ring of cats.\n \n A big rawboned brute of a girl strolled into the circle. She said,\n\"Dinner's ready.\" Her voice was loud, strident. It reminded him of the voices of girls in the honky tonks on Venus. She looked at him appraisingly as if he were a horse she was about to bid on. \"Bring him into the ship,\" she said. \"The man must be starved.\"\n \n He was propelled jubilantly into the palatial dining salon of the wrecked liner. A long polished meturilium table occupied the center of the floor. Automatic weight distributing chairs stood around it. His feet sank into a green fiberon carpet. He had stepped back into the Thirty-fourth Century from the fabulous barbarian past.\n \n With a sigh of relief, he started to sit down. A lithe red-head sprang forward and held his chair. They all waited politely for him to be seated before they took their places. He felt silly. He felt like a captive princess. All the confidence engendered by the familiar settings of the space ship went out of him like wind. He, Jonathan Fawkes, was a castaway on an asteroid inhabited by twenty-seven wild women.\n \n \n\n \n As the meal boisterously progressed, he regained sufficient courage to glance timidly around. Directly across the table sat a striking, grey-eyed girl whose brown hair was coiled severely about her head. She looked to him like a stenographer. He watched horrified as she seized a whole roast fowl, tore it apart with her fingers, gnawed a leg. She caught him staring at her and rolled her eyes at him. He returned his gaze to his plate.\n \n Olga said: \"Hey, Sultan.\"\n \n He shuddered, but looked up questioningly.\n \n She said, \"How's the fish?\"\n \n \"Good,\" he mumbled between a mouthful. \"Where did you get it?\"\n \n \"Caught it,\" said Olga. \"The stream's full of 'em. I'll take you fishing tomorrow.\" She winked at him so brazenly that he choked on a bone.\n \n \"Heaven forbid,\" he said.\n \n \"How about coming with me to gather fruit?\" cried the green-eyed blonde; \"you great big handsome man.\"\n \n \"Or me?\" cried another. And the table was in an uproar.\n \n The rawboned woman who had summoned them to dinner, pounded the table until the cups and plates danced. Jonathan had gathered that she was called Billy.\n \n \"Quiet!\" She shrieked in her loud strident voice. \"Let him be. He can't go anywhere for a few days. He's just been through a wreck. He needs rest.\" She turned to Jonathan who had shrunk down in his chair. \"How about some roast?\" she said.\n \n \"No.\" He pushed back his plate with a sigh. \"If I only had a smoke.\"\n \n Olga gave her unruly black hair a flirt. \"Isn't that just like a man?\"\n \n \"I wouldn't know,\" said the green-eyed blonde. \"I've forgotten what they're like.\"\n \n Billy said, \"How badly wrecked is your ship?\"\n \n \"It's strewn all over the landscape,\" he replied sleepily.\n \n \"Is there any chance of patching it up?\"\n \n He considered the question. More than anything else, he decided, he wanted to sleep. \"What?\" he said.\n \n \"Is there any possibility of repairing your ship?\" repeated Billy.\n \n \"Not outside the space docks.\"\n \n They expelled their breath, but not for an instant did they relax the barrage of their eyes. He shifted position in embarrassment. The movement pulled his muscles like a rack. Furthermore, an overpowering lassitude was threatening to pop him off to sleep before their eyes.\n \n \"You look exhausted,\" said Ann.\n \n Jonathan dragged himself back from the edge of sleep. \"Just tired,\" he mumbled. \"Haven't had a good night's rest since I left Mars.\" Indeed it was only by the most painful effort that he kept awake at all. His eyelids drooped lower and lower.\n \n \"First it's tobacco,\" said Olga; \"now he wants to sleep. Twenty-seven girls and he wants to sleep.\"\n \n \"He is asleep,\" said the green-eyed blonde.\n \n \n\n \n Jonathan was slumped forward across the table, his head buried in his arms.\n \n \"Catch a hold,\" said Billy, pushing back from the table. A dozen girls volunteered with a rush. \"Hoist!\" said Billy. They lifted him like a sleepy child, bore him tenderly up an incline and into a stateroom, where they deposited him on the bed.\n \n Ann said to Olga; \"Help me with these boots.\" But they resisted every tug. \"It's no use,\" groaned Ann, straightening up and wiping her bright yellow hair back from her eyes. \"His feet have swollen. We'll have to cut them off.\"\n \n At these words, Jonathan raised upright as if someone had pulled a rope.\n \n \" Cut off whose feet? \" he cried in alarm.\n \n \"Not your feet, silly,\" said Ann. \"Your boots.\"\n \n \"Lay a hand on those boots,\" he scowled; \"and I'll make me another pair out of your hides. They set me back a week's salary.\" Having delivered himself of this ultimatum, he went back to sleep.\n \n Olga clapped her hand to her forehead. \"And this,\" she cried \"is what we've been praying for during the last three years.\"\n \n The next day found Jonathan Fawkes hobbling around by the aid of a cane. At the portal of the space ship, he stuck out his head, glanced all around warily. None of the girls were in sight. They had, he presumed, gone about their chores: hunting, fishing, gathering fruits and berries. He emerged all the way and set out for the creek. He walked with an exaggerated limp just in case any of them should be hanging around. As long as he was an invalid he was safe, he hoped.\n \n He sighed. Not every man could be waited on so solicitously by twenty-seven handsome strapping amazons. He wished he could carry it off in cavalier fashion. He hobbled to the creek, sat down beneath the shade of a tree. He just wasn't the type, he supposed. And it might be years before they were rescued.\n \n As a last resort, he supposed, he could hide out in the hills or join the centaurs. He rather fancied himself galloping across the plains on the back of a centaur. He looked up with a start. Ann Clotilde was ambling toward him.\n \n \"How's the invalid?\" she said, seating herself beside him.\n \n \"Hot, isn't it?\" he said. He started to rise. Ann Clotilde placed the flat of her hand on his chest and shoved. \" Ooof! \" he grunted. He sat down rather more forcibly than he had risen.\n \n \"Don't get up because of me,\" she informed him. \"It's my turn to cook, but I saw you out here beneath the trees. Dinner can wait. Jonathan do you know that you are irresistible?\" She seized his shoulders, stared into his eyes. He couldn't have felt any more uncomfortable had a hungry boa constrictor draped itself in his arms. He mopped his brow with his sleeve.\n \n \"Suppose the rest should come,\" he said in an embarrassed voice.\n \n \"They're busy. They won't be here until I call them to lunch. Your eyes,\" she said, \"are like deep mysterious pools.\"\n \n \"Sure enough?\" said Jonathan with involuntary interest. He began to recover his nerve.\n \n She said, \"You're the best looking thing.\" She rumpled his hair. \"I can't keep my eyes off you.\"\n \n Jonathan put his arm around her gingerly. \"Ouch!\" He winced. He had forgotten his sore muscles.\n \n \"I forgot,\" said Ann Clotilde in a contrite voice. She tried to rise.\n\"You're hurt.\"\n \n He pulled her back down. \"Not so you could notice it,\" he grinned.\n \n \"Well!\" came the strident voice of Billy from behind them. \"We're all glad to hear that!\"\n \n \n\n \n Jonathan leaped to his feet, dumping Ann to the ground. He jerked around. All twenty-six of the girls were lined up on the path. Their features were grim. He said: \"I don't feel so well after all.\"\n \n \"It don't wash,\" said Billy. \"It's time for a showdown.\"\n \n Jonathan's hair stood on end. He felt rather than saw Ann Clotilde take her stand beside him. He noticed that she was holding her spear at a menacing angle. She said in an angry voice: \"He's mine. I found him. Leave him alone.\"\n \n \"Where do you get that stuff?\" cried Olga. \"Share and share alike, say I.\"\n \n \"We could draw straws for him,\" suggested the green-eyed blonde.\n \n \"Look here,\" Jonathan broke in. \"I've got some say in the matter.\"\n \n \"You have not,\" snapped Billy. \"You'll do just as we say.\" She took a step toward him.\n \n Jonathan edged away in consternation.\n \n \"He's going to run!\" Olga shouted.\n \n Jonathan never stopped until he was back in the canyon leading to the plain. His nerves were jumping like fleas. He craved the soothing relaxation of a smoke. There was, he remembered, a carton of cigarettes at the wreck. He resumed his flight, but at a more sober pace.\n \n At the spot where he and Ann had first crawled away from the centaurs, he scrambled out of the gulley, glanced in the direction of his space ship. He blinked his eyes, stared. Then he waved his arms, shouted and tore across the prairie. A trim space cruiser was resting beside the wreck of his own. Across its gleaming monaloid hull ran an inscription in silver letters: \"INTERSTELLAR COSMOGRAPHY SOCIETY.\"\n \n Two men crawled out of Jonathan's wrecked freighter, glanced in surprise at Jonathan. A third man ran from the cruiser, a Dixon Ray Rifle in his hand.\n \n \"I'm Jonathan Fawkes,\" said the castaway as he panted up, \"pilot for Universal. I was wrecked.\"\n \n A tall elderly man held out his hand. He had a small black waxed mustache and Van Dyke. He was smoking a venusian cigarette in a yellow composition holder. He said, \"I'm Doctor Boynton.\" He had a rich cultivated voice, and a nose like a hawk. \"We are members of the Interstellar Cosmography Society. We've been commissioned to make a cursory examination of this asteroid. You had a nasty crack up, Mr. Fawkes. But you are in luck, sir. We were on the point of returning when we sighted the wreck.\"\n \n \"I say,\" said the man who had run out of the cruiser. He was a prim, energetic young man. Jonathan noted that he carried the ray gun gingerly, respectfully. \"We're a week overdue now,\" he said. \"If you have any personal belongings that you'd like to take with you, you'd best be getting them aboard.\"\n \n \n\n \n Jonathan's face broke into a grin. He said, \"Do any of you know how to grow tobacco?\"\n \n They glanced at each other in perplexity.\n \n \"I like it here,\" continued Jonathan. \"I'm not going back.\"\n \n \"What?\" cried the three explorers in one breath.\n \n \"I'm going to stay,\" he repeated. \"I only came back here after the cigarettes.\"\n \n \"But it will be three years before the asteroid's orbit brings it back in the space lanes,\" said Doctor Boynton. \"You don't possibly expect to be picked up before then!\"\n \n Jonathan shook his head, began to load himself with tools, tobacco seed, and cigarettes.\n \n \"Odd.\" Doctor Boynton shook his head, turned to the others. \"Though if I remember correctly, there was quite an epidemic of hermits during the medieval period. It was an esthetic movement. They fled to the wilderness to escape the temptation of women .\"\n \n Jonathan laughed outright.\n \n \"You are sure you won't return, young man?\"\n \n He shook his head. They argued, they cajoled, but Jonathan was adamant. He said, \"You might report my accident to Universal. Tell them to stop one of their Jupiter-bound freighters here when the asteroid swings back in the space ways. I'll have a load for them.\"\n \n Inside the ship, Doctor Boynton moved over to a round transparent port hole. \"What a strange fellow,\" he murmured. He was just in time to see the castaway, loaded like a pack mule, disappear in the direction from which he had come.\n \n Robinson Crusoe was going back to his man (?) Friday—all twenty-seven of them.",
      "metadata": {
        "title": "The Happy Castaway",
        "author": "Robert E. McDowell",
        "passage_id": "63401",
        "uid": "aaa46b420fa34763bbc75d3575ef5bed",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "6",
                "uid": "b314441a9fe34e50bce117ac766f30ca",
                "response_text": "Jonathan Fawkes dropped off the only member of his crew on Mars after he got space sickness, so he was alone on the journey to Jupiter. He had been charged with dropping off tobacco seed to see if they could cultivate it on the colonies in Jupiter. However, along the way, he got tired at the wheel of the ship, and, during his nap, crashed into an asteroid. When he awoke, a beautiful blonde woman named Ann was standing over him. They introduce themselves, and she explains that she’s one of the 27 female survivors of their crash over three years ago. Ann sees a horde of centaurs coming over the plains, so she and Jonathan crawl to the foothills, where they can’t be followed. She spears a creature along the way and hooks it on her belt. Jonathan attempts to escape, as he’s uncomfortable around women and wants a cigarette, but she takes him down. They run into nine more women who pin him to the ground. They start to carry him the four miles back to their base, but he asks to walk instead as he’s humiliated. They trudge through the foothills, only stopping once to throw stones at the pestering centaurs, before finally reaching home. They treat Jonathan like a king, pulling out a chair for him at the table, and endlessly complimenting him. They eat inside the dining room of their wrecked ship, and Jonathan watches the wild, Amazonian-like women in horror. Their leader, a big woman named Billy, halts all the flirting and tells Jonathan that he needs to rest in order to feel better. After his belly’s full, he quickly falls asleep, and they carry him upstairs to bed, attempting to take off his shoes which he refuses. \nThe next morning, he wakes up and walks outside with a cane, exaggerating his injuries so as to be treated better. He sits beneath a tree and is soon greeted by Ann. She grabs him and they make to embrace but are caught by the rest of the girls. Billy splits them up and says it’s time to figure out who gets him. The women fight and argue their cases, and Jonathan slips away, running back to his ship. Another cruiser is sat down next to his own, the Interstellar Cosmography Society scrawled on its side. He meets Dr. Boynton and another man who offer to rescue him. Jonathan refuses them, tells them there’s nothing to worry about, then grabs his tobacco seeds, cigarettes, and tools, and makes his way back to the women. \n"
              },
              {
                "worker_id": "2",
                "uid": "02f80b7a2e844eb98affffe241ba1c14",
                "response_text": "Jonathan Fawkes, a Universal space pilot, flying from Mars to Jupiter, has seeds for the colonists there. He is flying alone, using autopilot at times to sleep. Something goes wrong, and his ship crashes onto an asteroid. He is discovered by a beautiful young woman checking to see if he is alive. She reveals that she, along with 26 other women, crashed their ship onto the asteroid three years ago when they were on their way to become wives for the colonists on Jupiter. This woman, Ann Clotilde, invites Jonathan back to their camp. Along the way, she spies a herd of centaurs and hides Jonathan from them. Ann is surprisingly strong and can kill a rabbit-like creature with her spear, reminding Jonathan of an amazon. \n\tWhen Jonathan craves a cigarette and realizes they are in his ship, he turns to go back for them, but Ann stops him with the tip of her spear. Other women appear to find out what is going on, and they are all astonished to discover a man among them. They shout with joy and throw themselves at him. To prevent him from trying to get away again, they tie his hands and feet and carry him, which utterly humiliates Jonathan. He had always considered himself a tough guy, but he had been bested by a group of women! He persuades them to let him walk the rest of the way, but later, when his feet slip on the narrow ridge of a trail, they have to rescue him and then tie a rope around his waist like a child to keep him safe.\n\tAs they reach their camp, the women announce they’ve caught a man, and one of the women exclaims they are rescued. But another points out that having a man there is the next best thing, and the women talk openly about his attractiveness. At dinner, several women invite Jonathan to join them for private activities the next day. He eventually falls asleep at the dinner table and is carried away to bed.\n\tThe next day, Ann, his finder, discovers him alone and engages with him. He is worried that others might see them, but she assures him they are alone. But something he says draws all of the women into the opening where they are, and they begin arguing over whose man he is, Ann’s, all of theirs to share….Jonathan exclaims he should have a say in it, but Billy, the leader, tells him he doesn’t. He then decides it’s a good time to get those cigarettes, and when he arrives, two men are there from the Instellar Cosmography Society and offer him a ride back to civilization. Jonathan tells them he has decided he likes it there and wants to stay, even though it will be another three years before the asteroid’s orbit is in the space lanes again where he can be picked up.\n"
              },
              {
                "worker_id": "8",
                "uid": "5204eddd8ba449b1bdf2851c59c477e0",
                "response_text": "Jonathan Fawkes is a space pilot with a company called Universal. After dropping his co-pilot off on Mars due to illness, Jonathan has been flying solo, carrying a load of seed to be delivered to colonists on Jupiter. Somehow, he crash-lands on an asteroid, and when he wakes up, he sees a woman with bright yellow hair standing over him. Her name is Ann Clotilde, and she is one of the women that had been sent to Jupiter three years earlier by the Food-growers Association to become wives for the colonists. Ann informs Jonathan their ship had crash-landed and only twenty-seven women survived. She offers to bring Jonathan back to her camp, and Jonathan agrees despite his discomfort around women. They begin to move across the prairie. Along the way, a group of centaurs chases them, and they run toward the safety of a small ravine leading into the hills. After Ann uses her spear to snag a rabbit, Jonathan realizes the women must have developed Amazon-like skills during their time on the asteroid. He begins to crave a cigarette and decides to return to his ship to fetch the cartons of cigarettes he had left behind. Ann insists he leaves the cigarettes behind and accompanies her to the camp, whereupon he trips her and takes her spear. The commotion draws the attention of some of Ann's fellow survivors who come to her aid and apprehend Jonathan. Feeling shame, Jonathan joins the cohort on their march back to the camp as the women and the centaurs throw rocks and insults at each other. The women, particularly Olga and Ann, begin flirting with Jonathan since they haven't seen a man in many years. When they return to camp, all of the women are delighted to see a man, and he joins them for a great feast prepared by their cook, Billy. The women argue about who will get to spend alone time with Jonathan, but he is too tired to play along. Eventually, he falls asleep, and the women carry him to bed. When he awakens, he explores the encampment and runs into Ann. Emboldened by Ann's forwardness, Jonathan wraps his arm around her, and the other women suddenly appear, prepared to fight for Jonathan. As they argue amongst themselves, Jonathan makes a run for his ship, leaving the women behind. When he arrives, he sees a space cruiser next to his wrecked ship with the inscription \"Interstellar Cosmography Society.\" Three men step out, and the eldest explains to Jonathan that they have been commissioned to examine the asteroid. They offer Jonathan a ride off the asteroid, but Jonathan turns down their off. He has decided to stay with the women after all. He grabs his cigarettes and makes his way back to camp."
              },
              {
                "worker_id": "10",
                "uid": "67dfc2e71eaf49529485334c18ef17b5",
                "response_text": "In 3372, Jonathan Fawkes, a space pilot with Universal, crash lands during a transport run from Mars to Jupiter to deliver seed for the colonists. He awakes to find a woman (Ann Clotilde) wearing a ragged blue frock and sandals that is surprised he isn’t dead. She doesn’t know where they are, but suspects they are on an asteroid. She and 26 other women survived a crash landing here three years ago while on their way to become wives to Jupiter’s colonists. A herd of Centaurs charge towards them and they flee down a ravine that opens into a large gorge. Ann spears a small furry creature and ties it to her belt. Jonathan craves cigarettes and wants to go back to his wrecked ship to retrieve some, but Ann insists they go to camp. Jonathan knocks her feet out and takes her spear, turning it on her. Just then, another woman approaches, shrieking at the presence of a man. Jonathan flees, and nine women chase him down, bind his arms and legs, and begin carrying him to their camp. Jonathan begs to walk and they let him down, knowing they can catch him again if he tries to run. He slips and nearly plummets down a canyon wall, but Ann grabs him and saves him, humiliating Jonathan to be helped by a woman. They stop briefly to throw rocks and yell at some Centaurs on the prairie below. At their camp, they feed Jonathan in the dining salon of their wrecked ship. Some women invite Jonathan to hunt and forage, fawning over him. One of them, Olga, makes strong sexual advances. Billy, the leader of the women, silences the chatter and declares that Jonathan must rest. He says his ship can’t be salvaged, and is so tired he falls asleep at the table. A dozen women carry him up to a stateroom for his rest.\nJonathan wakes with a limp and goes to the nearby stream. Ann makes a strong sexual advance on him, forcing him back into a seat when he tries to get up and assuring him that the other women won’t return until lunch. Billy interrupts them, and the rest of the women are lined up behind her. Ann bears her spear and claims that Jonathan is hers because she found him. Jonathan runs back to his shipwreck and finds a group of three men from the Interstellar Cosmography Society examining the asteroid. Doctor Boynton says Jonathan is lucky they saw his wreck, but Jonathan insists he does not want to be rescued. They think he has gone mad. Jonathan tells them to send a freighter back to the asteroid in three years when it crosses into the shipping lane again to pick up his load of tobacco. He grabs tools, tobacco seeds and cigarettes, and heads back to the women’s camp."
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "6",
                "uid": "b314441a9fe34e50bce117ac766f30ca",
                "response_text": "The Happy Castaway by Robert E. McDowell takes place during the year 3372 on an asteroid between Mars and Jupiter. The asteroid is mostly prairie and sprawling plains, but there are also foothills and steep mountains. In the mountains, there is also a mountain emitting white smoke. The centaurs, the Natives on the asteroid, live in the prairie and plains, as they are unable to successfully travel through the hills and mountains. The stranded women live beyond the mountains, where the centaurs can’t reach them, and have transformed the wreckage of their ship into a livable base. There is a grand table and weighted chairs to serve food at, a kitchen supposedly where they can cook the food they’ve hunted and foraged, as well as areas to sleep. \nThere are rivers that run through the asteroid teeming with fish. Ann caught a rabbit-like creature, so there are other creatures to be hunted. \n"
              },
              {
                "worker_id": "2",
                "uid": "02f80b7a2e844eb98affffe241ba1c14",
                "response_text": "The story takes place in 3372 on an asteroid where a flight of girls was stranded three years earlier after their ship went down. The ship's remains are still there, and the girls use it for living quarters. The asteroid is rich with flora and fauna and a variety of landforms. It has grassy meadows, foothills, chains of mountains, a volcano, and a brook. There are ravines and hills, canyons, and valleys. There are small furry animals, much like rabbits, that the girls catch to eat and large centaurs that the girls have developed a healthy fear of. Jonathan refers to the women on the planet as amazons because they are so strong, but then he also learns that the pull of gravity is 30 times less than that of Earth, so the women can lift and carry his easily. The women are eager to be rescued but equally eager for a man’s attention. They flirt with Jonathan shamelessly, each trying to gain his attention. They have established a bit of social order; it appears that Billy is their leader. She reigns in the girls when they become too competitive over Jonathan. The women wait on Jonathan hand and foot, each eager for time alone with him. "
              },
              {
                "worker_id": "8",
                "uid": "5204eddd8ba449b1bdf2851c59c477e0",
                "response_text": "The story takes place in the year 3372 on an asteroid somewhere between Mars and Jupiter. Jonathan works as a pilot for a company called Universal delivering seeds to planets like Jupiter, which has a colony and a Food-growers Association. Jonathan crash-lands in a vast prairie, which stretches a mile past the crash site to a range of jagged foothills leading up to a chain of mountains. Within this chain, Jonathan sees a puff of smoke issuing from the top of a cone-shaped peak indicating the presence of a volcano. The asteroid is home to centaurs, which appear to be hostile towards humans. When Ann and Jonathan run away from the centaurs, they escape to a small ravine leading into the hills. As they make their way through the ravine, it deepens into a canyon then further into a gorge with walls towering on either side of them. On the floor of the canyon grow yellow, fern-like plants. After the women capture Jonathan, they march him back to camp by way of a narrow ledge climbing the canyon wall which comes to rest at a high ridge overlooking the prairie. Because the asteroid has less gravity than Earth, the women are thirty times as stronger than normal. Their encampment is at the head of a deep valley beyond the canyon's ridge where a tree-flanked stream flows next to their crashed space liner. Inside the space liner is a massive dining area with a long meturilium table at its center sitting atop a green fiberon carpet. It reminds Jonathan of the \"fabulous barbarian past.\""
              },
              {
                "worker_id": "10",
                "uid": "67dfc2e71eaf49529485334c18ef17b5",
                "response_text": "In the year 3372, humans have colonized other planets in the solar system, and there is interplanetary transport to support the colonists. Asteroids can be dangerous in the shipping lanes, as the main character, Jonathan Fawkes, finds out when he crashes into one on his way to deliver seeds and other supplies to Jupiter.\nThe asteroid contains prairies, jagged foothills, a chain of mountains, a fuming volcano and deep valley gorges and streams. Dangerous Centaurs that are half man and half horse roam the prairie in herds. There is a ravine nearby to Jonathan’s crash site that opens into a wide gorge with high walls that tower on both sides. Yellow fern-like plants grow within the canyon. The 27 stranded women camp about four miles away from where Jonathan crash lands. They camp in their wrecked ship which has a stream close by to it. There is small game to eat like the furry creature that Ann spears and ties off to her belt. They still use the dining hall on the ship for their meals, and go out daily to hunt, fish, and forage for fruits and berries. \nThe asteroid will cross the interplanetary shipping lane every three years in its orbit, meaning that every three years there is a chance they may come into contact with transport ships again. This creates a sense of pioneering prosperity for Johnathan who decides he wants to live with the 27 women on the asteroid and use the fertile land to grow tobacco and then sell it every three years when a freight ship comes by.\n"
              }
            ]
          },
          {
            "question_text": "Who is Ann Clotilde, and what happens to her throughout the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "6",
                "uid": "b314441a9fe34e50bce117ac766f30ca",
                "response_text": "Ann Clotilde is one of the 27 women who crashed into the asteroid on their way to Jupiter and survived. She has blonde hair and a cute, button nose. She wears sandals and a frayed blue frock. She finds Jonathan Fawkes after he crashes during one of her hunting expeditions. She walked to him to see if he was dead or not but soon rescues him from the oncoming horde of centaurs. She quickly spears a rabbit-like creature and attaches it to her belt. She takes him down when he attempts to escape, proving her Amazonian strength. The other girls come when they see her and fawn over Jonathan as well. Together, they half-carry, half-drag him back to their ship, where they feed him. The next day, Ann meets him beneath a tree and essentially throws herself at him. He receives her gladly, but they soon stop when they are caught by the others. Jonathan runs off, leaving Ann behind. "
              },
              {
                "worker_id": "2",
                "uid": "02f80b7a2e844eb98affffe241ba1c14",
                "response_text": "Ann Clotilde is the woman who discovered Jonathan and his wrecked ship. At first, she worries that Jonathan is dead, but then he regains consciousness. She helps him up and then explains where he is to the best of her ability. The 27 women believe they are on an asteroid. They crash-landed there three years ago and have been waiting for a man to come to rescue them ever since. Ann saves Jonathan from the centaurs, telling him what they are and leading him away from them to save his life. She has excellent hunting skills, easily spearing a small rodent they pass on the trail. When Jonathan wants to go back to his ship for his cartons of cigarettes, she calls on some other girls to help her stop him, all of whom are thrilled to see a man. To prevent him from escaping, they bind his hands and feet and half-carry him to their camp. Ann believes that Jonathan should belong to her since she found him first. When she finds him alone and comes onto him, she assures Jonathan that they are completely alone. But after he groans from pain but claims he isn’t hurt too badly, Billy and all the other women come out of the woods, pleased that he is okay. Ann claims that Jonathan belongs to her while other women complain and argue they should all share him. When Jonathan states he should have a say in it, Billy tells him he doesn’t and has to do what they say. Jonathan turns and runs for his ship to retrieve his cigarettes."
              },
              {
                "worker_id": "8",
                "uid": "5204eddd8ba449b1bdf2851c59c477e0",
                "response_text": "Ann Clotilde is one of the twenty-seven survivors of a crashed space liner that had been enlisted by the Jupiter Food-growers Association to transport wives for the colonists on Jupiter. Ann and her fellow survivors have lived on the asteroid for three years, waiting for someone to come rescue them, but they have also adjusted quite well and spend their days hunting, gathering berries and fruit, and attending to various chores around the encampment. Thanks to the low gravity on the asteroid, the women have magnified their strength, enabling them to hold their own against the centaurs and capture Jonathan without any problems. Ann is out hunting when she stumbles upon Jonathan, and she believes he is dead. She has bright, yellow hair and wears a ragged blue frock and sandals. She is curious about Jonathan and invites him back to her encampment. Along the way, she helps him escape from a herd of hostile centaurs, but she threatens him with a spear when he wants to return to the ship to get his cigarettes. Later, Ann joins the rest of the women in flirting with Jonathan because it has been several years since any of them has seen a man, and they all find Jonathan to be attractive. In fact, Ann flirts the most forwardly, and Jonathan seems intrigued by her offer until they are stopped by the rest of the women who wish to fight for him."
              },
              {
                "worker_id": "10",
                "uid": "67dfc2e71eaf49529485334c18ef17b5",
                "response_text": "Ann Clotilde is one of twenty-seven women who survived a shipwreck on an asteroid while on their way to Jupiter to become the wives of the colonists there. She has bright yellow hair, an attractive nose, and wears a blue frock and sandals. She discovers Jonathan and his wrecked ship while she is out hunting, and is surprised that he is alive. She forces him to come back to their camp with him, but he takes her spear and tries to escape. Ann cries for the women who find them to help her stop him, and they successfully capture him and tie him up. On their way back to camp, Ann has to rescue Jonathan from falling off the edge of a cliff by grabbing the scruff of his neck. Ann partakes in throwing rocks and yelling at Centaurs on the prairie below along their way. After Ann and the other women invite Jonathan to eat with them in the dining hall of their wrecked ship, they carry him to a stateroom to rest. The next morning, after Johnathan has been fed a slept in the women’s camp, Ann comes upon Jonathan in the stream and makes a forceful sexual advance on him. They are found by all the other women, and Ann tries to fend them off by wielding her spear and telling them that she found him and she gets to have him.\n"
              }
            ]
          },
          {
            "question_text": "What happened to the 27 women stuck on the asteroid?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "6",
                "uid": "b314441a9fe34e50bce117ac766f30ca",
                "response_text": "The Jupiter Food-growers Association enlisted many women to travel out to the colonies to serve as wives and promote happiness as well as breed a new generation. However, on their way to Jupiter, their spaceship crashed into an asteroid, and only 27 of the women survived. In the three years since the crash, these women have learned to hunt, forage, and defend themselves against the native species there, Centaurs. They developed a society based on sharing and generosity, shown through their individual chores that all serve the greater good. However, the two things they wished for were a rescue mission or a man. When Jonathan Fawkes arrived, their second wish came true. After they all met him, they each complimented him incessantly and offered him more food, drinks, and other sweet amenities. Being the first man they’d seen in over three years, he was quite the rarity. "
              },
              {
                "worker_id": "2",
                "uid": "02f80b7a2e844eb98affffe241ba1c14",
                "response_text": "The 27 women stuck on the asteroid have been stranded there for three years. They were on a ship bound for the Food-growers Association on Jupiter to become wives for the colonists but crash-landed on the asteroid. Some of the women did not survive, but those who did have learned to fend for themselves. Their only hope of leaving the asteroid is if a man comes and takes them away. When Ann discovers Jonathan, all the women are interested in him and want to “win” him for themselves. They flirt shamelessly and help him, treating him almost like a princess. The women have learned to fend for themselves, hunt their food, and become quite strong. Jonathan thinks of them as amazons. Of course, the gravity on the asteroid is about thirty times weaker than that of Earth, which helps the women carry Jonathan when they tie him up to prevent him from getting away. They are so excited and desperate to see a man, they will do anything to prevent him from leaving. Their main wish is to be rescued, but the next best thing to being rescued is to have a man among them."
              },
              {
                "worker_id": "8",
                "uid": "5204eddd8ba449b1bdf2851c59c477e0",
                "response_text": "Originally, the women were part of a larger group that had been enlisted by the Jupiter Food-growers Association to journey to the colonies on Jupiter to become wives for the colonists. Before they reached their destination, they crash-landed on the same asteroid that Jonathan would crash on three years later. During those three years, the twenty-seven survivors turned their crash site into a livable encampment. Lucky for them, they had crashed in a deep valley near a stream and plenty of trees. Because of the lush foliage, they are able to collect an ample supply of fruits and berries, and there is plenty of wildlife to hunt including rabbits. As a result of the low gravity, the women's strength has magnified thirty times, so they are able to easily defend against the centaurs and provide for themselves. Although they are hoping to be rescued, they seem generally content in the makeshift society they have built together. The only thing they mention missing is the presence of a man, so when Jonathan arrives, they all fight over his personal attention."
              },
              {
                "worker_id": "10",
                "uid": "67dfc2e71eaf49529485334c18ef17b5",
                "response_text": "Twenty-seven women survived a shipwreck on an asteroid while on their way to Jupiter to become the wives of the colonists there. They have been successfully living on the asteroid for three years, and hunt and gather the plentiful resources the land has to sustain themselves. They have to fight or evade dangerous Centaurs that are half man and half horse while they are out hunting, which they do by throwing rocks and yelling at them. They camp next to a stream in their wrecked ship, using the dining hall and staterooms for eating and living quarters. Jonathan finds them to be powerful and athletic, and frequently refers to them as Amazons. Many of them make forceful sexual advances on Jonathan, and they compete amongst themselves for his attention.\nWhen the asteroid orbits through the interplanetary shipping lane every three years, they become more likely to be rescued. When Jonathan intercepts Doctor Boynton and his two colleagues from the Interstellar Cosmography Society who have been commissioned to examine the asteroid, he tells them emphatically that he does not wish to be rescued. He would only like for them to send a freighter back in another three years to pick up the load of tobacco that he plans to grow with the seeds in the cargo of his shipwreck. The implication of what Jonathan has decided is that the twenty seven women will also likely remain on the asteroid for at least three more years because Jonathan has turned away their chance at being rescued.\n"
              }
            ]
          },
          {
            "question_text": "What transformation does Jonathan Fawkes undergo throughout the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "6",
                "uid": "b314441a9fe34e50bce117ac766f30ca",
                "response_text": "At first, Jonathan Fawkes claims that he is most uncomfortable around women. Despite being a galavanting spaceman known around the universe for his strength and bravery, he is in awe and possibly fearful only of women. When he first arrives on the asteroid and encounters Ann, he is immensely uncomfortable with her gaze on him, and that continues as he discovers that she can overpower him in his weakened state quite easily. As the rest of the stranded women arrive, they all ogle at him and tell him how incredibly handsome he is. This only makes him even more uncomfortable. \nHowever, by the end of the story, he wraps his arms around Ann and would have embraced her had they not been caught by the others. The rest of the women vie for his attention, and he runs off back to his spaceship. At first, the reader might think it’s because he needs to get away from the girls or that he can’t handle the pressure. However, his encounter with the potential rescuers proves that he is now far more comfortable around the women. He ran back to his spaceship to grab his cigarettes and tobacco seeds. He always planned to return to the women and does not tell the rescuers about them. \nAlthough at first, he was terrified of the girls, by the end he too is infatuated and loves the situation at hand. \n"
              },
              {
                "worker_id": "2",
                "uid": "02f80b7a2e844eb98affffe241ba1c14",
                "response_text": "Jonathan undergoes a complete role reversal with the women on the asteroid. At first, Jonathan is rather uncomfortable at all the attention the 27 women pay him. He isn’t accustomed to women openly flirting with him, being possessive of him, or being the center of their attention. He also isn’t accustomed to women having control over him. When he wants to go back to his ship for his cartons of cigarettes and Ann tries to stop him, he tries to thwart her physically. But when other women join them and Ann explains what is happening, the women gang up together, tackle him, tie him up, and carry him to prevent him from going. As a big, rangy, tough man, he feels completely humiliated for the women to have the upper hand over him. The humiliation continues when he starts to slide over the edge of the narrow ledge, and the women save him and tie a rope around his waist like he’s a baby on a leash. The women talk openly to him about his physical attractiveness and invite him to join them in private activities. The whole scene is much like what single women experience when they are in a group of men, and Jonathan doesn’t know what to make of it. As the object of their attention, he finds he has no say in what they plan to do with him when Ann claims he belongs to her since she found him and others say they should all share him. However, when the men from the Interstellar Cosmography Society find Jonathan’s ship and meet him, offering to take him with them, he tells them he has decided he likes it on the asteroid and will be staying there to raise tobacco. He doesn’t mention the 27 women because he has decided that he likes the center of their attention.\n"
              },
              {
                "worker_id": "8",
                "uid": "5204eddd8ba449b1bdf2851c59c477e0",
                "response_text": "When Jonathan first meets Ann Clotilde, he feels a little embarrassed and uncomfortable because being around beautiful women makes him feel awkward and nervous. He follows Ann back to the encampment because he is injured and unfamiliar with the environment of the asteroid. Jonathan is a tall and large man, but the women easily apprehend him, which makes him sulk. His sulking leads to him nearly falling off the cliff, and the women have to save him. He feels even more uncomfortable when he arrives at the encampment and meets the rest of the twenty-seven survivors of the crash. They are all beautiful women--he calls them Amazons--and they flirt with him incessantly calling him handsome and attractive. Unsure of their true intentions with him, Jonathan walks around the encampment with an exaggerated limp, hoping to garner their sympathy. As he does this, Ann corners him, and suddenly he feels a desire to flirt with her back until all of the women arrive and want to fight for his attention. Jonathan escapes back to his ship to get his cigarettes and finds a cosmography society there to survey the asteroid. They offer him a ride home, but he decides he wants to stay. Before, Jonathan wanted to escape from the women, but now he realizes he is happy there and wants to return."
              },
              {
                "worker_id": "10",
                "uid": "67dfc2e71eaf49529485334c18ef17b5",
                "response_text": "Jonathan Fawkes is a space pilot with Universal, known in the interplanetary transport business as a man to leave alone. He thinks of himself as big and tough, and over the years he has picked up three broken noses and had a scar on his left cheek from a bar brawl. When the women capture him and tie him up to take him to their camp he says he has never been so humiliated in his life. He feels intimidated and scared by the sexual advances of the women, especially one named Olga, and wishes he could run away or retreat on several occasions.\nA transformation occurs when he is approached by Ann in the stream the morning after he sleeps at the women’s camp. He switches from trying to escape to succumbing to her sexual advance. When the other women discover them together and Ann uses her spear to try to defend her claim over him, he runs back to his ship. However, he is only running back to his ship to gather supplies like tools, tobacco seeds from the cargo he was supposed to be delivering when he shipwrecked, and cigarettes. Even with the offer to go home from Doctor Boynton and his two colleagues from the Interstellar Cosmography Society who land on the asteroid and find his wreck, he decides that he will stay here with the women. They think he has lost his mind, but Jonathan sees an opportunity for himself now to live on the asteroid with the women and farm tobacco that he can sell to passing freighters in another three years when the orbit will cross the interplanetary shipping lane again.\n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4371,
        "document_length_chars": 24920
      }
    }
  ]
}