{
  "item_metadata": {
    "item_id": "63419",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63419",
      "content": "DEATH STAR\n \n\n By TOM PACE\n \n \n Trapped by the most feared of space pirates Devil Garrett, Starrett Blade was fighting for his life. Weaponless, his ship gone, he was pinning his hopes on a girl—who wanted him dead.\n \n [Transcriber's Note: This etext was produced from Planet Stories Spring 1945. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Starrett Blade crouched in the rocks by the tiny Centaurian lake. It was only about two or three hundred feet across, but probably thousands of feet deep. This lake, and hundreds of others like it, were the only things to break the monotony of the flat, rocky surface of Alpha Centauri III—called the most barren planet in space.\n \n Ten minutes ago, Star Blade's ship had spun into the stagnant waters before him. An emergency release had flung the air-lock doors open, and the air pressure had flung Star out. And now he was waiting for Devil Garrett to come down to the water's edge to search for him.\n \n For eight years, Devil Garrett had been the top space pirate in the void. For a year, Star himself had personally been hunting him. And on a tour over Alpha III, a Barden energy-beam had stabbed up at Blade's ship, and Star Blade had crashed into the lake.\n \n That Barden Beam had Star worried and puzzled. It took a million volts of power for a split-second flash of the beam. Garrett didn't have an atomics plant on Alpha III—if he had, escaping rays would point it out, no matter how well it was camouflaged. There was no water power, for there was no running water. There were only the lakes ... and tidal power was out, for Alpha III had no moon.\n \n However, that could wait. Star slid the electron knife from his water-proof sheath, gripped it firmly. He could hear quick footsteps as a man came down the trail that led directly past his hiding place.\n \n It wasn't Garrett, which was disappointing. But it was one of his men, and he was heavily armed. That didn't worry Star.\n \n His fighting had earned Starrett Blade the nickname of \"Death Star.\"\n \n The man walked to the water's edge, and peered out over the pool. He saw the bubbles that were coming up from the sinking ship, and he nodded, grunted in satisfaction, and started to turn back.\n \n Star landed on him, knocking him sprawling on the rock. The pirate jerked up an arm, holding the jet-gun.\n \n The stabbing lance of blue fire cracked from the electron knife, dug into the man's heart.\n \n Star tossed the dead pirate's cloak over his shoulders, and thrust both electron blade and jet-gun into his belt. He straightened, and saw the leveled gun from the corner of his eye.\n \n He got the jet in his right hand, the knife in his left, and went into a dive that flipped him behind a rock. The three actions took only a split-second, and the blast from the jet-gun flaked rock where he had been standing.\n \n While a jet-gun is the most deadly weapon known, you have to press a loading stud to slide another blast-capsule into place. Death Star knew this very well. So he knew he was safe in coming up from behind the spur of stone to fire his own gun.\n \n If his reflexes hadn't been as quick as they were, he would have blasted the girl.\n \n \n\n \n He stopped, and stood for a second, staring at the girl. She was something to invite stares, too. In the moment that lasted between her next move, he had time to register that she was about five feet five tall, black-haired—the kind of black hair that looks like silken spun darkness—dark-eyed, and possessing both a face and a form that would make anyone stop and gulp.\n \n Then the moment of half-awed survey was over, and she leveled the jet on him, and said in a trembling voice, \"Drop those weapons, or I'll blast you ... pirate !\"\n \n Death Star said, \"That jet-gun is empty. I can see the register on the magazine. And I'm not a pirate. I'm Starrett Blade.\"\n \n The useless jet-gun slid out of the girl's hand, and she gave a half-gasp. \"Starrett Blade! I—I don't believe ...\" she broke off abruptly. \"So you're Death Star! A fine story for a hired killer, a pirate.\"\n \n Star reddened. \"Look,\" he snapped, \"I don't know who's been talking to you, but ...\" he whirled, and his hand whipped the jet-gun from his belt. As he did so, the girl jerked up the jet-gun she had dropped, and flung it with all her strength. The blow landed on his arm and side, and paralyzed him long enough for the man who had leaped out behind him to land a stunning blow against his head. As Star went down, he dizzily cursed himself for becoming interested in the argument with the girl, so that he did not heed his reflexes in time ... and dimly, he wondered why it had seemed so important to convince the lovely dark-haired girl.\n \n Then a bit of the cosmos seemed to fall on Star's head, and he was hurled into blackness.\n \n An eternity seemed to pass.\n \n Deep in the blackness, a light was born. It leaped toward him, a far-away comet rocketing along, coming from some far, unknown corner of the galaxy. It became a flaming sun in a gray-green space, and strangely, there seemed to be several odd planets circling about the sun. Some of them were vast pieces of queer electronic machinery. Some were vague, villainous-looking men. One was the dark-haired girl, and there was lovely contempt in her dark-star pools of eyes.\n \n Then into the midst of this queer universe, there swam a new planet. It was the face of a man, and the man was Devil Garrett.\n \n That brought Star up, out of his daze, onto his feet as though he had been doused with cold water. He stood there, not staring, just looking at Garrett.\n \n The most famous killer in the void was big. He was six feet three, and twice as strong as he looked. He wore a huge high-velocity jet-gun, and a set of electron knives, all of the finest workmanship. He was sitting on a laboratory chair of steel, and the chair bent slightly under his great weight.\n \n He smiled at Star, and there was a touch of hell in the smile. He said,\n\"Ah, Mr. Garrett.\"\n \n Star's jaw dropped. \"Garrett? What do you—\" he broke off. A glance at the girl told him what the purpose was.\n \n \"Look, Mr. Devil Garrett,\" said the pirate, still smiling softly, \"Miss Hinton is aware of your identity. There is no need to attempt to fool us.... I've known it was you ever since I flashed that beam at your ship. And you needn't flatter yourself that the Devil's luck is going to hold out as far as you are concerned. For in a very short while, I'm going to have you executed ... before a stellar vision screen, connected with Section Void Headquarters! I wish the authorities to see Devil Garrett die, so that I might collect the reward that is offered on you!\"\n \n Star stood quiet, and looked straight into Garrett's eyes. After a minute of silence, Garrett's lips twisted into a smile, and he said mockingly, \"Well, pirate? What are you thinking of?\"\n \n Star said, in a low, cold voice, \"I'm thinking of putting an electron fire-blade into your face, Devil Garrett!\"\n \n Garrett laughed ... huge, rather evil, bluff laughter. The mirth of a person who is both powerful and dangerous. And then the girl leaped forward, shaking with rage.\n \n \"You beast! Murderer! To accuse this man ... you fool, you might have been able to complete any scheme of escape you had, if you hadn't called yourself Starrett Blade! Mr. Blade....\" She gestured toward Garrett, who made a mocking, sardonic bow. \"... has given me ample proof that he is who he says! And this long before you came. He's shown me papers giving a description and showing a tri-dimension picture of you....\"\n \n Fire leaped in Star's eyes. \"Listen ...\" he snapped furiously, as he started to step forward. Then Garrett made a signal with his hand, and someone drove a fist against the base of Star's skull.\n \n \n\n \n When Star came to, he was in a cell of sorts. A man standing by the door told him that he was to be executed, \"... after Mr. Blade and the lady have eaten.\" Starrett swore at him, and the man went out, with a mocking \"Goodbye, Mr. Garrett!\"\n \n Star got up. His head spun, and he almost fell at first, but the daze left in his head from the two blows quickly cleared away. He felt for various weapons which he had hidden about him ... and found them gone. Garrett's men had searched carefully.\n \n Star sat down, his head spinning more now from mystery than from physical pain. He had to keep himself in a whole skin, of course. That was most important right now. But other things were bothering him, tugging at his mind like waves slapping around a swamped ship, each trying to shove it in a different direction.\n \n There was the girl. Star wondered why she always leaped into his mind first. And there was the way Garrett was trying to leave the impression that he was Blade, so that he could kill Blade as Garrett.\n \n Obviously, the reason for that was the girl, Miss Hinton, Garrett had called her. She had been shown faked papers by Garrett, papers proving that the two were ... were whatever Garrett had twisted the story into!\n \n Star clutched at his head. He was in a mess. He was going to be killed, and he was going to die without knowing the score. And he didn't like that. Nor did he like dying as Star Blade shouldn't die; executed as a \"wolf's-head\" pirate. The girl would be watching, and he felt as if that would make it far worse.\n \n His head came up, and he smiled flintily. He still had an ace card! One hand felt for it, and he shook his head slowly. It was a gamble ... but all the others had been found.\n \n Blade looked up quickly, as the door opened. Two men came into the cell, carrying jet-guns. They motioned Blade to his feet. \"Come on, Blade.\" One began, when the other hit him across the mouth.\n \n \"You fool!\" he hissed. \"You better not call him that; suppose that girl was to hear it? Until the boss gets what he wants on Earth, that girl has got to think that he's Blade! We're killing this guy as Devil Garrett! And a loud-mouthed fool like you ... look out!\"\n \n Blade had landed on the bickering men, and was grappling with the one who had called him by name. As the other leaped forward, swinging a clubbing blow with a jet-gun, Star tripped one man into the corner, and ducked under the gun. He hit the man in the stomach, drove a shoulder up under his arms, and smashed the man's face in with a series of sharp blows. The man went reeling backward across the room, and Star's hand leaped toward that \"ace card\" which he still held.\n \n Devil Garrett stepped in the door, and made a mock out of a courteous bow. As he did so, Star snarled in rage, but stood very still, for the electron knife in Garrett's hand did not waver.\n \n Garrett gestured silently toward the door, and Star, equally silent, walked over and out, at the point of the weapon.\n \n \n\n \n Star Blade stood before a transmitter, and thought about death.\n \n He was very close to it. Garrett stood five yards away, a gun in his hand, and the muzzle trained on Blade's chest. The gun was the universally used weapon of execution, an old projectile-firing weapon.\n \n Star did not doubt that Devil Garrett was an excellent shot with it.\n \n The girl, very round-eyed and nervous, sat by Garrett. He had explained to her that Garrett was the type of pirate that it is law to kill, or have executed, by anyone. Which was very true.\n \n A man stepped away from the transmitter, and nodded to Garrett. Star felt a surge of hope, as he saw that it was a two-way transmitter. If the image of an Interstellar Command headquarters was tuned in—Garrett would undoubtedly do it, if only to show the police that he had killed Starrett Blade—then Garrett could not kill him and cut the beam in time to prevent one of the police from giving a cry that would echo over the sub-space beam arriving almost instantly in this room, and let the girl know that she had been tricked. And Garrett would not want that. Not that it would matter to Starrett Blade.\n \n Then Star saw what kind of a transmitter it was, and he groaned. It was not a Hineson Sub-space beamer ... it was an old-style transmitter which had different wave speeds, because of the different space-bridger units in it.\n \n The visual image would arrive many seconds before the sound did. Thus the girl would not hear Garrett revealed, but would see only Blade's death. And then ... whatever Garrett had planned, Blade wished heartily that he could have the chance to interfere.\n \n The beam was coming in. Star saw the mists swimming on the screen change, solidify into a figure ... the figure of District Commander Weddel seated at a desk. He saw Weddel's eyebrows rise, saw his lips move—then Garrett stepped over a pace, and Weddel saw him, saw the gun in his hand....\n \n The police officer yelled, silently, and came to his feet, an expression of shocked surprise on his face—surprise, Blade thought desperately, that the girl might interpret as shock at seeing Devil Garrett.\n \n Which was right, in a way.\n \n Then, as Commander Weddel leapt to his feet, as Devil Garrett's finger tightened on the trigger, as the girl sucked in her breath involuntarily, Star Blade scooped up a bit of metal—a fork—and flung it at the vision transmitter.\n \n Not at the screen. But at the equipment behind the dial-board. At a certain small unit, which was almost covered by wires and braces for the large tubes. And the fork struck it, bit deep, and caused result.\n \n Result in the form of a burned-out set. If television equipment can curse, that set cursed them. Its spitting of sparks and blue electric flame mingled with a strange, high-pitched whine.\n \n It was the diversion that caused Garrett to miss Star, which gave him time to pull three or four of Garrett's men onto the floor with him. One of the men drove the butt of a jet-gun into the side of Star's head, and for the third time, he went very limp. The last thing he saw was the girl.\n \n Somehow, the expression on her face was different from what it had been. He was searching for the difference, when the blow struck him. Somewhere in the space that lies between consciousness and unconsciousness, he reflected bitterly that if he kept staring at the girl when he should be fighting, he might not recover some day. This was the third time that he had been knocked out that way. It was not getting monotonous. He still felt it a novelty.\n \n Star awoke in the same prison cell, facing the wall away from the door. He wondered if he were still alive, tried to move his head, and decided that he wasn't. He didn't even get up or look around when he dimly heard the door being opened.\n \n But when he heard the girl's voice, he came up and around very swiftly, despite his head.\n \n It was the girl all right. Even through the tumbled mists of his brain, he could see that she was not a dream. And as he reeled and fell against the wall, she was beside him in a flash, her arm supporting him.\n \n \n\n \n At first he tried to push himself erect, his head whirling with sick dizziness, and bewilderment. Through a twisting haze, he peered up at the girl's face. It reflected a look that, amazingly, was one of—with no other phrase to do—compassion. Star half-sighed, and laid his head on the girl's breast, and closed his eyes.\n \n In a minute or two, she said tensely, \"Are you all right?\" Star looked up at her.\n \n \"I guess so. Here—give a hand while I get my balance.\" She held him as he tried a step or two, and then he straightened. \"I guess I'll be all right, now,\" he smiled. \"My head feels like—say! How come you're doing this? What made you change your mind? And who are you?\"\n \n She said quickly, breathlessly, \"I know you're Star Blade, now. That transmission set.... I can read lips! I knew what that officer was saying! It was just as if I had heard him say that ... that you were Starrett Blade and that man out there is Devil Garrett!\" she made a choking sound. \"And I've been here, alone, for a month! For a month!\"\n \n \"A month? Huh—please—you...?\"\n \n Star took a breath, and started over. \"You.... Who are you? What are you doing here?\"\n \n She said, \"I'm Anne Hinton. My father is Old John Hinton. Have you heard of him?\"\n \n \"Of course!\" said Star. \"He manufactures most of the equipment ' Blade Cosmian ' uses. Weapons, Hineson Sub-Spacers, Star-Traveler craft ... the ship I was in when Garrett brought me down was a Hinton craft. I should have recognized the name. But go on. What—\"\n \n \"Garrett communicated with dad, secretly. He posed as Starrett Blade, as you, and told dad that he was developing certain new power processes. And he is! He has a new—or maybe it isn't so new—way of electrolyzing water to liberate hydrogen and oxygen.\"\n \n \"I think I understand,\" said Star quickly. \"When the oxygen and hydrogen are allowed to combine, and produce an explosion which drive a turbine-generator. Then that could be hitched up to a cyclotron, and even the most barren of Alpha's lake-rock planets could be....\"\n \n \"No,\" she shook her head puzzledly. \"It's just electric power. He said that atomics would release stray rays that would attract pirates.\"\n \n \"I know,\" Star nodded, abstractedly. \"I was thinking of another application of it ... hmm. But say! What was Garrett after? I know that he wouldn't do this just to get a secret process sold. He must have had another plan behind it. Got any idea?\"\n \n Anne shook her head slowly. \"I don't know. I can't see....\"\n \n \"Perhaps I could help you?\" Devil Garrett asked smoothly from the door.\n \n Star whirled, thrust Anne behind him, but there was no way out. Garrett stood in the door, and there were men behind him. The jet in his hand could kill both of the two at one shot. And they had no weapons to resist with.\n \n Devil Garrett stepped them out of the room, and down the corridor, through a large door Star had noticed at the end of the passage, and into a huge room.\n \n It must have been a thousand feet long, and half that wide. It was at least a hundred yards deep. And it was almost filled with gigantic machines.\n \n Between the machinery, the spaces were almost filled with steel ladders and cat-walks. Crews of men swarmed over them. It was the largest mass of equipment Starrett had ever seen.\n \n His eyes began to pick out details. Those huge vat-like things down at the far end, with the large cables running into them, and the mighty pumps connected to them ... they were probably the electrolysis chambers.\n \n And those great pipes, they must carry the hydrogen and oxygen from the electro chambers to the large replicas of engines, which could be nothing else but the explosion chambers, where the gases were allowed to re-unite, and explode. And there by the giant engines, those must be turbines, which in turn connected with the vast-sized generators just under the platforms on which they stood.\n \n \n\n \n Star Blade whistled softly through his teeth. A huge enterprise! It could be ... but for a moment he had forgotten Devil Garrett.\n \n The girl standing by his side, Star turned toward Garrett. \"Well?\"\n \n Garrett smiled his mocking grin. \"You grasp the principle, of course. But let me show you ... you see those pipes that run from the turbines after the wheels?\"\n \n \"Yes. They carry the gases off. Where do they lead?\"\n \n \"Into giant subterranean caverns beneath the surface!\" Garrett said.\n\"Now look over there, on the platforms across from us. Can you recognize a Barden energy-beamer, Blade? Run by power from my little plant here, which is run by water from a thousand lakes!\n \n \"Just imagine, if you can, hundreds of those plants all over Alpha III. And each one with dozens of high-powered Barden beams to protect it! And Hinton ray screens to protect us from radio-controlled rocket shells from space, or Barden Rays, or any other weapon of offence, or to warn if anyone lands on this planet!\" Garrett leaned forward, his eyes aglow.\n \n \"Blade, I'll take over the few governing posts on this little planet, and I'll rule an entire world, a whole planet to myself! It'll be the first time in history! And it won't be the last. With the Hinton secret patents, the plans of all John Hinton's inventions and processes....\"\n \n Star twisted, and got his \"ace card\" out of its hiding place.\n \n It was a jet weapon, little more than a jet-blast capsule for a jet-gun. The sides were thicker and stronger, and there was a device fixed on it so it could be fired. Altogether, it was somewhat smaller than an old-style fountain pen.\n \n He twisted up from the floor, and moved faster than he had moved ever before. Star was famous for his speed and the quickness and alertness of his reflexes. He earned his fame a score of times over in that one instant.\n \n \n\n \n And Devil Garrett died.\n \n There was perhaps an eighth of a second between the staff of blue white fire from the tiny jet in Star's hand and the huge broadsword of fire from Garrett's gun. But in the split-second Star's fire knifed into Garrett's vitals, and Garrett gave a convulsive jerk, and fired even as his muscles started the jerking movement.\n \n And the flame went over Star's head, singeing his scalp.\n \n Of the four men with Garrett, one let go of the struggling Anne, and swore as he snatched at an electron knife in his belt. Anne's hand had already whipped the knife out, and without bothering to press the electron stud, she buried the knife in his back.\n \n Two of the remaining men whirled, and went for the door as though a devil was after them. The other tried to get a jet-gun out. It was his final mistake. A blue lance from Anne's knife whipped close enough to him to make him dodge, and then Star got his hand on Garrett's jet.\n \n The other two men had, in their flight, taken a door which led, not into the large corridor, but into a small room at one side, a room filled with instruments and recording devices for the machinery in the room below. Star leaped to the side of the door, and called, \"Are you going to come out, or am I coming in to get you?\"\n \n There was a short silence, in which Anne heard one say hoarsely, \"He can't get us ... we could get him if he came in the door.\"\n \n \"Oh, yes?\" was the answer. \"Do you know who that guy is? He's the one they call 'Death Star.' I'm not facing Starrett Blade in a gun fight. You can do what you like, but I'm leaving.\" Then he lifted his voice.\n\"Hey, Blade! I'm coming out. Don't shoot.\"\n \n \n\n \n \"Okay,\" threw back Star and the man appeared in the doorway, empty hands held high. After a second, the other joined him.\n \n Anne turned to Star. \"Now I know why they call you 'Death Star' Blade,\" she said, and gestured toward the men who had surrendered, and the two whom Starrett had shot down.\n \n He mused there for a minute. Then Anne broke the silence with, \"Star, what are we going to do now? Garrett's men will be up here in a little while. We can't get to a sub-space beam. What are we going to do when they come up to investigate?\"\n \n Starrett Blade laughed. \"Do? Well, we could turn them over to Commander Weddel!\"\n \n \" What? \"\n \n Grinning broadly, Star pointed, with a flourish, at the door. Anne spun about, and found Commander Weddel grinning in the door from the corridor.\n \n \"Very simple,\" said Star across the lounge to Anne. \"When I smashed the vision set with that dinner fork, I broke a small unit which is included in all sets. You know, a direction finder doesn't work, except in the liner-beam principle, in space, because of the diffusing effect of unrestricted cosmic rays.\"\n \n \"Yes, I knew that,\" said Anne. \"But how—\"\n \n Starrett grinned again. \"A type of beam has been found which it is impossible for cosmics to disturb. But you can't send messages on it, so it is made in a little unit on every set. If that unit is broken, the set automatically releases a signal beam. This is a distress signal, and the location of the set that sent out the signal is recorded at the Section Headquarters. When Commander Weddel saw me throw something at the set, and it went dead, he looked at the automatic record, and found out that a signal had been sent in from a location on Alpha Cen's third planet. Then he had a high-velocity cruiser brought out and dropped in, in time to pick up some pieces.\" He stopped, and idly toyed with a sheaf of papers, then held them up. \"See these papers?\"\n \n \"Uh-huh. What are they, Star?\"\n \n \"They are the main plans of Devil Garrett's power plant, and they're the one good thing he's ever done. These plans are going to bring the barren, rocky Centauri planets to life!\"\n \n He got up, and paced to the window, and stood there, looking out, and up through the plastic port. \"The planets of Centauri!\" he murmured softly. \"Seven circling Alpha alone. And all seven are barren, rocky, level except for the thousands of lakes ... lakes that are going to be the life of Centauri!\"\n \n \n\n \n He turned back to the window. \"And all because a pirate named Devil Garrett built a vast power plant to use to garner more power!\"\n \n \"You know, Anne, as a mockery, and a warning, I think I'll propose that this planet be officially named ... 'Garrett'!\"\n \n She looked up at him, and there was laughter bright in her eyes, and tugging at her mouth. \"Yes, there ought to be a reason,\" she murmured. Star wavered. She was so darn close.\n \n After a minute, she turned her head, and looked up at him. \"Star, how soon will there be those gardens and woods you described? I mean, how long before Garrett can be turned into that kind of world you described?\"\n \n \"Why ... under pressure, we can do it in six months. Why?\"\n \n \"Not half quick enough,\" she murmured happily, \"but it'll have to do, Star.\" Laughing, she turned her face up to his. \"Have you ever thought that planet Garrett will be wonderful for a honeymoon?\"",
      "metadata": {
        "title": "Death Star",
        "author": "Tom Pace",
        "passage_id": "63419",
        "uid": "6dfcc4fca9434de5b536abfe0d1fe067",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8ce5ebc33e514990b8441ed6551dd91b",
                "response_text": "The story starts with Starrett (Star) Blade’s ship falling into one of the lakes on Alpha Centauri III. We then learns that Currently Star is trying to hunt Devil Garrett down, but his ship was hit by an energy-beam shot by Garrett, who is the top space pirate for years. After he fell, he hopes that Garrett himself will come here to look for him, but only one of Garrett’s men appears and he is killed by Star. He also notices a person with another gun right after he murders that man. He almost kills this person as well, but is able to stop in time due to his strong reflex skills. The reason that he stopped is because she is a girl. She has beautiful dark colored hair and eyes. But she does not stop trying to capture him. Before he can explain himself, he is knocked out. \n\nWhen Star has finally waken up, he is already in a lab chair with Garrett is right in front of him. To his surprise, Garrett calls him Garrett, instead of Star. The girl clearly believes Garrett that Star is actually Garrett. However, again, before he can explain his situation to the girl, he is knocked out. Right after he wakes up, he learns that he will be executed. Then, he starts thinking of the girl again, but he does not really understand why he is thinking of her. Before he can do anything, he is taken from his cell. Standing 5 yards away from the gun that Garrett is holding, he tries to find a way that he could escape. He is glad to see that it is a two way transmitter, but loses his hope again when he realizes that it is an old-style transmitter. Then as the visual image started to form, Garrett is ready to perform the execution. Star cunningly kicks the metal fork onto the vision transmitter, which diverts Garrett’s attention, and causes him to miss the shot. But because he is outnumbered by Garrett’s men, he is caught and knocked out again. After he wake up, the girl finds him and tells him that she is capable of reading lips. Even though the visual images has no sound, she knows what the Section Void Headquarters said, and that he is the actual Star. \n\nGarrett enters the cell after he finds out that the girl knows the real identity of him and Star. So he brings them to a room filled with machines. He imagines to have hundreds of those on Alpha III and he will be able to rule an entire world. Then suddenly the girl takes Garrett’s weapon and Star is able to kill him very quickly. And Commander Weddel, getting the signal that Star tried to send using the metal fork, gets here just on time to capture Garrett’s men. "
              },
              {
                "worker_id": "102",
                "uid": "3cf32cad9ed149a48f43761ccf59ffbb",
                "response_text": "Starrett Blade’s ship has crashed into one of the deep stagnant lakes on the surface of Alpha Centauri III, struck down by a Barden energy beam fired by Devil Garrett, a space pirate. Star Blade, ejected to safety and now hiding by the lake, waits for Garrett to come for him. Meanwhile, he wonders about the source of the energy for the Barden Beam, as Garrett doesn’t have power plants on the planet, nor is there running water to generate hydroelectric power. Suddenly, Star notices one of Garrett’s soldiers and ambushes him. \nStar Blade, who has earned the nickname Death Star for his fighting prowess, dispatches his fist adversary, and soon after notices another: a beautiful, dark-haired woman. She confronts him, calling him a pirate. He dismisses this accusation, and asserts his identity, but she does not believe him. A brief fight ensues, but is quickly settled when Star is struck by another combatant.\nAs Star wakes in a cell, he is confronted by Devil Garrett’s face, Garrett’s underlings, and the dark-haired woman. Garrett, who has assumed Star Blade’s identity in order to trick the woman whom he calls Miss Hinton, announces that he will shortly execute Blade, whom he has tricked Hinton into believing is himself. \nStar is brought before a transmitter which only transmits images. As the live image of Commander Weddel, a police officer, appears on the screen, Garrett quickly throws a piece of metal at the transmitter’s dial board and disrupts the transmission. One of Garrett’s men renders Star unconscious. \nStar regains consciousness and finds Hinton in his cell. She reveals that, during the transmission, she was able to read Weddel’s lips and now believes that he is who he claims to be. She introduces herself to be Anne Hinton, daughter of a weapons manufacturer whom Garrett had secretly contacted while posing as Star. Anne tells Star that Garrett has discovered a method of electrolyzing water into its elemental constituents, which Star speculates to be a potential source of energy. \nSuddenly, Garrett enters the room and leads Anne and Star to a cavernous room at gunpoint. The room is full of vats and machinery, which Star concludes are the reaction vessels in which water is electrolyzed and the energy generated. Garrett reveals that his plan is to use his technology to construct many Barden Beams in order to take over the planet. \nStar removes an obscured weapon, and dispatches Devil Garrett. He quickly takes out two more pirates, before two more surrender. Commander Weddel appears, and Star reveals that his damaging the transmitter resulted in a distress signal being sent out.\nThe story concludes with Anna asking how soon the technology discovered by Garrett can be used to bring life to Alpha Centauri III, and her asking him if it would be a good place to honeymoon. \n"
              },
              {
                "worker_id": "101",
                "uid": "538a8b6acd3440569181f6d4a6319aa7",
                "response_text": "Starrett Blade, a fighter nicknamed \"Death Star\", has been on the hunt for Devil Garrett, the most dangerous and well-known space pirate. While flying over Alpha Centauri III, a barren and lifeless planet, Star's ship is shot down by a Barden beam, causing him to crash into a lake. Confused as to how such a powerful beam could have been shot on this planet, Star is met with one of Garrett's armed men. Star attacks the man and sees a girl, who he is perplexed by. The girl threatens him, and Star replies by explaining that he's not a pirate, but Death Star. The girl immediately attacks him, knocking him out. Star awakes in a room with the girl, some more men, and face to face with Devil Garrett. To his surprise, Garrett addresses him as the deadly pirate, and calls himself Starrett Blade. Star realizes that Garrett has attempted to swap identities with him, convincing the girl that Garrett was actually the one being captured. Garrett tells Star that he is to be executed, broadcasted to the authorities. Star is knocked out again, this time waking up in a cell and rid of all weapons except for his ace card. Two of Garrett's men enter the cell, and Star attempts to fight them both, which is successful, but his plan is cut short when Garrett steps into the room. Star is led to the execution site, where he stands by a transmitter with Garrett in front of him bearing a gun, the girl next to him. Star inspects the transmitter and realizes that there is a chance the authorities will be able to identify him as the true Star, hopeful that the girl will realize her mistake; however, he concludes that the transmitter's sound wave speed would not be fast enough for the message to come through. As Star faces execution, he flings a fork at the transmitter, damaging a unit of the machine and burning it out. This causes a distraction, and Star is attacked by Garrett's men and falls unconscious again, yet this time accompanied by the girl, who knows now of his true identity due to her ability to read lips on the transmitter. The girl reveals she is Anne Hinton, daughter of John Hinton, who manufactures space equipment. Garrett contacted John, disguising himself as Star to gain his support in crafting hundreds of power plants with Barden beams in order to gain control of the entire planet of Alpha III. Once Garrett reveals his plan, Star uses his ace card, which is a jet weapon, to kill him. Together, Anne and Star fight off Garrett's men, and Star reveals that when he flung the fork at the transmitter, it set off a signal attracting the authorities to their location. With that, Commander Weddel arrives and Garrett's men are turned over to him. Garrett's power plants are then used not for the objective to gain dangerous power, but to supply energy and life to the planet."
              },
              {
                "worker_id": "104",
                "uid": "dcf22942a64845ea8f5d611686c371f5",
                "response_text": "The story begins with Starrett’s Blade being destroyed and sinking in a body of water. He was able to save himself because of an emergency release that allowed him to be ejected from the air-locked doors. Star is attacked by a man but successfully kills the man with his electron knife. After he kills the man, he sees a girl that distracts him. While he is distracted, he is struck and beaten. When he wakes up after being beaten, he is standing in front of Garrett. Garrett pretends that he is actually Star, for the benefit of the girl, and pretends that Star is actually Garrett. Garret tells Star that he is going to be executed and puts Star into a prison cell.\n\nStar wakes up in his prison cell and is still concerned about what the girl thinks of him. Star fights against the two guards that come to get him from his cell. He stops fighting them when Garrett appears holding an electron knife, as Star sees that as a dangerous weapon. Star is guided towards the transmitter for his planned executive. However, Star thwarts the execution plans by throwing a metal fork at the transmitter which damages it. Again, he gets distracted because of the girl and is beaten. \n\nLater, the girl appears in his cell trying to help him. She tells him that she is Anne Hinton, the daughter of Old John Hinton. Start mentions that he is familiar with her father. Garrett finds the two trying to escape. He leads them down a long corridor and into an incredibly expansive room.  Garrett tells them his plan to control the world. Star remembers that he has another weapon at his disposal and uses it to kill Garrett. Anne and Star then go on to kill some of the guards. Commander Weddel shows up to Star’s delight after the Commander received a distress signal from the transmitter. Star is excited about Garrett’s power plant as he exclaims that it will bring life to the barren Centauri planets. \n"
              }
            ]
          },
          {
            "question_text": "Who is Garrett and what happens to him in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8ce5ebc33e514990b8441ed6551dd91b",
                "response_text": "Devil Garrett had been the top space pirate for many years, and Star is currently trying to hunt him down. We learn that Garrett has been secretly building machines on Alpha III which, if combine with Hinton ray screens, gives Garrett the power to rule the entire world. A month ago, Garrett captured Anne Hinton and started to pretend that he is Star. He was communicating with Anna’s father about new power processes. Then a month later, Star’s ship gets hit by the energy-beam. However, he survives after his ship fells into the lake, instead he is captured and Garrett wants to execute him. Luckily, he is able to divert Garret’s attention when he is shooting Star, leading him to miss it. Also, since the girl is able to read lips, she realizes that Garrett has been lying to her. She learns Garrett’s true identity as well as Star’s. In the end, as Garrett is showing them his great enterprise and explaining how he will be able to rule the world, he gets careless and Anna takes his weapon. Even though he tries to run, Star is quicker and has better reflexes. Without his weapons, Star easily had him killed."
              },
              {
                "worker_id": "102",
                "uid": "3cf32cad9ed149a48f43761ccf59ffbb",
                "response_text": "Devil Garrett is the top space pirate, and has been for eight years. Prior to the start of the story, Garrett fires a high-powered Barden energy beam at Starrett Blade’s ship, causing it to crash into a lake on the planet Alpha Centauri III. \nHe confronts the captured Star in the cell, alongside Anne Hinton, the woman responsible for subduing Star. Garrett has been posing as Star and accuses Star of being him, going so far as to forge documents in order to complete his deception of Anne. He plans on executing Star in front of a transmission to Commander Weddel, a police commander. However, the transmission is disrupted when Star throws a piece of metal at the dial board. Star is rendered unconscious once again and returned to his cell.\nAs Star awakens in his cell, Anna reveals that she no longer believes that Garrett is Star. Garrett suddenly enters the room, and, having been found out, leads Star and Anna away to a cavernous chamber housing industrial equipment. He reveals that he is able to hydrolyze water into oxygen and hydrogen, and recombine the two to form massive amounts of energy. Garrett plans on exploiting the vast lakes on Alpha Centauri III to perform these reactions, and to build multiple Barden beams which he will use to take over the planet. \nAs Garrett is revealing his plan however, Star unsheathes a hidden jet weapon and kills him. \n"
              },
              {
                "worker_id": "101",
                "uid": "538a8b6acd3440569181f6d4a6319aa7",
                "response_text": "Garrett is an infamous space pirate, wanted by the authorities at a high reward. He is being hunted by Starrett Blade. At the beginning of the story, Garrett shoots down Star's ship and captures him. He is able to convince Anne Hinton and her father that he is actually Starrett Blade, and that the man he captured is actually Garrett. Garrett plans to execute Star, and gets his men to place Star in a cell until then. Once it is time for execution, Garrett is diverted by Star's damage to the transmitter. He admits his plan to Star, confident in his ability to harness power over the planet, but is then killed by Star."
              },
              {
                "worker_id": "104",
                "uid": "dcf22942a64845ea8f5d611686c371f5",
                "response_text": "Devil Garrett was the number one space pirate for eight years in the void. He has hunted Starrett Blade for the past year. He was infamous because he was a killer. He stood tall at six feet three inches and had incredible strength. He used a high-velocity jet-gun and a set of electron knives as his weapons. \n\nGarrett has Star Blade captured and brought to him. He pretends to the girl on the planet that he is Star Blade and that Star Blade is actually Garrett. He imprisons Star to prevent him from ruining his plans. He tells the real Star that he will be executed. Garrett takes Star on a tour to show him the work that he is accomplishing. He tells Star that he plans to rule the entire world with his work. As he is detailing his plan to Star, Star pulls out a weapon and kills Garrett. As Garrett is dying, he fires his jet-gun at Star but does not kill Star. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8ce5ebc33e514990b8441ed6551dd91b",
                "response_text": "The story takes place on Alpha Centauri III, a planet that has many stagnant lakes that are only a few hundred feet across, but a few thousand feet deep. After Star’s ship fells into one of the lakes, he is knocked out and is captured by the girl and Garrett’s people to their craft. He is sitting on a lab chair where he realizes that he is being called “Garrett” instead of Star. He is still super surprised, but then is knocked out again. He wakes up in some kind of cell and is told he will be executed. He is brought to a room to be executed streaming to the Section Void Headquarters with a stellar vision screen. After some distraction, Garrett misses the shot. But Star is knocked out again to be brought back to the cell again. After acknowledging that the girl knows his true identity, Garrett notices them and brought them to see his grand operation that will allow him to rule over the world. However, he dies before he was able to finish introducing the rest of the machineries. "
              },
              {
                "worker_id": "102",
                "uid": "3cf32cad9ed149a48f43761ccf59ffbb",
                "response_text": "The story begins on the surface of Alpha Centauri III, also known as the most barren planet in space. The surface of the planet is flat, with only lakes disrupting the flatness. The lakes, though only several hundred feet across, are several thousand feet deep. \nAs Starrett Blade, who is also known as Death Star, is taken to the lair of Devil Garrett, a space pirate, the setting changes to an underground space. Star wakes up in a cell, and is then taken to another room with a transmitter to be executed. However, the transmission goes awry, and Star is subdued and returned to his cell. \nUpon waking up again, Star is taken, alongside Anne Hinton, to a room a thousand feet long and five hundred feet wide, filled with machinery, ladders, and catwalks. The machinery includes vats connected to cables, in which the electrolysis of water is performed, and pipes leading from the vats to large engines in which hydrogen and oxygen gas are allowed to combust and turn turbines. \n"
              },
              {
                "worker_id": "101",
                "uid": "538a8b6acd3440569181f6d4a6319aa7",
                "response_text": "The story takes place on Alpha Centauri III, a barren planet with no life. Star finds himself in Garrett's lair, where he is held in a cell for much of the story. Star's execution takes place after Garrett and Anne have eaten in the dining room, where a large transmitter is located that will broadcast the execution to those across the galaxy. Garrett's place also holds turbines and chambers that would generate energy towards his plan of dominating Alpha III."
              },
              {
                "worker_id": "104",
                "uid": "dcf22942a64845ea8f5d611686c371f5",
                "response_text": "The story begins with Star Blade crouched by some rocks on a tiny lake that is about a couple of hundred feet across but thousands of feet deep. He is on the surface of Alpha Centauri III, the most barren planet in space as it has a mostly flat, rocky surface. There is no running water on the planet, only lakes exist. Tides do not exist on the planet because it does not have a moon which is required for tidal power. \n\nStar is taken to a prison cell by Garrett’s orders. Before his planned execution, Star stands in front of a transmitter that is meant to kill him. He is not killed by the transmitter and returns to his cell. \n\nGarrett shows Star a room that is about a thousand feet long and about 500 feet wide. The room is filled with very large machines and different ladders leading to various sections of the machines. \n"
              }
            ]
          },
          {
            "question_text": "What did Garrett do to make the girl believe that he is Star and Star is Garrett?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8ce5ebc33e514990b8441ed6551dd91b",
                "response_text": "Firstly, a month ago, Garrett pretends to be Star and successfully deceived the girl’s father and was communicating with him about his development on some power processes. And according to the girl, she was captured by Garrett and brought to the craft around a month ago. Note that no one knows what he is really hoping to accomplish by pretending to be Star. Secondly, for the past month, he has been using 3-dimensional images and detailed description of Star as Garrett to make the girl believe his made-up identity. This also finishes successfully and the girl was sure that Star was Garrett, Garret as Star. Thirdly, during the execution, Garrett uses the delay in voice from the visual images to make sure that the girl will not be able to hear anything that the Section Void Headquarters would say when they see Garrett murdering Star. But he lets her see the images so that when their faces are filled with surprises to see Star being captured, the visual images will lead the girl to believe that they are shocked because they see Garret. However, this part of the plan failed. The girl is able to read lips, thus from the visuals, she knows exactly what the headquarters are saying. Hence she learns the truth of Garrett and Star’s identity. She also learns that he has been lying to him and her father. "
              },
              {
                "worker_id": "102",
                "uid": "3cf32cad9ed149a48f43761ccf59ffbb",
                "response_text": "Prior to meeting the girl, Anne Hinton, Devil Garrett, the top space pirate, had contacted Anne’s father Old John Hinton while posing as Starrett Blade. Garrett’s deception of Anne is furthered by his forgery of certain documents, including papers describing Garrett as having Star’s description, and a three-dimensional picture. \nHis deception, however, is foiled during a transmission between the pirate and Police Commander Weddel which was meant to broadcast Star’s execution. During the silent broadcast, Weddel’s mouth moves and Anne is able to read his lips, coming to believe that Star is who he claims to be. \n"
              },
              {
                "worker_id": "101",
                "uid": "538a8b6acd3440569181f6d4a6319aa7",
                "response_text": "To make Anne believe that Garrett is Star and Star is Garrett, Garrett communicated with her father, posing as Star and claiming that he was interested in working with him to develop power plants. John Hinton, who supplies Star with much of his equipment, agreed to work with Garrett. Anne has been staying with Garrett for a month, during which he showed her fake papers and photos that supported his lie. Once Anne met Star for the first time, she was under the belief that Garrett was actually Star. Because of this, she immediately thought that Star was lying when he shared his name, and was able to help bring him to Garrett. "
              },
              {
                "worker_id": "104",
                "uid": "dcf22942a64845ea8f5d611686c371f5",
                "response_text": "Garrett made the girl believe that he was Star and that Star was Garrett because he provided her with papers that he claimed showed a picture of Garrett with a description. The picture was in fact one of Star Blade. In addition, he had his guards pretend that he was Star Blade too. However, unlike the girl, the guards knew that he was actually Garrett. He made the girl fear Star Blade (pretending Star was actually Garrett) by telling the girl that Star was a horrible pirate that killed many people and had to be executed. In addition, the girl’s father communicated with Garrett while he was pretending to be Star. This is another reason she thought she could trust him. "
              }
            ]
          },
          {
            "question_text": "What equipment does Star possess and use throughout the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "103",
                "uid": "8ce5ebc33e514990b8441ed6551dd91b",
                "response_text": "When Star’s ship is hit by the electric beam, he has an electron knife with him. And when he heard footsteps coming his way, he holds onto it firmly. When the man gets near the water and sees the ship sink, Star quickly kills him with the electron knife by stabbing right to his heart. He takes the man’s jet-gun with him as well. He is also going to use the jet-gun on the girl, but his great reflexes are able to stop him from doing so, however, she paralyzes him first. After he is knocked out and brought to the cell, he looks for his weapons, but they are all taken by Garrett’s men except one. At the place that execution is supposed to take place, Star kicks the metal fork towards the visual transmitter, which will send signals for help. When Garrett takes them to the machinery room, the girl takes the jet weapon from Garrett, Star uses a tiny jet to shoot Garret right before Garret shot him. While Star’s scalp gets injured, he is able to shoot right at Garret’s vitals with his quickness and alertness, thus making him die almost immediately."
              },
              {
                "worker_id": "102",
                "uid": "3cf32cad9ed149a48f43761ccf59ffbb",
                "response_text": "Star possesses a jet-gun and an electron blade which he stores on his belt. Additionally, he maintains an additional jet weapon discreetly stored on his person. His primary weapon, the jet-gun, is a deadly weapon, but one which must be reloaded by pressing a loading stuff to slide ammunition into place. His electron blade, stored in a water-proof sheath, is a blade whose full potential is realizable when it is activated. Upon the pressing of its electron stud, the electron blade produces blue fire. The jet weapon, which Star uses to kill Devil Garrett, is slightly smaller than a fountain pen and has thick sides. Star refers to this weapon as his “ace”. \n"
              },
              {
                "worker_id": "101",
                "uid": "538a8b6acd3440569181f6d4a6319aa7",
                "response_text": "Some of the equipment that Star uses in the story is supplied by John Hinton, including the ship he flies at the beginning of the story, which is shot down. Aside from the ship, Star possesses several weapons throughout the story, including an electron knife and a gun. Once Star is captured by Garrett, he is stripped of most of his weapons, except for his hidden \"ace card\", which is revealed to be a jet gun concealed in a smaller form. Star also possesses knowledge of transmitters and their functions; because of this, he is able to use Garrett's transmitter to alert the authorities of his location by breaking a unit of the machine that sends a distress signal. "
              },
              {
                "worker_id": "104",
                "uid": "dcf22942a64845ea8f5d611686c371f5",
                "response_text": "In the beginning, Star uses an electron knife that he keeps in a water-proof covering. The knife produces a blue fire when it is used to stab someone. When Star Blade is about to be executed by the transmitter, he pulls out a metal fork. The metal fork damages the transmitter by striking a small area where there are wires and braces. The metal fork prevents Star from being executed by the transmitter. The last weapon that Star has on him after he has used the previous two is a jet weapon the size of a fountain pen. He uses the jet weapon to kill Garrett. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4614,
        "document_length_chars": 25656
      }
    }
  ]
}