{
  "item_metadata": {
    "item_id": "63473",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63473",
      "content": "DUST UNTO DUST\n \n\n By LYMAN D. HINCKLEY\n \n \n It was alien but was it dead, this towering, sinister city of metal that glittered malignantly before the cautious advance of three awed space-scouters.\n \n [Transcriber's Note: This etext was produced from Planet Stories Summer 1955. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Martin set the lifeboat down carefully, with all the attention one usually exercises in a situation where the totally unexpected has occurred, and he and his two companions sat and stared in awed silence at the city a quarter-mile away.\n \n He saw the dull, black walls of buildings shouldering grimly into the twilight sky, saw the sheared edge where the metal city ended and the barren earth began ... and he remembered observing, even before they landed, the too-strict geometry imposed on the entire construction.\n \n He frowned. The first impression was ... malignant.\n \n Wass, blond and slight, with enough nose for three or four men, unbuckled his safety belt and stood up. \"Shall we, gentlemen?\" and with a graceful movement of hand and arm he indicated the waiting city.\n \n Martin led Wass, and the gangling, scarecrow-like Rodney, through the stillness overlaying the barren ground. There was only the twilight sky, and harsh and black against it, the convoluted earth. And the city. Malignant. He wondered, again, what beings would choose to build a city—even a city like this one—in such surroundings.\n \n The men from the ship knew only the surface facts about this waiting geometric discovery. Theirs was the eleventh inter-planetary flight, and the previous ten, in the time allowed them for exploration while this planet was still close enough to their own to permit a safe return in their ships, had not spotted the city. But the eleventh expedition had, an hour ago, with just thirteen hours left during which a return flight could be safely started. So far as was known, this was the only city on the planet—the planet without any life at all, save tiny mosses, for a million years or more. And no matter which direction from the city a man moved, he would always be going north.\n \n \"Hey, Martin!\" Rodney called through his helmet radio. Martin paused.\n\"Wind,\" Rodney said, coming abreast of him. He glanced toward the black pile, as if sharing Martin's thoughts. \"That's all we need, isn't it?\"\n \n Martin looked at the semi-transparent figures of wind and dust cavorting in the distance, moving toward them. He grinned a little, adjusting his radio. \"Worried?\"\n \n Rodney's bony face was without expression. \"Gives me the creeps, kind of. I wonder what they were like?\"\n \n Wass murmured, \"Let us hope they aren't immortal.\"\n \n Three feet from the edge of the city Martin stopped and stubbed at the sand with the toe of his boot, clearing earth from part of a shining metal band.\n \n Wass watched him, and then shoved aside more sand, several feet away.\n\"It's here, too.\"\n \n Martin stood up. \"Let's try farther on. Rodney, radio the ship, tell them we're going in.\"\n \n Rodney nodded.\n \n After a time, Wass said, \"Here, too. How far do you think it goes?\"\n \n Martin shrugged. \"Clear around the city? I'd like to know what it is—was—for.\"\n \n \"Defense,\" Rodney, several yards behind, suggested.\n \n \"Could be,\" Martin said. \"Let's go in.\"\n \n The three crossed the metal band and walked abreast down a street, their broad soft soled boots making no sound on the dull metal. They passed doors and arches and windows and separate buildings. They moved cautiously across five intersections. And they stood in a square surrounded by the tallest buildings in the city.\n \n Rodney broke the silence, hesitantly. \"Not—not very big. Is it?\"\n \n Wass looked at him shrewdly. \"Neither were the—well, shall we call them, people? Have you noticed how low everything is?\"\n \n Rodney's laughter rose, too. Then, sobering—\"Maybe they crawled.\"\n \n A nebulous image, product of childhood's vivid imagination, moved slowly across Martin's mind. \"All right!\" he rapped out—and the image faded.\n \n \"Sorry,\" Rodney murmured, his throat working beneath his lantern jaw. Then—\"I wonder what it's like here in the winter when there's no light at all?\"\n \n \"I imagine they had illumination of some sort,\" Martin answered, dryly.\n\"If we don't hurry up and get through this place and back to the ship, we're very likely to find out.\"\n \n Rodney said quickly, \"I mean outside.\"\n \n \"Out there, too, Rodney, they must have had illumination.\" Martin looked back along the straight, metal street they'd walked on, and past that out over the bleak, furrowed slopes where the ship's lifeboat lay ... and he thought everything outside the city seemed, somehow, from here, a little dim, a little hazy.\n \n He straightened his shoulders. The city was alien, of course, and that explained most of it ... most of it. But he felt the black city was something familiar, yet twisted and distorted.\n \n \"Well,\" Wass said, his nose wrinkling a bit, \"now that we're here....\"\n \n \"Pictures,\" Martin decided. \"We have twelve hours. We'll start here. What's the matter, Wass?\"\n \n The blond man grinned ruefully. \"I left the camera in the lifeboat.\" There was a pause. Then Wass, defensively—\"It's almost as if the city didn't want to be photographed.\"\n \n Martin ignored the remark. \"Go get it. Rodney and I will be somewhere along this street.\"\n \n Wass turned away. Martin and Rodney started slowly down the wide metal street, at right angles to their path of entrance.\n \n Again Martin felt a tug of twisted, distorted familiarity. It was almost as if ... they were human up to a certain point, the point being, perhaps, some part of their minds.... Alien things, dark and subtle, things no man could ever comprehend.\n \n Parallel evolution on two inner planets of the same system? Somewhere, sometime, a common ancestor? Martin noted the shoulder-high doors, the heavier gravity, remembered the inhabitants of the city vanished before the thing that was to become man ever emerged from the slime, and he decided to grin at himself, at his own imagination.\n \n Rodney jerked his scarecrow length about quickly, and a chill sped up Martin's spine. \"What's the matter?\"\n \n The bony face was white, the gray eyes were wide. \"I saw—I thought I saw—something—moving—\"\n \n Anger rose in Martin. \"You didn't,\" he said flatly, gripping the other's shoulder cruelly. \"You couldn't have. Get hold of yourself, man!\"\n \n Rodney stared. \"The wind. Remember? There isn't any, here.\"\n \n \"... How could there be? The buildings protect us now. It was blowing from the other direction.\"\n \n Rodney wrenched free of Martin's grip. He gestured wildly. \"That—\"\n \n \"Martin!\" Wass' voice came through the receivers in both their radios.\n\"Martin, I can't get out!\"\n \n \n\n \n Rodney mumbled something, and Martin told him to shut up.\n \n Wass said, more quietly, \"Remember that metal band? It's all clear now, and glittering, as far as I can see. I can't get across it; it's like a glass wall.\"\n \n \"We're trapped, we're trapped, they are—\"\n \n \"Shut up, Rodney! Wass, I'm only two sections from the edge. I'll check here.\"\n \n Martin clapped a hand on Rodney's shoulder again, starting him moving, toward the city's edge, past the black, silent buildings.\n \n The glittering band was here, too, like a halo around a silhouette.\n \n \"No go,\" Martin said to Wass. He bit at his lower lip. \"I think it must be all around us.\" He was silent for a time, exploring the consequences of this. Then—\"We'll meet you in the middle of the city, where we separated.\"\n \n Walking with Rodney, Martin heard Wass' voice, flat and metallic through the radio receiver against his ear. \"What do you suppose caused this?\"\n \n He shook his head angrily, saying, \"Judging by reports of the rest of the planet, it must have been horribly radioactive at one time. All of it.\"\n \n \"Man-made radiation, you mean.\"\n \n Martin grinned faintly. Wass, too, had an active imagination. \"Well, alien-made, anyhow. Perhaps they had a war.\"\n \n Wass' voice sounded startled. \"Anti-radiation screen?\"\n \n Rodney interrupted, \"There hasn't been enough radiation around here for hundreds of thousands of years to activate such a screen.\"\n \n Wass said coldly, \"He's right, Martin.\"\n \n Martin crossed an intersection, Rodney slightly behind him. \"You're both wrong,\" he said. \"We landed here today.\"\n \n Rodney stopped in the middle of the metal street and stared down at Martin. \"The wind—?\"\n \n \"Why not?\"\n \n \"That would explain why it stopped so suddenly, then.\" Rodney stood straighter. When he walked again, his steps were firmer.\n \n They reached the center of the city, ahead of the small, slight Wass, and stood watching him labor along the metal toward them.\n \n Wass' face, Martin saw, was sober. \"I tried to call the ship. No luck.\"\n \n \"The shield?\"\n \n Wass nodded. \"What else?\"\n \n \"I don't know—\"\n \n \"If we went to the roof of the tallest building,\" Rodney offered, \"we might—\"\n \n Martin shook his head. \"No. To be effective, the shield would have to cover the city.\"\n \n Wass stared down at the metal street, as if he could look through it.\n\"I wonder where it gets its power?\"\n \n \"Down below, probably. If there is a down below.\" Martin hesitated. \"We may have to....\"\n \n \"What?\" Rodney prompted.\n \n Martin shrugged. \"Let's look.\"\n \n He led the way through a shoulder-high arch in one of the tall buildings surrounding the square. The corridor inside was dim and plain, and he switched on his flashlight, the other two immediately following his example. The walls and the rounded ceiling of the corridor were of the same dull metal as the buildings' facades, and the streets. There were a multitude of doors and arches set into either side of the corridor.\n \n It was rather like ... entering a gigantic metal beehive.\n \n Martin chose an arch, with beyond it a metal ramp, which tilted downward, gleaming in the pale circle of his torch.\n \n A call from Rodney halted him. \"Back here,\" the tall man repeated. \"It looks like a switchboard.\"\n \n The three advanced to the end of the central corridor, pausing before a great arch, outlined in the too-careful geometrical figures Martin had come to associate with the city builders. The three torches, shining through the arch, picked out a bank of buttons, handles ... and a thick rope of cables which ran upward to vanish unexpectedly in the metal roof.\n \n \"Is this it,\" Wass murmured, \"or an auxiliary?\"\n \n Martin shrugged. \"The whole city's no more than a machine, apparently.\"\n \n \"Another assumption,\" Wass said. \"We have done nothing but make assumptions ever since we got here.\"\n \n \"What would you suggest, instead?\" Martin asked calmly.\n \n Rodney furtively, extended one hand toward a switch.\n \n \"No!\" Martin said, sharply. That was one assumption they dared not make.\n \n Rodney turned. \"But—\"\n \n \"No. Wass, how much time have we?\"\n \n \"The ship leaves in eleven hours.\"\n \n \"Eleven hours,\" Rodney repeated. \"Eleven hours!\" He reached out for the switch again. Martin swore, stepped forward, pulled him back roughly.\n \n He directed his flashlight at Rodney's thin, pale face. \"What do you think you're doing?\"\n \n \"We have to find out what all this stuff's for!\"\n \n \"Going at it blindly, we'd probably execute ourselves.\"\n \n \"We've got to—\"\n \n \"No!\" Then, more quietly—\"We still have eleven hours to find a way out.\"\n \n \"Ten hours and forty-five minutes,\" Wass disagreed softly. \"Minus the time it takes us to get to the lifeboat, fly to the ship, land, stow it, get ourselves aboard, and get the big ship away from the planet. And Captain Morgan can't wait for us, Martin.\"\n \n \"You too, Wass?\"\n \n \"Up to the point of accuracy, yes.\"\n \n Martin said, \"Not necessarily. You go the way the wind does, always thinking of your own tender hide, of course.\"\n \n Rodney cursed. \"And every second we stand here doing nothing gives us that much less time to find a way out. Martin—\"\n \n \"Make one move toward that switchboard and I'll stop you where you stand!\"\n \n \n\n \n Wass moved silently through the darkness beyond the torches. \"We all have guns, Martin.\"\n \n \"I'm holding mine.\" Martin waited.\n \n After a moment, Wass switched his flashlight back on. He said quietly,\n\"He's right, Rodney. It would be sure death to monkey around in here.\"\n \n \"Well....\" Rodney turned quickly toward the black arch. \"Let's get out of here, then!\"\n \n Martin hung back waiting for the others to go ahead of him down the metal hall. At the other arch, where the ramp led downward, he called a halt. \"If the dome, or whatever it is, is a radiation screen there must be at least half-a-dozen emergency exits around the city.\"\n \n Rodney said, \"To search every building next to the dome clean around the city would take years.\"\n \n Martin nodded. \"But there must be central roads beneath this main level leading to them. Up here there are too many roads.\"\n \n Wass laughed rudely.\n \n \"Have you a better idea?\"\n \n Wass ignored that, as Martin hoped he would. He said slowly, \"That leads to another idea. If the band around the city is responsible for the dome, does it project down into the ground as well?\"\n \n \"You mean dig out?\" Martin asked.\n \n \"Sure. Why not?\"\n \n \"We're wearing heavy suits and bulky breathing units. We have no equipment.\"\n \n \"That shouldn't be hard to come by.\"\n \n Martin smiled, banishing Wass' idea.\n \n Rodney said, \"They may have had their digging equipment built right in to themselves.\"\n \n \"Anyway,\" Martin decided, \"we can take a look down below.\"\n \n \"In the pitch dark,\" Wass added.\n \n Martin adjusted his torch, began to lead the way down the metal ramp. The incline was gentle, apparently constructed for legs shorter, feet perhaps less broad than their own. The metal, without mark of any sort, gleamed under the combined light of the torches, unrolling out of the darkness before the men.\n \n At length the incline melted smoothly into the next level of the city.\n \n Martin shined his light upward, and the others followed his example. Metal as smooth and featureless as that on which they stood shone down on them.\n \n Wass turned his light parallel with the floor, and then moved slowly in a circle. \"No supports. No supports anywhere. What keeps all that up there?\"\n \n \"I don't know. I have no idea.\" Martin gestured toward the ramp with his light. \"Does all this, this whole place, look at all familiar to you?\"\n \n Rodney's gulp was clearly audible through the radio receivers. \"Here?\"\n \n \"No, no,\" Martin answered impatiently, \"not just here. I mean the whole city.\"\n \n \"Yes,\" Wass said dryly, \"it does. I'm sure this is where all my nightmares stay when they're not on shift.\"\n \n Martin turned on his heel and started down a metal avenue which, he thought, paralleled the street above. And Rodney and Wass followed him silently. They moved along the metal, past unfamiliar shapes made more so by gloom and moving shadows, past doors dancing grotesquely in the three lights, past openings in the occasional high metal partitions, past something which was perhaps a conveyor belt, past another something which could have been anything at all.\n \n The metal street ended eventually in a blank metal wall.\n \n The edge of the city—the city which was a dome of force above and a bowl of metal below.\n \n After a long time, Wass sighed. \"Well, skipper...?\"\n \n \"We go back, I guess,\" Martin said.\n \n Rodney turned swiftly to face him. Martin thought the tall man was holding his gun. \"To the switchboard, Martin?\"\n \n \"Unless someone has a better idea,\" Martin conceded. He waited. But Rodney was holding the gun ... and Wass was.... Then—\"I can't think of anything else.\"\n \n They began to retrace their steps along the metal street, back past the same dancing shapes of metal, the partitions, the odd windows, all looking different now in the new angles of illumination.\n \n Martin was in the lead. Wass followed him silently. Rodney, tall, matchstick thin, even in his cumbersome suit, swayed with jaunty triumph in the rear.\n \n Martin looked at the metal street lined with its metal objects and he sighed. He remembered how the dark buildings of the city looked at surface level, how the city itself looked when they were landing, and then when they were walking toward it. The dream was gone again for now. Idealism died in him, again and again, yet it was always reborn. But—The only city, so far as anyone knew, on the first planet they'd ever explored. And it had to be like this. Nightmares, Wass said, and Martin thought perhaps the city was built by a race of beings who at some point twisted away from their evolutionary spiral, plagued by a sort of racial insanity.\n \n No, Martin thought, shaking his head. No, that couldn't be. Viewpoint ... his viewpoint. It was the haunting sense of familiarity, a faint strain through all this broad jumble, the junkpile of alien metal, which was making him theorize so wildly.\n \n Then Wass touched his elbow. \"Look there, Martin. Left of the ramp.\"\n \n Light from their torches was reflected, as from glass.\n \n \"All right,\" Rodney said belligerently into his radio. \"What's holding up the procession?\"\n \n Martin was silent.\n \n Wass undertook to explain. Why not, after all? Martin asked himself. It was in Wass' own interest. In a moment, all three were standing before a bank of glass cases which stretched off into the distance as far as the combined light of their torches would reach.\n \n \"Seeds!\" Wass exclaimed, his faceplate pressed against the glass.\n \n Martin blinked. He thought how little time they had. He wet his lips.\n \n Wass' gloved hands fumbled awkwardly at a catch in the nearest section of the bank.\n \n Martin thought of the dark, convoluted land outside the city. If they wouldn't grow there.... Or had they, once? \"Don't, Wass!\"\n \n Torchlight reflected from Wass' faceplate as he turned his head. \"Why not?\"\n \n They were like children.... \"We don't know, released, what they'll do.\"\n \n \"Skipper,\" Wass said carefully, \"if we don't get out of this place by the deadline we may be eating these.\"\n \n Martin raised his arm tensely. \"Opening a seed bank doesn't help us find a way out of here.\" He started up the ramp. \"Besides, we've no water.\"\n \n Rodney came last up the ramp, less jaunty now, but still holding the gun. His mind, too, was taken up with childhood's imaginings. \"For a plant to grow in this environment, it wouldn't need much water. Maybe—\" he had a vision of evil plants attacking them, growing with super-swiftness at the air valves and joints of their suits \"—only the little moisture in the atmosphere.\"\n \n \n\n \n They stood before the switchboard again. Martin and Wass side by side, Rodney, still holding his gun, slightly to the rear.\n \n Rodney moved forward a little toward the switches. His breathing was loud and rather uneven in the radio receivers.\n \n Martin made a final effort. \"Rodney, it's still almost nine hours to take off. Let's search awhile first. Let this be a last resort.\"\n \n Rodney jerked his head negatively. \"No. Now, I know you, Martin. Postpone and postpone until it's too late, and the ship leaves without us and we're stranded here to eat seeds and gradually dehydrate ourselves and God only knows what else and—\"\n \n He reached out convulsively and yanked a switch.\n \n Martin leaped, knocking him to the floor. Rodney's gun skittered away silently, like a live thing, out of the range of the torches.\n \n The radio receivers impersonally recorded the grating sounds of Rodney's sobs.\n \n \"Sorry,\" Martin said, without feeling. He turned quickly. \"Wass?\"\n \n The slight, blond man stood unmoving. \"I'm with you, Martin, but, as a last resort it might be better to be blown sky high than to die gradually—\"\n \n Martin was watching Rodney, struggling to get up. \"I agree. As a last resort. We still have a little time.\"\n \n Rodney's tall, spare figure looked bowed and tired in the torchlight, now that he was up again. \"Martin, I—\"\n \n Martin turned his back. \"Skip it, Rodney,\" he said gently.\n \n \"Water,\" Wass said thoughtfully. \"There must be reservoirs under this city somewhere.\"\n \n Rodney said, \"How does water help us get out?\"\n \n Martin glanced at Wass, then started out of the switchboard room, not looking back. \"It got in and out of the city some way. Perhaps we can leave the same way.\"\n \n Down the ramp again.\n \n \"There's another ramp,\" Wass murmured.\n \n Rodney looked down it. \"I wonder how many there are, all told.\"\n \n Martin placed one foot on the metal incline. He angled his torch down, picking out shadowy, geometrical shapes, duplicates of the ones on the present level. \"We'll find out,\" he said, \"how many there are.\"\n \n Eleven levels later Rodney asked, \"How much time have we now?\"\n \n \"Seven hours,\" Wass said quietly, \"until take-off.\"\n \n \"One more level,\" Martin said, ignoring the reference to time. \"I ... think it's the last.\"\n \n They walked down the ramp and stood together, silent in a dim pool of artificial light on the bottom level of the alien city.\n \n Rodney played his torch about the metal figures carefully placed about the floor. \"Martin, what if there are no reservoirs? What if there are cemeteries instead? Or cold storage units? Maybe the switch I pulled—\"\n \n \"Rodney! Stop it!\"\n \n Rodney swallowed audibly. \"This place scares me....\"\n \n \"The first time I was ever in a rocket, it scared me. I was thirteen.\"\n \n \"This is different,\" Wass said. \"Built-in traps—\"\n \n \"They had a war,\" Martin said.\n \n Wass agreed. \"And the survivors retired here. Why?\"\n \n Martin said, \"They wanted to rebuild. Or maybe this was already built before the war as a retreat.\" He turned impatiently. \"How should I know?\"\n \n Wass turned, too, persistent. \"But the planet was through with them.\"\n \n \"In a minute,\" Martin said, too irritably, \"we'll have a sentient planet.\" From the corner of his eye he saw Rodney start at that. \"Knock it off, Wass. We're looking for reservoirs, you know.\"\n \n They moved slowly down the metal avenue, between the twisted shadow shapes, looking carefully about them.\n \n Rodney paused. \"We might not recognize one.\"\n \n Martin urged him on. \"You know what a man-hole cover looks like.\" He added dryly, \"Use your imagination.\"\n \n They reached the metal wall at the end of the avenue and paused again, uncertain.\n \n Martin swung his flashlight, illuminating the distorted metal shapes.\n \n Wass said, \"All this had a purpose, once....\"\n \n \"We'll disperse and search carefully,\" Martin said.\n \n \"I wonder what the pattern was.\"\n \n \"... The reservoirs, Wass. The pattern will still be here for later expeditions to study. So will we if we don't find a way to get out.\"\n \n Their radios recorded Rodney's gasp. Then—\"Martin! Martin! I think I've found something!\"\n \n Martin began to run. After a moment's hesitation, Wass swung in behind him.\n \n \"Here,\" Rodney said, as they came up to him, out of breath. \"Here. See? Right here.\"\n \n Three flashlights centered on a dark, metal disk raised a foot or more from the floor.\n \n \"Well, they had hands.\" With his torch Wass indicated a small wheel of the same metal as everything else in the city, set beside the disk.\n \n From its design Martin assumed that the disk was meant to be grasped and turned. He wondered what precisely they were standing over.\n \n \"Well, Skipper, are you going to do the honors?\"\n \n Martin kneeled, grasped the wheel. It turned easily—almost too easily—rotating the disk as it turned.\n \n Suddenly, without a sound, the disk rose, like a hatch, on a concealed hinge.\n \n The three men, clad in their suits and helmets, grouped around the six-foot opening, shining their torches down into the thing that drifted and eddied directly beneath them.\n \n Rodney's sudden grip on Martin's wrist nearly shattered the bone.\n\"Martin! It's all alive! It's moving!\"\n \n Martin hesitated long enough for a coil to move sinuously up toward the opening. Then he spun the wheel and the hatch slammed down.\n \n He was shaking.\n \n \n\n \n After a time he said, \"Rodney, Wass, it's dust, down there. Remember the wind? Air currents are moving it.\"\n \n Rodney sat down on the metal flooring. For a long time he said nothing. Then—\"It wasn't.... Why did you close the hatch then?\"\n \n Martin did not say he thought the other two would have shot him, otherwise. He said merely, \"At first I wasn't sure myself.\"\n \n Rodney stood up, backing away from the closed hatch. He held his gun loosely, and his hand shook. \"Then prove it. Open it again.\"\n \n Martin went to the wheel. He noticed Wass was standing behind Rodney and he, too, had drawn his gun.\n \n The hatch rose again at Martin's direction. He stood beside it, outlined in the light of two torches.\n \n For a little while he was alone.\n \n Then—causing a gasp from Wass, a harsh expletive from Rodney—a tenuous, questing alien limb edged through the hatch, curling about Martin, sparkling in ten thousand separate particles in the torchlight, obscuring the dimly seen backdrop of geometrical processions of strange objects.\n \n \n\n \n Martin raised an arm, and the particles swirled in stately, shimmering spirals.\n \n Rodney leaned forward and looked over the edge of the hatch. He said nothing. He eyed the sparkling particles swirling about Martin, and now, himself.\n \n \"How deep,\" Wass said, from his safe distance.\n \n \"We'll have to lower a flashlight,\" Martin answered.\n \n Rodney, all eagerness to be of assistance now, lowered a rope with a torch swinging wildly on the end of it.\n \n The torch came to rest about thirty feet down. It shone on gently rolling mounds of fine, white stuff.\n \n Martin anchored the rope soundly, and paused, half across the lip of the hatch to stare coldly at Wass. \"You'd rather monkey with the switches and blow yourself to smithereens?\"\n \n Wass sighed and refused to meet Martin's gaze. Martin looked at him disgustedly, and then began to descend the rope, slowly, peering into the infinite, sparkling darkness pressing around him. At the bottom of the rope he sank to his knees in dust, and then was held even. He stamped his feet, and then, as well as he was able, did a standing jump. He sank no farther than his knees.\n \n He sighted a path parallel with the avenue above, toward the nearest edge of the city. \"I think we'll be all right,\" he called out, \"as long as we avoid the drifts.\"\n \n Rodney began the descent. Looking up, Martin saw Wass above Rodney.\n \n \"All right, Wass,\" Martin said quietly, as Rodney released the rope and sank into the dust.\n \n \"Not me,\" the answer came back quickly. \"You two fools go your way, I'll go mine.\"\n \n \"Wass!\"\n \n There was no answer. The light faded swiftly away from the opening.\n \n The going was hard. The dust clung like honey to their feet, and eddied and swirled about them until the purifying systems in their suits were hard-pressed to remove the fine stuff working in at joints and valves.\n \n \"Are we going straight?\" Rodney asked.\n \n \"Of course,\" Martin growled.\n \n There was silence again, the silence of almost-exhausted determination. The two men lifted their feet out of the dust, and then laboriously plunged forward, to sink again to the knees, repeated the act, times without number.\n \n Then Wass broke his silence, taunting. \"The ship leaves in two hours, Martin. Two hours. Hear me, Rodney?\"\n \n Martin pulled his left foot from the sand and growled deep in his throat. Ahead, through the confusing patterns of the sparkling dust, his flashlight gleamed against metal. He grabbed Rodney's arm, pointed.\n \n A grate.\n \n Rodney stared. \"Wass!\" he shouted. \"We've found a way out!\"\n \n Their radios recorded Wass' laughter. \"I'm at the switchboard now, Martin. I—\"\n \n There was a tinkle of breaking glass, breaking faceplate.\n \n The grate groaned upward and stopped.\n \n Wass babbled incoherently into the radio for a moment, and then he began to scream.\n \n Martin switched off his radio, sick.\n \n He turned it on again when they reached the opening in the metal wall.\n\"Well?\"\n \n \"I've been trying to get you,\" Rodney said, frantically. \"Why didn't you answer?\"\n \n \"We couldn't do anything for him.\"\n \n Rodney's face was white and drawn. \"But he did this for us.\"\n \n \"So he did,\" Martin said, very quietly.\n \n Rodney said nothing.\n \n Then Martin said, \"Did you listen until the end?\"\n \n Rodney nodded, jerkily. \"He pulled three more switches. I couldn't understand it all. But—Martin, dying alone like that in a place like this—!\"\n \n Martin crawled into the circular pipe behind the grate. It tilted up toward the surface. \"Come on, Rodney. Last lap.\"\n \n An hour later they surfaced about two hundred yards away from the edge of the city. Behind them the black pile rose, the dome of force shimmering, almost invisible, about it.\n \n Ahead of them were the other two scoutships from the mother ship. Martin called out faintly, pulling Rodney out of the pipe. Crew members standing by the scoutships, and at the edge of the city, began to run toward them.\n \n \"Radio picked you up as soon as you entered the pipe,\" someone said. It was the last thing Martin heard before he collapsed.",
      "metadata": {
        "title": "Dust Unto Dust",
        "author": "Lyman D. Hinckley",
        "passage_id": "63473",
        "uid": "0a9bdf02a1a84fb2b7408aa57f1ef5fd",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "10",
                "uid": "690fb4ae4b8b4882a636e3f374bfe518",
                "response_text": "The story opens with Rodney, Martin and Wass landing on a foreign planet and overlooking an abandoned metal city where the inhabitants supposedly died more than a million years ago. They had thirteen hours to explore before they must return to their mother ship.\nThey notice a metal rim at the perimeter of the city that they must step over to enter, and continue in to explore. Wass must return to their “lifeboat” spaceship to get a camera, but is unable to exit the city as the metal band they noticed coming in has turned into a dome-shaped shield over the entire city. They suspect it may be a radiation shield, and are suspicious that the wind they saw when landing and their inability to contact their home ship may indicate a tragedy took place as they arrived. \nThey find a control center of sorts with lots of knobs and levers, but do not engage with it for fear of not knowing what might happen. They all find the city somewhat familiar, but have no idea why. \nThey begin looking for where the water of the city comes from, since they may be able to find a way out of the city through its transport corridors. They all begin to start frightening each other with stories and seeing dust and objects move around in the dark. Rodney and Martin enter an underground tunnel through a hatch in the ground and Wass chooses not to follow them and instead leaves to return to the switchboard.\nAs Rodney and Martin discover a grate in the tunnel it begins to open for them. Wass delivers the message on the radio that he was able to do that from the control room, and then something attacks and kills him. Rodney and Martin escape to the outside of the dome to where others from their crew have come to their rescue. It is unclear whether Rodney and Martin ultimately live after they exit the tunnel.\n"
              },
              {
                "worker_id": "6",
                "uid": "28cad34bf75d41e485d024c16af6ee14",
                "response_text": "Martin, Rodney, and Wass are the 11th expedition to arrive on this planet. However, with only 13 hours left before they need to depart, they are the first to discover the city tucked away on an island. They make their way to the malignant-looking, black buildings and step over a metal band to enter. They explore the city briefly, taking turns guessing at who lived here before and what everything meant. Martin asks for pictures, but Wass says he left the camera back in the lifeboat. He leaves to go retrieve it, while Martin and Rodney keep exploring. The buildings are surprisingly small and the doorways only reach their shoulders. Wass radios in to say that their is no exit, because a force field has sprung up around the city. They try and think of ways to escape, but they’re not left with many options. They throw around the idea of an anti-radiation screen to protect the inhabitants. They decide to meet in the center of the city and explore one of the buildings to see if they can find an escape. \nAs they step in, they are all shocked at the interior architecture, which resembles a beehive. Rodney finds a switchboard, which they all fight over. Rodney and Wass want to try some switches and see if it will aid them in their escape, but Martin doesn’t want to take such a big risk seeing as they still had eleven hours. They all pull their guns on each other, but the situation deescalates and they continue on their way. They travel down a ramp until they reach a flat wall. The dome was a force field on top, and then continued down with a metal surface. They went back up to the switchboard, until Wass stopped them. A glass case filled with seeds was to their left. They looked through it, but Martin stopped the boys from taking any out. Finally, at the switchboard with their weapons out, Martin tries to stop them from making any rash decisions as they still had nine hours. Rodney gets upset and impulsively flicks a switch. Martin tackles him before any more harm can be done. Wass realizes that there are water reservoirs under the city.  \nThey travel down again until they reach a hatch. It lifts up, and a coil slithers out. They quickly shut it, until Martin reasons that it’s just dust. So he opens it again, and dust emerges. They throw down a rope with a flashlight and Martin heads down. Rodney follows after him, landing in the dust. Wass does not, however, and shuts the hatch above them. He thinks he will survive by the switchboard, not in the tunnels. Martin and Rodney travel for a few hours before reaching a closed grate. Wass laughs at them (only two hours left) and starts flicking switches. The grate suddenly opens, and they hear his screams. He is killed, but his sacrifice allowed the others to live. \n"
              },
              {
                "worker_id": "8",
                "uid": "5999feaed18a4fd6ad68cb0d3f7d7029",
                "response_text": "Three men--Martin, Wass, and Rodney--are part of the crew of the eleventh inter-planetary expedition sent to explore a planet close to their own. Previous expeditions had not been able to locate the city said to be on the planet, but this crew has been successful where others have failed. The three men pilot a lifeboat to investigate the empty, metal city and only have thirteen hours to photograph and catalogue what they discover there before it will be too late to safely return to their planet. As they observe the city from a distance, they witness a large, dark cloud of wind and dust approaching the city. Approaching the city's borders, they discuss it is surrounded by a metal band, and in fact the entire city is made entirely of metal. Everything is a bit mysterious and even feels familiar to Martin. Who lived here? How did they see when it was dark outside? Did they crawl or walk? Were they a distant relative of their own species and experienced different evolutions? The men think about these things as they make their way through the city. Wass realizes he has forgotten his camera to take pictures and begins to muse that the city has a mind of its own. When he goes to retrieve his camera, the metal band bordering the town has unleashed a kind of force field, preventing Wass from leaving and effectively imprisoning the team. They wonder about the purpose of the wall--was it a defense mechanism against radiation used during some kind of war? The force field also prevents communication with their main ship, so they decide to make their way down into the city's depths to look for a way to escape. Once inside, they examine their surroundings and notice the architecture is the same smooth metal that formed the surface buildings and are arranged in a series of arches and corridors resembling a beehive. Rodney discovers a switchboard, which leads Martin to believe the whole city is some kind of machine or engine. After struggling to find a way out, Wass discovers a bank of glass cases filled with seeds. They return to the switchboard, and Rodney wants to flip one of the switches, since time is running out, but Martin punches him down to stop him. Then Martin to theorize there must be a water reservoir nearby. They move further into the depths and discover a hatch, inside of which is a sea of dust. Rodney and Martin follow the sea to a metal grate exit, but Wass stays behind. He flips a switch and is killed, but the metal grate opens and Rodney and Martin are freed."
              },
              {
                "worker_id": "3",
                "uid": "787e7f7becb34b91818f544258603057",
                "response_text": "The story takes place on a planet in the same star system as Earth, where the crew of the thirteenth flight to the planet is exploring. There are three scout ships, and the story focuses on one, with the crew of Rodney, Martin, and Wass. They see what they think is the only city on the planet, never before discussed by other crews, and approach it to investigate. They are struck by its darkness, both in the lack of light as well as the dark metal that makes up most of the structures. They notice a metal band that surrounds the city, and step over it to continue onward. When Wass turns back to find the camera he left behind, he realizes he's trapped, and that the metal band turned into something akin to a glass wall. They can no longer contact their ship and need a way out. They figure their best bet is to go towards the center of the city and make their way down, in case they can dig out. They head down a magnificent ramp, dwarfed by the grand architecture of the city, and come across what looks like a switchboard. Martin threatens Rodney when he tried to reach for the switchboard and forces the group to keep walking, hoping that if the force-field is a dome that covers the top of the city, they might be able to find a way out by going under it. They are baffled by the huge structures in the city that seem to be supporting themselves, unsure of how the city keeps itself up. They eventually find the end of the city where all they see is a blank wall, so they head back towards the switchboard. Through all of this, Martin is seeing glimpses of familiarity in the city that he can't place. They find glass cases of seeds, which Martin warns Wass not to disturb - it's possible that these plants had grown outside the city at one point and they did not know what to expect if they were released. Rodney flips a random switch, which makes Martin tackle him, and they head to look for a water source or reservoir, continuing further downwards. Rodney finds a large metal disk with a wheel next to it, and Martin opens up the hatch. The group sees that whatever was inside is moving, shut the door out of fear, and eventually open it back up to take a closer look. A tentacle made of what looks like sparkling light particles swirls up into the area the men were standing in, and Martin and Rodney climb down the hatch, wading through the deep dust at the bottom, with Wass refusing to follow. Martin and Rodney eventually find an escape hatch, but they have to rely on Wass to open it for them from the switchboard. Wass dies screaming at whatever had broken glass behind him, and Martin and Rodney are rescued by the rest of their crew. "
              }
            ]
          },
          {
            "question_text": "What happens to Wass through the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "10",
                "uid": "690fb4ae4b8b4882a636e3f374bfe518",
                "response_text": "Wass is an equal part of the exploration party with Rodney and Martin until he has had enough and parts ways with them when they enter an underground passageway filled with dust. Wass instead returns to the switchboard and pulls a series of levers that allows Rodney and Martin to escape from the city through the underground tunnels - saving their lives. Wass ultimately dies at the switchboard, though it is not clear what kills him. "
              },
              {
                "worker_id": "6",
                "uid": "28cad34bf75d41e485d024c16af6ee14",
                "response_text": "Wass is one of the explorers sent out to further investigate this planet. He is a photographer and is the first to realize that they are trapped within the city’s screen. Wass, Martin, and Rodney all try and figure out a way to get out, who these aliens were, and what they’re going to do, but quickly their relationship begins to deteriorate. Wass and Rodney turn against Martin fairly quickly, as they are so desperate to escape that they aren’t willing to further explore all options. \nWass meets Martin and Rodney in the center of the city before travelling into one of the buildings. They find a switchboard there, which he is in favor of messing with, but Martin persuades him otherwise. Wass continually points his weapon at Martin and forces him to perfom dangerous tasks first. He discovers the seed bank, which Martin cautions the rest of the crew not to touch. When Rodney and Martin land in the tunnels, Wass shuts the hatch above them and runs back to the switchboard. He taunts them with the time and how many hours left. He believes he will escape by flicking switches on the switchboard, and that Rodney and Martin will die in the tunnels. However, his flicking switches actually brought about Rodney and Martin’s rescue, as the grate that they were stuck at opened. Wass dies after flicking three or four of the switches and his screams reverberate throughout their radio. \n"
              },
              {
                "worker_id": "8",
                "uid": "5999feaed18a4fd6ad68cb0d3f7d7029",
                "response_text": "Not long after the three men enter the metal city, Wass senses that something is amiss. Something about the city's architecture reminds him of his nightmares and makes him feel uneasy. He worries they are trapped for good and will miss their return flight when a force field surrounding the city prevents him from returning to the lifeboat to fetch his camera. Wass also appears to be very curious about the nature and physical attributes of the species that populated the city prior to their disappearance. He believes they must have been shorter due to the small stature of the buildings. Over time, he begins to show signs that he might believe the city and planet are in some way alive and have a will of their own. Perhaps it is this will that caused Wass to forget his camera. He is also very invested in mysterious geometric patterns they discover during their wanderings through the depths of the city, and he becomes extremely excited when he discovers a bank of glass cases which hold some kind of seeds. Wass wants to open them, but Martin warns him against this. The seeds might be some kind of plant or perhaps the offspring of the species that retired there. Whatever the case, Martin insists they attempt to find a water reservoir because it will likely lead to their escape. Wass refuses to follow them in, and instead stays behind to flip the switch that opens the grate that allows Martin and Rodney to escape. Wass is killed in a mysterious fashion.  "
              },
              {
                "worker_id": "3",
                "uid": "787e7f7becb34b91818f544258603057",
                "response_text": "Wass is one of the three men in his scout ship, a subset of the larger crew he is on a mission with. He is a slight blonde man with a large nose, and is in charge of the camera equipment in their group. He wanders into the city with Martin and Rodney, and when he realizes he left the camera behind, he is also faced with a new problem: there seems to be a glass barrier trapping him and his crewmates in the old city. He shouts into his radio to update the others, and they begin to brainstorm. The three of them travel through much of the city and some of the buildings trying to find a way out, and they eventually find a large hatch that Martin and Rodney jump into. Wass refuses to join, staying on top of the hatch, but once Rodney and Martin find a way out they realize the exit is covered in a metal grate. Wass had made it to the switchboard by then, and flips four switches which open the exit for Rodney and Martin to leave, but he screams into the radio after he starts this. Whatever it was with him must have killed him, but thanks to Wass, his crewmates made it out of the city alive to be rescued by the rest of the ship. "
              }
            ]
          },
          {
            "question_text": "Where does the story take place?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "10",
                "uid": "690fb4ae4b8b4882a636e3f374bfe518",
                "response_text": "The story takes place on the surface of a planet that has an abandoned city made of metal. The city is spooky and the inhabitants supposedly died over a million years ago. However, they see things moving strangely while they are in the city suggesting it is inhabited, and something kills Wass within the city during the story.\nThey explore the metal streets of the city, a room with a large switchboard, and seven levels underground. Rodney and Martin explore an underground tunnel that eventually leads them out of the city and to the safety of their fellow crew. \n"
              },
              {
                "worker_id": "6",
                "uid": "28cad34bf75d41e485d024c16af6ee14",
                "response_text": "Dust Unto Dust by Lyman D. Hinckley takes place on an island that had been previously explored. The ten previous groups never discovered the dull, black city on the island, but the eleventh did. This is presumably the only city on this planet that had not been inhabited for more than a million years. Only small mosses grew on the planet. \nThis city is made of insidious, black metal with similar architectural designs to modern earth. However, everything is shorter, presumably to make up for the inhabitant’s shortened size. The character theorize that this city was under attack at one point, which would explain the anti-radiantion screen or force field that surrounds the entire city. Dull black streets twist and turn throughout the city and buildings rise up above them. \nOne of the buildings was designed almost like a beehive, many openings and arches and ways to escape. There were shetlers built underneath the city, again another sign of war. Beneath the shelters lay a series of tunnels that could have been used to bring water into the city. Now they are simply filled with dust. \n"
              },
              {
                "worker_id": "8",
                "uid": "5999feaed18a4fd6ad68cb0d3f7d7029",
                "response_text": "The story takes place on an unnamed planet close to the home planet of the story’s three main characters. Martin, Rodney, and Wass are part of the crew on the eleventh inter-planetary expedition that seeks to discover the mysteries of the unnamed metal city. The planet is covered with mostly barren earth that leads up to the black city. A large cloud of dust blows over the city, which is protected by a kind of force field after the protagonists enter. The city is entirely constructed with smooth, black metal; Wass notes how low the buildings are, which might indicate the size of the species that previously lived there. When the protagonists decide to go underneath the city to find a way to escape, they discover several levels of interlocking arches and corridors that resemble a massive beehive. The men travel between levels using a number of ramps, and when they arrive at the bottommost level, they discover a subterranean level filled with a knee-high, flowing current of sparkling dust. Rodney and Martin follow the current to a metal grate, which leads to the surface outside the city."
              },
              {
                "worker_id": "3",
                "uid": "787e7f7becb34b91818f544258603057",
                "response_text": "This story takes place on a planet that is in the same star system as Earth, where thirteen different exploratory missions have visited. The humans had not realized that there was a city on the planet, from previous missions, but there is a lone city that one of the scout ships encounters on this thirteenth mission. There is a lot of sand and dust with some wind in the planet's terrain in general, and the city sticks out as being constructed of large metal structures. Everything in the city is at a very large scale: the man traverse wide ramps that they find under tall arches, and inside of buildings the halls and rooms seem endless. It is even more frightening in that the city is shrouded in darkness because of the metal streets, and the travelers wonder how much scarier it would be in the wintertime when there wasn't natural light. The city has a large metal ring surrounding it that the men are able to walk over to enter the city, but after they do this a large force-field of sorts is triggered and the ring transforms into the base of this protective barrier. Whatever this barrier's original purpose is, it has the effect of keeping the humans from leaving the city and blocks out the wind. Much of the story happens in the lower levels of the city, passing a switchboard and a seed bank and eventually ending up in a reservoir that held the pipe that the surviving men escaped through."
              }
            ]
          },
          {
            "question_text": "What is the relationship like between Rodney, Martin, and Wass?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "10",
                "uid": "690fb4ae4b8b4882a636e3f374bfe518",
                "response_text": "They are bound by a sense of duty to the mission. However, when they are put in the predicament of being trapped under the dome, their bond begins to fray and they start fighting with each other about the best means of escape.\nRodney and Martin squabble, but both stick together in exploring an underground tunnel filled with dust while Wass elects to go his own way. Wass ultimately appears to sacrifice his life to save Rodney and Martin by returning to the switchboard and opening a grate that allows them to escape from the city. \n"
              },
              {
                "worker_id": "6",
                "uid": "28cad34bf75d41e485d024c16af6ee14",
                "response_text": "As colleagues and explorers, at first their relationship is well-balanced and intellectually-stimulating. They bounce ideas off of each other about the city, the force field, and its inhabitants. However, as soon as they realize that they’re stuck, their relationship begins to crumble. \nAs each man feels their self-preservation instincts rise, their banter becomes more and more tense. After Wass reveals that they are stuck inside of the city due to the dome surrounding it, all three meet back in the center to find another way out. This is where the great source of their conflict begins. They explore one of the buildings and find a switchboard in it relatively quickly. Rodney and Wass want to flick some switches and see what happens, but Martin disagrees. They all pull their guns on each other, until Martin can convince them to only use the switchboard as a last resort. Over the course of the story, Rodney and Wass continually make Martin do things first, whether that be leading them on paths or travelling down the hatch. Wass and Rodney would often pull their guns out on him too, but Martin stayed relatively calm. \nAfter the discovery of the tunnel system, Rodney follows Martin down the hatch, but Wass shuts them in. He makes his way back to the switchboard, certain that his way is right and theirs is wrong. Although their relationship was pretty strong at first, their survival instinct, genuine fear, and malignant nature of the city all played a part to further divide the three. \n"
              },
              {
                "worker_id": "8",
                "uid": "5999feaed18a4fd6ad68cb0d3f7d7029",
                "response_text": "Martin seems to be the de facto leader of the group, guiding them through the important decisions that lead them through the city. Rodney and Wass oscillate between being obedient followers and fearful, panicky crewmates who want to think and act independently. Wass has a stronger connection to the metaphysical elements of the metal city and seems to remember the place from his nightmares. He has an intense curiosity about the patterns he discovers in the metal architecture as well as the seeds he discovers in the glass cases. Martin is often impatient with his two crewmembers, particularly Rodney, whom he punches in the face and knocks to the ground to prevent him from flipping switches on the switchboard they discover. He also seems disgusted by Wass when he refuses to follow them into the dust current. Wass sacrifices himself to save his fellow crewmembers, although his death is shrouded in mystery."
              },
              {
                "worker_id": "3",
                "uid": "787e7f7becb34b91818f544258603057",
                "response_text": "Martin is clearly in charge, though he does not have a gentle hand. He threatens his crewmates frequently, putting them at gunpoint at multiple times throughout the story. Although it was Rodney who found the hatch that would get them out, Martin was the one who did the honors to open it, after shooting down the other ideas that the crew had including using the switchboard. Rodney wants to get things moving quickly, and wants to use the switchboard to try for a way out, but this is when Martin pulls a gun on him. Rodney also flips a random switch which makes Martin tackle him, so it seems that their dynamic is focused on Rodney doing reckless things and Martin wanting to get his way while trying to survive. Wass offers ideas to the other throughout their journey but he does not seem to be taken seriously, asking many general questions as he tries to interpret what is happening to him. However, it is Wass that got Rodney and Martin out in the end. "
              }
            ]
          },
          {
            "question_text": "What was the key to their escape?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "10",
                "uid": "690fb4ae4b8b4882a636e3f374bfe518",
                "response_text": "Choosing to search underground for where water might enter and exit the city was an important step for them to find the tunnel that led to their escape. However, Wass’ pulling levers at the switchboard was critical to opening the grate inside the tunnel that actually allowed them to leave. Otherwise, they did not have tools with them that would have likely allowed them to escape in time.\nIf Martin had not forced the team to join together when they were fighting over the control panel the first time, they likely may have never escaped as well."
              },
              {
                "worker_id": "6",
                "uid": "28cad34bf75d41e485d024c16af6ee14",
                "response_text": "After Rodney and Martin decided to escape through the tunnels, Wass stayed aboveground, taunting them. He thought his best chances were with the switchboard. While they traversed underground, he made his way back to the switchboard. With only two hours to spare, Rodney and Martin were faced with a closed grate. Wass came on through the radio, making fun of them, and then began to pull switches. Luckily enough, one of the switches he pulled activated the grate and it opened for them. Soon, they hear Wass screaming as he’s dying. Martin and Rodney escape through the grate, which tunnels upward around 200 feet from the edge of the city. Because of Wass, they were able to escape alive. "
              },
              {
                "worker_id": "8",
                "uid": "5999feaed18a4fd6ad68cb0d3f7d7029",
                "response_text": "The discovery of the seeds leads Martin to assume there must be some kind of water source within the depths of the metal city, so they use the ramps to access the bottommost level. The team discovers a hatch there that opens to a sea of dust. Rodney and Martin lower themselves into the dust current, but Wass refuses to join them, choosing instead to stay in the city to test the switches Rodney had discovered earlier. Martin warns him that this is likely a death sentence, but Wass does not seem to care. Martin and Rodney follow the current to a metal grate, and Wass triggers the switch to open the gate. In doing so, he is killed in a mysterious fashion. Martin and Rodney crawl through a tunnel and surface outside the barrier of the metal city just in time to be picked up by their main ship before its return to their planet."
              },
              {
                "worker_id": "3",
                "uid": "787e7f7becb34b91818f544258603057",
                "response_text": "In order to escape the city, the men had to travel as far down as they could, looking for a reservoir that might have some kind of exit pathway. They do find a large hatch in the bottom of the building they are in, where Martin and Rodney jump into a deep pile of dust that they essentially wade through in order to make their way towards an exit. However, the pipe that they find to escape through is shut by a metal grate. Wass had never jumped through the hatch, and while standing at the switchboard, flipped four switches that raised the grate for them. Wass died while trying to open the escape route for his crewmates, but if it were not for him they would not have made it out alive."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4792,
        "document_length_chars": 28921
      }
    }
  ]
}