{
  "item_metadata": {
    "item_id": "63527",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63527",
      "content": "COSMIC YO-YO\n \n\n By ROSS ROCKLYNNE\n \n \n \"Want an asteroid in your backyard? We supply cheap. Trouble also handled without charge.\" Interplanetary Hauling Company. (ADVT.)\n \n [Transcriber's Note: This etext was produced from Planet Stories Summer 1945. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Bob Parker, looking through the photo-amplifiers at the wedge-shaped asteroid, was plainly flabbergasted. Not in his wildest imaginings had he thought they would actually find what they were looking for.\n \n \"Cut the drive!\" he yelled at Queazy. \"I've got it, right on the nose. Queazy, my boy, can you imagine it? We're in the dough. Not only that, we're rich! Come here!\"\n \n Queazy discharged their tremendous inertia into the motive-tubes in such a manner that the big, powerful ship was moving at the same rate as the asteroid below—47.05 miles per second. He came slogging back excitedly, put his eyes to the eyepiece. He gasped, and his big body shook with joyful ejaculations.\n \n \"She checks down to the last dimension,\" Bob chortled, working with slide-rule and logarithm tables. \"Now all we have to do is find out if she's made of tungsten, iron, quartz crystals, and cinnabar! But there couldn't be two asteroids of that shape anywhere else in the Belt, so this has to be it!\"\n \n He jerked a badly crumpled ethergram from his pocket, smoothed it out, and thumbed his nose at the signature.\n \n \"Whee! Mr. Andrew S. Burnside, you owe us five hundred and fifty thousand dollars!\"\n \n Queazy straightened. A slow, likeable smile wreathed his tanned face.\n\"Better take it easy,\" he advised, \"until I land the ship and we use the atomic whirl spectroscope to determine the composition of the asteroid.\"\n \n \"Have it your way,\" Bob Parker sang, happily. He threw the ethergram to the winds and it fell gently to the deck-plates. While Queazy—so called because his full name was Quentin Zuyler—dropped the ship straight down to the smooth surface of the asteroid, and clamped it tight with magnetic grapples, Bob flung open the lazarette, brought out two space-suits. Moments later, they were outside the ship, with star-powdered infinity spread to all sides.\n \n In the ship, the ethergram from Andrew S. Burnside, of Philadelphia, one of the richest men in the world, still lay on the deck-plates. It was addressed to: Mr. Robert Parker, President Interplanetary Hauling & Moving Co., 777 Main Street, Satterfield City, Fontanaland, Mars. The ethergram read:\n  Received your advertising literature a week ago. Would like to state that yes I would like an asteroid in my back yard. Must meet following specifications: 506 feet length, long enough for wedding procession;\n98 feet at base, tapering to 10 feet at apex; 9-12 feet thick; topside smooth-plane, underside rough-plane; composed of iron ore, tungsten, quartz crystals, and cinnabar. Must be in my back yard before 11:30 A.M. my time, for important wedding June 2, else order is void. Will pay $5.00 per ton.\n \n \n \n\n \n Bob Parker had received that ethergram three weeks ago. And if The Interplanetary Hauling & Moving Co., hadn't been about to go on the rocks (chiefly due to the activities of Saylor & Saylor, a rival firm) neither Bob nor Queazy would have thought of sending an answering ethergram to Burnside stating that they would fill the order. It was, plainly, a hair-brained request. And yet, if by some chance there was such a rigidly specified asteroid, their financial worries would be over. That they had actually discovered the asteroid, using their mass-detectors in a weight-elimination process, seemed like an incredible stroke of luck. For there are literally millions of asteroids in the asteroid belt, and they had been out in space only three weeks.\n \n The \"asteroid in your back yard\" idea had been Bob Parker's originally. Now it was a fad that was sweeping Earth, and Burnside wasn't the first rich man who had decided to hold a wedding on top of an asteroid. Unfortunately, other interplanetary moving companies had cashed in on that brainstorm, chiefly the firm of the Saylor brothers—which persons Bob Parker intended to punch in the nose some day. And would have before this if he hadn't been lanky and tall while they were giants. Now that he and Queazy had found the asteroid, they were desperate to get it to its destination, for fear that the Saylor brothers might get wind of what was going on, and try to beat them out of their profits. Which was not so far-fetched, because the firm of Saylor & Saylor made no pretense of being scrupulous.\n \n Now they scuffed along the smooth-plane topside of the asteroid, the magnets in their shoes keeping them from stepping off into space. They came to the broad base of the asteroid-wedge, walked over the edge and\n\"down\" the twelve-foot thickness. Here they squatted, and Bob Parker happily clamped the atomic-whirl spectroscope to the rough surface. By the naked eye, they could see iron ore, quartz crystals, cinnabar, but he had the spectroscope and there was no reason why he shouldn't use it. He satisfied himself as to the exterior of the asteroid, and then sent the twin beams deep into its heart. The beams crossed, tore atoms from molecules, revolved them like an infinitely fine powder. The radiations from the sundered molecules traveled back up the beams to the atomic-whirl spectroscope. Bob watched a pointer which moved slowly up and up—past tungsten, past iridium, past gold—\n \n Bob Parker said, in astonishment, \"Hell! There's something screwy about this business. Look at that point—\"\n \n Neither he nor Queazy had the opportunity to observe the pointer any further. A cold, completely disagreeable feminine voice said,\n \n \"May I ask what you interlopers are doing on my asteroid?\"\n \n Bob started so badly that the spectroscope's settings were jarred and the lights in its interior died. Bob twisted his head around as far as he could inside the \"aquarium\"—the glass helmet, and found himself looking at a space-suited girl who was standing on the edge of the asteroid \"below.\"\n \n \"Ma'am,\" said Bob, blinking, \"did you say something?\"\n \n Queazy made a gulping sound and slowly straightened. He automatically reached up as if he would take off his hat and twist it in his hands.\n \n \"I said,\" remarked the girl, \"that you should scram off of my asteroid. And quit poking around at it with that spectroscope. I've already taken a reading. Cinnabar, iron ore, quartz crystals, tungsten. Goodbye.\"\n \n \n\n \n Bob's nose twitched as he adjusted his glasses, which he wore even inside his suit. He couldn't think of anything pertinent to say. He knew that he was slowly working up a blush. Mildly speaking, the girl was beautiful, and though only her carefully made-up face was visible—cool blue eyes, masterfully coiffed, upswept, glinting brown hair, wilful lips and chin—Bob suspected the rest of her compared nicely.\n \n Her expression darkened as she saw the completely instinctive way he was looking at her and her radioed-voice rapped out, \"Now you two boys go and play somewhere else! Else I'll let the Interplanetary Commission know you've infringed the law. G'bye!\"\n \n She turned and disappeared.\n \n Bob awoke from his trance, shouted desperately, \"Hey! Wait! You! \"\n \n He and Queazy caught up with her on the side of the asteroid they hadn't yet examined. It was a rough plane, completing the rigid qualifications Burnside had set down.\n \n \"Wait a minute,\" Bob Parker begged nervously. \"I want to make some conversation, lady. I'm sure you don't understand the conditions—\"\n \n The girl turned and drew a gun from a holster. It was a spasticizer, and it was three times as big as her gloved hand.\n \n \"I understand conditions better than you do,\" she said. \"You want to move this asteroid from its orbit and haul it back to Earth. Unfortunately, this is my home, by common law. Come back in a month. I don't expect to be here then.\"\n \n \"A month!\" Parker burst the word out. He started to sweat, then his face became grim. He took two slow steps toward the girl. She blinked and lost her composure and unconsciously backed up two steps. About twenty steps away was her small dumbbell-shaped ship, so shiny and unscarred that it reflected starlight in highlights from its curved surface. A rich girl's ship, Bob Parker thought angrily. A month would be too late!\n \n He said grimly, \"Don't worry. I don't intend to pull any rough stuff. I just want you to listen to reason. You've taken a whim to stay on an asteroid that doesn't mean anything to you one way or another. But to us—to me and Queazy here—it means our business. We got an order for this asteroid. Some screwball millionaire wants it for a backyard wedding see? We get five hundred and fifty thousand dollars for it! If we don't take this asteroid to Earth before June 2, we go back to Satterfield City and work the rest of our lives in the glass factories. Don't we, Queazy?\"\n \n Queazy said simply, \"That's right, miss. We're in a spot. I assure you we didn't expect to find someone living here.\"\n \n The girl holstered her spasticizer, but her completely inhospitable expression did not change. She put her hands on the bulging hips of her space-suit. \"Okay,\" she said. \"Now I understand the conditions. Now we both understand each other. G'bye again. I'm staying here and—\" she smiled sweetly \"—it may interest you to know that if I let you have the asteroid you'll save your business, but I'll meet a fate worse than death! So that's that.\"\n \n Bob recognized finality when he saw it. \"Come on, Queazy,\" he said fuming. \"Let this brat have her way. But if I ever run across her without a space-suit on I'm going to give her the licking of her life, right where it'll do the most good!\"\n \n He turned angrily, but Queazy grabbed his arm, his mouth falling open. He pointed off into space, beyond the girl.\n \n \"What's that?\" he whispered.\n \n \"What's wha— Oh! \"\n \n Bob Parker's stomach caved in. A few hundred feet away, floating gently toward the asteroid, came another ship—a ship a trifle bigger than their own. The girl turned, too. They heard her gasp. In another second, Bob was standing next to her. He turned the audio-switch to his headset off, and spoke to the girl by putting his helmet against hers.\n \n \"Listen to me, miss,\" he snapped earnestly, when she tried to draw away. \"Don't talk by radio. That ship belongs to the Saylor brothers! Oh, Lord, that this should happen! Somewhere along the line, we've been double-crossed. Those boys are after this asteroid too, and they won't hesitate to pull any rough stuff. We're in this together, understand? We got to back each other up.\"\n \n The girl nodded dumbly. Suddenly she seemed to be frightened.\n\"It's—it's very important that this—this asteroid stay right where it is,\" she said huskily. \"What—what will they do?\"\n \n \n\n \n Bob Parker didn't answer. The big ship had landed, and little blue sparks crackled between the hull and the asteroid as the magnetic clamps took hold. A few seconds later, the airlocks swung down, and five men let themselves down to the asteroid's surface and stood surveying the three who faced them.\n \n The two men in the lead stood with their hands on their hips; their darkish, twin faces were grinning broadly.\n \n \"A pleasure,\" drawled Wally Saylor, looking at the girl. \"What do you think of this situation Billy?\"\n \n \"It's obvious,\" drawled Billy Saylor, rocking back and forth on his heels, \"that Bob Parker and company have double-crossed us. We'll have to take steps.\"\n \n The three men behind the Saylor twins broke into rough, chuckling laughter.\n \n Bob Parker's gorge rose. \"Scram,\" he said coldly. \"We've got an ethergram direct from Andrew S. Burnside ordering this asteroid.\"\n \n \"So have we,\" Wally Saylor smiled—and his smile remained fixed, dangerous. He started moving forward, and the three men in back came abreast, forming a semi-circle which slowly closed in. Bob Parker gave back a step, as he saw their intentions.\n \n \"We got here first,\" he snapped harshly. \"Try any funny stuff and we'll report you to the Interplanetary Commission!\"\n \n It was Bob Parker's misfortune that he didn't carry a weapon. Each of these men carried one or more, plainly visible. But he was thinking of the girl's spasticizer—a paralyzing weapon. He took a hair-brained chance, jerked the spasticizer from the girl's holster and yelled at Queazy. Queazy got the idea, urged his immense body into motion. He hurled straight at Billy Saylor, lifted him straight off the asteroid and threw him away, into space. He yelled with triumph.\n \n At the same time, the spasticizer Bob held was shot cleanly out of his hand by Wally Saylor. Bob roared, started toward Wally Saylor, knocked the smoking gun from his hand with a sweeping arm. Then something crushing seemed to hit him in the stomach, grabbing at his solar plexus. He doubled up, gurgling with agony. He fell over on his back, and his boots were wrenched loose from their magnetic grip. Vaguely, before the flickering points of light in his brain subsided to complete darkness, he heard the girl's scream of rage—then a scream of pain.\n \n What had happened to Queazy he didn't know. He felt so horribly sick, he didn't care. Then—lights out.\n \n \n\n \n Bob Parker came to, the emptiness of remote starlight in his face. He opened his eyes. He was slowly revolving on an axis. Sometimes the Sun swept across his line of vision. A cold hammering began at the base of his skull, a sensation similar to that of being buried alive. There was no asteroid, no girl, no Queazy. He was alone in the vastness of space. Alone in a space-suit.\n \n \"Queazy!\" he whispered. \"Queazy! I'm running out of air!\"\n \n There was no answer from Queazy. With sick eyes, Bob studied the oxygen indicator. There was only five pounds pressure. Five pounds! That meant he had been floating around out here—how long? Days at least—maybe weeks! It was evident that somebody had given him a dose of spastic rays, enough to screw up every muscle in his body to the snapping point, putting him in such a condition of suspended animation that his oxygen needs were small. He closed his eyes, trying to fight against panic. He was glad he couldn't see any part of his body. He was probably scrawny. And he was hungry!\n \n \"I'll starve,\" he thought. \"Or suffocate to death first!\"\n \n He couldn't keep himself from taking in great gulps of air. Minutes, then hours passed. He was breathing abnormally, and there wasn't enough air in the first place. He pleaded continually for Queazy, hoping that somehow Queazy could help, when probably Queazy was in the same condition. He ripped out wild curses directed at the Saylor brothers. Murderers, both of them! Up until this time, he had merely thought of them as business rivals. If he ever got out of this—\n \n He groaned. He never would get out of it! After another hour, he was gasping weakly, and yellow spots danced in his eyes. He called Queazy's name once more, knowing that was the last time he would have strength to call it.\n \n And this time the headset spoke back!\n \n Bob Parker made a gurgling sound. A voice came again, washed with static, far away, burbling, but excited. Bob made a rattling sound in his throat. Then his eyes started to close, but he imagined that he saw a ship, shiny and small, driving toward him, growing in size against the backdrop of the Milky Way. He relapsed, a terrific buzzing in his ears.\n \n He did not lose consciousness. He heard voices, Queazy's and the girl's, whoever she was. Somebody grabbed hold of his foot. His\n\"aquarium\" was unbuckled and good air washed over his streaming face. The sudden rush of oxygen to his brain dizzied him. Then he was lying on a bunk, and gradually the world beyond his sick body focussed in his clearing eyes and he knew he was alive—and going to stay that way, for awhile anyway.\n \n \"Thanks, Queazy,\" he said huskily.\n \n Queazy was bending over him, his anxiety clearing away from his suddenly brightening face.\n \n \"Don't thank me,\" he whispered. \"We'd have both been goners if it hadn't been for her. The Saylor brothers left her paralyzed like us, and when she woke up she was on a slow orbit around her ship. She unstrapped her holster and threw it away from her and it gave her enough reaction to reach the ship. She got inside and used the direction-finder on the telaudio and located me first. The Saylors scattered us far and wide.\" Queazy's broad, normally good-humored face twisted blackly. \"The so and so's didn't care if we lived or died.\"\n \n Bob saw the girl now, standing a little behind Queazy, looking down at him curiously, but unhappily. Her space-suit was off. She was wearing lightly striped blue slacks and blue silk blouse and she had a paper flower in her hair. Something in Bob's stomach caved in as his eyes widened on her.\n \n The girl said glumly, \"I guess you men won't much care for me when you find out who I am and what I've done. I'm Starre Lowenthal—Andrew S. Burnside's granddaughter!\"\n \n \n\n \n Bob came slowly to his feet, and matched Queazy's slowly growing anger.\n \n \"Say that again?\" he snapped. \"This is some kind of dirty trick you and your grandfather cooked up?\"\n \n \"No!\" she exclaimed. \"No. My grandfather didn't even know there was an asteroid like this. But I did, long before he ordered it from you—or from the Saylor brothers. You see—well, my granddad's about the stubbornest old hoot-owl in this universe! He's always had his way, and when people stand in his way, that's just a challenge to him. He's been badgering me for years to marry Mac, and so has Mac—\"\n \n \"Who's Mac?\" Queazy demanded.\n \n \"My fiancé, I guess,\" she said helplessly. \"He's one of my granddad's protégés. Granddad's always financing some likely young man and giving him a start in life. Mac has become pretty famous for his Mercurian water-colors—he's an artist. Well, I couldn't hold out any longer. If you knew my grandfather, you'd know how absolutely impossible it is to go against him when he's got his mind set! I was just a mass of nerves. So I decided to trick him and I came out to the asteroid belt and picked out an asteroid that was shaped so a wedding could take place on it. I took the measurements and the composition, then I told my grandfather I'd marry Mac if the wedding was in the back yard on top of an asteroid with those measurements and made of iron ore, tungsten, and so forth. He agreed so fast he scared me, and just to make sure that if somebody did find the asteroid in time they wouldn't be able to get it back to Earth, I came out here and decided to live here. Asteroids up to a certain size belong to whoever happens to be on them, by common law.... So I had everything figured out—except,\" she added bitterly, \"the Saylor brothers! I guess Granddad wanted to make sure the asteroid was delivered, so he gave the order to several companies.\"\n \n Bob swore under his breath. He went reeling across to a port, and was gratified to see his and Queazy's big interplanetary hauler floating only a few hundred feet away. He swung around, looked at Queazy.\n \n \"How long were we floating around out there?\"\n \n \"Three weeks, according to the chronometer. The Saylor boys gave us a stiff shot.\"\n \n \" Ouch! \" Bob groaned. Then he looked at Starre Lowenthal with determination. \"Miss, pardon me if I say that this deal you and your granddad cooked up is plain screwy! With us on the butt end. But I'm going to put this to you plainly. We can catch up with the Saylor brothers even if they are three weeks ahead of us. The Saylor ship and ours both travel on the HH drive—inertia-less. But the asteroid has plenty of inertia, and so they'll have to haul it down to Earth by a long, spiraling orbit. We can go direct and probably catch up with them a few hundred thousand miles this side of Earth. And we can have a fling at getting the asteroid back!\"\n \n Her eyes sparkled. \"You mean—\" she cried. Then her attractive face fell. \"Oh,\" she said. \" Oh! And when you get it back, you'll land it.\"\n \n \"That's right,\" Bob said grimly. \"We're in business. For us, it's a matter of survival. If the by-product of delivering the asteroid is your marriage—sorry! But until we do get the asteroid back, we three can work as a team if you're willing. We'll fight the other problem out later. Okay?\"\n \n She smiled tremulously. \"Okay, I guess.\"\n \n Queazy looked from one to another of them. He waved his hand scornfully at Bob. \"You're plain nuts,\" he complained. \"How do you propose to go about convincing the Saylor brothers they ought to let us have the asteroid back? Remember, commercial ships aren't allowed to carry long-range weapons. And we couldn't ram the Saylor brothers' ship—not without damaging our own ship just as much. Go ahead and answer that.\"\n \n Bob looked at Queazy dismally. \"The old balance-wheel,\" he groaned at Starre. \"He's always pulling me up short when I go off half-cocked. All I know is, that maybe we'll get a good idea as we go along. In the meantime, Starre—ahem—none of us has eaten in three weeks...?\"\n \n Starre got the idea. She smiled dazzlingly and vanished toward the galley.\n \n \n\n \n Bob Parker was in love with Starre Lowenthal. He knew that after five days out, as the ship hurled itself at breakneck speed toward Earth; probably that distracting emotion was the real reason he couldn't attach any significance to Starre's dumbbell-shaped ship, which trailed astern, attached by a long cable.\n \n Starre apparently knew he was in love with her, too, for on the fifth day Bob was teaching her the mechanics of operating the hauler, and she gently lifted his hand from a finger-switch.\n \n \"Even I know that isn't the control to the Holloway vacuum-feeder, Bob. That switch is for the—ah—the anathern tube, you told me. Right?\"\n \n \"Right,\" he said unsteadily. \"Anyway, Starre, as I was saying, this ship operates according to the reverse Fitzgerald Contraction Formula. All moving bodies contract in the line of motion. What Holloway and Hammond did was to reverse that universal law. They caused the contraction first—motion had to follow! The gravitonic field affects every atom in the ship with the same speed at the same time. We could go from zero speed to our top speed of two thousand miles a second just like that!\"\n \n He snapped his fingers. \"No acceleration effects. This type of ship, necessary in our business, can stop flat, back up, ease up, move in any direction, and the passengers wouldn't have any feeling of motion at—Oh, hell!\" Bob groaned, the serious glory of her eyes making him shake. He took her hand. \"Starre,\" he said desperately, \"I've got to tell you something—\"\n \n She jerked her hand away. \"No,\" she exclaimed in an almost frightened voice. \"You can't tell me. There's—there's Mac,\" she finished, faltering. \"The asteroid—\"\n \n \"You have to marry him?\"\n \n Her eyes filled with tears. \"I have to live up to the bargain.\"\n \n \"And ruin your whole life,\" he ground out. Suddenly, he turned back to the control board, quartered the vision plate. He pointed savagely to the lower left quarter, which gave a rearward view of the dumbbell ship trailing astern.\n \n \"There's your ship, Starre.\" He jabbed his finger at it. \"I've got a feeling—and I can't put the thought into concrete words—that somehow the whole solution of the problem of grabbing the asteroid back lies there. But how? How? \"\n \n Starre's blue eyes followed the long cable back to where it was attached around her ship's narrow midsection.\n \n She shook her head helplessly. \"It just looks like a big yo-yo to me.\"\n \n \"A yo-yo?\"\n \n \"Yes, a yo-yo. That's all.\" She was belligerent.\n \n \"A yo-yo !\" Bob Parker yelled the word and almost hit the ceiling, he got out of the chair so fast. \"Can you imagine it! A yo-yo!\"\n \n He disappeared from the room. \"Queazy!\" he shouted. \" Queazy, I've got it! \"\n \n \n\n \n It was Queazy who got into his space-suit and did the welding job, fastening two huge supra-steel \"eyes\" onto the dumbbell-shaped ship's narrow midsection. Into these eyes cables which trailed back to two winches in the big ship's nose were inserted, welded fast, and reinforced.\n \n The nose of the hauler was blunt, perfectly fitted for the job. Bob Parker practiced and experimented for three hours with this yo-yo of cosmic dimensions, while Starre and Queazy stood over him bursting into strange, delighted squeals of laughter whenever the yo-yo reached the end of its double cable and started rolling back up to the ship. Queazy snapped his fingers.\n \n \"It'll work!\" His gray eyes showed satisfaction. \"Now, if only the Saylor brothers are where we calculated!\"\n \n They weren't where Bob and Queazy had calculated, as they had discovered the next day. They had expected to pick up the asteroid on their mass-detectors a few hundred thousand miles outside of the Moon's orbit. But now they saw the giant ship attached like a leech to the still bigger asteroid—inside the Moon's orbit! A mere two hundred thousand miles from Earth!\n \n \"We have to work fast,\" Bob stammered, sweating. He got within naked-eye distance of the Saylor brothers' ship. Below, Earth was spread out, a huge crescent shape, part of the Eastern hemisphere vaguely visible through impeding clouds and atmosphere. The enemy ship was two miles distant, a black shadow occulting part of the brilliant sky. It was moving along a down-spiraling path toward Earth.\n \n Queazy's big hand gripped his shoulder. \"Go to it, Bob!\"\n \n Bob nodded grimly. He backed the hauler up about thirty miles, then sent it forward again, directly toward the Saylor brothers' ship at ten miles per second. And resting on the blunt nose of the ship was the\n\"yo-yo.\"\n \n There was little doubt the Saylors' saw their approach. But, scornfully, they made no attempt to evade. There was no possible harm the oncoming ship could wreak. Or at least that was what they thought, for Bob brought the hauler's speed down to zero—and Starre Lowenthal's little ship, possessing its own inertia, kept on moving!\n \n It spun away from the hauler's blunt nose, paying out two rigid lengths of cable behind it as it unwound, hurled itself forward like a fantastic spinning cannon ball.\n \n \"It's going to hit!\"\n \n The excited cry came from Starre. But Bob swore. The dumbbell ship reached the end of its cables, falling a bare twenty feet short of completing its mission. It didn't stop spinning, but came winding back up the cable, at the same terrific speed with which it had left.\n \n \n\n \n Bob sweated, having only fractions of seconds in which to maneuver for the \"yo-yo\" could strike a fatal blow at the hauler too. It was ticklish work completely to nullify the \"yo-yo's\" speed. Bob used exactly the same method of catching the \"yo-yo\" on the blunt nose of the ship as a baseball player uses to catch a hard-driven ball in his glove—namely, by matching the ball's speed and direction almost exactly at the moment of impact. And now Bob's hours of practice paid dividends, for the \"yo-yo\" came to rest snugly, ready to be released again.\n \n All this had happened in such a short space of time that the Saylor brothers must have had only a bare realization of what was going on. But by the time the \"yo-yo\" was flung at them again, this time with better calculations, they managed to put the firmly held asteroid between them and the deadly missile. But it was clumsy evasion, for the asteroid was several times as massive as the ship which was towing it, and its inertia was great. And as soon as the little ship came spinning back to rest, Bob flung the hauler to a new vantage point and again the \"yo-yo\" snapped out.\n \n And this time—collision! Bob yelled as he saw the stern section of the Saylor brothers' ship crumple like tissue paper crushed between the hand. The dumbbell-shaped ship, smaller, and therefore stauncher due to the principle of the arch, wound up again, wobbling a little. It had received a mere dent in its starboard half.\n \n Starre was chortling with glee. Queazy whispered, \"Attaboy, Bob! This time we'll knock 'em out of the sky!\"\n \n The \"yo-yo\" came to rest and at the same moment a gong rang excitedly. Bob knew what that meant. The Saylor brothers were trying to establish communication.\n \n Queazy was across the room in two running strides. He threw in the telaudio and almost immediately, Wally Saylor's big body built up in the plate. Wally Saylor's face was quivering with wrath.\n \n \"What do you damned fools think you're trying to do?\" he roared.\n\"You've crushed in our stern section. You've sliced away half of our stern jets. Air is rushing out! You'll kill us!\"\n \n \"Now,\" Bob drawled, \"you're getting the idea.\"\n \n \"I'll inform the Interplanetary Commission!\" screamed Saylor.\n \n \" If you're alive,\" Bob snarled wrathfully. \"And you won't be unless you release the asteroid.\"\n \n \"I'll see you in Hades first!\"\n \n \"Hades,\" remarked Bob coldly, \"here you come!\"\n \n He snapped the hauler into its mile-a-second speed again, stopped it at zero. And the \"yo-yo\" went on its lone, destructive sortie.\n \n For a fraction of a second Wally Saylor exhibited the countenance of a doomed man. In the telaudio plate, he whirled, and diminished in size with a strangled yell.\n \n The \"yo-yo\" struck again, but Bob Parker maneuvered its speed in such a manner that it struck in the same place as before, but not as heavily, then rebounded and came spinning back with perfect, sparkling precision. And even before it snugged itself into its berth, it was apparent that the Saylor brothers had given up. Like a wounded terrier, their ship shook itself free of the asteroid, hung in black space for a second, then vanished with a flaming puff of released gravitons from its still-intact jets.\n \n The battle was won!",
      "metadata": {
        "title": "Cosmic Yo-Yo",
        "author": "Ross Rocklynne",
        "passage_id": "63527",
        "uid": "61b1f0821fac4c93b72b8962424df984",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "1",
                "uid": "386d46cd588944c0b01e5474b324d330",
                "response_text": "Bob Parker, the President of Interplanetary Hauling & Moving Co., sells asteroids to wealthy people on earth. Clients ask for asteroids with size parameters and specifications, and Bob finds them in space and hauls them to earth. His company is almost bankrupt because a rival company, Saylor & Saylor, stole his idea and now offers the same services. Bob receives mail from Mr. Andrew S. Burnside with a request for an asteroid that he would like to use in an upcoming wedding.\n\nBob and his partner Queazy set out to find the perfect asteroid for Mr. Burnside, although they know it’s a longshot. Fairly quickly, they find one that looks perfect. The men land on the asteroid, and Bob deploys his atomic-whirl spectroscope to test it. Suddenly, a beautiful woman interrupts him and demands that they leave the asteroid. She pulls out her spasticizer gun before telling them that they can have it in a month after she’s gone. Bob explains that they are desperate, but the girl retorts that her fate is worse than death if she leaves.\n\nSuddenly, the Saylor brothers’ ship appears, and Bob tells the girl that they have to fight this enemy together. Wally and Billy Saylor, along with three other men, jump out of the ship. Bob tells them that Mr. Burnside has ordered this asteroid, and the Saylor brothers say that they received the same order. Bob quickly grabs the girl’s spasticizer while Queazy throws his body at Billy. However, Wally manages to shoot the gun out of Bob’s hand and attack him. Bob is knocked unconscious in the scuffle. \n\nWhen Bob wakes up, he is completely alone, floating in space. He panics because he has very little oxygen left. Finally, he hears Queazy’s voice explaining that the girl used her ship’s technology to find them both. The mystery girl introduces herself as Starre Lowenthal, the granddaughter of Mr. Burnside. She concedes that this entire mission was fake. She told her grandfather that she would only marry her fiance Mac if he could get this particular asteroid, and then she made plans to conquer and protect the asteroid so it could not be supplied for the wedding. \n\nBob is confident that they can reach the Saylor brothers before they bring the asteroid back to earth, but his plan does nothing to protect Starre from marrying a man she doesn’t love. She agrees to help Bob and Queazy. Within five days, Bob realizes he is in love with Starre. \n\nStarre compares her small ship to a yo-yo, and Bob gets an idea - they will use Starre’s ship like a yo-yo to retrieve the asteroid from the Saylor brothers. Once the team catches up to the Saylor brothers, Bob flings Starre’s ship at the asteroid several times, and Wally calls them to tell them that they might die as a result of the damage their ship has sustained. Bob makes it clear that they have no intention of stopping, and the Saylor brothers release the asteroid. \n"
              },
              {
                "worker_id": "8",
                "uid": "38148264500c4d498709d1786b411d94",
                "response_text": "Bob Parker and his business partner Quentin \"Queazy\" Zuyler fly through an asteroid belt searching for one with exact specifications in terms of size and mineral composition requested by a wealthy client, Andrew S. Burnside. Bob and Queazy operate the Interplanetary Hauling Company, which provides the innovative service of delivering an asteroid to the client's home. Bob had invented this service, but his business is suffering thanks to strong-arming by their main competitor, the Saylor Brothers. They need to find Mr. Burnside's asteroid because the payout of $550,000 will save their business. When Bob and Queazy discover an appropriate asteroid, they land and survey the surface to check its dimensions and mineral composition. However, they are interrupted by a beautiful young woman who confirms the composition of the asteroid but demands they leave at once or else she will alert the Interplanetary Commission that they have broken the law. When Bob sees her dumbbell-shaped spaceship, he realizes she comes from wealth and becomes obstinate; he shares with her the importance of this asteroid to his business. While the woman acknowledges his situation, she says if she leaves the asteroid, she will face \"a fate worse than death!\" As they finish their conversation, the Saylor Brothers' ship arrives, and Bob informs the woman that they must stick together to stand against them. Bob argues with Wally and Billy Saylor and eventually he and Queazy attack the two brothers. In the ensuing fight, the Saylors use the woman's paralyzing spasticizer to disable the three rivals and leave them scattered and stranded to die in space. When Bob awakens, he realizes he is running out of air, but soon Queazy retrieves him in their ship with the woman's dumbbell ship in tow; the woman had saved Queazy and together they tracked down Bob. The woman reveals her name is Starre Lowenthal, and she is Andrew S. Burnside's granddaughter. She explains she had concocted a scheme to avoid having to marry her fiance, Mac, who was a protégé of her grandfather's: She said she would marry Mac if they could hold a wedding atop an asteroid with very unique specifications. Her grandfather then commissioned Bob's company as well as the Saylor's to ensure such an asteroid would be discovered. And Starre came to the asteroid to ensure that if someone did find it, they wouldn't be able to take it back with them. Although Bob is in love with Starre, he still needs the money for his business, so he decides to pursue the Saylor Brothers and retrieve the asteroid after all; he assures Starre that they will deal with her marriage issue later. Making use of his ship's ability to accelerate and decelerate extremely fast, Bob attaches Starre's ship to theirs and uses it as a kind of yo-yo to threaten and disable the Saylor Brothers' ship. They relinquish the asteroid, and Bob, Queazy, and Starre win the day."
              },
              {
                "worker_id": "10",
                "uid": "83005f1ecc264d7fbb6bd1c7d05004c2",
                "response_text": "Bob Parker and Quentin Zuyler (Queazy) are co-pilots of a ship that has been on a mission for three weeks to locate a valuable asteroid. One of the richest men in the world, Andrew S. Burnside, of Philadelphia, has requested that Bob specifically source an asteroid for his backyard of an exact dimension and composition for a wedding on June 2nd. Having weddings on asteroids in backyards had become a fad among the richest people on Earth.\nWhen they land on the asteroid, they put on spacesuits and begin exploring and testing its composition. They’re startled by a woman who is squatting on the asteroid and claiming she is protected by law to remain there. She is certain about not wanting the asteroid to move from its position, and even pulls a weapon (a spasticizer) on Bob to try to prove her point when he tries to plead with her that his livelihood depends on them taking the asteroid back to Earth. Just as Bob and Queazy were turning to leave the asteroid, the Saylor brothers landed on it.\nThe Saylor brothers were a rival operation to Bob and Queazy, and Bob says they are known for being rough to get their way. They landed on the asteroid with three other men, claimed they also had a direct order from Mr. Burnside for the asteroid, and began an attack on Bob and Queazy. Bob made a diversion with the woman’s paralyzing weapon, Queazy threw Billy Saylor off the asteroid into space, and Wally Saylor shot the weapon out of Bob’s hand. \nBob was unconscious after the fight and woke up spinning in outer space running out of oxygen. With his last breath he called for Queazy on the intercom and was swiftly rescued by both he and the woman and revived to life. The woman revealed herself to be Andrew S. Burnside's granddaughter,  Starre Lowenthal. She was squatting on the asteroid to try to stop its delivery to Earth. She told her grandfather that she would only marry the man he set her up with, Mac, if it was atop this exact asteroid - thinking that there was no way it was possible for it to be found, and if by small chance it was she would scare those people away.\n \nBob tells Starre they can still intercept the Saylor brothers’ ship since they have to take a long slow orbit back to Earth while his ship can go direct because it’s not towing an asteroid. Along the five day journey to Earth, Bob and Starre fall in love with each other, but Starre seems determined that she would have to keep her promise to marry Mac if the asteroid is delivered. They hook up Starre’s dumbbell shaped spaceship that they are towing like a yo-yo and use it to bludgeon the Saylor brothers’ ship, causing them to release the asteroid and jet away into outer space, leaving Bob, Queasy and Starre in possession.\n"
              },
              {
                "worker_id": "2",
                "uid": "9f842112a409486c92a9c5da495e500f",
                "response_text": "Bob Parker and his partner Queazy are searching for an asteroid of exact proportions to meet a client’s demand. This job is very important because their company, Interplanetary Hauling & Moving Co., is in dire straits and likely to go under without the significant payday this asteroid will bring: $550,000. The client who requested an asteroid this size wants it for a wedding in his backyard by 11:30 am on June 2; otherwise, the order is void. Parker started the “asteroid in your backyard” promotion, but since then, other companies have been offering the same service. Most notably, competition from Saylor & Saylor is hurting his business. Parker and Queazy locate the perfect asteroid that meets the exact specifications of the request, only to find that someone else, a beautiful young woman, already has laid claim to it. She orders them to leave and threatens to report them to the Interplanetary Commission or to shoot them with her spasticizer. Parker explains why the asteroid is so important to them, and the girl explains that if they take it, she will meet a fate worse than death. Then suddenly, the Saylors’ ship comes into view and lands. Billy and Wally Saylor alight along with three other men, threatening Parker. So Parker tells them that he has an ethergram from Mr. Burnsides ordering this specific asteroid, but Wally announces that they also have the order. Bob grabs the girl’s spasticizer while Queazy grabs Billy Saylor and hurls him into space. But Wally shoots the spasticizer out of Bob’s hand, and someone hits Bob hard and knocks him out.\n\tWhen Bob regains consciousness, he is almost out of oxygen. He calls out for Queazy with his last breath, and Queazy responds and brings the ship to pick him up. The girl had rescued Queazy. She introduces herself as Starre Lowenthal, Mr. Burnside’s granddaughter. Her grandfather wants her to marry Mac andwouldn’tt take no for an answer, so finally Starre told him she would marry Mac if he could find an asteroid with specific dimensions and containing the minerals she specified. Bob knows the way the Saylors will have to take the asteroid into Earth’s orbit and knows they can catch up to them. He tells Starre they have to do that to say the business, but they will work out her problem, too. \n\tAfter five days, Bob is in love with Starre, and she knows it. He starts to tell her, but she stops him because of Mac and the bargain she has to live up to. Bob says he thinks her ship is the solution, and she says it’s just a big yo-yo. As Bob thinks about this, he devises a way to use her ship as a yo-yo to attack the Saylors’ ship. They catch up to the Saylors and attack them with Starre’s ship until the Saylors release the asteroid and fly away.\n"
              }
            ]
          },
          {
            "question_text": "What role do the Saylor brothers play in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "1",
                "uid": "386d46cd588944c0b01e5474b324d330",
                "response_text": "The Saylor brothers, Wally and Billy, are Bob Parker’s enemies. Bob was the first person with the unique idea to sell asteroids to wealthy people on earth, and his business would have been very successful if the Saylor brothers did not poach his idea and begin stealing his clients. Bob worries about the Saylor brothers from the beginning of the story, and he acknowledges that they do not always play by the rules. If Wally and Billy can make a buck by inconveniencing or cheating someone else, they will do it. The brothers are not only intimidating in terms of their business prowess; they are also described as giant when compared to Bob. \n\nQueasy and Bob have a legitimate order from Mr. Burnside for the asteroid, and they have no idea that the Saylor brothers have received the same order. Yet, they still worry that somehow, someway, their enemies will hear about the potential to make half a million dollars and try to steal their opportunity out from under them. Within moments of setting eyes on their spaceship, Bob tells Starre that they have to fight the Saylor brothers together. He doesn’t know her at all, and she actually just pulled a gun on him, but he so deeply mistrusts Wally and Billy that it’s worth it to take a chance on Starre.\n\nOf course, Bob turns out to be right. The second the Saylor brothers get a chance to potentially kill Bob, Queazy, and Starre, they take it. Bob floats in space, unconscious, for several weeks before Starre eventually finds Queazy and Bob, and they give him oxygen and food. Bob is truly close to death before his friends save him in the knick of time, and the Saylor brothers would be perfectly fine with that outcome. \n\nWally and Billy give Bob all the motivation in the world to try and steal the asteroid back, and Bob is determined to catch up with his rivals and make it work somehow. When he comes up with his yo-yo idea using Starre’s ship, he shows zero empathy for the Saylor brothers. During his attempts to retrieve the rock, he seriously damages the brothers’ ship, and they have the gall to call him and attempt to make him feel guilty about their desperate state. Bob, however, cannot be swayed. He knows that he found the asteroid first and that the brothers purposefully cast him out into space to die. His determination saves the day when the Saylor brothers are forced to dispatch Mr. Burnside’s asteroid. \n"
              },
              {
                "worker_id": "8",
                "uid": "38148264500c4d498709d1786b411d94",
                "response_text": "Wally and Billy Saylor are boorish twin brothers who operate a company, Saylor & Saylor, that competes with The Interplanetary Hauling & Moving Company operated by Bob and Queazy. The Saylors have cashed in on Bob's \"asteroid in your back yard\" idea like many other companies on Earth, only they have been more successful. Thanks to their lack of business scruples, the Saylors have nearly put Bob and Queazy out of business. Because of this, Bob worries about them taking the asteroid that will net his company $550,000 if they catch wind of his arrangement. Unfortunately, the Saylors have also been hired by the same wealthy client that hired Bob and Queazy because the asteroid request was so unusual and specific, the client wanted to make sure it could be found in time for his granddaughter's wedding. Soon after Bob and Queazy meet the granddaughter, who is making temporary camp on the asteroid to avoid getting married, the Saylors arrive and paralyze the three of them in order to take the asteroid back to Earth and cash in for themselves. After they awaken and reunite, Bob, Queazy, and the granddaughter Starre, race after the Saylors and use Starre's ship as a yo-yo projectile. They damage the Saylors' ship and threaten to kill them so that they will release the asteroid. The Saylors threaten to call the Interplanetary Commission, but Bob is persistent, and he slams their ship again, causing them to give up the asteroid."
              },
              {
                "worker_id": "10",
                "uid": "83005f1ecc264d7fbb6bd1c7d05004c2",
                "response_text": "The Saylor brothers are the antagonists of the story. They have an interplanetary moving company in competition with Bob and Queazy, and are known to be violent in getting their way. \nBecause Mr. Burnside was so desperate to have his granddaughter’s wedding go on, he put the order out to both companies for this exact asteroid, causing the Saylor brothers to come into conflict with Bob and Queazy (who were also trying to deliver it to Earth), and Starre (who was desperate for it to not be delivered to Earth since she didn’t want to get married). The Saylor brothers and three other men violently force all of them off the asteroid and into outer space to die and hurry off to Earth with the asteroid, which is the climax of the story.\nUltimately, Bob, Queasy, and Starre get justice by retrieving the asteroid after they intercept the Saylor brothers and attack their ship using a yo-yo method with Starre’s spaceship they are towing, forcing the Saylor brothers to retreat into outer space.\n"
              },
              {
                "worker_id": "2",
                "uid": "9f842112a409486c92a9c5da495e500f",
                "response_text": "The Saylor brothers provide the conflict and competition that drives Bob Parker and Queazy to search the galaxy for an asteroid with the particular specifications Burnside requests. The Saylors are less-than-honest competitors with Bob’s Interplanetary and Hauling Company. While Bob Parker came up with the “asteroid in your backyard” concept, his competitors, especially the Saylors, soon offer the same service. Bob’s company is on the verge of collapse and must fill Mr. Burnside’s order if it is to survive. In desperation, they take on Burnsides’s almost impossible order. When they find the asteroid, it is occupied by a young girl who turns out to be Burnside’s granddaughter. As they talk with her to try to negotiate for the asteroid, the Saylor brothers arrive, trying to take the asteroid. In the fighting that ensues, the Saylors knock Queazy, Bob, and Starre unconscious, leaving them for dead, and take the asteroid. Bob is unconscious for three weeks, and when he comes to, he is down to five pounds of oxygen. Fortunately, Starre and Queazy find him and save him. Then they set sail for tracking down the Saylor brothers. When they find them, they attack the Saylors’ ship with Starre’s ship, using it like a yo-yo. The Saylors contact Bob to let him know they are losing air and that he is going to kill them; however, they refuse to turn over the asteroid. When Bob hits them again with the yo-yo, they finally give up, release the asteroid, and sail away.\n"
              }
            ]
          },
          {
            "question_text": "Describe Bob's relationship with Starre.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "1",
                "uid": "386d46cd588944c0b01e5474b324d330",
                "response_text": "Bob Parker is taken with Starre Lowenthal from the moment she appears in front of him. Starre wears a spacesuit when Bob and Queazy land on her asteroid and begin conducting tests to see if it’s a good fit for Mr. Burnside, and although Bob can’t get a look at her entire appearance, he is immediately attracted to her blue eyes, beautiful brown hair, and full lips. The fact that Starre is curt and demanding does not change his innate attraction to her. Bob does not get offended by Starre’s refusal to hold a real conversation with him; he just keeps trying. Even Starre’s decision to pull out her spasticizer and aim it at the men doesn’t truly deter Bob. He continues to try and convince her that his economic well-being depends on the asteroid. The only time he becomes annoyed with the beautiful girl is when he sets eyes on her perfect ship and assumes that she is already plenty wealthy. Still, he chooses not to attack nor namecall, he simply uses reason to convince her that the asteroid is more useful to him.\n\nMoments later, when the Saylor brothers show up at Starre’s asteroid, Starre already has a good feeling about Bob and Queazy. That’s why, when Wally and Billy attack the trio, it is Starre that uses her dumbbell-shaped ship to locate the men and save their lives. Bob and Queazy end up owing everything to the beautiful brunette. Without her, their corpses would be floating through space. \n\nThe first time that Bob sees Starre after she saves his life, he notices the paper flower in her hair and the pretty blue outfit she’s wearing. He can’t take his eyes off of her, and his feelings towards her do not change when she admits that she essentially set them up. She is Mr. Burnside’s granddaughter, and she never intended to let anyone find the perfect asteroid and haul it back to earth. She set up a deal with her grandfather that she knew he couldn’t follow through with. Starre does not want to marry Mac, the man that she’s engaged to, and that’s why she was living on the perfect asteroid that Mr. Burnside ordered from Bob and the Saylor brothers. \n\nAlthough Bob has every right to be angry with Starre, he completely falls in love with her on their mission to recollect the asteroid that the Saylor brothers stole from them. He tries to convince her not to marry Mac, but she acknowledges that she must hold up her end of the bargain with her grandfather. Unfortunately, Bob can’t have it both ways. If he wants to save his company from going under, he needs the asteroid, and if he fulfills Mr. Burnside’s order, Starre must marry Mac. \n"
              },
              {
                "worker_id": "8",
                "uid": "38148264500c4d498709d1786b411d94",
                "response_text": "When Bob first meets Starre on the asteroid, he is struck by her physical beauty, but the two of them do not get along. Starre reveals that the asteroid's mineral composition is exactly what Bob had been looking for to fulfill his client's request. However, Starre orders Bob to leave and says he can come back in a month. Although Bob doesn't know this yet, Starre wants to stay there for a month in order to avoid having to get married to her grandfather's protégé Mac and send away anyone who might come and try to take the asteroid back to her grandfather. Starre and Bob mostly have a strained relationship until they are both attacked by the Saylor Brothers and left for dead; Starre proves she is more than the spoiled, rich girl Bob thinks she is when she uses her own ship to save Queazy and then Bob. As they track the Saylor Brothers, Bob slowly falls in love with Starre, who seems to have an interest in Bob, too; however, she feels compelled by her obligation to her grandfather to marry Mac. Although Bob is unhappy that she cannot reciprocate his feelings, he still devises a plan to take down the Saylors and promises Starre they will come up with a plan to help her avoid the marriage. Starre seems pleased by this and encourages Bob as he implements his plan of attack against the Saylor Brothers."
              },
              {
                "worker_id": "10",
                "uid": "83005f1ecc264d7fbb6bd1c7d05004c2",
                "response_text": "Starre Lowenthal is Andrew S. Burnside's granddaughter. She is the cause of her and Bob meeting, since she was the one who ordered this exact asteroid to be delivered to Earth before her wedding - not thinking it would ever actually happen.\nShe rescues both Bob and Queazy after the Saylor brothers attempt to kill all of them by paralyzing them and tossing them into outer space. Starre is crestfallen that she now has to marry Mac, who her grandfather has been pestering her for years to wed. She thought she had the perfect plan to get out of it, but it had all fallen apart when the Saylor brothers were also given the order for the asteroid by her eager grandfather wanting to see the marriage go through. \nDuring the five day journey back to Earth together to intercept the Saylor brothers, Starre and Bob fall in love with each other. Starre provides the idea to make a yo-yo out of her spaceship, and they work happily together with Queazy to get the work done. Bob and Starre are equally elated when the Saylor brothers release the asteroid, though it is unclear what the future for them together holds.\n"
              },
              {
                "worker_id": "2",
                "uid": "9f842112a409486c92a9c5da495e500f",
                "response_text": "When Bob first sees Starre, he is struck by her beauty, but despite her plight, he is determined to take the asteroid to Earth and collect her grandfather’s fee that he needs so badly. Initially, Starre is antagonistic to Bob and Queazy because she is staying on the asteroid to claim it and prevent anyone from taking it. If her grandfather gets hold of it, she will have to marry Mac, a fate she considers worse than death. After the Saylors’ attack on all three of them, Starre and Queazy rescue Bob just as his oxygen is running out. They save his life, and it isn’t long before Bob is in love with her. Starre realizes this, and just before Bob can profess his feelings, she stops him because she will have to keep her word and marry Mac if the asteroid is delivered on time. When Bob devises a way to use Starre’s ship like a yo-yo to attack the Saylors’ ship, he also tells Starre that they will work on a solution to her problem, too. It seems that Bob will try to collect Burnsides’ payment for delivery of the asteroid but somehow prevent Starre from having to marry Mac. \n\n"
              }
            ]
          },
          {
            "question_text": "Why is the mission to secure Mr. Burnside’s asteroid so important to Bob and Queazy?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "1",
                "uid": "386d46cd588944c0b01e5474b324d330",
                "response_text": "Bob and Queazy are willing to risk their lives to try and get the asteroid back from Wally and Billy Saylor because their economic survival depends on it. Bob is the president of Interplanetary Hauling & Moving Co., and his rivals, the Saylor brothers, have put his business in serious jeopardy. Although his novel idea to sell asteroids to wealthy earthmen originally made him some cash, it wasn’t long before other companies got wind of his genius idea and started offering the same service. If the Saylor brothers keep beating Bob and Queazy to the punch, the men will no longer be in business.\n\nWhen Starre demands that Bob and Queazy leave her asteroid since she is the common law owner, both men try to explain to her why they desperately need the rock. The potential to make $550,000 means everything to Bob because his failure to secure that capital means that he and Queazy will lose their business and slave away for the rest of their lives as glass factory workers. \n\n"
              },
              {
                "worker_id": "8",
                "uid": "38148264500c4d498709d1786b411d94",
                "response_text": "Bob Parker created the idea of the \"asteroid in your back yard\", and since then it has become a fad sweeping Earth. As a result, a number of moving companies have emerged as competitors to Bob's Interplanetary Hauling & Moving Co., primarily Saylor & Saylor. The Saylor brothers engage in unscrupulous business practices and have crippled Bob's business to the point of desperation. Therefore, Bob and his business partner Queazy need to fulfill Mr. Burnside's extremely specific wedding-asteroid request for his granddaughter; successful completion of the order would net their company $550,000 and save them from financial ruin. "
              },
              {
                "worker_id": "10",
                "uid": "83005f1ecc264d7fbb6bd1c7d05004c2",
                "response_text": "This mission to secure Mr. Burnside’s asteroid is so important to Bob and Queazy because it will pay them $5.00 per ton, which they estimate will net them $550,000. They look for it for three weeks before finding it, demonstrating how valuable this job is to them.\nSecuring the asteroid is also a point of pride for them, as they feel their business is threatened by the rival Saylor brothers, and the success of this mission would demonstrate their claim in the business of interplanetary deliveries.\n"
              },
              {
                "worker_id": "2",
                "uid": "9f842112a409486c92a9c5da495e500f",
                "response_text": "Securing Mr. Burnside’s asteroid is critical for Bob’s business to survive. He is having financial difficulty due to stiff competition, particularly from the Saylor brothers. The $550,000 from Mr. Burnside will help prevent his company from going bankrupt and going out of business. Burnside’s order for an asteroid in his back yard is quite specific: it must be 506 feet long, 98 feet at the base and tapering to 10 feet at the apex, 9-12 feet thick, a smooth plane on the top side and a rough plane underneath. It must also be composed of iron ore, tungsten, quartz crystals, and cinnabar. It has to be in Burnside’s back yard before 11:30 am on June 2. The order is so specific that normally Bob and Queazy would not have accepted it, but since the business is about to fold, they are desperate and willing to try to fill it. When they find the asteroid in just three weeks, it seems they have had an incredible stroke of good luck, until the Saylor brothers show up to claim it, too. Filling the Burnsides order is a matter of life or death for Bob and Queazy’s company, and they are prepared to do everything humanly possible to collect the asteroid and take to Earth.\n\n"
              }
            ]
          },
          {
            "question_text": "How does Bob Parker almost die?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "1",
                "uid": "386d46cd588944c0b01e5474b324d330",
                "response_text": "Bob Parker almost dies after the Saylor brothers find Starre’s asteroid and decide that although Bob and Queazy landed on it first, they want to be the ones to fulfill Mr. Burnside’s order. Bob tries to defend his turf with Starre’s spasticizer, but Wally is able to shoot the gun out of his hands. Bob is unable to defend himself from the ginormous Saylor brothers after he loses Starre’s weapon, and he is beaten in the stomach and thrown into space to float with little oxygen and zero sustenance. He remains isolated, drifting through space, for three weeks before his friend Queazy and Starre are able to locate him. He describes the sensation as “being buried alive.” At the time that he is found, he has only a few short days of oxygen left until he will choke to death. "
              },
              {
                "worker_id": "8",
                "uid": "38148264500c4d498709d1786b411d94",
                "response_text": "Soon after Bob and Queazy meet Starre Lowenthal on the asteroid, Wally and Billy Saylor arrive to claim the asteroid for themselves and deliver it to Mr. Burnside. When Bob realizes both companies have received orders from Mr. Burnside, he threatens to report the brothers to the Interplanetary Commission since he arrived at the asteroid first and the law dictates ownership goes to whoever arrived first. Then, Bob grabs Starre's paralyzing spasticizer and signals to Queazy, who quickly throws Billy Saylor into space. Wally shoots the spasticizer from Bob's hand, and Bob knocks Wally's gun away. At the same time, Bob feels a sudden crushing pain and hears Starre screaming before he blacks out. When Bob awakens later, he discovers he is alone in the vastness of space and running out of air. The Saylor brothers have taken the asteroid and left him there to die, separated from Queazy and Starre. He realizes he has only five pounds of air pressure left, and he had been shot by spastic rays. However, his state of suspended animation likely kept him alive long enough to be saved by Queazy and Starre because his body didn't require as much oxygen."
              },
              {
                "worker_id": "10",
                "uid": "83005f1ecc264d7fbb6bd1c7d05004c2",
                "response_text": "Bob Parker almost dies while fighting with the Saylor brothers on the asteroid that he was ordered to deliver by Mr. Burnside. The Saylor brothers are known for using rough force to get their way, and after Bob wakes up unconscious and running out of air (only five pound of pressure left) spinning alone in outer space, he concludes that he must have been given a dose of spastic rays that effected his muscles in an extreme way that caused him to go into suspended animation with very low oxygen demand. \nHe had been floating like that for three weeks before he regained consciousness at the last possible moment before he was going to die alone, and was then rescued by Queazy and Starre after calling on the intercom one last time. His narrow rescue gives him added purpose in retaliating against the Saylor brothers to retrieve the asteroid, which may ultimately win him his love, Starre.\n"
              },
              {
                "worker_id": "2",
                "uid": "9f842112a409486c92a9c5da495e500f",
                "response_text": "Bob Parker almost dies after the face-to-face encounter with the Saylor brothers on the asteroid. When he grabs Starre’s spasticizer to use against them, Wally shoots it out of his hand. Someone hits Bob so hard that he is knocked unconscious and off the asteroid so that he is floating in space. When he regains consciousness, he is down to 5 pounds of oxygen, and as this supply dwindles, he grows weaker, knowing that he is dying either of oxygen deprivation or starvation from being unconscious for so long. Just as his oxygen runs out, Bob curses the Saylor brothers and calls out to Queazy one last time--and Queazy responds. He and Starre locate Bob, and they provide him with oxygen. Queasy explains they would both be dead if not for Starre; she was knocked unconscious, too, but came to and made her way to her ship. She used the direction-finder on the telaudio to locate Queazy and pick him up. Then when they got Bob’s signal, they found him, too. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5071,
        "document_length_chars": 29719
      }
    }
  ]
}