{
  "item_metadata": {
    "item_id": "63616",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63616",
      "content": "HAGERTY'S ENZYMES\n \n\n By A. L. HALEY\n \n There's a place for every man and a man for every place, but on robot-harried Mars the situation was just a little different.\n \n \n [Transcriber's Note: This etext was produced from Planet Stories Spring 1955. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Harper Breen sank down gingerly into the new Relaxo-Lounge. He placed twitching hands on the arm-rests and laid his head back stiffly. He closed his fluttering eyelids and clamped his mouth to keep the corner from jumping.\n \n \"Just lie back, Harp,\" droned his sister soothingly. \"Just give in and let go of everything.\"\n \n Harper tried to let go of everything. He gave in to the chair. And gently the chair went to work. It rocked rhythmically, it vibrated tenderly. With velvety cushions it massaged his back and arms and legs.\n \n For all of five minutes Harper stood it. Then with a frenzied lunge he escaped the embrace of the Relaxo-Lounge and fled to a gloriously stationary sofa.\n \n \"Harp!\" His sister, Bella, was ready to weep with exasperation. \"Dr. Franz said it would be just the thing for you! Why won't you give it a trial?\"\n \n Harper glared at the preposterous chair. \"Franz!\" he snarled. \"That prize fathead! I've paid him a fortune in fees. I haven't slept for weeks. I can't eat anything but soup. My nerves are jangling like a four-alarm fire. And what does he prescribe? A blasted jiggling baby carriage! Why, I ought to send him the bill for it!\" Completely outraged, he lay back on the couch and closed his eyes.\n \n \"Now, Harp, you know you've never obeyed his orders. He told you last year that you'd have to ease up. Why do you have to try to run the whole world? It's the strain of all your business worries that's causing your trouble. He told you to take a long vacation or you'd crack up. Don't blame him for your own stubbornness.\"\n \n Harper snorted. His large nose developed the sound magnificently.\n\"Vacation!\" he snorted. \"Batting a silly ball around or dragging a hook after a stupid fish! Fine activities for an intelligent middle-aged man! And let me correct you. It isn't business worries that are driving me to a crack-up. It's the strain of trying to get some sensible, reasonable coöperation from the nincompoops I have to hire! It's the idiocy of the human race that's got me whipped! It's the—\"\n \n \"Hey, Harp, old man!\" His brother-in-law, turning the pages of the new colorama magazine, INTERPLANETARY, had paused at a double-spread.\n\"Didn't you have a finger in those Martian equatorial wells they sunk twenty years ago?\"\n \n Harper's hands twitched violently. \"Don't mention that fiasco!\" he rasped. \"That deal nearly cost me my shirt! Water, hell! Those wells spewed up the craziest conglomeration of liquids ever tapped!\"\n \n \n\n \n Scribney, whose large, phlegmatic person and calm professorial brain were the complete antithesis of Harper's picked-crow physique and scheming financier's wits, looked severely over his glasses. Harp's nervous tribulations were beginning to bore him, as well as interfere with the harmony of his home.\n \n \"You're away behind the times, Harp,\" he declared. \"Don't you know that those have proved to be the most astoundingly curative springs ever discovered anywhere? Don't you know that a syndicate has built the largest extra-terrestial hotel of the solar system there and that people are flocking to it to get cured of whatever ails 'em? Old man, you missed a bet!\"\n \n Leaping from the sofa, Harper rudely snatched the magazine from Scribney's hands. He glared at the spread which depicted a star-shaped structure of bottle-green glass resting jewel-like on the rufous rock of Mars. The main portion of the building consisted of a circular skyscraper with a glass-domed roof. Between its star-shaped annexes, other domes covered landscaped gardens and noxious pools which in the drawing looked lovely and enticing.\n \n \"Why, I remember now!\" exclaimed Bella. \"That's where the Durants went two years ago! He was about dead and she looked like a hag. They came back in wonderful shape. Don't you remember, Scrib?\"\n \n Dutifully Scribney remembered and commented on the change the Martian springs had effected in the Durants. \"It's the very thing for you, Harp,\" he advised. \"You'd get a good rest on the way out. This gas they use in the rockets nowadays is as good as a rest-cure; it sort of floats you along the time-track in a pleasant daze, they tell me. And you can finish the cure at the hotel while looking it over. And not only that.\" Confidentially he leaned toward his insignificant looking brother-in-law. \"The chemists over at Dade McCann have just isolated an enzyme from one species of Martian fungus that breaks down crude oil into its components without the need for chemical processing. There's a fortune waiting for the man who corners that fungus market and learns to process the stuff!\"\n \n Scribney had gauged his victim's mental processes accurately. The magazine sagged in Harp's hands, and his sharp eyes became shrewd and calculating. He even forgot to twitch. \"Maybe you're right, Scrib,\" he acknowledged. \"Combine a rest-cure with business, eh?\"\n \n Raising the magazine, he began reading the advertisement. And that was when he saw the line about the robots. \"—the only hotel staffed entirely with robot servants—\"\n \n \"Robots!\" he shrilled. \"You mean they've developed the things to that point? Why hasn't somebody told me? I'll have Jackson's hide! I'll disfranchise him! I'll—\"\n \n \"Harp!\" exploded Bella. \"Stop it! Maybe Jackson doesn't know a thing about it, whatever it is! If it's something at the Emerald Star Hotel, why don't you just go and find out for yourself instead of throwing a tantrum? That's the only sensible way!\"\n \n \"You're right, Bella,\" agreed Harper incisively. \"I'll go and find out for myself. Immediately!\" Scooping up his hat, he left at his usual lope.\n \n \"Well!\" remarked his sister. \"All I can say is that they'd better turn that happy-gas on extra strong for Harp's trip out!\"\n \n \n\n \n The trip out did Harper a world of good. Under the influence of the soporific gas that permeated the rocket, he really relaxed for the first time in years, sinking with the other passengers into a hazy lethargy with little sense of passing time and almost no memory of the interval.\n \n It seemed hardly more than a handful of hours until they were strapping themselves into deceleration hammocks for the landing. And then Harper was waking with lassitude still heavy in his veins. He struggled out of the hammock, made his way to the airlock, and found himself whisked by pneumatic tube directly into the lobby of the Emerald Star Hotel.\n \n Appreciatively he gazed around at the half-acre of moss-gray carpeting, green-tinted by the light sifting through the walls of Martian copper-glass, and at the vistas of beautiful domed gardens framed by a dozen arches. But most of all, the robots won his delighted approval.\n \n He could see at once that they had been developed to an amazingly high state of perfection. How, he wondered again, had this been done without his knowledge? Was Scrib right? Was he slipping? Gnawing at the doubt, he watched the robots moving efficiently about, pushing patients in wheelchairs, carrying trays, guiding newcomers, performing janitorial duties tirelessly, promptly, and best of all, silently.\n \n Harper was enthralled. He'd staff his offices with them. Hang the expense! There'd be no more of that obnoxious personal friction and proneness to error that was always deviling the most carefully trained office staffs! He'd investigate and find out the exact potentialities of these robots while here, and then go home and introduce them into the field of business. He'd show them whether he was slipping! Briskly he went over to the desk.\n \n He was immediately confronted with a sample of that human obstinacy that was slowly driving him mad. Machines, he sighed to himself. Wonderful silent machines! For a woman was arguing stridently with the desk clerk who, poor man, was a high strung fellow human instead of a robot. Harper watched him shrinking and turning pale lavender in the stress of the argument.\n \n \"A nurse!\" shouted the woman. \"I want a nurse! A real woman! For what you charge, you should be able to give me a television star if I want one! I won't have another of those damnable robots in my room, do you hear?\"\n \n No one within the confines of the huge lobby could have helped hearing. The clerk flinched visibly. \"Now, Mrs. Jacobsen,\" he soothed. \"You know the hotel is staffed entirely with robots. They're much more expensive, really, than human employees, but so much more efficient, you know. Admit it, they give excellent service, don't they, now?\" Toothily he smiled at the enraged woman.\n \n \"That's just it!\" Mrs. Jacobsen glared. \"The service is too good. I might just as well have a set of push buttons in the room. I want someone to hear what I say! I want to be able to change my mind once in awhile!\"\n \n Harper snorted. \"Wants someone she can devil,\" he diagnosed. \"Someone she can get a kick out of ordering around.\" With vast contempt he stepped to the desk beside her and peremptorily rapped for the clerk.\n \n \"One moment, sir,\" begged that harassed individual. \"Just one moment, please.\" He turned back to the woman.\n \n But she had turned her glare on Harper. \"You could at least be civil enough to wait your turn!\"\n \n Harper smirked. \"My good woman, I'm not a robot. Robots, of course, are always civil. But you should know by now that civility isn't a normal human trait.\" Leaving her temporarily quashed, he beckoned authoritatively to the clerk.\n \n \"I've just arrived and want to get settled. I'm here merely for a rest-cure, no treatments. You can assign my quarters before continuing your—ah—discussion with the lady.\"\n \n The clerk sputtered. Mrs. Jacobsen sputtered. But not for nothing was Harper one of the leading business executives of the earth. Harper's implacable stare won his point. Wiping beads of moisture from his forehead, the clerk fumbled for a card, typed it out, and was about to deposit it in the punch box when a fist hit the desk a resounding blow and another voice, male, roared out at Harper's elbow.\n \n \"This is a helluva joint!\" roared the voice. \"Man could rot away to the knees while he's waitin' for accommodations. Service!\" Again his fist banged the counter.\n \n The clerk jumped. He dropped Harper's card and had to stoop for it. Absently holding it, he straightened up to face Mrs. Jacobsen and the irate newcomer. Hastily he pushed a tagged key at Harper.\n \n \"Here you are, Mr. Breen. I'm sure you'll find it comfortable.\" With a pallid smile he pressed a button and consigned Harper to the care of a silent and efficient robot.\n \n \n\n \n The room was more than comfortable. It was beautiful. Its bank of clear windows set in the green glass wall framed startling rubicund views of the Martian hinterland where, Harper affectionately thought, fungi were busy producing enzymes that were going to be worth millions for him and his associates. There remained only the small detail of discovering how to extract them economically and to process them on this more than arid and almost airless planet. Details for his bright young laboratory men; mere details....\n \n Leaving his luggage to be unpacked by the robot attendant, he went up to the domed roof restaurant. Lunching boldly on broiled halibut with consomme, salad and a bland custard, he stared out at the dark blue sky of Mars, with Deimos hanging in the east in three-quarter phase while Phobos raced up from the west like a meteor behind schedule. Leaning back in his cushioned chair, he even more boldly lit a slim cigar—his first in months—and inhaled happily. For once old Scribney had certainly been right, he reflected. Yes sir, Scrib had rung the bell, and he wasn't the man to forget it. With a wonderful sense of well-being he returned to his room and prepared to relax.\n \n Harper opened his eyes. Two robots were bending over him. He saw that they were dressed in white, like hospital attendants. But he had no further opportunity to examine them. With brisk, well-co-ordinated movements they wheeled a stretcher along-side his couch, stuck a hypo into his arm, bundled him onto the stretcher and started wheeling him out.\n \n Harper's tongue finally functioned. \"What's all this?\" he demanded.\n\"There's nothing wrong with me. Let me go!\"\n \n He struggled to rise, but a metal hand pushed him firmly on the chest. Inexorably it pushed him flat.\n \n \"You've got the wrong room!\" yelled Harp. \"Let me go!\" But the hypo began to take effect. His yells became weaker and drowsier. Hazily, as he drifted off, he thought of Mrs. Jacobsen. Maybe she had something, at that.\n \n \n\n \n There was a tentative knock on the door. \"Come in,\" called Harper bleakly. As soon as the door opened he regretted his invitation, for the opening framed the large untidy man who had noisily pounded on the desk demanding service while he, Harp, was being registered.\n \n \"Say, pardner,\" he said hoarsely, \"you haven't seen any of them robots around here, have you?\"\n \n Harper scowled. \"Oh, haven't I?\" he grated. \"Robots! Do you know what they did to me.\" Indignation lit fires in his pale eyes. \"Came in here while I was lying down peacefully digesting the first meal I've enjoyed in months, dragged me off to the surgery, and pumped it all out! The only meal I've enjoyed in months!\" Blackly he sank his chin onto his fist and contemplated the outrage.\n \n \"Why didn't you stop 'em?\" reasonably asked the visitor.\n \n \"Stop a robot?\" Harper glared pityingly. \"How? You can't reason with the blasted things. And as for using force—it's man against metal. You try it!\" He ground his teeth together in futile rage. \"And to think I had the insane notion that robots were the last word! Why, I was ready to staff my offices with the things!\"\n \n The big man placed his large hands on his own capacious stomach and groaned. \"I'm sure sorry it was you and not me, pardner. I could use some of that treatment right now. Musta been that steak and onions I ate after all that tundra dope I've been livin' on.\"\n \n \"Tundra?\" A faint spark of alertness lightened Harper's dull rage. \"You mean you work out here on the tundra?\"\n \n \"That's right. How'd you think I got in such a helluva shape? I'm superintendent of one of the fungus plants. I'm Jake Ellis of Hagerty's Enzymes. There's good money in it, but man, what a job! No air worth mentionin'. Temperature always freezin' or below. Pressure suits. Huts. Factory. Processed food. Nothin' else. Just nothin'. That's where they could use some robots. It sure ain't no job for a real live man. And in fact, there ain't many men left there. If old man Hagerty only knew it, he's about out of business.\"\n \n Harper sat up as if he'd been needled. He opened his mouth to speak. But just then the door opened briskly and two robots entered. With a horrified stare, Harper clutched his maltreated stomach. He saw a third robot enter, wheeling a chair.\n \n \"A wheel chair!\" squeaked the victim. \"I tell you, there's nothing wrong with me! Take it away! I'm only here for a rest-cure! Believe me! Take it away!\"\n \n The robots ignored him. For the first time in his spectacular and ruthless career Harper was up against creatures that he could neither bribe, persuade nor browbeat, inveigle nor ignore. It shattered his ebbing self-confidence. He began waving his hands helplessly.\n \n The robots not only ignored Harper. They paid no attention at all to Jake Ellis, who was plucking at their metallic arms pleading, \"Take me, boys. I need the treatment bad, whatever it is. I need all the treatment I can get. Take me! I'm just a wreck, fellers—\"\n \n Stolidly they picked Harper up, plunked him into the chair, strapped him down and marched out with him.\n \n \n\n \n Dejectedly Ellis returned to his own room. Again he lifted the receiver of the room phone; but as usual a robot voice answered sweetly, mechanically, and meaninglessly. He hung up and went miserably to bed.\n \n \n\n \n There was something nagging at Harper's mind. Something he should do. Something that concerned robots. But he was too exhausted to think it out.\n \n For five days now his pet robots had put him through an ordeal that made him flinch every time he thought about it. Which wasn't often, since he was almost past thinking. They plunked him into stinking mud-baths and held him there until he was well-done to the bone, he was sure. They soaked him in foul, steaming irradiated waters until he gagged. They brought him weird concoctions to eat and drink and then stood over him until he consumed them. They purged and massaged and exercised him.\n \n Whenever they let him alone, he simply collapsed into bed and slept. There was nothing else to do anyway. They'd taken his clothes; and the phone, after an announcement that he would have no more service for two weeks, gave him nothing but a busy signal.\n \n \"Persecution, that's what it is!\" he moaned desperately. And he turned his back to the mirror, which showed him that he was beginning to look flesh-colored instead of the parchment yellow to which he had become accustomed. He closed his mind to the fact that he was sleeping for hours on end like the proverbial baby, and that he was getting such an appetite that he could almost relish even that detestable mush they sent him for breakfast. He was determined to be furious. As soon as he could wake up enough to be.\n \n He hadn't been awake long this time before Jake Ellis was there again, still moaning about his lack of treatments. \"Nothin' yet,\" he gloomily informed Harp. \"They haven't been near me. I just can't understand it. After I signed up for the works and paid 'em in advance! And I can't find any way out of this section. The other two rooms are empty and the elevator hasn't got any button. The robots just have to come and get a man or he's stuck.\"\n \n \"Stuck!\" snarled Harp. \"I'm never stuck! And I'm damned if I'll wait any longer to break out of this—this jail! Listen, Jake. I've been thinking. Or trying to, with what's left of me. You came in just when that assinine clerk was registering me. I'll bet that clerk got rattled and gave me the wrong key. I'll bet you're supposed to have this room and I'm getting your treatments. Why don't we switch rooms and see what happens?\"\n \n \"Say, maybe you're right!\" Jake's eyes gleamed at last with hope. \"I'll get my clothes.\"\n \n Harp's eyebrows rose. \"You mean they left you your clothes?\"\n \n \"Why, sure. You mean they took yours?\"\n \n Harp nodded. An idea began to formulate. \"Leave your things, will you? I'm desperate! I'm going to see the manager of this madhouse if I have to go down dressed in a sheet. Your clothes would be better than that.\"\n \n Jake, looking over Harper's skimpy frame, grunted doubtfully. \"Maybe you could tie 'em on so they wouldn't slip. And roll up the cuffs. It's okay with me, but just don't lose something when you're down there in that fancy lobby.\"\n \n Harper looked at his watch. \"Time to go. Relax, old man. The robots will be along any minute now. If you're the only man in the room, I'm sure they'll take you. They aren't equipped to figure it out. And don't worry about me. I'll anchor your duds all right.\"\n \n Harper had guessed right. Gleefully from the doorway of his new room he watched the robots wheel away his equally delighted neighbor for his first treatment. Then he closed the door and began to don Jake's clothing.\n \n The result was unique. He looked like a small boy in his father's clothes, except for the remarkably aged and gnome-like head sticking up on a skinny neck from a collar three sizes too big. And he was shoeless. He was completely unable to navigate in Jake's number twelves. But Harper was a determined man. He didn't even flinch from his image in the mirror. Firmly he stepped over to Jake's telephone.\n\"This is room 618,\" he said authoritatively. \"Send up the elevator for me. I want to go down to the lobby.\"\n \n He'd guessed right again. \"It will be right up, sir,\" responded the robot operator. Hopefully he stepped out into the hall and shuffled to the elevator.\n \n \n\n \n Only the robots were immune to Harper Breen's progress across the huge suave lobby.\n \n He was a blot on its rich beauty, a grotesque enigma that rooted the other visitors into paralyzed staring groups. Stepping out of the elevator, he had laid a course for the desk which loomed like an island in a moss-gray lake, and now he strode manfully toward it, ignoring the oversize trousers slapping around his stocking feet. Only the robots shared his self control.\n \n The clerk was the first to recover from the collective stupor. Frantically he pushed the button that would summon the robot guard. With a gasp of relief he saw the two massive manlike machines moving inexorably forward. He pointed to Harper. \"Get that patient!\" he ordered. \"Take him to the—to the mud-baths!\"\n \n \"No you don't!\" yelled Harper. \"I want to see the manager!\" Nimbly he circled the guard and leaped behind the desk. He began to throw things at the robots. Things like inkwells and typewriters and card indexes. Especially, card indexes.\n \n \"Stop it!\" begged the clerk. \"You'll wreck the system! We'll never get it straight again! Stop it!\"\n \n \"Call them off!\" snarled Harper. \"Call them off or I'll ruin your switchboard!\" He put a shoulder against it and prepared to heave.\n \n With one last appalled glare at the madman, the clerk picked up an electric finger and pointed it at the approaching robots. They became oddly inanimate.\n \n \"That's better!\" Harper straightened up and meticulously smoothed the collar of his flapping coat. \"Now—the manager, please.\"\n \n \"This—this way, sir.\" With shrinking steps the clerk led Harper across the width of the lobby among the fascinated guests. He was beyond speech. Opening the inconspicuous door, he waved Harper inside and returned doggedly to his desk, where he began to pick up things and at the same time phrase his resignation in his mind.\n \n Brushing aside the startled secretary in the outer cubicle, Harper flapped and shuffled straight into the inner sanctum. The manager, who was busy chewing a cigar to shreds behind his fortress of gun metal desk, jerked hastily upright and glared at the intruder. \"My good man—\" he began.\n \n \"Don't 'my-good-man' me!\" snapped Harper. He glared back at the manager. Reaching as far across the expanse of desktop as he could stretch, he shook his puny fist. \"Do you know who I am? I'm Harper S. Breen, of Breen and Helgart, Incorporated! And do you know why I haven't even a card to prove it? Do you know why I have to make my way downstairs in garb that makes a laughing stock of me? Do you know why? Because that assinine clerk of yours put me in the wrong room and those damnable robots of yours then proceeded to make a prisoner of me! Me, Harper S. Breen! Why, I'll sue you until you'll be lucky if you have a sheet of writing-paper left in this idiot's retreat!\"\n \n Hayes, the manager, blanched. Then he began to mottle in an apoplectic pattern. And suddenly with a gusty sigh, he collapsed into his chair. With a shaking hand he mopped his forehead. \" My robots!\" he muttered.\n\"As if I invented the damned things!\"\n \n Despondently he looked at Harper. \"Go ahead and sue, Mr. Breen. If you don't, somebody else will. And if nobody sues, we'll go broke anyway, at the rate our guest list is declining. I'm ready to hand in my resignation.\"\n \n Again he sighed. \"The trouble,\" he explained, \"is that those fool robots are completely logical, and people aren't. There's no way to mix the two. It's dynamite. Maybe people can gradually learn to live with robots, but they haven't yet. Only we had to find it out the hard way. We—\" he grimaced disgustedly—\"had to pioneer in the use of robots. And it cost us so much that we can't afford to reconvert to human help. So—Operation Robot is about to bankrupt the syndicate.\"\n \n Listening, an amazing calm settled on Harper. Thoughtfully now he hooked a chair to the desk with his stockinged foot, sat down and reached for the cigar that Hayes automatically offered him. \"Oh, I don't know,\" he said mildly.\n \n Hayes leaned forward like a drowning man sighting a liferaft. \"What do you mean, you don't know? You're threatening to take our shirts, aren't you?\"\n \n Meticulously Harper clipped and lit his cigar. \"It seems to me that these robots might be useful in quite another capacity. I might even make a deal with your syndicate to take them off your hands—at a reasonable price, of course—and forget the outrages I've suffered at your establishment.\"\n \n Hayes leaned toward him incredulous. \"You mean you want these robots after what you've seen and experienced?\"\n \n Placidly Harper puffed a smoke ring. \"Of course, you'd have to take into consideration that it would be an experiment for me, too. And there's the suit I'm clearly justified in instituting. However, I'm willing to discuss the matter with your superiors.\"\n \n With hope burgeoning for the first time in weeks, Hayes lifted his head. \"My dear Mr. Breen, to get rid of these pestiferous robots, I'll back you to the hilt! I'll notify the owners at once. At once, Mr. Breen! And while we wait for them, allow me to put you up as a guest of the hotel.\" Coming around to Harper, he effusively shook Harp's scrawny hand, and then personally escorted him not merely to the door but across the lobby to the elevator.\n \n Harper gazed out at the stunned audience. This was more like the treatment he was accustomed to! Haughtily he squared his bony shoulders inside the immense jacket and stepped into the elevator. He was ready for the second step of his private Operation Robot.\n \n \n\n \n Back on Earth it was a warm, misty spring day—the kind of day unknown to the planet Mars. Bella and Scribney, superb in new spring outfits, waited restlessly while the rocket cooled and the passengers recovered from deceleration.\n \n \"Look, Scrib!\" Bella clutched Scribney's substantial arm. \"It's finally opening.\"\n \n They watched the airlock open and the platform wheel into place. They watched the passengers descend, looking a trifle dazed.\n \n \"There he is!\" cried Bella. \"Why, doesn't he look wonderful! Scrib, it's amazing! Look at him!\n \n And indeed, Harper was stepping briskly downward, looking spry and fit and years younger. He came across to them actually beaming. It was the first pleasant expression they had seen on his face in years.\n \n \"Well, you old dog!\" exclaimed Scribney affectionately. \"So you did it again!\"\n \n Harper smirked. \"Yep, I turned a neat little deal. I bought out Hagerty's Enzymes and staffed the plant with the hotel's robots. Got both of 'em dirt cheap. Both concerns going bankrupt because they didn't have sense enough to swap their workers. Feel I owe you a bit for that tip about enzymes, Scrib, so I made out a block of stock to you. All right?\"\n \n \"All right?\" Scribney gulped. Why, the dried-up little turnip was human after all. \"All right! Yes, sir! But aren't you going to use some of those robots for office help? Aren't they efficient and all that?\"\n \n Harper's smile vanished. \"Don't even mention such a thing!\" he yelped.\n\"You don't know what you're saying! I lived with those things for weeks. I wouldn't have one around! Keep 'em in the factory where they belong!\"\n \n He glimpsed the composed, wonderfully human face of his secretary, waiting patiently in the background. \"Oh there you are, Smythe.\" He turned to his relatives. \"Busy day ahead. See you later, folks—\"\n \n \"Same old Harp,\" observed Scribney. Then he thought of the block of stock. \"What say we celebrate our rise to a position in the syndicate, honey?\"\n \n \"Wonderful!\" She squeezed his arm, and smiling at each other, they left the port.",
      "metadata": {
        "title": "Hagerty's Enzymes",
        "author": "A. L. Haley",
        "passage_id": "63616",
        "uid": "1834a081a5024a61889fa71a19cb88f1",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "106",
                "uid": "e771011d17e94e22b8f860305f70a41c",
                "response_text": "Harper Breen is exhausted. His business worries are keeping him up at night, and he hasn't had a proper night's sleep in too long. His brother in law, Scribney , suggests paying a visit to a hotel on mars, where they have equatorial wells which cure people's ailments.  There is also a fungus that grows there that breaks down crude oil, a financial gold mine! \nHarper decides to go to this hotel, both for rest and the opportunity of getting into this new fungi business. After what seems like a mere number of hours, the rocket comes into land, and Harper goes directly to the lobby of the Emerald Star Hotel. \nHarper notices the beauty of his surroundings, and how the entire hotel is staffed by very efficient, silent robots. He goes over to the desk, where a woman is complaining to the clerk about the treatment she is receiving from these robots. Harper decides to go over and interrupt the conversation, asking for his room key. \nA large man walks over, also asking for service. In a panic, the clerk hastily gives a room key to Harper, and hands him off to a robot to show him to his room. \nHarper arrives in his room where he gets settled, and then makes his way to the restaurant. Suddenly, Harper wakes up to see two robots bending over him. They take him by force and wheel him away into surgery. \nHarper wakes up to find the same man from the clerk desk knocking at his door. The man introduces himself as Jake Ellis, of Hagerty's Enzymes. He works on the tundra in the fungus \nplants. Two more robots enter and take Harper away again. Hey put him through a rigorous amount of detoxing procedures that wipe him out. \nHe speaks with Ellis again, who complains that he hasn't received any treatments yet. Harper proposes that the clerk probably mixed up their room keys. They decide to switch rooms and clothes to see what happens.  \nHarper goes to Ellis' room, puts on his clothes, and walks down to the lobby, where he meets the clerk once again. He demands to see the manager, and after an altercation, the clerk shows him to his office. \nHarper states to the manager that he is Harper S. Breen, of Breen and Helgart Inc. He complains to him about the treatment he had received because the clerk mixed up his room key.\nThe manager tells him to sue if he wants, the business is already failing. He knows the robots are turning people away. Breen tells the manager that he could take the robots off his hands, for a reasonable price, that way the hotel would be able to afford real nurses again. \nHarper arrives back on Earth to tell his sister and brother in law that he has bought out Hagerty's Enzymes, and staffed it with the robots from the hotel. "
              },
              {
                "worker_id": "105",
                "uid": "396806fb81454d70a6d7a6905357a773",
                "response_text": "Harper Breen is nervous, he has troubles sleeping and eating, his business and employees drive him crazy. His sister is urging him to follow Dr. Franz's instructions to go on vacation. Harp's brother-in-law, Scribney, intervenes and shows a picture of the most luxurious hotel on Mars with curative springs. Scribney also hints Harper about a business opportunity in the hotel. It convinces Harper and he decides to combine rest with business after all. He soon boards on the rocket that is filled with soporific gas, so Harper arrives at the hotel lobby relaxed. The hotel is gorgeous indeed and the robots are offering all kinds of services throughout the place. The least impresses Harp as his human employees are the source of his irritation, so his new goal is to introduce the robots to his office later. Then he hears a woman at the front desk demanding a human nurse as the robots are too good and she wants to be heard. Harper proceeds to his room with a beautiful view and enjoys the silent robots' company. Then he dines in the rooftop restaurant and returns to his room in a good mood, willing to relax. Suddenly, he is bundled onto the stretcher and wheeled out by two robots, though he asked for no nursing. Harper is outraged with the robots pumping out all of his meal and at his own helplessness, he is disappointed in the machines. He tells all of this to his unexpected visitor, Jake Ellis, who, on the contrary, desperately wants treatment. Turns out the man works in severe conditions in tundra with fungus plants. His owner is soon going to be broke, as the workers quit the hard job which better fits robots. For the next couple days Harper is forced to go through various procedures which make him look and feel better, but also make him angry with being helpless. He believes there is a mistake and offers to switch rooms with Jake, who still desperately wants his treatment. Harper puts on Jake's huge clothes and goes to the lobby looking ridiculous. When a clerk orders the robot guards to take the patient away, Harper starts fighting back, and the clerk, scared the system would break, calls them off. Harper is led to the manager and after a brief outburst of his rage the manager tells that the hotel is going broke anyway, because people can't mix with robots, so he doesn't care what Harper can do to him. Now the hotel can't hire humans as it has spent all the money on robots and Harper offers to buy them. When he returns to Earth, he is met by Bella, his sister, and Scribney. Harper says he bought both the robots and the enzymes and switched the workers, saving both firms from bankruptcy. He also mentions never wanting even one robot around and starts appreciating his employees. \n"
              },
              {
                "worker_id": "107",
                "uid": "5ad926ba2d7b4b7992f9cdb92191172a",
                "response_text": "Harper Breen is constantly stressed out and tries to relax in his new Relaxo-Lounge. However, he quickly hurries out of the chair, making his sister Bella despair. He angrily calls out Dr. Franz for another useless method. Bella insists on a vacation, but Harper vehemently denies the idea because he is busy. His brother-in-law brings up his involvement in the sinking of Martian equatorial wells twenty years ago, making him even angrier. Scribney shows Harper a hotel completely staffed by robots. Bella mentions that the Durants came back from that place in much better shape after resting in the Martian springs. Scribney also brings up the possibility for great fortune because of the discovery breakthrough involving enzymes and Martian fungi. Harper agrees to the vacation because he can rest and do business. Once he arrives at the Emerald Star hotel, he observes how the robots work at perfect efficiency and silently. He then sees a woman arguing with the human desk clerk about seeing a real human nurse. Harper concludes that she wants somebody to boss around and strides confidently to check himself in. She is offended by his intrusion, but he reminds her that civility is not a normal human trait. As the clerk checks him in, another newcomer comes to complain. Harper goes to his beautiful room and begins to enjoy his vacation. After lunch and smoking a cigar, two robots come to his room for treatment. Later, the newcomer returns and asks Harper about the service he received from the robots earlier. The man introduces himself as Jake Ellis of Hagerty’s Enzymes. Harper becomes interested in the company he works at, but three robots come inside to take him away on a wheelchair before he can say more. They also ignore Jake Ellis, who continuously pleads for treatment. The robots put him through similar ordeals for the next five days, and he is sick of it the next time he sees Jake Ellis. They theorize that the clerk initially mixed the keys up and plans to find the manager. Wearing Ellis’ clothes, he goes down to the lobby and shocks the other guests. The clerk is shocked and tries to get the robots to treat him. Harper furiously denies it and threatens to destroy the switchboard. The manager greets him, and he voices all of his complaints. Hayes, the manager, gives up with a sigh and tells Harper that they are about to go bankrupt from the robots. Harper calms down, and he asks to speak to the owners about a potential business deal forming in his head. Afterwards, he returns to Bella and Scribney, looking much fitter and younger. He tells them he has bought Hagerty’s Enzymes and staffed it with robots. When Scribney asks about using them in the office capacity, Harper says he wants nothing to do with them. He then goes off with his secretary Smythe while Scibney and Bella are happy about their rise to a position in the syndicate. "
              },
              {
                "worker_id": "103",
                "uid": "8001ea9cb4f54938b614769f42561c28",
                "response_text": "Harper Breen, a business man is about to make a trip. At the beginning of the story, Harper Breen did not sleep and eat well for weeks, and was irritable. Since he does not listen to the healer, Franz’s advices, his sister and brother-in-law suggest that he has to make a trip to receive a rest-cure at the Emerald Star Hotel on Mars. Attracts by robot servants and potential value of Martian fungus, Harper goes on the trip immediately. However, the life in the hotel is not completely as Harper expected. Harper thinks that the robots are efficient, so he considers about having the robots worker in his office. However, living in the hotel and coming into direct contact with the robots makes him change his mind. The robots simply cannot communicate with humans. They are determined to follow what they are programmed to do. Though his sleep problem is largely improved, and his appetite is much better than before, he is forced by robots to stay in stinking mud-baths, and consume weird concoctions. These robots even take away his cloths. His yelling and protests does not work with the robots. Harper’s neighbor, Jake Ellis, who works in Hagerty’s Enzymes, desires Harper’s treatment. As a result, Harper and Jake agree to exchanged their rooms. Then, Harper finally gets the chance to wear Jake’s clothes and go down to the lobby of the hotel. After talking with the manager of the hotel, and combining Jake’s description of his job, Harper thinks that it is a good idea for business. The hotel wishes to get rid of these robots because humans and robots simply cannot get along with each other. The hotel is going bankrupt because of the robot workers. At the same time, The Hagerty’s Enzymes’ human workers are leaving because the job did not have satisfying working conditions. Thus, both companies are in the danger of bankruptcy, so Harper buys both companies and switches the workers with the robots. When he comes back to the earth, he looks much happier than before."
              }
            ]
          },
          {
            "question_text": "What is the main setting of the story",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "106",
                "uid": "e771011d17e94e22b8f860305f70a41c",
                "response_text": "The main setting of the story in the Emerald Star Hotel. The half acre wide floor is covered with grey carpeting. There are glass walls which tint the light from the sun green. Outside are stunning domed gardens in a dozen acre lot. The lobby which holds the clerks desk is huge. Harper's room inside the hotel is stunning. The walls are made from the same green glass, which are accentuated with windows which look out onto the Martian hinterland. On the top of the skyscraper hotel is a domed roof restaurant, which is furnished with cushioned chairs. In another area of the hotel is a hospital, where it treats patients. Near the lobby is the manager's office. \n"
              },
              {
                "worker_id": "105",
                "uid": "396806fb81454d70a6d7a6905357a773",
                "response_text": "The story starts in the house of Harper's sister. Harper, his sister, and her husband are all in the same room with a massaging armchair and a sofa. The husband, Scribney, is reading a magazine, he is bored with Harp's anger and lack of harmony in the house due to the least. The magazine shows a luxurious extraterrestrial hotel in the shape of a circular skyscraper surrounded with lovely pools and gardens. Soon, Harper leaves the house and heads towards the hotel via a rocket with soporific gas on board, which relaxes the passengers. From the rocket, Harper gets to the lobby of the Emerald Star Hotel by a tube. Everything is green there, the walls are made from glass, the gardens are framed with arches, and perfectly developed robots are offering various services all around. A robot escorts Harper to his room from the lobby. The room is beautiful and with stunning views. Harper goes up to the restaurant on the roof with the view of the dark blue sky. When he returns to the room, he is taken away by the robots in a wheelchair. This happens every day:  Harper deliberately goes through baths, massages, eating weird food, etc. Then he switches rooms with Jake, puts on his huge clothes, and watches Jack being taken to the procedures.  From there Harper is able to call the elevator and go to the lobby. The lobby is full of guests surprised at Harper's appearance. He is then led to the manager's office through an inconspicuous door. The manager is sitting at his metal desk. Then Harper returns to his room and soon back to Earth and to work. "
              },
              {
                "worker_id": "107",
                "uid": "5ad926ba2d7b4b7992f9cdb92191172a",
                "response_text": "The story is initially set in an undisclosed location. There is a Relaxo-Lounge chair set up for Harper to relax in. Later, the Emerald Star Hotel is described as a star-shaped structure made out of bottle-green glass. The structure also rests jewel-like on the rough surface of Mars. The main portion consists of a circular skyscraper with a glass-domed roof. Between its star-shaped annexes, other domes cover the pools and landscaped gardens. The lobby of the hotel is filled with a half-acre of moss-gray carpeting, walls of Martian copper glass, and beautiful gardens at the vistas framed by a dozen arches. Most of the staff present are robot staff, carrying trails or pushing wheelchairs. There is also a desk for the clerk to work behind and give keys to guests who have checked in. There are also inkwells, typewriters, card indexes, and a switchboard to control the robots on the desk. Harper’s room has clear windows set in the green glass wall that shows the Martian hinterland and other amenities such as a bed. There is also a domed roof restaurant that Harper visits after he leaves his bags in the room. The hotel also has mud-baths, irradiated waters, and massage areas. When he meets the manager, the room they meet in has a chair and gun metal desk. \n\n"
              },
              {
                "worker_id": "103",
                "uid": "8001ea9cb4f54938b614769f42561c28",
                "response_text": "People are able to travel to Mars from Earth by rockets. On the way to Mars, the rocket will be filled with soporific gas to relax people so that the trip happens smoothly. On the Mars, there is an Emerald Star Hotel built by a syndicate. There is also a company named Hagerty’s Enzymes, focusing on the fungus plants. Interestingly, the hotel’s servant are all robots while Hagerty’s Enzymes employs men. Both of these companies have not enough sense to swap their workers. But instead they are suffering from possible bankruptcy. "
              }
            ]
          },
          {
            "question_text": "Why do the robots not make good hotel staff?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "106",
                "uid": "e771011d17e94e22b8f860305f70a41c",
                "response_text": "The robots do not make good hotel staff because they are so efficient, they lack any comprehension that humans inherently possess. When Harper first arrives in the hotel, he notices that a woman named Mrs. Jacobsen is giving out about her treatment by the robots. She thinks that the service they provide is too good. She isn't able to change her mind because the robots won't listen, they will just follow orders. They don't listen to Harper when he tries to tell them that he did not book into the hotel for treatment, as they are simply following orders. They don't reason with him when he tries to get out of the treatment, and force him to undergo the procedures. The manager knows that the robots aren't working, and he tells Harper that guest reservations have already declined because of it. "
              },
              {
                "worker_id": "105",
                "uid": "396806fb81454d70a6d7a6905357a773",
                "response_text": "The robots are logical and people are not, so the two do not mix. People can't coexist with robots for that reason. Some people want human stuff while in a hotel to shout at, to argue with, to be able to change minds and to hear them out. Moreover, robots are impossible to convince or fight back, so they make the visitors feel like helpless prisoners. If a mistake happens, it's impossible to explain it to the robots. They are even more annoying with their indifference than people are. "
              },
              {
                "worker_id": "107",
                "uid": "5ad926ba2d7b4b7992f9cdb92191172a",
                "response_text": "The robots do not make good hotel staff because they cannot connect to humans emotionally. They do all of the tasks perfectly and quickly, but it is too logical for the current feelings of humans. Many guests are dissatisfied with the service, not from a technical standpoint, but because they cannot change their minds once the initial order has been issued. The robots can also not listen to what any human says, only following what is programmed into them. This is evident in Harper’s experience later, when he insists that the robots do not give him any treatment because he does not need it. However, the robots have taken all of his items and left him with no choice but to comply. On the other hand, Ellis has been requesting treatment since he arrived at the hotel and has received none because the robots were not issued any commands to give him treatment. "
              },
              {
                "worker_id": "103",
                "uid": "8001ea9cb4f54938b614769f42561c28",
                "response_text": "Robots simply cannot communicate with humans. In the story, Mrs. Jacobsen is angry and asks for a real woman as a nurse instead of a robot. The reason is not because robots did works not good enough, instead, it was because she wanted someone to hear what she says. Also, when robots come into Harper’s room to bring him to the mud-bath. Harper did not have the chance and the ability to talk to robots. They are determined to follow what they are programmed to do. He is forced by robots to stay in stinking mud-baths, and consume weird concoctions. These robots even take away his cloths. His yelling and protests does not work with the robots. Though Harper’s sleep problem is largely improved, and his appetite is much better than before, he feels angry about it because he never wanted it in the first place. "
              }
            ]
          },
          {
            "question_text": "What are the treatments that Harper went through, and what were their effects?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "106",
                "uid": "e771011d17e94e22b8f860305f70a41c",
                "response_text": "Against his will, Harper is subject to a number of treatments at the hotel. He is dunked into mud baths for extensive periods of time. He is held in rancid smelling irradiated hot water. He is made to eat and drink strange concoctions. His stomach is pumped with food. They massage and exercise him. Harper hates all of this. It does do him good though. He notices that his skin which was once yellow, is now returning to a flesh colour. He can finally sleep well again also. When he returns to Earth, he is happy and energised for the first time in years. He looks fitter, and younger than he did before he left. \n"
              },
              {
                "worker_id": "105",
                "uid": "396806fb81454d70a6d7a6905357a773",
                "response_text": "Harper was planning to simply relax, the hotel was beautiful and his appetite even returned. Due to a mistake he was put on a diet, being forced to eat some weird food and pumped out sometimes. He also goes through various mud baths, exercises, massages, and other tiresome procedures which make him sleep a lot. This resulted in his healthy skin color and appetite returning, but he was tired and angry at his helplessness. Those treatments made him so desperate that Harper switched rooms with another guest, took his huge clothes and went to the lobby to talk to the manager. That also results in his genius business idea and realization that he doesn't want robots around after all. \n"
              },
              {
                "worker_id": "107",
                "uid": "5ad926ba2d7b4b7992f9cdb92191172a",
                "response_text": "Harper first goes through a surgery that pumps all of the food he eats out. Then, as the days go by, they take him to a stinking mud-bath and hold him there until he thinks that he is well-done to the bone. After, they soak him in foul, steaming irradiated water until he gags. He is also made to eat and drink weird concoctions under the watch of the robots. Harper also goes through rounds of purging, massaging, and exercise. The robots even take his phone, announcing that he would have no service for two weeks and give him a busy signal. The treatments leave him looking younger, but he is noticeably angrier. His anger and frustration mainly stems from the fact that he did not request any treatment in the first place. Many of these treatments have been done against his own will, and he desperately wants it to stop even though the robots do not listen. \n"
              },
              {
                "worker_id": "103",
                "uid": "8001ea9cb4f54938b614769f42561c28",
                "response_text": "Robots first brought Harper to mud-baths by a wheel chair and held him there until he was well-done. Next, the robots soak him in foul, steaming irradiated water until he gags. Then, they brings concoctions for Harper to eat and drink, and they stands over him until he finishes consuming these concoctions. Lastly, they purge and massage and exercise him. Harper indeed begins to look flesh-colored. He starts to sleep for hours and get a better appetite than before."
              }
            ]
          },
          {
            "question_text": "Why has Ellis booked into the hotel, and what has his experience been like?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "106",
                "uid": "e771011d17e94e22b8f860305f70a41c",
                "response_text": "Jake Ellis is a man who works on the tundra, as one of the superintendents of the fungus plants. He booked into the hotel as his health has been on a decline because of his working conditions. The temperature in the factories are usually below freezing, he has to wear a pressure suit, the air quality is terrible and he has to live on processed food. He hoped to get treatment at the hotel, but since his arrival, he has been practically ignored by the staff, and left in his room. This is because the clerk switched his room key with Ellis'. When he meets Ellis and they decide to switch rooms, he finally gets his first treatment. "
              },
              {
                "worker_id": "105",
                "uid": "396806fb81454d70a6d7a6905357a773",
                "response_text": "Ellis has been working in tundra with fungus plants. The job is extremely hard, the food is awful, the temperature is very low, impossible for a human to work at, but pays well. He booked the hotel to get treatment and he wants it badly, but he is stuck.  He feels bad after his work and needs treatment, his health in the tundra became weak, as he ate the bad food and was freezing and working bad. He needs a diet and warm baths now. The robots are unable to hear people and see the mistake, and the phone operator is a robot, so Ellis has no chance to get his treatment. Eventually, he is extremely happy as he switches rooms with Harper and gets what he wants."
              },
              {
                "worker_id": "107",
                "uid": "5ad926ba2d7b4b7992f9cdb92191172a",
                "response_text": "Ellis books the hotel to receive treatment for himself. He lives on a constant diet of steak and turnips at the factory, which leads him to book the hotel in hopes of receiving treatment for his stomach. He also says that the air in the factory area is bad, the temperature is always freezing, pressure suits, huts, and processed food. He wants to relax after working in these harsh conditions for so long. However, his experience at the hotel has not been good so far. Ellis is constantly asking for treatment, but all of the robots ignore him. He even brings it down to the clerk to complain, but it is possible that they mixed his treatment information up with Harper. He is desperate, but none of the robots can change their programming to accommodate him\n"
              },
              {
                "worker_id": "103",
                "uid": "8001ea9cb4f54938b614769f42561c28",
                "response_text": "Ellis booked into the hotel because he feels uncomfortable with his stomach. He thinks that was because of the steak and onions he ate after all that tundra dope he has been living on. While he does not feel well at all, he does not receive any treatments, and he is simply ignored by robots no matter what he does. When he is in the same room as Harper, the robot does not even acknowledge his existence. Every time he lifts the receiver of the room phone, only a robot voice answering, meaninglessly. He finally receives a treatment only because he switched room with Harper. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4750,
        "document_length_chars": 27842
      }
    }
  ]
}