{
  "item_metadata": {
    "item_id": "63833",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63833",
      "content": "Jinx Ship To The Rescue\n \n\n By ALFRED COPPEL, JR.\n \n \n Stand by for T.R.S. Aphrodite , butt of the Space Navy. She's got something terrific in her guts and only her ice-cold lady engineer can coax it out of her!\n \n [Transcriber's Note: This etext was produced from Planet Stories Winter 1948. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Brevet Lieutenant Commander David Farragut Strykalski III of the Tellurian Wing, Combined Solarian Navies, stood ankle deep in the viscous mud of Venusport Base and surveyed his new command with a jaundiced eye. The hot, slimy, greenish rain that drenched Venusport for two-thirds of the 720-hour day had stopped at last, but now a miasmic fog was rising from the surrounding swampland, rolling across the mushy landing ramp toward the grounded spaceship. Visibility was dropping fast, and soon porto-sonar sets would have to be used to find the way about the surface Base. It was an ordinary day on Venus.\n \n Strike cursed Space Admiral Gorman and all his ancestors with a wealth of feeling. Then he motioned wearily to his companion, and together they sloshed through the mud toward the ancient monitor.\n \n The scaly bulk of the Tellurian Rocket Ship Aphrodite loomed unhappily into the thick air above the two men as they reached the ventral valve. Strike raised reluctant eyes to the sloping flank of the fat spaceship.\n \n \"It looks,\" he commented bitterly, \"like a pregnant carp.\"\n \n Senior Lieutenant Coburn Whitley—\"Cob\" to his friends—nodded in agreement. \"That's our Lover-Girl ... old Aphrodisiac herself. The ship with the poison personality.\" Cob was the Aphrodite's Executive, and he had been with her a full year ... which was a record for Execs on the Aphrodite . She generally sent them Earthside with nervous breakdowns in half that time.\n \n \"Tell me, Captain,\" continued Cob curiously, \"how does it happen that you of all people happened to draw this tub for a command? I thought....\"\n \n \"You know Gorman?\" queried Strykalski.\n \n Cob nodded. \"Oh, yes. Yes, indeed. Old Brass-bottom Gorman?\"\n \n \"The same.\"\n \n \"Well,\" Cob ran a hand over his chin speculatively, \"I know Gorman's a prize stinker ... but you were in command of the Ganymede . And, after all, you come from an old service family and all that. How come this?\" He indicated the monitor expressively.\n \n Strike sighed. \"Well, now, Cob, I'll tell you. You'll be spacing with me and I guess you've a right to know the worst ... not that you wouldn't find it out anyway. I come from a long line of very sharp operators. Seven generations of officers and gentlemen. Lousy with tradition.\n \n \"The first David Farragut Strykalski, son of a sea-loving Polish immigrant, emerged from World War II a four-striper and Congressional Medal winner. Then came David Farragut Strykalski, Jr., and, in the abortive Atomic War that terrified the world in 1961, he won a United Nations Peace Citation. And then came David Farragut Strykalski III ... me.\n \n \"From such humble beginnings do great traditions grow. But something happened when I came into the picture. I don't fit with the rest of them. Call it luck or temperament or what have you.\n \n \"In the first place I seem to have an uncanny talent for saying the wrong thing to the wrong person. Gorman for example. And I take too much on my own initiative. Gorman doesn't like that. I lost the Ganymede because I left my station where I was supposed to be running section-lines to take on a bunch of colonists I thought were in danger....\"\n \n \"The Procyon A people?\" asked Cob.\n \n \"So you've heard about it.\" Strike shook his head sadly. \"My tactical astrophysicist warned me that Procyon A might go nova. I left my routine post and loaded up on colonists.\" He shrugged. \"Wrong guess. No nova. I made an ass of myself and lost the Ganymede . Gorman gave it to his former aide. I got this.\"\n \n Cob coughed slightly. \"I heard something about Ley City, too.\"\n \n \"Me again. The Ganymede's whole crew ended up in the Luna Base brig. We celebrated a bit too freely.\"\n \n Cob Whitley looked admiringly at his new Commander. \"That was the night after the Ganymede broke the record for the Centaurus B-Earth run, wasn't it? And then wasn't there something about....\"\n \n \"Canalopolis?\"\n \n Whitley nodded.\n \n \"That time I called the Martian Ambassador a spy. It was at a Tellurian Embassy Ball.\"\n \n \"I begin to see what you mean, Captain.\"\n \n \"Strike's the name, Cob.\"\n \n Whitley's smile was expansive. \"Strike, I think you're going to like our old tin pot here.\" He patted the Aphrodite's nether belly affectionately. \"She's old ... but she's loose. And we're not likely to meet any Ambassadors or Admirals with her, either.\"\n \n Strykalski sighed, still thinking of his sleek Ganymede . \"She'll carry the mail, I suppose. And that's about all that's expected of her.\"\n \n Cob shrugged philosophically. \"Better than tanking that stinking rocket fuel, anyway. Deep space?\"\n \n Strike shook his head. \"Venus-Mars.\"\n \n Cob scratched his chin speculatively. \"Perihelion run. Hot work.\"\n \n Strike was again looking at the spaceship's unprepossessing exterior.\n\"A surge-circuit monitor, so help me.\"\n \n Cob nodded agreement. \"The last of her class.\"\n \n \n\n \n And she was not an inspiring sight. The fantastically misnamed Aphrodite was a surge-circuit monitor of twenty guns built some ten years back in the period immediately preceding the Ionian Subjugation Incident. She had been designed primarily for atomics, with a surge-circuit set-up for interstellar flight. At least that was the planner's view. In those days, interstellar astrogation was in its formative stage, and at the time of the Aphrodite's launching the surge-circuit was hailed as the very latest in space drives.\n \n Her designer, Harlan Hendricks, had been awarded a Legion of Merit for her, and every silver-braided admiral in the Fleet had dreamed of hoisting his flag on one of her class. There had been three. The Artemis , the Andromeda , and the prototype ... old Aphrodisiac. The three vessels had gone into action off Callisto after the Phobos Raid had set off hostilities between the Ionians and the Solarian Combine.\n \n All three were miserable failures.\n \n The eager officers commanding the three monitors had found the circuit too appealing to their hot little hands. They used it ... in some way, wrongly.\n \n The Artemis exploded. The Andromeda vanished in the general direction of Coma Berenices glowing white hot from the heat of a ruptured fission chamber and spewing gamma rays in all directions. And the Aphrodite's starboard tubes blew, causing her to spend her store of vicious energy spinning like a Fourth of July pinwheel under\n20 gravities until all her interior fittings ... including crew were a tangled, pulpy mess within her pressure hull.\n \n The Aphrodite was refitted for space. And because it was an integral part of her design, the circuit was rebuilt ... and sealed. She became a workhorse, growing more cantankerous with each passing year. She carried personnel.... She trucked ores. She ferried skeeterboats and tanked rocket fuel. Now, she would carry the mail. She would lift from Venusport and jet to Canalopolis, Mars, without delay or variation. Regulations, tradition and Admiral Gorman of the Inner Planet Fleet required it. And it was now up to David Farragut Strykalski III to see to it that she did....\n \n The Officer of the Deck, a trim blonde girl in spotless greys saluted smartly as Strike and Cob stepped through the valve.\n \n Strike felt vaguely uncomfortable. He knew, of course, that at least a third of the personnel on board non-combat vessels of the Inner Planet Fleet was female, but he had never actually had women on board a ship of his own, and he felt quite certain that he preferred them elsewhere.\n \n Cob sensed his discomfort. \"That was Celia Graham, Strike. Ensign. Radar Officer. She's good, too.\"\n \n Strike shook his head. \"Don't like women in space. They make me uncomfortable.\"\n \n Cob shrugged. \"Celia's the only officer. But about a quarter of our ratings are women.\" He grinned maliciously. \"Equal rights, you know.\"\n \n \"No doubt,\" commented the other sourly. \"Is that why they named this ... ship 'Aphrodite'?\"\n \n Whitley saw fit to consider the question rhetorical and remained silent.\n \n Strike lowered his head to clear the arch of the flying-bridge bulkhead. Cob followed. He trailed his Captain through a jungle of chrome piping to the main control panels. Strike sank into an acceleration chair in front of the red DANGER seal on the surge-circuit rheostat.\n \n \"Looks like a drug-store fountain, doesn't it?\" commented Cob.\n \n Strykalski nodded sadly, thinking of the padded smoothness of the Ganymede's flying-bridge. \"But she's home to us, anyway.\"\n \n The thick Venusian fog had closed in around the top levels of the ship, hugging the ports and cutting off all view of the field outside. Strike reached for the squawk-box control.\n \n \"Now hear this. All officer personnel will assemble in the flying bridge at 600 hours for Captain's briefing. Officer of the Deck will recall any enlisted personnel now on liberty....\"\n \n Whitley was on his feet, all the slackness gone from his manner.\n\"Orders, Captain?\"\n \n \"We can't do anything until the new Engineering Officer gets here. They're sending someone down from the Antigone , and I expect him by\n600 hours. In the meantime you'll take over his part of the work. See to it that we are fueled and ready to lift ship by 602. Base will start loading the mail at 599:30. That's about all.\"\n \n \"Yes, sir.\" Whitley saluted and turned to go. At the bulkhead, he paused. \"Captain,\" he asked, \"Who is the new E/O to be?\"\n \n Strike stretched his long legs out on the steel deck. \"A Lieutenant Hendricks, I. V. Hendricks, is what the orders say.\"\n \n Cob thought hard for a moment and then shrugged his shoulders. \"I. V. Hendricks.\" He shook his head. \"Don't know him.\"\n \n \n\n \n The other officers of the T.R.S. Aphrodite were in conference with the Captain when Cob and the girl at his side reached the flying bridge. She was tall and dark-haired with regular features and pale blue eyes. She wore a service jumper with two silver stripes on the shoulder-straps, and even the shapeless garment could not hide the obvious trimness of her figure.\n \n Strike's back was toward the bulkhead, and he was addressing the others.\n \n \"... and that's about the story. We are to jet within 28,000,000 miles of Sol. Orbit is trans-Mercurian hyperbolic. With Mars in opposition, we have to make a perihelion run and it won't be pleasant. But I'm certain this old boiler can take it. I understand the old boy who designed her wasn't as incompetent as they say. But Space Regs are specific about mail runs. This is important to you, Evans. Your astrogation has to be accurate to within twenty-five miles plus or minus the shortest route. And there'll be no breaking orbit. Now be certain that the refrigeration units are checked, Mister Wilkins, especially in the hydroponic cells. Pure air is going to be important.\"\n \n \"That's about all there is to tell you. As soon as our rather leisurely E/O gets here, we can jet with Aunt Nelly's postcard.\" He nodded. \"That's the story. Lift ship in....\" He glanced at his wrist chronograph, \"... in an hour and five.\"\n \n The officers filed out and Cob Whitley stuck his head into the room.\n\"Captain?\"\n \n \"Come in, Cob.\" Strike's dark brows knit at the sight of the uniformed girl in the doorway.\n \n Cob's face was sober, but hidden amusement was kindling behind his eyes. \"Captain, may I present Lieutenant Hendricks? Lieutenant I-vy Hendricks?\"\n \n Strike looked blankly at the girl.\n \n \"Our new E/O, Captain,\" prompted Whitley.\n \n \"Uh ... welcome aboard, Miss Hendricks,\" was all the Captain could find to say.\n \n The girl's eyes were cold and unfriendly. \"Thank you, Captain.\" Her voice was like cracked ice tinkling in a glass. \"If I may have your permission to inspect the drives, Captain, I may be able to convince you that the designer of this vessel was not ... as you seem to think ... a senile incompetent.\"\n \n Strike was perplexed, and he showed it. \"Why, certainly ... uh ... Miss ... but why should you be so....\"\n \n The girl's voice was even colder than before as she said, \"Harlan Hendricks, Captain, is my father.\"\n \n \n\n \n A week in space had convinced Strike that he commanded a jinx ship. Jetting sunward from Venus, the cantankerous Aphrodite had burned a steering tube through, and it had been necessary to go into free-fall while Jenkins, the Assistant E/O, and a damage control party effected repairs. When the power was again applied, Old Aphrodisiac was running ten hours behind schedule, and Strike and Evans, the Astrogation Officer, were sweating out the unforeseen changes introduced into the orbital calculations by the time spent in free-fall.\n \n The Aphrodite rumbled on toward the orbit of Mercury....\n \n For all the tension between the occupants of the flying-bridge, Strike and Ivy Hendricks worked well together. And after a second week in space, a reluctant admiration was replacing the resentment between them. Ivy spent whatever time she could spare tinkering with her father's pet surge-circuit and Strike began to realize that there was little she did not know about spaceship engineering. Then, too, Ivy spent a lot of time at the controls, and Strike was forced to admit that he had never seen a finer job of piloting done by man or woman.\n \n And finally, Ivy hated old Brass-bottom Gorman even more than Strike did. She felt that Gorman had ruined her father's career, and she was dedicating her life to proving her father right and Brass-bottom wrong. There's nothing in the cosmos to nurture friendship like a common enemy.\n \n At 30,000,000 miles from the sun, the Aphrodite's refrigeration units could no longer keep the interior of the ship at a comfortable temperature. The thermometer stood at 102°F, the very metal of the ship's fittings hot to the touch. Uniforms were discarded, insignia of rank vanished. The men dressed in fiberglass shorts and spaceboots, sweat making their naked bodies gleam like copper under the sodium-vapor lights. The women in the crew added only light blouses to their shorts ... and suffered from extra clothing.\n \n Strike was in the observation blister forward, when Ensign Graham called to say that she had picked up a radar contact sunward. The IFF showed the pips to be the Lachesis and the Atropos . The two dreadnaughts were engaged in coronary research patrol ... a purely routine business. But the thing that made Strike curse under his breath was Celia Graham's notation that the Atropos carried none other than Space Admiral Horatio Gorman, Cominch Inplan.\n \n Strike thought it a pity that old Brass-bottom couldn't fall into Hell's hottest pit ... and he told Ivy so.\n \n And she agreed.\n \n \n\n \n Old Aphrodisiac had reached perihelion when it happened. The thermometer stood at 135° and tempers were snapping. Cob and Celia Graham had tangled about some minor point concerning Lover-Girl's weight and balance. Ivy went about her work on the bridge without speaking, and Strike made no attempt to brighten her sudden depression. Lieutenant Evans had punched Bayne, the Tactical Astrophysicist, in the eye for some disparaging remark about Southern California womanhood. The ratings were grumbling about the food....\n \n And then it happened.\n \n Cob was in the radio room when Sparks pulled the flimsy from the scrambler. It was a distress signal from the Lachesis . The Atropos had burst a fission chamber and was falling into the sun. Radiation made a transfer of personnel impossible, and the Atropos skeeterboats didn't have the power to pull away from the looming star. The Lachesis had a line on the sister dreadnaught and was valiantly trying to pull the heavy vessel to safety, but even the thundering power of the Lachesis' mighty drive wasn't enough to break Sol's deathgrip on the battleship.\n \n A fleet of souped-up space-tugs was on its way from Luna and Venusport, but they could not possibly arrive on time. And it was doubtful that even the tugs had the necessary power to drag the crippled Atropos away from a fiery end.\n \n Cob snatched the flimsy from Sparks' hands and galloped for the flying-bridge. He burst in and waved the message excitedly in front of Strykalski's face.\n \n \"Have a look at this! Ye gods and little catfish! Read it!\"\n \n \"Well, dammit, hold it still so I can!\" snapped Strike. He read the message and passed it to Ivy Hendricks with a shake of his head.\n \n She read it through and looked up exultantly. \"This is it ! This is the chance I've been praying for, Strike!\"\n \n He returned her gaze sourly. \"For Gorman to fall into the sun? I recall I said something of the sort myself, but there are other men on those ships. And, if I know Captain Varni on the Lachesis , he won't let go that line even if he fries himself.\"\n \n Ivy's eyes snapped angrily. \"That's not what I meant, and you know it! I mean this!\" She touched the red-sealed surge-circuit rheostat.\n \n \"That's very nice, Lieutenant,\" commented Cob drily. \"And I know that you've been very busy adjusting that gismo. But I seem to recall that the last time that circuit was uncorked everyone aboard became part of the woodwork ... very messily, too.\"\n \n \"Let me understand you, Ivy,\" said Strike in a flat voice. \"What you are suggesting is that I risk my ship and the lives of all of us trying to pull old Gorman's fat out of the fire with a drive that's blown skyhigh three times out of three. Very neat.\"\n \n There were tears bright in Ivy Hendricks' eyes and she sounded desperate. \"But we can save those ships! We can, I know we can! My father designed this ship! I know every rivet of her! Those idiots off Callisto didn't know what they were doing. These ships needed specially trained men. Father told them that! And I'm trained! I can take her in and save those ships!\" Her expression turned to one of disgust. \"Or are you afraid?\"\n \n \"Frankly, Ivy, I haven't enough sense to be afraid. But are you so certain that we can pull this off? If I make a mistake this time ... it'll be the last. For all of us.\"\n \n \"We can do it,\" said Ivy Hendricks simply.\n \n Strike turned to Cob. \"What do you say, Cob? Shall we make it hotter in here?\"\n \n Whitley shrugged. \"If you say so, Strike. It's good enough for me.\"\n \n Celia Graham left the bridge shaking her head. \"We'll all be dead soon. And me so young and pretty.\"\n \n Strike turned to the squawk-box. \"Evans!\"\n \n \"Evans here,\" came the reply.\n \n \"Have Sparks get a DF fix on the Atropos and hold it. We'll home on their carrier wave. They're in trouble and we're going after them. Plot the course.\"\n \n \"Yes, Captain.\"\n \n Strike turned to Cob. \"Have the gun-crews stand by to relieve the black-gang in the tube rooms. It's going to get hotter than the hinges of hell down there and we'll have to shorten shifts.\"\n \n \"Yes, sir!\" Cob saluted and was gone.\n \n Strike returned to the squawk-box. \"Radar!\"\n \n \"Graham here,\" replied Celia from her station.\n \n \"Get a radar fix on the Lachesis and hold it. Send your dope up to Evans and tell him to send us a range estimate.\"\n \n \"Yes, Captain,\" the girl replied crisply.\n \n \"Gun deck!\"\n \n \"Gun deck here, sir,\" came a feminine voice.\n \n \"Have number two starboard torpedo tube loaded with a fish and a spool of cable. Be ready to let fly on short notice ... any range.\"\n \n \"Yes, sir!\" The girl switched off.\n \n \"And now you, Miss Hendricks.\"\n \n \"Yes, Captain?\" Her voice was low.\n \n \"Take over Control ... and Ivy....\"\n \n \"Yes?\"\n \n \"Don't kill us off.\" He smiled down at her.\n \n She nodded silently and took her place at the control panel. Smoothly she turned old Aphrodisiac's nose sunward....\n \n \n\n \n Lashed together with a length of unbreakable beryllium steel cable, the Lachesis and the Atropos fell helplessly toward the sun. The frantic flame that lashed out from the Lachesis' tube was fading, her fission chambers fusing under the terrific heat of splitting atoms. Still she tried. She could not desert her sister ship, nor could she save her. Already the two ships had fallen to within 18,000,000 miles of the sun's terrifying atmosphere of glowing gases. The prominences that spouted spaceward seemed like great fiery tentacles reaching for the trapped men on board the warships. The atmospheric guiding fins, the gun-turrets and other protuberances on both ships were beginning to melt under the fierce radiance. Only the huge refrigeration plants on the vessels made life within them possible. And, even so, men were dying.\n \n Swiftly, the fat, ungainly shape of old Aphrodisiac drew near. In her flying-bridge, Strike and Ivy Hendricks watched the stricken ships in the darkened viewport.\n \n The temperature stood at 140° and the air was bitter with the smell of hot metal. Ivy's blouse clung to her body, soaked through with perspiration. Sweat ran from her hair into her eyes and she gasped for breath in the oven hot compartment. Strike watched her with apprehension.\n \n Carefully, Ivy circled the two warships. From the starboard tube on the gun-deck, a homing rocket leapt toward the Atropos . It plunged straight and true, spilling cable as it flew. It slammed up against the hull, and stuck there, fast to the battleship's flank. Quickly, a robocrane drew it within the ship and the cable was made secure. Like cosmic replicas of the ancient South American \"bolas,\" the three spacecraft whirled in space ... and all three began that sunward plunge together.\n \n \n They were diving into the sun.\n \n\n \n The heat in the Aphrodite's bridge was unbearable. The thermometer showed 145° and it seemed to Strike that Hell must be cool by comparison.\n \n Ivy fought her reeling senses and the bucking ship as the slack came out of the cable. Blackness was flickering at the edges of her field of vision. She could scarcely lift her hand to the red-sealed circuit rheostat. Shudderingly, she made the effort ... and failed. Conscious, but too spent to move, she collapsed over the blistering hot instrument panel.\n \n \" Ivy! \" Strike was beside her, cradling her head in his arm.\n \n \"I ... I ... can't make it ... Strike. You'll ... have to run ... the show ... after ... all.\"\n \n Strike laid her gently in an acceleration chair and turned toward the control panel. His head was throbbing painfully as he broke the seal on the surge-circuit.\n \n Slowly he turned the rheostat. Relays chattered. From deep within old Lover-Girl's vitals came a low whine. He fed more power into the circuit. Cadmium rods slipped into lead sheaths decks below in the tube-rooms. The whining rose in pitch. The spinning of the ships in space slowed. Stopped. With painful deliberation, they swung into line.\n \n More power. The whine changed to a shriek. A banshee wail.\n \n Cob's voice came through the squawk-box, soberly. \"Strike, Celia's fainted down here. We can't take much more of this heat.\"\n \n \"We're trying, Cob!\" shouted Strike over the whine of the circuit. The gauges showed the accumulators full. \" Now! \" He spun the rheostat to the stops, and black space burst over his brain....\n \n The last thing he remembered was a voice. It sounded like Bayne's. And it was shouting. \"We're moving 'em! We're pulling away! We're....\" And that was all.\n \n The space-tug Scylla found them.\n \n The three ships ... Atropos , Lachesis , and old Aphrodisiac ... lashed together and drifting in space. Every man and woman aboard out cold from the acceleration, and Aphrodite's tanks bone dry. But they were a safe 80,000,000 miles from Sol....\n \n \n\n \n The orchestra was subdued, the officer's club softly lighted. Cob leaned his elbow on the bar and bent to inspect the blue ribbon of the Spatial Cross on Strike's chest. Then he inspected his own and nodded with tipsy satisfaction. He stared out at the Martian night beyond the broad windows and back again at Strike. His frown was puzzled.\n \n \"All right,\" said Strike, setting down his glass. \"What's on your mind, Cob? Something's eating you.\"\n \n Whitley nodded very slowly. He took a long pull at his highball. \"I understand that you goofballed your chances of getting the Ganymede back when Gorman spoke his piece to you....\"\n \n \"All I said to him....\"\n \n \"I know. I know what you said ... and it won't bear repeating. But you're not fooling me. You've fallen for old Lover-Girl and you don't want to leave her. Ver-ry commendable. Loyal! Stout fellah! But what about Ivy?\"\n \n \"Ivy?\"\n \n Cob looked away. \"I thought that you and she ... well, I thought that when we got back ... well....\"\n \n Strike shook his head. \"She's gone to the Bureau of Ships with a designing job.\"\n \n Cob waved an expressive arm in the air. \"But dammit, man, I thought....\"\n \n \"The answer is no . Ivy's a nice girl ... but....\" He paused and sighed. \"Since she was promoted to her father's old rank ... well....\" He shrugged. \"Who wants a wife that ranks you?\"\n \n \"Never thought of that,\" mused Cob. For a long while he was silent; then he pulled out an address book and leafed through until he came to the pages marked \"Canalopolis, Mars.\"\n \n And he was gratified to see that Lieutenant Commander David Farragut Strykalski III was doing the same.",
      "metadata": {
        "title": "Jinx Ship to the Rescue",
        "author": "Alfred Coppel, Jr.",
        "passage_id": "63833",
        "uid": "ea0017c487a245668698cf527019b2b6",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "6",
                "uid": "0c27bef1b7b644ffba735fdb005f9529",
                "response_text": "Brevet Lieutenant Commander David Farragut Stryakalski III, AKA Strike, is charged with commanding a run-down and faulty vessel, the Aphrodite. Aphrodite was the brain-child of Harlan Hendricks, an engineer who ushered in new technology ten years back. All three of his creations failed spectacularly, resulting in death and a failed career. The Aphrodite was the only ship to survive, and she is now used for hauling mail back and forth between Venus and Mars.\nStrike and Cob, the Aphrodite’s only executive to last more than six months, recount Strike’s great failures and how he ended up here. He used to fly the Ganymede, but was removed after he left his position to rescue colonists who didn’t need rescuing. Strike was no longer trustworthy in Admiral Gorman’s eyes, so he banished him to the Aphrodite. \nThe circuit that caused the initial demise of Aphrodite was sealed off. After meeting some members of his crew, Strike orders a conference for all personnel and calls in an Engineering Officer, one I.V. Hendricks. \nAfter Lieutenant Ivy Hendricks arrives--not I.V.--Strike immediately insults her by degrading the ship’s designer, Harlan Hendricks. As it turns out, Hendricks is his daughter, and she vows to prove him wrong and all those who doubted her father. \nDespite their initial conflict, Strike and Hendricks’ relationship soon evolves from resentment to respect. During this time, Strike’s confidence in the Aphrodite plummets as she suffers from mechanical issues. \nThe Aphrodite starts to heat up as they get closer to the sun. The refrigeration units could not handle the heat, causing discomfort among the crew. As they get closer, a radar contact reveals that two dreadnaughts, the Lachesis and the Atropos, are doing routine patrolling. Nothing to worry about, except the Atropos had Admiral Gorman on board, hated by Strike and Hendricks.\nStrike and Hendricks make a joke about Gorman falling into the sun. As the temperature steadily climbs, the crew members overheat and begin fighting, resulting in a black eye. A distress signal came through from the Lachesis: the Atropos, with Gorman on board, was tumbling into the sun. The Lachesis was attempting to rescue them with an unbreakable cord, but they too were being pulled in. \nHendricks had fixed the surge-circuit rheostat, the one her father designed, and claimed it could help them rescue the ships. After some tension, Strike agrees and they race down to the sun to pick up the drifting dreadnaughts. \nStrike puts Hendricks in charge, but soon the heat overtakes her, and she is unable to continue. Strike takes over, attaches the Aphrodite to the Lachesis with a cord, and turns on the surge-circuit. They blast themselves out of there, rescuing the two ships and Admiral Gorman at the same time. \nCob and Strike are awarded Spatial Cross awards, while Hendricks is promoted to an engineering position at the Bureau of Ships. The story ends with Cob and Strike flipping through the pages of an address book until they land on Canalopolis, Mars. \n"
              },
              {
                "worker_id": "1",
                "uid": "04e79312dede4a0da5993101e55a796a",
                "response_text": "Strike joins the crew of the Aphrodite after he has made several poor decisions while he was the captain of another spaceship. He is essentially being punished by his boss, Gorman, and put somewhere where he can do little harm. His job is to deliver the mail from Venus to Mars, so it’s pretty straightforward. \n\nWhen he meets the Officer of the Deck, Celia Graham, he immediately becomes uncomfortable. He does not like to work with women in space, although it’s a pretty common occurrence. He holds a captain’s meeting the first day on the job, and he waits to meet his Engineering Officer, I.V. Hendricks. He makes a rude comment about how the man is late for his first meeting, but actually, the female Ivy has already shown up. \n\nAfter meeting Ivy formally, he makes a comment about how the ship Aphrodite was built by an imbecile. Ivy immediately tells him that he’s wrong, and she knows this because the designer of the ship was none other than her own father. \n\nHis first week as captain on the new ship goes very poorly. Several repairs need to be done to Aphrodite, they run  behind schedule, and the new crew members have a tough time getting a handle on Aphrodite’s intricacies. \n\nThe heat index in the ship begins to rise, and the crew members can no longer wear their uniforms without fainting. Suddenly a distress call comes in, and it’s coming from the Atropos, a ship Captained by Gorman, and the Lachesis. The crew members hesitate to take the oldest and most outdated machinery on a rescue trip. Strike has been in trouble for refusing to follow commands before, and he knows it’s a risky move. However, Ivy insists that she knows how to pilot the Aphrodite, and she can save the crew members on the Atropos and the Lachesis from death. They are quickly tumbling towards the sun, and they will perish if someone doesn’t do something quickly. \n\nIvy takes control of the ship, and the heat on the Aphrodite continues to rise steadily. Eventually, she faints from pure heat exhaustion, and she tells Strike that he must take over. He does, and he manages to essentially lasso the other two ships, and with just the right amount of power, he pulls them back into orbit. \n\nAt a bar, after the whole ordeal, Cob pokes fun at Strike for staying on the Aphrodite. He then admits that he actually respects Strike’s loyalty to the ship that saved his reputation. Cob asks about Strike’s relationship with Ivy, but Strike tells him that she has taken her dad’s former job, so she no longer works with him. Strike takes the moment to look up her info, presumably to restart the relationship. \n"
              },
              {
                "worker_id": "5",
                "uid": "71efb8636b504f42a6989bb90e360186",
                "response_text": "The narrative follows commander Strike as he begins his command of the spaceship Aphrodite. Strike comes from a long line of military greats but himself is prone to poor professional decision making.\n\nAs he takes command, the mission is a simple mail run. However, in the course of their journey, they receive word of two ships in dire need of rescue. Strike and his engineering officer, Ivy Hendricks, decide to use the ships extremely risky surge-circuit to aid the ships.\n\nThe rescue is a success and the crew is hailed for its bravery in saving the doomed vessels. "
              },
              {
                "worker_id": "3",
                "uid": "8aa46ba8bd2945c98babd7dd2d9ecc38",
                "response_text": "The story starts in a muddy swamp on Venus, where Strike, a Brevet Lieutenant Commander, is encountering his new ship, the Aphrodite, for the first time. Here on Venusport Base, he is introduced to the executive officer of the ship, a man who goes by Cob. Strike comes from a line of servicemen who were all well respected, but he himself has more of a reputation for causing trouble by saying the wrong things or deviating from mission plans. His reputation preceded him, as Cob had specific questions about some of these events. The Aphrodite was incredibly impressive when it was designed, but did not live up to its expectations. It had been refitted, and the new mission that Strike was to lead was a mail run between Venus and Mars. As he entered the ship, Strike began to meet his new crew, including Celia Graham, his Radar Officer. Strike is not used to women being on ships and is decidedly uncomfortable with the idea. As he is briefing the officers who were already present, Strike is surprised when he meets his new engineering officer, Ivy Hendricks. Ivy is the daughter of the man who designed the ship, and she is cold to Strike at first, as he is to her. However, her expertise in engineering generally, the ship specifically, and other skills as well as piloting, meant that Strike warmed up to her as their mission went on. As the ship was flying towards Mars on their route, the crew picked up a distress signal from the Lachesis, which was trying to pull the Atropos away from the gravitational pull of the sun after it was damaged in an equipment malfunction. The Admiral who had put Strike in charge of the Aphrodite was on the Atropos, and Ivy dislikes him even more than Strike does, but they know they have to try to save the crews. Strike is hesitant, but Ivy has a plan and insists that they try. She has spent all of her free time tinkering with the circuits, and takes charge. She turned the Aphrodite towards the ships in danger, and sends out a cable to connect the Aphrodite to those ships. After they are all connected, the ships continue to spin towards the sun, which causes Ivy to pass out, leaving Strike in charge. He manages to pull the ships into line and send the Aphrodite in the right direction before passing out himself. The Aphrodite has the power to pull everyone away from the Sun’s gravity, but the acceleration knocks everyone out on all three ships. In the end, it was a successful rescue mission of multiple crews. Strike and Cob find themselves in an officer’s club at the end of the story, discussing Ivy’s new job, and Strike acknowledges that Cob is right about the Aphrodite having grown on him, and plans to stay its captain."
              }
            ]
          },
          {
            "question_text": "Who is Ivy Hendricks and what happens to her throughout the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "6",
                "uid": "0c27bef1b7b644ffba735fdb005f9529",
                "response_text": "Lieutenant Ivy Hendricks is the daughter of Harlan Hendricks, a formerly respected engineer. He created the surge-circuit, an innovation in interstellar astrogation, and he was awarded a Legion of Merit. He designed three famous ships: the Artemis, the Andromeda, and the Aphrodite, the prototype. Despite being hailed as the latest and greatest in technology, all three ships either exploded or failed. \nAccording to Lieutenant Ivy Hendricks, their failures were due to the lack of education on board. She claimed that her father asked for the crew members to be trained in surge-circuit technology, so they could use it properly and correctly. That wish was not granted and after all three ships failed, his reputation and career were doomed. Admiral Gorman pulled the plug on his career and therefore became the target of all Lieutenant Hendricks’ hate. \nWith a bone to pick, Lieutenant Hendricks, a knowledgeable engineer herself, comes aboard the Aphrodite to serve as her engineer and occasional pilot. She wants to prove to the world that her father’s creation was genius and deserving of praise. \nAlthough they started off on the wrong foot, Lieutenant Hendricks and Strike, her commander, develop a friendship and appreciation for each other. They bond over their deep hatred of Admiral Gorman and the joy of piloting a ship. She soon proves herself to Strike, and he begins to trust her. Their relationship walks the fine line between friendship and romance. \nAs the Aphrodite is attempting to rescue the fallen dreadnaughts, Lieutenant Hendricks comes up with the solution. Due to her constant tinkering on the ship, she had fixed the surge-circuit rheostat and made it ready to use. Initially, no one trusts her, seeing as the last time it was used people died. But Strike’s trust in her is strong and true, so he approves the use of the surge-circuit. Hendricks pilots the ship, but soon becomes too overheated and comes close to fainting. Strike takes over piloting and eventually activates the surge-circuit. It works and they are able to rescue the two ships, one of which had Admiral Gorman, her sworn enemy, onboard. \nLieutenant Hendricks receives a major promotion; she is now an engineer at the Bureau of Ships. She proved them wrong, and restored her father’s legacy and good name. The story ends with their romance left in the air, but Hendricks has much to be proud of. \n"
              },
              {
                "worker_id": "1",
                "uid": "04e79312dede4a0da5993101e55a796a",
                "response_text": "\nLieutenant Ivy Hendricks is the new Engineering Officer on Aphrodite. Strike and Cob assume that Ivy is a man before she arrives because they are sexist and because her name is listed as I.V. in the orders. Ivy is actually the daughter of the man who designed the award-winning craft.\n\nShe is cold and unfriendly towards Strike after she meets him, and that’s probably because he makes a rude comment about the ship which her father created. After a couple weeks of working together, the two begin to get along very well. Strike admires Ivy’s piloting skills and her depth of knowledge about the Aphrodite. \n\nThe two also bond over their shared hatred of Strike’s former boss, Gorman. Strike feels as though he has ruined his career, and Ivy thinks that Gorman torpedoed her father’s career. Ivy wants nothing more than to prove that Gorman is an idiot. \n\nHowever, when Gorman’s ship is hurtling towards the sun and he and his crew members are about to die, Ivy sees that it’s the perfect opportunity to show Gorman just how wrong he was about the ship her father designed. It’s a very dangerous mission, but Ivy is steadfast in her decision and she’s deeply courageous. She pilots the ship for most of the rescue mission, but eventually faints from the extreme heat. She tells Strike that he needs to take over, and he does a great job. \n\nIvy is then promoted, and she moves to Canalopolis, Mars. She now outranks her former Captain, Strike. \n"
              },
              {
                "worker_id": "5",
                "uid": "71efb8636b504f42a6989bb90e360186",
                "response_text": "Ivy Hendricks is the engineering officer assigned to the Aphrodite. She is the daughter of Harlan Hendricks, the ship's original designer. She is fiercely protective of her father's legacy and resents Admiral Gorman for the way he treated him.\n\nHendricks and Strike, form an alliance of sorts after his initial surprise of seeing a woman assigned to this officer's role. When news arrives that two ships are in danger of falling into the sun, Ivy lobbies to use her father's technology to save the ship. Strike agrees to her plan although the risks are high. The Aphrodite eventually saves the ships although Ivy faints in the process from the heat and command has to be taken over by Strike.\n\nThe successful mission results in a promotion for Ivy as she works as a designer in the Bureau of Ships like her father."
              },
              {
                "worker_id": "3",
                "uid": "8aa46ba8bd2945c98babd7dd2d9ecc38",
                "response_text": "Ivy Hendricks is the new engineering officer on the Aphrodite, having been transferred from the Antigone. She is a tall woman with dark hair and contrasting pale blue eyes, who has a very wide range of experience in ship operations and engineering. Her father, Harlan Hendricks, was the man who designed the Aphrodite, so she knows the ship needs a lot of specific training. At first, the captain did not expect her to be a woman, and managed to imply that many people found her father incompetent. Although she seemed cold at first, as she reacted to the situation, she and the captain eventually got along fairly well, as he learned to appreciate her wide skill set that ranged from engineering to piloting. Ivy and Strike also had a common enemy in the higher ranks: Space Admiral Gorman. Once Spike trusted her he appreciated that Ivy spent a lot of spare time working on the old circuits, so she knew the ship like the back of her hand. When the Aphrodite found the Lachesis and the Atropos when following up on a distress signal, Ivy new the ship well enough to be able to formulate a plan to save everyone. She piloted the Aphrodite carefully, using cables shot with a rocket to connect the three ships together, but the spinning of the ships in the heat inside meant that she passed out and had to leave Strike to take over for her. Her plan was successful; she was promoted, and instead of returning to the Aphrodite she started a design job with the Bureau of Ships."
              }
            ]
          },
          {
            "question_text": "What is the relationship between Strike and Aphrodite?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "6",
                "uid": "0c27bef1b7b644ffba735fdb005f9529",
                "response_text": "Strike is a member of a famous, well-behaved, and well-trained service family. His father and grandfather served in World War II and the Atomic War, respectively. Both earned medals for their heroic service. Strike, however, did not follow in his family’s footsteps. \n\tWith a tendency to say the wrong thing at the wrong time, Strike often offended those around him and garnered a negative reputation. After being put in charge of the Ganymede, he soon lost his position after abandoning his station to rescue colonists who were not in danger. As well, he accused a Martian Ambassador of being a spy at a respectable ball. Admiral Gorman soon demoted him, and he became the commander of the Aphrodite. \n\tAt first, Strike was not a fan. He sees her as ugly, fat, and cantankerous. He misses the Ganymede, a shiny and new rocketship, and views the Aphrodite as less-than. \n\tWithin the first week of flying her, the Aphrodite had a burned steering tube, which made it necessary to go into free-fall as the damage control party made repairs. Strike’s faith in Lover-Girl continued to plummet. \n\tHowever, after Lieutenant Hendricks, the resident engineer, got her hands on the Aphrodite, Strike’s opinion started to change. Her knowledge of the ship, engineering, and piloting helped him gain confidence in both her abilities and those of Aphrodite.\nNear the end of the story, the Aphrodite is tasked with rescuing two ships that are falling into the sun. Previously Lieutenant Hendricks had fixed up the surge-circuit rheostat, and so she offered it up as the only solution. Strike agrees to try it, which shows his faith and trust in the Aphrodite. Luckily, all things go to plan, and the Aphrodite, with Strike piloting, is able to save the two ships and Admiral Gorman. \nAfter Strike won a medal himself, finally following in the family footsteps, he is offered his old position back on the Ganymede. He refuses, and instead returns to old Lover-Girl. He has grown fond of her over the course of their adventure, and they develop a partnership. "
              },
              {
                "worker_id": "1",
                "uid": "04e79312dede4a0da5993101e55a796a",
                "response_text": "Strike is completely unimpressed by the rocket ship Aphrodite. He comments that she looks like a pregnant carp, and he knows that he’s been assigned captain of the ship because he messed up terribly on his other missions. \n\nAphrodite was built 10 years ago, and now she is completely outdated and a laughing stock compared to the other spaceships in the fleet.  She was designed by Harlan Hendricks, and the engineer received a Legion of Merit award for her design. \n\nStrike’s mission is to fly Aphrodite to take the mail from Venusport to Canalopolis, Mars. It’s boring and straightforward.\n\nWhen a disaster occurs and two other ships, the Atropos and the Lachesis, are in serious danger of getting too close to the sun, Strike agrees to take the old girl on a rescue mission. He is convinced by Ivy, since she knows the ship better than anyone else and she believes in her. \n\nAlthough Ivy takes Aphrodite most of the way there, its Strike who finishes the mission and saves his former boss, Gorman, and many other people from certain death. Aphrodite is the entire reason that Strike is able to mend his terrible reputation and he wins back respect from Gorman. Although they got off to a rocky start, Strike finds it impossible to leave his best girl, even when he is offered a job on another ship. He is loyal to the ship that made him a hero. \n"
              },
              {
                "worker_id": "5",
                "uid": "71efb8636b504f42a6989bb90e360186",
                "response_text": "Strike is assigned to be commander of the spaceship Aphrodite. The ship is assigned as a mail carrier for the inner part of the solar system. The Aphrodite is a dilapidated design with an awful reputation. Strike ended up with the Aphrodite as a result of a series of poor professional decisions that resulted in him getting command of the more prestigious ship Ganymede taken away from him.\n\nHis initial impression of the Aphrodite softens to a grudging respect after the successful mission to save the Atropos and Lachesis. Although he presumably is in line to command the Ganymede again, another faux pas resulting in Strike continuing to command the Aphrodite.   "
              },
              {
                "worker_id": "3",
                "uid": "8aa46ba8bd2945c98babd7dd2d9ecc38",
                "response_text": "At the beginning of the story, Strike is very reluctant to accept Aphrodite, because being in charge of the ship means a demotion for him. His perception of the ship at the beginning of the story is colored by this history, and his first impression of the ship is not a positive one, even from the outside. Besides the actual construction of the ship, the technology that ran it was not something he showed much faith in. The first week that he was in charge after leaving Venus, it seemed things were going drastically wrong. When one important piece of equipment burnt out, the ship went into freefall, requiring a lot of repair work from the engineers, and anyone in charge of navigation was handed more work because of this as well. The ship was really put to the test when the Aphrodite responded to the distress call from the Lachesis, whose crew was trying to keep the Atropos from falling into the sun. Because Ivy knew the Aphrodite so well, and had been working on the circuits, it turned out the Aphrodite was the perfect ship to save the day. She could not see the rescue all the way through to the end, because she passed out early, but Strike was conscious a little bit longer and took over until he also passed out. After this unexpected rescue mission, Cob, the Executive Officer, noted that Strike has a newfound appreciation for the ship, and has no intention of leaving. Strike is dedicated to his new mission, even though at the beginning of the story he wanted nothing more than to pilot something the same rank as his old ship."
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "6",
                "uid": "0c27bef1b7b644ffba735fdb005f9529",
                "response_text": "Jinx Ship to the Rescue by Alfred Coppel, Jr. takes place in space, but more specifically in the Aphrodite. \n\tIt starts in the muddy Venusport Base on Venus. Venusport is famous for its warm, slimy, and green rain that falls for 480 hours of every day. A fog rolls in and degrades visibility. \n\tDespite starting on Venusport Base, the characters actually spend most of their time onboard the Aphrodite, a Tellurian Rocket Ship. The Aphrodite had a surge-circuit monitor of twenty guns built into her frame. She was bulky, fat, and ugly, and occasionally had some technical and mechanical struggles as well. \n\tAlthough her frame may not be appealing, she soon becomes victorious as she gains the trust of Strike and other members of his crew and saves two fallen dreadnaughts. With her surge-circuit rheostat rebuilt, the Aphrodite is finally able to accomplish what she was always meant to. "
              },
              {
                "worker_id": "1",
                "uid": "04e79312dede4a0da5993101e55a796a",
                "response_text": "The story starts on the planet of Venus. Venus has days that are 720 hours long, and rain is common. The rain is hot, slimy, and green, and it makes the already wet swamplands even more mushy. Fog is common on Venus.\n\nThe middle of the story takes place on the old and outdated ship, Aphrodite. She gives the crew members a lot of trouble on their first mission. She is in dire need of repairs, she’s slow, and it’s impossible to control her temperature. The crew members are unable to wear their uniforms because the temperature is over 100 degrees. \n\nAphrodite’s mission is simple. She needs to take the mail from Venus to Mars, and it’s the only thing she can be trusted to do successfully. So it’s very impressive when she ends up being the hero of the day and manages to rescue two other ships that are headed towards the sun. \n"
              },
              {
                "worker_id": "5",
                "uid": "71efb8636b504f42a6989bb90e360186",
                "response_text": "The narrative is set in the early 21st century primarily aboard the spaceship Aphrodite. The ship's mission is to deliver mail in the inner part of the solar system.\n\nThe ships route takes them around the sun and as a result the ambient temperature inside the ship begins to rise to intolerable levels due to proximity to the sun. Because of the heat, the coed crew is allowed to operate with very little clothing. Aphrodite is a ship of an outdated design that gives it a lack of comfort and subjects it to numerous small problems that make its operation frustrating."
              },
              {
                "worker_id": "3",
                "uid": "8aa46ba8bd2945c98babd7dd2d9ecc38",
                "response_text": "The story starts at a spaceport on Venus, where it has been raining for hundreds of hours straight. The rain has stopped by the time the story starts, but it is left a lot of mud in the swampy marshes. It was nearing the end of the day, and the fog was enveloping the surroundings as it grew darker outside. It was hot and sticky at Venusport Base, but after Strike left the service on his mission in the Aphrodite, it would only grow hotter on board. The ship itself, where most of the story takes place, is an older, refitted, bulky type of ship. There were only two others like it, and their designer had been awarded a Legion of Merit for the three. However, this is the only one still in use, as the others were destroyed in a much earlier mission. Strike’s disappointment in the ship seems to mirror the sentiment. Inside the ship, there are many systems of pipes connected the control panels, and the captain had to navigate carefully so that he didn’t hit his head on the bulkhead. While in space, as the ship flew closer and closer to the sun, the interior of the ship grew hotter and hotter. The crew opted to wear as little clothing as possible in an attempt to handle the heat. When the Aphrodite received the distress call from the Lachesis, the ships were close enough to the sun to be affected by its gravitational pull. After the close call near the sun, once everyone regained consciousness, the story ends at an officer’s club on Mars. It was a formal environment, and the Aphrodite’s captain and executive officer planned the rest of their route from there."
              }
            ]
          },
          {
            "question_text": "Who is Strike and what happens to him throughout the story?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "6",
                "uid": "0c27bef1b7b644ffba735fdb005f9529",
                "response_text": "Strike is a member of an esteemed service family on Venus; seven generations of well-behaved and well-trained operators. Unfortunately, Strike struggles to carry on the family tradition, and is known for misspeaking and offending those around him. By trusting his gut, he wound up failing his higher-ups and crew several times. All this culminated in an eventual mistrust of Strike, which led to him being charged with the Aphrodite. \n\tHis deep hatred of Space Admiral Gordon is passionate, but not without reason. Gordon is the one who demoted him to the Aphrodite. At the start, Strike is checking out his new vessel and notes how ugly the ship is. After examining the ship and it’s crew, it is revealed that Strike is uncomfortable around women and believes they don’t belong on a spaceship. \n\tIn order to start flying, he calls in an expert engineer to come aboard and travel with them. Thinking I.V. Hendricks is a man, he is excited to have them onboard. But when Ivy Hendricks shows up, a female engineer and the daughter of the Aphrodite’s creator, his world is soon turned upside down. \n\tHis initial negative reaction to her is soon displaced by begrudging appreciation and eventually trust and friendship. Hendricks proves his previous theories about women wrong, and Strike is forced to accept that perhaps women do belong on a spaceship. She especially impresses him with her total knowledge of spaceship engineering and the Aphrodite in general. And it helped that she hated Admiral Gorman just as much as Strike, if not more. \n\tWhile flying by the sun to deliver mail, the Aphrodite receives a distress call from two ships: the Lachesis and the Atropos, the latter of which carried Admiral Gorman onboard. After the Aphrodite reached orbit, the Lachesis reached out and reported the Atropos was falling into the sun, due to a burst chamber. They couldn’t move those onboard over thanks to all the radiation, so the Lachesis was attempting to pull the Atropos back using an unbreakable cord. But it wasn’t enough. \n\tSince Ivy Hendricks had fixed the surge-circuit rheostat--the feature that crashed the original Aphrodite--, they were able to save the Lachesis and the Atropos and regain some of their dignity and former glory. \n\tStrike is awarded the Spatial Cross, as well as Cob, his friend and longtime executive of the Aphrodite. Strike was asked to return to the Ganymede, a beautiful sleek ship, but allegedly said the wrong thing to Gorman, and was instead sent back to the Aphrodite. Cob believes he did it on purpose, as Strike had grown quite fond of Lover-Girl. \n\tIvy has gone to the Bureau of Ships to engineer vessels, a great upgrade from her previous job. Cob pressures Strike to reach out to her, but he refuses. However, it ends on a hopeful note, with the potential for romance between Strike and Hendricks, and even more adventures on the clunky Aphrodite. "
              },
              {
                "worker_id": "1",
                "uid": "04e79312dede4a0da5993101e55a796a",
                "response_text": "Strike’s real name is Brevet Lieutenant Commander David Farragut Strykalski III. After serving on the Ganymede, he is put in charge of the Aphrodite. He comes from many generations of officers. However, he doesn’t feel like he fits the mold of his grandfather and great-grandfather and so on. His boss, Gorman, disagreed with several decisions he made in the past and sent him to work on the Aphrodite, the unimpressive spaceship.\n\nStrike does not like working with women in space, so he is disappointed when two of his crew members are powerful and successful females. He learns his lesson after working with Ivy Hendricks for a few weeks. She impresses him with her piloting skills and her knowledge of the ship that her father designed. \n\nStrike is skeptical at first when Ivy wants to take Aphrodite to rescue two ships whose crew members are in grave danger. He knows that the mistakes he made before got him on the Aphrodite, and there’s a big chance that he’ll be fired for trying to save the day, or worse, the mission could end in death for him and all of his crew members. He has feelings for Ivy, and her intense passion convinces him that she’s right, Aphrodite can handle the mission and they can save those peoples’ lives.\n\nIvy pilots the ship almost the entire route, but she is unable to finish the job when she passes out from the intense heat. Captain Strike takes over and saves the crews on the Atropos and the Lachesis. He is hailed as a hero, and he repairs his terrible reputation with the selfless act. He decides not to leave the Aphrodite. He wants to be loyal to the ship that worked so hard for him. He does decide to give Ivy a call. Even though she outranks him, he has to admit that he has a crush on her. "
              },
              {
                "worker_id": "5",
                "uid": "71efb8636b504f42a6989bb90e360186",
                "response_text": "Strike is the commander of the Aphrodite. He was originally the commander of the prestigious Ganymede. However a number of decisions made out of bravado as well as some unprofessional comments lost him that command.\n\nNow in command of a dilapidated ship, Strike comes to terms with his job. He commands a crew including a large number of women which makes him somewhat uncomfortable. His engineering officer Ivy Hendricks in particular seems to be of romantic interest to Strike.\n\nStrike ends up teaming with Ivy to save two ships from falling into the sun earning him a small promotion but an ill-advised comment prevents him from leaving the Aphrodite, perhaps to the satisfaction of Strike himself."
              },
              {
                "worker_id": "3",
                "uid": "8aa46ba8bd2945c98babd7dd2d9ecc38",
                "response_text": "Strike is a highly decorated lieutenant commander in the Navy, who comes from a long line of ship operators. Although he has run many successful missions, he has a reputation of causing trouble—his new Executive Officer, Cob, has heard a number of stories that he asks Strike for details about. Strike has lost command of the ship that he had been captaining, and is sent by Admiral Gorman to captain a mail route on the Aphrodite. He is extremely hesitant to have any positive feelings about the experience, from the ship itself, to the inclusion of women on its crew. Not only is this not the type of ship he is used to, he is never served with women on board. He has to navigate adapting to the new situation while adapting to the new job. Through the first week of his assignment, the ship and its crew grow on him. He comes to trust Ivy Hendricks, the Engineering Officer, and he lets her take charge to try to save the other ships when they respond to a distress call. Eventually, she passes out, and has to leave Strike in charge of getting the ships to safety. Eventually,  Strike passes out just like everyone else, from the ship’s acceleration to break the sun’s gravity. At the end of the story, it is clear that his increased appreciation for the ship means he plans on staying, to the delight of his Executive Officer. Cob alludes to Strike having feelings for Ivy, but he says that although she is nice, he has no interest in being with a woman with a higher ranked title than he has. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4246,
        "document_length_chars": 25252
      }
    }
  ]
}