{
  "item_metadata": {
    "item_id": "63867",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63867",
      "content": "CAPTAIN MIDAS\n \n\n By ALFRED COPPEL, JR.\n \n \n The captain of the Martian Maid stared avidly at the torn derelict floating against the velvet void. Here was treasure beyond his wildest dreams! How could he know his dreams should have been nightmares?\n \n [Transcriber's Note: This etext was produced from Planet Stories Fall 1949. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Gold! A magic word, even today, isn't it? Lust and gold ... they go hand in hand. Like the horsemen of the Apocalypse. And, of course, there's another word needed to make up the trilogy. You don't get any thing for nothing. So add this: Cost. Or you might call it pain, sorrow, agony. Call it what you like. It's what you pay for great treasure....\n \n These things were true when fabled Jason sailed the Argo beyond Colchis seeking the Fleece. They were true when men sailed the southern oceans in wooden ships. And the conquest of space hasn't changed us a bit. We're still a greedy lot....\n \n I'm a queer one to be saying these things, but then, who has more right? Look at me. My hair is gray and my face ... my face is a mask. The flesh hangs on my bones like a yellow cloth on a rickety frame. I am old, old. And I wait here on my hospital cot—wait for the weight of years I never lived to drag me under and let me forget the awful things my eyes have seen.\n \n I'm poor, too, or else I wouldn't be here in this place of dying for old spacemen. I haven't a dime except for the pittance the Holcomb Foundation calls a spaceman's pension. Yet I had millions in my hands. Treasure beyond your wildest dreams! Cursed treasure....\n \n You smile. You are thinking that I'm just an old man, beached earthside, spinning tall tales to impress the youngsters. Maybe, thinking about the kind of spacemen my generation produced, you have the idea that if ever we'd so much as laid a hand on anything of value out in space we'd not let go until Hell froze over! Well, you're right about that. We didn't seek the spaceways for the advancement of civilization or any of that Foundation bushwah, you can be certain of that. We did it for us ... for Number One. That's the kind of men we were, and we were proud of it. We hung onto what we found because the risks were high and we were entitled to keep what we could out there. But there are strange things in the sky. Things that don't respond to all of our neat little Laws and Theories. There are things that are no part of the world of men, thick with danger—and horror.\n \n \n\n \n If you doubt that—and I can see you do—just look at me. I suppose you've never heard of the Martian Maid, and so you don't know the story of what happened to her crew or her skipper. I can give you this much of an answer. I was her skipper. And her crew? They ride high in the sky ... dust by this time. And all because they were men, and men are greedy and hasty and full of an unreasoning, unthinking love for gold. They ride a golden ship that they paid for with all the years of their lives. It's all theirs now. Bought and paid for.\n \n It wasn't too long ago that I lifted the Maid off Solis Lacus on that last flight. Not many of you will remember her class of ship, so many advances have been made in the last few years. The Maid was two hundred feet from tip to tail, and as sleek a spacer as ever came out of the Foundation Yards. Chemical fueled, she was nothing at all like the spherical hyperdrives we see today. She was armed, too. The Foundation still thought of space as a possible stamping ground for alien creatures though no evidence of any extra-terrestrial life had ever been found ... then.\n \n My crew was a rough bunch, like all those early crews. I remember them so well. Lean, hungry men with hell in their eyes and a great lust for high pay and hard living. Spinelli, Shelley, Cohn, Marvin, Zaleski. There wasn't a man on board who wouldn't have traded his immortal soul for a few solar dollars, and I don't claim that I was any different. That's the kind of men that opened up the spaceways, too. Don't believe all this talk about the noble pioneering spirit of man. That's tripe. There never has been such a thing as a noble pioneer. Not in space or anywhere else. It is the malcontent and the adventuring mercenary that pushes the frontier outward.\n \n I didn't know, that night as I stood in the valve of the Maid, watching the loading cranes pull away, that I was starting out on my last flight. I don't think any of the others could have guessed, either. It was the sort of night that you only see on Mars. The sort of night that makes a spaceman wonder why in hell he wants to leave the relative security of the Earth-Mars-Venus Triangle to go jetting across the belt into deep space and the drab desolation of the outer System.\n \n I stood there, watching the lights of Canalopolis in the distance. For just a moment I was ... well, touched. It looked beautiful and unreal under the racing moons. The lights of the gin mills and houses made a sparkling filigree pattern on the dark waters of the ancient canal, and the moons cast their shifting shadows across the silted banks. I was too far away to see the space-fevered bums and smell the shanties, and for a little while I felt the wonder of standing on the soil of a world that man had made his own with his rapacity and his sheer guts and gimme.\n \n I thought of our half empty cargo hold and the sweet payload we would pick up on Callisto. And I counted the extra cash my packets of snow would bring from those lonely men up there on the barren moonlets of the outer Systems. There were plenty of cargoes carried on the Maid that the Holcomb Foundation snoopers never heard about, you can be sure of that.\n \n In those days the asteroid belt was the primary danger and menace to astrogation. For a long while it held men back from deep space, but as fuels improved a few ships were sent out over the top. A few million miles up out of the ecliptic plane brings you to a region of space that's pretty thinly strewn with asteroids, and that's the way we used to make the flight between the outer systems and the EMV Triangle. It took a long while for hyperdrives to be developed and of course atomics never panned out because of the weight problem.\n \n So that's the orbit the Maid took on that last trip of mine. High and clear into the supra-solar void. And out there in that primeval blackness is where we found the derelict.\n \n \n\n \n I didn't realize it was a derelict when Spinelli first reported it from the forward scope position. I assumed it was a Foundation ship. The Holcomb Foundation was founded for the purpose of developing spaceflight, and as the years went by it took on the whole responsibility for the building and dispatching of space ships. Never in history had there been any real evidence of extra-terrestrial intelligent life, and when the EMV Triangle proved barren, we all just assumed that the Universe was man's own particular oyster. That kind of unreasoning arrogance is as hard to explain as it is to correct.\n \n There were plenty of ships being lost in space, and immediately that Spinelli's report from up forward got noised about the Maid every one of us started mentally counting up his share of the salvage money. All this before we were within ten thousand miles of the hulk!\n \n All spaceships look pretty much alike, but as I sat at the telescope I saw that there was something different about this one. At such a distance I couldn't get too much detail in our small three inch glass, but I could see that the hulk was big—bigger than any ship I'd ever seen before. I had the radar fixed on her and then I retired with my slide rule to Control. It wasn't long before I discovered that the derelict ship was on a near collision course, but there was something about its orbit that was strange. I called Cohn, the Metering Officer, and showed him my figures.\n \n \"Mister Cohn,\" I said, chart in hand, \"do these figures look right to you?\"\n \n Cohn's dark eyes lit up as they always did when he worked with figures. It didn't take him long to check me. \"The math is quite correct, Captain,\" he said. I could see that he hadn't missed the inference of those figures on the chart.\n \n \"Assemble the ship's company, Mister Cohn,\" I ordered.\n \n The assembly horn sounded throughout the Maid and I could feel the tug of the automatics taking over as the crew left their stations. Soon they were assembled in Control.\n \n \"You have all heard about Mister Spinelli's find,\" I said, \"I have computed the orbit and inspected the object through the glass. It seems to be a spacer ... either abandoned or in distress....\" Reaching into the book rack above my desk I took down a copy of the Foundation's Space Regulations and opened it to the section concerning salvage.\n \n \"Sections XVIII, Paragraph 8 of the Code Regulating Interplanetary Astrogation and Commerce,\" I read, \"Any vessel or part of vessel found in an abandoned or totally disabled condition in any region of space not subject to the sovereignty of any planet of the Earth-Venus-Mars Triangle shall be considered to be the property of the crew of the vessel locating said abandoned or disabled vessel except in such cases as the ownership of said abandoned or disabled vessel may be readily ascertained....\" I looked up and closed the book. \"Simply stated, that means that if that thing ahead of us is a derelict we are entitled to claim it as salvage.\"\n \n \"Unless it already belongs to someone?\" asked Spinelli.\n \n \"That's correct Mister Spinelli, but I don't think there is much danger of that,\" I replied quietly. \"My figures show that hulk out there came in from the direction of Coma Berenices....\"\n \n There was a long silence before Zaleski shifted his two hundred pounds uneasily and gave a form to the muted fear inside me. \"You think ... you think it came from the stars , Captain?\"\n \n \"Maybe even from beyond the stars,\" Cohn said in a low voice.\n \n Looking at that circle of faces I saw the beginnings of greed. The first impact of the Metering Officer's words wore off quickly and soon every man of my crew was thinking that anything from the stars would be worth money ... lots of money.\n \n Spinelli said, \"Do we look her over, Captain?\"\n \n They all looked at me, waiting for my answer. I knew it would be worth plenty, and money hunger was like a fever inside me.\n \n \"Certainly we look it over, Mister Spinelli,\" I said sharply.\n\"Certainly!\"\n \n \n\n \n The first thing about the derelict that struck us as we drew near was her size. No ship ever built in the Foundation Yards had ever attained such gargantuan proportions. She must have stretched a full thousand feet from bow to stern, a sleek torpedo shape of somehow unspeakable alienness. Against the backdrop of the Milky Way, she gleamed fitfully in the light of the faraway sun, the metal of her flanks grained with something like tiny, glittering whorls. It was as though the stuff were somehow unstable ... seeking balance ... maybe even alive in some strange and alien way.\n \n It was readily apparent to all of us that she had never been built for inter-planetary flight. She was a starship. Origin unknown. An aura of mystery surrounded her like a shroud, protecting the world that gave her birth mutely but effectively. The distance she must have come was unthinkable. And the time it had taken...? Aeons. Millennia. For she was drifting, dead in space, slowly spinning end over end as she swung about Sol in a hyperbolic orbit that would soon take her out and away again into the inter-stellar deeps.\n \n Something had wounded her ... perhaps ten million years ago ... perhaps yesterday. She was gashed deeply from stem to stern with a jagged rip that bared her mangled innards. A wandering asteroid? A meteor? We would never know. It gave me an uncomfortable feeling of things beyond the ken of men as I looked at her through the port. I would never know what killed her, or where she was going, or whence she came. Yet she was mine. It made me feel like an upstart. And it made me afraid ... but of what?\n \n We should have reported her to the nearest EMV base, but that would have meant that we'd lose her. Scientists would be sent out. Men better equipped than we to investigate the first extrasolar artifact found by men. But I didn't report her. She was ours. She was money in the bank. Let the scientists take over after we'd put a prize crew aboard and brought her into Callisto for salvage.... That's the way I had things figured.\n \n The Maid hove to about a hundred yards from her and hung there, dwarfed by the mighty glistening ship. I called for volunteers and we prepared a boarding party. I was thinking that her drives alone would be worth millions. Cohn took charge and he and three of the men suited up and crossed to her.\n \n In an hour they were back, disappointment largely written on their faces.\n \n \"There's nothing left of her, Captain,\" Cohn reported, \"Whatever hit her tore up the innards so badly we couldn't even find the drives. She's a mess inside. Nothing left but the hull and a few storage compartments that are still unbroken.\"\n \n She was never built to carry humanoids he told us, and there was nothing that could give us a hint of where she had come from. The hull alone was left.\n \n He dropped two chunks of metal on my desk. \"I brought back some samples of her pressure hull,\" he said, \"The whole thing is made of this stuff....\"\n \n \"We'll still take her in,\" I said, hiding my disappointment. \"The carcass will be worth money in Callisto. Have Mister Marvin and Zaleski assemble a spare pulse-jet. We'll jury-rig her and bring her down under her own power. You take charge of provisioning her. Check those compartments you found and install oxy-generators aboard. When it's done report to me in my quarters.\"\n \n I picked up the two samples of gleaming metal and called for a metallurgical testing kit. \"I'm going to try and find out if this stuff is worth anything....\"\n \n The metal was heavy—too heavy, it seemed to me, for spaceship construction. But then, who was to say what conditions existed on that distant world where this metal was made?\n \n Under the bright fluorescent over my work-table, the chunks of metal torn from a random bulkhead of the starship gleamed like pale silver; those strange little whorls that I had noticed on the outer hull were there too, like tiny magnetic lines of force, making the surface of the metal seem to dance. I held the stuff in my bare hand. It had a yellowish tinge, and it was heavier ....\n \n Even as I watched, the metal grew yellower, and the hand that held it grew bone weary, little tongues of fatigue licking up my forearm. Suddenly terrified, I dropped the chunk as though it were white hot. It struck the table with a dull thud and lay there, a rich yellow lump of metallic lustre.\n \n For a long while I just sat and stared. Then I began testing, trying all the while to quiet the trembling of my hands. I weighed it on a balance. I tested it with acids. It had changed unquestionably. It was no longer the same as when I had carried it into my quarters. The whorls of force were gone. It was no longer alive with a questing vibrancy ... it was inert, stable. From somewhere, somehow, it had drawn the energy necessary for transmutation. The unknown metal—the stuff of which that whole mammoth spaceship from the stars was built—was now....\n  Gold!\n \n \n I scarcely dared believe it, but there it was staring at me from my table-top. Gold!\n \n \n I searched my mind for an explanation. Contra-terrene matter, perhaps, from some distant island universe where matter reacted differently ... drawing energy from somewhere, the energy it needed to find stability in its new environment. Stability as a terrene element—wonderfully, miraculously gold!\n \n And outside, in the void beyond the Maid's ports there were tons of this metal that could be turned into treasure. My laughter must have been a wild sound in those moments of discovery....\n \n \n\n \n A slight sound behind me made me spin around in my chair. Framed in the doorway was the heavy figure of my Third Officer, Spinelli. His black eyes were fastened hungrily on the lump of yellow metal on the table. He needed no explanation to tell him what it was, and it seemed to me that his very soul reached out for the stuff, so sharp and clear was the meaning of the expression on his heavy face.\n \n \"Mister Spinelli!\" I snapped, \"In the future knock before entering my quarters!\"\n \n Reluctantly his eyes left the lump of gold and met mine. \"From the derelict, Captain?\" There was an imperceptible pause between the last two words.\n \n I ignored his question and made a mental note to keep a close hand on the rein with him. Spinelli was big and dangerous.\n \n \"Speak your piece, Mister,\" I ordered sharply.\n \n \"Mister Cohn reports the derelict ready to take aboard the prize crew ... sir,\" he said slowly. \"I'd like to volunteer for that detail.\"\n \n I might have let him go under ordinary circumstances, for he was a first class spaceman and the handling of a jury-rigged hulk would need good men. But the gold-hunger I had seen in his eyes warned me to beware. I shook my head. \"You will stay on board the Maid with me, Spinelli. Cohn and Zaleski will handle the starship.\"\n \n Stark suspicion leaped into his eyes. I could see the wheels turning slowly in his mind. Somehow, he was thinking, I was planning to cheat him of his rightful share of the derelict treasure ship.\n \n \"We will say nothing to the rest of the crew about the gold, Mister Spinelli,\" I said deliberately, \"Or you'll go to Callisto in irons. Is that clear?\"\n \n \"Aye, sir,\" murmured Spinelli. The black expression had left his face and there was a faintly scornful smile playing about his mouth as he turned away. I began wondering then what he had in mind. It wasn't like him to let it go at that.\n \n Suddenly I became conscious of being very tired. My mind wasn't functioning quite clearly. And my arm and hand ached painfully. I rubbed the fingers to get some life back into them, still wondering about Spinelli.\n \n Spinelli talked. I saw him murmuring something to big Zaleski, and after that there was tension in the air. Distrust.\n \n For a few moments I pondered the advisability of making good my threat to clap Spinelli into irons, but I decided against it. In the first place I couldn't prove he had told Zaleski about the gold and in the second place I needed Spinelli to help run the Maid.\n \n I felt that the Third Officer and Zaleski were planning something, and I was just as sure that Spinelli was watching Zaleski to see to it that there was no double-cross.\n \n I figured that I could handle the Third Officer alone so I assigned the rest, Marvin and Chelly, to accompany Cohn and Zaleski onto the hulk. That way Zaleski would be outnumbered if he tried to skip with the treasure ship. But, of course, I couldn't risk telling them that they were to be handling a vessel practically made of gold.\n \n I was in agony. I didn't want to let anyone get out of my sight with that starship, and at the same time I couldn't leave the Maid. Finally I had to let Cohn take command of the prize crew, but not before I had set the radar finder on the Maid's prow squarely on the derelict.\n \n \n\n \n Together, Spinelli and I watched the Maid's crew vanish into the maw of the alien ship and get her under way. There was a flicker of bluish fire from her jury-rigged tubes astern, and then she was vanishing in a great arc toward the bright gleam of Jupiter, far below us. The Maid followed under a steady one G of acceleration with most of her controls on automatic.\n \n Boats of the Martian Maid's class, you may remember, carried a six inch supersonic projector abaft the astrogation turret. These were nasty weapons for use against organic life only. They would reduce a man to jelly at fifty thousand yards. Let it be said to my credit that it wasn't I who thought of hooking the gun into the radar finder and keeping it aimed dead at the derelict. That was Spinelli's insurance against Zaleski.\n \n When I discovered it I felt the rage mount in me. He was willing to blast every one of his shipmates into pulp should the hulk vary from the orbit we'd laid out for her. He wasn't letting anything come between him and that mountain of gold.\n \n Then I began thinking about it. Suppose now, just suppose, that Zaleski told the rest of the crew about the gold. It wouldn't be too hard for the derelict to break away from the Maid, and there were plenty of places in the EMV Triangle where a renegade crew with a thousand tons of gold would be welcomed with open arms and no questions asked. Suspicion began to eat at me. Could Zaleski and Cohn have dreamed up a little switch to keep the treasure ship for themselves? It hadn't seemed likely before, but now—\n \n The gun-pointer remained as it was.\n \n As the days passed and we reached turn-over with the hulk still well within visual range, I noticed a definite decrease in the number of messages from Cohn. The Aldis Lamps no longer blinked back at the Maid eight or ten times a day, and I began to really regret not having taken the time to equip the starship with UHF radio communicators.\n \n Each night I slept with a hunk of yellow gold under my bunk, and ridiculously I fondled the stuff and dreamed of all the things I would have when the starship was cut up and sold.\n \n My weariness grew. It became almost chronic, and I soon wondered if I hadn't picked up a touch of space-radiation fever. The flesh of my hands seemed paler than it had been. My arms felt heavy. I determined to report myself to the Foundation medics on Callisto. There's no telling what can happen to a man in space....\n \n Two days past turn-over the messages from the derelict came through garbled. Spinelli cursed and said that he couldn't read their signal. Taking the Aldis from him I tried to raise them and failed. Two hours later I was still failing and Spinelli's black eyes glittered with an animal suspicion.\n \n \"They're faking!\"\n \n \"Like hell they are!\" I snapped irritably, \"Something's gone wrong....\"\n \n \"Zaleski's gone wrong, that's what!\"\n \n I turned to face him, fury snapping inside of me. \"Then you did disobey my orders. You told him about the gold!\"\n \n \"Sure I did,\" he sneered. \"Did you expect me to shut up and let you land the ship yourself and claim Captain's share? I found her, and she's mine!\"\n \n I fought to control my temper and said: \"Let's see what's going on in her before deciding who gets what, Mister Spinelli.\"\n \n Spinelli bit his thick lips and did not reply. His eyes were fixed on the image of the starship on the viewplate.\n \n A light blinked erratically within the dark cut of its wounded side.\n \n \"Get this down, Spinelli!\"\n \n The habit of taking orders was still in him, and he muttered: \"Aye ... sir.\"\n \n The light was winking out a message, but feebly, as though the hand that held the lamp were shaking and the mind conceiving the words were failing.\n \n \"CONTROL ... LOST ... CAN'T ... NO ... STRENGTH ... LEFT ... SHIP ... WALLS ... ALL ... ALL GOLD ... GOLD ... SOMETHING ... HAPPENING ... CAN'T ... UNDERSTAND ... WHA....\" The light stopped flashing, abruptly, in mid-word.\n \n \"What the hell?\" demanded Spinelli thickly.\n \n \"Order them to heave to, Mister,\" I ordered.\n \n He clicked the Aldis at them. The only response was a wild swerve in the star-ship's course. She left the orbit we had set for her as though the hands that guided her had fallen away from the control.\n \n Spinelli dropped the Aldis and rushed to the control panel to make the corrections in the Maid's course that were needed to keep the hulk in sight.\n \n \"Those skunks! Double crossing rats!\" he breathed furiously. \"They won't shake loose that easy!\" His hands started down for the firing console of the supersonic rifle.\n \n I caught the movement from the corner of my eye.\n \n \" Spinelli! \"\n \n My shout hung in the still air of the control room as I knocked him away from the panel.\n \n \"Get to your quarters!\" I cracked.\n \n He didn't say a thing, but his big shoulders hunched angrily and he moved across the deck toward me, his hands opening and closing spasmodically. His eyes were wild with rage and avarice.\n \n \"You'll hang for mutiny, Spinelli!\" I said.\n \n \n\n \n He spat out a foul name and leaped for me. I side-stepped his charge and brought my joined fists down hard on the back of his neck. He stumbled against the bulkhead and his eyes were glazed. He charged again, roaring. I stepped aside and smashed him in the mouth with my right fist, then crossing with an open-handed left to the throat. He staggered, spun and came for me again. I sank a hard left into his stomach and nailed him on the point of the jaw with a right from my shoe-tops. He straightened up and sprawled heavily to the deck, still trying to get at me. I aimed a hard kick at his temple and let it go. My metal shod boot caught him squarely and he rolled over on his face and lay still.\n \n \n I nailed him with a right from my shoe-tops.\n \n\n \n Breathing heavily, I rolled him back face up. His eyes were open,\n glassy with an implacable hate. I knelt at his side and listened for\n his breathing. There was none. I knew then that I had killed him. I\n felt sick inside, and dizzy.\n \n I wasn't myself as I turned away from Spinelli's body there on the\n steel deck. Some of the greed died out of me, and my exertions had\n increased my sense of fatigue to an almost numbing weariness. My arms\n ached terribly and my hands felt as though they had been sucked dry of\n their substance. Like a man in a nightmare, I held them up before my\n face and looked at them. They were wrinkled and grey, with the veins\n standing out a sickly purple. And I could see that my arms were taking\n on that same aged look.\n \n I was suddenly fully aware of my fear. Nothing fought against the\n flood of terror that welled through me. I was terrified of that yellow\n gold in my cabin, and of that ship of devil's metal out there in space\n that held my shipmates. There was something unnatural about that\n contra-terrene thing ... something obscene.\n \n I located the hulk in the radar finder and swung the Maid after it,\n piling on acceleration until my vision flickered. We caught her, the\n Maid and I. But we couldn't stop her short of using the rifle on her,\n and I couldn't bring myself to add to my depravity by killing the rest\n of my men. It would have been better if I had!\n \n I laid the Maid alongside the thousand foot hull of the derelict and\n set the controls on automatic. It was dangerous, but I was beyond\n caring. Then I was struggling to get myself into a pressure suit with\n my wrinkled, failing hands.... Then I was outside, headed for that dark\n hole.\n \n I sank down into the stillness of her interior, my helmet light casting\n long, fey shadows across the littered decks. Decks that had a yellowish\n cast ... decks that no longer danced with tiny questing force-whorls....\n \n As I approached the airlock of the compartment set aside as living\n quarters for the prize crew, the saffron of the walls deepened. Crazy\n little thoughts began spinning around in my brain. Words out of the\n distant past loomed up with a new and suddenly terrifying\n perspective ... alchemy ... transmutation ... energy. I'm a spaceman,\n not a scientist. But in those moments I think I was discovering what\n had happened to my crew and why the walls were turning into yellow\n metal.\n \n The lock was closed, but I swung it open and let the pressure in the\n chamber rise. I couldn't wait for it to reach fourteen pounds ...\n at eleven, I swung the inner door and stumbled eagerly through. The\n brilliant light, reflected from gleaming walls blinded me for a moment.\n \n And then I saw them! They huddled, almost naked in a corner, skeletal\n things with skull-like faces that leered at me with the vacuous\n obscenity of old age. Even their voices were raw and cracked with the\n rusty decay of years. They babbled stupidly, caressing the walls with\n claw-like hands. They were old, old!\n \n I understood then. I knew what my wrinkled aged hands meant. That\n devil-metal from beyond the stars had drawn the energy it needed\n from ... us !\n \n My laughter was a crazy shriek inside my helmet. I looked wildly at the\n gleaming walls that had sucked the youth and strength from these men.\n The walls were stable, at rest. They were purest gold ... gold ... gold!\n \n I ran from that place still screaming with the horror of it. My hands\n burned like fire! Age was in them, creeping like molten lead through my\n veins, ghastly and sure....\n \n I reached the Maid and threw every scrap of that alien metal into space\n as I streaked madly away from that golden terror in the sky and its\n load of ancient evil....\n \n \n\n \n On Callisto I was relieved of my command. The Admiralty Court acquitted\n me of the charges of negligence, but the Foundation refused me another\n ship. It was my ... illness. It spread from my hands, as you can see.\n Slowly, very slowly. So what remains for me? A hospital cot and a\n spaceman's pension. Those tons of gold in the sky are cursed, like most\n great treasures. Somewhere, out in the deeps between the stars, the\n dust of my crew guards that golden derelict. It belongs to them now ...\n all of it.\n \n But the price we pay for treasure is this. Look at me. I look eighty!\n I'm thirty two. And the bitterest part of the story is that people\n laugh at me when I tell what happened. They laugh and call me my\n nickname. Have you heard it?\n \n It's ... Captain Midas.",
      "metadata": {
        "title": "Captain Midas",
        "author": "Alfred Coppel, Jr.",
        "passage_id": "63867",
        "uid": "bc0f3036c4bc459db4d3aa519655ffae",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "109",
                "uid": "a051ee2965f24618aeca6ed36ced6170",
                "response_text": "This story follows the Martian Maid’s journey and features its crew members: a captain nicknamed ‘Captain Midas’, Mister Spinelli the Third Officer, and various other shipmates. It is revealed that many of the crew members have a lust for making money, and an apt opportunity to do so is discovered when Mister Spinelli spots a derelict ship amongst the asteroids that could be claimed by them. After a first exploration, Midas ends up with a mystery metal collected from the starship. In his further investigation, he finds that this mystery metal transforms into a heavier metal with a yellow tinge - gold. At the same time, he finds that holding the metal evokes fatigue in him, particularly in his arms. This initial investigation was interrupted by Spinelli barging into Midas’ quarters and spotting the gold. Fearful of the other shipmates knowing and hence collecting it for themselves, Midas threatens Spinelli’s silence. \n\nMidas continues the acquisition of this derelict ship by sending a crew, led by Cohn, to further investigate and take control of the ship. With Midas and Spinelli left behind, they watch their shipmates enter the alien ship. While waiting to hear back from the crew, Midas notices that Spinelli has arranged the Maid’s gun to point at the derelict ship and their crew mates. Initially enraged, Midas soon calms down as he begins to suspect that the rest of the crew knows about the gold and may be hatching an alternate plan. Two days past the check-in time, the pair receives a garbled message from the crew. Midas orders them to disembark and depart, but the starship begins to divert its course. In arguing between something being wrong and Spinelli telling the crew about the gold, Spinelli begins to inch towards the firing panel for the gun and a tussle emerges between the two with Midas killing him. \n\nAfter re-catching the derelict ship, Midas boards the ship to look for the rest of his crew mates. He finds the walls to turn into yellow metal and the decks to have a yellowish cast as well. Inside the ship, he sees skeletal and rusty versions of his crew, and comes to the horrifying realization that the transformation of the metal into gold comes at the expense of him and his crew member’s youth and strength. Running from the ship, Midas reboards the Maid and quickly throws the alien ship back into space. Back on Callisto, the Foundation relieves him of his command as the illness spreads to the rest of his body. \n"
              },
              {
                "worker_id": "113",
                "uid": "5efb8eff09144be3ad6f0b87a152e70a",
                "response_text": "This story is about the last spatial flight of Captain Midas. He lives in a time when humans have explored and deemed safe the Earth-Mars-Venus Triangle. At the beginning, he talks about greedy human nature and what it can cause. Years ago, he was a skipper of the Martian Maid spaceship flying to Callisto. His crew - Spinelli, Shelley, Cohn, Marvin, Zaleski - people with love for money, not noble pioneers. They detected a derelict in the supra-solar void between the EMV Triangle and the outer systems. First, they thought it was The Holcomb Foundation ship, but this one was the largest craft they had ever seen. It was on a near-collision course and probably came in from the direction of Coma Berenices - the stars. He gathered the crew and informed them that they were entitled to claim this derelict as salvage. Everyone got excited and started thinking about the money they could get for this craft. The skipper was supposed to report their finding to the EMV base. But Midas decided to do that after receiving the money for its parts. When they got near the craft, Midas noticed that the metal of its flanks was grained with glittering whorls. They realized it was a starship, and it probably had been roaming through space for millennia. It was gashed deeply by something. Cohn and three other men came back disappointed, saying there was nothing valuable inside. He brought two samples of the ship’s metal. Midas examined the chunks at his work-table, and soon the metal grew yellower. He spent some time testing the sample, and it became stable, drawing the necessary energy from somewhere, and turned into gold. Spinelli unexpectedly came into his office and noticed the piece of gold. He volunteers to go onboard the derelict, but Midas refuses. He also orders Spinelli not to say anything about the precious stone. Captain then saw Spinelli murmuring something to Zaleski and also felt inexplicably tired. He assigned  Marvin and Chelly to accompany Cohn and Zaleski onto the hulk in case of mutiny. With time, the number of messages from Cohn started decreasing, and they came through garbled. They sent a strange message that stated that they had lost control. Spinelli got infuriated and almost fired at the big ship from the supersonic rifle. Midas aggressively ordered him to stop, and Spinelli attacked him. After a short fight, Midas killed the officer and immediately noticed that his hands were sickly purple. He put on a pressure suit and decided to go onboard the derelict. Inside he saw his crewmates, their skeletal bodies, and old faces. The walls around them were gold. Midas realized that the ship’s metal was taking the energy required to make it stable from people who touched it. He ran and threw all the gold away. Midas landed on Callisto and was relieved of his command. The illness slowly spread from his hands to other body parts. Now he’s in a hospital and looks eighty though he’s thirty two. \n\n\n"
              },
              {
                "worker_id": "112",
                "uid": "7f7901fd731c479aaff320e5a084c10a",
                "response_text": "Captain Midas lives on the spacemen’s pension from Holcomb Foundation. He starts a story about his experience of once having a tremendous amount of treasure. The story begins with him and the crew members on the spaceship Martian Maid when they find a massive derelict in the outer system of the Earth-Mars-Venus Triangle in space. Mister Spinelli is the first one to find the derelict. After he reports to the captain, and the captain measures the course of the derelict, they decide to search over the hulk based on the Space Regulation that any derelict belongs to the discoverer. They sense the chance of treasure in the derelict, searching over it without reporting to the nearest EMV base. At first, they do not find anything valuable inside the ship, so they decide to bring the whole derelict. Mister Cohn brings two pieces of the metal constituting the derelict to the captain.  When the captain examines the metal, he finds his hand grows bony and old while the metal becomes gold. He realizes that the metal can somehow transmute the energy to the property of metal, stabilizing itself to become gold. Mister Spinelli witnesses this discovery when the captain is trying in his room. When Mister Spinelli asks the captain whether he can help take the derelict abroad, the captain denies his request and orders him not to leak the information about the metal. Mister Spinelli tells Zaleski, who will take care of the derelict, about the metal. The captain orders the rest of the members to help Zaleski, ensuring that he cannot take the derelict himself. The captain sets the radar finder to watch the derelict. While Spinelli and the captain watch over the derelict with a turret pointing toward it, the message from Mister Cohn, who takes charge of the crew on the derelict, starts to decrease. When they find the derelict begins to get out of sight, Spinelli suspects them of betraying and attacks the captain, while the captain senses the danger of the decreasing message and fights back. The captain kills Mister Spinelli. As the captain examines his hand’s condition, he realizes something goes wrong. The captain controls the Maid to catch up with the derelict, attempting to shoot it but fails. He wears the pressure suit and goes to the derelict, finding the prize crew aged and caress the metal. He realizes that the energy the metal draws comes from organic life, which in this situation is humans. He runs to the Maid, throws away any alien metals, and flees. And now, he lives on the spacemen’s pension, old and weary when he should be young and strong."
              },
              {
                "worker_id": "107",
                "uid": "8fafe67ddc6d4047877b2c2cd723631d",
                "response_text": "The captain of the Martian Maid starts off describing gold and the greatness of the treasure. He begins to mention how old he is, and he is also poor because he would not be here otherwise. The man goes further on to describe how people of his generation did not let anything go because they were entitled to keep whatever they found. He begins talking about how he is the skipper of the Martian Maid, and the rest of the crew ride a golden ship that they paid for with their lives. He begins to talk about the experience not too long ago, how none of the crew would have known that this was their last flight. He thinks about the sweet payload they would pick up in Callisto from delivering all of the cargo. The captain also mentions how dangerous the asteroid belt was for astrogation at the time. The story then cuts to Spinelli reporting a derelict to the rest of the crew. Once they are near the collision, an abandoned spacer is found. However, even though they have claim over the ship, the captain’s calculations show that it came from beyond the stars. Everybody becomes excited at the prospect of money; the derelict is much bigger than anything the Foundation Yards have ever built. It is also damaged too, as there is a gash from the stem to the stern with a jagged rip in its bare mangled innards. Some of the men are sent to go explore the ship, but they come back disappointed that there is nothing worthy left inside. The ship itself was never built to carry humans, but the crew still decides to take her along. When the captain puts the metal through the metallurgical testing kit, however, he discovers that it is gold. Spinelli tells him that the derelict is ready, but the captain makes him stay on the Maid with him. A few other members of the crew seem to be planning something, and the captain wonders if there is a chance that they will take off with the treasure ship. Spinelli reveals later that he did tell Zaleski about the gold, but they receive a message about losing control on the ship. Spinelli leaps at the captain, and the two of them fight. When the captain realizes that Spinelli is dead, he suddenly looks at his arms and sees how old he has become. He goes to the gold ship and sees the rest of the crew as almost skeletal beings. Realizing that the gold draws energy from them, he discards all of it and speeds away in the Maid. He is relieved of his duty on Callisto, and the Foundation refuses him another ship. The captain is thirty-two, but he looks eighty and is stuck on a hospital cot. The bitterest part is people laugh and call him Captain Midas when he tells this story. "
              }
            ]
          },
          {
            "question_text": "Who is Captain Midas and what are some of his characteristics?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "109",
                "uid": "a051ee2965f24618aeca6ed36ced6170",
                "response_text": "Captain Midas is the captain of the spaceship Martian Maid, who unknowingly takes the spaceship on its last flight in this story. He is described to be relatively young at 32 years old, but after interacting with the metal and at the end of the story, has the physical appearance of an eighty year old man with wrinkles and veiny hands. \n\nHe is a greedy man. In the beginning of the story, he honestly admits that he would do quite a few things for a few solar dollars, which we see throughout the story. In addition to his greed, he is a selfish man, as in discovering the gold he threatens Spinelli to secrecy in order to keep the highest gains for himself. It is also this greed that allows Spinelli to get away with initially aiming the gun at the derelict ship and their fellow shipmates on board in case those shipmates try to escape with the gold.  \n\nThere are brief moments where he is shown to be an honorable man. For one, he fights Spinelli over blasting their fellow shipmates, and ends up killing Spinelli instead by accident. At the end of the story, he becomes terrified of the derelict ship and its devil metal, and yet still chooses to go aboard it to seek out his shipmates. \n"
              },
              {
                "worker_id": "113",
                "uid": "5efb8eff09144be3ad6f0b87a152e70a",
                "response_text": "Captain Midas is a spaceman, a skipper of the Martian Maid spaceship. He is confident, experienced, and a natural leader - he can feel how the mood of his crew changes and what they are able to do. He knows how Spinelli and Zaleski can act if they find out about the gold and tries to be cautious. He is greedy - Midas gets blinded by the prospect of getting lots of money for the metal parts of the derelict and initially doesn’t notice the metal’s unique feature. Still, he values his team and finds it disgusting that Spinelli would be ready to kill his own colleagues for some gold. Midas also attempts to learn what happened to them when Spinelli gets out of control and thinks that the other members of the team betrayed him and stole his gold. He doesn’t feel normal after killing Spinelli - Midas doesn’t enjoy violence. "
              },
              {
                "worker_id": "112",
                "uid": "7f7901fd731c479aaff320e5a084c10a",
                "response_text": "Captain Midas is the captain of the spaceship Martian Maid. He looks bony, wrinkled, and weary. He looks eighty when he is thirty-two. He is greedy for money as he and the whole crew search every possibility in space to find treasure or things that can be traded for money. His greed also makes him not report to the interplanetary base when the crew finds the derelict. He prioritizes his lust for treasure over his duty as a captain, suspecting everyone on the ship to steal the derelict, but he also maintains his reason in the situation where the lust for treasure may surpass his duty as a captain. This can be shown when Mister Spinelli and the captain find it hard to read the message from the crewmembers on the derelict; he senses the danger while Mister Spinelli only thinks about his treasure. He is rational that all his actions have a reason, such as letting Mister Spinelli set the weapon pointing toward the derelict to ensure the rest of the crew members do not steal the treasure and flee. He has the moral that he feels guilty when he kills Mister Spinelli."
              },
              {
                "worker_id": "107",
                "uid": "8fafe67ddc6d4047877b2c2cd723631d",
                "response_text": "The captain of the Martian Maid, nicknamed Captain Midas, is the skipper of the boat. He works alongside the rest of the crew, consisting of Spinelli, Shelley, Cohn, Marvin, and Zaleski. The captain is only thirty-two, but he looks eighty by the end of the story. Physically, he is described as having gray hair, flesh hanging off of his bone like a yellow cloth, and face a mask. He is a hard-working man, willing to go to any means to earn his share of money. He is also poor, which is why he was so driven to keep the treasure ship when he found it. Captain Midas, however, is a lot more level-headed than the rest of the crew. He is aware of the dangers of being gold-hungry, which is why he keeps this finding to himself. The captain is also observant, figuring out the ship had come from beyond the stars based on his charts. However, even though he is a lot more level-headed, the captain is also susceptible to the idea of becoming insanely rich off of the golden ship. He is not against taking the ship with them and even sleeps with the gold chunk underneath his bed. Midas is also not afraid to use brute force, considering how he killed Spinelli when the other man attacked. "
              }
            ]
          },
          {
            "question_text": "Describe the setting of this story.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "109",
                "uid": "a051ee2965f24618aeca6ed36ced6170",
                "response_text": "This story takes place in the Holcomb Foundation aboard Martian Maid. The Martian Maid is a grand ship that took off from Solis Lacus on its last flight; the ship spanned 200 feet in its length and despite its sleek exterior, was an armed ship as well. The Maid was on an orbit in a region strewn with asteroids between the outer systems and the EMV triangle. \n\nAboard the spaceship, interactions between the characters in the story largely took place in the Control room. It also takes place in Captain Midas’ quarters, where he investigates the mystery metal. The setting also changes to include the derelict ship the crewmates had found, which presented itself as a shell of a vessel with torn interiors and yellow-tinged walls. \n"
              },
              {
                "worker_id": "113",
                "uid": "5efb8eff09144be3ad6f0b87a152e70a",
                "response_text": "After the character’s inner monologue finishes, Midas starts talking about the day his team took off on the Martian Maid spaceship. He watched the lights of Canalopolis: gin mills and houses reflected on the ancient canal’s water, the bright moons cast their shadows across the banks. They were leaving the Earth-Mars-Venus Triangle and moving towards the outer systems, specifically the planet called Callisto. Midas spent most of his time in the Control room. He gathered the crew there to tell them about the derelict. At his quarters, Midas examined the metal samples sitting at his work-table. Days later, in the control room with a control panel, a radar finder, and a firing console, Midas killed Spinelli, who had attacked him. He then decided to find his team. He entered the living quarters of the prize crew. The walls were gleaming. Then, Midas swiftly reached the Maid and flew to Callisto. Now he’s in a hospital cot.\n\n"
              },
              {
                "worker_id": "112",
                "uid": "7f7901fd731c479aaff320e5a084c10a",
                "response_text": "The story happens on two spaceships. One is Martian Maid, which is a two hundred feet long spaceship. It is sleek, chemical-fueled, and spherical. It is equipped with weapons, such as turrets. There is a telescope, radar, and a book rack above the desk in the captain’s room. The other is the derelict. It is tremendously gigantic. It has a sleek torpedo shape with unknown alienness. Its flanks are constituted with glittering whorls. It is torn apart severely. There are a few storage compartments inside."
              },
              {
                "worker_id": "107",
                "uid": "8fafe67ddc6d4047877b2c2cd723631d",
                "response_text": "The story is primarily set in space. When the Martian Maid first takes off, it leaves from Solis Lacus after being taken out of the Foundation Yards. The ship is headed towards Callisto, where everybody will be receiving a fat paycheck. There is a Earth-Mars-Venus triangle that provides relative security for space travel. However, the outer systems are much more dangerous. The Captain also watches Canalopolis from a distance before he has to leave. The Maid has a scope position and living quarters for the crew. There is also an area called Control, where everybody is called to meet. The golden ship they find is made fully out of gold. The treasure ship has yellowish decks and an airlock compartment set aside for the crew. The entire ship gleams, but it is made out of devil metal. After the captain escapes to Callisto, he is subjected to a hospital cot for the rest of his life. "
              }
            ]
          },
          {
            "question_text": "Describe the relationship between Captain Midas and Mister Spinelli.",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "109",
                "uid": "a051ee2965f24618aeca6ed36ced6170",
                "response_text": "Mister Spinelli is Third Officer under the command of Captain Midas and was the first to report the derelict ship and observe its potential to be claimed by the Maid. Spinelli is the first and only crew member to identify the metal from the abandoned ship as gold when he saw Captain Midas with it. The tension between Midas and Spinelli escalates and their relationship becomes antagonistic as both of them desire to benefit the most from this valuable gold and with Midas constantly pulling his authority over Spinelli. After Midas barrs him from being a part of the investigative crew, suspicion arises between the two as Spinelli suspects Midas wishes to keep the pot of gold for himself and Midas thinks that Spinelli may be telling others. This tension further escalates as Midas sees Spinelli nearly hit the trigger of the gun and in rage, the two end up fighting each other before Midas aimed a kick at his temple and killed him. \n"
              },
              {
                "worker_id": "113",
                "uid": "5efb8eff09144be3ad6f0b87a152e70a",
                "response_text": "Captain Midas knows about Mister Spinelli’s hunger for money and gold. When the officer noticed the chunk of gold on Midas’ table, the captain started analyzing what the crewman could do. He refused to allow Spinelli to go aboard the derelict, and from this point, their relationship became tense. The crewman suspected the captain of an intention to take all the gold. Midas saw that Spinelli told Zaleski about gold and sent several other crew members to the derelict with Zaleski and Cohn to avoid double-crossing or mutiny. When they left, he realized that Spinelli aimed the Maid’s firing projector at the derelict and the crew members there in case they decided to betray Spinelli. Midas got angry but decided to leave this way. When their colleagues sent a message about the lost control and then stopped answering, Spinelli became mad. Midas attempted to keep Spinelli in control, but the man was already approaching the firing panel. Spinelli got an order to leave the control room, but he exploded and attacked his superior. In an aggressive fight, Midas killed his team member. "
              },
              {
                "worker_id": "112",
                "uid": "7f7901fd731c479aaff320e5a084c10a",
                "response_text": "The relationship between Captain Midas and Mister Spinelli changes from supportive to hostile throughout the story. When Mister Spinelli finds the massive derelict in the space, he reports back to Captain Midas. He actively suggests searching over the hulk, where his relationship with Captain Midas is superior-subordinate and obeying. However, when Captain Midas finds out that the mysterious metal sought from the derelict can somehow turn into gold, which Mister Spinelli witnesses, their greed sprouts the tension and suspicion between them as they start to suspect each other of trying to have the gold by themselves. The first tension arises when Captain Midas does not allow Mister Spinelli to move the hulk. In addition, Mister Spinelli disobeys Captain Midas’s order not to tell other crew members about the metal. The second tension arises when Mister Spinelli uses the weapon on the spaceship pointing toward the derelict to ensure no one can steal his share of the metal. Captain Midas is raged about his action at first, but he accepts that. The last tension arises when they lose the signal from other crew members, causing them to suspect the betrayal of other members. From then on, Mister Spinelli attacks Captain Midas, and they fight until Captain Midas kills Mister Spinelli. Until this point, their relationship is hostile and competitive in the sense of the ownership of the metal."
              },
              {
                "worker_id": "107",
                "uid": "8fafe67ddc6d4047877b2c2cd723631d",
                "response_text": "Captain Midas and Mister Spinelli initially get along fine. Spinelli listens to all of his orders, and the Captain considers him to be a reliable member of the crew. There is no sense of hostility between them, and he even agrees with Spinelli’s proposal to look the ship over. However, this relationship later sours once Spinelli finds out that the discovered ship is made out of gold. The captain is wary because Spinelli is big and dangerous, preferring to keep an eye on him in case anything goes wrong. Spinelli, on the other hand, is suspicious of the captain and goes off to tell Zaleski even though the captain said to not mention the gold to any of the rest of the crew. The captain threatens to clap Spinelli to irons, but this threat does not work because the Third Officer chooses to disobey his orders anyways. Later, Spinelli and the captain get into conflict again, with Spinelli accusing the captain that he was planning to keep all of the treasure for himself. Spinelli assumes that everybody is faking it to keep the ship, but the captain knocks him away. The two of them fight brutally, and Captain Midas has to end up killing Spinelli. "
              }
            ]
          },
          {
            "question_text": "What is the significance of the mystery metal from the starship?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "109",
                "uid": "a051ee2965f24618aeca6ed36ced6170",
                "response_text": "The mystery metal is significant because it initially attracted the crew’s interest due to their greed - they had hoped to tear about the derelict starship and sell its pieces for millions. When the Captain tested out the mysterious metal and saw that it turned out to be gold, his greed increased so much that he became suspicious of his crew members that were sent out to investigate the ship. \n\nAlthough the Captain and his crew thought they could take advantage of this metal and benefit from it, it turns out that the opposite is true. Instead, it is this mystery metal that gains its yellow-tint and subsequent gold composition through drawing its energy from them and draining the crew of their youth and strength. The latter named ‘devil-metal’ demonstrates the hastiness of the greed of man, and how it led them to be so enraptured in greed that it blinded them of the wariness of strange objects in space, and hence led to their ultimate demise. \n"
              },
              {
                "worker_id": "113",
                "uid": "5efb8eff09144be3ad6f0b87a152e70a",
                "response_text": "All the spacemen in this story are greedy and materialistic. When the Maid’s crew finds the derelict, they think of selling its parts. This thought cheers them up. Then Midas finds out the starship’s metal can turn into gold, and Spinelli learns that, too. Eventually, this chunk of gold makes Midas’ hands slowly decay while he sleeps with it every night. Spinelli becomes more and more suspicious and suspects everyone to be a traitor. Eventually, Midas realizes the starship’s metal has some evil in it. When he finds his team almost dead and still trying to climb the golden walls of the room, he understands that the metal takes the energy required for its stability from humans. This gold quite literally kills. Greed ends the lives of almost all crewmates of the Maid and leaves Midas to slowly die in a hospital cot, regretting his lethal hunger for money."
              },
              {
                "worker_id": "112",
                "uid": "7f7901fd731c479aaff320e5a084c10a",
                "response_text": "The mystery metal from the derelict can draw energy from life and turn itself into gold through the transmutation of the energy. In the story, the crews on Maid, a spaceship, find a large derelict constituted of this mysterious metal and bring it with them. Soon after they find out its property of becoming gold, they start to fight with each other and caress the metal unstoppably, but they do not know where the energy that makes the metal change comes from. After the captain kills one crewmember, finding the lost signals and weirdness of his hand and the metal, he realizes the metal draws the needed energy from humans. The mysterious metal plays a significant role in that it triggers the greed of the crewmembers to cause them to fight, symbolizing the cursed treasure. It is also the leading cause that most crew members die or mutate, except for the captain, showing that any treasure comes with a cost, in which case, the mysterious metal is the treasure, and the life is the cost."
              },
              {
                "worker_id": "107",
                "uid": "8fafe67ddc6d4047877b2c2cd723631d",
                "response_text": "The mystery metal, later revealed to be ‘gold’, is significant because it is what drives the crew to want to become rich and leads to their downfall. When the captain first discovers it is gold, he thinks about how wealthy the entire crew will become once they reach Callisto and sell it off. The mystery metal is worth a lot of money, and it is what makes them decide to take the entire ship with them. However, this metal is also deadly because it sucks the energy from the crew. Out of their greed, they fail to realize that the gold drains their lifespan away to continue functioning. The crew has to pay the ultimate price with their lives, and only Captain Midas survives the incident. Even as they are old and skeletal, the rest of the crew do not want to give up the possibility of gold. When the captain goes to Callisto, everybody scorns him and laughs at him despite how terrible his story is about the gold. "
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5325,
        "document_length_chars": 29576
      }
    }
  ]
}