{
  "item_metadata": {
    "item_id": "63860",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63860",
      "content": "SIGNAL RED\n \n\n By HENRY GUTH\n \n \n They tried to stop him. Earth Flight 21 was a suicide run, a coffin ship, they told him. Uranian death lay athwart the space lanes. But Shano already knew this was his last ride.\n \n [Transcriber's Note: This etext was produced from Planet Stories Fall 1949. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Mercurian night settled black and thick over the Q City Spaceport. Tentative fingers of light flicked and probed the sky, and winked out.\n \n \"Here she comes,\" somebody in the line ahead said.\n \n Shano coughed, his whole skeletal body jerking. Arthritic joints sent flashes of pain along his limbs. Here she comes, he thought, feeling neither glad nor sad.\n \n He coughed and slipped polarized goggles over his eyes.\n \n The spaceport emerged bathed in infra red. Hangars, cradles, freighter catapults and long runways stood out in sharp, diamond-clear detail. High up, beyond the cone of illumination, a detached triple row of bright specks—portholes of the liner Stardust —sank slowly down.\n \n There was no eagerness in him. Only a tiredness. A relief. Relief from a lifetime of beating around the planets. A life of digging, lifting, lugging and pounding. Like a work-worn Martian camel, he was going home to die.\n \n As though on oiled pistons the ship sank into the light, its long shark-like hull glowing soft and silvery, and settled with a feathery snuggle into the cradle's ribs.\n \n The passenger line quivered as a loud-speaker boomed:\n \n \" Stardust, now arrived at Cradle Six! Stardust, Cradle Six! All passengers for Venus and Earth prepare to board in ten minutes. \"\n \n Shano coughed, and wiped phlegm from his thin lips, his hand following around the bony contours of his face, feeling the hollows and the beard stubble and loose skin of his neck. He coughed and thought of the vanium mines of Pluto, and his gum-clogged lungs. A vague, pressing desire for home overwhelmed him. It had been so long.\n \n \" Attention! Attention, Stardust passengers! The signal is red. The signal is red. Refunds now being made. Refunds now. Take-off in five minutes. \"\n \n The man ahead swore and flicked up an arm. \"Red,\" he groaned. \"By the infinite galaxies, this is the last straw!\" He charged away, knocking Shano aside as he passed.\n  Red signal. In bewildered anxiety Shano lifted the goggles from his eyes and stared into the sudden blackness. The red signal. Danger out there. Passengers advised to ground themselves, or travel at their own risk.\n \n He felt the passengers bump and fumble past him, grumbling vexatiously.\n \n A hot dread assailed him, and he coughed, plucking at his chest. Plucking at an urgency there.\n \n Dropping the goggles to his rheumy eyes, he saw that the passenger line had dissolved. He moved, shuffling, to the gate, thrust his ticket into the scanner slot, and pushed through the turnstile when it clicked.\n \n \" Flight twenty-one, now arriving from Venus ,\" the loud-speaker said monotonously. Shano glanced briefly upward and saw the gleaming belly of twenty-one sinking into the spaceport cone of light.\n \n He clawed his way up the gangway and thrust out his ticket to the lieutenant standing alone at the air lock. The lieutenant, a sullen, chunky man with a queer nick in his jawbone, refused the ticket.\n\"Haven't you heard, mister? Red signal. Go on back.\"\n \n Shano coughed, and peered through the lenses of his goggles. \"Please,\" he said. \"Want to go home. I've a right.\" The nicked jaw stirred faint memories within his glazed mind.\n \n The lieutenant punched his ticket. \"It's your funeral, old man.\"\n \n The loud-speaker blared. \" Stardust, taking off in thirty seconds. The signal is red. Stardust, taking— \"\n \n With the words dinning in his ears, Shano stepped into the air lock. The officer followed, spun wheels, and the lock closed. The outside was shut off.\n \n Lifting goggles they entered the hull, through a series of two more locks, closing each behind them.\n \n \"We're afloat,\" the officer said. \"We've taken off.\" A fleck of light danced far back in his eye. Shano felt the pressure of acceleration gradually increasing, increasing, and hurried in.\n \n \n\n \n Captain Menthlo, a silver-mustached Jupiterian, broad, huge, yet crushable as a beetle, talked while his hands manipulated a panel of studs in the control room. The pilot, his back encased in leather, sat in a bucket seat before him, listening into earphones.\n \n \"Surprised to learn of a passenger aboard,\" the captain said, glancing briefly sideways. \"You're entitled to know of the danger ahead.\" He flicked a final stud, spoke to the pilot and at last turned a serious, squared face to Shano. \"Old man,\" he said. \"There's a Uranian fleet out there. We don't know how many ships in this sector. Flight twenty-one, which just landed, had a skirmish with one, and got away. We may not be so lucky. You know how these Uranian devils are.\"\n \n Shano coughed, and wiped his mouth. \"Dirty devils,\" he said. \"I was driv' off the planet once, before this war started. I know things about them Uranian devils. Heard them in the mines around. Hears things, a laborer does.\"\n \n The captain seemed for the first time to realize the social status of his lone passenger, and he became a little gruff.\n \n \"Want you to sign this waiver, saying you're traveling at your own risk. We'll expect you to keep to your cabin as much as possible. When the trouble comes we can't bother with a passenger. In a few hours we'll shut down the ship entirely, and every mechanical device aboard, to try to avoid detection.\" His mustaches rose like two spears from each side of his squared nose as his face changed to an alert watchfulness. \"Going home, eh?\" he said. \"You've knocked around some, by the looks of you. Pluto, from the sound of that cough.\"\n \n Shano scrawled his signature on the waiver. \"Yeah,\" he said. \"Pluto. Where a man's lungs fights gas.\" He blinked watery eyes. \"Captain, what's a notched jaw mean to you?\"\n \n \"Well, old man,\" the captain grasped Shano's shoulder and turned him around. \"It means somebody cut himself, shaving. You stick tight to your cabin.\" He nodded curtly and indicated the door.\n \n Descending the companionway to the next deck Shano observed the nick-jawed lieutenant staring out the viewport, apparently idling. The man turned and gripped Shano's thin arm.\n \n \"A light?\" he said, tapping a cigarette. Shano produced a lighter disk and the chunky man puffed. He was an Earthman and his jaw seemed cut with a knife, notched like a piece of wood. Across the breast of his tunic was a purple band, with the name Rourke . \"Why are you so anxious to get aboard, old man?\" He searched Shano's face. \"There's trouble ahead, you know.\"\n \n Shano coughed, wracking his body, as forgotten memories stirred sluggishly in his mind. \"Yup,\" he said, and jerked free and stumbled down the steel deck.\n \n In his cabin he lay on the bunk, lighted a cigarette and smoked, coughing and staring at the rivet-studded bulkhead. The slow movement of his mind resolved into a struggle, one idea groping for the other.\n \n What were the things he'd heard about nicked jaws? And where had he heard them? Digging ore on Pluto; talk in the pits? Secretive suspicions voiced in smoke-laden saloons of Mars? In the labor gangs of Uranus? Where? Shano smoked and didn't know. But he knew there was a rumor, and that it was the talk of ignorant men. The captain had evaded it. Shano smoked and coughed and stared at the steel bulkhead and waited.\n \n \n\n \n The ship's alarm clanged. Shano jerked from his bunk like a broken watch spring. He crouched, trembling, on arthritic joints, as a loud-speaker blared throughout the ship.\n \n \" All hands! We now maintain dead silence. Close down and stop all machinery. Power off and lights out. An enemy fleet is out there, listening and watching for mechanical and electronic disturbance. Atmosphere will be maintained from emergency oxygen cylinders. Stop pumps. \"\n \n Shano crouched and listened as the ship's steady drone ceased and the vibrations ceased. The pumps stopped, the lights went out.\n \n Pressing the cold steel bulkhead, Shano heard oxygen hiss through the pipes. Hiss and hiss and then flow soundlessly, filling the cabin and his lungs. He choked.\n \n The cabin was like a mine shaft, dark and cold. Feet pounded on the deck outside.\n \n Shano clawed open the door. He peered out anxiously.\n \n Cold blobs of light, phosphorescent bulbs held in the fists of men, glimmered by. Phosphorescent bulbs, because the power was off. Shano blinked. He saw officers and men, their faces tight and pinched, hurrying in all directions. Hurrying to shut down the ship.\n \n He acted impulsively. A young ensign strode by, drawn blaster in hand. Shano followed him; followed the bluish glow of his bulb, through labyrinthine passages and down a companionway, coughing and leering against the pain in his joints. The blue light winked out in the distance and Shano stopped.\n \n He was suddenly alarmed. The captain had warned him to stay in his cabin. He looked back and forth, wondering how to return.\n \n A bell clanged.\n \n Shano saw a cold bulb glowing down the passageway, and he shuffled hopefully toward it. The bulb moved away. He saw an indistinct figure disappear through a door marked, ENGINE ROOM.\n \n Shano paused uncertainly at the end of the passageway. A thick cluster of vertical pipes filled the corner. He peered at the pipes and saw a gray box snuggled behind them. It had two toggle switches and a radium dial that quivered delicately.\n \n Shano scratched his scalp as boots pounded on the decks, above and below. He listened attentively to the ship's familiar noises diminishing one by one. And finally even the pounding of feet died out; everything became still. The silence shrieked in his ears.\n \n \n\n \n The ship coasted. Shano could sense it coasting. He couldn't feel it or hear it, but he knew it was sliding ghost-like through space like a submarine dead under water, slipping quietly past a listening enemy.\n \n The ship's speaker rasped softly. \" Emergency. Battle posts. \"\n \n The captain's voice. Calm, brief. It sent a tremor through Shano's body. He heard a quick scuffle of feet again, running feet, directly overhead, and the captain's voice, more urgently, \"Power on. They've heard us.\"\n \n The words carried no accusation, but Shano realized what they meant. A slip-up. Something left running. Vibrations picked up quickly by detectors of the Uranian space fleet.\n \n Shano coughed and heard the ship come to life around him. He pulled himself out of the spasm, cursing Pluto. Cursing his diseased, gum-clogged lungs. Cursing the Uranian fleet that was trying to prevent his going home—even to die.\n \n This was a strange battle. Strange indeed. It was mostly silence.\n \n Occasionally, as though from another world, came a brief, curt order.\n\"Port guns alert.\" Then hush and tension.\n \n The deck lurched and the ship swung this way and that. Maybe dodging, maybe maneuvering—Shano didn't know. He felt the deck lurch, that was all.\n \n \"Fire number seven.\"\n \n He heard the weird scream of a ray gun, and felt the constricting terror that seemed to belt the ship like an iron band.\n \n This was a battle in space, and out there were Uranian cruisers trying to blast the Stardust out of the sky. Trying and trying, while the captain dodged and fired back—pitted his skill and knowledge against an enemy Shano couldn't see.\n \n He wanted desperately to help the captain break through, and get to Earth. But he could only cling to the plastic pipes and cough.\n \n The ship jounced and slid beneath his feet, and was filled with sound. It rocked and rolled. Shano caromed off the bulkhead.\n \n \"Hold fire.\"\n \n He crawled to his knees on the slippery deck, grabbed the pipes and pulled himself erect, hand over hand. His eyes came level with the gray metal box behind the pipes. He squinted, fascinated, at the quivering dial needle. \"Hey!\" he said.\n \n \"Stand by.\"\n \n Shano puzzled it out, his mind groping. He wasn't used to thinking. Only working with his hands.\n \n This box. This needle that had quivered when the ship was closed down....\n \n \"It's over. Chased them off. Ready guns before laying to. Third watch on duty.\"\n \n Shano sighed at the sudden release of tension throughout the space liner Stardust .\n \n Smoke spewed from his nostrils. His forehead wrinkled with concentration. Those rumors: \"Man sells out to Uranus, gets a nick cut in his jaw. Ever see a man with a nick in his jaw? Watch him, he's up to something.\" The talk of ignorant men. Shano remembered.\n \n He poked behind the pipes and angrily slapped the toggle switches on the box. The captain would only scoff. He'd never believe there was a traitor aboard who had planted an electronic signal box, giving away the ship's position. He'd never believe the babblings of an old man.\n \n He straightened up, glaring angrily. He knew. And the knowledge made him cold and furious. He watched the engine room emergency exit as it opened cautiously.\n \n A chunky man backed out, holstering a flat blaster. He turned and saw Shano, standing smoking. He walked over and nudged Shano, his face dark. Shano blew smoke into the dark face.\n \n \"Old man,\" said Rourke. \"What're you doing down here?\"\n \n Shano blinked.\n \n Rourke fingered the nick in his jaw, eyes glinting. \"You're supposed to be in your cabin,\" he said. \"Didn't I warn you we'd run into trouble?\"\n \n Shano smoked and contemplated the chunky man. Estimated his strength and youth and felt the anger and frustration mount in him. \"Devil,\" he said.\n \n \n \"Devil,\" he said and dug his cigarette into the other's face.\n \n\n \n He lunged then, clawing. He dug the cigarette into Rourke's flushed face, and clung to his body. Rourke howled. He fell backward to the deck, slapping at his blistered face. He thrashed around and Shano clung to him, battered, pressing the cigarette relentlessly, coughing, cursing the pain in his joints.\n \n Shano grasped Rourke's neck with his hands. He twisted the neck with his gnarled hands. Strong hands that had worked.\n \n He got up when Rourke stopped thrashing. The face was purple and he was dead. Shano shivered. He crouched in the passageway shivering and coughing.\n \n \n\n \n A tremendous grinding sounded amid-ships. Loud rending noises of protesting metal. The ship bucked like a hooked fish. Then it was still. An empty clank echoed through the hull. The captain's voice came, almost yelling. \"Emergency! Emergency! Back to your posts. Engine room—report! Engine room—\"\n \n Shano picked himself off the deck, his mind muddled. He coughed and put a cigarette to his lips, flicking a lighter disk jerkily from his pocket. He blew smoke from his nostrils and heard the renewed pounding of feet. What was going on now?\n \n \"Engine room! Your screen is dead! Switch onto loud-speaker system. Engine room!\"\n \n Giddily, Shano heard clicks and rasps and then a thick voice, atom motors whirring in the background.\n \n \"Selector's gone, sir. Direct hit. Heat ray through the deck plates. We've sealed the tear. Might repair selector in five hours.\"\n \n Shano coughed and sent a burst of smoke from his mouth.\n \n \"Captain!\" A rasping, grating sound ensued from a grill above Shano's head, then a disconnected voice. \"Get the men out of there. It's useless. Hurry it up!\" A series of clicks and the heavy voice of the chief engineer. \"Captain! Somebody's smashed the selector chamber. Engine room's full of toxia gas!\"\n \n Shano jumped. He prodded the body on the deck with his toe.\n \n The Stardust's mechanical voice bellowed: \"Engine room!\" It reproduced the captain's heavy breathing and his tired voice. \"We're about midway to Venus,\" it said. \"There were two ships and we drove them off. But there may be others. They'll be coming back. They know we've been hit. We have to get away fast!\"\n \n Shano could see the captain in his mind, worried, squared face slick with moisture. Shouting into a control room mike. Trying to find out what the matter was with his space ship.\n \n The engineer's answer came from the grill. \"Impossible, sir. Engine room full of toxia gas. Not a suit aboard prepared to withstand it. And we have to keep it in there. Selector filaments won't function without the gas. Our only chance was to put a man in the engine room to repair the broken selector valve rods or keep them running by hand.\"\n \n \"Blast it!\" roared the captain. \"No way of getting in there? Can't you by-pass the selector?\"\n \n \"No. It's the heart of the new cosmic drive, sir. The fuels must pass through selector valves before entering the tube chambers. Filaments will operate so long as toxia gas is there to burn, and will keep trying to open the valves and compensate for fluctuating engine temperature. But the rod pins have melted down, sir—they're common tungsten steel—and when the rods pull a valve open, they slip off and drop down, useless. It's a mess. If we could only get a man in there he might lift up the dropped end of a rod and slip it into place each time it fell, and keep the valves working and feeding fuel.\"\n \n The speaker spluttered and Shano smoked thoughtfully, listening to the talk back and forth, between the captain and the engineer. He didn't understand it, but knew that everything was ended. They were broken down in space and would never make Earth. Those Uranian devils would come streaking back. Catch them floating, helpless, and blast them to bits. And he would never get home to die.\n \n Shano coughed, and cursed his lungs. Time was when these gum-clogged lungs had saved his life. In the Plutonian mines. Gas explosions in the tunnels. Toxia gas, seeping in, burning the men's insides. But with gum-clogged lungs he'd been able to work himself clear. Just getting sick where other men had died, their insides burned out.\n \n Shano smoked and thought.\n \n \n\n \n They wouldn't even know, he told himself, squirming through the emergency exit into the engine room, and sealing it after him. And they wouldn't understand if they did. Pink mist swirled about him. Toxia gas. Shano coughed.\n \n He squinted around at the massive, incomprehensible machinery. The guts of the space ship.\n \n Then he saw the shattered, gold-gleaming cylinder, gas hissing from a fine nozzle, and filaments glowing bluish inside it, still working away. He saw five heavy Carrsteel rods hanging useless, on melted-down pins, and the slots their pronged ends hooked into. He looked at his hands, and shook his head.\n \n \"One try,\" he said to himself. \"One try, Shano. One important thing in your life. Here's your opportunity. The toxia gas will get you. It'll kill you at this concentration. But you'll last for maybe twelve hours. Another man wouldn't last a minute. Another man's lungs aren't clogged with Juno gum.\"\n \n He grasped a rod and lifted it, sweating under the weight, and slipped the forked end into its slot. Going home to die, he thought. Well, maybe not going home. Couldn't remember what Earth looked like anyway.\n \n What was that again? Oh yeah—just lift them up, and when they drop off, lift them up again.\n \n Shano coughed, and lifted the heavy rods into position. One jerked back suddenly and smoothly, and something went, \"Pop, pop,\" behind him and machinery whirred. He lifted the rod and slipped it back on. Another jerked, pulled open a large valve, and dropped off. Shano bent, and lifted, coughing and coughing. He forgot what he was doing, mind blank the way it went when he worked. Just rhythmically fell into the job, the way a laborer does. He waited for a rod to slip and fall, then lifted it up and slipped it in place, skin sweating, joints shooting pain along his limbs. He heard the machinery working. He heard the high, howling whine of cosmic jets. He, Shano, was making the machinery go. He was running the cosmic drive.\n \n A bell clanged somewhere. \"Engine room! Engine room! We're under way! What happened?\"\n \n Silence, while Shano coughed and made the machinery go, thinking about the Earth he hadn't seen for many years.\n \n \"Captain!\" the speaker bawled. \"There's a man in there! Working the valve rods! Somebody is in the engine room and the gas isn't....\"\n \n Shano grinned, feeling good. Feeling happy. Lifting the heavy steel rods, driving the ship. Keeping the jets screaming and hurtling the liner Stardust toward Venus. He wondered if they'd found Rourke yet. If he could keep going for twelve hours they would get to Venus. After that....\n \n \"Home,\" he coughed. \"Hell! Who wants to go home?\"\n \n He plucked at his agitated chest, thinking of a whole damn Uranian fleet swooping down on a spot in space, expecting to find a crippled ship there with a spy inside it. And finding nothing. Because of Shano. A useless old man.\n \n Coughing came out all mixed up with laughing.",
      "metadata": {
        "title": "Signal Red",
        "author": "Henry Guth",
        "passage_id": "63860",
        "uid": "df1f7d0158fe44089d45db1b0fda9ccb",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "107",
                "uid": "48897558f4ca46c09041d3ca9f306a4b",
                "response_text": "Shano is a sickly old man in line to board the space liner Stardust to go home. There is a red signal announcement for the liner, and guests are given an option to receive a refund. Many guests leave after hearing the danger signal, but Shano sticks his ticket into the scanner and moves to get on the liner. Shano chooses to step in anyways despite the dangers, and the Stardust takes off into space again. Captain Menthlo informs him of the Uranian enemy fleets and the high possibility of running into danger with one of them. When the captain realizes Shano's role as a laborer, he makes him sign a waiver because of the possible danger his life will be when they shut off the ship and mechanical device to avoid the enemies. Once he exits to the next deck, he sees the same lieutenant from earlier speak to him again. The lieutenant's name is  Rourke, and he asks why Shano is so anxious to board the ship. Later, as Shano smokes in his cabin, he tries to remember the specific saying for people with nicked jaws. Later, the ship announces that it will now maintain dead silence mode to avoid the Uranian fleets. Shano leaves his room to follow one of the young ensign, who walks by with a blaster. He then realizes that he cannot go back to his room. However, he sees an indistinguishable figure enter the engine room and notices a grey box with switches. Not soon after, the ship enters an offensive attack mode because the Uranian fleets have noticed them. Shano suddenly remembers the rumors to watch out for a man with a nicked jaw because he sells out information to Uranus. He knows that nobody will believe him about a traitor on the ship, so he faces Rourke himself. Shano digs his cigarette into the other man's body and clings to his body. He then twists Rourke's neck with his hands and kills the traitor. The frantic yelling of the other members catches his attention again, and the Stardust informs everybody on board that the ship is midway to Venus. However, there is toxic gas in the engine room now, and nobody on board can withstand the fumes to fix the engines. Although Shano continues to smoke, he does go into the engine room through the emergency exit to fix the space liner. The other crew on the ship are confused by how the liner continues to fly towards Venus. They realize that Shano is working the valve rods in the engine room. Shano thinks about how the Uranian fleet will come into the area and expect to find the Starliner but only find nothing. The fact that this escape is because of him makes him laugh and cough more. "
              },
              {
                "worker_id": "105",
                "uid": "333f624907c64f62b8f5382ef3b45ce7",
                "response_text": "Shano awaits with confusing feelings for a spaceship to land in the spaceport and to take him home. Red signal is announced - the travel is dangerous and at one's own risk. The line dissolves and people rush for refunds, Shano decides to travel home anyway. On board the captain explains that a Uranian fleet is on their way and guesses Shano is from Pluto. Soon, there is an order to keep silent on the ship. Alarmed Shano exits the cabin and sneaks around the ship, then there is a short silence followed by emergency. Short orders and a state of anxiety last and then a sudden relief comes - the fight is over. Shano sees Rourke exiting the emergency room and remembers a nick on the jaw to be a sight of trade with Uranus. He starts a fight and chokes the traitor. The selector is gone, there is gas in the engine room and no one can enter to fix the selector. Shano decides to go in as his lungs are damaged by gas already and he will be able to last longer. He works in the engine room and gets the ship going, hoping to reach Earth and die then proving himself useful. "
              },
              {
                "worker_id": "103",
                "uid": "77b24cd66abb48c4a8c38688697197af",
                "response_text": "The main character, Shano, is currently on Q City Spaceport, waiting to board his spaceship that would take him home to die. Shano has gum-clogged lungs, and it was quite an advantage to him when working inside the mines. However, before he could board the ship, an announcement is made about the signal turning red, signifying that there is danger out there, and passengers could travel at their own risk. Shano, desired to go home, decides to take this risk. \n\nHe is the only passenger aboard along with the crew members. The captain of the ship, Menthlo, told him that there is a Uranian fleet on their way. He warns Shano that they will turn the ship off later to avoid detection, and tells him to stay in his cabin. After he sees the kicked jaw of Rourke, the lieutenant of the ship, he heads towards his cabin, where he lays and thinks about the rumors he has heard about nicked jaws. Then captain’s voice comes through the speaker, telling everyone to shut down all machineries and maintain dead silence because the Uranians are listening for mechanical and electronic disturbance. Feeling anxious in his cabin, Shano follows a young man down to the Engine Room. Pausing after seeing a specious figure going into the room, he sees a gray box. Even though everything becomes silent, they are detected by the Uranians. The battle begins. He once again notices the gray box and that the needle inside did not stop, thus he assumes that someone planted it there to make sure the Uranians discover them – a man sold them out. He immediately assumes that it is the nicked jaw man, he is up to something. Then, after spotting the nicked jaw man suspiciously leaving the emergency door, Rourke, Shano digs the cigarette into his face, and grasps his neck until he stops breathing and drops dead. Then he learns from the captain that a selector has been smashed, and in order to fix it, one has to enter the Engine Room which is filled with toxia gas. He knows that his gum-clogged lungs is able to slow down he consumption of the toxia gas in comparison to other people who breaths the gas. Thus, he enters the Engine Room, and starts to work on the selector. Leaving the captain and the crew in shock, they are finally on their way again. "
              },
              {
                "worker_id": "106",
                "uid": "7cac6e997c6c441fb7f7e60cbcfdbb71",
                "response_text": "Shano is a retired labourer on Mercury, getting ready to make the journey Home to Earth. As he gets to the spaceport, all the passengers of the spaceship \"Stardust\" are informed that there is a \"red signal\" and passengers are not advised to fly. Shano is old and tired, and just wants to get home so he can die, so he decides to board regardless. He boards the ship with a lieutenant with the notch on his jaw named Rourke, onboard he meets the captain, who advises him to stay in his cabin. The captain informs him that there is a hostile Uranian fleet waiting for them on their path, and they will have to turn all power off during the journey. Shano is intrigued by Rourke and the notch on his jaw, thinking it reminded him of something he had heard once. Shano's lungs are very weak from working on the pluto for so long. Shano goes to his cabin, and the ship goes dark. He opens his doors and walks down the corridor. He sees a figure disappear into the engine room. Suddenly, the captain's voice rings through the intercom. The ship has been spotted by the Uranians, a battle ensues. The crew of the Stardust win this round. Shano notices an electric signal box, which tells of the ships position. He realises something. He remembers what he had heard about the man with the notch on his jaw sold the crew out to Uranus. It was Rourke. Rourke arrives, and Shano attacks him, swiftly killing him. The captain's voice flashes once again that there is an emergency in the engine room. The ship has been hit and everything is dead. Someone has broken through the engine room and it has filled with toxic gas. More Uranian ships are coming, and there's no way to repair the tear in the engine room without being poisoned by the gas. They are stranded. Shano knows that unlike the other men onboard, he can withstand the effects of the gas for a dozen hours, whereas the rest would be dead in a minute. He decides to repair the ship and goes to work in the engine room. He may not die on Earth, but he will save everyone else on board, who will now make it to Venus because of him. "
              }
            ]
          },
          {
            "question_text": "Who is Rourke, and what are his traits in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "107",
                "uid": "48897558f4ca46c09041d3ca9f306a4b",
                "response_text": "Rourke is the lieutenant with the nicked jaw who Shano first meets at the air lock. He initially refuses the ticket and reminds Shano that there is a Red signal placed on the Stardust. He tells Shano that the latter is heading towards his funeral but still ends up punching his ticket. Rourke is indirectly mentioned when Shano asks the captain about nicked jaws, a question to which the captain responds that it happens when somebody has cut himself shaving. Rourke is later revealed to be a traitor loyal to the Uranians and attempts to sabotage the ship so that the Uranian fleet can force the Stardust to surrender. He is a manipulative individual, capable of convincing most crew members that he is innocent and means no harm. He also pretends to act surprised that Shano is on board, knowing that he will betray them to the Uranians. Rourke is also a very sneaky person. When the ship turns off all mechanics to avoid detection, he uses the opportunity to sneak into the engine room and mess up the ship’s controls. He can remain mostly undetected, only seen by Shano as he hurries into the room. "
              },
              {
                "worker_id": "105",
                "uid": "333f624907c64f62b8f5382ef3b45ce7",
                "response_text": "Rourke is a lieutenant on the ship who has a nick on his jaw. This is believed to be a feature of those who sell out to Uranus. Rourke is a traitor, he planted an electronic signal box to give away the ship's position and provoke the Uranian attack.He didn't want Shano to get on board and warned him. Rourke is a chunky man with a blaster. He is young, strong and angry at Shano for getting involved. Rourke dies as a consequence of a fight with Shano who considers him a traitor. "
              },
              {
                "worker_id": "103",
                "uid": "77b24cd66abb48c4a8c38688697197af",
                "response_text": "Rourke is the lieutenant of the ship, who is a nick-jawed Earthman. Rourke first refuses the ticket, stating that it is signal red. After having faint memories within his mind, he takes Shano’s ticket mentioning that it is his funeral. He is staring out to the viewport when Shano spots him later, Shano thinks that he is just idling. Later, he is suspiciously using the Engine Room emergency exit when Shano spots him again. He is chunky and holsters a flat blaster. He has weaker hands than Shano. And is killed by Shano. "
              },
              {
                "worker_id": "106",
                "uid": "7cac6e997c6c441fb7f7e60cbcfdbb71",
                "response_text": "Rourke is the lieutenant of the starship ``Stardust\" who sells out the ship to the Uranians. He is clearly a very crooked character from this one act alone, taking personal gain over the lives of his crew. He is described as \"sullen\" and \"chunky\". His one redeeming quality that could be found would be in when he tried to convince Shano not to board that ship, thus he would have saved his life. He calls Shano an old man, clearly giving off a rude and unpleasant demeanor. He is a shifty, complicated character, because while he sold the ship out to the Uranians, and is not very polite, he did look out for Shano. \n"
              }
            ]
          },
          {
            "question_text": "What do Shano’s occupation and actions thoughts the story reveal about his traits?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "107",
                "uid": "48897558f4ca46c09041d3ca9f306a4b",
                "response_text": "Shano’s occupation is being a miner and laborer. His time mining on Pluto leaves his lungs permanently damaged, and he has a constant cough that never seems to go away. However, he has been to many other planets as well, including Mars and Uranus. Although Shano is only a lowly miner, his actions also reveal how courageous and righteous he is as a person. His decision to take the liner, despite the red signal, shows that he is willing to take risks to reach his goal. Later, when he remembers why Rourke cannot be trusted, he does not hesitate to take matters into his own hands to deal with the traitor. Shano’s bravery is also shown when he braves the toxic gas to save the liner. He knows that he can last for up to 12 hours at most and that he will most likely die on the trip home. However, this does not deter him if he can get the ship safely to Venus. While Shano’s occupation in the story is not regarded highly, his actions show that he should not be underestimated. "
              },
              {
                "worker_id": "105",
                "uid": "333f624907c64f62b8f5382ef3b45ce7",
                "response_text": "Shano is tired of his life and wants to rest. He goes back home with the thought of dying there. For this reason he puts himself in danger by taking this flight with a red signal - he doesn't have what to live for, only for coming home to die. He is also brave and noble as he saves the whole crew by going to the engine room. He is full of initiative, he can't sit still in the cabin. His mind is not used to thinking, he is a worker but he understands he is the only one who can last in the toxic gas and he understands who the traitor is. His desire to get home alive or dead moves him forward and makes him brave as it is the only sense in his life. He is happy to be of use at least as he feels old and feeble from time to time as he has worked with gas and his lungs are damaged.\n"
              },
              {
                "worker_id": "103",
                "uid": "77b24cd66abb48c4a8c38688697197af",
                "response_text": "Shano is very weak, when he coughs his whole body jerk. He also has arthritic joints pain along his limbs. He was digging, lifting, lugging and pounding around the planet for his whole life. He states that he is a laborer. He has worked in the Plutonian mines, where other men died from the toxia gas, he simply got sick because of the gum-clogged lungs. \n\nHe acts impulsively. He has heard rumors about nicked jaws, which lead him to murder Rourke. He does not really feel happy or sad when thinking of going home, but he is determined to go home to die. However, he changes his mind when he heard about the toxia gas in the engine room. When the red signal appears, he still decides to aboard the ship. He knows that he is not used to thinking, but doing works by his hands. Shano knows that he is helping the ship by entering the Engine Room, thus he feels happy. He calls himself useless, but being able to accomplish something as important as killing a spy and driving the ship, he feels good. This is more important than dying at home. "
              },
              {
                "worker_id": "106",
                "uid": "7cac6e997c6c441fb7f7e60cbcfdbb71",
                "response_text": "Shano is an ex-labourer, working on different planets as he went. He has spent his life \"digging, lifting, lugging and pounding\". He is tired and hates the idea of spending another minute on Mercury. He is frustrated with his position in life, having a bit of a chip on his shoulder, immediately noticing the change in treatment the captain shows him once he realises his occupation. A lifetime of working on his feet has left his body aching, and all he wants to do is get home to die. It seems he has given up in life. He believes that he hasn't lived a life of any note, and he just wants to end it now. He reveals his insecurity through his thoughts, presuming about how the captain and crew see him based on his status. He is wise and has a great memory, being able to rehash a conversation he had with a coworker about a man with a notched jaw. He is clearly resentful of the way he has been treated in life, calling himself an \"ignorant\" man. He is clearly very curious, going outside his bunk when the ship goes dark. He breaks rules and doesn't take orders. He also clearly has a very strong sense of right and wrong, killing Rourke when he realises who he is. He decides he finally wants to be a hero in life, and goes and mends the ship. He displays not only his sense of duty in this but his longing for recognition. "
              }
            ]
          },
          {
            "question_text": "What equipment is employed throughout the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "107",
                "uid": "48897558f4ca46c09041d3ca9f306a4b",
                "response_text": "One of the main pieces of equipment used on the Stardust liner is a loudspeaker. The primary role of the speaker is to give out instructions to the crew on the ship and makes any important announcements. The men also use phosphorescent bulbs as a light source to navigate their surroundings when the liner goes into total shutdown. Crew members also carry around a blaster for protection, most likely if there is ever a need for self-defense. There is also usage of a ray gun to fight back against the Uranian fleets. To ensure survival, emergency oxygen pipes are used to maintain atmosphere. Shano also carries a pack of cigarettes that do not seem important but later become essential to the story."
              },
              {
                "worker_id": "105",
                "uid": "333f624907c64f62b8f5382ef3b45ce7",
                "response_text": "The ship is locked with multiple air locks. There is a panel of studs in the control room. The pilot is in earphones. A loud-speaker gives orders. Machinery is stopped and lights are out when ship is hiding from the enemy. For such cases there are emergency oxygen cylinders. Some men have blasters. There were port guns and ray guns and the battle was almost silent. Pipes are all around. There is a screen and a selector in the engine room which keep the ship going. Toxia gas is needed to make the selector work but people can't handle it. There is massive machinery and a shattered gold-gleaming cylinder in the engine room which make the whole ship move. Heavy rods are there which need to be lifted."
              },
              {
                "worker_id": "103",
                "uid": "77b24cd66abb48c4a8c38688697197af",
                "response_text": "Firstly, Shano is wearing polarized goggles, but it is unclear what it is used for. Secondly, there is a gray box next to the pipes at the corner of the passageway, which is used to attract the Uranians detection since its dial needle keeps quivering when everything else went silence. It’s assumed by Shano that this device was planted by the spy of the Uranians. When Shano fights with Rourke, he first uses his cigarette to dug into Rourke’s face and uses his hand to grasp Rouke’s neck, which makes his face turn purple and choked to death. When Shano is fixing the rod, he simply uses his bare hand whenever the rods fall. "
              },
              {
                "worker_id": "106",
                "uid": "7cac6e997c6c441fb7f7e60cbcfdbb71",
                "response_text": "There is various equipment employed throughout the story. Phosphorescent bulbs are used when the ship goes dark to light the passageways. A grey box with two switches and a radium dial is used. It is an electric signal box to give away the ship's position. An intercom is employed so the captain can speak to the crew. There are port guns used in battle. Atom motors are employed to keep the ship running. Shano uses the selector valve rods to keep the ship running. \n"
              }
            ]
          },
          {
            "question_text": "Describe the setting of the story.",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "107",
                "uid": "48897558f4ca46c09041d3ca9f306a4b",
                "response_text": "The very first setting of the story is the Q City Spaceport. Many space liners come in and out, making the space very busy. The spaceport also features freighter catapults, long runaways, cradles, and hangars. Inside, there are also ticket scanners and turnstiles that the passengers go through before boarding the ship.\n\nThe second and primary setting is the Stardust space liner. The space liner has an air lock that closes when the ship begins to fly. There is a control room with buttons and seats for the pilot to sit in as well. Although Shano is the only passenger on board, there are many cabins for the passengers to use. The cabin that Shano stays in also has a bunk to sleep on. Other basic parts include numerous steel decks and companionways. Later, the ship is revealed to have an engine room too, where the most crucial mechanical parts of the ship are. These parts are all advanced technology, including a new cosmic drive, selector valves (Carrsteel rods), and tube chambers to keep the filaments operating. These parts are essential to operate the jets of the liner and keep them running smoothly. "
              },
              {
                "worker_id": "105",
                "uid": "333f624907c64f62b8f5382ef3b45ce7",
                "response_text": "The story begins in the Q City Spaceport. A ship called Stardust lands to set off to Earth. Red signal is on. One old man gets on the ship and the crew is in. On board there is a control room from where one can descend to the next deck with a viewpoint. Then everything is turned off and the whole ship is dark and silent. Shano's cabin is dark and cold. Outside men are hurrying in all directions. Everyone follows the orders, there is an atmosphere of tension. Engine room is the most important place and the selector there is broken, the room is full of toxic gas. There is a massive machinery in the emergency room and a shattered cylinder all in gas with Shano making it work."
              },
              {
                "worker_id": "103",
                "uid": "77b24cd66abb48c4a8c38688697197af",
                "response_text": "The story sets in the Q City Spaceport, where the lights flicked and probed the sky. The spaceport appears to be infra red as the ship sank into the light. The speaker in the spaceport makes the announcement stating that the signal has now turned red. Afterward, Shano still decides to aboard the ship, by going through a turnstile connected to a gangway. The ship has a control room which has a panel of studs and a leather seat; there is also a companionway leading to the next deck. In Shano’s cabin, there is a bunk bed; when the ship’s machinery stopped, the room feels cold and dark. From his cabin, there is a passageway leading toward the Engine Room; an emergency exit door connects the Engine Room to the passageway. The passageway also leads to a deck. Above the room is where the captain and the crew were standing. And in the engine room is a smashed selector chamber, which has broken valve rods. "
              },
              {
                "worker_id": "106",
                "uid": "7cac6e997c6c441fb7f7e60cbcfdbb71",
                "response_text": "The story is mostly set on the spaceship \"Stardust\". When the story begins, Shano is standing in the dead of night on Mercury, before he goes to the gate to wait for the ship. He quickly boards the vessel. There is an airlock going onto the ship, with two more doors after it. There is a control room where the captain sits in a bucket seat. In Shano's cabin there is a bunk, with a \"riveted studded bulkhead\". The cabin was dark and cold. There is an engine room. At the end of the passageway is a group of pipes in the corner. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 3499,
        "document_length_chars": 20806
      }
    }
  ]
}