{
  "item_metadata": {
    "item_id": "63874",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63874",
      "content": "THE CREATURES THAT TIME FORGOT\n \n\n By RAY BRADBURY\n \n \n Mad, impossible world! Sun-blasted by day, cold-wracked by night—and life condensed by radiation into eight days! Sim eyed the Ship—if he only dared reach it and escape! ... but it was more than half an hour distant—the limit of life itself!\n \n [Transcriber's Note: This etext was produced from Planet Stories Fall 1946. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n During the night, Sim was born. He lay wailing upon the cold cave stones. His blood beat through him a thousand pulses each minute. He grew, steadily.\n \n Into his mouth his mother with feverish hands put the food. The nightmare of living was begun. Almost instantly at birth his eyes grew alert, and then, without half understanding why, filled with bright, insistent terror. He gagged upon the food, choked and wailed. He looked about, blindly.\n \n There was a thick fog. It cleared. The outlines of the cave appeared. And a man loomed up, insane and wild and terrible. A man with a dying face. Old, withered by winds, baked like adobe in the heat. The man was crouched in a far corner of the cave, his eyes whitening to one side of his face, listening to the far wind trumpeting up above on the frozen night planet.\n \n Sim's mother, trembling, now and again, staring at the man, fed Sim pebble-fruits, valley-grasses and ice-nipples broken from the cavern entrances, and eating, eliminating, eating again, he grew larger, larger.\n \n The man in the corner of the cave was his father! The man's eyes were all that was alive in his face. He held a crude stone dagger in his withered hands and his jaw hung loose and senseless.\n \n Then, with a widening focus, Sim saw the old people sitting in the tunnel beyond this living quarter. And as he watched, they began to die.\n \n Their agonies filled the cave. They melted like waxen images, their faces collapsed inward on their sharp bones, their teeth protruded. One minute their faces were mature, fairly smooth, alive, electric. The next minute a desication and burning away of their flesh occurred.\n \n Sim thrashed in his mother's grasp. She held him. \"No, no,\" she soothed him, quietly, earnestly, looking to see if this, too, would cause her husband to rise again.\n \n With a soft swift padding of naked feet, Sim's father ran across the cave. Sim's mother screamed. Sim felt himself torn loose from her grasp. He fell upon the stones, rolling, shrieking with his new, moist lungs!\n \n \n With a soft padding of naked feet Sim's father ran across the cave.\n \n\n \n The webbed face of his father jerked over him, the knife was poised. It was like one of those prenatal nightmares he'd had while still in his mother's flesh. In the next few blazing, impossible instants questions flicked through his brain. The knife was high, suspended, ready to destroy him. But the whole question of life in this cave, the dying people, the withering and the insanity, surged through Sim's new, small head. How was it that he understood? A newborn child? Can a newborn child think, see, understand, interpret? No. It was wrong! It was impossible. Yet it was happening! To him. He had been alive an hour now. And in the next instant perhaps dead!\n \n His mother flung herself upon the back of his father, and beat down the weapon. Sim caught the terrific backwash of emotion from both their conflicting minds. \"Let me kill him!\" shouted the father, breathing harshly, sobbingly. \"What has he to live for?\"\n \n \"No, no!\" insisted the mother, and her body, frail and old as it was, stretched across the huge body of the father, tearing at his weapon.\n\"He must live! There may be a future for him! He may live longer than us, and be young!\"\n \n The father fell back against a stone crib. Lying there, staring, eyes glittering, Sim saw another figure inside that stone crib. A girl-child, quietly feeding itself, moving its delicate hands to procure food. His sister.\n \n The mother wrenched the dagger from her husband's grasp, stood up, weeping and pushing back her cloud of stiffening gray hair. Her mouth trembled and jerked. \"I'll kill you!\" she said, glaring down at her husband. \"Leave my children alone.\"\n \n The old man spat tiredly, bitterly, and looked vacantly into the stone crib, at the little girl. \"One-eighth of her life's over, already,\" he gasped. \"And she doesn't know it. What's the use?\"\n \n As Sim watched, his own mother seemed to shift and take a tortured, smoke-like form. The thin bony face broke out into a maze of wrinkles. She was shaken with pain and had to sit by him, shuddering and cuddling the knife to her shriveled breasts. She, like the old people in the tunnel, was aging, dying.\n \n Sim cried steadily. Everywhere he looked was horror. A mind came to meet his own. Instinctively he glanced toward the stone crib. Dark, his sister, returned his glance. Their minds brushed like straying fingers. He relaxed somewhat. He began to learn.\n \n The father sighed, shut his lids down over his green eyes. \"Feed the child,\" he said, exhaustedly. \"Hurry. It is almost dawn and it is our last day of living, woman. Feed him. Make him grow.\"\n \n Sim quieted, and images, out of the terror, floated to him.\n \n This was a planet next to the sun. The nights burned with cold, the days were like torches of fire. It was a violent, impossible world. The people lived in the cliffs to escape the incredible ice and the day of flame. Only at dawn and sunset was the air breath-sweet, flower-strong, and then the cave peoples brought their children out into a stony, barren valley. At dawn the ice thawed into creeks and rivers, at sunset the day-fires died and cooled. In the intervals of even, livable temperature the people lived, ran, played, loved, free of the caverns; all life on the planet jumped, burst into life. Plants grew instantly, birds were flung like pellets across the sky. Smaller, legged animal life rushed frantically through the rocks; everything tried to get its living down in the brief hour of respite.\n \n It was an unbearable planet. Sim understood this, a matter of hours after birth. Racial memory bloomed in him. He would live his entire life in the caves, with two hours a day outside. Here, in stone channels of air he would talk, talk incessantly with his people, sleep never, think, think and lie upon his back, dreaming; but never sleeping.\n  And he would live exactly eight days.\n \n \n \n\n \n The violence of this thought evacuated his bowels. Eight days. Eight short days. It was wrong, impossible, but a fact. Even while in his mother's flesh some racial knowledge had told him he was being formed rapidly, shaped and propelled out swiftly.\n \n Birth was quick as a knife. Childhood was over in a flash. Adolescence was a sheet of lightning. Manhood was a dream, maturity a myth, old age an inescapably quick reality, death a swift certainty.\n \n Eight days from now he'd stand half-blind, withering, dying, as his father now stood, staring uselessly at his own wife and child.\n \n This day was an eighth part of his total life! He must enjoy every second of it. He must search his parents' thoughts for knowledge.\n  Because in a few hours they'd be dead.\n \n \n This was so impossibly unfair. Was this all of life? In his prenatal state hadn't he dreamed of long lives, valleys not of blasted stone but green foliage and temperate clime? Yes! And if he'd dreamed then there must be truth in the visions. How could he seek and find the long life? Where? And how could he accomplish a life mission that huge and depressing in eight short, vanishing days?\n \n How had his people gotten into such a condition?\n \n As if at a button pressed, he saw an image. Metal seeds, blown across space from a distant green world, fighting with long flames, crashing on this bleak planet. From their shattered hulls tumble men and women.\n \n When? Long ago. Ten thousand days. The crash victims hid in the cliffs from the sun. Fire, ice and floods washed away the wreckage of the huge metal seeds. The victims were shaped and beaten like iron upon a forge. Solar radiations drenched them. Their pulses quickened, two hundred, five hundred, a thousand beats a minute. Their skins thickened, their blood changed. Old age came rushing. Children were born in the caves. Swifter, swifter, swifter the process. Like all this world's wild life, the men and women from the crash lived and died in a week, leaving children to do likewise.\n \n So this is life, thought Sim. It was not spoken in his mind, for he knew no words, he knew only images, old memory, an awareness, a telepathy that could penetrate flesh, rock, metal. So I'm the five thousandth in a long line of futile sons? What can I do to save myself from dying eight days from now? Is there escape?\n \n His eyes widened, another image came to focus.\n \n Beyond this valley of cliffs, on a low mountain lay a perfect, unscarred metal seed. A metal ship, not rusted or touched by the avalanches. The ship was deserted, whole, intact. It was the only ship of all these that had crashed that was still a unit, still usable. But it was so far away. There was no one in it to help. This ship, then, on the far mountain, was the destiny toward which he would grow. There was his only hope of escape.\n \n His mind flexed.\n \n In this cliff, deep down in a confinement of solitude, worked a handful of scientists. To these men, when he was old enough and wise enough, he must go. They, too, dreamed of escape, of long life, of green valleys and temperate weathers. They, too, stared longingly at that distant ship upon its high mountain, its metal so perfect it did not rust or age.\n \n The cliff groaned.\n \n Sim's father lifted his eroded, lifeless face.\n \n \"Dawn's coming,\" he said.\n \n \n\n II\n \n Morning relaxed the mighty granite cliff muscles. It was the time of the Avalanche.\n \n The tunnels echoed to running bare feet. Adults, children pushed with eager, hungry eyes toward the outside dawn. From far out, Sim heard a rumble of rock, a scream, a silence. Avalanches fell into valley. Stones that had been biding their time, not quite ready to fall, for a million years let go their bulks, and where they had begun their journey as single boulders they smashed upon the valley floor in a thousand shrapnels and friction-heated nuggets.\n \n Every morning at least one person was caught in the downpour.\n \n The cliff people dared the avalanches. It added one more excitement to their lives, already too short, too headlong, too dangerous.\n \n Sim felt himself seized up by his father. He was carried brusquely down the tunnel for a thousand yards, to where the daylight appeared. There was a shining insane light in his father's eyes. Sim could not move. He sensed what was going to happen. Behind his father, his mother hurried, bringing with her the little sister, Dark. \"Wait! Be careful!\" she cried to her husband.\n \n Sim felt his father crouch, listening.\n \n High in the cliff was a tremor, a shivering.\n \n \"Now!\" bellowed his father, and leaped out.\n \n An avalanche fell down at them!\n \n Sim had accelerated impressions of plunging walls, dust, confusion. His mother screamed! There was a jolting, a plunging.\n \n With one last step, Sim's father hurried him forward into the day. The avalanche thundered behind him. The mouth of the cave, where mother and Dark stood back out of the way, was choked with rubble and two boulders that weighed a hundred pounds each.\n \n The storm thunder of the avalanche passed away to a trickle of sand. Sim's father burst out into laughter. \"Made it! By the Gods! Made it alive!\" And he looked scornfully at the cliff and spat. \"Pagh!\"\n \n Mother and sister Dark struggled through the rubble. She cursed her husband. \"Fool! You might have killed Sim!\"\n \n \"I may yet,\" retorted the father.\n \n Sim was not listening. He was fascinated with the remains of an avalanche afront of the next tunnel. A blood stain trickled out from under a rise of boulders, soaking into the ground. There was nothing else to be seen. Someone else had lost the game.\n \n Dark ran ahead on lithe, supple feet, naked and certain.\n \n The valley air was like a wine filtered between mountains. The heaven was a restive blue; not the pale scorched atmosphere of full day, nor the bloated, bruised black-purple of night, a-riot with sickly shining stars.\n \n This was a tide pool. A place where waves of varying and violent temperatures struck, receded. Now the tide pool was quiet, cool, and its life moved abroad.\n \n Laughter! Far away, Sim heard it. Why laughter? How could any of his people find time for laughing? Perhaps later he would discover why.\n \n The valley suddenly blushed with impulsive color. Plant-life, thawing in the precipitant dawn, shoved out from most unexpected sources. It flowered as you watched. Pale green tendrils appeared on scoured rocks. Seconds later, ripe globes of fruit twitched upon the blade-tips. Father gave Sim over to mother and harvested the momentary, volatile crop, thrust scarlet, blue, yellow fruits into a fur sack which hung at his waist. Mother tugged at the moist new grasses, laid them on Sim's tongue.\n \n His senses were being honed to a fine edge. He stored knowledge thirstily. He understood love, marriage, customs, anger, pity, rage, selfishness, shadings and subtleties, realities and reflections. One thing suggested another. The sight of green plant life whirled his mind like a gyroscope, seeking balance in a world where lack of time for explanations made a mind seek and interpret on its own. The soft burden of food gave him knowledge of his system, of energy, of movement. Like a bird newly cracking its way from a shell, he was almost a unit, complete, all-knowing. Heredity had done all this for him. He grew excited with his ability.\n \n \n\n \n They walked, mother, father and the two children, smelling the smells, watching the birds bounce from wall to wall of the valley like scurrying pebbles and suddenly the father said a strange thing:\n \n \"Remember?\"\n \n Remember what? Sim lay cradled. Was it any effort for them to remember when they'd lived only seven days!\n \n The husband and wife looked at each other.\n \n \"Was it only three days ago?\" said the woman, her body shaking, her eyes closing to think. \"I can't believe it. It is so unfair.\" She sobbed, then drew her hand across her face and bit her parched lips. The wind played at her gray hair. \"Now is my turn to cry. An hour ago it was you!\"\n \n \"An hour is half a life.\"\n \n \"Come,\" she took her husband's arm. \"Let us look at everything, because it will be our last looking.\"\n \n \"The sun'll be up in a few minutes,\" said the old man. \"We must turn back now.\"\n \n \"Just one more moment,\" pleaded the woman.\n \n \"The sun will catch us.\"\n \n \"Let it catch me then!\"\n \n \"You don't mean that.\"\n \n \"I mean nothing, nothing at all,\" cried the woman.\n \n The sun was coming fast. The green in the valley burnt away. Searing wind blasted from over the cliffs. Far away where sun bolts hammered battlements of cliff, the huge stone faces shook their contents; those avalanches not already powdered down, were now released and fell like mantles.\n \n \"Dark!\" shouted the father. The girl sprang over the warm floor of the valley, answering, her hair a black flag behind her. Hands full of green fruits, she joined them.\n \n The sun rimmed the horizon with flame, the air convulsed dangerously with it, and whistled.\n \n The cave people bolted, shouting, picking up their fallen children, bearing vast loads of fruit and grass with them back to their deep hideouts. In moments the valley was bare. Except for one small child someone had forgotten. He was running far out on the flatness, but he was not strong enough, and the engulfing heat was drifting down from the cliffs even as he was half across the valley.\n \n Flowers were burnt into effigies, grasses sucked back into rocks like singed snakes, flower seeds whirled and fell in the sudden furnace blast of wind, sown far into gullies and crannies, ready to blossom at sunset tonight, and then go to seed and die again.\n \n Sim's father watched that child running, alone, out on the floor of the valley. He and his wife and Dark and Sim were safe in the mouth of their tunnel.\n \n \"He'll never make it,\" said father. \"Do not watch him, woman. It's not a good thing to watch.\"\n \n They turned away. All except Sim, whose eyes had caught a glint of metal far away. His heart hammered in him, and his eyes blurred. Far away, atop a low mountain, one of those metal seeds from space reflected a dazzling ripple of light! It was like one of his intra-embryo dreams fulfilled! A metal space seed, intact, undamaged, lying on a mountain! There was his future! There was his hope for survival! There was where he would go in a few days, when he was—strange thought—a grown man!\n \n The sun plunged into the valley like molten lava.\n \n The little running child screamed, the sun burned, and the screaming stopped.\n \n Sim's mother walked painfully, with sudden age, down the tunnel, paused, reached up, broke off two last icicles that had formed during the night. She handed one to her husband, kept the other. \"We will drink one last toast. To you, to the children.\"\n \n \"To you ,\" he nodded to her. \"To the children.\" They lifted the icicles. The warmth melted the ice down into their thirsty mouths.\n \n \n\n \n All day the sun seemed to blaze and erupt into the valley. Sim could not see it, but the vivid pictorials in his parents' minds were sufficient evidence of the nature of the day fire. The light ran like mercury, sizzling and roasting the caves, poking inward, but never penetrating deeply enough. It lighted the caves. It made the hollows of the cliff comfortably warm.\n \n Sim fought to keep his parents young. But no matter how hard he fought with mind and image, they became like mummies before him. His father seemed to dissolve from one stage of oldness to another. This is what will happen to me soon, though Sim in terror.\n \n Sim grew upon himself. He felt the digestive-eliminatory movements of his body. He was fed every minute, he was continually swallowing, feeding. He began to fit words to images and processes. Such a word was love. It was not an abstraction, but a process, a stir of breath, a smell of morning air, a flutter of heart, the curve of arm holding him, the look in the suspended face of his mother. He saw the processes, then searched behind her suspended face and there was the word, in her brain, ready to use. His throat prepared to speak. Life was pushing him, rushing him along toward oblivion.\n \n He sensed the expansion of his fingernails, the adjustments of his cells, the profusion of his hair, the multiplication of his bones and sinew, the grooving of the soft pale wax of his brain. His brain at birth as clear as a circle of ice, innocent, unmarked, was, an instant later, as if hit with a thrown rock, cracked and marked and patterned in a million crevices of thought and discovery.\n \n His sister, Dark, ran in and out with other little hothouse children, forever eating. His mother trembled over him, not eating, she had no appetite, her eyes were webbed shut.\n \n \"Sunset,\" said his father, at last.\n \n The day was over. The light faded, a wind sounded.\n \n His mother arose. \"I want to see the outside world once more ... just once more....\" She stared blindly, shivering.\n \n His father's eyes were shut, he lay against the wall.\n \n \"I cannot rise,\" he whispered faintly. \"I cannot.\"\n \n \"Dark!\" The mother croaked, the girl came running. \"Here,\" and Sim was handed to the girl. \"Hold to Sim, Dark, feed him, care for him.\" She gave Sim one last fondling touch.\n \n Dark said not a word, holding Sim, her great green eyes shining wetly.\n \n \"Go now,\" said the mother. \"Take him out into the sunset time. Enjoy yourselves. Pick foods, eat. Play.\"\n \n Dark walked away without looking back. Sim twisted in her grasp, looking over her shoulder with unbelieving, tragic eyes. He cried out and somehow summoned from his lips the first word of his existence.\n \n \"Why...?\"\n \n He saw his mother stiffen. \"The child spoke!\"\n \n \"Aye,\" said his father. \"Did you hear what he said?\"\n \n \"I heard,\" said the mother quietly.\n \n The last thing Sim saw of his living parents was his mother weakly, swayingly, slowly moving across the floor to lie beside her silent husband. That was the last time he ever saw them move.\n \n \n\n IV\n \n The night came and passed and then started the second day.\n \n The bodies of all those who had died during the night were carried in a funeral procession to the top of a small hill. The procession was long, the bodies numerous.\n \n Dark walked in the procession, holding the newly walking Sim by one hand. Only an hour before dawn Sim had learned to walk.\n \n At the top of the hill, Sim saw once again the far off metal seed. Nobody ever looked at it, or spoke of it. Why? Was there some reason? Was it a mirage? Why did they not run toward it? Worship it? Try to get to it and fly away into space?\n \n The funeral words were spoken. The bodies were placed upon the ground where the sun, in a few minutes, would cremate them.\n \n The procession then turned and ran down the hill, eager to have their few minutes of free time running and playing and laughing in the sweet air.\n \n Dark and Sim, chattering like birds, feeding among the rocks, exchanged what they knew of life. He was in his second day, she in her third. They were driven, as always, by the mercurial speed of their lives.\n \n Another piece of his life opened wide.\n \n Fifty young men ran down from the cliffs, holding sharp stones and rock daggers in their thick hands. Shouting, they ran off toward distant black, low lines of small rock cliffs.\n \n \"War!\"\n \n The thought stood in Sim's brain. It shocked and beat at him. These men were running to fight, to kill, over there in those small black cliffs where other people lived.\n \n But why? Wasn't life short enough without fighting, killing?\n \n From a great distance he heard the sound of conflict, and it made his stomach cold. \"Why, Dark, why?\"\n \n Dark didn't know. Perhaps they would understand tomorrow. Now, there was the business of eating to sustain and support their lives. Watching Dark was like seeing a lizard forever flickering its pink tongue, forever hungry.\n \n Pale children ran on all sides of them. One beetle-like boy scuttled up the rocks, knocking Sim aside, to take from him a particularly luscious red berry he had found growing under an outcrop.\n \n The child ate hastily of the fruit before Sim could gain his feet. Then Sim hurled himself unsteadily, the two of them fell in a ridiculous jumble, rolling, until Dark pried them, squalling, apart.\n \n Sim bled. A part of him stood off, like a god, and said, \"This should not be. Children should not be this way. It is wrong!\"\n \n Dark slapped the little intruding boy away. \"Get on!\" she cried.\n\"What's your name, bad one?\"\n \n \"Chion!\" laughed the boy. \"Chion, Chion, Chion!\"\n \n Sim glared at him with all the ferocity in his small, unskilled features. He choked. This was his enemy. It was as if he'd waited for an enemy of person as well as scene. He had already understood the avalanches, the heat, the cold, the shortness of life, but these were things of places, of scene—mute, extravagant manifestations of unthinking nature, not motivated save by gravity and radiation. Here, now, in this stridulent Chion he recognized a thinking enemy!\n \n Chion darted off, turned at a distance, tauntingly crying:\n \n \"Tomorrow I will be big enough to kill you!\"\n \n And he vanished around a rock.\n \n More children ran, giggling, by Sim. Which of them would be friends, enemies? How could friends and enemies come about in this impossible, quick life time? There was no time to make either, was there?\n \n Dark, as if knowing his thoughts, drew him away. As they searched for desired foods, she whispered fiercely in his ear. \"Enemies are made over things like stolen foods; gifts of long grasses make friends. Enemies come, too, from opinions and thoughts. In five seconds you've made an enemy for life. Life's so short enemies must be made quickly.\" And she laughed with an irony strange for one so young, who was growing older before her rightful time. \"You must fight to protect yourself. Others, superstitious ones, will try killing you. There is a belief, a ridiculous belief, that if one kills another, the murderer partakes of the life energy of the slain, and therefore will live an extra day. You see? As long as that is believed, you're in danger.\"\n \n But Sim was not listening. Bursting from a flock of delicate girls who tomorrow would be tall, quieter, and who day after that would gain breasts and the next day take husbands, Sim caught sight of one small girl whose hair was a violet blue flame.\n \n She ran past, brushed Sim, their bodies touched. Her eyes, white as silver coins, shone at him. He knew then that he'd found a friend, a love, a wife, one who'd a week from now lie with him atop the funeral pyre as sunlight undressed their flesh from bone.\n \n Only the glance, but it held them in mid-motion, one instant.\n \n \"Your name?\" he shouted after her.\n \n \"Lyte!\" she called laughingly back.\n \n \"I'm Sim,\" he answered, confused and bewildered.\n \n \"Sim!\" she repeated it, flashing on. \"I'll remember!\"\n \n Dark nudged his ribs. \"Here, eat ,\" she said to the distracted boy.\n\"Eat or you'll never get big enough to catch her.\"\n \n From nowhere, Chion appeared, running by. \"Lyte!\" he mocked, dancing malevolently along and away. \"Lyte! I'll remember Lyte, too!\"\n \n Dark stood tall and reed slender, shaking her dark ebony clouds of hair, sadly. \"I see your life before you, little Sim. You'll need weapons soon to fight for this Lyte one. Now, hurry—the sun's coming!\"\n \n They ran back to the caves.",
      "metadata": {
        "title": "The Creatures That Time Forgot",
        "author": "Ray Bradbury",
        "passage_id": "63874",
        "uid": "723e783702554ceda67eceb2cea1df54",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "104",
                "uid": "edffa19010ea410197a4526feacbdcd9",
                "response_text": "The story begins with Sim being born in a cold cave. He’s wailing with tears while his mom feverishly feeds him. Even though he is a newborn, he interestingly has some self-awareness. Sim looked around the cave and spotted some old people dying in a graphic, grotesque manner. He raged in angst and his mom moved to soothe him. \n\nSuddenly, his father goes to attack him and his mother with a knife. His father wants to kill him as he reasons that there is no reason to live. Sim’s mother begs him not to and tells him to have faith that their son might live longer. After this altercation, Sim notices his sister, Dark, for the first time. Afterwards, he notices that his mother goes through a painful process of aging. Sim cannot seem to find anywhere to look in the cave that is not horrifying to look at and cries himself at these revelations. \n\nBecause the people on this planet age incredibly fast, Sim goes through a lot of understanding and self-thought during the first day of his life. Eventually, the next day arrives. As an avalanche falls into the valley, Sim’s father takes him and they both jump into the avalanche and are carried by it into the valley. Sim and his family enjoy the valley during the time that it is livable to play within its borders. During this time, Sim’s mother and father become upset as there is a pressing realization that they both will die soon. They all hurriedly return back to their cave as the sun is coming out and would kill them if they are caught in its rays. A young child is caught in the sun’s rays and burned to death. \n\nUpon their return, Sim’s mother and father toast icicles to signify their last day. Throughout the day, Sim continues to grow and gain more intelligence. His mother feeds him and lovingly embraces him. Upon their mother’s instruction, Dark takes Sim out into the valley and watches over him. While they are in the valley, the two parents die from old age. In the valley, Sim wonders why no one else asks about the metal seed in the distance that he sees. He thinks it is a potential escape plan. \n\nWhile outside, Sim observes meaning screaming a war rallying cry. When he finds a red berry, a boy named Chion goes and steals it from Sim. Dark slaps the boy and scolds him for stealing the berry. Sim thinks to himself about how he does not understand the fighting nature people have when life is already so short. He then threatens Chion and acknowledges the boy as his new enemy. Dark gives him advice about enemies and friends, how quick they can be made. However, Sim gets distracted with lustful thoughts about a girl that passes him. Dark mentions that she is concerned for his future as he will have to fight Chion. They then both run back to the caves. \n"
              },
              {
                "worker_id": "105",
                "uid": "5a92504a82d7428a8f55813c490053e4",
                "response_text": "Sim is just born in a cave, which is a nightmare. His mother feeds him and he grows larger and larger. There is a scary man in the farther corner of the cave, Sim's father with eyes being the only alive things on his face. Behind, the old people are sitting in the tunnel and dying. The father heads towards Sim with a knife to kill the child as there is nothing for him to live for. The mother disagrees and takes the weapon away. Sim's sister, Dark, is eating in the same room. The mother is also aging and dying. Sim understands everything though he is just one hour old and he is terrified. On the planet the days are flame, and the nights are ice, with dawn and sunset being the only bearable time to go outside. For that reason people live on the cliffs and they are about to die. Sim is about to live only eight days and all without sleep. Every age passes by really fast and people get old in days on the horrible planet. Ten thousand days ago metal seeds crashed on this planet bringing the people here, who rushed to hide in the cliffs and grew old in days. The only usable ship after the crash is still beyond the valley of cliffs, with some scientists working in it. Sim is determined to go there when he grows old and wise enough. At dawn, Sim's father takes him outside, leaps out during an avalanche and makes it alive. Fruits appear and as Sim eats, he rapidly gets knowledge. The mother cries for the transiency of time and wants to take the last look at everything, as they will die soon. The sun is rising but she is not afraid to be caught by it. Everyone rushes to the hideouts, including the family, but someone's child doesn't make it and is burnt. Sim glimpses the metal ship, his dream. Sim's parents are too feeble and send Dark to play with Sim at sunset, while they die. At dawn a funeral procession takes place for all dead during the night. Sim already can walk along. Dark and Sim discuss what they know when some people run to fight others. The kids are surprised as life is too short to fight. A boy, Chion, fights Sim for a berry. Sim understands what enemies and friends are, and the boy promises to kill him the next day. Dark explains how those are made and says that people around believe they can earn another day of life by killing the other. Suddenly, Sim notices and touches a girl, who he knows will become his wife tomorrow and they will be buried together. The girl introduces herself as Lyte, and along with Sim, Chion promises to remember the name. Dark tells Sim he needs weapons to fight for Lyte."
              },
              {
                "worker_id": "101",
                "uid": "b6b98f24903048c8a63fb7edaaa8670c",
                "response_text": "The story opens with Sim being born in a cave. He immediately  is aware of feelings and sensations and is introduced to the dreadful world his family lives in. Sim is fed fruits and grass by his mother as he grows larger, and he sees the others in the cave begin to die. As Sim's mother holds him, his father suddenly takes him and holds a knife to him, planning to kill him. Sim's mother pleads as his father wonders what he has to live for. Sim sees his sister, Dark, beside him, and his mother manages to grab the knife from his father. Sim soon begins to understand, through racial memory, the conditions he lives in. He understands that the planet he is on, on which the people before him had crashed, casts deadly radiation on the planet which causes the people on it to live for only eight days. The land outside the cave is too dangerous and deadly during the days and nights; only when it is dawn or sunset do the valleys bloom with nature and the people can enjoy its short life. Sim begins to age rapidly, aware of the eight days he has to live, and desperate to find a solution. He has a vision of a spaceship on a far out mountain, intact but impossible to get to, where a group of scientists struggle to find a way home. Sim longs to get to the ship and prolong his life. As dawn approaches, the people in the cave get ready to head down to the valley, where the daily Avalanche occurs; Sim's father recklessly takes him through the avalanche, barely surviving. Sim watches the valley become flooded with life as he gains more knowledge and understanding. As dawn fades, Sim's parents acknowledge that it is their last day of living, and everyone bolts back into the cave, a child being left behind and scorched by the sun. Sim's parents make a toast on their last day of life, and he watches them age until they are unable to walk and struggle to speak, while Sim himself notices his growth and ability. At sunset, Sim's parents are no longer able to go outside, and Sim says his first word, \"Why\". The next day, Sim's parents pass, and Dark becomes his caretaker. They frolic in the valley after the funeral procession, where Sim sees a group of men engage in war and is perplexed. He is then knocked to the ground by a child named Chion, making his first enemy. Dark explains that enemies are inevitable, especially due to the superstition some believe about gaining more days of life by killing others. Sim then notices a girl named Lyte, who he takes a liking to and acknowledges as his future wife."
              },
              {
                "worker_id": "107",
                "uid": "c0ee28715c624341bd0c84f93a54234a",
                "response_text": "Sim is born during the night. His mother feeds him with feverish hands as he realizes that he has begun the nightmare of living. As the thick fog clears, he sees a man with a dying face begin to approach them. His mother is fearful, but she continues to feed him things such as ice-nipples, pebble-fruits, and valley-grass. As his father approaches, people sitting in the tunnel all die. His father raises the knife over him and plans to kill him, but his mother flings herself upon the back of his father. He wants to kill Sim’s sister too, but seeing his wife’s state makes him change his mind. Sim begins to understand that he is on a planet next to the sun, with cold nights and hot days. Most of the people bring their children out during dawn and sunset to play because these are the only times the climate is bearable. Sim knows that he has exactly eight days to live. Sim feels that it is unfair that he only has eight days to live before he dies and wonders how the people have gotten into this situation. He gets flashbacks of a crash that brought men and women to the planet; their bodies are altered so that they live and die in a week. He tries to think about what he can do to save them and suddenly gets another image of a deserted spaceship on a low mountain. His father wakes him up to announce that it is dawn, and the Avalanche comes. As people push towards the dawn, the rocks fall too. His father lifts him up, and they narrowly avoid being killed by one. Dark runs ahead, and Sim wonders why there is laughing. Suddenly, he sees plants come to life and fruit begin to sprout, giving him new knowledge. His parents discuss how this is the last time they will see these sights again; the sun begins to rise again, and they all leave. Sim watches a young child running in the flatness, but the child dies before he makes it. His parents toast one last time, and Sim watches them age rapidly from one stage to another. Before dying, his mother tells Dark to take care of him. Sim speaks for the first time as his parents die. On the second day, there is a funeral procession for the people who have died the previous night. Dark and Sim go outside to see fifty young men go to war, which makes him bewildered as to why people fight when their lives are already so short. A small boy attacks him, and he introduces himself as Chion. Sim realizes that this is his enemy as Chion says that he will be big enough to kill him tomorrow. He sees his future wife named Lyte, and it seems that Chion is interested as well. Dark tells him to eat so he will be strong enough to fight. "
              }
            ]
          },
          {
            "question_text": "What is the setting of the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "104",
                "uid": "edffa19010ea410197a4526feacbdcd9",
                "response_text": "The story begins at night when Sim is born. He and his family are inside of the cold cave. The cave had a thick fog in it that originally obscured his dad from view. The cave is where people on the planet spend most of their time. During the two hours of the day that they are able to venture out into the valley, they enjoy the beautiful scenery of greenery until they have to return to their cave tunnels. When the time is up, the sun returns and its rays scorch and kill everything in the valley. "
              },
              {
                "worker_id": "105",
                "uid": "5a92504a82d7428a8f55813c490053e4",
                "response_text": "The story begins in a dark cave with a family within. The parents look old, the father threatens his newborn son with a knife, and the only thing the little boy and his sister do is eating. In the tunnel behind old people are dying. The planet is dangerous, it's extremely hot and the sun burns everything during the day, and the nights are cold with ice. Only at dawn and sunset the temperatures are normal and people can go outside. At these times the planet is beautiful and fruitful. When the sun appears or disappears the people hurry to the caves in the cliffs, otherwise, they die in a second outside. The temperature inside the caves is normal. There are metal pieces of seeds far away, most of the ships are broken, but one is known to be still functioning, though it's far away. "
              },
              {
                "worker_id": "101",
                "uid": "b6b98f24903048c8a63fb7edaaa8670c",
                "response_text": "The story takes place on an unknown planet near the sun. The planet has dangerous radiation and weather for the majority of the day, so much of the story is set inside a cave where humans seek refuge. The cave is barren and cold, made only of stone. At dawn and sunset, the people are able to go out into the valley, where plants grow, fruits bloom, rivers thaw, and animals roam. The few minutes of lush, natural life on the planet are cherished by the characters in the story, but they always return to the cave to avoid radiation."
              },
              {
                "worker_id": "107",
                "uid": "c0ee28715c624341bd0c84f93a54234a",
                "response_text": "The story is set on a planet that is practically uninhabitable. The nights burn with cold, and the days feel like torches of fire. Because of this, the people must live in caves to stay alive. When dawn and sunset come, however, the entire planet blossoms with life, the air becomes breath-sweet and flower-strong. The ice thaws, and the fires die off too. All of the animals come out as well to enjoy what little life they can. There are avalanches, too, mostly consisting of stones that have been biding their time. In Sim’s vision, there is a large metal spaceship just beyond the valley. He believes that it is the key to saving all of the people. When dawn comes, all of the plants flower, and pale green tendrils appear on rocks. There is also plenty of fruit to go around in that short time period. "
              }
            ]
          },
          {
            "question_text": "What is the relationship between Dark and Sim?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "104",
                "uid": "edffa19010ea410197a4526feacbdcd9",
                "response_text": "Dark is the older sister to Sim. When both of their parents die from old age, on the eighth day of their existence, Dark takes over as a carrying role for Sim. She tries her best to impart knowledge to him about friends and enemies. Noticing the interactions Sim is having with other kids his age, she warns him about the violence that his future surely holds due to a new enemy. While she is not his mother and was not born much before him, she does take a protective role. She makes sure he is fed and defends him when he is being bullied. "
              },
              {
                "worker_id": "105",
                "uid": "5a92504a82d7428a8f55813c490053e4",
                "response_text": "Dark and Sim are brother and sister. They have a one-day difference, which is a lot on the planet. As other children, they are constantly eating to get knowledge. While the parents are alive, the two are too little to be close. When the parents die, the leave Dark to take care for Sim. She teaches him what she already knows and they share their thoughts about the knowledge they gain. They become really close during the day without parents. Dark is a friend, while Sim already has enemies. She warns her brother and says him what he should do. "
              },
              {
                "worker_id": "101",
                "uid": "b6b98f24903048c8a63fb7edaaa8670c",
                "response_text": "Dark and Sim are siblings, Dark being one day older than Sim. Even when Sim is just born, he is able to see Dark and feel a connection with her, describing the feeling of their minds brushing. As Sim grows, he watches Dark model life for him. As they play in the valley, he notices the way she interacts with other children, and watches her eat in the cave. Though Dark is only one day older than Sim, time moves quickly, and she eventually must care for him when their parents die. She acts as a motherly figure to him, explaining life and making sure he eats and is protected."
              },
              {
                "worker_id": "107",
                "uid": "c0ee28715c624341bd0c84f93a54234a",
                "response_text": "Dark and Sim have a good sibling relationship. Dark is one day older than Sim, therefore making her age even faster than him. Before she dies, their mother tells Dark to look after Sim because he is younger. When their parents die, she holds Sim and cries. However, she does not disobey her parents and goes when they tell her to go play. Dark also does not let go of Sim, even when he tries to twist out of her grasp. She holds his hand during the funeral procession, and they stick together afterward. They chatter like birds, feed among the rocks, and exchange what they know about life. Later, Dark tries to break Chion apart from Sim and tells her brother that these enemies are made over small things such as food. She says that he must eat in order to defend himself and also catch up to Lyte. Dark is sad that her brother may very well have to fight for Lyte, so she tells him that he needs weapons. She worries a lot for her brother and always looks out for him."
              }
            ]
          },
          {
            "question_text": "What is strange about the planet?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "104",
                "uid": "edffa19010ea410197a4526feacbdcd9",
                "response_text": "The planet is strange because of its extremes. The people that live on the planet have to spend most of their time in the caves because during most of the day the sun is too powerful and kills everything that it touches. At night, there is a cold, burning sensation. There are about two hours during the day, dawn and sunset, where the people are able to venture into the valley. During this time, the rivers flow, the flowers bloom, and the people enjoy the livable temperatures outside. Even more strange on the planet is the extreme aging that people go through. People only live 8 days. As a result, they mature, understand, grow, and age at an incredible pace. "
              },
              {
                "worker_id": "105",
                "uid": "5a92504a82d7428a8f55813c490053e4",
                "response_text": "The planet is unadapted for humans. Originally, there were no humans on it, but their ships crushed there, so they can't escape. The sun on the planet is so hot during the day that it causes flames, so every plant is burnt in a second. During the night everything is icy and the temperature are so low, that they make everything freeze in a second. Dawn and sunset are the only times when people can go outside, at these times the planet is beautiful, full of fruits and plants. The caves are the only places for escape as the temperatures there are normal. People grow really fast and the life-time is eight days. In hours children learn to speak, to walk and to understand various concepts. The knowledge is gained through food. "
              },
              {
                "worker_id": "101",
                "uid": "b6b98f24903048c8a63fb7edaaa8670c",
                "response_text": "The planet is located very close to the sun. Because of this, the land is scorching hot during the day, making it impossible to be outside without being burned alive. The nights, however, are extremely cold, only permitting dawn and sunset for humans to be outdoors. Humans, having to adapt to the strange conditions of the planet, reside in the caves to hide from the climate, and their bodies were adjusted due to the radiation on the planet. The planet causes every human to grow rapidly and live for only eight days."
              },
              {
                "worker_id": "107",
                "uid": "c0ee28715c624341bd0c84f93a54234a",
                "response_text": "The planet causes people to age much faster than normal. From his vision, Sim sees the people drenched in solar radiation, which causes their pulses to quicken to a thousand beats per minute. Their blood changes too, and old age comes very quickly. Instead of a normal human lifespan, these people all live and die within a week while being forced to hide in caves. Another strange thing about the planet is its weather. There are only two hours of the day where life can function as normal, and everything must go into hiding for the rest of the time. Even the plant life cannot sustain itself, being burned away or frozen whenever dawn and dusk are over. "
              }
            ]
          },
          {
            "question_text": "How does Sim gain his knowledge and absorb his surroundings?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "104",
                "uid": "edffa19010ea410197a4526feacbdcd9",
                "response_text": "During his first day, Sim knows no words and has not yet spoken. Yet, he gains a lot of knowledge from images, old memories, and a telepathic type of awareness that seems to penetrate everything. He observes much of his surroundings and is upset by his analysis of the horror that occurs every day on the planet. On the second day of his existence, Sim readily and eagerly acquires more knowledge about social customs and how his society worked. "
              },
              {
                "worker_id": "105",
                "uid": "5a92504a82d7428a8f55813c490053e4",
                "response_text": "Children on the planet are constantly eating as food is the source of knowledge. People grow every minute and the length of life is eight days. Sim gains initial knowledge while he is in the womb. When he can't even move, he already understands basic concepts like family, danger, etc. Every minute he gains some new knowledge. He says his first word in a day. He walks the next morning. He starts talking to his sister and she shares her knowledge as she is older. He makes friends and enemies the next day and fall in love. People are constantly dying before him. He sees the ship and dreams to reach it and escape. "
              },
              {
                "worker_id": "101",
                "uid": "b6b98f24903048c8a63fb7edaaa8670c",
                "response_text": "Despite Sim's young age, he is quickly conscious of the images around him, as soon as an hour after he is born. He is able to recognize his mother and father, and he soon watches as people in the cave die around him. Sim quickly grows accustomed to the concept of death and picks up on the idea that people only live for eight days. He learns by observing the people around him, watching as they go outside at certain parts of the day. Sim is also able to understand things through inherited memory, which allows him to comprehend ideas such as life. He learns to understand emotions such as love through his relationship with his family, and after his parents die, his sister Dark acts as his mentor."
              },
              {
                "worker_id": "107",
                "uid": "c0ee28715c624341bd0c84f93a54234a",
                "response_text": "Sim gains knowledge as the days go by. The moment he is born, he begins to start learning about the world around him. Since humans only live for eight days, he is able to learn how to walk only one to two days after his birth. Despite being a baby for the first part of the story, he already has very intricate thoughts about wanting to live longer and how it is not fair that all the people will die so fast. When his parents take Dark and him out, his senses are honed, and he begins storing knowledge intensely. Sim begins to understand love, marriage, customs, anger, pity, rage, selfishness, shadings, subtleties, realities, and reflections. Because of the lack of time, his mind seeks and interprets material on its own instead of having to wait for somebody to teach it new concepts. Just as his parents die, he learns how to speak. All of these changes seem to be the process of his short life. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4465,
        "document_length_chars": 25779
      }
    }
  ]
}