{
  "item_metadata": {
    "item_id": "63890",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63890",
      "content": "A PLANET NAMED JOE\n \n\n By S. A. LOMBINO\n \n There were more Joes on Venus than you could shake a ray-gun at. Perhaps there was method in Colonel Walsh's madness—murder-madness—when he ordered Major Polk to scan the planet for a guy named Joe.\n \n \n [Transcriber's Note: This etext was produced from Planet Stories November 1952. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Colonel Walsh had a great sense of humor. I hated his guts ever since we went through the Academy together, but he had a great sense of humor.\n \n For example, he could have chosen a Second Looie for the job on Venus. He might even have picked a Captain. But he liked me about as much as I liked him, and so he decided the job was just right for a Major. At least, that's what he told me.\n \n I stood at attention before his desk in the Patrol Station. We were somewhere in Area Two on Earth, takeoff point for any operations in Space II. The duty was fine, and I liked it a lot. Come to think of it, the most I ever did was inspect a few defective tubes every now and then. The rest was gravy, and Colonel Walsh wasn't going to let me get by with gravy.\n \n \"It will be a simple assignment, Major,\" he said to me, peering over his fingers. He held them up in front of him like a cathedral.\n \n \"Yes, sir,\" I said.\n \n \"It will involve finding one man, a Venusian native.\"\n \n I wanted to say, \"Then why the hell don't you send a green kid on the job? Why me?\" Instead, I nodded and watched him playing with his fingers.\n \n \"The man is a trader of sorts. Rather intelligent.\" He paused, then added, \"For a native, that is.\"\n \n I had never liked Walsh's attitude toward natives. I hadn't liked the way he'd treated the natives on Mars ever since he'd taken over there. Which brought to mind an important point.\n \n \"I always figured Venus was under the jurisdiction of Space III, sir. I thought our activities were confined to Mars.\"\n \n He folded his fingers like a deck of cards and dropped them on his desk as if he were waiting for me to cut.\n \n \"Mmmm,\" he said, \"yes, that's true. But this is a special job. It so happens this Venusian is the one man who can help us understand just what's happening on Mars.\"\n \n I tried to picture a Venusian understanding Mars and I didn't get very far.\n \n \"He's had many dealings with the natives there,\" Walsh explained. \"If anyone can tell us the reasons for the revolt, he can.\"\n \n If Walsh really wanted to know the reasons for the revolt, I could give them to him in one word: Walsh. I had to laugh at the way he called it \"revolt.\" It had been going on for six months now and we'd lost at least a thousand men from Space II. Revolt.\n \n \"And this man is on Venus now?\" I asked for confirmation. I'd never been to Venus, being in Space II ever since I'd left the Moon run. It was just like Walsh to ship me off to a strange place.\n \n \"Yes, Major,\" he said. \"This man is on Venus.\"\n \n At the Academy he had called me Fred. That was before I'd reported him for sleeping on Boiler Watch. He'd goofed off on a pile of uranium that could've, and almost did, blow the barracks sky-high that night. He still thought it was my fault, as if I'd done the wrong thing by reporting him. And now, through the fouled-up machinery that exists in any military organization, he outranked me.\n \n \"And the man's name, sir?\"\n \n \"Joe.\" A tight smile played on his face.\n \n \"Joe what?\" I asked.\n \n \"Just Joe.\"\n \n \"Just Joe?\"\n \n \"Yes,\" Walsh said. \"A native, you know. They rarely go in for more than first names. But then, it should be simple to find a man with a name like Joe. Among the natives, I mean.\"\n \n \"I don't know, sir.\"\n \n \"A relatively simple assignment,\" Walsh said.\n \n \"Can you tell me anything else about this man? Physical appearance? Personal habits? Anything?\"\n \n Walsh seemed to consider this for a moment. \"Well, physically he's like any of the other Venusians, so I can't give you much help there. He does have a peculiar habit, though.\"\n \n \"What's that?\"\n \n \"He has an affinity for Terran cigarettes.\"\n \n I sighed. \"Well, it's not very much to go on.\"\n \n \"You'll find him,\" Walsh said, grinning. \"I'm sure of it.\"\n \n \n\n \n The trip to Venus came off without a hitch. I did a lot of thinking on that trip. I thought about Mars and the revolt there. And I thought about Colonel Leonard Walsh and how he was supposed to be quelling that revolt. Ever since Walsh had taken command, ever since he'd started pushing the natives around, there'd been trouble. It was almost as if the whole damned planet had blown up in our faces the moment he took over. Swell guy, Walsh.\n \n Venus was hotter than I'd expected it to be. Much too hot for the tunic I was wearing. It smelled, too. A funny smell I couldn't place. Like a mixture of old shoe and after-shave. There were plants everywhere I looked. Big plants and small ones, some blooming with flowers I'd never seen before, and some as bare as cactus.\n \n I recognized a blue figure as one of the natives the pilot had told me about. He was tall, looking almost human except that everything about him was elongated. His features, his muscles, everything seemed to have been stretched like a rubber band. I kept expecting him to pop back to normal. Instead, he flashed a double row of brilliant teeth at me.\n \n I wondered if he spoke English. \"Hey, boy,\" I called.\n \n He ambled over with long-legged strides that closed the distance between us in seconds.\n \n \"Call me Joe,\" he said.\n \n I dropped my bags and stared at him. Maybe this was going to be a simple assignment after all. \"I sure am glad to see you, Joe,\" I said.\n \n \"Same here, Toots,\" he answered.\n \n \"The guys back in Space II are searching high and low for you,\" I told him.\n \n \"You've got the wrong number,\" he said, and I was a little surprised at his use of Terran idiom.\n \n \"You are Joe, aren't you? Joe the trader?\"\n \n \"I'm Joe, all right,\" he said. \"Only thing I ever traded, though, was a pocketknife. Got a set of keys for it.\"\n \n \"Oh,\" I said, my voice conveying my disappointment. I sighed and began wondering just how I should go about contacting the Joe I was looking for. My orders said I was to report to Captain Bransten immediately upon arrival. I figured the hell with Captain Bransten. I outranked him anyway, and there wasn't much he could do if I decided to stop for a drink first.\n \n \"Where's the Officer's Club?\" I asked the Venusian.\n \n \"Are you buying information or are you just curious?\"\n \n \"Can you take me there?\" I asked.\n \n \"Sure thing, Toots.\" He picked up my bags and started walking up a heavily overgrown path. We'd probably walked for about ten minutes when he dropped my bags and said, \"There it is.\"\n \n The Officer's Club was a plasteel hut with window shields that protected it from the heat of the sun. It didn't look too comfortable but I really wanted that drink. I reached into my tunic and slipped the native thirty solars.\n \n He stared at the credits curiously and then shrugged his shoulders. \"Oh well, you're new here. We'll let it go.\"\n \n He took off then, while I stared after him, wondering just what he'd meant. Had I tipped him too little?\n \n I shrugged and looked over at the Officer's Club. From the outside it looked as hot as hell.\n \n On the inside it was about two degrees short of that mark. I began to curse Walsh for taking me away from my nice soft job in Space II.\n \n There wasn't much inside the club. A few tables and chairs, a dart game and a bar. Behind the bar a tall Venusian lounged.\n \n I walked over and asked, \"What are you serving, pal?\"\n \n \"Call me Joe,\" he answered.\n \n He caught me off balance. \"What?\"\n \n \"Joe,\" he said again.\n \n A faint glimmer of understanding began to penetrate my thick skull.\n\"You wouldn't happen to be Joe the trader? The guy who knows all about Mars, would you?\"\n \n \"I never left home,\" he said simply. \"What are you drinking?\"\n \n That rat! That dirty, filthy, stinking, unprincipled....\n  But then, it should be simple to find a man with a name like Joe. Among the natives, I mean.\n \n \n Sure. Oh sure. Real simple. Walsh was about the lowest, most contemptible....\n \n \"What are you drinking, pal?\" the Venusian asked again.\n \n \"Skip it,\" I said. \"How do I get to the captain's shack?\"\n \n \"Follow your nose, pal. Can't miss it.\"\n \n I started to pick up my bag as another Venusian entered. He waved at the bartender.\n \n \"Hello, Joe,\" he said. \"How's it going?\"\n \n \"Not so hot, Joe,\" the bartender replied.\n \n I listened in fascination. Joe, Joe, Joe. So this was Walsh's idea of a great gag. Very funny. Very....\n \n \"You Major Polk, sweetheart?\" the Venusian who'd just come in asked.\n \n \"Yes,\" I said, still thinking of Colonel Walsh.\n \n \"You better get your butt over to the captain's shack,\" he said. \"He's about ready to post you as overdue.\"\n \n \"Sure,\" I said wearily. \"Will you take my bags, please?\"\n \n \"Roger,\" he answered. He picked up the bags and nodded at the bar.\n \n \"So long, Joe,\" he said to the bartender.\n \n \"See you, Joe,\" the bartender called back.\n \n \n\n \n Captain Bransten was a mousey, unimpressive sort of man. He was wearing a tropical tunic, but he still resembled a wilted lily more than he did an officer.\n \n \"Have a seat, Major,\" he offered. He reached for a cigarette box on the desk and extended it to me. He coughed in embarrassment when he saw it was empty. Quickly, he pressed a button on his desk and the door popped open. A tall, blue Venusian stepped lithely into the room.\n \n \"Sir?\" the Venusian asked.\n \n \"We're out of cigarettes, Joe,\" the Captain said. \"Will you get us some, please?\"\n \n \"Sure thing,\" the Venusian answered. He smiled broadly and closed the door behind him.\n  Another Joe , I thought. Another damned Joe.\n \n \n \"They steal them,\" Captain Bransten said abruptly.\n \n \"Steal what?\" I asked.\n \n \"Cigarettes. I sometimes think the cigarette is one of the few things they like about Terran culture.\"\n \n So Walsh had taken care of that angle too. He does have a peculiar habit, though. He has an affinity for Terran cigarettes. Cigarettes was the tip I should have given; not solars.\n \n \"All right,\" I said, \"suppose we start at the beginning.\"\n \n Captain Bransten opened his eyes wide. \"Sir?\" he asked.\n \n \"What's with all this Joe business? It may be a very original name but I think its popularity here is a little outstanding.\"\n \n Captain Bransten began to chuckle softly. I personally didn't think it was so funny. I tossed him my withering Superior Officer's gaze and waited for his explanation.\n \n \"I hadn't realized this was your first time on Venus,\" he said.\n \n \"Is there a local hero named Joe?\" I asked.\n \n \"No, no, nothing like that,\" he assured me. \"It's a simple culture, you know. Not nearly as developed as Mars.\"\n \n \"I can see that,\" I said bitingly.\n \n \"And the natives are only now becoming acquainted with Terran culture. Lots of enlisted men, you know.\"\n \n I began to get the idea. And I began to appreciate Walsh's doubtful ancestry more keenly.\n \n \"It's impossible to tell exactly where it all started, of course,\" Bransten was saying.\n \n I was beginning to get angry. Very angry. I was thinking of Walsh sitting back in a nice cozy foam chair back on Earth.\n \n \"Get to the point, Captain!\" I barked.\n \n \"Easy, sir,\" Bransten said, turning pale. I could see that the Captain wasn't used to entertaining Majors. \"The enlisted men. You know how they are. They'll ask a native to do something and they'll call him Joe. 'Hey, Joe, give me a hand with this.' Or 'Listen, Joe, how'd you like to earn some cigarettes?' Do you follow?\"\n \n \"I follow, all right,\" I said bitterly.\n \n \"Well,\" Bransten went on, \"that sort of thing mushrooms. The natives are a simple, almost childish people. It appealed to them—the Joe business, I mean. Now they're all Joe. They like it. That and the cigarettes.\"\n \n He cleared his throat and looked at me apologetically as if he were personally responsible for Venusian culture. In fact, he looked as if he were responsible for having put Venus in the heavens in the first place.\n \n \"Do you understand, Major? Just a case of extended idiom, that's all.\"\n \n Just a case of extended idiot , I thought. An idiot on a wild goose chase a hell of a long way from home.\n \n \"I understand perfectly,\" I snapped. \"Where are my quarters?\"\n \n Bransten asked a Venusian named Joe to show me my quarters, reminding me that chow was at thirteen hundred. As I was leaving, the first Venusian came back with the cigarettes Bransten had ordered.\n \n I could tell by the look on his face that he probably had half a carton stuffed into his pockets. I shrugged and went to change into a tropical tunic.\n \n I called Earth right after chow. The Captain assured me that this sort of thing was definitely against regulations, but he submitted when I twinkled my little gold leaf under his nose.\n \n Walsh's face appeared on the screen. He was smiling, looking like a fat pussy cat.\n \n \"What is it, Major?\" he asked.\n \n \"This man Joe,\" I said. \"Can you give me any more on him?\"\n \n Walsh's grin grew wider. \"Why, Major,\" he said, \"you're not having any difficulties, are you?\"\n \n \"None at all,\" I snapped back. \"I just thought I'd be able to find him a lot sooner if....\"\n \n \"Take your time, Major,\" Walsh beamed. \"There's no rush at all.\"\n \n \"I thought....\"\n \n \"I'm sure you can do the job,\" Walsh cut in. \"I wouldn't have sent you otherwise.\"\n \n Hell, I was through kidding around. \"Look....\"\n \n \"He's somewhere in the jungle, you know,\" Walsh said.\n \n I wanted to ram my fist into the screen, right smack up against those big white teeth. Instead, I cut off the transmission and watched the surprised look on his face as his screen went blank millions of miles away.\n \n He blinked at the screen, trying to realize I'd deliberately hung up on him.\n \n \"Polk!\" he shouted, \"can you hear me?\"\n \n I smiled, saw the twisted hatred on his features, and then the screen on my end went blank, too.\n  He's somewhere in the jungle, you know.\n \n \n I thanked Captain Bransten for his hospitality and went back to my quarters.\n \n As I saw it, there were two courses for me to follow.\n \n One: I could say the hell with Walsh and Venus. That would mean hopping the next ship back to Earth.\n \n It would also mean disobeying the direct order of a superior officer. It might mean demotion, and it might mean getting bounced out of the Service altogether.\n \n Two: I could assume there really was a guy name Joe somewhere in that jungle, a Joe separate and apart from the other Joes on this planet, a trader Joe who knew the Martians well. I could always admit failure, of course, and return empty handed. Mission not accomplished. Or, I might really find a guy who was trader Joe.\n \n I made my decision quickly. I wanted to stay in the Service, and besides Walsh may have been on the level for the first time in his life. Maybe there was a Joe here who could help us on Mars. If there was I'd try to find him. It was still a hell of a trick though.\n \n I cursed Walsh again and pushed the buzzer near my bed.\n \n A tall Venusian stepped into the room.\n \n \"Joe?\" I asked, just to be sure.\n \n \"Who else, boss?\" he answered.\n \n \"I'm trying to locate someone,\" I said. \"I'll need a guide to take me into the jungle. Can you get me one?\"\n \n \"It'll cost you, boss,\" the Venusian said.\n \n \"How much?\"\n \n \"Two cartons of cigarettes at least.\"\n \n \"Who's the guide?\" I asked.\n \n \"How's the price sound?\"\n \n \"Fine, fine,\" I said impatiently. And the Captain had said they were almost a childish people!\n \n \"His name is Joe,\" the Venusian told me. \"Best damn guide on the planet. Take you anywhere you want to go, do anything you want to do. Courageous. Doesn't know the meaning of fear. I've known him to....\"\n \n \"Skip it,\" I said, cutting the promotion short. \"Tell him to show up around fifteen hundred with a complete list of what we'll need.\"\n \n The Venusian started to leave.\n \n \"And Joe,\" I said, stopping him at the door, \"I hope you're not overlooking your commission on the deal.\"\n \n His face broke into a wide grin. \"No danger of that, boss,\" he said.\n \n When he was gone I began figuring out a plan of action. Obviously, I'd just have to traipse through the jungle looking for a guy named Joe on a planet where everyone was named Joe. Everybody, at least, but the Captain, the small garrison attached to the Station, and me.\n \n \n\n \n I began wondering why Walsh had gone to so much trouble to get rid of me. The job, as I saw it, would take a hell of a long time. It seemed like a silly thing to do, just to get even with a guy for something that had happened years ago. He surely must have realized that I'd be back again, sooner or later. Maybe he had another little junket all set for me.\n \n Or maybe he didn't expect me to come back.\n \n The thought hadn't occurred to me before this, and I began to consider it seriously. Walsh was no good, rotten clear through. He was failing at the job of keeping Mars in hand, and he probably realized that a few more mistakes on his part would mean the end of his career with Space II. I chuckled as I thought of him isolated in some God-forsaken place like Space V or Space VII. This probably bothered him a lot, too. But what probably bothered him more was the fact that I was next in command. If he were transferred, I'd be in charge of Space II, and I could understand how much that would appeal to Walsh.\n \n I tried to figure the thing out sensibly, tried to weigh his good points against his bad. But it all came back to the same thing. A guy who would deliberately go to sleep on Boiler Watch with a ton of uranium ready to blast a barracks to smithereens if it wasn't watched, would deliberately do just about anything.\n \n Sending me off on a wild goose chase after a character named Joe may have been a gag. But it may have been something a little grimmer than a gag, and I made up my mind to be extremely careful from here on in.\n \n The guide arrived at fifteen hundred on the dot. He was tall, elongated, looked almost like all the other Venusians I'd seen so far.\n \n \"I understand you need a Grade A guide, sir,\" he said.\n \n \"Are you familiar with the jungle?\" I asked him.\n \n \"Born and raised there, sir. Know it like the back of my hand.\"\n \n \"Has Joe told you what the payment will be?\"\n \n \"Yes, sir. A carton and a half of cigarettes.\"\n \n I thought about Joe deducting his commission and smiled.\n \n \"When can we leave?\"\n \n \"Right away, sir. We won't need much really. I've made a list of supplies and I can get them in less than an hour. I suggest you wear light clothing, boots, and a hat.\"\n \n \"Will I need a weapon?\"\n \n He looked at me, his eyes faintly amused. \"Why, what for, sir?\"\n \n \"Never mind,\" I said. \"What's your name, by the way?\"\n \n He lifted his eyebrows, and his eyes widened in his narrow face. He was definitely surprised.\n \n \"Joe,\" he said. \"Didn't you know?\"\n \n \n\n \n When we'd been out for a while I discovered why Joe had suggested the boots and the hat. The undergrowth was often sharp and jagged and it would have sliced my legs to ribbons were they not protected by the high boots. The hat kept the strong sun off my head.\n \n Joe was an excellent guide and a pleasant companion. He seemed to be enjoying a great romp, seemed to love the jungle and take a secret pleasure in the work he was doing. There were times when I couldn't see three feet ahead of me. He'd stand stock still for a few minutes, his head barely moving, his eyes darting from one plant to another. Then he'd say, \"This way,\" and take off into what looked like more impenetrable jungle invariably to find a little path leading directly to another village.\n \n Each village was the same. The natives would come running out of their huts, tall and blue, shouting, \"Cigarettes, Joe? Cigarettes?\" It took me a while to realize they were addressing me and not my guide.\n \n Everybody was Joe. It was one beautiful, happy, joyous round of stinking, hot jungle. And I wasn't getting any nearer my man. Nor had I any idea how I was supposed to find him. I began to feel pretty low about the whole affair.\n \n Joe, on the other hand, enjoyed every moment of the trip. In each village he greeted the natives cheerfully, told them stories, swapped gossip and jokes. And when it was time to leave, he would say goodbye to all his friends and we would plunge into the twisted foliage again.\n \n His spirits were always high and he never failed to say the right thing that would give a momentary lift to my own depressed state of mind. He would talk for hours on end as we hacked our way through the jungle.\n \n \"I like Venus,\" he said once. \"I would never leave it.\"\n \n \"Have you ever been to Earth?\" I asked.\n \n \"No,\" Joe replied. \"I like Terrans too, you understand. They are good for Venus. And they are fun.\"\n \n \"Fun?\" I asked, thinking of a particular species of Terran: species Leonard Walsh.\n \n \"Yes, yes,\" he said wholeheartedly. \"They joke and they laugh and ... well, you know.\"\n \n \"I suppose so,\" I admitted.\n \n Joe smiled secretly, and we pushed on. I began to find, more and more, that I had started to talk freely to Joe. In the beginning he had been just my guide. There had been the strained relationship of employer and employee. But as the days lengthened into weeks, the formal atmosphere began to crumble. I found myself telling him all about Earth, about the people there, about my decision to attend the Academy, the rigid tests, the grind, even the Moon run. Joe was a good listener, nodding sympathetically, finding experiences in his own life to parallel my own.\n \n And as our relationship progressed from a casual one to a definitely friendly one, Joe seemed more enthusiastic than ever to keep up our grinding pace to find what we were looking for.\n \n Once we stopped in a clearing to rest. Joe lounged on the matted greenery, his long body stretched out in front of him, the knife gleaming in his belt. I'd seen him slash his way through thick, tangled vines with that knife, his long, muscular arms powerfully slicing through them like strips of silk.\n \n \"How far are we from the Station?\" I asked.\n \n \"Three or four Earth weeks,\" he replied.\n \n I sighed wearily. \"Where do we go from here?\"\n \n \"There are more villages,\" he said.\n \n \"We'll never find him.\"\n \n \"Possibly,\" Joe mused, the smile creeping over his face again.\n \n \"A wild goose chase. A fool's errand.\"\n \n \"We'd better get started,\" Joe said simply.\n \n I got to my feet and we started the march again. Joe was still fresh, a brilliant contrast to me, weary and dejected. Somehow, I had the same feeling I'd had a long time ago on my sixteenth birthday. One of my friends had taken me all over the city, finally dropping me off at my own house where the whole gang was gathered for a surprise party. Joe reminded me of that friend.\n \n \"There's a village ahead,\" he said, and the grin on his face was large now, his eyes shining.\n \n \n\n \n Something was missing here. Natives. There were no natives rushing out to greet us. No cries of \"Cigarettes? Cigarettes?\" I caught up with Joe.\n \n \"What's the story?\" I whispered.\n \n He shrugged knowingly and continued walking.\n \n And then I saw the ship, nose pointing into space, catching the rays of the sun like a great silver bullet.\n \n \"What...?\" I started.\n \n \"It's all right,\" Joe said, smiling.\n \n The ship looked vaguely familiar. I noticed the crest of Space II near the nose, and a lot of things became clear then. I also saw Walsh standing near one of the huts, a stun gun in his hand.\n \n \"Hello, Major,\" he called, almost cheerfully. The gun didn't look cheerful, though. It was pointed at my head.\n \n \"Fancy meeting you here, Colonel,\" I said, trying to match his joviality. Somehow it didn't quite come off.\n \n Joe was walking beside me, waving at the colonel, beaming all over with happiness.\n \n \"I see you found your man,\" Walsh said.\n \n I turned rapidly. Joe nodded and kept grinning, a grin that told me he was getting a big kick out of all this. Like a kid playing a game.\n \n I faced Walsh again. \"Okay, what's it all about, pal?\"\n \n \"Colonel,\" Walsh corrected me. \"You mustn't forget to say Colonel, Major .\" He emphasized my rank, and he said it with a sort of ruthless finality.\n \n I waited. I could see he was just busting to tell me how clever he'd been. Besides, there wasn't much I could do but wait. Not with Walsh pointing the stun gun at my middle.\n \n \"We've come a long way since the Academy, haven't we, Major?\"\n \n \"If you mean in miles,\" I said, looking around at the plants, \"we sure have.\"\n \n Walsh grinned a little. \"Always the wit,\" he said drily. And then the smile faded from his lips and his eyes took on a hard lustre. \"I'm going to kill you, you know.\" He said it as if he were saying, \"I think it'll rain tomorrow.\"\n \n Joe almost clapped his hands together with glee. He was really enjoying this. Another of those funny Terran games.\n \n \"You gave me a powerful handicap to overcome,\" Walsh said. \"I suppose I should thank you, really.\"\n \n \"You're welcome,\" I said.\n \n \"It wasn't easy living down the disgrace you caused me.\"\n \n \"It was your own damn fault,\" I said. \"You knew what you were doing when you decided to cork off.\"\n \n Beside me, Joe chuckled a little, enjoying the game immensely.\n \n \"You didn't have to report me,\" Walsh said.\n \n \"No? Maybe I should have forgotten all about it? Maybe I should have nudged you and served you orange juice? So you could do it again sometime and maybe blow up the whole damn Academy!\"\n \n Walsh was silent for a long time. When he spoke his voice was barely audible. The heat was oppressive, as if it were concentrated on this little spot in the jungle, focusing all its penetration on a small, unimportant drama.\n \n I could hear Joe breathing beside me.\n \n \"I'm on my way out,\" Walsh rasped. \"Finished, do you understand?\"\n \n \"Good,\" I said. And I meant it.\n \n \"This Mars thing. A terrible fix. Terrible.\"\n \n Beside me, a slight frown crossed Joe's face. Apparently he couldn't understand the seriousness of our voices. What had happened to the game, the fun?\n \n \"You brought the Mars business on yourself,\" I told Walsh. \"There was never any trouble before you took command.\"\n \n \"The natives,\" he practically shouted. \"They ... they....\"\n \n Joe caught his breath sharply, and I wondered what Walsh was going to say about the natives. Apparently he'd realized that Joe was a native. Or maybe Joe's knife had something to do with it.\n \n \"What about the natives?\" I asked.\n \n \"Nothing,\" Walsh said. \"Nothing.\" He was silent for a while.\n \n \"A man of my calibre,\" he said then, his face grim. \"Dealing with savages.\" He caught himself again and threw a hasty glance at Joe. The perplexed frown had grown heavier on Joe's face. He looked at the colonel in puzzlement.",
      "metadata": {
        "title": "A Planet Named Joe",
        "author": "S. A. Lombino",
        "passage_id": "63890",
        "uid": "2b1974aa89d84beba30498b970bc0365",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "train",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "106",
                "uid": "e0294bdceda64c64aa14173c25a683d8",
                "response_text": "Major Polk is given orders by his Boss, Colonel Walsh, to go to Venus in search of a man named Joe. Mars is in open revolt against the Colonel and the system that he runs, and Walsh tells Polk that there is a man on Venus who will be able to solve the problem of the revolt, as he spent time on Mars, and knows the natives. The Major and the Colonel hate each other, and it's clear from the get-go that the Colonel is setting the Major up for a trap. He tells Polk that the man's name is Joe, and that he has an affinity for Terran cigarettes. The Major travels to Venus to find this man, and complete the mission. When he arrives though, it becomes clear to him soon that every native Venusian is named Joe, and they all love cigarettes. Polk calls the Major from the office on Venus, asking for extra information, but the Colonel gives none. He has screwed him. The Major decides to look for this man regardless, as returning to Earth without having completed the mission could mean a demotion or a loss of job. He hires a guide to take him through the jungle terrain of Venus, obviously named Joe. As they spend weeks traveling through the jungle together they quickly become friends. They stop at various villages together, where they meet the locals, they chat on their walks and the Major tells Joe all about his past. After a few weeks, they arrive at a village, where a starship and the Colonel are waiting for them. He has a gun pointer and Polk, informing him he plans on killing him, because Polk ratted on Walsh when they were in the academy together about dozing off while he was on watch over a tank filled with uranium. Just before he goes to shoot the Major, he starts insulting the locals of Mars, and then natives in general. Joe becomes visibly upset. The story ends, and it's presumed that Joe will save the Major. "
              },
              {
                "worker_id": "101",
                "uid": "118887f2b275426e8294d3bff5eb460b",
                "response_text": "Colonel Walsh has appointed Major Polk for a mission on Venus. The two hate each other strongly due to a history at the Academy and Walsh's totalitarian nature towards natives on Mars. The Colonel tells Major Polk that he is to find a specific Venusian native named Joe, who is experienced in trading and loves cigarettes. Major Polk arrives on Mars and immediately meets a Venusian named Joe, but he soon realizes that it is not the man in question. The Major goes into the Officer's Club, where the Venusian bartender is also named Joe. Perplexed, the Major realizes that every native on Venus is named Joe. He meets with Captain Bransten, who tells him that since becoming in contact with Terran men, the Venusians had picked up their mannerisms and behaviors, including their love for cigarettes. Major Polk realizes that the Colonel has sent him on a goose chase, in impossible search of a man. Major Polk calls the Colonel, who smugly assures him that he can find the man in the jungle. The Major decides to play along with Walsh's trick and find a man for the mission. He meets a Venusian tour guide to take him through the jungle, who he gradually befriends as they visit several villages. With still no luck finding the right Joe, Major Polk soon encounters Walsh aboard his ship flying above him. Walsh tells Polk that he will kill him, recalling the time Polk reported him at the Academy. He then expresses his frustration with dealing with the natives on Mars."
              },
              {
                "worker_id": "104",
                "uid": "702a9af2da8244d589b8603effad8003",
                "response_text": "The story begins with the Major being told by Colonel Walsh that he is going to be sent to find a man on Venus. The Colonel says that the man is a Venusian native that holds very valuable information about Mars. He says the man is named Joe and that he likes cigarettes. The Major tries to gather more information but the Colonel only gives him vague answers with a grin on his face. So, with his orders, the Major heads to Venus. When he steps off the ship, he is greeted by a man named Joe. He is shocked because he initially believes it could be the Joe he needs. However, he soon realizes that it is not the correct Joe and asks to be directed to the Officer’s Club. Once he gets inside and goes to the bar, the bartender introduces himself as Joe. \n\nThe Major realizes that Walsh played a trick on him. He’s upset at Walsh for sending him on a petty, retaliatory trip. Frustrated, he heads to the Captain’s shack, where he asks why everyone is named Joe. The Captain chuckles in response and replies that it’s an unoriginal culture. Joe grows angry upon learning this. He’s taken to his sleeping quarters after the meeting. He calls the Colonel and asks for more information on the Joe he’s meant to find. The Colonel finds amusement knowing that Polk has realized his predicament. All the Colonel offers up to the Major is that Joe is somewhere in the jungle. In response, he asks for a guide to take him. As he’s waiting, he thinks of the Colonel’s intentions and how he should respond. The Major decides to go along with the trip and do his best. Once he meets his guide, they head off through the jungle. \n\nHis guide takes him through the jungle, proving to be helpful and useful. They find themselves going from village to village with days turning into weeks spent in the jungle searching for a specific Joe. Joe smiles at some of the Major’s complaints of the tedious nature of the journey in an unusual way during their journey. They eventually reach another village and Joe smiles very wide when he delivers the news to Major Polk. The Major notices that there are no natives in the new village. He sees the Colonel standing near a ship with a stun gun pointed at him. It also seems like Joe knew that the Colonel would be there. Walsh tells the Major that he is going to kill him. As they tensely converse with each other, Joe chuckles and is excited with glee during the conversation. However, when Mars is mentioned, Joe stops being excited and a frown starts to form on his face. Walsh begins to shout hateful words about natives when he realizes that Joe is a native. Joe changes his attitude and looks at the Colonel in confusion. \n"
              },
              {
                "worker_id": "103",
                "uid": "dec55d2339144394a363251b352d3edb",
                "response_text": "The story starts with Colonel Walsh assigning Major Polk the job of finding a man named Joe on Venus to help them with the revolt on Mars. Despite the fact that he has never been to Venus and Venus is not even in their jurisdiction, Colonel Walsh calls it a simple assignment and asks the Major to travel to Venus. After arriving on Venus, he immediately encounters a boy called Joe. However, this Joe is not the person that he is looking for. Before reporting to Captain Bransten, the Major decides to stop for a drink. He asks Joe to take him there. Somehow, this Joe realizes that the Major is new to this place after he tips him. After arriving at the bar, he meets two more Joes talking to each other, calling each other Joe. Neither is the one that the Major needs to find. Later, he learns from the Captain that the name Joe is just a culture here on Venus, and the natives all like cigarettes. This makes the Major furious since those are two of the few characteristics provided by Colonel Walsh. After chow, the Major calls Walsh, who is on Earth. After getting the information that this Joe is in the jungle, he asks a Joe to find him a guide for going into the jungle. Then, Major begins to realize that maybe Colonel Walsh didn’t want him back since he is the next in line for command. He decides to be more careful. Following the guide, the Major walks from village to village, searching the natives for that particular Joe. The Major and the guide get close and become friend. However, the next village they visit does not have any natives, only Colonel Walsh. And Colonel is there to kill the Major."
              }
            ]
          },
          {
            "question_text": "Why do the Colonel and the Major hate each other?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "106",
                "uid": "e0294bdceda64c64aa14173c25a683d8",
                "response_text": "The Colonel and the Major seemed as if they were acquaintances before they first fell out. The Colonel had called the Major, by his first name, Fred. Now, he only calls him Major, as a mark of disrespect, since the colonel somehow outranks him. The Colonel also demands that Polk use his proper title, as a way of putting him down. They initially fell out because one night, while the Colonel was supposed to be on boiled watch, guarding the uranium in a tank beneath the barracks, he fell asleep on duty. The entire barracks could've been blown up. The Major had to report him to their superiors. This meant that the colonel's career took a big hit, and he had to fight his way back into the ranks. He felt as if the Major betrayed him, and ratted him out. Now, the Colonel is in charge of Mars, where he has caused a revolt based on his shocking treatment of the natives. His prejudice towards the native people of Venus and Mars is another reason the Major hates him. "
              },
              {
                "worker_id": "101",
                "uid": "118887f2b275426e8294d3bff5eb460b",
                "response_text": "The Colonel and the Major attended the Academy together, and the two have despised each other since. At the Academy, Major Polk had reported the Colonel for falling asleep on duty, risking severe damage. Major Polk also holds reservations about the Colonel because of Walsh's treatment of natives, specifically on Mars after conquering the planet. He understands why there is a revolt against Walsh on Mars, given the way he degrades its natives. Colonel Walsh still holds reservations towards Major Polk since he reported him."
              },
              {
                "worker_id": "104",
                "uid": "702a9af2da8244d589b8603effad8003",
                "response_text": "Colonel Walsh and Major Polk have hated each other ever since they both went through the Academy at the same time. The Major does not like Walsh’s attitude towards natives, especially how he treats them. From this, it is able to be discerned that Walsh has a very unfavorable attitude towards natives and regularly insults or hurts them. He also does not believe that the Colonel is understanding the severity of the current military situation. The Major also believes that Walsh does a bad job of managing the planet. The hatred that the Colonel has towards the Major is because the Major reported him for sleeping on the job while they were both at the Academy. The Major defends his reporting of the Colonel by arguing that the Colonel was supposed to be watching a uranium supply that was very dangerous and could have killed many people. \n\nThe Colonel appears to be threatened by the Major because he would be next in line of command if the Colonel is ousted from his position. The Colonel acknowledges that he is possibly failing at his job with the Mars issue and does not want to be demoted and for Major Polk to take over his job. \n"
              },
              {
                "worker_id": "103",
                "uid": "dec55d2339144394a363251b352d3edb",
                "response_text": "The Major and Colonel were in the same Academy. But one time, the Colonel fell asleep on Boiler Watch. There was a pile of uranium that could’ve blown up the whole Academy. When the Major caught this he reported him. But apparently, the Colonel still thinks that it is the Major’s fault for reporting him. The Major also dislikes the way that the Colonel treats the natives. He calls them savages. The Colonel sends the Major to Venus and tells him a non-description of a man that he needs to find. This annoys the Major. He gets angry especially when he finds out that the description is completely useless since every man here names Joe and likes cigarette. The Colonel actually sends the Major here to kill him. "
              }
            ]
          },
          {
            "question_text": "What is the main setting of the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "106",
                "uid": "e0294bdceda64c64aa14173c25a683d8",
                "response_text": "The main setting of the story is the planet Venus. The planet is described as being extremely hot, and having the scent of an old shoe and after shave. There are plants everywhere, of all sizes and varieties, some with strange and wonderful flowers. There is a station for Space II, which includes The Officers Club: a small shack which functions as a bar, and The Captain's Shack. The world is covered in thick jungle, which is impossible to orient unless you're a local. The floor of the jungle is filled with sharp undergrowth that would shred your feet. In the jungle are little hidden pathways that lead to small villages, where native Venusians live. \n"
              },
              {
                "worker_id": "101",
                "uid": "118887f2b275426e8294d3bff5eb460b",
                "response_text": "The story mainly takes place on the planet Venus, its climate primarily consisting of thick jungles and rainforests. Major Polk describes the planet as very hot with a strange smell, with unfamiliar plants. The natives on Venus are tall, blue, human looking figures. Major Polk first visits the Officer's Club, a tiny hut. Later in the story, Major Polk is guided through the jungles of Venus by Joe, which are described as impenetrable and humid."
              },
              {
                "worker_id": "104",
                "uid": "702a9af2da8244d589b8603effad8003",
                "response_text": "The story begins on Earth. Major Polk is at the Patrol Station in Area Two on Earth to meet with the Colonel. Major Polk is assigned to find a man on Venus by the Colonel. So, he heads to Venus. The Major describes the planet as incredibly hot and uncomfortable. It also has a smell that isn’t easily discernible. There are large and small plants with unusual flowers dotted all over the place. The first place that the Major goes to on Venus is the Officer’s Club, a hut with window shields meant to protect from the heat. Nevertheless, the place was still very hot inside. Inside there were some seating, basic bar games, and the bar where a Venusian bartender stood. Once he leaves the bar, he heads to the Captain’s shack to find more information on the situation. Eventually leaving the Captain’s shack, he goes to his sleeping quarters. After finding a guide, the Major and his guide head off into the jungle in search of a Joe. They go through a thick jungle, encountering different villages along the way. The jungle is so thick that occasionally, the guide has to use a knife to cut through the brush. After weeks, they make it to one particular village where the Major spots a ship that catches the rays of the sun. The Colonel is standing near the ship with a gun pointed at Major Polk. "
              },
              {
                "worker_id": "103",
                "uid": "dec55d2339144394a363251b352d3edb",
                "response_text": "The main setting of the story is on Venus, where the temperature is very hot and has a strange smell. The whole planet is filled with plants, big and small, blooming and bare. There is a heavily overgrown path that leads to the Officer’s Club. The bar has pastel hut and window shields for protection against the sun. The bar has some chairs and tables, a dart game, and a bar. Captain Bransten’s office has a desk and there is a button on the desk that would call for a Venusian. There is also a screen for calling Earth. The Major’s quarter also has a buzzer near his bed. The jungle is filled with plants, and sometimes even fogs. The villages have natives and huts that they live in. Later in the village where there is no natives, there is only a ship that has the crest of Space II. "
              }
            ]
          },
          {
            "question_text": "What is the relationship between Major Polk and his guide, Joe?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "106",
                "uid": "e0294bdceda64c64aa14173c25a683d8",
                "response_text": "The relationship between the two characters starts off as one of business. Polk hires Joe to show him through the jungle. Joe is described as the best that there is, as he has lived there all his life. The two set off immediately for the jungle. As they journey through the forest, they begin to talk. Polk finds that he really enjoys the company of the Venusian. He likes that Joe always seems to be happy, and knows just what to say to cheer Polk up. He admires that he's so friendly to the locals, and immediately chats and laughs with them. Polk soon begins speaking freely to Joe, telling him about his past, as Joe would listen with the sympathetic ear. They found that they hsa a lot in common. This is why it was shocking to discover that Joe was in fact working for the Colonel the whole time, leading Polk right to him, and right to his death. "
              },
              {
                "worker_id": "101",
                "uid": "118887f2b275426e8294d3bff5eb460b",
                "response_text": "The relationship between Major Polk and Joe initially starts out as strictly professional, with Joe guiding him through the jungle. As the trip progresses the two become companions, speaking to each other casually. Major Polk notes the passion Joe has for the jungle and how much he enjoys the trip, and says that Joe provides a refreshing and uplifting presence throughout the trip. The two eventually begin telling each other about their own lives, sharing stories and becoming friends."
              },
              {
                "worker_id": "104",
                "uid": "702a9af2da8244d589b8603effad8003",
                "response_text": "At the beginning of their time together, Joe the guide seems to be very helpful to Polk. He recommends the supplies the Major would need to have a more comfortable journey in the jungle and they prove to be very useful during their adventure. During their time together, the Major observes that Joe seems to really enjoy his job. Days into their journey, the Major is feeling very dejected by not making any progress while Joe seems to be very content. It appears Joe is always in a good mood and is not influenced by the Major’s emotionally discontent. The Major notes that the relationship started off as an employer and employee constrained type but it soon became very friendly and developed to where they were sharing stories with each other. The Major increasingly talks freely with his guide. \n\nWhile the relationship appeared to be very friendly during the journey in the jungle, it appears that Major Polk should have not trusted the guide. The guide appears to have already known that the Colonel would be in a clearing waiting with a stun gun for Polk as he laughs during the beginning of their encounter. It becomes clearer that Joe planned this with the Colonel, and thus betraying the friendly relationship he made with Polk. However, Joe’s attitude begins to change as he responds with a confused look towards the Colonel’s remarks about natives and Mars. \n"
              },
              {
                "worker_id": "103",
                "uid": "dec55d2339144394a363251b352d3edb",
                "response_text": "Major Polk has a formal relationship with his guide in the beginning. He would pay the guide, Joe, cigarettes and he would simply follow Joe as he finds his way through the jungle. Later, they started to talk more freely as the journey progresses. It was much less formal but more casual as the time went by. The Major starts to talk about Earth, the Academy, the Moon run, etc. And Joe is a great listener. Thus, they become friends. "
              }
            ]
          },
          {
            "question_text": "How does the Major find out that all the natives are called Joe, and why do they like cigarettes?",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "106",
                "uid": "e0294bdceda64c64aa14173c25a683d8",
                "response_text": "When the Major first arrives, he meets a man named Joe. He is a native. The Major thinks that he may have found his man already, but when he asks him if he's a trader, which would match the description that the colonel gave him, the native tells him that he's never traded anything in his life. He then keeps meeting natives, all of whom are named Joe. He asks the Captain why all the Venusians are named Joe. The captain explains that it's because when the men of the Terran space program arrived they used their slang with the locals, all calling them Joe. The men would tell them that if they did a job for them, they would get a pack of cigarettes. Because the Venusians had no names of their own before this, eventually the name \"Joe\" stuck, and everyone on the planet answered to it. They also kept an affinity for cigarettes. \n"
              },
              {
                "worker_id": "101",
                "uid": "118887f2b275426e8294d3bff5eb460b",
                "response_text": "When the Major lands on Venus, the first native he comes across introduces himself as Joe. Thinking that he had found the man he was assigned to find, the Major is pleased, but he then realizes that the man is not the right one. As the Major goes through Venus, he begins to notice that every Venusian native addresses the other as \"Joe\", and he realizes that they all share the same name. Captain Bransten then informs the Major of the phenomenon. When Terran men were enlisted on Venus, they would often call the natives \"Joe\" as a nickname, and reward them with cigarettes. Eventually, the natives caught on and began to adapt this behavior into their own culture. "
              },
              {
                "worker_id": "104",
                "uid": "702a9af2da8244d589b8603effad8003",
                "response_text": "Once Major Polk meets the bartender, it is the second person that he meets on the planet named Joe. He realizes from this second encounter that the Colonel had set him up by sending him on an impossible mission. \n\nHis first hint that the natives like cigarettes are when the Captain offers him a cigarette as soon as he sits down in his office. The Captain says that the Venusians steal them during their conversation. The Captain explains that it is a part of the native Venusian culture to like cigarettes. He further realizes how important cigarettes are to natives when he is told the price for a guide can be paid with cigarette cartons. When they go through each village during their time in the jungle, the natives consistently ask for cigarettes. \n"
              },
              {
                "worker_id": "103",
                "uid": "dec55d2339144394a363251b352d3edb",
                "response_text": "The Major first encounters three Venusian natives, all with the name Joe. Even the server of Captain Bransten is named Joe. Thus he asks the Captain about this popular name. Because the enlisted man would call the native Joe, they like the name. Thus they are all called Joe. The Captain also reveals that the natives like the cigarettes because the enlisted men keep on asking them if they want to earn some cigarettes. The natives seem to only like these two things about Terran culture. This makes the Major realize that the tips given to one of the Joe that led him to the bar should have been cigarettes. Moreover, the Captain also notes that the natives like to steal the cigarettes."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4787,
        "document_length_chars": 26734
      }
    }
  ]
}