{
  "item_metadata": {
    "item_id": "63916",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63916",
      "content": "The CONJURER of VENUS\n \n\n By CONAN T. TROY\n \n A world-famed Earth scientist had disappeared on Venus. When Johnson found him, he found too the secret to that globe-shaking mystery—the fabulous Room of The Dreaming.\n \n \n [Transcriber's Note: This etext was produced from Planet Stories November 1952. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n The city dripped with rain. Crossing the street toward the dive, Johnson got rain in his eyes, his nose, and his ears. That was the way with the rain here. It came at you from all directions. There had been occasions when Johnson had thought the rain was falling straight up. Otherwise, how had the insides of his pants gotten wet?\n \n On Venus, everything came at you from all directions, it seemed to Johnson. Opening the door of the joint, it was noise instead of rain that came at him, the wild frantic beat of a Venusian rhumba, the notes pounding and jumping through the smoke and perfume clouded room. Feeling states came at him, intangible, but to his trained senses, perceptible emotional nuances of hate, love, fear, and rage. But mostly love. Since this place had been designed to excite the senses of both humans and Venusians, the love feelings were heavily tinged with straight sex. He sniffed at them, feeling them somewhere inside of him, aware of them but aware also that here was apprehension, and plain fear.\n \n Caldwell, sitting in a booth next to the door, glanced up as Johnson entered but neither Caldwell's facial expression or his eyes revealed that he had ever seen this human before. Nor did Johnson seem to recognize Caldwell.\n \n \"Is the mighty human wanting liquor, a woman or dreams?\" His voice was all soft syllables of liquid sound. The Venusian equivalent of a headwaiter was bowing to him.\n \n \"I'll have a tarmur to start,\" Johnson said. \"How are the dreams tonight?\"\n \n \"Ze vill be the most wonserful of all sonight. The great Unger hisself will be here to do ze dreaming. There is no ozzer one who has quite his touch at dreaming, mighty one.\" The headwaiter spread his hands in a gesture indicating ecstasy. \"It is my great regret that I must do ze work tonight instead of being wiz ze dreamers. Ah, ze great Unger hisself!\" The headwaiter kissed the tips of his fingers.\n \n \"Um,\" Johnson said. \"The great Unger!\" His voice expressed surprise, just the right amount of it. \"I'll have a tarmur to start but when does the dreaming commence?\"\n \n \"In one zonar or maybe less. Shall I make ze reservations for ze mighty one?\" As he was speaking, the headwaiter was deftly conducting Johnson to the bar.\n \n \"Not just yet,\" Johnson said. \"See me a little later.\"\n \n \"But certainly.\" The headwaiter was gone into the throng. Johnson was at the bar. Behind it, a Venusian was bowing to him. \"Tarmur,\" Johnson said. The green drink was set before him. He held it up to the light, admiring the slow rise of the tiny golden bubbles in it. To him, watching the bubbles rise was perhaps more important than drinking itself.\n \n \"Beautiful, aren't they?\" a soft voice said. He glanced to his right. A girl had slid into the stool beside him. She wore a green dress cut very low at the throat. Her skin had the pleasant tan recently on Earth. Her hair was a shade of abundant brown and her eyes were blue, the color of the skies of Earth. A necklace circled her throat and below the necklace ... Johnson felt his pulse quicken, for two reasons. Women such as this one had been quickening the pulse of men since the days of Adam. The second reason concerned her presence here in this place where no woman in her right mind ever came unescorted. Her eyes smiled up at him unafraid. Didn't she know there were men present here in this space port city who would snatch her bodily from the bar stool and carry her away for sleeping purposes? And Venusians were here who would cut her pretty throat for the sake of the necklace that circled it?\n \n \"They are beautiful,\" he said, smiling.\n \n \"Thank you.\"\n \n \"I was referring to the bubbles.\"\n \n \"You were talking about my eyes,\" she answered, unperturbed.\n \n \"How did you know? I mean....\"\n \n \"I am very knowing,\" the girl said, smiling.\n \n \"Are you sufficiently knowing to be here?\"\n \n For an instant, as if doubt crossed her mind, the smile flickered. Then it came again, stronger. \"Aren't you here?\"\n \n Johnson choked as bubbles from the tarmur seemed to go suddenly up his nose. \"My dear child ...\" he sputtered.\n \n \"I am not a child,\" she answered with a firm sureness that left no doubt in his mind that she knew what she was saying. \"And my name is Vee Vee.\"\n \n \"Vee Vee? Um. That is....\"\n \n \"Don't you think it's a nice name?\"\n \n \"I certainly do. Probably the rest of it is even nicer.\"\n \n \"There is no more of it. Just Vee Vee. Like Topsy, I just grew.\"\n \n \n\n \n \"What the devil are you doing here on Venus and here in this place?\"\n \n \"Growing.\" The blue eyes were unafraid.\n \n Sombrely, Johnson regarded her. What was she doing here? Was she in the employ of the Venusians? If she was being planted on him, then his purpose here was suspected. He shrugged the thought aside. If his purpose here was suspected, there would be no point in planting a woman on him.\n \n There would only be the minor matter of slipping a knife into his back.\n \n In this city, as on all of Venus, humans died easily. No one questioned the motives of the killer.\n \n \"You look as if you were considering some very grave matter,\" Vee Vee said.\n \n \"Not any longer,\" he laughed.\n \n \"You have decided them?\"\n \n \"Yes.\"\n \n \"Every last one of them?\"\n \n \"Oh, there might be one or two matters undecided somewhere, say out on the periphery of the galaxy. But we will solve them when we get to them.\" He waved vaguely toward the roof and the sky of space hidden behind the clouds that lay over the roof, glanced around as a man eased himself into an empty stool on his left. The man was Caldwell.\n \n \"Zlock!\" Caldwell said, to the bartender. \"Make it snappy. Gotta have zlock. Finest damn drink in the solar system.\" Caldwell's voice was thick, his tongue heavy. Johnson's eyes went back to the girl but out of the corner of them he watched Caldwell's hand lying on the bar. The fingers were beating a quick nervous tattoo on the yellow wood.\n \n \"I haven't seen him,\" Caldwell's fingers beat out their tattoo. \"But I think he is, or was, here.\"\n \n \"Um,\" Johnson said, his eyes on Vee Vee. \"How—\"\n \n \"Because that girl was asking for him,\" Caldwell's fingers answered.\n\"Watch that girl!\" Picking up the zlock, he lurched away from the bar.\n \n \"Your friend is not as drunk as he seems,\" Vee Vee said, watching Caldwell.\n \n \"My friend? Do you mean that drunk? I never saw him—\"\n \n \"Lying is one of the deadly sins.\" Her eyes twinkled at him. Under the merriment that danced in them there was ice. Johnson felt cold.\n \n \"The reservations for ze dreaming, great one?\" The headwaiter was bowing and scraping in front of him. \"The great one has decided, yes?\"\n \n \"The dreaming!\" Vee Vee looked suddenly alert. \"Of course. We must see the dreaming. Everyone wants to see the dreaming. We will go, won't we darling?\" She hooked her hand into Johnson's elbow.\n \n \"Certainly,\" Johnson said. The decision was made on the spur of the moment. That there was danger in it, he did not doubt. But there might be something else. And he might be there.\n \n \"Oh. But very good. Ze great Unger, you will love him!\" The headwaiter clutched the gold coins that Johnson extended, bowed himself out of sight.\n \n \"Say, I want to know more—\" Johnson began. His words were drowned in a blast of trumpets. The band that had been playing went into sudden silence. Waves of perfume began to flow into the place. The perfumes were blended, but one aroma was prominent among them, the sweet, cloying, soul-stirring perfume of the Dreamer.\n \n In the suddenly hushed place little sounds began to appear as Venusians and humans began to shift their feet and their bodies in anticipation of what was to happen.\n \n The trumpets flared again.\n \n On one side of the place, a big door began to swing slowly open. From beyond that slowly opening door came music, soft, muted strains that sounded like lutes from heaven.\n \n Vee Vee, her hand on Johnson's elbow, rose. Johnson stood up with her. He got the surprise of his life as her fingers clenched, digging into his muscles. Pain shot through his arm, paralyzing it and almost paralyzing him. He knew instantly that she was using the Karmer nerve block paralysis on him. His left hand moved with lightning speed, the tips of his fingers striking savagely against her shoulder.\n \n She gasped, her face whitened as pain shot through her in response to the thrust of his finger tips. Her hand that had been digging into his elbow lost its grip, dropped away and hung limp at her side. Grabbing it, she began to massage it.\n \n \"You—you—\" Hot anger and shock were in her voice. \"You're the first man I ever knew who could break the Karmer nerve paralysis.\"\n \n \"And you're the first woman who ever tried it on me.\"\n \n \"But—\"\n \n \"Shall we go watch the dreaming?\" He took the arm that still hung limp at her side and tucked it into his elbow.\n \n \"If you try to use the Karmer grip on me again I'll break your arm,\" he said. His voice was low but there was a wealth of meaning in it.\n \n \"I won't do it again,\" the girl said stoutly. \"I never make the same mistake twice.\"\n \n \"Good,\" Johnson said.\n \n \"The second time we break our victim's neck,\" Vee Vee said.\n \n \"What a sweet, charming child you—\"\n \n \"I told you before, I'm not a child.\"\n \n \"Child vampire,\" Johnson said. \"Let me finish my sentences before you interrupt.\"\n \n She was silent. A smile, struggling to appear on her face, seemed to say she held no malice. Her fingers tightened on Johnson's arm. He tensed, expecting the nerve block grip again. Instead with the tips of her fingers she gently patted his arm.\n \n \"There, there, darling, relax,\" she said. \"I know a better way to get you than by using the Karmer grip.\"\n \n \"What way?\"\n \n Her eyes sparkled. \"Eve's way,\" she answered.\n \n \"Um!\" Surprise sounded in his grunt. \"But apples don't grow on Venus.\"\n \n \"Eve's daughters don't use apples any more, darling. Come along.\"\n \n Moving toward the open door that led to the Room of the Dreaming, Johnson saw that Caldwell had risen and was following them. Caldwell's face was writhing in apprehensive agony and he was making warning signs. Johnson ignored them. With Vee Vee's fingers lightly patting his arm, they moved into the Room of the Dreaming.\n \n \n\n II\n \n It was a huge, semi-illumined room, with tier on tier of circling ramps rising up from an open space at the bottom. There ought to have been a stage there at the bottom, but there wasn't. Instead there was an open space, a mat, and a head rest. Up at the top of the circling ramps the room was in darkness, a fit hiding place for ghosts or Venusian werewolves. Pillows and a thick rug covered the circling ramps.\n \n The soul-quickening Perfume of the Dreamer was stronger here. The throbbing of the lutes was louder. It was Venusian music the lutes were playing. Human ears found it inharmonious at first, but as they became accustomed to it, they began to detect rhythms and melodies that human minds had not known existed. The room was pleasantly cool but it had the feel of dampness. A world that was rarely without pelting rain would have the feel of dampness in its dreaming rooms.\n \n The music playing strange harmonies in his ears, the perfume sending tingling feelings through his nose, Johnson entered the Room of the Dreamer. He suspected that other forces, unknown to him, were catching hold of his senses. He had been in dreaming rooms many times before but he had not grown accustomed to them. He wondered if any human ever did. A touch of chill always came over him as he crossed the threshold. In entering these places, it was as if some unknown nerve center inside the human organism was touched by something, some force, some radiation, some subtlety, that quite escaped radiation. He felt the coldness now.\n \n Vee Vee's fingers left off patting his arm.\n \n \"Do you feel it, darling?\"\n \n \"Yes.\"\n \n \"What is it?\"\n \n \"How would I know?\"\n \n \"Please!\" Her voice grew sharp. \"I think Johnny Johnson ought to know.\"\n \n \"Johnny! How do you know my name?\"\n \n \"Shouldn't I recognize one of Earth's foremost scientists, even if he is incognito on Venus?\" Her voice had a teasing quality in it.\n \n \"But—\"\n \n \"And who besides Johnny Johnson would recognize the Karmer nerve grip and be able to break it instantly?\"\n \n \"Hell—\"\n \n \"John Michael Johnson, known as Johnny to his friends, Earth's foremost expert in the field of electro-magnetic radiations within the human body!\" Her words were needles of icy fact, each one jabbing deeper and deeper into him.\n \n \"And how would I make certain you were Johnny Johnson, except by seeing if you could break the Karmer nerve grip? If you could break it, then there was no doubt who you were!\" Her words went on and on.\n \n \"Who are you?\" His words were blasts of sound.\n \n \"Please, darling, you are making a scene. I am sure this is the last thing you really want to do.\"\n \n He looked quickly around them. The Venusians and humans moving into this room seemed to be paying no attention to him. His gaze came back to her.\n \n Again she patted his arm. \"Relax, darling. Your secrets are safe with me.\"\n \n A gray color came up inside his soul. \"But—but—\" His voice was suddenly weak.\n \n The fingers on his arm were very gentle. \"No harm will come to you. Am I not with you?\"\n \n \"That's what I'm afraid of!\" he snapped at her. If he had had a choice, he might have drawn back. But with circumstances as they were—his life, Caldwell's life, possibly Vee Vee's life hung in the balance. Didn't she know that this was true? And as for Martin—But Caldwell had said that she had been asking about Martin. What connection did she have with that frantic human genius he sought here?\n \n Johnson felt his skin crawl. He moved toward a nest of cushions on a ramp, found a Venusian was beating him to them, deftly changed to another nest, found it. Vee Vee flowed to the floor on his right, moved cushions to make him more comfortable. She moved in an easy sort of way that was all flowing movement. He sat down. Someone bumped him on the left.\n \n \"Sorry, bud. Didn't mean to bump into you.\" Caldwell's voice was still thick and heavy. He sprawled to the floor on Johnson's left. Under the man's coat, Johnson caught a glimpse of a slight bulge, the zit gun hidden there. His left arm pressed against his own coat, feeling his own zit gun. Operating under gas pressure, throwing a charge of gas-driven corvel, the zit guns were not only almost noiseless in operation but they knocked out a human or a Venusian in a matter of seconds.\n \n True, the person they knocked unconscious would be all right the next day. For this reason, many people did not regard the zit guns as effective weapons, but Johnson had a fondness for them. The feel of the little weapon inside his coat sent a surge of comfort through him.\n \n The music picked up a beat, perfume seemed to flow even more freely through the air, the lights dimmed almost to darkness, a single bright spotlight appeared in the ceiling, casting a circle of brilliant illumination on the mat and the headrest at the bottom of the room. The curtain rose.\n \n \n\n \n Unger stood in the middle of the spot of light.\n \n Johnson felt his chest muscles contract, then relax. Vee Vee's fingers sought his arm, not to harm him but running to him for protection. He caught the flutter of her breathing. On his left, Caldwell stiffened and became a rock.\n \n Johnson had not seen Unger appear. One second the circle of light had been empty, the next second the Venusian, smiling with all the impassivity of a bland Buddha, was in the light. He weighed three hundred pounds if he weighed an ounce, he was clad in a long robe that would impede movement. He had appeared in the bright beam of the spotlight as if by magic.\n \n Vee Vee's fingers dug deeper into Johnson's arm. \"How—\"\n \n \"Shhh. Nobody knows.\"\n \n No human knew the answer to that trick. Unless perhaps Martin—\n \n Unger bowed. A little ripple of something that was not quite sound passed through the audience. Unger bowed again. He stretched himself flat on the mat, adjusted the rest to support his head, and apparently went to sleep. Johnson saw the Dreamer's eyes close, watched the chest take on the even, regular rhythm of sleep.\n \n The music changed, a slow dreamy tempo crept into it. Vee Vee's fingers dug at Johnson's arm as if they were trying to dig under his hide for protection. She was shivering. He reached for her hand, patted it. She drew closer to him.\n \n A few minutes earlier, she had been a very certain young woman, able to take care of herself, and handle anyone around her. Now she was suddenly uncertain, suddenly scared. In the Room of the Dreaming, she had suddenly become a frightened child looking for protection.\n \n \"Haven't you ever seen this before?\" he whispered.\n \n \"N—o.\" She shivered again. \"Oh, Johnny....\"\n \n Under the circle of light pouring down from the ceiling, the Dreamer lay motionless. Johnson found himself with the tendency to hold his breath. He was waiting, waiting, waiting—for what? The whole situation was senseless, silly, but under its apparent lack of coherence, he sensed a pattern. Perhaps the path to the far-off stars passed this way, through such scented and musical and impossible places as these Rooms of the Dreamers. Certainly Martin thought so. And Johnson himself was not prepared to disagree.\n \n Around him, he saw that the Venusians were already going ... going ... going.... Some of them were already gone. This was an old experience to them. They went rapidly. Humans went more slowly.\n \n The Venusian watchers had relaxed. They looked as if they were asleep, perhaps in a hypnotic trance, lulled into this state by the music and the perfume, and by something else. It was this something else that sent Johnson's thoughts pounding. The Venusians were like opium smokers. But he was not smoking opium. He was not in a hypnotic trance. He was wide awake and very much alert. He was ...\n  watching a space ship float in an endless void .\n \n As Unger had come into the spotlight, so the space ship had come into his vision, out of nowhere, out of nothingness. The room, the Dreamer, the sound of the music, the sweetness of the perfume, Vee Vee and Caldwell were gone. They were no longer in his reality. They were not in the range of his vision. It was as if they did not exist. Yet he knew they did exist, the memory of them, and of other things, was out on the periphery of his universe, perhaps of the universe.\n \n All he saw was the space ship.\n \n It was a wonderful thing, perhaps the most beautiful sight he had seen in his life. At the sight of it, a deep glow sprang inside of him.\n \n Back when he had been a kid he had dreamed of flight to the far-off stars. He had made models of space ships. In a way, they had shaped his destiny, had made him what he was. They had brought him where he was this night, to the Dream Room of a Venusian tavern.\n \n The vision of the space ship floating in the void entranced and thrilled him. Something told him that this was real; that here and now he was making contact with a vision that belonged to time.\n \n He started to his feet. Fingers gripped his arm.\n \n \"Please, darling. You startled me. Don't move.\" Vee Vee's voice. Who was Vee Vee?\n \n The fingers dug into his arm. Pain came up in him. The space ship vanished. He looked with startled eyes at Vee Vee, at the Dream Room, at Unger, dreaming on the mat under the spot.\n \n \"You ... you startled me,\" Vee Vee whispered. She released the grip on his arm.\n \n \"But, didn't you see it?\"\n \n \"See what?\"\n \n \"The space ship!\"\n \n \"No. No.\" She seemed startled and a little terrified and half asleep.\n\"I ... I was watching something else. When you moved I broke contact with my dream.\"\n \n \"Your dream?\"\n \n He asked a question but she did not answer it. \"Sit down, darling, and look at your damned space ship.\" Her voice was a taut whisper of sound in the darkened room. Johnson settled down. A glance to his left told him that Caldwell was still sitting like a chunk of stone.... The Venusians were quiet. The music had shifted. A slow languorous beat of hidden drums filled the room. There was another sound present, a high-speed whirring. It was, somehow, a familiar sound, but Johnson had not heard it before in this place.\n \n He thought about the space ship he had seen.\n \n The vision would not come.\n \n He shook his head and tried again.\n \n Beside him, Vee Vee was silent, her face ecstatic, like the face of a woman in love.\n \n He tried again for the space ship.\n \n It would not come.\n \n Anger came up instead.\n \n Somehow he had the impression that the whirring sound which kept intruding into his consciousness was stopping the vision.\n \n So far as he could tell, he was the only one present who was not dreaming, who was not in a state of trance.\n \n His gaze went to Unger, the Dreamer....\n \n Cold flowed over him.\n \n Unger was slowly rising from the mat.\n \n The bland face and the body in the robe were slowly floating upward!\n \n \n\n III\n \n An invisible force seemed to twitch at Johnson's skin, nipping it here and there with a multitude of tiny pinches, like invisible fleas biting him.\n \n \"This is it!\" a voice whispered in his mind. \"This is what you came to Venus to see. This ... this....\" The first voice went into silence. Another voice took its place.\n \n \"This is another damned vision!\" the second voice said. \"This ... this is something that is not real, that is not possible! No Venusian Dreamer, and no one else, can levitate, can defy the laws of gravity, can float upward toward the ceiling. Your damned eyes are tricking you!\"\n \n \"We are not tricking you!\" the eyes hotly insisted. \"It is happening. We are seeing it. We are reporting accurately to you. That Venusian Buddha is levitating. We, your eyes, do not lie to you!\"\n \n \"You lied about the space ship!\" the second voice said.\n \n \"We did not lie about the space ship!\" the eyes insisted. \"When our master saw that ship we were out of focus, we were not reporting. Some other sense, some other organ, may have lied, but we did not.\"\n \n \"I—\" Johnson whispered.\n \n \"I am your skin,\" another voice whispered. \"I am covered with sweat.\"\n \n \"We are your adrenals. We are pouring forth adrenalin.\"\n \n \"I am your pancreas. I am gearing you for action.\"\n \n \"I am your thyroid. I....\"\n \n A multitude of tiny voices seemed to whisper through him. It was as if the parts of his body had suddenly found voices and were reporting to him what they were doing. These were voices out of his training days when he had learned the names of these functions and how to use them.\n \n \"Be quiet!\" he said roughly.\n \n The little voices seemed to blend into a single chorus. \"Action, Master! Do something.\"\n \n \"Quiet!\" Johnson ordered.\n \n \"But hurry. We are excited.\"\n \n \"There is a time to be excited and a time to hurry. In this situation, if action is taken before the time for it—if that time ever comes—we can all die.\"\n \n \"Die?\" the chorus quavered.\n \n \"Yes,\" Johnson said. \"Now be quiet. When the time goes we will all go together.\"\n \n The chorus went into muted silence. But just under the threshold the little voices were a multitude of tiny fretful pressures.\n \n \"I hear a whirring sound,\" his ears reported.\n \n \"Please!\" Johnson said.\n \n In the front of the room Unger floated ten feet above the floor.\n \n \"Master, we are not lying!\" his eyes repeated.\n \n \"I sweat....\" his skin began.\n \n \"Watch Unger!\" Johnson said.\n \n The Dreamer floated. If wires suspended him, Johnson could not see them. If any known force lifted him, Johnson could not detect that force. All he could say for certain was that Unger floated.\n \n \"Yaaah!\" The silence of a room was broken by the enraged scream of a Venusian being jarred out of his dream.\n \n \"Damn it!\" A human voice said.\n \n A wave as sharp as the tip of a sword swept through the room.\n \n Unger fell.\n \n He was ten feet high when he started to fall. With a bone-breaking, body-jarring thud, the Dreamer fell. Hard.\n \n There was a split second of startled silence in the Dreaming Room. The silence went. Voices came.\n \n \"Who did that?\"\n \n \"What happened?\"\n \n \"That human hidden there did it! He broke the Dreaming!\" Anger marked the voices. Although the language was Venusian, Johnson got most of the meaning. His hand dived under his coat for the gun holstered there. At his left, Caldwell was muttering thickly. \"What—what happened? I was back in the lab on Earth—\" Caldwell's voice held a plaintive note, as if some pleasant dream had been interrupted.\n \n On Johnson's right, Vee Vee seemed to flow to life. Her arms came up around his neck. He was instantly prepared for anything. Her lips came hungrily against his lips, pressed very hard, then gently drew away.\n \n \"What—\" he gasped.\n \n \"I had to do it now, darling,\" she answered. \"There may not be a later.\"\n \n Johnson had no time to ask her what she meant. Somewhere in the back of the room a human screamed. He jerked around. Back there a knot of Venusians were attacking a man.\n \n \"It's Martin!\" Caldwell shouted. \"He is here!\"\n \n In Johnson's hand as he came to his feet the zit gun throbbed. He fired blindly at the mass of Venusians. Caldwell was firing too. The soft throb of the guns was not audible above the uproar from the crowd. Struck by the gas-driven corvel charges, Venusians were falling. But there seemed to be an endless number of them.\n \n \"Vee Vee?\" Johnson suddenly realized that she had disappeared. She had slid out of his sight.\n \n \"Vee Vee!\" Johnson's voice became a shout.\n \n \"To hell with the woman!\" Caldwell grunted. \"Martin's the important one.\"\n \n Zit, zit, zit, Caldwell moved toward the rear, shooting as he went. Johnson followed.",
      "metadata": {
        "title": "The Conjurer of Venus",
        "author": "Conan T. Troy",
        "passage_id": "63916",
        "uid": "3f1957295df143df9d76fb3356cff830",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "validation",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "9",
                "uid": "e51ec4518f4e41589bc65102d4de1ffc",
                "response_text": "Jonny Johnson is one of Earth’s foremost scientists, but no one on Venus is supposed to know that. He and another man, Caldwell, have come looking for another human named Martin, and it would be quite dangerous for him and them if anyone knew they were there. Johnson enters a bar known for providing patrons with dreams, and meets a gorgeous and dangerous woman named Vee Vee. \n\nVee Vee attempts to use a tactic known as the Karmer nerve paralysis on Johnson, which he swiftly blocks. They enter the Room of the Dreamer together, even though they don’t trust each other (and Caldwell has tipped off Johnson to watch out for her because she has been asking about Martin). As they enter the room and Johnson and Vee Vee lob threats back and forth, she reveals that she knows who he is but says she will keep his secret. \n\nThe Dreamer, Unger, enters the room and the dreaming commences. It seems to affect everyone, including Johnson, who sees a spaceship and then is upset that he can’t get it back. He has the odd sensation of different bodily organs speaking to him and trying to convince him what he’s seeing is real as he watches Unger levitate high into the air. \n\nUnger falls, hard, and the crowd gets very upset and murmurs suggest a human is at fault. Vee Vee suddenly kisses Johnson, saying she might not be able to later. He is puzzled by this, until he sees that Martin is in the room and the crowd is converging on him. Johnson and Caldwell fire their effective but not fatal zit guns into the crowd as Johnson calls out Vee Vee’s name and Caldwell tells him to forget about her. As the passage ends they are trying to get through the frantic throng of people to reach Martin. \n"
              },
              {
                "worker_id": "10",
                "uid": "23be897108b84ba39d7f2ac57fc1e4ff",
                "response_text": "John Michael Johnson and Caldwell are scientists from Earth that are attempting to undertake a covert mission on Venus to locate Martin. They believe he can be found at a Venusian theatrical experience called the dreaming, whereby a room full of people are led into a dream state by a Venusian named Unger. \n\nJohnson and Caldwell pretend not to know each other, and Caldwell keeps watch over Johnson - tapping out messages to him in code on the bar top so they can communicate from a distance. Caldwell detects sinister intentions of Vee Vee and tries to warn Johnson repeatedly as she joins Johnson and he begins to be swept up by her captivating beauty and manipulations. Johnson has flashes of concern that VeeVee may be planted by someone who suspects the intentions that he and Caldwell have at the bar, but he dismisses those thoughts.\n\nVee Vee forces Johnson into the dreaming spectacle to take place that evening in a dark theatre within the bar. She attempts to disable Johnson using the Karmer grip, but is astonished when he is able to break it. Despite her confident influence over Johnson, she becomes scared and clings to Johnson through the dreaming. \n\nHumans fall into the dream state more reluctantly than Venusians, and Johnson wakes out of his dream of a ship to see that Unger is levitating above the floor at the center of the room. This is a huge discovery for him that he can hardly believe. Within his body, he experiences a surge of readiness to action, but this is abruptly broken by another human interrupting the dreaming. Martin has broken Unger’s dreaming session, toppling Unger to the floor from a height and waking all the other dreamers who are furious. VeeVee kisses Johnson and leaves rapidly while the theatre goers break into violence and Caldwell and Johnson start firing their stun weapons around the room trying to apprehend Martin before he escapes.\n"
              },
              {
                "worker_id": "6",
                "uid": "69c9499716ed468b90099e3deeee7061",
                "response_text": "An Earthman named Johnson walks through rain-filled Venus to get to the bar. Johnson is after a genius named Martin, and he and his colleague Caldwell have traveled to Venus to find him.  He enters, hearing rhythmic music and sensing the feelings of those around him. Caldwell is in the bar as well, but they pretend they don’t know each other. Johnson orders a tarmur from a Venusian waiter and asks about the dreams. Unger, a great dreamer, will be performing tonight, so Johnson asks the waiter to come back and ask again later. Johnson sits down at the bar and enjoys his green beverage. A girl sits down next to him: tan, scantily clad, with blue eyes and brown hair, and a fabulous necklace. Instantly, Johnson feels both attracted and worried for her. She was not safe here in this bar, even on this planet, dressed like that. They flirt, and she introduces herself as Vee Vee, after stating that she is not a child. Johnson cannot figure out why she is on this planet. He wonders if she was sent to monitor him because the Venusians suspected his mission, but he quickly brushes that off because he would’ve been killed already had they figured it out. \nCaldwell rushes next to Johnson, pretending to be drunk and disorderly, and informs Johnson that Vee Vee knows who Martin is, the man that they’re searching for. Vee Vee and Johnson decide to attend the dreaming, but on their way to the room, she attempts to paralyze him using the Karmer nerve block. He gets out of it and injures her in the process. This confirms her theory that he is John Michael Johnson, esteemed human scientist. Caldwell follows them into the Room of the Dreamer. \nThe room is heavily perfumed and filled with cushions and rugs for people to lie on. The music gets louder as the room gets darker. Vee Vee holds onto Johnson as Unger suddenly appears in the center of the room. He lies down to sleep, and soon everyone follows after him. The Venusians first, humans last. Johnson thinks he notices a pattern in the room, but he finally drifts off and sees a spaceship, the one he dreamt of as a boy. Vee Vee woke him up, but he was unable to return to sleep due to the high-speed whirring sound. He saw Unger levitating ten feet above the ground and couldn’t believe his eyes. Perhaps Johnson starts dreaming again, or maybe he’s hallucinating, either way, his body starts speaking to him as his mind sees Unger. A Venusian awoke from their dream, and a human’s cry caused everyone else to wake up. Suddenly, Unger dropped back to the ground. \nEveryone tries to figure out who disturbed the Dreaming. Fingers point to Martin, who was there after all. Vee Vee quickly kisses Johnson and then disappears. Caldwell and Johnson pull out their non-lethal zit guns and shoot at the crowd who were trying to attack Martin. \n"
              },
              {
                "worker_id": "2",
                "uid": "6f3344e72ef94eb3baa4678cc9f20c41",
                "response_text": "Johnson, a scientist from Earth, has traveled to Venus in search of a missing Earth scientist named Martin. He goes to an entertainment venue where patrons can have liquor, women, or dreams. An associate, Caldwell, is already there, it seems they have an agreement not to acknowledge each other’s presence. Johnson orders a drink at the bar, and a young woman joins him and strikes up a conversation. Johnson is surprised to see such a young, beautiful woman alone in the bar because it isn’t safe. She introduces herself as Vee Vee, and Johnson begins to suspect that the Venusians are using her to get to him; he knows that they would kill him if they knew his purpose. Caldwell comes to the bar to place an order, and his fingers tap nervously on the bar top; Johnson interprets the taps as a message warning him about the girl because she was asking about Martin earlier. Vee Vee comments about Caldwell’s apparent drunkenness and calls him Johnson’s friend. Johnson denies knowing him, but Vee Vee accuses him of lying. Vee Vee accompanies Johnson to the dreaming, and while she is holding his arm, she uses a move   on himcalled the Karmer nerve paralysis. Recognizing what is happening, Johnson hits her shoulder, breaking her grip, and Vee Vee is astonished because he is the first man she knew who could break it. Johnson warns her not to try it again, and she says she doesn’t make the same mistake twice, and the second time she breaks her victim’s neck. She claims she will use Eve’s way to get to him next. She addresses Johnson by his name and says his ability to break the Karmer nerve grip confirmed his identity for her. They move to the dreaming room, select a spot, and settle on some cushions; Caldwell settles next to them. The music plays and perfumes fill the air. Eventually a spotlight shines in the center of the room, and the famous dreamer Unger appears. When he settles in to sleep, everyone in the room begins dreaming their own dreams. Johnson wakens and notices a whirring sound that seems familiar but from a different place; he can’t restart his dream and sees Unger’s body levitating upward. Johnson becomes hyperaware of his organs and imagines they are talking to him, and his adrenals tell him they are making adrenalin, and his pancreas is preparing him for action. Someone yells out, woken from his dream. Unger’s body drops to the floor from a height of ten feet. A Venusian claims a human broke the dreaming, and pandemonium breaks loose. Vee Vee kisses Johnson and disappears, and Johnson and Caldwell see the Venusians attacking Martin and start shooting them with their zit guns.\n\n\n"
              }
            ]
          },
          {
            "question_text": "Who is Johnson and what does he do/what happens to him in the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "9",
                "uid": "e51ec4518f4e41589bc65102d4de1ffc",
                "response_text": "Johnson, whose full name is John Michael Johnson, is described by Vee Vee as one of Earth’s foremost scientists, and an expert in the field of electro-magnetic radiation in human bodies. He is the protagonist of the story, a human man who has apparently come to Venus in search of another human named Martin. He goes to a bar that has a Room of the Dreamer. Before he enters it, he encounters Vee Vee. She incites both lust and anxiety in Johnson, as he is attracted to her but doesn’t think she should be alone at a Venusian bar. After she attempts to use Karmer’s nerve paralysis on him, he blocks her and threatens her not to do it again. They go into the Room of the Dreamer, where Johnson discovers that Vee Vee knows who he is. The Unger enters and the dreaming begins. Johnson sees a spaceship before him and the room seems to disappear behind him. Johnson is upset when the spaceship disappears and he can’t get it back. He sees Unger starting to levitate and all of Johnson’s various body parts seem to talk to him. When Unger falls, Vee Vee kisses Johnson. He is confused and then realizes that Martin is there and is being attacked. As the passage ends, Johnson and Caldwell are shooting people with their zit guns and trying to get toward Martin as Johnson calls out to Vee Vee. \n"
              },
              {
                "worker_id": "10",
                "uid": "23be897108b84ba39d7f2ac57fc1e4ff",
                "response_text": "John Michael Johnson is the Earth's foremost expert in the field of electro-magnetic radiations within the human body. He has travelled to Venus with a close colleague, Caldwell, to try to find a “frantic human genius” named Martin at The Dreaming performance. \n\nHe’s intercepted and influenced by a human named Vee Vee during his mission, who appears to have bad intentions towards him that he allows to play out. She may be using him to locate Martin as well, who she had been inquiring about at the club.\n\nJohnson has a drink at the bar and then goes to the dreaming with Vee Vee where she nearly paralyzes him with the Karmer grip that he is fortunately able to break before she gains control of him. During the dreaming performance, Johnson dreams of a ship, but then returns to reality where he catches sight of the Venusian performer, Unger, levitating above the ground in the center of the room. He is astonished at the levitation, and his body is preparing to take action of some means when the room is disrupted by another human - revealed to be Martin. Vee Vee kisses him and rapidly vanishes. The dreaming theatre erupts into violent chaos and the story ends with Johnson and Caldwell shooting their weapons around the room.\n"
              },
              {
                "worker_id": "6",
                "uid": "69c9499716ed468b90099e3deeee7061",
                "response_text": "John Michael Johnson, Johnny to his friends, is an esteemed scientist from Earth. Presumably, he and his colleague, Caldwell, are developing research or material on Dreamers and what happens when they enter that state of mind. This can be assumed when it is revealed that the man they were searching for on Venus, Martin, knows something about the Dream world that others don’t.\nJohnson makes his way to Venus to chase after Martin and winds up in a dive bar. An attractive young woman attaches herself to his arm after he orders a tarmur, and eventually introduces herself as Vee Vee. Johnson, cautious on this planet due to its unfriendly history with humans, immediately fears for this girl, as he can think of a reason why a human would want her and why a Venusian would want her. \nThey chat and flirt until Caldwell informs Johnson in drunken-code that the girl was inquiring about Martin, the man they were pursuing. Vee Vee expresses interest in visiting the Room of the Dreamer, so Johnson buys tickets for both of them. As they stand to enter the open doors, Vee Vee uses the Karmer nerve block paralysis on him, and it almost works, until Johnson pinches her shoulder and injures her in return. They flirt a little more, then enter the room. As they sit down on their cushioned spot, Vee Vee clings onto him in fear and reveals that his ability to defend himself from the Karmer nerve block proved his identity to her. She knows who he is, Johnny Johnson, and reveals it. \nUnger suddenly appears and promptly goes to sleep. Though they struggle at first with falling asleep, they both do and Johnson sees a spaceship in his dream. Suddenly, he wakes up to Vee Vee grabbing his arm, claiming he woke her up. He hears a strange whirring, which prevents him from falling back into his old dream. He sees Unger begin to float in the air. His body responds, his nerves talking to him, his adrenal gland, his skin. Johnson’s body reacts as his mind does, too. The whole room wakes up thanks to a human’s scream and Unger comes crashing onto the ground. Vee Vee kisses Johnson, as he pulls out his zit gun, a non-lethal weapon. He and Caldwell start shooting at the mass of people attacking the man, who they have discovered is Martin. \n"
              },
              {
                "worker_id": "2",
                "uid": "6f3344e72ef94eb3baa4678cc9f20c41",
                "response_text": "Johnson is a well-known scientist from Earth and an expert in electro-magnetic radiations within the human body. He and his associate Caldwell have traveled to Venus to search for a missing scientist named Martin. Their mission is highly secretive; Johnson and Caldwell do not acknowledge each other publicly although they can communicate through finger taps. Johnson is puzzled when a beautiful Earth woman approaches him in a bar and strikes up a conversation. It is odd for her to be there alone because Venus is not safe for unaccompanied women. Johnson suspects Venus authorities might be aware of his mission and might be using the woman to get to him, but he ultimately disregards this thought because he knows that if the Venusians knew his real mission, they would kill him. When Caldwell comes to the bar to order another drink, he finger-taps a message to Johnson to watch out for the woman and tells him that she was asking for Martin earlier. He also says he thinks Martin is or has been there although he hasn’t seen him. Johnson is stunned when the woman uses the Karmer nerve paralysis move on him, and she claims that when he breaks the move, it confirms his identity for her. She knows his full name and that he is a well-known scientist but says she’ll keep his secrets. During the dreaming, Johnson dreams of a spaceship, which is closely associated with his childhood dreams of traveling to the stars. When he awakens from the dream, he senses that something is off. He hears a whirring sound but can’t place what it is, and he is aware his body is producing adrenalin and preparing for action. When everyone is suddenly roused from their dreams, and the Venusians start attacking the human accused of waking them, Caldwell identifies the man as Martin, and Johnson helps him shoot the Venusians with his zit gun to knock them unconscious.\n"
              }
            ]
          },
          {
            "question_text": "Who is Vee Vee and what does she do/what happens to her in the story?",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "9",
                "uid": "e51ec4518f4e41589bc65102d4de1ffc",
                "response_text": "Vee Vee is a woman described as very beautiful, with auburn hair, blue eyes and tanned skin. She wears a low-cut green dress and necklace and seems out of place at the dream bar, but unafraid. She introduces herself to Johnson and gets him to escort her to the Room of the Dreamer, even after Caldwell warns him that she has been asking for Martin. She attempts to use Karmer’s nerve paralysis on Johnson and he blocks it. Johnson says she is a child vampire and brings her into the Room of Dreaming; she says next time she’ll use Eve’s trick against him. She says his name and when he questions her, it turns out that she knows exactly who he is and what he does. She claims to have tried the paralysis trick to see if he would block it so she would know if it was him. Self-assured though she was before, she becomes quite frightened in the Room of the Dreamer. After Unger falls and chaos breaks out, she kisses Johnson and says she did it because she might not be able to later. Though he calls for her as he and Caldwell make their way towards Martin, Vee Vee’s whereabouts are unknown at the end of the passage. \n"
              },
              {
                "worker_id": "10",
                "uid": "23be897108b84ba39d7f2ac57fc1e4ff",
                "response_text": "VeeVee’s origins are mysterious, but from her appearances in the story we know she is a beautiful human female who is capable of manipulating Johnson. She also possesses some spy-like traits with the ability to assess Caldwell’s drunkard act and recognize that he is informing Johnson, as well as performing the paralyzing Karmer grip on Johnson.\n\nShe seeks out Johnson in the bar and manipulates him into going into The Dreaming alongside her. Because she has prior knowledge of Johnson being Earth's foremost expert in the field of electro-magnetic radiations within the human body, and also shows interest in Martin - the genius Johnson himself is there to find - the reader is left to conclude that VeeVee likely has intentions of gathering expert knowledge about how the dreaming act works. To what end - good or evil - we do not know.\n"
              },
              {
                "worker_id": "6",
                "uid": "69c9499716ed468b90099e3deeee7061",
                "response_text": "Vee Vee is a human woman, traveling on Venus. She’s wearing a beautiful green dress with a deep neckline and a big necklace. Her blue eyes and brown hair draw Johnson in, along with her cleavage. She is presumably in Venus searching for Martin, the genius that Johnson and Caldwell are also after. She uses the Karmer nerve block on Johnson after flirting with him to determine if he is, in fact, John Michael Johnson, a human scientist. While in the Room of the Dreamer, her demeanor changes, and she suddenly becomes scared. She clings to Johnson as Unger appears and continues latching onto him as they fall asleep. She wakes him up, but she claims he woke her up and then falls back asleep. She is awoken once more when the cry echoes throughout the room. She kisses Johnson, claiming it may be her only chance, then disappears in the night. "
              },
              {
                "worker_id": "2",
                "uid": "6f3344e72ef94eb3baa4678cc9f20c41",
                "response_text": "Vee Vee is a beautiful young woman who somehow knows about Martin, Johnson, and Caldwell. She starts a conversation with Johnson at the bar and identifies Caldwell as his friend. Her unaccompanied presence in the bar is disturbing to Johnson, and Caldwell warns him about her because she has been asking for Martin. It isn’t clear whether she is working for the Venusians, but Johnson suspects she might be. She comes across as strong; she is bold in the way she takes on Johnson, and she uses the Karmer nerve grip on him. After he breaks the hold, she tells him she doesn’t make the same mistake twice; the second time, she breaks the person’s neck. Then she tells him she will get to him Eve’s way. Vee Vee reveals she knows Johnson’s identity but says she’ll keep his secrets and even goes so far as to say no harm will come to him because she is with him. Once they go into the dreaming room, however, Vee Vee begins to act scared. She stays close to Johnson and holds onto him for protection. When the Venusians wake from their dreams, Vee Vee kisses Johnson and then pulls away from him, saying she had to kiss him now because there might not be a later time. Then she disappears as Caldwell identifies Martin, and Johnson and Caldwell begin firing their zit guns as the Venusians. "
              }
            ]
          },
          {
            "question_text": "Describe the setting(s) of the story.",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "9",
                "uid": "e51ec4518f4e41589bc65102d4de1ffc",
                "response_text": "The story takes place on Venus at an unspecified point in the future. At the very beginning, the setting is outside on a rainy evening. On Venus, the rain falls in all directions, possibly including straight up. Johnson says that everything on Venus feels like it’s coming at him from all directions. He soon enters the club, a perfumed room with loud Venusian music, a bar that Johnson makes his way to, and “feeling states” that hit Johnson immediately; specifically feelings of love and sex designed to entice humans and Venusians. When they enter the Room of the Dreamer, the perfume becomes stronger and the music louder, playing harmonies that seem new to the ear. The room is massive and only semi-illuminated, with many tiered, carpet and pillow-lined ramps circling up from an empty space with only a mat and headrest. It feels pleasantly cool but also slightly damp, and guests are greeted by a strange, tangible energy. \n"
              },
              {
                "worker_id": "10",
                "uid": "23be897108b84ba39d7f2ac57fc1e4ff",
                "response_text": "The entire story takes place on the very rainy planet of Venus, inside a club in an unnamed Venusian city. The club contains a bar and a special room for The Dreaming, which is a group experience of mental trance led on by a Venusian figure that takes place in a theatre-like seating room within the club. The club itself is filled with loud Venusian rhumba music, smoke and perfume. The dreaming room is dark, damp, and cold with perfumed smells and rhythmic lute music.\n\nThere are some references to the dream locations that characters travel to, like Caldwell dreaming of being back in his lab, but the only physical locations of the story are within the club.\n"
              },
              {
                "worker_id": "6",
                "uid": "69c9499716ed468b90099e3deeee7061",
                "response_text": "The Conjurer of Venus takes place on Venus, an extremely rainy planet. At first, the characters are in the main room of a bar. Filled with rhythmic music and feelings of desire, fear, and love, the bar feels crowded and full. Headwaiters attend to everyone’s needs, and booths line the walls. There’s a bar where drinks like tarmur may be poured. \nEventually, they enter the Room of the Dreamer. The music is just as strong here, but there’s another feeling to this room, a certain coldness of unknowingness. The room was perfumed and filled with Venusian lute music. A thick rug lined the ground, as well as plenty of cushions. A man and a headrest lie in the center of the room for Unger’s use. \n"
              },
              {
                "worker_id": "2",
                "uid": "6f3344e72ef94eb3baa4678cc9f20c41",
                "response_text": "The story is set on Venus where it rains frequently, heavily, and seemingly from all directions. The planet is occupied by Venusians and some Earthmen, and it offers entertainment designed to appeal to emotions, especially love. The society is quite advanced; it provides entertainment venues that offer liquor, women, and dreams to its patrons. The first part of the story takes place at the bar in one of these entertainment venues; the music there is a Venusian rhumba with a strong beat. The atmosphere is clouded with smoke and perfume. A headwaiter greets people at the door and escorts them to the appropriate part of the establishment based on their desires. When it is time for the dreaming, trumpets play, and a different perfume diffuses into the bar. In the dreaming room, there is a mat and a headrest in the center of the floor, and around it, there are tiers of circular ramps covered with thick rugs and groupings of pillow nests. The dreamer’s perfume is stronger in this room, and the air is cool and somewhat damp. Venusian lute music plays louder; this music sounds inharmonious to Earthmen at first, but once they become used to it, they can follow the rhythms and melodies they never knew existed. When it is time for the dreaming to begin, the lights are turned down very low, and a spotlight shines on the mat in the center of the room. A curtain lifts, and the dreamer, in this case, Unger, enters the spotlight. The music, perfume, and something Johnson can’t identify put the dreamer audience into a sort of trance so that they have their own dreams.\n"
              }
            ]
          },
          {
            "question_text": "Describe what the story tells us about the culture on Venus.",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "9",
                "uid": "e51ec4518f4e41589bc65102d4de1ffc",
                "response_text": "The culture on Venus is complex and futuristic, and seems to cater to both Venusians and humans. Women don’t appear to have a particularly high status. A bar like the one the story takes place in is apparently not safe for unaccompanied women, based on Johnson’s initial reaction to her being there alone; he worries that Earth men might abduct her for sex and that Venusians might kill her to steal her jewelry. When Johnson enters, the head waiter asks if he wants liquor, women, or dreams, implying that sex work or some other transactional use of “women” is at play there. Through its use of “feeling states”, the Venusian nightlife appears to have commodified the emotions that people already possess in an attempt to entice, confuse, and manipulate. The popularity of “dreaming” further shows an emphasis on escape and illusion in this culture. The drinks served also seem as much a visual experience as a drinking experience: the bar seems to want to stimulate all senses. \n"
              },
              {
                "worker_id": "10",
                "uid": "23be897108b84ba39d7f2ac57fc1e4ff",
                "response_text": "Venusians have a very rich sensory experience in their culture. In the story they are capable of operating at different electromagnetic frequencies than humans - creating trance-like dreams, guided by perfumes and rhythmic music. The humans also experience various feeling states like you would experience smells as they enter the Venusian bar.\n\nVenus is also a place that is dangerous for humans, and although their culture welcomes them to patronize clubs and the dreamings, Venusians are known to harm humans. It’s described that humans die easily where the story takes place and that the motives of human killers are not questioned. \n"
              },
              {
                "worker_id": "6",
                "uid": "69c9499716ed468b90099e3deeee7061",
                "response_text": "Venus is clearly not very friendly towards humans. According to Johnson, many humans are killed here without so much of an investigation or a worry. Apparently, there were plenty of motives for killing humans, so there was no need to do any sort of investigation. Hence his anxiety when he first met Vee Vee. Her necklace, which he claims Vneusiams would kill her for, and her body, which Earthmen would steal her for, make her a shiny target in Venus. \nBased on the crowdedness of the bar, it seems that Venus has a hedonistic culture. Venusians and humans alike swarm toward the Room of the Dreamer, a way to be able to transport themselves from their present reality to another. \n"
              },
              {
                "worker_id": "2",
                "uid": "6f3344e72ef94eb3baa4678cc9f20c41",
                "response_text": "\n\tThe Venusian culture is very centered on feelings and sensations, especially love and the desire for sex. Their entertainment venues are scented with perfumes, and their music has a wild, frantic beat. The different fragrances seem to have different effects. For example, when the dreaming time is near, waves are perfume flow into an area, but the strongest perfume is the one of the dreamer. Their dreaming rooms are designed to provide pleasant feelings with their plush carpets and cozy pillow nests. Venusians in businesses behave in a very patronizing way with humans, referring to them as “mighty humans” and offering them whatever they want. Outside of business dealings, Venusians are less friendly. Single human women are not safe, though, because Venusians are likely to kill a woman to steal a beautiful necklace that she is wearing, and on Venus, no human deaths are investigated, and they happen rather often. There appears to be some antipathy between Venusians and humans; Johnson fears for his life if the Venusians know he is there searching for Martin. And during the dreaming, a Venusian accuses a human of waking him from his dream. The Venusian is enraged, and he and the other Venusians descend on the human and attack him. \n"
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 4572,
        "document_length_chars": 25990
      }
    }
  ]
}