{
  "item_metadata": {
    "item_id": "63932",
    "num_documents": 1
  },
  "documents": [
    {
      "doc_id": "63932",
      "content": "THE LOST TRIBES OF VENUS\n \n\n By ERIK FENNEL\n \n On mist-shrouded Venus, where hostile swamp meets hostile sea ... there did Barry Barr—Earthman transmuted—swap his Terran heritage for the deep dark waters of Tana; for the strangely beautiful Xintel of the blue-brown skin.\n \n \n [Transcriber's Note: This etext was produced from Planet Stories May 1954. Extensive research did not uncover any evidence that the U.S. copyright on this publication was renewed.]\n \n \n \n Evil luck brought the meteorite to those particular space-time coordinates as Number Four rode the downhill spiral toward Venus. The football-sized chunk of nickel-iron and rock overtook the ship at a relative speed of only a few hundred miles per hour and passed close enough to come within the tremendous pseudo-gravatic fields of the idling drivers.\n \n It swerved into a paraboloid course, following the flux lines, and was dragged directly against one of the three projecting nozzles. Energy of motion was converted to heat and a few meteoric fragments fused themselves to the nonmetallic tube casing.\n \n In the jet room the positronic line accelerator for that particular driver fouled under the intolerable overload, and the backsurge sent searing heat and deadly radiation blasting through the compartment before the main circuit breakers could clack open.\n \n The bellow of the alarm horn brought Barry Barr fully awake, shattering a delightfully intimate dream of the dark haired girl he hoped to see again soon in Venus Colony. As he unbuckled his bunk straps and started aft at a floating, bounding run his weightlessness told him instantly that Number Four was in free fall with dead drivers.\n \n Red warning lights gleamed wickedly above the safety-locked jet room door, and Nick Podtiaguine, the air machines specialist, was manipulating the emergency controls with Captain Reno at his elbow. One by one the crew crowded into the corridor and watched in tense silence.\n \n The automatic lock clicked off as the jet room returned to habitable conditions, and at Captain Reno's gesture two men swung the door open. Quickly the commander entered the blasted jet room. Barry Barr was close behind him.\n \n Robson Hind, jet chief of Four and electronics expert for Venus Colony, hung back until others had gone in first. His handsome, heavy face had lost its usual ruddiness.\n \n Captain Reno surveyed the havoc. Young Ryan's body floated eerily in the zero gravity, charred into instant death by the back-blast. The line accelerator was a shapeless ruin, but except for broken meter glasses and scorched control handles other mechanical damage appeared minor. They had been lucky.\n \n \"Turnover starts in six hours twelve minutes,\" the captain said meaningfully.\n \n Robson Hind cleared his throat. \"We can change accelerators in two hours,\" he declared. With a quick reassumption of authority he began to order his crew into action.\n \n It took nearer three hours than two to change accelerators despite Hind's shouted orders.\n \n At last the job was completed. Hind made a final check, floated over to the control panel and started the fuel feed. With a confident smile he threw in the accelerator switch.\n \n The meter needles climbed, soared past the red lines without pausing, and just in time to prevent a second blowback, Hind cut the power.\n \n \" There's metal in the field! \" His voice was high and unsteady.\n \n \n\n \n Everyone knew what that meant. The slightest trace of magnetic material would distort the delicately balanced cylinder of force that contained and directed the Hoskins blast, making it suicidal to operate.\n \n Calmly Captain Reno voiced the thought in every mind.\n \n \"It must be cleared. From the outside.\"\n \n Several of the men swore under their breaths. Interplanetary space was constantly bombarded, with an intensity inverse to the prevailing gravitation, by something called Sigma radiation. Man had never encountered it until leaving Earth, and little was known of it except that short exposure killed test animals and left their bodies unpredictably altered.\n \n Inside the ship it was safe enough, for the sleek hull was charged with a Kendall power-shield, impervious to nearly any Sigma concentration. But the shielding devices in the emergency spacesuits were small and had never been space-tested in a region of nearly equalized gravitations.\n \n The man who emerged from the airlock would be flipping a coin with a particularly unpleasant form of death.\n \n Many pairs of eyes turned toward Robson Hind. He was jet chief.\n \n \"I'm assigned, not expendable,\" he protested hastily. \"If there were more trouble later....\" His face was pasty.\n \n Assigned. That was the key word. Barry Barr felt a lump tightening in his stomach as the eyes shifted to him. He had some training in Hoskins drivers. He knew alloys and power tools. And he was riding Four unassigned after that broken ankle had made him miss Three. He was the logical man.\n \n \"For the safety of the ship.\" That phrase, taken from the ancient Earthbound code of the sea, had occurred repeatedly in the indoctrination manual at Training Base. He remembered it, and remembered further the contingent plans regarding assigned and unassigned personnel.\n \n For a moment he stood indecisively, the nervous, unhumorous smile quirking across his angular face making him look more like an untried boy than a structural engineer who had fought his way up through some of the toughest tropical construction camps of Earth. His lean body, built more for quick, neatly coordinated action than brute power, balanced handily in the zero gravity as he ran one hand through his sandy hair in a gesture of uncertainty.\n \n He knew that not even the captain would order him through the airlock.\n \n But the members of the Five Ship Plan had been selected in part for a sense of responsibility.\n \n \"Nick, will you help me button up?\" he asked with forced calmness.\n \n For an instant he thought he detected a sly gleam in Hind's eyes. But then the jet chief was pressing forward with the others to shake his hand.\n \n Rebellious reluctance flared briefly in Barry's mind. Dorothy Voorhees had refused to make a definite promise before blasting off in Three—in fact he hadn't even seen her during her last few days on Earth. But still he felt he had the inside track despite Hind's money and the brash assurance that went with it. But if Hind only were to reach Venus alive—\n \n \n\n \n The blazing disc of Sol, the minor globes of the planets, the unwinking pinpoints of the stars, all stared with cosmic disinterest at the tiny figure crawling along the hull. His spacesuit trapped and amplified breathing and heartbeats into a roaring chaos that was an invitation to blind panic, and all the while there was consciousness of the insidiously deadly Sigma radiations.\n \n Barry found the debris of the meteorite, an ugly shining splotch against the dull superceramic tube, readied his power chisel, started cutting. Soon it became a tedious, torturingly strenuous manual task requiring little conscious thought, and Barry's mind touched briefly on the events that had brought him here.\n \n First Luna, and that had been murderous. Man had encountered Sigma for the first time, and many had died before the Kendall-shield was perfected. And the chemical-fueled rockets of those days had been inherently poor.\n \n Hoskins semi-atomics had made possible the next step—to Mars. But men had found Mars barren, swept clear of all life in the cataclysm that had shattered the trans-Martian planet to form the Asteroid Belt.\n \n Venus, its true surface forever hidden by enshrouding mists, had been well within one-way range. But Hoskins fuel requirements for a round trip added up to something beyond critical mass. Impossible.\n \n But the Five Ship Plan had evolved, a joint enterprise of government and various private groups. Five vessels were to go out, each fueled to within a whiskered neutron of spontaneous detonation, manned by specialists who, it was hoped, could maintain themselves under alien conditions.\n \n On Venus the leftover fuel from all five would be transferred to whichever ship had survived the outbound voyage in best condition. That one would return to Earth. Permanent base or homeward voyage with colonists crowded aboard like defeated sardines? Only time would tell.\n \n Barry Barr had volunteered, and because the enlightened guesses of the experts called for men and women familiar with tropical conditions, he had survived the rigorous weeding-out process. His duties in Venus Colony would be to refabricate the discarded ships into whatever form was most needed—most particularly a launching ramp—and to study native Venusian materials.\n \n Dorothy Voorhees had signed on as toxicologist and dietician. When the limited supply of Earth food ran out the Colony would be forced to rely upon Venusian plants and animals. She would guard against subtle delayed-action poisons, meanwhile devising ways of preparing Venusian materials to suit Earth tastes and digestions.\n \n Barry had met her at Training Base and known at once that his years of loneliness had come to an end.\n \n She seemed utterly independent, self-contained, completely intellectual despite her beauty, but Barry had not been deceived. From the moment of first meeting he had sensed within her deep springs of suppressed emotion, and he had understood. He too had come up the hard way, alone, and been forced to develop a shell of hardness and cold, single-minded devotion to his work. Gradually, often unwillingly under his insistence, her aloofness had begun to melt.\n \n But Robson Hind too had been attracted. He was the only son of the business manager of the great Hoskins Corporation which carried a considerable share in the Five Ship Plan. Dorothy's failure to virtually fall into his arms had only piqued his desires.\n \n The man's smooth charm had fascinated the girl and his money had opened to her an entirely new world of lavish nightclubs and extravagantly expensive entertainments, but her inborn shrewdness had sensed some factor in his personality that had made her hesitate.\n \n Barry had felt a distrust of Hind apart from the normal dislike of rivalry. He had looked forward to being with Dorothy aboard Three, and had made no secret of his satisfaction when Hind's efforts to have himself transferred to Three also or the girl to Four had failed.\n \n But then a scaffold had slipped while Three was being readied, and with a fractured ankle he had been forced to miss the ship.\n \n He unclipped the magnetic detector from his belt and ran it inch by inch over the nozzle. He found one spot of metal, pinhead-sized, but enough to cause trouble, and once more swung his power chisel into stuttering action.\n \n Then it was done.\n \n As quickly as possible he inched back to the airlock. Turnover had to start according to calculations.\n \n \n\n \n Barry opened his eyes. The ship was in normal deceleration and Nick Podtiaguine was watching him from a nearby bunk.\n \n \"I could eat a cow with the smallpox,\" Barry declared.\n \n Nick grinned. \"No doubt. You slept around the clock and more. Nice job of work out there.\"\n \n Barry unhitched his straps and sat up.\n \n \"Say,\" he asked anxiously. \"What's haywire with the air?\"\n \n Nick looked startled. \"Nothing. Everything checked out when I came off watch a few minutes ago.\"\n \n Barry shrugged. \"Probably just me. Guess I'll go see if I can mooch a handout.\"\n \n He found himself a hero. The cook was ready to turn the galley inside out while a radio engineer and an entomologist hovered near to wait on him. But he couldn't enjoy the meal. The sensations of heat and dryness he had noticed on awakening grew steadily worse. It became difficult to breathe.\n \n He started to rise, and abruptly the room swirled and darkened around him. Even as he sank into unconsciousness he knew the answer.\n \n The suit's Kendall-shield had leaked!\n \n Four plunged toward Venus tail first, the Hoskins jets flaring ahead. The single doctor for the Colony had gone out in Two and the crewmen trained in first aid could do little to relieve Barry's distress. Fainting spells alternated with fever and delirium and an unquenchable thirst. His breathing became increasingly difficult.\n \n A few thousand miles out Four picked up a microbeam. A feeling of exultation surged through the ship as Captain Reno passed the word, for the beam meant that some Earthmen were alive upon Venus. They were not necessarily diving straight toward oblivion. Barry, sick as he was, felt the thrill of the unknown world that lay ahead.\n \n Into a miles-thick layer of opacity Four roared, with Captain Reno himself jockeying throttles to keep it balanced on its self-created support of flame.\n \n \"You're almost in,\" a voice chanted into his headphones through crackling, sizzling static. \"Easy toward spherical one-thirty. Hold it! Lower. Lower. CUT YOUR POWER!\"\n \n The heavy hull dropped sickeningly, struck with a mushy thud, settled, steadied.\n \n Barry was weak, but with Nick Podtiaguine steadying him he was waiting with the others when Captain Reno gave the last order.\n \n \"Airlock open. Both doors.\"\n \n Venusian air poured in.\n \n \"For this I left Panama?\" one of the men yelped.\n \n \"Enough to gag a maggot,\" another agreed with hand to nose.\n \n It was like mid-summer noon in a tropical mangrove swamp, hot and unbearably humid and overpowering with the stench of decaying vegetation.\n \n But Barry took one deep breath, then another. The stabbing needles in his chest blunted, and the choking band around his throat loosened.\n \n The outer door swung wide. He blinked, and a shift in the encompassing vapors gave him his first sight of a world bathed in subdued light.\n \n Four had landed in a marsh with the midships lock only a few feet above a quagmire surface still steaming from the final rocket blast. Nearby the identical hulls of Two and Three stood upright in the mud. The mist shifted again and beyond the swamp he could see the low, rounded outlines of the collapsible buildings Two and Three had carried in their cargo pits. They were set on a rock ledge rising a few feet out of the marsh. The Colony!\n \n Men were tossing sections of lattice duckboard out upon the swamp, extending a narrow walkway toward Four's airlock, and within a few minutes the new arrivals were scrambling down.\n \n Barry paid little attention to the noisy greetings and excited talk. Impatiently he trotted toward the rock ledge, searching for one particular figure among the men and women who waited.\n \n \"Dorothy!\" he said fervently.\n \n Then his arms were around her and she was responding to his kiss.\n \n Then unexpected pain tore at his chest. Her lovely face took on an expression of fright even as it wavered and grew dim. The last thing he saw was Robson Hind looming beside her.\n \n By the glow of an overhead tubelight he recognized the kindly, deeply lined features of the man bending over him. Dr. Carl Jensen, specialist in tropical diseases. He tried to sit up but the doctor laid a restraining hand on his shoulder.\n \n \"Water!\" Barry croaked.\n \n The doctor held out a glass. Then his eyes widened incredulously as his patient deliberately drew in a breath while drinking, sucking water directly into his lungs.\n \n \"Doctor,\" he asked, keeping his voice low to spare his throat. \"What are my chances? On the level.\"\n \n Dr. Jensen shook his head thoughtfully. \"There's not a thing—not a damned solitary thing—I can do. It's something new to medical science.\"\n \n Barry lay still.\n \n \"Your body is undergoing certain radical changes,\" the doctor continued, \"and you know as much—more about your condition than I do. If a normal person who took water into his lungs that way didn't die of a coughing spasm, congestive pneumonia would get him sure. But it seems to give you relief.\"\n \n Barry scratched his neck, where a thickened, darkening patch on each side itched infuriatingly.\n \n \"What are these changes?\" he asked. \"What's this?\"\n \n \"Those things seem to be—\" the doctor began hesitantly. \"Damn it, I know it sounds crazy but they're rudimentary gills.\"\n \n Barry accepted the outrageous statement unemotionally. He was beyond shock.\n \n \"But there must be—\"\n \n Pain struck again, so intense his body twisted and arched involuntarily. Then the prick of a needle brought merciful oblivion.\n \n \n\n II\n \n Barry's mind was working furiously. The changes the Sigma radiations had inflicted upon his body might reverse themselves spontaneously, Dr. Jensen had mentioned during a second visit—but for that to happen he must remain alive. That meant easing all possible strains.\n \n When the doctor came in again Barry asked him to find Nick Podtiaguine. Within a few minutes the mechanic appeared.\n \n \"Cheez, it's good to see you, Barry,\" he began.\n \n \"Stuff it,\" the sick man interrupted. \"I want favors. Can do?\"\n \n Nick nodded vigorously.\n \n \"First cut that air conditioner and get the window open.\"\n \n Nick stared as though he were demented, but obeyed, unbolting the heavy plastic window panel and lifting it aside. He made a face at the damp, malodorous Venusian air but to Barry it brought relief.\n \n It was not enough, but it indicated he was on the right track. And he was not an engineer for nothing.\n \n \"Got a pencil?\" he asked.\n \n He drew only a rough sketch, for Nick was far too competent to need detailed drawings.\n \n \"Think you can get materials?\"\n \n Nick glanced at the sketch. \"Hell, man, for you I can get anything the Colony has. You saved Four and everybody knows it.\"\n \n \"Two days?\"\n \n Nick looked insulted.\n \n He was back in eight hours, and with him came a dozen helpers. A power line and water tube were run through the metal partition to the corridor, connections were made, and the machine Barry had sketched was ready.\n \n Nick flipped the switch. The thing whined shrilly. From a fanshaped nozzle came innumerable droplets of water, droplets of colloidal size that hung in the air and only slowly coalesced into larger drops that fell toward the metal floor.\n \n Barry nodded, a smile beginning to spread across his drawn features.\n \n \"Perfect. Now put the window back.\"\n \n Outside lay the unknown world of Venus, and an open, unguarded window might invite disaster.\n \n A few hours later Dr. Jensen found his patient in a normal sleep. The room was warm and the air was so filled with water-mist it was almost liquid. Coalescing drops dripped from the walls and curving ceiling and furniture, from the half clad body of the sleeping man, and the scavenger pump made greedy gulping sounds as it removed excess water from the floor.\n \n The doctor shook his head as he backed out, his clothes clinging wet from the short exposure.\n \n It was abnormal.\n \n But so was Barry Barr.\n \n With breathing no longer a continuous agony Barry began to recover some of his strength. But for several days much of his time was spent in sleep and Dorothy Voorhees haunted his dreams.\n \n Whenever he closed his eyes he could see her as clearly as though she were with him—her face with the exotic high cheek-bones—her eyes a deep gray in fascinating contrast to her raven hair—lips that seemed to promise more of giving than she had ever allowed herself to fulfil—her incongruously pert, humorous little nose that was a legacy from some venturesome Irishman—her slender yet firmly lithe body.\n \n After a few days Dr. Jensen permitted him to have visitors. They came in a steady stream, the people from Four and men he had not seen since Training Base days, and although none could endure his semi-liquid atmosphere more than a few minutes at a time Barry enjoyed their visits.\n \n But the person for whom he waited most anxiously did not arrive. At each knock Barry's heart would leap, and each time he settled back with a sigh of disappointment. Days passed and still Dorothy did not come to him. He could not go to her, and stubborn pride kept him from even inquiring. All the while he was aware of Robson Hind's presence in the Colony, and only weakness kept him from pacing his room like a caged animal.\n \n Through his window he could see nothing but the gradual brightening and darkening of the enveloping fog as the slow 82-hour Venusian day progressed, but from his visitors' words he learned something of Venusian conditions and the story of the Colony.\n \n Number One had bumbled in on visual, the pilot depending on the smeary images of infra-sight goggles. An inviting grassy plain had proved to be a layer of algae floating on quicksand. Frantically the crew had blasted down huge balsa-like marsh trees, cutting up the trunks with flame guns to make crude rafts. They had performed fantastic feats of strength and endurance but managed to salvage only half their equipment before the shining nose of One had vanished in the gurgling ooze.\n \n Lost in a steaming, stinking marsh teeming with alien creatures that slithered and crawled and swam and flew, blinded by the eternal fog, the crew had proved the rightness of their choice as pioneers. For weeks they had floundered across the deadly terrain until at last, beside a stagnant-looking slough that drained sluggishly into a warm, almost tideless sea a mile away, they had discovered an outcropping of rock. It was the only solid ground they had encountered.\n \n One man had died, his swamp suit pierced by a poisonous thorn, but the others had hand-hauled the radio beacon piece by piece and set it up in time to guide Two to a safe landing. Houses had been assembled, the secondary power units of the spaceship put to work, and the colony had established a tenuous foothold.\n \n Three had landed beside Two a few months later, bringing reinforcements, but the day-by-day demands of the little colony's struggle for survival had so far been too pressing to permit extended or detailed explorations. Venus remained a planet of unsolved mysteries.\n \n The helicopter brought out in Three had made several flights which by radar and sound reflection had placed vague outlines on the blank maps. The surface appeared to be half water, with land masses mainly jungle-covered swamp broken by a few rocky ledges, but landings away from base had been judged too hazardous.\n \n Test borings from the ledge had located traces of oil and radioactive minerals, while enough Venusian plants had proven edible to provide an adequate though monotonous food source.\n \n Venus was the diametric opposite of lifeless Mars. Through the fog gigantic insects hummed and buzzed like lost airplanes, but fortunately they were harmless and timid.\n \n In the swamps wildly improbable life forms grew and reproduced and fought and died, and many of those most harmless in appearance possessed surprisingly venomous characteristics.\n \n The jungle had been flamed away in a huge circle around the colony to minimize the chances of surprise by anything that might attack, but the blasting was an almost continuous process. The plants of Venus grew with a vigor approaching fury.\n \n Most spectacular of the Venusian creatures were the amphibious armored monsters, saurian or semi-saurians with a slight resemblance to the brontosauri that had once lived on Earth, massive swamp-dwellers that used the slough beside the colony's ledge as a highway. They were apparently vegetarians, but thorough stupidity in tremendous bulk made them dangerous. One had damaged a building by blundering against it, and since then the colony had remained alert, using weapons to repel the beasts.\n \n The most important question—that of the presence or absence of intelligent, civilized Venusians—remained unanswered. Some of the men reported a disquieting feeling of being watched, particularly when near open water, but others argued that any intelligent creatures would have established contact.\n \n \n\n \n Barry developed definite external signs of what the Sigma radiation had done to him. The skin between his fingers and toes spread, grew into membranous webs. The swellings in his neck became more pronounced and dark parallel lines appeared.\n \n But despite the doctor's pessimistic reports that the changes had not stopped, Barry continued to tell himself he was recovering. He had to believe and keep on believing to retain sanity in the face of the weird, unclassifiable feelings that surged through his body. Still he was subject to fits of almost suicidal depression, and Dorothy's failure to visit him did not help his mental condition.\n \n Then one day he woke from a nap and thought he was still dreaming. Dorothy was leaning over him.\n \n \"Barry! Barry!\" she whispered. \"I can't help it. I love you even if you do have a wife and child in Philadelphia. I know it's wrong but all that seems so far away it doesn't matter any more.\" Tears glistened in her eyes.\n \n \"Huh?\" he grunted. \"Who? Me?\"\n \n \"Please, Barry, don't lie. She wrote to me before Three blasted off—oh, the most piteous letter!\"\n \n Barry was fully awake now. \"I'm not married. I have no child. I've never been in Philadelphia,\" he shouted. His lips thinned.\n\"I—think—I—know—who—wrote—that—letter!\" he declared grimly.\n \n \"Robson wouldn't!\" she objected, shocked, but there was a note of doubt in her voice.\n \n Then she was in his arms, sobbing openly.\n \n \"I believe you, Barry.\"\n \n She stayed with him for hours, and she had changed since the days at Training Base. Long months away from the patterned restraints of civilization, living each day on the edge of unknown perils, had awakened in her the realization that she was a human being and a woman, as well as a toxicologist.\n \n When the water-mist finally forced her departure she left Barry joyous and confident of his eventual recovery. For a few minutes anger simmered in his brain as he contemplated the pleasure of rearranging Robson Hind's features.\n \n The accident with the scaffold had been remarkably convenient, but this time the ruthless, restless, probably psychopathic drive that had made Robson Hind more than just another rich man's spoiled son had carried him too far. Barry wondered whether it had been inefficiency or judiciously distributed money that had made the psychometrists overlook some undesirable traits in Hind's personality in accepting him for the Five Ship Plan.\n \n But even with his trickery Hind had lost.\n \n He slept, and woke with a feeling of doom.\n \n The slow Venusian twilight had ended in blackness and the overhead tubelight was off.\n \n He sat up, and apprehension gave way to burning torture in his chest.\n \n Silence! He fumbled for the light switch, then knelt beside the mist machine that no longer hummed. Power and water supplies were both dead, cut off outside his room.\n \n Floating droplets were merging and falling to the floor. Soon the air would be dry, and he would be choking and strangling. He turned to call for help.\n \n The door was locked!\n \n He tugged and the knob came away in his hand. The retaining screw had been removed.\n \n He beat upon the panel, first with his fists and then with the metal doorknob, but the insulation between the double alloy sheets was efficient soundproofing. Furiously he hurled himself upon it, only to bounce back with a bruised shoulder. He was trapped.\n \n Working against time and eventual death he snatched a metal chair and swung with all his force at the window, again, again, yet again. A small crack appeared in the transparent plastic, branched under continued hammering, became a rough star. He gathered his waning strength, then swung once more. The tough plastic shattered.\n \n He tugged at the jagged pieces still clinging to the frame. Fog-laden Venusian air poured in—but it was not enough!\n \n He dragged himself head first through the narrow opening, landed sprawling on hands and knees in the darkness. In his ears a confused rustling drone from the alien swamp mingled with the roar of approaching unconsciousness.\n \n There was a smell in his nostrils. The smell of water. He lurched forward at a shambling run, stumbling over the uneven ground.\n \n Then he plunged from the rocky ledge into the slough. Flashes of colored light flickered before his eyes as he went under. But Earth habits were still strong; instinctively he held his breath.\n \n Then he fainted. Voluntary control of his body vanished. His mouth hung slack and the breathing reflex that had been an integral part of his life since the moment of birth forced him to inhale.\n \n Bubbles floated upward and burst. Then Barry Barr was lying in the ooze of the bottom. And he was breathing, extracting vital oxygen from the brackish, silt-clouded water.\n \n \n\n III\n \n Slowly his racing heartbeat returned to normal. Gradually he became aware of the stench of decaying plants and of musky taints he knew instinctively were the scents of underwater animals. Then with a shock the meaning became clear. He had become a water-breather, cut off from all other Earthmen, no longer entirely human. His fellows in the colony were separated from him now by a gulf more absolute than the airless void between Earth and Venus.\n \n Something slippery and alive touched him near one armpit. He opened his eyes in the black water and his groping hand clutched something burrowing into his skin. With a shudder of revulsion he crushed a fat worm between his fingers.\n \n Then dozens of them—hundreds—were upon him from all sides. He was wearing only a pair of khaki pants but the worms ignored his chest to congregate around his face, intent on attacking the tender skin of his eyelids.\n \n For a minute his flailing hands fought them off, but they came in increasing numbers and clung like leeches. Pain spread as they bit and burrowed, and blindly he began to swim.\n \n Faster and faster. He could sense the winding banks of the slough and kept to midchannel, swimming with his eyes tightly closed. One by one the worms dropped off.\n \n He stopped, opened his eyes, not on complete darkness this time but on a faint blue-green luminescence from far below. The water was saltier here, and clearer.\n \n He had swum down the slough and out into the ocean. He tried to turn back, obsessed by a desire to be near the colony even though he could not go ashore without strangling, but he had lost all sense of direction.\n \n He was still weak and his lungs were not completely adjusted to underwater life. Again he grew dizzy and faint. The slow movements of hands and feet that held him just below the surface grew feeble and ceased. He sank.\n \n Down into dimly luminous water he dropped, and with his respiratory system completely water-filled there was no sensation of pressure. At last he floated gently to the bottom and lay motionless.\n \n Shouting voices awakened him, an exultant battle cry cutting through a gasping scream of anguish. Streaks of bright orange light were moving toward him in a twisting pattern. At the head of each trail was a figure. A human figure that weaved and swam in deadly moving combat. One figure drifted limply bottomward.\n \n Hallucination, Barry told himself. Then one of the figures broke from the group. Almost overhead it turned sharply downward and the feet moved in a powerful flutter-kick. A slender spear aimed directly at the Earthman.\n \n Barry threw himself aside. The spear point plunged deep into the sticky, yielding bottom and Barry grappled with its wielder.\n \n Pointed fingernails raked his cheek. Barry's balled fist swung in a roundhouse blow but water resistance slowed the punch to ineffectiveness. The creature only shook its head and came in kicking and clawing.\n \n Barry braced his feet against the bottom and leaped. His head butted the attacker's chest and at the same instant he lashed a short jab to the creature's belly. It slumped momentarily, its face working.\n \n Human—or nearly so—the thing was, with a stocky, powerful body and webbed hands and feet. A few scraps of clothing, seemingly worn more for ornament than covering, clung to the fishbelly-white skin. The face was coarse and savage.\n \n It shook off the effects of Barry's punch and one webbed hand snatched a short tube from its belt.\n \n Barry remembered the spring-opening knife in his pocket, and even as he flicked the blade out the tube-weapon fired. Sound thrummed in the water and the water grew milky with a myriad of bubbles. Something zipped past his head, uncomfortably close.\n \n Then Barry struck, felt his knife slice flesh and grate against bone. He struck again even as the undersea being screamed and went limp.\n \n Barry stared through the reddening water.\n \n Another figure plunged toward him. Barry jerked the dead Venusian's spear from the mud and raised it defensively.\n \n But the figure paid no attention. This one was a female who fled desperately from two men closing in from opposite sides. One threw his spear, using an odd pushing motion, and as she checked and dodged, the other was upon her from behind.\n \n One arm went around her neck in a strangler's hold, bending her slender body backward. Together captor and struggling captive sank toward the bottom. The other recovered his thrown spear and moved in to help secure her arms and legs with lengths of cord.\n \n One scooped up the crossbow the girl had dropped. The other ripped at her brief skirt and from her belt took a pair of tubes like the one the dead Venusian had fired at Barry, handling them as though they were loot of the greatest value. He jerked cruelly at the slender metallic necklace the girl wore but it did not break.\n \n He punched the helpless girl in the abdomen with the butt of his spear. The girl writhed but she did not attempt to cry out.\n \n Barry bounded toward them in a series of soaring leaps, knife and spear ready. One Venusian turned to meet him, grinning maliciously.\n \n Barry dug one foot into the bottom and sidestepped a spear thrust. His own lunge missed completely. Then he and the Venusian were inside each other's spear points, chest to chest. A pointed hook strapped to the inside of the creature's wrist just missed Barry's throat. The Earthman arched his body backward and his knife flashed upward. The creature gasped and pulled away, clutching with both hands at a gaping wound in its belly.\n \n The other one turned too late as Barry leaped.\n \n Barry's hilt cracked against its jawbone.",
      "metadata": {
        "title": "The Lost Tribes of Venus",
        "author": "Erik Fennel",
        "passage_id": "63932",
        "uid": "f2ba11d3aa954960bc45945964d3d327",
        "license": "This eBook is for the use of anyone anywhere in the United States and most other parts of the world at no cost and with almost no restrictions whatsoever. You may copy it, give it away or re-use it under the terms of the Project Gutenberg License included with this eBook or online at www.gutenberg.org. If you are not located in the United States, you’ll have to check the laws of the country where you are located before using this ebook. Please refer to https://www.gutenberg.org/policy/license.html for the detailed license.",
        "split": "test",
        "questions": [
          {
            "question_text": "What is the plot of the story?",
            "question_number": 1,
            "responses": [
              {
                "worker_id": "6",
                "uid": "dcbefca8556f4e9db603806b2b953d91",
                "response_text": "Engineer Barry Barr is one of the chosen few to ride on Number Three to Venus. His beloved Dorothy Voorhees would have been riding with him, but Barry had a piece of scaffolding drop on his ankle. Unable to make the first flight, Barry hops onto Number Four instead. \nOn the journey to Venus, a small meteor crashes into their hull at several hundreds of miles an hour. The effect is immediate: Ryan is killed in the jet room and traces of the meteor are stuck in the field. Barry wakes up when the alarm bells are sounded, and rushes to join the rest of the crew to figure out what’s going on. Nick Podtaguine is steering the ship with emergency controls while Captain Reno looks on. Once the jet room stabilized, Captain Reno opens the doors to find Ryan’s body and ruin. After fixing all that they could, Reno hit the accelerator, only to watch in dismay at it soared out of proportions. Captain Reno cut off the power, realizing that the meteor had left metal particles in the cylinder of force. He asks for volunteers to work outside of the ship and remove all traces of the meteor. No one volunteers at first because of how dangerous a task it is; Sigma radiation affects man in ways still unknown and incurable. After Robson Hind turns the task down, Barry volunteers. He steps outside in his spacesuit equipped to block radiation and removes them with the chisel. \nOnce he returns inside, he falls asleep and wakes a day later already feeling the effects of the radiation. His symptoms only increase: dryness, heat, and breathing difficulties. He faints upon standing and realizes that the Sigma radiation had seeped into his spacesuit. \nFour heads toward Venus while Barry suffers from an insatiable thirst. Finally, upon landing, they throw open the doors to let in the muggy Venusian air, and Barry feels like he can breathe again. Two and Three welcome them, and Barry throws his arms around Dorothy before fainting. Dr. Carl Jensen gives him water which Barry inhales. He’s growing gills on the sides of his neck, and dry air is becoming more intolerable. \nBarry asks Nick to build him a machine to let in moisture, allowing him to breathe better. He grows webbed fingers and toes. Dorothy doesn’t visit him while in hospital until she can’t bear it anymore. She bursts open the door and reveals she still loves him even though he has a wife and family back in Philadelphia. Barry reveals the falsehood and believes that Hind sent her a letter detailing this lie. One night, he wakes up to realize his moisture machine was broken and the door locked. He escapes by breaking the window and runs to the water. He dives in and inhales the water. Worms attack him, but he swims away to the ocean. He battles humanoid Venusians and kills one of them. He rescues a girl from being robbed. \n"
              },
              {
                "worker_id": "2",
                "uid": "4748ffd4b01d43279837a44ec0eb264b",
                "response_text": "People are settling Venus, and those aboard ship Four have a close call when the ship is struck by a meteorite that damages the accelerators and leaves metal in a shaft. After the accelerator is repaired under the leadership of Robson Hind, they discover the metal. Barry Barr volunteers to do the spacewalk to remove the metal that is wedged in the shaft since he is unassigned on this voyage. Assigned members are considered unexpendable, so they are expected to stay and protect the ship. The spacewalk is dangerous due to the high concentration of deadly Sigma outside. Although their spacesuits have Kendall shields, no one knows how effective they are. Animals briefly exposed to Sigma die almost right away. Barr completes the work and returns to a hero’s welcome. \n\tSoon, Barr begins feeling strange. He’s ravenously hungry, extremely thirsty, and having difficulty breathing. He tries to eat, but the sense that the air is extraordinarily hot and dry makes it harder for him to breathe, and he passes out. However, when the ship reaches Venus, Barr breathes in the hot, humid air, and his breathing becomes much less labored. Feeling stronger, he seeks out the woman he loves, Dorothy Voorhees, who arrived at the colony on Three. They kiss, but then he passes out again, and when he wakes, Barr asks for water which he pours into his lungs. The doctor tells him that would normally kill a person. Barr scratches his neck and notices something growing there, which the doctor identifies as the beginnings of gills.\n\tBarr asks his friend to gather materials and build him a humidifier in the infirmary. With this device, Barr can breathe better. Barr longs to see Dorothy, especially since he knows Robson Hind is probably wooing her; the two men have been competing for her affections. At last, Dorothy comes to see him, claiming she loves him and can’t stay away even though he is married and has a child. Barr isn’t married and suspects that Hind planted the story to win Dorothy for himself. Later that night, Barr awakens, unable to breathe. An investigation shows that his humidifier’s water and power lines have been cut, and the door to his room is locked from the outside. Barr knocks out the window with a chair, runs outside, and dives into the slough. There, at last, he can breathe. He realizes that he has become a water breather, meaning he is no longer completely human. He stays in the slough until some worms start biting his eyelids, then makes his way to the ocean. He wants to stay close to the colony even though he can’t breathe on land anymore, but suddenly a group of human-like creatures with webbed fingers and toes like his descend on him and begin attacking with their spears and tube weapons. He kills one but sees two other males capture a female, and Barr attacks her attackers.\n"
              },
              {
                "worker_id": "8",
                "uid": "7c387ce31580462ba8895de2e3205359",
                "response_text": "Barry Barr is a structural engineer serving on Number Four, a ship taking part in the Five Ship Plan headed for Venus. The Five Ship Plan had been designed to avoid filling one ship to critical mass with fuel; instead, five ships would fill their tanks as much as safely possible, land on Venus, and the ship that had sustained the least amount of damage would take on the fuel reserves of the other four for the return trip to Earth unless a successful colony could be established on Venus. Barry had originally been assigned to Number Three, but an ankle injury caused him to take the later ship. A meteorite strikes Number Four, and since Barry is unassigned and therefore expendable, he goes outside the ship to remove the debris in spite of the dangerous presence of Sigma radiation, which had been known to kill animals. As he is outside, he thinks about Dorothy Voorhees, a toxicologist on Number Three with whom Barry is in love. The wealthy jet chief Robson Hind is also in love with Dorothy, although Dorothy only has a shallow interest in what he has to offer. Barry's spacesuit offers minimal protection against the radiation, and when he returns, he discovers he has indeed developed a kind of sickness that causes him to struggle to breathe in the ship's air. When Number Four finally lands on Venus, Barry is surprised to discover he can breathe much easier in the thick, humid atmosphere there. As Number Four reconnects with the makeshift colony the previous ships have constructed, Barry is reunited with Dorothy briefly before passing out. Dr. Carl Jensen examines Barry and keeps him on bed rest for several days. When Barry awakens, he recruits his friend Nick to help him fashion a machine that will transfer the Venusian atmosphere into his room so that he may breathe easier. Dr. Jensen is shocked at the physical changes in Barry; over time, he grows gills and webbed feet. Finally, Dorothy visits him in his room and reveals her true love for him; she had been hesitant to do so because she had received a communication from his wife in Philadelphia revealing Barry was married with a child. This news surprises Barry since he is not married; Robson must have written the letter to drive a wedge between him and Dorothy. When Barry awakens the next day, he discovers his door is locked and the machine drawing Venusian air into his room has been shut off. Desperate to breathe, Barry breaks out of his room and jumps into the nearby slough, where he is attacked by hundreds of hostile worms. He swims further out into an ocean, amazed by his ability to breathe underwater. Underwater, Barry runs into two Venusians who attack him and a female Venusian. Barry helps her and saves himself by fighting off the attackers."
              },
              {
                "worker_id": "3",
                "uid": "e854602b5b054704bce4ede3cda0b1a7",
                "response_text": "The spaceship Number Four is in free fall; its crew is doing everything they can to get it working again. As they tend to various systems, the outside threat is brought to the reader's attention: Sigma radiation, which is not well understood by humans but it is known to be dangerous. Barry Barr is selected to leave the ship to clear the meteorite debris for the sake of the crew. He works on cutting the meteorite debris, reflecting on the growing tension between himself and Robson Hind, the jet chief, over their mutual interest in Dorothy Voorhees, the dietician and toxicologist. Barry wakes up later feeling like he doesn't have enough air, and searches for a meal. As he tries to eat, he realizes he can't breathe, and it occurs to him that his suit's Kendall-shield, which was supposed to protect him from Sigma radiation, had leaked. Nobody knew quite what would happen to Barry after exposure to Sigma radiation. His breathing got worse over time and nobody could do anything for him without a doctor. The ship successfully lands on Venus, and Barry finds that the humid atmosphere makes it easier for him to breathe. He finds Dorothy, kissing her before Robson Hind shows up, then passes out and wakes up in a doctor's office. Barry inhales the water he was handed (literally ingesting it), surprising the doctor, who doesn't know what to do for Barry. They notice gills on Barry's neck, and Barry passes out again. Barry asks Nick Podtaguine, the mechanic, for help in building a machine. It seems Barry is now known for having saved the ship, so Nick figures he can get all the materials he needs, which only took him eight hours. The machine keeps Barry's room wet while keeping the excess water off of the floor. Barry recovers some energy now that he can breathe, and dreams of Dorothy Voorhees as he rests. He starts to develop webs on his hands and feet, and a full set of gills, but Dorothy still comes to visit him one day after having avoided Barry the entire time he'd been under the doctor's care. This helps his mood, but then he wakes up one day finding his machine turned off, and is unable to escape. Eventually he breaks a plastic window but the air doesn't have enough moisture for him, so he breaks out and jumps into the water. He faints again, inhales, and realizes his gills work just fine, which also makes him realize he is officially no longer human. He swims away from some worms who are interested in his eyelids, and eventually makes it to the ocean even though he wants to stay near the people. His lungs have not adjusted yet so he sinks again, awoken by yells of people. Barry finds a creature who looked a lot like Barry, with webbed limbs and pieces of clothing. The story ends in a skirmish with various Venusians and one other Earthman. "
              }
            ]
          },
          {
            "question_text": "What changes does Barry Barr undergo throughout the story?",
            "question_number": 2,
            "responses": [
              {
                "worker_id": "6",
                "uid": "dcbefca8556f4e9db603806b2b953d91",
                "response_text": "Barry Barr transforms from a regular human male to a creature that breathes underwater and requires moisture to survive. After being exposed to Sigma radiation while removing particles from the outer hull of Four, Barry began to feel changes in his body. Air felt dry and hot in his lungs and he quickly developed shortness of breath. Fainting spells ensued and breathing difficulties. Once they arrived on Venus, Dr. Carl Jensen gave a grave diagnosis of the unknown. Barry developed dark marks on both sides of his neck, which soon transformed into gills. Webbing grew between his fingers and toes, and his revulsion to dry air only grew. He built a moisture machine to keep in his room so he could breathe comfortably. But it still wasn’t enough. On the night he was trapped inside of the dry room, he broke out and escaped to the water. Although his lungs weren’t fully adjusted to breathing water, he took off like a rocket and battled several Venusian creatures with ease. Barry goes from completely human to a humanoid merman of sorts. "
              },
              {
                "worker_id": "2",
                "uid": "4748ffd4b01d43279837a44ec0eb264b",
                "response_text": "After volunteering for the spacewalk to remove the meteorite debris, Barr wakens from a nap unusually hungry and has trouble breathing the air on the ship. As he tries to eat, he notices a sense of heat and dryness that bothers him so much that it becomes difficult to breathe. When his meal is over, he loses consciousness just after it dawns on him that the Kendall-shield on his spacesuit had leaked. Barr suffers delirium, fever, fainting spells, and unquenchable thirst; all the while, breathing becomes increasingly difficult for him. After drawing a plan, his friend Nick builds a humidifier for Barr, which keeps his room so humid that water is dripping off the walls; this enables him to breathe more freely. When he gets a glass of water, he pours it down his throat while breathing, meaning the water goes into his lungs. The doctor doesn’t know what is happening to Barr, but he tells him that if a normal person poured water in their lungs like that, they would die of a coughing spasm or congestive pneumonia. Once they land on Venus, however, Barr can breathe easily due to the humid air. Barr also has rudimentary gills growing on the sides of his neck, and webbed skins begin growing between his fingers and toes as his gills develop further. When Hinds cuts off the humidifier to Barr’s room and locks him in, Barr would have died if he hadn’t been able to break the window and get out. Even then, his gills have developed so much that the Venusian air doesn’t completely take care of his needs. Not until he submerges himself in the water of the slough can Barr breathe freely. When he makes his way to the ocean, he encounters creatures who are nearly human but who, like Barr, have webbed fingers and toes, so it appears that Barr has become a Venusian.\n"
              },
              {
                "worker_id": "8",
                "uid": "7c387ce31580462ba8895de2e3205359",
                "response_text": "Barry had been chosen for the Five Ships Plan because of his structural engineering expertise as well as his experience in tropical climates. His job in the Venus Colony would be to repurpose the ships that would be left behind on Venus into useful items as well as to study native Venusian materials. After stepping out into space to remove the debris from the outside of Number Four, Barry succumbs to Sigma radiation poisoning and begins to physically transform. At first, he has difficulty breathing in the air pumped through the spaceship. When Number Four lands on Venus, he is pleased to discover the thick humidity eases the choking in his throat. But the water in the atmosphere is not enough, and he continues to experience severe pains in his body as the change continues. Dr. Carl Jensen helps him through this process; he initially identifies the darkening patch on the sides of his neck as rudimentary gills. In addition, Barry develops webbed feet. Although his love for Dorothy has motivated Barry to push through adversity to arrive safely on Venus, he begins to realize that his physical developments are going to become a permanent barrier between his old reality and his new one. He can no longer breathe on land, so he desperately plunges into the water. As he swims into the ocean, his lungs fill with water and he can breathe easier. He also runs into the elusive Venusian natives, who look much like humans with bodies adapted to life underwater. This will likely become Barry's new home."
              },
              {
                "worker_id": "3",
                "uid": "e854602b5b054704bce4ede3cda0b1a7",
                "response_text": "Before the story begins, Barry volunteers for the Five Ship Plan with his experience in tropical conditions making him a good fit. At the Training Base, he meets Dorothy Voorhees who he falls for, but Robson Hind is also interested, so Barry doesn't trust Robson. At the start of the story, Barry wakes up with the ship in free fall and works with the rest of the crew to stabalize whatever systems they can. After he is exposed to Sigma radiation, it gets harder and harder for him to breathe over time. In the early stages, he faints a lot, and develops a fever, becomes delirious, and has an unquenchable thirst. When he is exposed to Venusian air, it becomes easier for him to breathe and his chest pains become more manageable. After he passes out again, he starts inhaling water to put it straight into his lungs, surprising his doctor, which leads to him noticing the gills developing on his neck. His hands and feet grow webs as his gills developed further, and his depression gets worse through the transformation. He wakes up one day to find his machine has been turned off, andd has to break out of the room and jump into the water to save himself, where he learns that his gills work perfectly well. He finds he is much more comfortable underwater even though he still needs more time to adapt to these changes, as his lungs are still strained very quickly which impacts his endurance."
              }
            ]
          },
          {
            "question_text": "Describe Venus and the creatures on its surface.",
            "question_number": 3,
            "responses": [
              {
                "worker_id": "6",
                "uid": "dcbefca8556f4e9db603806b2b953d91",
                "response_text": "Venus is a hot and muggy planet, most comparable to certain areas of South America. The air is so moist and hot that many of the colonists when arrived felt as though they were melting or wading through a swamp. Much of the planet is covered in swamps and marshes, while only a small portion is made up of solid rock or land. The air teems with buzzing insects and creatures roam the surface of the planet. Large vegetarian Venusian creatures roam solid ground, and, though they aren’t going to eat the humans, their humongous size can make them a danger to have around. Different creatures reside in the swamps and oceans as well. Flesh-eating worms lie deep in the swamps, while humanoid Venusians live out in the open ocean. "
              },
              {
                "worker_id": "2",
                "uid": "4748ffd4b01d43279837a44ec0eb264b",
                "response_text": "Venus has a climate like a tropical swamp, sweltering and extremely humid, and the air is thick with the foul odor of decaying plants. Much of the planet is covered with swamps and mud so that the colony has to set up on a rock ledge that rises out of the marsh. Days on Venus last 82 hours. Trees grow in the marshes, and there are areas of quicksand covered with green algae that look like grassy plains. Some plants are edible by humans, but there is also a plant with a poisonous thorn that killed a man. Plants grow rapidly due to the climate. The stagnant slough drains into a waveless, saltwater ocean. Approximately half of the surface is covered with water. The land areas are either rocky ledges or jungle-covered swamps. Tests indicate that there are traces of oil and radioactive minerals. \n\tMany different types of creatures live on Venus. In the marsh, there are creatures that slither and crawl, swim, and fly. Gigantic insects fly around but are harmless and avoid the humans. There are varied creatures in the swamps; the ones that look harmless tend to be the most venomous. One particularly interesting creature somewhat resembles the brontosauri of Earth and are amphibious, armored monsters. They are vegetarians and don’t bother the humans except that they can be clumsy and step on or fall against a human structure damaging it. In the early days, there is no sign of intelligent life, but some of the men report having a sense of being watched. One particularly bothersome creature is a fat worm that lives in the slough; when Barr is in the slough, these worms attach themselves to his eyelids and bite them, clinging to him like leeches.\n\tIn the ocean, however, Barr encounters human-like creatures like himself, with webbed fingers and toes. They wield weapons like spears and other tubelike weapons that fire underwater, creating a trail of bubbles as they move rapidly toward the prey. These human-like beings attack Barr, and he notices they wear clothes. They bleed a red substance when they are injured and have bones that Barr feels when he strikes one with a knife. There are both male and female creatures.\n"
              },
              {
                "worker_id": "8",
                "uid": "7c387ce31580462ba8895de2e3205359",
                "response_text": "Venus is hot and extremely humid and covered with the aroma of decaying vegetation. The complete opposite of Mars' deserted, dry landscape, Venus is home to a wide variety of flora and fauna. Half of the planet is covered in water, including marshes, swamps, sloughs, and vast oceans with murky water. There are few areas of rock ledges where the crews of the Five Ship Plan build their colony. Many kinds of harmless insects fly about the swamps, but there are several poisonous plants, one of which kills a crew member from Number One. A species of massive, swamp-dwelling, amphibious, dinosaur-like creatures move about close to the makeshift colony; because of their lack of intelligence and immense, armored bodies, the creatures can be quite dangerous and actually have damaged one of the colony's buildings. When Barry first dives into the slough, he is immediately attacked by a horde of worms attempting to burrow into his skin. Later, he discovers the native Venusians, who look like humans, carry spears and tube-weapons, and move rapidly through the water with powerful bodies and webbed hands. "
              },
              {
                "worker_id": "3",
                "uid": "e854602b5b054704bce4ede3cda0b1a7",
                "response_text": "Venus' surface is covered in mists and creatures unfamiliar to people from Earth. Dorothy Voorhees is a toxicologist and dietitian specifically assigned to the mission to guide the humans through the flora and fauna of Venus in a way that their digestive systems wouldn't entirely object to. The fact that she was hired points to the humans knowing they would face unknowns. The plants that had been discovered before Barry arrived were edible but not interesting. What looked like a grassy plain was really quicksand covered in algae, which meant the colonists had lost many supplies while making this discovery. The wood from the trees was used to create crafts, and various types of buildings and support structures. There is one piece of solid ground (rock, specifically) that the men were able to find, though it was still surrounded by swamps. In the heavy mists of the humid swamplands are a variety of insects that were far more annoying than harmful. There are larger creatures, too, the most exciting being large swamp creatures that resembled dinosaurs, who were vegetarian but large and dumb enough to pose great danger to the humans. \n"
              }
            ]
          },
          {
            "question_text": "Who is Robson Hind and what happens to him throughout the story?",
            "question_number": 4,
            "responses": [
              {
                "worker_id": "6",
                "uid": "dcbefca8556f4e9db603806b2b953d91",
                "response_text": "Robson Hind is a very wealthy man and jet chief of Number Four. The son of the manager of Hoskins Corporation, Hind was basically guaranteed a spot in the Five Ship Plan. Just like Barry Barr, he was instantly attracted to Dorothy Voorhees and her jet-black hair, high cheekbones, and intelligence. Before their ships take off, Hind conspires to join her on Number Three or transfer her to Number Four. However, his scheme eventually fails. Before Three lifts off, he sends Dorothy a letter pretending to be Barry’s imaginary wife from Philadelphia, asking her to stay away from him so his wife and children can still have him. This works for a time in keeping Dorothy away from Barry. Once again, however, Hind’s scheme ultimately fails once they arrive on Venus and Dorothy is near Barry again. \nWhile on Number Four, Hind refuses to exit the spaceship to work on the meteor shards, citing his assigned status. When Barry volunteers, Hind is secretly happy, almost as if he wants him out of the picture for good. \nAfter their arrival on Venus, Dorothy stays away from Barry for a time, but eventually runs into his hospital room and embraces him. She discovers that Hind’s letter was a lie and rushes into Barry’s arms for good. Presumably, once Hind discovered this, he dismantled Barry’s life-saving moisture machine and locked him in the room to die. \n"
              },
              {
                "worker_id": "2",
                "uid": "4748ffd4b01d43279837a44ec0eb264b",
                "response_text": "Robson Hind is the jet chief of Four, the fourth of the five ships sent to Venus under the Five Ship Plan. As a member of the Five Ship Plan, he has been vetted both for his jobs skills and his personality and sense of responsibility, but he is uncouth, unethical, and self-centered. He is the son of the business manager of the Hoskins Corporation which holds a large share in the Five Ship Plan. Additionally, he is competing with Barry Barr for the affections of the beautiful young woman, Dorothy Voorhees. Dorothy likes Barry, but she can’t help but be impressed by the smooth-talking Hinds whose wealth enables him to entertain her in style. When Dorothy is assigned to ship Three, Hinds tries to have her reassigned to Four and then himself to Three, neither of which works. \n\tAlthough Hinds knows his job, he is questionable in his suitability for the Five Ship Plan. As Number Four descends toward Venus, a meteorite sideswipes the ship, and a few pieces break off and fuse themselves to the nonmetallic tube casing of a nozzle, causing the driver to overload, sending heat and radiation into the compartment and killing the person in there. Once they can enter the compartment, Hinds hangs back and enters last. He is responsible for changing the accelerators and afterward throws the switch confidently only to have the system almost overload again before he switches it off. Hinds determines the problem is metal in the field, which will require someone to go outside the ship and cut it out. This is a dangerous job because of the high levels of Sigma concentration that are known to kill lab animals with just a brief exposure. What isn’t known is how well a spacesuit will protect a human. Everyone waits to see who will volunteer, and their eyes turn to Hinds, who quickly reminds them he is assigned and therefore not expendable. Barry Barr volunteers since he is unassigned.\n\tWhen Barr is under the doctor’s care, he desperately wants to see Dorothy, and when she finally comes, she claims she can’t stay away because she loves him too much, even if he has a wife and child. She received a letter just before Three blasted off. Barr isn’t married, and he strongly suspects that Hinds is behind the fake letter. Hinds is also responsible for almost killing Barr by cutting the power and water to the humidifier that keeps him alive and locking the door so Barr can’t escape.\n"
              },
              {
                "worker_id": "8",
                "uid": "7c387ce31580462ba8895de2e3205359",
                "response_text": "Robson Hind is the jet chief of Number Four as well as the electronics expert for Venus Colony. He is young, handsome, and wealthy. The sole child of the business manager of Hoskins Corporation, Hind's position with the Five Ship Plan could be attributed to the fact that his father's business held a large share of it. When the meteorite strikes Number Four, Hind immediately says he cannot go outside to fix it because he has an assignment on the ship, and he is non-expendable. He barely conceals a smile when Barry offers to take care of it instead. Like Barry, Hind is attracted to Dorothy Voorhees. However, in spite of his charms and his lavish doting, Hind fails to capture Dorothy's heart because she senses something she does not like in his personality. This shrewdness of character perception turns out to be quite accurate when Hind writes a letter to Dorothy pretending to be Barry's non-existent wife revealing herself to Dorothy and telling her that Barry also has a child in Philadelphia. This only delays Dorothy's confession of love to Barry, so Hind steps up his efforts to keep the two separated. He locks Barry in his room and disables the machine that had been supplying Venusian air for Barry to breathe. Although Hind's efforts to kill Barry fail, he does succeed in driving him away into the ocean where Barry will presumably stay."
              },
              {
                "worker_id": "3",
                "uid": "e854602b5b054704bce4ede3cda0b1a7",
                "response_text": "Robson Hind is a member of the crew of Number Four, where he serves as the jet chief, and will be the electronics expert for Venus Colony. He has bold, handsome features and gives the impression of being strong without being large. Hind is the one who cuts the power lines to prevent a second blowback while they're all trying to find a solution for their freefall. He is looked to for guidance throughout the problem-solving due to his leadership position, and was the best candidate to clear the Sigma radiation but defered the role to Barry Barr to protect himself. There is tension because Barry and Robson both like Dorothy Voorhees. Dorothy is under the impression that Barry is married to someone else, and it turns out Robson Hind likely is the one who planted this misinformation in her mind through writing a false letter."
              }
            ]
          },
          {
            "question_text": "Describe the Five Ship Plan.",
            "question_number": 5,
            "responses": [
              {
                "worker_id": "6",
                "uid": "dcbefca8556f4e9db603806b2b953d91",
                "response_text": "After discovering Mars and the moon, humanity decided to conquer yet another planet: Venus. However, Venus was too far away to safely carry the amount of fuel needed for a round trip mission. So, the Five Ship Plan evolved. Five rockets were to fly to Venus at separate intervals. Those who landed first would build a colony to live in and welcome the others to the surface of the planet. Once all five had arrived, they would figure out which ship was in the best shape and transfer all remaining fuel to that one. The colonists would head back home if Venus was completely uninhabitable, or remain on the planet for the time being, living out their lives on the colony. "
              },
              {
                "worker_id": "2",
                "uid": "4748ffd4b01d43279837a44ec0eb264b",
                "response_text": "The Five Ship Plan was devised as a way to provide travel to and from Venus and is a joint venture between the government and private groups. It is a clever solution to the problem of ships only holding enough fuel for a one-way trip to Venus. Under the plan, five ships make the journey carrying as much fuel as they possibly can and loaded with various cargo needed for survival on the planet. When all five are on Venus, the ship in the best condition will receive the remaining fuel left in the other ships to return to Earth. Barry Barr’s job will then be to repurpose the materials of the other ships into whatever the colony needs, such as a landing dock and launching ramp. Members of the Five Ship Plan are chosen for their expertise in their fields and their sense of responsibility. They are expected to be so committed to the mission that they are willing to sacrifice themselves so that the mission can succeed. Much of the code of the plan is based on the ancient Earth code for the sea and requires members to perform actions “for the safety of the ship.”"
              },
              {
                "worker_id": "8",
                "uid": "7c387ce31580462ba8895de2e3205359",
                "response_text": "The Five Ship Plan had been designed by a joint enterprise of government and private groups to establish the Venus Colony after humans successfully visited Mars. Because the fuel requirements to make the round trip from Earth to Venus would bring a ship to critical mass, five ships would fill their tanks as much as safely possible, land on Venus, and the ship that had sustained the least amount of damage would take on the fuel reserves of the other four for the return trip to Earth unless a successful colony could be established on Venus. The crews for the five ships needed to be responsible individuals and Barry was chosen for his familiarity with tropical conditions and his abilities as a structural engineer. His job in the Venus Colony would be to repurpose the ships that would be left behind on Venus into whatever would be needed as well as to study native Venusian materials. Dorothy Voorhees was the crew's toxicologist and dietician. Other crew members included Dr. Carl Jensen, Robson Hind, Nick Podtiaguine, and Captain Reno."
              },
              {
                "worker_id": "3",
                "uid": "e854602b5b054704bce4ede3cda0b1a7",
                "response_text": "The Five Ship Plan was developed by various private and government groups in an attempt to blow past the existing limitations on space travel. These are dangerous expeditions manned by specialists with strong senses of responsibility who the leaders of the Plan expect to be able to maintain themselves and their crews for long enough to make it to Venus, where the leftover fuel from all five ships would be combined to one for a return journey. The specifics of the return trip would depend on who made it to Venus, what they found there, and what they could establish in the Colony."
              }
            ]
          }
        ],
        "num_questions": 5,
        "document_length_words": 5641,
        "document_length_chars": 34139
      }
    }
  ]
}