{
  "item_metadata": {
    "item_id": "A_Dream_of_Old_Salem",
    "num_documents": 1
  },
  "documents": [
    {
      "content": "Sarah woke up screaming: “Help! Help! I didn’t do it!” As an older brother, I had become accustomed to teenage tantrums from time to time. But this was really different. She sounded really scared. I left my scrambled eggs and ran upstairs. Sarah was sitting up in her bed, pale and sweating. I gave her a reassuring hug, and was relieved to see the color return to her face. “What’s it all about, Sis?” She gave an indecisive grin; her cheeks hadn’t decided whether they would rise or fall. Her eyes were puffy and damp: “Promise you won’t laugh at me, Trip?” I was halfway to delivering a smart retort when I noticed her lips quivering. “Of course not, Sis,” I said. “Tell me what happened. A bad dream?” “Yeah. I’ve never had one like this before. Sure you want to hear about it?” I was all ears. Dad had left for an early round of golf, and I had just given Mom a peck on the cheek after she left the house to hunt for bargains at Wal-Mart. I was really the man of the house now. There wasn’t room for making fun of Sarah today. There was only a space, marked with by a transition into “Big Brother” mode. “Well, I’m almost ashamed to tell you, but it was too real.” She took a deep breath and collected her thoughts. “You remember when we were on vacation last summer?” “Sure, a great trip to Massachusetts. We went to Plymouth, Cape Cod, and Martha’s Vineyard. I’m still so happy we even made it to Salem!” A noise came from her throat. “Sarah, were you dreaming about that?” She swallowed the noise with a Gulp. “Not only that, Trip. I was there. I mean back then...caught up in the witch trials. They were accusing me of witchcraft!” I handed her the glass of water from her bureau. She took a long sip before she apprehensively continued: “It was all Abigail’s fault, Abigail Thope. She was thirteen, my age. She was one of the accusers, prosecuting me before Judge Hathorne; one of the first that launched the whole tragedy. She said that she had been bewitched ... And that I had done it!” “Really? That Judge Hathorne? The one who was the trial judge; the one who sent so many innocent people to the gallows?” Weren’t they ancestors of Nathaniel Hawthorne, who not only changed the spelling of his last name in remorse, but wrote The House of the Seven Gables about those terrible days?” I said hypothetically, reveling in an uncharacteristic literary moment. Sarah raised a confused eyebrow. Where’d he learn that, she must have been thinking. “Yes. That one. I was in the Judge’s house. You remember Trip? The one we visited last summer, Judge Corwin’s house?” She waited for me to nod. I answered “yes” with a head-shake. “This was when and where the accusations were made. You were there too, but only for a second. A crowd of people replaced you, and they were all dressed up for a part in The Crucible.” She stuttered in a baffled trance: “And so was I!” “How did you survive without you makeup,” I said in jest to lighten the mood. She smiled for the first time and playfully punched me in the arm. This Big Brother role is working out. “Anyway, it seemed to be a trial of some sort. Judge Hathorne was running the show. He said something about this being a first proceeding, one that would determine if there would be enough evidence to move along with a trial. Governor Phips had just arrived in the Massachusetts Bay Colony, he told us, and witchcraft was going to be finally — and firmly — stamped out; innocent, God-fearing people had nothing to fear — not in his courtroom. There were some other people in the courtroom, because it was a public proceeding, and the statement about the Governor seemed to get everyone’s attention.” At this point in Sarah’s description, I started to see the story. I was, in a sense, reliving her nightmare in my own waking images. I waited in anticipation for her voice to go from pause to play. “So Abigail was testifying. No, actually she went later,” she said, recalculating the events with her eyes in flight. Recollection kicked in when her daze hit the ceiling: “The first to testify was Adam Browne of nearby Danvers. Browne and his wife, Goodwife Browne, both gave their accounts, come to think of it. They were, they claimed, the victims of witchcraft. Every time Master Browne came near our house,” Sarah pointed at me and then targeted herself, “something dreadful would befall them: either he’d fall down, the cows wouldn’t produce milk, or the rye crops would rot. I remember noting — in my head — that Dad’s plan was to settle that farmstead after the Indian wars up north; once he made it there, he’d said he’d never leave it. And it was undoubtedly the finest farmstead in Danvers, a fact that everyone knew. It was probably the one thing no one would debate,” she added. I pictured and open field with ripe crops — and my father in the distance. “What happened at the trial?” “Mr Goodwin was questioned: ‘Wasn’t it true, Master Browne,’ the Judge asked, ‘that you had once tried to buy that homestead, but because Mr. Goodwin had a grant for the property from having been in the Colony’s militia during the Indian wars, priority went to him?” “Abigail had an outburst after she heard this. Though Master Browne’s admission was registered by the clerk of the court, it was lost in the uproar caused by Agatha, and had very little effect.” “Then his wife testified. Goodwife Browne was scared, she said, to even go near our homestead, from what her husband had told her, and so she had refused to do so. But that didn’t stop her from having her own outbursts. It even seemed to worry her husband, who looked overly concerned after she left the podium.” “When do you come in?” I interjected. “Right now. I took the stand and was also a witness. I felt alone without you, Mom, and Dad. I don’t know exactly why you weren’t there. It had something to do with a trip to Boston to buy some farm animals and material for Mom to make a dress for me and some pants for you, I think. Along the way, you were going to take a look at the college in Cambridge.” I thought of how happy I was to be in sweatpants from this century, and what my trip to Cambridge was like. “Anyway, none of you were there. That’s when it all started: after you left Danvers. Master Browne made his accusation, and an official showed up and marched me several miles to Judge Corwin’s house. I’ve never felt so scared and so completely alone.” The look on Sarah’s face was pained. “Well, I’m here now,” this big brother reassured. “I had my chance to testify, and of course I denied any witchcraft. I wouldn’t have a clue how to make an animal sick, and I wouldn’t do it if I did! I even said I wasn’t sure about witchcraft, which I think was the wrong thing to say. Judge Corwin frowned, and Judge Hathorne prosecuted me with his stare. As final proof, I even recited the Lord’s Prayer — and I did it perfectly. You remember from our visit, Trip, that witches aren’t supposed to be able to do that without a mistake? That calmed down the court, and I thought all would be well — until Abigail testified.” I tried to picture Abigail. She had black hair and black eyes; her frame was thin and her limbs dangled lifelessly when she shuffled to the stand. “She got into a real, foaming fit. Any psychiatrist around today would definitely have a field day trying to sort her out,” Sarah said with wide eyes. “Anyway, it was a very scary performance, if that is what it was. Her story was unbelievable because she didn’t know us, except in passing, and had never been to our house; and she had never even met the Brownes. Judge Hathorne took it all in, and then he looked at me with an expression that terrified me. He slowly put a black cap over his head, and asked if I had anything to say before he reached a judgement about whether the case should be referred to trial. ‘In that case,’ he said to me, ‘you’ll be taken forthwith to the town jail.’ Then I woke up.” “Don’t worry, Sis,” I said. “That dream won’t come back. And if it does, I’ll be there to tell Judge Hathorne exactly who the guilty party in his courtroom was. “Let’s go unscramble this over some cold, scrambled eggs.”",
      "metadata": {
        "original_metadata": {
          "case_id": "A Dream of Old Salem",
          "case_name": "A Dream of Old Salem",
          "author_name": "William Shepard",
          "author_url": "https://www.5minutemystery.com/author/BillShepard",
          "case_url": "https://www.5minutemystery.com/mystery/a-dream-of-old-salem",
          "mystery_text": "Sarah woke up screaming: “Help! Help! I didn’t do it!” As an older brother, I had become accustomed to teenage tantrums from time to time. But this was really different. She sounded really scared. I left my scrambled eggs and ran upstairs. Sarah was sitting up in her bed, pale and sweating. I gave her a reassuring hug, and was relieved to see the color return to her face. “What’s it all about, Sis?” She gave an indecisive grin; her cheeks hadn’t decided whether they would rise or fall. Her eyes were puffy and damp: “Promise you won’t laugh at me, Trip?” I was halfway to delivering a smart retort when I noticed her lips quivering. “Of course not, Sis,” I said. “Tell me what happened. A bad dream?” “Yeah. I’ve never had one like this before. Sure you want to hear about it?” I was all ears. Dad had left for an early round of golf, and I had just given Mom a peck on the cheek after she left the house to hunt for bargains at Wal-Mart. I was really the man of the house now. There wasn’t room for making fun of Sarah today. There was only a space, marked with by a transition into “Big Brother” mode. “Well, I’m almost ashamed to tell you, but it was too real.” She took a deep breath and collected her thoughts. “You remember when we were on vacation last summer?” “Sure, a great trip to Massachusetts. We went to Plymouth, Cape Cod, and Martha’s Vineyard. I’m still so happy we even made it to Salem!” A noise came from her throat. “Sarah, were you dreaming about that?” She swallowed the noise with a Gulp. “Not only that, Trip. I was there. I mean back then...caught up in the witch trials. They were accusing me of witchcraft!” I handed her the glass of water from her bureau. She took a long sip before she apprehensively continued: “It was all Abigail’s fault, Abigail Thope. She was thirteen, my age. She was one of the accusers, prosecuting me before Judge Hathorne; one of the first that launched the whole tragedy. She said that she had been bewitched ... And that I had done it!” “Really? That Judge Hathorne? The one who was the trial judge; the one who sent so many innocent people to the gallows?” Weren’t they ancestors of Nathaniel Hawthorne, who not only changed the spelling of his last name in remorse, but wrote The House of the Seven Gables about those terrible days?” I said hypothetically, reveling in an uncharacteristic literary moment. Sarah raised a confused eyebrow. Where’d he learn that, she must have been thinking. “Yes. That one. I was in the Judge’s house. You remember Trip? The one we visited last summer, Judge Corwin’s house?” She waited for me to nod. I answered “yes” with a head-shake. “This was when and where the accusations were made. You were there too, but only for a second. A crowd of people replaced you, and they were all dressed up for a part in The Crucible.” She stuttered in a baffled trance: “And so was I!” “How did you survive without you makeup,” I said in jest to lighten the mood. She smiled for the first time and playfully punched me in the arm. This Big Brother role is working out. “Anyway, it seemed to be a trial of some sort. Judge Hathorne was running the show. He said something about this being a first proceeding, one that would determine if there would be enough evidence to move along with a trial. Governor Phips had just arrived in the Massachusetts Bay Colony, he told us, and witchcraft was going to be finally — and firmly — stamped out; innocent, God-fearing people had nothing to fear — not in his courtroom. There were some other people in the courtroom, because it was a public proceeding, and the statement about the Governor seemed to get everyone’s attention.” At this point in Sarah’s description, I started to see the story. I was, in a sense, reliving her nightmare in my own waking images. I waited in anticipation for her voice to go from pause to play. “So Abigail was testifying. No, actually she went later,” she said, recalculating the events with her eyes in flight. Recollection kicked in when her daze hit the ceiling: “The first to testify was Adam Browne of nearby Danvers. Browne and his wife, Goodwife Browne, both gave their accounts, come to think of it. They were, they claimed, the victims of witchcraft. Every time Master Browne came near our house,” Sarah pointed at me and then targeted herself, “something dreadful would befall them: either he’d fall down, the cows wouldn’t produce milk, or the rye crops would rot. I remember noting — in my head — that Dad’s plan was to settle that farmstead after the Indian wars up north; once he made it there, he’d said he’d never leave it. And it was undoubtedly the finest farmstead in Danvers, a fact that everyone knew. It was probably the one thing no one would debate,” she added. I pictured and open field with ripe crops — and my father in the distance. “What happened at the trial?” “Mr Goodwin was questioned: ‘Wasn’t it true, Master Browne,’ the Judge asked, ‘that you had once tried to buy that homestead, but because Mr. Goodwin had a grant for the property from having been in the Colony’s militia during the Indian wars, priority went to him?” “Abigail had an outburst after she heard this. Though Master Browne’s admission was registered by the clerk of the court, it was lost in the uproar caused by Agatha, and had very little effect.” “Then his wife testified. Goodwife Browne was scared, she said, to even go near our homestead, from what her husband had told her, and so she had refused to do so. But that didn’t stop her from having her own outbursts. It even seemed to worry her husband, who looked overly concerned after she left the podium.” “When do you come in?” I interjected. “Right now. I took the stand and was also a witness. I felt alone without you, Mom, and Dad. I don’t know exactly why you weren’t there. It had something to do with a trip to Boston to buy some farm animals and material for Mom to make a dress for me and some pants for you, I think. Along the way, you were going to take a look at the college in Cambridge.” I thought of how happy I was to be in sweatpants from this century, and what my trip to Cambridge was like. “Anyway, none of you were there. That’s when it all started: after you left Danvers. Master Browne made his accusation, and an official showed up and marched me several miles to Judge Corwin’s house. I’ve never felt so scared and so completely alone.” The look on Sarah’s face was pained. “Well, I’m here now,” this big brother reassured. “I had my chance to testify, and of course I denied any witchcraft. I wouldn’t have a clue how to make an animal sick, and I wouldn’t do it if I did! I even said I wasn’t sure about witchcraft, which I think was the wrong thing to say. Judge Corwin frowned, and Judge Hathorne prosecuted me with his stare. As final proof, I even recited the Lord’s Prayer — and I did it perfectly. You remember from our visit, Trip, that witches aren’t supposed to be able to do that without a mistake? That calmed down the court, and I thought all would be well — until Abigail testified.” I tried to picture Abigail. She had black hair and black eyes; her frame was thin and her limbs dangled lifelessly when she shuffled to the stand. “She got into a real, foaming fit. Any psychiatrist around today would definitely have a field day trying to sort her out,” Sarah said with wide eyes. “Anyway, it was a very scary performance, if that is what it was. Her story was unbelievable because she didn’t know us, except in passing, and had never been to our house; and she had never even met the Brownes. Judge Hathorne took it all in, and then he looked at me with an expression that terrified me. He slowly put a black cap over his head, and asked if I had anything to say before he reached a judgement about whether the case should be referred to trial. ‘In that case,’ he said to me, ‘you’ll be taken forthwith to the town jail.’ Then I woke up.” “Don’t worry, Sis,” I said. “That dream won’t come back. And if it does, I’ll be there to tell Judge Hathorne exactly who the guilty party in his courtroom was. “Let’s go unscramble this over some cold, scrambled eggs.”",
          "answer_options": "(a) Abigail Thorpe; (b) Adam Browne; (c) Goodwife Browne; (d) Sarah Goodwin",
          "correct_answer": "(b) Adam Browne",
          "reveal_text": "There was no witchcraft, although all concerned, except Sarah, believed in it. What Adam Browne was guilty of was attempting to profit from the witch hunt in order to take over the Goodwin homestead, which he had long coveted and even tried to claim. His admission of that fact would now impeach his credibility as a witness.\nAbigail was one of the instigators of the trials, but she had no personal acquaintance of the Brownes, nor had she seen the Goodwin property. She therefore had no motive to back the Browne testimony (except for her belief in witchcraft), and she would fear reprisal for perjury in the court — and in her group of friends — if her testimony was shown to be groundless.\nGoodwife Browne had never seen the Goodwin homestead; in fact, she took care to stay away from it. She was, however, as susceptible to the beliefs of her time and circumstance as nearly everyone else in the community.\nSarah Goodwin, the dreamer, stated that she did not believe in witchcraft, and therefore turned the court against her. However, she was quite right in believing that in 1692, a perfect recitation of the Lord’s Prayer was something that a witch or warlock was not capable of doing.\nThe case against her should therefore have been dismissed on the spot. It’s a sad commentary on the fanaticism of the times. It recalls the case of Minister George Burroughs, a man who recited the Lord’s Prayer perfectly while at the gallows — but was hanged anyway.",
          "attempts": 958,
          "solve_rate": 36.7,
          "text_length": 8120,
          "puzzle_data": {
            "case_name": "A Dream of Old Salem",
            "case_url": "https://www.5minutemystery.com/mystery/a-dream-of-old-salem",
            "author_name": "William Shepard",
            "author_url": "https://www.5minutemystery.com/author/BillShepard",
            "attempts": "958",
            "solve_rate": "36.7",
            "mystery_text": "Sarah woke up screaming: “Help! Help! I didn’t do it!” As an older brother, I had become accustomed to teenage tantrums from time to time. But this was really different. She sounded really scared. I left my scrambled eggs and ran upstairs. Sarah was sitting up in her bed, pale and sweating. I gave her a reassuring hug, and was relieved to see the color return to her face. “What’s it all about, Sis?” She gave an indecisive grin; her cheeks hadn’t decided whether they would rise or fall. Her eyes were puffy and damp: “Promise you won’t laugh at me, Trip?” I was halfway to delivering a smart retort when I noticed her lips quivering. “Of course not, Sis,” I said. “Tell me what happened. A bad dream?” “Yeah. I’ve never had one like this before. Sure you want to hear about it?” I was all ears. Dad had left for an early round of golf, and I had just given Mom a peck on the cheek after she left the house to hunt for bargains at Wal-Mart. I was really the man of the house now. There wasn’t room for making fun of Sarah today. There was only a space, marked with by a transition into “Big Brother” mode. “Well, I’m almost ashamed to tell you, but it was too real.” She took a deep breath and collected her thoughts. “You remember when we were on vacation last summer?” “Sure, a great trip to Massachusetts. We went to Plymouth, Cape Cod, and Martha’s Vineyard. I’m still so happy we even made it to Salem!” A noise came from her throat. “Sarah, were you dreaming about that?” She swallowed the noise with a Gulp. “Not only that, Trip. I was there. I mean back then...caught up in the witch trials. They were accusing me of witchcraft!” I handed her the glass of water from her bureau. She took a long sip before she apprehensively continued: “It was all Abigail’s fault, Abigail Thope. She was thirteen, my age. She was one of the accusers, prosecuting me before Judge Hathorne; one of the first that launched the whole tragedy. She said that she had been bewitched ... And that I had done it!” “Really? That Judge Hathorne? The one who was the trial judge; the one who sent so many innocent people to the gallows?” Weren’t they ancestors of Nathaniel Hawthorne, who not only changed the spelling of his last name in remorse, but wrote The House of the Seven Gables about those terrible days?” I said hypothetically, reveling in an uncharacteristic literary moment. Sarah raised a confused eyebrow. Where’d he learn that, she must have been thinking. “Yes. That one. I was in the Judge’s house. You remember Trip? The one we visited last summer, Judge Corwin’s house?” She waited for me to nod. I answered “yes” with a head-shake. “This was when and where the accusations were made. You were there too, but only for a second. A crowd of people replaced you, and they were all dressed up for a part in The Crucible.” She stuttered in a baffled trance: “And so was I!” “How did you survive without you makeup,” I said in jest to lighten the mood. She smiled for the first time and playfully punched me in the arm. This Big Brother role is working out. “Anyway, it seemed to be a trial of some sort. Judge Hathorne was running the show. He said something about this being a first proceeding, one that would determine if there would be enough evidence to move along with a trial. Governor Phips had just arrived in the Massachusetts Bay Colony, he told us, and witchcraft was going to be finally — and firmly — stamped out; innocent, God-fearing people had nothing to fear — not in his courtroom. There were some other people in the courtroom, because it was a public proceeding, and the statement about the Governor seemed to get everyone’s attention.” At this point in Sarah’s description, I started to see the story. I was, in a sense, reliving her nightmare in my own waking images. I waited in anticipation for her voice to go from pause to play. “So Abigail was testifying. No, actually she went later,” she said, recalculating the events with her eyes in flight. Recollection kicked in when her daze hit the ceiling: “The first to testify was Adam Browne of nearby Danvers. Browne and his wife, Goodwife Browne, both gave their accounts, come to think of it. They were, they claimed, the victims of witchcraft. Every time Master Browne came near our house,” Sarah pointed at me and then targeted herself, “something dreadful would befall them: either he’d fall down, the cows wouldn’t produce milk, or the rye crops would rot. I remember noting — in my head — that Dad’s plan was to settle that farmstead after the Indian wars up north; once he made it there, he’d said he’d never leave it. And it was undoubtedly the finest farmstead in Danvers, a fact that everyone knew. It was probably the one thing no one would debate,” she added. I pictured and open field with ripe crops — and my father in the distance. “What happened at the trial?” “Mr Goodwin was questioned: ‘Wasn’t it true, Master Browne,’ the Judge asked, ‘that you had once tried to buy that homestead, but because Mr. Goodwin had a grant for the property from having been in the Colony’s militia during the Indian wars, priority went to him?” “Abigail had an outburst after she heard this. Though Master Browne’s admission was registered by the clerk of the court, it was lost in the uproar caused by Agatha, and had very little effect.” “Then his wife testified. Goodwife Browne was scared, she said, to even go near our homestead, from what her husband had told her, and so she had refused to do so. But that didn’t stop her from having her own outbursts. It even seemed to worry her husband, who looked overly concerned after she left the podium.” “When do you come in?” I interjected. “Right now. I took the stand and was also a witness. I felt alone without you, Mom, and Dad. I don’t know exactly why you weren’t there. It had something to do with a trip to Boston to buy some farm animals and material for Mom to make a dress for me and some pants for you, I think. Along the way, you were going to take a look at the college in Cambridge.” I thought of how happy I was to be in sweatpants from this century, and what my trip to Cambridge was like. “Anyway, none of you were there. That’s when it all started: after you left Danvers. Master Browne made his accusation, and an official showed up and marched me several miles to Judge Corwin’s house. I’ve never felt so scared and so completely alone.” The look on Sarah’s face was pained. “Well, I’m here now,” this big brother reassured. “I had my chance to testify, and of course I denied any witchcraft. I wouldn’t have a clue how to make an animal sick, and I wouldn’t do it if I did! I even said I wasn’t sure about witchcraft, which I think was the wrong thing to say. Judge Corwin frowned, and Judge Hathorne prosecuted me with his stare. As final proof, I even recited the Lord’s Prayer — and I did it perfectly. You remember from our visit, Trip, that witches aren’t supposed to be able to do that without a mistake? That calmed down the court, and I thought all would be well — until Abigail testified.” I tried to picture Abigail. She had black hair and black eyes; her frame was thin and her limbs dangled lifelessly when she shuffled to the stand. “She got into a real, foaming fit. Any psychiatrist around today would definitely have a field day trying to sort her out,” Sarah said with wide eyes. “Anyway, it was a very scary performance, if that is what it was. Her story was unbelievable because she didn’t know us, except in passing, and had never been to our house; and she had never even met the Brownes. Judge Hathorne took it all in, and then he looked at me with an expression that terrified me. He slowly put a black cap over his head, and asked if I had anything to say before he reached a judgement about whether the case should be referred to trial. ‘In that case,’ he said to me, ‘you’ll be taken forthwith to the town jail.’ Then I woke up.” “Don’t worry, Sis,” I said. “That dream won’t come back. And if it does, I’ll be there to tell Judge Hathorne exactly who the guilty party in his courtroom was. “Let’s go unscramble this over some cold, scrambled eggs.”",
            "answer_options": "(a) Abigail Thorpe; (b) Adam Browne; (c) Goodwife Browne; (d) Sarah Goodwin",
            "answer": "(b) Adam Browne",
            "outcome": "There was no witchcraft, although all concerned, except Sarah, believed in it. What Adam Browne was guilty of was attempting to profit from the witch hunt in order to take over the Goodwin homestead, which he had long coveted and even tried to claim. His admission of that fact would now impeach his credibility as a witness.\nAbigail was one of the instigators of the trials, but she had no personal acquaintance of the Brownes, nor had she seen the Goodwin property. She therefore had no motive to back the Browne testimony (except for her belief in witchcraft), and she would fear reprisal for perjury in the court — and in her group of friends — if her testimony was shown to be groundless.\nGoodwife Browne had never seen the Goodwin homestead; in fact, she took care to stay away from it. She was, however, as susceptible to the beliefs of her time and circumstance as nearly everyone else in the community.\nSarah Goodwin, the dreamer, stated that she did not believe in witchcraft, and therefore turned the court against her. However, she was quite right in believing that in 1692, a perfect recitation of the Lord’s Prayer was something that a witch or warlock was not capable of doing.\nThe case against her should therefore have been dismissed on the spot. It’s a sad commentary on the fanaticism of the times. It recalls the case of Minister George Burroughs, a man who recited the Lord’s Prayer perfectly while at the gallows — but was hanged anyway."
          }
        },
        "culprit(s), human annotated": "(b) Adam Browne",
        "detection": {
          "prompt": "System: You are an ingenious and clever detective who will examine all the clues and reason through all the evidence to solve the crime.\n\nUser: Here is a detective puzzle. Please read the story carefully before you decide who the culprit is.\n\n\nSarah woke up screaming: “Help! Help! I didn’t do it!” As an older brother, I had become accustomed to teenage tantrums from time to time. But this was really different. She sounded really scared. I left my scrambled eggs and ran upstairs. Sarah was sitting up in her bed, pale and sweating. I gave her a reassuring hug, and was relieved to see the color return to her face. “What’s it all about, Sis?” She gave an indecisive grin; her cheeks hadn’t decided whether they would rise or fall. Her eyes were puffy and damp: “Promise you won’t laugh at me, Trip?” I was halfway to delivering a smart retort when I noticed her lips quivering. “Of course not, Sis,” I said. “Tell me what happened. A bad dream?” “Yeah. I’ve never had one like this before. Sure you want to hear about it?” I was all ears. Dad had left for an early round of golf, and I had just given Mom a peck on the cheek after she left the house to hunt for bargains at Wal-Mart. I was really the man of the house now. There wasn’t room for making fun of Sarah today. There was only a space, marked with by a transition into “Big Brother” mode. “Well, I’m almost ashamed to tell you, but it was too real.” She took a deep breath and collected her thoughts. “You remember when we were on vacation last summer?” “Sure, a great trip to Massachusetts. We went to Plymouth, Cape Cod, and Martha’s Vineyard. I’m still so happy we even made it to Salem!” A noise came from her throat. “Sarah, were you dreaming about that?” She swallowed the noise with a Gulp. “Not only that, Trip. I was there. I mean back then...caught up in the witch trials. They were accusing me of witchcraft!” I handed her the glass of water from her bureau. She took a long sip before she apprehensively continued: “It was all Abigail’s fault, Abigail Thope. She was thirteen, my age. She was one of the accusers, prosecuting me before Judge Hathorne; one of the first that launched the whole tragedy. She said that she had been bewitched ... And that I had done it!” “Really? That Judge Hathorne? The one who was the trial judge; the one who sent so many innocent people to the gallows?” Weren’t they ancestors of Nathaniel Hawthorne, who not only changed the spelling of his last name in remorse, but wrote The House of the Seven Gables about those terrible days?” I said hypothetically, reveling in an uncharacteristic literary moment. Sarah raised a confused eyebrow. Where’d he learn that, she must have been thinking. “Yes. That one. I was in the Judge’s house. You remember Trip? The one we visited last summer, Judge Corwin’s house?” She waited for me to nod. I answered “yes” with a head-shake. “This was when and where the accusations were made. You were there too, but only for a second. A crowd of people replaced you, and they were all dressed up for a part in The Crucible.” She stuttered in a baffled trance: “And so was I!” “How did you survive without you makeup,” I said in jest to lighten the mood. She smiled for the first time and playfully punched me in the arm. This Big Brother role is working out. “Anyway, it seemed to be a trial of some sort. Judge Hathorne was running the show. He said something about this being a first proceeding, one that would determine if there would be enough evidence to move along with a trial. Governor Phips had just arrived in the Massachusetts Bay Colony, he told us, and witchcraft was going to be finally — and firmly — stamped out; innocent, God-fearing people had nothing to fear — not in his courtroom. There were some other people in the courtroom, because it was a public proceeding, and the statement about the Governor seemed to get everyone’s attention.” At this point in Sarah’s description, I started to see the story. I was, in a sense, reliving her nightmare in my own waking images. I waited in anticipation for her voice to go from pause to play. “So Abigail was testifying. No, actually she went later,” she said, recalculating the events with her eyes in flight. Recollection kicked in when her daze hit the ceiling: “The first to testify was Adam Browne of nearby Danvers. Browne and his wife, Goodwife Browne, both gave their accounts, come to think of it. They were, they claimed, the victims of witchcraft. Every time Master Browne came near our house,” Sarah pointed at me and then targeted herself, “something dreadful would befall them: either he’d fall down, the cows wouldn’t produce milk, or the rye crops would rot. I remember noting — in my head — that Dad’s plan was to settle that farmstead after the Indian wars up north; once he made it there, he’d said he’d never leave it. And it was undoubtedly the finest farmstead in Danvers, a fact that everyone knew. It was probably the one thing no one would debate,” she added. I pictured and open field with ripe crops — and my father in the distance. “What happened at the trial?” “Mr Goodwin was questioned: ‘Wasn’t it true, Master Browne,’ the Judge asked, ‘that you had once tried to buy that homestead, but because Mr. Goodwin had a grant for the property from having been in the Colony’s militia during the Indian wars, priority went to him?” “Abigail had an outburst after she heard this. Though Master Browne’s admission was registered by the clerk of the court, it was lost in the uproar caused by Agatha, and had very little effect.” “Then his wife testified. Goodwife Browne was scared, she said, to even go near our homestead, from what her husband had told her, and so she had refused to do so. But that didn’t stop her from having her own outbursts. It even seemed to worry her husband, who looked overly concerned after she left the podium.” “When do you come in?” I interjected. “Right now. I took the stand and was also a witness. I felt alone without you, Mom, and Dad. I don’t know exactly why you weren’t there. It had something to do with a trip to Boston to buy some farm animals and material for Mom to make a dress for me and some pants for you, I think. Along the way, you were going to take a look at the college in Cambridge.” I thought of how happy I was to be in sweatpants from this century, and what my trip to Cambridge was like. “Anyway, none of you were there. That’s when it all started: after you left Danvers. Master Browne made his accusation, and an official showed up and marched me several miles to Judge Corwin’s house. I’ve never felt so scared and so completely alone.” The look on Sarah’s face was pained. “Well, I’m here now,” this big brother reassured. “I had my chance to testify, and of course I denied any witchcraft. I wouldn’t have a clue how to make an animal sick, and I wouldn’t do it if I did! I even said I wasn’t sure about witchcraft, which I think was the wrong thing to say. Judge Corwin frowned, and Judge Hathorne prosecuted me with his stare. As final proof, I even recited the Lord’s Prayer — and I did it perfectly. You remember from our visit, Trip, that witches aren’t supposed to be able to do that without a mistake? That calmed down the court, and I thought all would be well — until Abigail testified.” I tried to picture Abigail. She had black hair and black eyes; her frame was thin and her limbs dangled lifelessly when she shuffled to the stand. “She got into a real, foaming fit. Any psychiatrist around today would definitely have a field day trying to sort her out,” Sarah said with wide eyes. “Anyway, it was a very scary performance, if that is what it was. Her story was unbelievable because she didn’t know us, except in passing, and had never been to our house; and she had never even met the Brownes. Judge Hathorne took it all in, and then he looked at me with an expression that terrified me. He slowly put a black cap over his head, and asked if I had anything to say before he reached a judgement about whether the case should be referred to trial. ‘In that case,’ he said to me, ‘you’ll be taken forthwith to the town jail.’ Then I woke up.” “Don’t worry, Sis,” I said. “That dream won’t come back. And if it does, I’ll be there to tell Judge Hathorne exactly who the guilty party in his courtroom was. “Let’s go unscramble this over some cold, scrambled eggs.”\nThere was no witchcraft, although all concerned, except Sarah, believed in it. What Adam Browne was guilty of was attempting to profit from the witch hunt in order to take over the Goodwin homestead, which he had long coveted and even tried to claim. His admission of that fact would now impeach his credibility as a witness.\nAbigail was one of the instigators of the trials, but she had no personal acquaintance of the Brownes, nor had she seen the Goodwin property. She therefore had no motive to back the Browne testimony (except for her belief in witchcraft), and she would fear reprisal for perjury in the court — and in her group of friends — if her testimony was shown to be groundless.\nGoodwife Browne had never seen the Goodwin homestead; in fact, she took care to stay away from it. She was, however, as susceptible to the beliefs of her time and circumstance as nearly everyone else in the community.\nSarah Goodwin, the dreamer, stated that she did not believe in witchcraft, and therefore turned the court against her. However, she was quite right in believing that in 1692, a perfect recitation of the Lord’s Prayer was something that a witch or warlock was not capable of doing.\nThe case against her should therefore have been dismissed on the spot. It’s a sad commentary on the fanaticism of the times. It recalls the case of Minister George Burroughs, a man who recited the Lord’s Prayer perfectly while at the gallows — but was hanged anyway.\n\nPlease analyze all the clues and evidence presented in the story and identify who the culprit is. Explain your reasoning step by step, considering:\n1. The motives of different characters\n2. The opportunities each character had\n3. Any physical evidence or alibis\n4. The logical deduction from the clues presented\n\nSolve the mystery. Write down your thought process here.\n\n<THOUGHT PROCESS>\n<thought process here>\n</THOUGHT PROCESS>\n\nWho are the possible suspects? List them here:\n\n<SUSPECTS>\n<names(s) for all suspects here, comma separated>\n</SUSPECTS>\n\nWho is the culprit?  There is only one. If possible, include first and last names, as well as any aliases. Answer in the form:\n\n<CULPRIT>\n<name here>\n</CULPRIT>\n\nNow write down your reconstruction of the events of what actually happened.\n\n<EVENT RECONSTRUCTION>\n<event reconstruction here>\n</EVENT RECONSTRUCTION>\n\nFinally, explain why the other suspects are innocent.\n\n<WHY THE OTHER SUSPECTS ARE INNOCENT>\n<explanation here>\n</WHY THE OTHER SUSPECTS ARE INNOCENT>",
          "solution": "<THOUGHT PROCESS>\n1. Establish what, in the “dream-trial,” is the real wrong that has to be solved.  \n   • It is certainly not witchcraft—Sarah herself tells us she does not even believe in it and the narrator points out that witches were supposed to stumble over the Lord’s Prayer, which Sarah recites flawlessly.  \n   • The only genuine “crime” therefore can be the deliberate false accusation meant to ruin Sarah (and by extension her family) so that someone else can profit.\n\n2. List every person who gives damaging testimony against Sarah.  \n   • Adam Browne (of Danvers)  \n   • Goodwife Browne (his wife)  \n   • Abigail Thope (one of the well-known girl accusers)  \n\n3. Check each one for motive.  \n   • Adam Browne – The judge himself brings out that Browne once tried to buy the Goodwin homestead, the prime farm in Danvers, but could not because Mr Goodwin held a militia grant. He thus has a clear, tangible motive: seize the land by having its owners condemned.  \n   • Goodwife Browne – She explicitly says she avoids the Goodwin place and has never even been near it. No evidence that she wants the land; she is simply echoing her husband’s stories and swept up in hysteria.  \n   • Abigail Thope – She does not know the Brownes, has never been to the Goodwin farm, and has no personal interest in it. Her only “motive” is the general witch-craze she and her friends helped start; no specific reason to target Sarah for profit.  \n\n4. Check opportunity/credibility.  \n   • Adam Browne – Admits trying to get the land; is the source of the concrete “evidence” (animals sicken, crops rot when he comes near the Goodwin house). Those events are conveniently unverifiable and happen only when no neutral observer is present.  \n   • Goodwife Browne – Claims she never approaches the property, so she cannot truly witness anything herself; her statements are second-hand.  \n   • Abigail Thope – Gives a dramatic fit but no first-hand facts; all emotional display.  \n\n5. Additional built-in impeachment.  \n   • The judge’s question about Browne’s earlier failed attempt to obtain the farm is, in modern terms, the big red flag. It shows knowledge of the motive and places a question mark on everything Adam says from that moment on.  \n   • None of the “bewitching events” occurs anywhere except in Browne’s account.  \n   • Sarah’s perfect recital of the Lord’s Prayer traditionally negates the charge, so the only way to keep the accusation alive is through Browne’s self-serving testimony.\n\n6. Logical deduction.  \n   • The only person who (a) has something tangible to gain, (b) supplies the only concrete but uncorroborated “facts,” and (c) has already tried—unsuccessfully—to secure that gain by legitimate means is Adam Browne.  \n   • Therefore, he must be the conscious instigator of the false charge; the others are at worst gullible followers.\n</THOUGHT PROCESS>\n\n<SUSPECTS>\nAdam Browne, Goodwife Browne, Abigail Thope, Judge John Hathorne, Sarah Goodwin\n</SUSPECTS>\n\n<CULPRIT>\nAdam Browne\n</CULPRIT>\n\n<EVENT RECONSTRUCTION>\nAfter failing to purchase the Goodwin homestead, Adam Browne decided to use the newly ignited witchcraft hysteria as a weapon.  He spread stories that every time he went near the Goodwin place he was knocked down, cattle went dry, crops failed—classic “spectral” attacks.  He then marched into the preliminary hearing before Judge Hathorne and repeated those tales as sworn testimony, fully expecting the court to imprison or execute Sarah and, eventually, her family.  With the Goodwins eliminated, Browne could move in on the most valuable farm in Danvers.  \n\nHis wife, Goodwife Browne, merely repeated what her husband had told her and embellished it with frightened fits.  Abigail Thope, already famous among the circle of girl accusers, joined in out of sincere but misplaced belief—or the thrill of attention—but had no personal stake.  \n\nSarah’s flawless recitation of the Lord’s Prayer should have exonerated her.  Instead, the hysteria—fueled chiefly by Adam Browne’s self-serving lies—pushed the court toward binding her over for trial.  That, in essence, is the wrong that Sarah’s nightmare re-enacts.\n</EVENT RECONSTRUCTION>\n\n<WHY THE OTHER SUSPECTS ARE INNOCENT>\n• Goodwife Browne – Acts out of fear and marital loyalty.  All her information comes from her husband; she never witnesses anything herself, so she is a victim of deception, not its author.  \n• Abigail Thope – One of the historical “afflicted girls,” but she has no acquaintance with the Brownes, the Goodwins, or the farm.  She is swept up in mass hysteria rather than scheming for gain.  \n• Judge John Hathorne – A harsh magistrate and historically culpable for many injustices, but within this story he is not the original source of the accusation; he merely hears it.  \n• Sarah Goodwin – Obviously the target, not the perpetrator.  \nTherefore Adam Browne, and Adam Browne alone, is the deliberate culprit behind the false charge.\n</WHY THE OTHER SUSPECTS ARE INNOCENT>",
          "length_warning": "",
          "model": "o3",
          "reveal_segment": "There was no witchcraft, although all concerned, except Sarah, believed in it. What Adam Browne was guilty of was attempting to profit from the witch hunt in order to take over the Goodwin homestead, which he had long coveted and even tried to claim. His admission of that fact would now impeach his credibility as a witness.\nAbigail was one of the instigators of the trials, but she had no personal acquaintance of the Brownes, nor had she seen the Goodwin property. She therefore had no motive to back the Browne testimony (except for her belief in witchcraft), and she would fear reprisal for perjury in the court — and in her group of friends — if her testimony was shown to be groundless.\nGoodwife Browne had never seen the Goodwin homestead; in fact, she took care to stay away from it. She was, however, as susceptible to the beliefs of her time and circumstance as nearly everyone else in the community.\nSarah Goodwin, the dreamer, stated that she did not believe in witchcraft, and therefore turned the court against her. However, she was quite right in believing that in 1692, a perfect recitation of the Lord’s Prayer was something that a witch or warlock was not capable of doing.\nThe case against her should therefore have been dismissed on the spot. It’s a sad commentary on the fanaticism of the times. It recalls the case of Minister George Burroughs, a man who recited the Lord’s Prayer perfectly while at the gallows — but was hanged anyway."
        }
      },
      "doc_id": "A_Dream_of_Old_Salem"
    }
  ]
}