{
  "item_metadata": {
    "item_id": "ASK_MARTHA_—_THE_PERJURER",
    "num_documents": 1
  },
  "documents": [
    {
      "content": "Inspector Samuels lifted his cup, blew on it to cool the foaming coffee, and hunched his shoulders slightly, a gesture of confusion and determination. “Something isn’t right about that manslaughter case that was tried last week in municipal court. You were there, Crusher, so you must know what I mean. The Jones case.” Crusher Davis, all six foot six and two-hundred-sixty-five pounds of him, had trouble fitting in the snug seat at Kellogg’s Kaffee Klatch. Not for the first time, he realized that the place’s name was dreadful, but as always, the cappuccino was first rate. He nodded in agreement. “That’s right, Inspector. And I’m glad that we are on the same track with this one. Frankly, I didn’t like that acquittal much either. The defendant took the stand, and then there was some conflicting testimony. It’s just possible that somebody lied to get her off. So maybe now it is up to us to figure out just who lied under oath.” He blew on his coffee and then, lost in thought, took a sip. It was too soon, and the hot coffee burned his tongue and made him cough. He reached for his glass of water and drank deeply. Still, during that split second, Crusher had been reviewing the case and the trial—Inspector Samuels was amazed. Anybody else would have been caught up in spasms and pain after drinking searing hot coffee. Crusher Davis had not lost his concentration for a moment. “Good thing that I was there reporting on the cases on the docket,” Crusher said. “This isn’t one of my Ask Martha cases, when I sort out clues in the letters I receive to my agony column nom de plum. At least, it isn’t yet.” Crusher looked around the coffee shop. “So we can talk about this and nobody will figure out that I write Martha’s column in the Chronicle. What an embarrassment it would be for everyone to know that I went from the gridiron to giving advice to the lovelorn!” Inspector Samuels smiled. “Let’s just talk this case through and see if we come up with any concrete reason for our bad feelings. The Jones house, on Willow Street, was where it all happened last September. Melissa Jones and her husband Hank were having another of their loud quarrels. We’d been called by the neighbors more than once when the Joneses got noisy and out of hand. It was odd that no complaint call came in that night. And when we were called, it was by Melissa Jones, as she testified. It was about eight o’clock at night. Her husband was dead—she reported that it had just happened. She claimed self-defense, and the jury bought it. After all, they knew the couple had a violent history.” “Yes. And the coroner said that death had been the result of her hitting him over the head with a poker. She’s no shrinking violet, that’s for sure. Title 9 had given her a chance to hone her athletic skills back in high school, and she’s in better shape than most men her age. What I don’t like, not one bit, is that the blow was from behind.” Crusher paused. “What was the official time of death, Inspector?” “The coroner said, remember, that he couldn’t be exact to the minute about the time of death. The body was in the living room in front of the fireplace, where there had been a fire. That heat may have somewhat slowed coagulation of the blood caused by the blow. ‘It’s not a precise science, times of death,’ the corner testified. ‘Given the fire, it could have been seven, or an hour later than that.’ “But she said she called immediately after he died, and if that’s so, it tends to back up her story of self-defense. It’s a natural reaction, given the seriousness of what happened. You want to get your story to the police right away, avoid suspicion. If, on the other hand, he did die at seven and she waited for an hour to call it in, maybe it was a premeditated crime, and she was spending that time getting her story straight. It’s a fair inference.” “The timing is crucial here.” “Giving the defendant the reasonable doubt—which the jury is supposed to do, after all—they accepted the later time of death, agreed that she had called the police immediately, and acquitted her.” “Which is why we are here now.” “Exactly. So, let’s go over the witnesses.” “Ok, Inspector. I’ve got my notes from the trial. First, there was John Eberley, the next door neighbor. I knew him in high school. He’s still single. Matter of fact, I always had the impression that he was kind of sweet on Melissa—Melissa Simpson, in her unmarried days. But she was Hank’s girl, even back then.” “Funny that the prosecutor didn’t bring that out.” “Well, he’s new around here. Doesn’t have the local background. Anyway, Eberley said that he had heard shouts and arguing off and on, from half past six to eight o’clock. He was, however, caught up in that new mystery on HBO, so he didn’t pay that much attention to what was said. Since the mystery ended at eight, he was quite sure of the time. It marked the last shouts that he heard from next door. He did also say that he’d heard Hank and Melissa argue far worse than they did that night.” “Yes. What did you make of Martha Cranston’s testimony?” “That was interesting. She had been walking her dog up and down Willow Street, just after seven o’clock. She thought it was a nicer street than the one she lived on. She said it was a really quiet, still night, and just warm enough so that some windows were open in all of the houses that she passed by, but still she heard nothing. I thought she was credible.” “They all were. That’s our problem.” “Then came Horace Osamway, the National Bank vice president, and a picture of rigid self-righteousness if there ever was one. He had come by earlier, he testified. The Joneses were way behind in their mortgage payments. He told them it had been a mistake to give them the mortgage in the first place. He said that he was pretty sure that they couldn’t make the payments up, but he was willing to give them one last chance. He said that his conversation with the couple became, on their side, pretty heated. Hank was blaming their predicament on Melissa being a spendthrift, while she was saying that he was a lousy provider, that sort of thing.” “With objections galore from the defense, I recall.” “Absolutely, on hearsay grounds. But enough of it was admissible so that the jury got the idea that they were not a happy couple. Far from it. Osamway said he left at five o’clock and by that time, he said, both Melissa and her husband had been drinking fairly heavily.” “Then there was Mildred Greene’s testimony. She passed by the house walking to the corner store about six o’clock. She said that she heard a big argument going on, something about ‘losing the house,’ and whose fault that was. She tried to tune it out, as a devoted churchgoer, because of the real atomic-submarine-class profanity that was being used, but it wasn’t possible. What really riled her was that when she returned from the store and passed the Jones house once again, an hour and a half later, the argument was still going on, and was just as intense as it had been earlier. They were even using some of the same—shall we say colorful—expressions that had been shouted earlier!” Crusher Davis returned to his office at the Chronicle. He had an idea. His next Ask Martha column ended with a question. “Does first love last? Tell us your experiences.” The following week, he had a number of replies, some very interesting, some rather sappy and saccharine. Two interested him in particular: The first, from Maiden Blush, had a local postmark. It gave a firm “no” to the proposition that first loves last. “People change. They start to drink. Stuff happens. Trust me. They aren’t the same people after a while.” Crusher opened the second letter. It also had a local postmark. “Yes, first loves last. Sometimes people make mistakes, but life can give you a second chance. That’s particularly true if you are willing to forget the past and give love a chance to bloom once again.” Davis called Inspector Samuels. “I’m not sure about that Jones case,” he said, “but I do have a pretty good idea that perjury was committed in open court. Let’s meet and I’ll tell you what Ask Martha has managed to find out.",
      "metadata": {
        "original_metadata": {
          "case_id": "ASK MARTHA — THE PERJURER",
          "case_name": "ASK MARTHA — THE PERJURER",
          "author_name": "Robbie Cutler",
          "author_url": "https://www.5minutemystery.com/author/RobbieCutler",
          "case_url": "https://www.5minutemystery.com/mystery/ask-marthathe-perjurer",
          "mystery_text": "Inspector Samuels lifted his cup, blew on it to cool the foaming coffee, and hunched his shoulders slightly, a gesture of confusion and determination. “Something isn’t right about that manslaughter case that was tried last week in municipal court. You were there, Crusher, so you must know what I mean. The Jones case.” Crusher Davis, all six foot six and two-hundred-sixty-five pounds of him, had trouble fitting in the snug seat at Kellogg’s Kaffee Klatch. Not for the first time, he realized that the place’s name was dreadful, but as always, the cappuccino was first rate. He nodded in agreement. “That’s right, Inspector. And I’m glad that we are on the same track with this one. Frankly, I didn’t like that acquittal much either. The defendant took the stand, and then there was some conflicting testimony. It’s just possible that somebody lied to get her off. So maybe now it is up to us to figure out just who lied under oath.” He blew on his coffee and then, lost in thought, took a sip. It was too soon, and the hot coffee burned his tongue and made him cough. He reached for his glass of water and drank deeply. Still, during that split second, Crusher had been reviewing the case and the trial—Inspector Samuels was amazed. Anybody else would have been caught up in spasms and pain after drinking searing hot coffee. Crusher Davis had not lost his concentration for a moment. “Good thing that I was there reporting on the cases on the docket,” Crusher said. “This isn’t one of my Ask Martha cases, when I sort out clues in the letters I receive to my agony column nom de plum. At least, it isn’t yet.” Crusher looked around the coffee shop. “So we can talk about this and nobody will figure out that I write Martha’s column in the Chronicle. What an embarrassment it would be for everyone to know that I went from the gridiron to giving advice to the lovelorn!” Inspector Samuels smiled. “Let’s just talk this case through and see if we come up with any concrete reason for our bad feelings. The Jones house, on Willow Street, was where it all happened last September. Melissa Jones and her husband Hank were having another of their loud quarrels. We’d been called by the neighbors more than once when the Joneses got noisy and out of hand. It was odd that no complaint call came in that night. And when we were called, it was by Melissa Jones, as she testified. It was about eight o’clock at night. Her husband was dead—she reported that it had just happened. She claimed self-defense, and the jury bought it. After all, they knew the couple had a violent history.” “Yes. And the coroner said that death had been the result of her hitting him over the head with a poker. She’s no shrinking violet, that’s for sure. Title 9 had given her a chance to hone her athletic skills back in high school, and she’s in better shape than most men her age. What I don’t like, not one bit, is that the blow was from behind.” Crusher paused. “What was the official time of death, Inspector?” “The coroner said, remember, that he couldn’t be exact to the minute about the time of death. The body was in the living room in front of the fireplace, where there had been a fire. That heat may have somewhat slowed coagulation of the blood caused by the blow. ‘It’s not a precise science, times of death,’ the corner testified. ‘Given the fire, it could have been seven, or an hour later than that.’ “But she said she called immediately after he died, and if that’s so, it tends to back up her story of self-defense. It’s a natural reaction, given the seriousness of what happened. You want to get your story to the police right away, avoid suspicion. If, on the other hand, he did die at seven and she waited for an hour to call it in, maybe it was a premeditated crime, and she was spending that time getting her story straight. It’s a fair inference.” “The timing is crucial here.” “Giving the defendant the reasonable doubt—which the jury is supposed to do, after all—they accepted the later time of death, agreed that she had called the police immediately, and acquitted her.” “Which is why we are here now.” “Exactly. So, let’s go over the witnesses.” “Ok, Inspector. I’ve got my notes from the trial. First, there was John Eberley, the next door neighbor. I knew him in high school. He’s still single. Matter of fact, I always had the impression that he was kind of sweet on Melissa—Melissa Simpson, in her unmarried days. But she was Hank’s girl, even back then.” “Funny that the prosecutor didn’t bring that out.” “Well, he’s new around here. Doesn’t have the local background. Anyway, Eberley said that he had heard shouts and arguing off and on, from half past six to eight o’clock. He was, however, caught up in that new mystery on HBO, so he didn’t pay that much attention to what was said. Since the mystery ended at eight, he was quite sure of the time. It marked the last shouts that he heard from next door. He did also say that he’d heard Hank and Melissa argue far worse than they did that night.” “Yes. What did you make of Martha Cranston’s testimony?” “That was interesting. She had been walking her dog up and down Willow Street, just after seven o’clock. She thought it was a nicer street than the one she lived on. She said it was a really quiet, still night, and just warm enough so that some windows were open in all of the houses that she passed by, but still she heard nothing. I thought she was credible.” “They all were. That’s our problem.” “Then came Horace Osamway, the National Bank vice president, and a picture of rigid self-righteousness if there ever was one. He had come by earlier, he testified. The Joneses were way behind in their mortgage payments. He told them it had been a mistake to give them the mortgage in the first place. He said that he was pretty sure that they couldn’t make the payments up, but he was willing to give them one last chance. He said that his conversation with the couple became, on their side, pretty heated. Hank was blaming their predicament on Melissa being a spendthrift, while she was saying that he was a lousy provider, that sort of thing.” “With objections galore from the defense, I recall.” “Absolutely, on hearsay grounds. But enough of it was admissible so that the jury got the idea that they were not a happy couple. Far from it. Osamway said he left at five o’clock and by that time, he said, both Melissa and her husband had been drinking fairly heavily.” “Then there was Mildred Greene’s testimony. She passed by the house walking to the corner store about six o’clock. She said that she heard a big argument going on, something about ‘losing the house,’ and whose fault that was. She tried to tune it out, as a devoted churchgoer, because of the real atomic-submarine-class profanity that was being used, but it wasn’t possible. What really riled her was that when she returned from the store and passed the Jones house once again, an hour and a half later, the argument was still going on, and was just as intense as it had been earlier. They were even using some of the same—shall we say colorful—expressions that had been shouted earlier!” Crusher Davis returned to his office at the Chronicle. He had an idea. His next Ask Martha column ended with a question. “Does first love last? Tell us your experiences.” The following week, he had a number of replies, some very interesting, some rather sappy and saccharine. Two interested him in particular: The first, from Maiden Blush, had a local postmark. It gave a firm “no” to the proposition that first loves last. “People change. They start to drink. Stuff happens. Trust me. They aren’t the same people after a while.” Crusher opened the second letter. It also had a local postmark. “Yes, first loves last. Sometimes people make mistakes, but life can give you a second chance. That’s particularly true if you are willing to forget the past and give love a chance to bloom once again.” Davis called Inspector Samuels. “I’m not sure about that Jones case,” he said, “but I do have a pretty good idea that perjury was committed in open court. Let’s meet and I’ll tell you what Ask Martha has managed to find out.",
          "answer_options": "(a) Horace Osamway; (b) John Eberley; (c) Martha Cranston; (d) Mildred Greene",
          "correct_answer": "(b) John Eberley",
          "reveal_text": "The perjurer, John Eberley, is hoping for a reunion with his first love, Melissa. He is giving her an alibi, by stating that he had heard the couple quarrel as late as eight o’clock. That reinforces the defense view that the death had happened suddenly, without premeditation, at about that time, and was self-defense during the course of a heated argument, probably set off by their mortgage problem.\nIf the death had happened an hour earlier, then the case for the defendant becomes more difficult. Perhaps she was trying to hide something, or figure out how to disguise murder as self-defense. The fire set in the fireplace would have helped; lighting it after her husband’s death would have warmed the room and slowed blood coagulation, making the time of death seem later than it really was.\nNot one of the other witnesses supports John Eberley’s story. The coroner said that the death could have occurred as early as seven o’clock. Horace Osamway had left the Jones residence at five o’clock. Martha Cranston passed the house at a quarter to seven, and heard nothing. Mildred Greene, who heard loud arguments and swearing when she went to the store about six o’clock, and then when she returned, about seven-thirty. Interestingly enough, the same language was used. Could it have been a recording of the earlier fight, played later to fix the time in the mind of a witness seen through the window? Except for John Eberley, nobody else testified having heard arguments that late.\nDouble jeopardy may prevent Melissa Jones, who wrote the first Ask Martha letter, from being tried a second time. But it would not stop John Eberley, who wrote the second letter, from being tried for perjury in a misguided attempt to help his first love.",
          "attempts": 723,
          "solve_rate": 48.5,
          "text_length": 8145,
          "puzzle_data": {
            "case_name": "ASK MARTHA — THE PERJURER",
            "case_url": "https://www.5minutemystery.com/mystery/ask-marthathe-perjurer",
            "author_name": "Robbie Cutler",
            "author_url": "https://www.5minutemystery.com/author/RobbieCutler",
            "attempts": "723",
            "solve_rate": "48.5",
            "mystery_text": "Inspector Samuels lifted his cup, blew on it to cool the foaming coffee, and hunched his shoulders slightly, a gesture of confusion and determination. “Something isn’t right about that manslaughter case that was tried last week in municipal court. You were there, Crusher, so you must know what I mean. The Jones case.” Crusher Davis, all six foot six and two-hundred-sixty-five pounds of him, had trouble fitting in the snug seat at Kellogg’s Kaffee Klatch. Not for the first time, he realized that the place’s name was dreadful, but as always, the cappuccino was first rate. He nodded in agreement. “That’s right, Inspector. And I’m glad that we are on the same track with this one. Frankly, I didn’t like that acquittal much either. The defendant took the stand, and then there was some conflicting testimony. It’s just possible that somebody lied to get her off. So maybe now it is up to us to figure out just who lied under oath.” He blew on his coffee and then, lost in thought, took a sip. It was too soon, and the hot coffee burned his tongue and made him cough. He reached for his glass of water and drank deeply. Still, during that split second, Crusher had been reviewing the case and the trial—Inspector Samuels was amazed. Anybody else would have been caught up in spasms and pain after drinking searing hot coffee. Crusher Davis had not lost his concentration for a moment. “Good thing that I was there reporting on the cases on the docket,” Crusher said. “This isn’t one of my Ask Martha cases, when I sort out clues in the letters I receive to my agony column nom de plum. At least, it isn’t yet.” Crusher looked around the coffee shop. “So we can talk about this and nobody will figure out that I write Martha’s column in the Chronicle. What an embarrassment it would be for everyone to know that I went from the gridiron to giving advice to the lovelorn!” Inspector Samuels smiled. “Let’s just talk this case through and see if we come up with any concrete reason for our bad feelings. The Jones house, on Willow Street, was where it all happened last September. Melissa Jones and her husband Hank were having another of their loud quarrels. We’d been called by the neighbors more than once when the Joneses got noisy and out of hand. It was odd that no complaint call came in that night. And when we were called, it was by Melissa Jones, as she testified. It was about eight o’clock at night. Her husband was dead—she reported that it had just happened. She claimed self-defense, and the jury bought it. After all, they knew the couple had a violent history.” “Yes. And the coroner said that death had been the result of her hitting him over the head with a poker. She’s no shrinking violet, that’s for sure. Title 9 had given her a chance to hone her athletic skills back in high school, and she’s in better shape than most men her age. What I don’t like, not one bit, is that the blow was from behind.” Crusher paused. “What was the official time of death, Inspector?” “The coroner said, remember, that he couldn’t be exact to the minute about the time of death. The body was in the living room in front of the fireplace, where there had been a fire. That heat may have somewhat slowed coagulation of the blood caused by the blow. ‘It’s not a precise science, times of death,’ the corner testified. ‘Given the fire, it could have been seven, or an hour later than that.’ “But she said she called immediately after he died, and if that’s so, it tends to back up her story of self-defense. It’s a natural reaction, given the seriousness of what happened. You want to get your story to the police right away, avoid suspicion. If, on the other hand, he did die at seven and she waited for an hour to call it in, maybe it was a premeditated crime, and she was spending that time getting her story straight. It’s a fair inference.” “The timing is crucial here.” “Giving the defendant the reasonable doubt—which the jury is supposed to do, after all—they accepted the later time of death, agreed that she had called the police immediately, and acquitted her.” “Which is why we are here now.” “Exactly. So, let’s go over the witnesses.” “Ok, Inspector. I’ve got my notes from the trial. First, there was John Eberley, the next door neighbor. I knew him in high school. He’s still single. Matter of fact, I always had the impression that he was kind of sweet on Melissa—Melissa Simpson, in her unmarried days. But she was Hank’s girl, even back then.” “Funny that the prosecutor didn’t bring that out.” “Well, he’s new around here. Doesn’t have the local background. Anyway, Eberley said that he had heard shouts and arguing off and on, from half past six to eight o’clock. He was, however, caught up in that new mystery on HBO, so he didn’t pay that much attention to what was said. Since the mystery ended at eight, he was quite sure of the time. It marked the last shouts that he heard from next door. He did also say that he’d heard Hank and Melissa argue far worse than they did that night.” “Yes. What did you make of Martha Cranston’s testimony?” “That was interesting. She had been walking her dog up and down Willow Street, just after seven o’clock. She thought it was a nicer street than the one she lived on. She said it was a really quiet, still night, and just warm enough so that some windows were open in all of the houses that she passed by, but still she heard nothing. I thought she was credible.” “They all were. That’s our problem.” “Then came Horace Osamway, the National Bank vice president, and a picture of rigid self-righteousness if there ever was one. He had come by earlier, he testified. The Joneses were way behind in their mortgage payments. He told them it had been a mistake to give them the mortgage in the first place. He said that he was pretty sure that they couldn’t make the payments up, but he was willing to give them one last chance. He said that his conversation with the couple became, on their side, pretty heated. Hank was blaming their predicament on Melissa being a spendthrift, while she was saying that he was a lousy provider, that sort of thing.” “With objections galore from the defense, I recall.” “Absolutely, on hearsay grounds. But enough of it was admissible so that the jury got the idea that they were not a happy couple. Far from it. Osamway said he left at five o’clock and by that time, he said, both Melissa and her husband had been drinking fairly heavily.” “Then there was Mildred Greene’s testimony. She passed by the house walking to the corner store about six o’clock. She said that she heard a big argument going on, something about ‘losing the house,’ and whose fault that was. She tried to tune it out, as a devoted churchgoer, because of the real atomic-submarine-class profanity that was being used, but it wasn’t possible. What really riled her was that when she returned from the store and passed the Jones house once again, an hour and a half later, the argument was still going on, and was just as intense as it had been earlier. They were even using some of the same—shall we say colorful—expressions that had been shouted earlier!” Crusher Davis returned to his office at the Chronicle. He had an idea. His next Ask Martha column ended with a question. “Does first love last? Tell us your experiences.” The following week, he had a number of replies, some very interesting, some rather sappy and saccharine. Two interested him in particular: The first, from Maiden Blush, had a local postmark. It gave a firm “no” to the proposition that first loves last. “People change. They start to drink. Stuff happens. Trust me. They aren’t the same people after a while.” Crusher opened the second letter. It also had a local postmark. “Yes, first loves last. Sometimes people make mistakes, but life can give you a second chance. That’s particularly true if you are willing to forget the past and give love a chance to bloom once again.” Davis called Inspector Samuels. “I’m not sure about that Jones case,” he said, “but I do have a pretty good idea that perjury was committed in open court. Let’s meet and I’ll tell you what Ask Martha has managed to find out.",
            "answer_options": "(a) Horace Osamway; (b) John Eberley; (c) Martha Cranston; (d) Mildred Greene",
            "answer": "(b) John Eberley",
            "outcome": "The perjurer, John Eberley, is hoping for a reunion with his first love, Melissa. He is giving her an alibi, by stating that he had heard the couple quarrel as late as eight o’clock. That reinforces the defense view that the death had happened suddenly, without premeditation, at about that time, and was self-defense during the course of a heated argument, probably set off by their mortgage problem.\nIf the death had happened an hour earlier, then the case for the defendant becomes more difficult. Perhaps she was trying to hide something, or figure out how to disguise murder as self-defense. The fire set in the fireplace would have helped; lighting it after her husband’s death would have warmed the room and slowed blood coagulation, making the time of death seem later than it really was.\nNot one of the other witnesses supports John Eberley’s story. The coroner said that the death could have occurred as early as seven o’clock. Horace Osamway had left the Jones residence at five o’clock. Martha Cranston passed the house at a quarter to seven, and heard nothing. Mildred Greene, who heard loud arguments and swearing when she went to the store about six o’clock, and then when she returned, about seven-thirty. Interestingly enough, the same language was used. Could it have been a recording of the earlier fight, played later to fix the time in the mind of a witness seen through the window? Except for John Eberley, nobody else testified having heard arguments that late.\nDouble jeopardy may prevent Melissa Jones, who wrote the first Ask Martha letter, from being tried a second time. But it would not stop John Eberley, who wrote the second letter, from being tried for perjury in a misguided attempt to help his first love."
          }
        },
        "culprit(s), human annotated": "(b) John Eberley",
        "detection": {
          "prompt": "System: You are an ingenious and clever detective who will examine all the clues and reason through all the evidence to solve the crime.\n\nUser: Here is a detective puzzle. Please read the story carefully before you decide who the culprit is.\n\n\nInspector Samuels lifted his cup, blew on it to cool the foaming coffee, and hunched his shoulders slightly, a gesture of confusion and determination. “Something isn’t right about that manslaughter case that was tried last week in municipal court. You were there, Crusher, so you must know what I mean. The Jones case.” Crusher Davis, all six foot six and two-hundred-sixty-five pounds of him, had trouble fitting in the snug seat at Kellogg’s Kaffee Klatch. Not for the first time, he realized that the place’s name was dreadful, but as always, the cappuccino was first rate. He nodded in agreement. “That’s right, Inspector. And I’m glad that we are on the same track with this one. Frankly, I didn’t like that acquittal much either. The defendant took the stand, and then there was some conflicting testimony. It’s just possible that somebody lied to get her off. So maybe now it is up to us to figure out just who lied under oath.” He blew on his coffee and then, lost in thought, took a sip. It was too soon, and the hot coffee burned his tongue and made him cough. He reached for his glass of water and drank deeply. Still, during that split second, Crusher had been reviewing the case and the trial—Inspector Samuels was amazed. Anybody else would have been caught up in spasms and pain after drinking searing hot coffee. Crusher Davis had not lost his concentration for a moment. “Good thing that I was there reporting on the cases on the docket,” Crusher said. “This isn’t one of my Ask Martha cases, when I sort out clues in the letters I receive to my agony column nom de plum. At least, it isn’t yet.” Crusher looked around the coffee shop. “So we can talk about this and nobody will figure out that I write Martha’s column in the Chronicle. What an embarrassment it would be for everyone to know that I went from the gridiron to giving advice to the lovelorn!” Inspector Samuels smiled. “Let’s just talk this case through and see if we come up with any concrete reason for our bad feelings. The Jones house, on Willow Street, was where it all happened last September. Melissa Jones and her husband Hank were having another of their loud quarrels. We’d been called by the neighbors more than once when the Joneses got noisy and out of hand. It was odd that no complaint call came in that night. And when we were called, it was by Melissa Jones, as she testified. It was about eight o’clock at night. Her husband was dead—she reported that it had just happened. She claimed self-defense, and the jury bought it. After all, they knew the couple had a violent history.” “Yes. And the coroner said that death had been the result of her hitting him over the head with a poker. She’s no shrinking violet, that’s for sure. Title 9 had given her a chance to hone her athletic skills back in high school, and she’s in better shape than most men her age. What I don’t like, not one bit, is that the blow was from behind.” Crusher paused. “What was the official time of death, Inspector?” “The coroner said, remember, that he couldn’t be exact to the minute about the time of death. The body was in the living room in front of the fireplace, where there had been a fire. That heat may have somewhat slowed coagulation of the blood caused by the blow. ‘It’s not a precise science, times of death,’ the corner testified. ‘Given the fire, it could have been seven, or an hour later than that.’ “But she said she called immediately after he died, and if that’s so, it tends to back up her story of self-defense. It’s a natural reaction, given the seriousness of what happened. You want to get your story to the police right away, avoid suspicion. If, on the other hand, he did die at seven and she waited for an hour to call it in, maybe it was a premeditated crime, and she was spending that time getting her story straight. It’s a fair inference.” “The timing is crucial here.” “Giving the defendant the reasonable doubt—which the jury is supposed to do, after all—they accepted the later time of death, agreed that she had called the police immediately, and acquitted her.” “Which is why we are here now.” “Exactly. So, let’s go over the witnesses.” “Ok, Inspector. I’ve got my notes from the trial. First, there was John Eberley, the next door neighbor. I knew him in high school. He’s still single. Matter of fact, I always had the impression that he was kind of sweet on Melissa—Melissa Simpson, in her unmarried days. But she was Hank’s girl, even back then.” “Funny that the prosecutor didn’t bring that out.” “Well, he’s new around here. Doesn’t have the local background. Anyway, Eberley said that he had heard shouts and arguing off and on, from half past six to eight o’clock. He was, however, caught up in that new mystery on HBO, so he didn’t pay that much attention to what was said. Since the mystery ended at eight, he was quite sure of the time. It marked the last shouts that he heard from next door. He did also say that he’d heard Hank and Melissa argue far worse than they did that night.” “Yes. What did you make of Martha Cranston’s testimony?” “That was interesting. She had been walking her dog up and down Willow Street, just after seven o’clock. She thought it was a nicer street than the one she lived on. She said it was a really quiet, still night, and just warm enough so that some windows were open in all of the houses that she passed by, but still she heard nothing. I thought she was credible.” “They all were. That’s our problem.” “Then came Horace Osamway, the National Bank vice president, and a picture of rigid self-righteousness if there ever was one. He had come by earlier, he testified. The Joneses were way behind in their mortgage payments. He told them it had been a mistake to give them the mortgage in the first place. He said that he was pretty sure that they couldn’t make the payments up, but he was willing to give them one last chance. He said that his conversation with the couple became, on their side, pretty heated. Hank was blaming their predicament on Melissa being a spendthrift, while she was saying that he was a lousy provider, that sort of thing.” “With objections galore from the defense, I recall.” “Absolutely, on hearsay grounds. But enough of it was admissible so that the jury got the idea that they were not a happy couple. Far from it. Osamway said he left at five o’clock and by that time, he said, both Melissa and her husband had been drinking fairly heavily.” “Then there was Mildred Greene’s testimony. She passed by the house walking to the corner store about six o’clock. She said that she heard a big argument going on, something about ‘losing the house,’ and whose fault that was. She tried to tune it out, as a devoted churchgoer, because of the real atomic-submarine-class profanity that was being used, but it wasn’t possible. What really riled her was that when she returned from the store and passed the Jones house once again, an hour and a half later, the argument was still going on, and was just as intense as it had been earlier. They were even using some of the same—shall we say colorful—expressions that had been shouted earlier!” Crusher Davis returned to his office at the Chronicle. He had an idea. His next Ask Martha column ended with a question. “Does first love last? Tell us your experiences.” The following week, he had a number of replies, some very interesting, some rather sappy and saccharine. Two interested him in particular: The first, from Maiden Blush, had a local postmark. It gave a firm “no” to the proposition that first loves last. “People change. They start to drink. Stuff happens. Trust me. They aren’t the same people after a while.” Crusher opened the second letter. It also had a local postmark. “Yes, first loves last. Sometimes people make mistakes, but life can give you a second chance. That’s particularly true if you are willing to forget the past and give love a chance to bloom once again.” Davis called Inspector Samuels. “I’m not sure about that Jones case,” he said, “but I do have a pretty good idea that perjury was committed in open court. Let’s meet and I’ll tell you what Ask Martha has managed to find out.\nThe perjurer, John Eberley, is hoping for a reunion with his first love, Melissa. He is giving her an alibi, by stating that he had heard the couple quarrel as late as eight o’clock. That reinforces the defense view that the death had happened suddenly, without premeditation, at about that time, and was self-defense during the course of a heated argument, probably set off by their mortgage problem.\nIf the death had happened an hour earlier, then the case for the defendant becomes more difficult. Perhaps she was trying to hide something, or figure out how to disguise murder as self-defense. The fire set in the fireplace would have helped; lighting it after her husband’s death would have warmed the room and slowed blood coagulation, making the time of death seem later than it really was.\nNot one of the other witnesses supports John Eberley’s story. The coroner said that the death could have occurred as early as seven o’clock. Horace Osamway had left the Jones residence at five o’clock. Martha Cranston passed the house at a quarter to seven, and heard nothing. Mildred Greene, who heard loud arguments and swearing when she went to the store about six o’clock, and then when she returned, about seven-thirty. Interestingly enough, the same language was used. Could it have been a recording of the earlier fight, played later to fix the time in the mind of a witness seen through the window? Except for John Eberley, nobody else testified having heard arguments that late.\nDouble jeopardy may prevent Melissa Jones, who wrote the first Ask Martha letter, from being tried a second time. But it would not stop John Eberley, who wrote the second letter, from being tried for perjury in a misguided attempt to help his first love.\n\nPlease analyze all the clues and evidence presented in the story and identify who the culprit is. Explain your reasoning step by step, considering:\n1. The motives of different characters\n2. The opportunities each character had\n3. Any physical evidence or alibis\n4. The logical deduction from the clues presented\n\nSolve the mystery. Write down your thought process here.\n\n<THOUGHT PROCESS>\n<thought process here>\n</THOUGHT PROCESS>\n\nWho are the possible suspects? List them here:\n\n<SUSPECTS>\n<names(s) for all suspects here, comma separated>\n</SUSPECTS>\n\nWho is the culprit?  There is only one. If possible, include first and last names, as well as any aliases. Answer in the form:\n\n<CULPRIT>\n<name here>\n</CULPRIT>\n\nNow write down your reconstruction of the events of what actually happened.\n\n<EVENT RECONSTRUCTION>\n<event reconstruction here>\n</EVENT RECONSTRUCTION>\n\nFinally, explain why the other suspects are innocent.\n\n<WHY THE OTHER SUSPECTS ARE INNOCENT>\n<explanation here>\n</WHY THE OTHER SUSPECTS ARE INNOCENT>",
          "solution": "<THOUGHT PROCESS>\n1. Motive  \n   • Melissa Jones: would profit from Hank’s death (possibly insurance, certainly relief from an abusive marriage and looming foreclosure).  \n   • John Eberley: long-standing, unrequited love for Melissa; strong wish to see her free and perhaps available to him.  \n   • Horace Osamway, Martha Cranston, Mildred Greene: no discernible personal gain in Hank’s death or in lying for Melissa.  \n\n2. Opportunity & Ability  \n   • Only John lives next door, has immediate opportunity both to hear (or not hear) a quarrel and to manipulate what he later told the court.  \n   • Melissa was alone with Hank when he died; obviously had the physical opportunity to strike the fatal blow.  \n   • Others were mere passers-by.  \n\n3. Evidence & Testimony  \n   • Coroner: time of death between 7:00 and 8:00, but the fireplace fire could make the death look later than it was.  \n   • Mildred Greene: hears fierce argument at 6:00 and again at 7:30, with identical words—suspiciously like a tape replayed.  \n   • Martha Cranston: walks past at about 7:00; a still night, windows open—she hears nothing.  \n   • John Eberley: swears the argument is still raging up to 8:00. He is the ONLY witness placing loud quarrelling that late.  \n   • Two anonymous “Ask Martha” letters:  \n        – “Maiden Blush” (pessimistic about first love) plainly from Melissa.  \n        – The romantic “Yes, first loves last” letter fits John’s feelings and hope for a “second chance.”  \n      These letters show a secret link and a motive for John to help Melissa.  \n\n4. Logical Chain  \n   • If the fatal blow was struck nearer 7:00, Melissa had a full hour to stage the room, light the fire, and queue up a tape of their earlier fight (heard twice, verbatim, by Mildred) before phoning police at 8:00.  \n   • To make that hour-long gap believable, she needed a corroborating witness. John obligingly places the quarrel right up to 8:00.  \n   • Everyone else either places silence at 7:00 (Cranston) or says the identical quarrel was already over by 7:30 and apparently canned (Greene).  \n   • Therefore John’s testimony is the outlier—and exactly the testimony Melissa required to be acquitted.  \n\nConclusion: the deliberate falsehood in court (perjury) is John Eberley’s.  While Melissa may well have killed Hank, the puzzle’s target “culprit” – the one demonstrably guilty on the evidence we can prove – is the perjurer.\n</THOUGHT PROCESS>\n\n<SUSPECTS>\nMelissa Jones, John Eberley, Horace Osamway, Martha Cranston, Mildred Greene\n</SUSPECTS>\n\n<CULPRIT>\nJohn Eberley\n</CULPRIT>\n\n<EVENT RECONSTRUCTION>\nAbout 6 p.m. Hank and Melissa Jones were in a fierce, booze-fueled quarrel (heard by Mildred Greene). Shortly after 7 p.m., perhaps in sudden rage or cold blood, Melissa struck Hank from behind with the fireplace poker, killing him.  \nRealising the legal danger, she opened all the windows so neighbours could hear, re-played a tape of the earlier 6 p.m. fight at about 7 : 30, lit a brisk fire to blur the coroner’s timing, rehearsed her self-defence story, then phoned police a few minutes before 8 p.m.  \nMeanwhile, next-door neighbour John Eberley—still hopelessly in love with his “first love” Melissa—agreed to shore up her alibi. When the case came to trial he swore that the couple were still arguing right up to 8 o’clock. That testimony created the reasonable doubt the jury needed to acquit Melissa.  \nJohn, hoping that “first love lasts,” later wrote the gushy Ask Martha letter that tipped Crusher Davis off to his feelings and thus to his perjury.\n</EVENT RECONSTRUCTION>\n\n<WHY THE OTHER SUSPECTS ARE INNOCENT>\n• Melissa Jones: Probably guilty of Hank’s death, but the question at hand is who can be proved guilty now. She has already been tried and acquitted; double jeopardy prevents further prosecution.  \n• Horace Osamway: Bank VP left at 5 p.m., has no stake in shielding Melissa, and his testimony was corroborated by others.  \n• Martha Cranston: Merely a passer-by who heard nothing; her quiet-street observation matches the fabricated time-line and conflicts with John’s story, showing she did not collude.  \n• Mildred Greene: Another passer-by whose truthful recollection of identical profanity at 6 p.m. and 7 : 30 p.m. unknowingly exposed the recorded replay; she clearly was not lying for Melissa.  \nTherefore, only John Eberley had both the motive (romantic hope) and the demonstrable false testimony. He is the sole culprit—guilty of perjury.\n</WHY THE OTHER SUSPECTS ARE INNOCENT>",
          "length_warning": "",
          "model": "o3",
          "reveal_segment": "The perjurer, John Eberley, is hoping for a reunion with his first love, Melissa. He is giving her an alibi, by stating that he had heard the couple quarrel as late as eight o’clock. That reinforces the defense view that the death had happened suddenly, without premeditation, at about that time, and was self-defense during the course of a heated argument, probably set off by their mortgage problem.\nIf the death had happened an hour earlier, then the case for the defendant becomes more difficult. Perhaps she was trying to hide something, or figure out how to disguise murder as self-defense. The fire set in the fireplace would have helped; lighting it after her husband’s death would have warmed the room and slowed blood coagulation, making the time of death seem later than it really was.\nNot one of the other witnesses supports John Eberley’s story. The coroner said that the death could have occurred as early as seven o’clock. Horace Osamway had left the Jones residence at five o’clock. Martha Cranston passed the house at a quarter to seven, and heard nothing. Mildred Greene, who heard loud arguments and swearing when she went to the store about six o’clock, and then when she returned, about seven-thirty. Interestingly enough, the same language was used. Could it have been a recording of the earlier fight, played later to fix the time in the mind of a witness seen through the window? Except for John Eberley, nobody else testified having heard arguments that late.\nDouble jeopardy may prevent Melissa Jones, who wrote the first Ask Martha letter, from being tried a second time. But it would not stop John Eberley, who wrote the second letter, from being tried for perjury in a misguided attempt to help his first love."
        }
      },
      "doc_id": "ASK_MARTHA_—_THE_PERJURER"
    }
  ]
}