{
  "item_metadata": {
    "item_id": "The_Jackie_Mitchell_Autographed_Baseball_Mystery",
    "num_documents": 1
  },
  "documents": [
    {
      "content": "All Centerville was in mourning when John Plympton died. He was a banker who knew everyone and had helped many people over the years. For forty years he had authorized loans that more conservative lenders wouldn’t have granted. Then, after he retired, he was known locally as something of a soft touch, particularly after he lost his wife. Helping people became more than a hobby. It was almost a reason for him to keep living. Why, some people even speculated that if he kept it up, he wouldn’t have much to leave to his only grandchild, Simon Plympton, who lived with his wife Susan at the old Plympton residence on Maple Street. I suppose that view was shared by Simon and Susan, whose style of living was quite frugal, tending to show that they had to stretch their meager resources. They were pleased to live with John Plympton, whom they genuinely admired, and grateful that the arrangement was rent-free. “Some day, after all, you’ll own this property, Simon,” John would say. And he was always a man of his word. I had been sent to interview John Plympton for a local interest feature story. It was known that he wasn’t feeling very well, so my editor at the Chronicle wanted to record something of his life and times while that was still possible. This would be under my regular byline, Richard Harding Davis. It wasn’t for the sports pages, so the full moniker, not Crusher Davis, which was how they ran my stories on the sports pages, would be used. It certainly wasn’t appropriate for the Ask Martha column I write, largely advice for the lovelorn. John Plympton was glad to see me, and he reminisced about my family, whom he had known for several generations. I suppose I share the prejudices of most young people, believing that older people’s talk can be tedious. But that wasn’t the case with John Plympton. He was fascinating as he talked about our town and how it had grown and expanded, the families that he had known and the celebrities that had visited here. Why, Lou Gehrig and Babe Ruth had once played an exhibition baseball game here, when they were barnstorming after spring training on their way to start the official season in New York! “They signed that baseball for me,” the old man said with a sparkle in his eye. “I was there and saw the game. I was ten years old.” He nodded towards a baseball trophy in a plastic case on his display shelf, near the wardrobe closet. I walked over and looked at it. Sure thing, both baseball legends had clearly signed the baseball, and one of them had dated it, April 2, 1931. I thought for a minute. “That’s the year they tied for leading the American League in home runs, at 46 each!” His face shone with pleasure. “Good for you. That baseball ought to go to someone who will appreciate it. I’ll make sure that it’s yours when I’m gone, if you’d like to have it, Crusher!” “IF I wanted it!” It would be a treasure, even though there was a third signature on the ball, clearly visible - Jackie Mitchell. It was probably some kid who had seen the great Ruth and Gehrig play and just wanted to link his name to theirs by signing the same baseball. “I appreciate it very much, Mr. Plympton. But you’ve got many years left.” At that point, his nurse, Melinda Baker, entered the room to say that Dr. Edgar Newton had just arrived. So I took my leave, as Dr. Newton entered the room. He was the dean of our local physicians, a solid man, but deaf as a post. The interview wasn’t complete, so Mr. Plympton smilingly agreed to see me again in a few days. “Then you can tell me how you got that ‘Ask Martha’ byline,” he said with a twinkle in his eye. “But, I think that the baseball will be of greater interest to Crusher Davis.” Clearly, Centerville had few secrets from John Plympton. I returned the baseball to its place on the display shelf and left the room. I returned as arranged for our second interview. John Plympton was weaker, but he had a merry glint in his eye. Susan Plympton was in the room reading to him, but she rose and left as I entered the room. Melinda Baker, the nurse, was plumping the old man’s pillows to make him more comfortable. Then she hovered at her nurse’s station near the wardrobe, anxious to see that her patient did not become overly tired. He noticed my eager expression. “I see you have done some research about that baseball.” I had indeed. First, I had started off by Googling Babe Ruth and Lou Gehrig autographed baseballs, then the year 1931. I don’t know why, but I added the name Jackie Mitchell to the mix. Bingo! It turned out that Jackie Mitchell was a 17-year-old girl and a fabulous left-handed pitcher. Pitching for the Chattanooga Lookouts, a Class AA Southern League team with whom she had just signed a contract as the first female athlete in organized professional baseball, she had actually faced Babe Ruth and Lou Gehrig in an exhibition game - and struck them both out! With a wicked sweeping curve ball that broke over the plate low and was virtually unhittable - she had learned from their Memphis neighbor, the future Major League pitcher Dazzy Vance - she had her moment of fame. Then Commissioner of Baseball Landis barred women from playing professional baseball. But she was always known as a pitcher of great ability. I couldn’t begin to think what a baseball signed by Ruth, Gehrig and Mitchell on that day would be worth. It could be worth as much as $50,000 to a collector. It was surely the only one in existence! “You’re the only one who knows the story of that baseball,” he said. “My family was never very interested. By the way, my lawyer is coming here this afternoon, and I’ll make a codicil to my will, leaving the baseball to you, formal and proper.” But just a few hours later, after his luncheon, he took a nap, and it turned out to be his final one. When I next saw the room in which we had spoken, to retrieve a notebook that I had misplaced during the second interview, the baseball was gone. I asked Simon Plympton about it. “Never really noticed - Babe Ruth and Lou Gehrig both signed the baseball, you say? Oh, yes, now I remember. Granddad did mention it. We’d better have a careful search.” His wife Susan was clearly the practical one in the family. “I’ll put together a list of visitors, that last day. You’ve probably heard that the Centerville Hospital gets most of the stocks and trust funds, while Simon inherited the house and furnishings. So the baseball is ours by rights. It’s bound to turn up somewhere.” But she didn’t seem very convinced that it would. As a matter of fact, she only became really interested when I shared with her the full story of the baseball and its three signatures. The visitors had been few that last day, and Simon, concentrating for a change, remembered seeing the baseball on the shelf after his Grandfather died. The Plymptons had been at luncheon in their dining room when the nurse had gently informed them that Mr. John Plympton had passed on. She then left at Susan Plympton’s request to call Dr. Newton from the downstairs study. He arrived shortly and conducted a perfunctory examination. His patient had died of natural causes, just worn out. Then the room had been closed, following the examination and removal by the Carter Funeral Home, when Simon had taken a last look at the room and its furnishings. No. He just couldn’t remember at that point whether the baseball was still there or not. There was no question of the autographed baseball going to me now, regardless of what John Plympton had wished. He hadn’t put it in writing, and when I raised the matter with Melinda Baker, she said that she just hadn’t paid attention to our conversation. She had medical matters to attend to. And there went my only witness to what he had wanted to do. That left the present whereabouts of the autographed ball a mystery. But knowing the town as I did, it wasn’t hard to find the ball. There it was, in the center window of Al’s Pawn Parlor and Sporting Goods Store. Ordinarily a pawned item would not be displayed so prominently, but Al told me that the person who pawned the baseball had received a lot of money, $5,000, and he doubted that the money would be repaid and the pledge redeemed. Since I knew the autographed baseball was worth at least ten times that sum, I knew the person who took it would be along shortly. It wasn’t hard for Crusher Davis to figure out who had pawned the baseball and was now anxiously trying to retrieve it.",
      "metadata": {
        "original_metadata": {
          "case_id": "The Jackie Mitchell Autographed Baseball Mystery",
          "case_name": "The Jackie Mitchell Autographed Baseball Mystery",
          "author_name": "Robbie Cutler",
          "author_url": "https://www.5minutemystery.com/author/RobbieCutler",
          "case_url": "https://www.5minutemystery.com/mystery/the-jackie-mitchell-autographed-baseball-mystery",
          "mystery_text": "All Centerville was in mourning when John Plympton died. He was a banker who knew everyone and had helped many people over the years. For forty years he had authorized loans that more conservative lenders wouldn’t have granted. Then, after he retired, he was known locally as something of a soft touch, particularly after he lost his wife. Helping people became more than a hobby. It was almost a reason for him to keep living. Why, some people even speculated that if he kept it up, he wouldn’t have much to leave to his only grandchild, Simon Plympton, who lived with his wife Susan at the old Plympton residence on Maple Street. I suppose that view was shared by Simon and Susan, whose style of living was quite frugal, tending to show that they had to stretch their meager resources. They were pleased to live with John Plympton, whom they genuinely admired, and grateful that the arrangement was rent-free. “Some day, after all, you’ll own this property, Simon,” John would say. And he was always a man of his word. I had been sent to interview John Plympton for a local interest feature story. It was known that he wasn’t feeling very well, so my editor at the Chronicle wanted to record something of his life and times while that was still possible. This would be under my regular byline, Richard Harding Davis. It wasn’t for the sports pages, so the full moniker, not Crusher Davis, which was how they ran my stories on the sports pages, would be used. It certainly wasn’t appropriate for the Ask Martha column I write, largely advice for the lovelorn. John Plympton was glad to see me, and he reminisced about my family, whom he had known for several generations. I suppose I share the prejudices of most young people, believing that older people’s talk can be tedious. But that wasn’t the case with John Plympton. He was fascinating as he talked about our town and how it had grown and expanded, the families that he had known and the celebrities that had visited here. Why, Lou Gehrig and Babe Ruth had once played an exhibition baseball game here, when they were barnstorming after spring training on their way to start the official season in New York! “They signed that baseball for me,” the old man said with a sparkle in his eye. “I was there and saw the game. I was ten years old.” He nodded towards a baseball trophy in a plastic case on his display shelf, near the wardrobe closet. I walked over and looked at it. Sure thing, both baseball legends had clearly signed the baseball, and one of them had dated it, April 2, 1931. I thought for a minute. “That’s the year they tied for leading the American League in home runs, at 46 each!” His face shone with pleasure. “Good for you. That baseball ought to go to someone who will appreciate it. I’ll make sure that it’s yours when I’m gone, if you’d like to have it, Crusher!” “IF I wanted it!” It would be a treasure, even though there was a third signature on the ball, clearly visible - Jackie Mitchell. It was probably some kid who had seen the great Ruth and Gehrig play and just wanted to link his name to theirs by signing the same baseball. “I appreciate it very much, Mr. Plympton. But you’ve got many years left.” At that point, his nurse, Melinda Baker, entered the room to say that Dr. Edgar Newton had just arrived. So I took my leave, as Dr. Newton entered the room. He was the dean of our local physicians, a solid man, but deaf as a post. The interview wasn’t complete, so Mr. Plympton smilingly agreed to see me again in a few days. “Then you can tell me how you got that ‘Ask Martha’ byline,” he said with a twinkle in his eye. “But, I think that the baseball will be of greater interest to Crusher Davis.” Clearly, Centerville had few secrets from John Plympton. I returned the baseball to its place on the display shelf and left the room. I returned as arranged for our second interview. John Plympton was weaker, but he had a merry glint in his eye. Susan Plympton was in the room reading to him, but she rose and left as I entered the room. Melinda Baker, the nurse, was plumping the old man’s pillows to make him more comfortable. Then she hovered at her nurse’s station near the wardrobe, anxious to see that her patient did not become overly tired. He noticed my eager expression. “I see you have done some research about that baseball.” I had indeed. First, I had started off by Googling Babe Ruth and Lou Gehrig autographed baseballs, then the year 1931. I don’t know why, but I added the name Jackie Mitchell to the mix. Bingo! It turned out that Jackie Mitchell was a 17-year-old girl and a fabulous left-handed pitcher. Pitching for the Chattanooga Lookouts, a Class AA Southern League team with whom she had just signed a contract as the first female athlete in organized professional baseball, she had actually faced Babe Ruth and Lou Gehrig in an exhibition game - and struck them both out! With a wicked sweeping curve ball that broke over the plate low and was virtually unhittable - she had learned from their Memphis neighbor, the future Major League pitcher Dazzy Vance - she had her moment of fame. Then Commissioner of Baseball Landis barred women from playing professional baseball. But she was always known as a pitcher of great ability. I couldn’t begin to think what a baseball signed by Ruth, Gehrig and Mitchell on that day would be worth. It could be worth as much as $50,000 to a collector. It was surely the only one in existence! “You’re the only one who knows the story of that baseball,” he said. “My family was never very interested. By the way, my lawyer is coming here this afternoon, and I’ll make a codicil to my will, leaving the baseball to you, formal and proper.” But just a few hours later, after his luncheon, he took a nap, and it turned out to be his final one. When I next saw the room in which we had spoken, to retrieve a notebook that I had misplaced during the second interview, the baseball was gone. I asked Simon Plympton about it. “Never really noticed - Babe Ruth and Lou Gehrig both signed the baseball, you say? Oh, yes, now I remember. Granddad did mention it. We’d better have a careful search.” His wife Susan was clearly the practical one in the family. “I’ll put together a list of visitors, that last day. You’ve probably heard that the Centerville Hospital gets most of the stocks and trust funds, while Simon inherited the house and furnishings. So the baseball is ours by rights. It’s bound to turn up somewhere.” But she didn’t seem very convinced that it would. As a matter of fact, she only became really interested when I shared with her the full story of the baseball and its three signatures. The visitors had been few that last day, and Simon, concentrating for a change, remembered seeing the baseball on the shelf after his Grandfather died. The Plymptons had been at luncheon in their dining room when the nurse had gently informed them that Mr. John Plympton had passed on. She then left at Susan Plympton’s request to call Dr. Newton from the downstairs study. He arrived shortly and conducted a perfunctory examination. His patient had died of natural causes, just worn out. Then the room had been closed, following the examination and removal by the Carter Funeral Home, when Simon had taken a last look at the room and its furnishings. No. He just couldn’t remember at that point whether the baseball was still there or not. There was no question of the autographed baseball going to me now, regardless of what John Plympton had wished. He hadn’t put it in writing, and when I raised the matter with Melinda Baker, she said that she just hadn’t paid attention to our conversation. She had medical matters to attend to. And there went my only witness to what he had wanted to do. That left the present whereabouts of the autographed ball a mystery. But knowing the town as I did, it wasn’t hard to find the ball. There it was, in the center window of Al’s Pawn Parlor and Sporting Goods Store. Ordinarily a pawned item would not be displayed so prominently, but Al told me that the person who pawned the baseball had received a lot of money, $5,000, and he doubted that the money would be repaid and the pledge redeemed. Since I knew the autographed baseball was worth at least ten times that sum, I knew the person who took it would be along shortly. It wasn’t hard for Crusher Davis to figure out who had pawned the baseball and was now anxiously trying to retrieve it.",
          "answer_options": "(a) Dr. Edgar Newton; (b) Melinda Baker; (c) Simon Plympton; (d) Susan Plympton",
          "correct_answer": "(d) Susan Plympton",
          "reveal_text": "Simon and Susan Plympton were concerned about John Plympton’s generosity in giving away his property. They were not dishonest, however, and would certainly not steal from their benefactor. Of the two, Simon was rather vague about material things, which forced Susan to be the practical spouse. And when John Plympton died, she thought it important to realize some money for their debts by pawning the autographed baseball.\nNurse Melinda Baker had the opportunity to hear about the baseball’s real value when she was in the room at her nursing station during Crusher’s conversation with John Plympton. She claimed, however, not to have paid attention to that conversation. Had she stolen the baseball, it is highly unlikely that she would have taken it to the obvious local pawn shop, where tracing by the police would quickly have identified the thief. And Dr. Edgar Newton, the dean of the local medical fraternity and “deaf as a post,” did not hear the conversation that pointed to the baseball’s actual value. As with Nurse Baker, if he had stolen it he would never have pawned it at Al’s Pawn Shop.\nSince no crime was committed, my only sleuthing was for my own curiosity. When Susan Plympton redeemed her own property a few days later it was to place it with a national auction house, such as Sotheby’s or Christie’s, where this rare and valuable autographed baseball would attract bids closer to its real value.",
          "attempts": 806,
          "solve_rate": 31.5,
          "text_length": 8436,
          "puzzle_data": {
            "case_name": "The Jackie Mitchell Autographed Baseball Mystery",
            "case_url": "https://www.5minutemystery.com/mystery/the-jackie-mitchell-autographed-baseball-mystery",
            "author_name": "Robbie Cutler",
            "author_url": "https://www.5minutemystery.com/author/RobbieCutler",
            "attempts": "806",
            "solve_rate": "31.5",
            "mystery_text": "All Centerville was in mourning when John Plympton died. He was a banker who knew everyone and had helped many people over the years. For forty years he had authorized loans that more conservative lenders wouldn’t have granted. Then, after he retired, he was known locally as something of a soft touch, particularly after he lost his wife. Helping people became more than a hobby. It was almost a reason for him to keep living. Why, some people even speculated that if he kept it up, he wouldn’t have much to leave to his only grandchild, Simon Plympton, who lived with his wife Susan at the old Plympton residence on Maple Street. I suppose that view was shared by Simon and Susan, whose style of living was quite frugal, tending to show that they had to stretch their meager resources. They were pleased to live with John Plympton, whom they genuinely admired, and grateful that the arrangement was rent-free. “Some day, after all, you’ll own this property, Simon,” John would say. And he was always a man of his word. I had been sent to interview John Plympton for a local interest feature story. It was known that he wasn’t feeling very well, so my editor at the Chronicle wanted to record something of his life and times while that was still possible. This would be under my regular byline, Richard Harding Davis. It wasn’t for the sports pages, so the full moniker, not Crusher Davis, which was how they ran my stories on the sports pages, would be used. It certainly wasn’t appropriate for the Ask Martha column I write, largely advice for the lovelorn. John Plympton was glad to see me, and he reminisced about my family, whom he had known for several generations. I suppose I share the prejudices of most young people, believing that older people’s talk can be tedious. But that wasn’t the case with John Plympton. He was fascinating as he talked about our town and how it had grown and expanded, the families that he had known and the celebrities that had visited here. Why, Lou Gehrig and Babe Ruth had once played an exhibition baseball game here, when they were barnstorming after spring training on their way to start the official season in New York! “They signed that baseball for me,” the old man said with a sparkle in his eye. “I was there and saw the game. I was ten years old.” He nodded towards a baseball trophy in a plastic case on his display shelf, near the wardrobe closet. I walked over and looked at it. Sure thing, both baseball legends had clearly signed the baseball, and one of them had dated it, April 2, 1931. I thought for a minute. “That’s the year they tied for leading the American League in home runs, at 46 each!” His face shone with pleasure. “Good for you. That baseball ought to go to someone who will appreciate it. I’ll make sure that it’s yours when I’m gone, if you’d like to have it, Crusher!” “IF I wanted it!” It would be a treasure, even though there was a third signature on the ball, clearly visible - Jackie Mitchell. It was probably some kid who had seen the great Ruth and Gehrig play and just wanted to link his name to theirs by signing the same baseball. “I appreciate it very much, Mr. Plympton. But you’ve got many years left.” At that point, his nurse, Melinda Baker, entered the room to say that Dr. Edgar Newton had just arrived. So I took my leave, as Dr. Newton entered the room. He was the dean of our local physicians, a solid man, but deaf as a post. The interview wasn’t complete, so Mr. Plympton smilingly agreed to see me again in a few days. “Then you can tell me how you got that ‘Ask Martha’ byline,” he said with a twinkle in his eye. “But, I think that the baseball will be of greater interest to Crusher Davis.” Clearly, Centerville had few secrets from John Plympton. I returned the baseball to its place on the display shelf and left the room. I returned as arranged for our second interview. John Plympton was weaker, but he had a merry glint in his eye. Susan Plympton was in the room reading to him, but she rose and left as I entered the room. Melinda Baker, the nurse, was plumping the old man’s pillows to make him more comfortable. Then she hovered at her nurse’s station near the wardrobe, anxious to see that her patient did not become overly tired. He noticed my eager expression. “I see you have done some research about that baseball.” I had indeed. First, I had started off by Googling Babe Ruth and Lou Gehrig autographed baseballs, then the year 1931. I don’t know why, but I added the name Jackie Mitchell to the mix. Bingo! It turned out that Jackie Mitchell was a 17-year-old girl and a fabulous left-handed pitcher. Pitching for the Chattanooga Lookouts, a Class AA Southern League team with whom she had just signed a contract as the first female athlete in organized professional baseball, she had actually faced Babe Ruth and Lou Gehrig in an exhibition game - and struck them both out! With a wicked sweeping curve ball that broke over the plate low and was virtually unhittable - she had learned from their Memphis neighbor, the future Major League pitcher Dazzy Vance - she had her moment of fame. Then Commissioner of Baseball Landis barred women from playing professional baseball. But she was always known as a pitcher of great ability. I couldn’t begin to think what a baseball signed by Ruth, Gehrig and Mitchell on that day would be worth. It could be worth as much as $50,000 to a collector. It was surely the only one in existence! “You’re the only one who knows the story of that baseball,” he said. “My family was never very interested. By the way, my lawyer is coming here this afternoon, and I’ll make a codicil to my will, leaving the baseball to you, formal and proper.” But just a few hours later, after his luncheon, he took a nap, and it turned out to be his final one. When I next saw the room in which we had spoken, to retrieve a notebook that I had misplaced during the second interview, the baseball was gone. I asked Simon Plympton about it. “Never really noticed - Babe Ruth and Lou Gehrig both signed the baseball, you say? Oh, yes, now I remember. Granddad did mention it. We’d better have a careful search.” His wife Susan was clearly the practical one in the family. “I’ll put together a list of visitors, that last day. You’ve probably heard that the Centerville Hospital gets most of the stocks and trust funds, while Simon inherited the house and furnishings. So the baseball is ours by rights. It’s bound to turn up somewhere.” But she didn’t seem very convinced that it would. As a matter of fact, she only became really interested when I shared with her the full story of the baseball and its three signatures. The visitors had been few that last day, and Simon, concentrating for a change, remembered seeing the baseball on the shelf after his Grandfather died. The Plymptons had been at luncheon in their dining room when the nurse had gently informed them that Mr. John Plympton had passed on. She then left at Susan Plympton’s request to call Dr. Newton from the downstairs study. He arrived shortly and conducted a perfunctory examination. His patient had died of natural causes, just worn out. Then the room had been closed, following the examination and removal by the Carter Funeral Home, when Simon had taken a last look at the room and its furnishings. No. He just couldn’t remember at that point whether the baseball was still there or not. There was no question of the autographed baseball going to me now, regardless of what John Plympton had wished. He hadn’t put it in writing, and when I raised the matter with Melinda Baker, she said that she just hadn’t paid attention to our conversation. She had medical matters to attend to. And there went my only witness to what he had wanted to do. That left the present whereabouts of the autographed ball a mystery. But knowing the town as I did, it wasn’t hard to find the ball. There it was, in the center window of Al’s Pawn Parlor and Sporting Goods Store. Ordinarily a pawned item would not be displayed so prominently, but Al told me that the person who pawned the baseball had received a lot of money, $5,000, and he doubted that the money would be repaid and the pledge redeemed. Since I knew the autographed baseball was worth at least ten times that sum, I knew the person who took it would be along shortly. It wasn’t hard for Crusher Davis to figure out who had pawned the baseball and was now anxiously trying to retrieve it.",
            "answer_options": "(a) Dr. Edgar Newton; (b) Melinda Baker; (c) Simon Plympton; (d) Susan Plympton",
            "answer": "(d) Susan Plympton",
            "outcome": "Simon and Susan Plympton were concerned about John Plympton’s generosity in giving away his property. They were not dishonest, however, and would certainly not steal from their benefactor. Of the two, Simon was rather vague about material things, which forced Susan to be the practical spouse. And when John Plympton died, she thought it important to realize some money for their debts by pawning the autographed baseball.\nNurse Melinda Baker had the opportunity to hear about the baseball’s real value when she was in the room at her nursing station during Crusher’s conversation with John Plympton. She claimed, however, not to have paid attention to that conversation. Had she stolen the baseball, it is highly unlikely that she would have taken it to the obvious local pawn shop, where tracing by the police would quickly have identified the thief. And Dr. Edgar Newton, the dean of the local medical fraternity and “deaf as a post,” did not hear the conversation that pointed to the baseball’s actual value. As with Nurse Baker, if he had stolen it he would never have pawned it at Al’s Pawn Shop.\nSince no crime was committed, my only sleuthing was for my own curiosity. When Susan Plympton redeemed her own property a few days later it was to place it with a national auction house, such as Sotheby’s or Christie’s, where this rare and valuable autographed baseball would attract bids closer to its real value."
          }
        },
        "culprit(s), human annotated": "(d) Susan Plympton",
        "detection": {
          "prompt": "System: You are an ingenious and clever detective who will examine all the clues and reason through all the evidence to solve the crime.\n\nUser: Here is a detective puzzle. Please read the story carefully before you decide who the culprit is.\n\n\nAll Centerville was in mourning when John Plympton died. He was a banker who knew everyone and had helped many people over the years. For forty years he had authorized loans that more conservative lenders wouldn’t have granted. Then, after he retired, he was known locally as something of a soft touch, particularly after he lost his wife. Helping people became more than a hobby. It was almost a reason for him to keep living. Why, some people even speculated that if he kept it up, he wouldn’t have much to leave to his only grandchild, Simon Plympton, who lived with his wife Susan at the old Plympton residence on Maple Street. I suppose that view was shared by Simon and Susan, whose style of living was quite frugal, tending to show that they had to stretch their meager resources. They were pleased to live with John Plympton, whom they genuinely admired, and grateful that the arrangement was rent-free. “Some day, after all, you’ll own this property, Simon,” John would say. And he was always a man of his word. I had been sent to interview John Plympton for a local interest feature story. It was known that he wasn’t feeling very well, so my editor at the Chronicle wanted to record something of his life and times while that was still possible. This would be under my regular byline, Richard Harding Davis. It wasn’t for the sports pages, so the full moniker, not Crusher Davis, which was how they ran my stories on the sports pages, would be used. It certainly wasn’t appropriate for the Ask Martha column I write, largely advice for the lovelorn. John Plympton was glad to see me, and he reminisced about my family, whom he had known for several generations. I suppose I share the prejudices of most young people, believing that older people’s talk can be tedious. But that wasn’t the case with John Plympton. He was fascinating as he talked about our town and how it had grown and expanded, the families that he had known and the celebrities that had visited here. Why, Lou Gehrig and Babe Ruth had once played an exhibition baseball game here, when they were barnstorming after spring training on their way to start the official season in New York! “They signed that baseball for me,” the old man said with a sparkle in his eye. “I was there and saw the game. I was ten years old.” He nodded towards a baseball trophy in a plastic case on his display shelf, near the wardrobe closet. I walked over and looked at it. Sure thing, both baseball legends had clearly signed the baseball, and one of them had dated it, April 2, 1931. I thought for a minute. “That’s the year they tied for leading the American League in home runs, at 46 each!” His face shone with pleasure. “Good for you. That baseball ought to go to someone who will appreciate it. I’ll make sure that it’s yours when I’m gone, if you’d like to have it, Crusher!” “IF I wanted it!” It would be a treasure, even though there was a third signature on the ball, clearly visible - Jackie Mitchell. It was probably some kid who had seen the great Ruth and Gehrig play and just wanted to link his name to theirs by signing the same baseball. “I appreciate it very much, Mr. Plympton. But you’ve got many years left.” At that point, his nurse, Melinda Baker, entered the room to say that Dr. Edgar Newton had just arrived. So I took my leave, as Dr. Newton entered the room. He was the dean of our local physicians, a solid man, but deaf as a post. The interview wasn’t complete, so Mr. Plympton smilingly agreed to see me again in a few days. “Then you can tell me how you got that ‘Ask Martha’ byline,” he said with a twinkle in his eye. “But, I think that the baseball will be of greater interest to Crusher Davis.” Clearly, Centerville had few secrets from John Plympton. I returned the baseball to its place on the display shelf and left the room. I returned as arranged for our second interview. John Plympton was weaker, but he had a merry glint in his eye. Susan Plympton was in the room reading to him, but she rose and left as I entered the room. Melinda Baker, the nurse, was plumping the old man’s pillows to make him more comfortable. Then she hovered at her nurse’s station near the wardrobe, anxious to see that her patient did not become overly tired. He noticed my eager expression. “I see you have done some research about that baseball.” I had indeed. First, I had started off by Googling Babe Ruth and Lou Gehrig autographed baseballs, then the year 1931. I don’t know why, but I added the name Jackie Mitchell to the mix. Bingo! It turned out that Jackie Mitchell was a 17-year-old girl and a fabulous left-handed pitcher. Pitching for the Chattanooga Lookouts, a Class AA Southern League team with whom she had just signed a contract as the first female athlete in organized professional baseball, she had actually faced Babe Ruth and Lou Gehrig in an exhibition game - and struck them both out! With a wicked sweeping curve ball that broke over the plate low and was virtually unhittable - she had learned from their Memphis neighbor, the future Major League pitcher Dazzy Vance - she had her moment of fame. Then Commissioner of Baseball Landis barred women from playing professional baseball. But she was always known as a pitcher of great ability. I couldn’t begin to think what a baseball signed by Ruth, Gehrig and Mitchell on that day would be worth. It could be worth as much as $50,000 to a collector. It was surely the only one in existence! “You’re the only one who knows the story of that baseball,” he said. “My family was never very interested. By the way, my lawyer is coming here this afternoon, and I’ll make a codicil to my will, leaving the baseball to you, formal and proper.” But just a few hours later, after his luncheon, he took a nap, and it turned out to be his final one. When I next saw the room in which we had spoken, to retrieve a notebook that I had misplaced during the second interview, the baseball was gone. I asked Simon Plympton about it. “Never really noticed - Babe Ruth and Lou Gehrig both signed the baseball, you say? Oh, yes, now I remember. Granddad did mention it. We’d better have a careful search.” His wife Susan was clearly the practical one in the family. “I’ll put together a list of visitors, that last day. You’ve probably heard that the Centerville Hospital gets most of the stocks and trust funds, while Simon inherited the house and furnishings. So the baseball is ours by rights. It’s bound to turn up somewhere.” But she didn’t seem very convinced that it would. As a matter of fact, she only became really interested when I shared with her the full story of the baseball and its three signatures. The visitors had been few that last day, and Simon, concentrating for a change, remembered seeing the baseball on the shelf after his Grandfather died. The Plymptons had been at luncheon in their dining room when the nurse had gently informed them that Mr. John Plympton had passed on. She then left at Susan Plympton’s request to call Dr. Newton from the downstairs study. He arrived shortly and conducted a perfunctory examination. His patient had died of natural causes, just worn out. Then the room had been closed, following the examination and removal by the Carter Funeral Home, when Simon had taken a last look at the room and its furnishings. No. He just couldn’t remember at that point whether the baseball was still there or not. There was no question of the autographed baseball going to me now, regardless of what John Plympton had wished. He hadn’t put it in writing, and when I raised the matter with Melinda Baker, she said that she just hadn’t paid attention to our conversation. She had medical matters to attend to. And there went my only witness to what he had wanted to do. That left the present whereabouts of the autographed ball a mystery. But knowing the town as I did, it wasn’t hard to find the ball. There it was, in the center window of Al’s Pawn Parlor and Sporting Goods Store. Ordinarily a pawned item would not be displayed so prominently, but Al told me that the person who pawned the baseball had received a lot of money, $5,000, and he doubted that the money would be repaid and the pledge redeemed. Since I knew the autographed baseball was worth at least ten times that sum, I knew the person who took it would be along shortly. It wasn’t hard for Crusher Davis to figure out who had pawned the baseball and was now anxiously trying to retrieve it.\nSimon and Susan Plympton were concerned about John Plympton’s generosity in giving away his property. They were not dishonest, however, and would certainly not steal from their benefactor. Of the two, Simon was rather vague about material things, which forced Susan to be the practical spouse. And when John Plympton died, she thought it important to realize some money for their debts by pawning the autographed baseball.\nNurse Melinda Baker had the opportunity to hear about the baseball’s real value when she was in the room at her nursing station during Crusher’s conversation with John Plympton. She claimed, however, not to have paid attention to that conversation. Had she stolen the baseball, it is highly unlikely that she would have taken it to the obvious local pawn shop, where tracing by the police would quickly have identified the thief. And Dr. Edgar Newton, the dean of the local medical fraternity and “deaf as a post,” did not hear the conversation that pointed to the baseball’s actual value. As with Nurse Baker, if he had stolen it he would never have pawned it at Al’s Pawn Shop.\nSince no crime was committed, my only sleuthing was for my own curiosity. When Susan Plympton redeemed her own property a few days later it was to place it with a national auction house, such as Sotheby’s or Christie’s, where this rare and valuable autographed baseball would attract bids closer to its real value.\n\nPlease analyze all the clues and evidence presented in the story and identify who the culprit is. Explain your reasoning step by step, considering:\n1. The motives of different characters\n2. The opportunities each character had\n3. Any physical evidence or alibis\n4. The logical deduction from the clues presented\n\nSolve the mystery. Write down your thought process here.\n\n<THOUGHT PROCESS>\n<thought process here>\n</THOUGHT PROCESS>\n\nWho are the possible suspects? List them here:\n\n<SUSPECTS>\n<names(s) for all suspects here, comma separated>\n</SUSPECTS>\n\nWho is the culprit?  There is only one. If possible, include first and last names, as well as any aliases. Answer in the form:\n\n<CULPRIT>\n<name here>\n</CULPRIT>\n\nNow write down your reconstruction of the events of what actually happened.\n\n<EVENT RECONSTRUCTION>\n<event reconstruction here>\n</EVENT RECONSTRUCTION>\n\nFinally, explain why the other suspects are innocent.\n\n<WHY THE OTHER SUSPECTS ARE INNOCENT>\n<explanation here>\n</WHY THE OTHER SUSPECTS ARE INNOCENT>",
          "solution": "<THOUGHT PROCESS>\n1. Motive  \n   • Simon & Susan Plympton – the old man’s constant generosity threatened their eventual inheritance; they live “frugally,” have debts, and the ball could bring quick cash.  \n   • Nurse Melinda Baker – no hint of financial distress; a theft would cost her both reputation and licence.  \n   • Dr Edgar Newton – prosperous senior physician; little motive.  \n\n2. Knowledge of value  \n   • Only three people definitely heard the reporter state that the ball might be worth tens of thousands: John Plympton, the reporter himself, and anyone in the sick-room while they talked.  \n   • At that moment the room held: the reporter, old John, Susan (reading, then leaving), and Nurse Baker (stationed by the wardrobe). Dr Newton was not yet present and is “deaf as a post.”  \n   • Simon was elsewhere; he never heard the conversation.\n\n3. Opportunity to remove the ball  \n   • The ball was last seen on the shelf shortly before luncheon.  \n   • During luncheon only Susan and Simon were away from the room; Nurse Baker remained on duty and later went downstairs to fetch Dr Newton at Susan’s request, leaving the room empty for roughly two minutes – a perfect chance for someone already in the vicinity (Susan) to slip back, pocket the ball, and return to the dining room unnoticed.  \n   • After the doctor’s examination the room was locked, so the theft must have occurred before then.\n\n4. What the pawnshop tells us  \n   • Al’s Pawn Parlor advanced the pledger $5 000 – a sum large enough to ease immediate debts but small compared with true value.  \n   • A nurse or doctor would realise that the police would naturally check the local pawn shop first; a cautious thief would send the ball out of town.  \n   • The person who pawned it plans to come back with the cash (Al displayed the ball because he doubted the ticket would be redeemed).  That fits a family member who expects to inherit soon and is trying to raise the redemption money by selling the ball properly (e.g., through Sotheby’s).\n\n5. Behavioural clues  \n   • Susan grows markedly more interested only after the reporter describes Jackie Mitchell and the $50 000 estimate – confirming that she now sees how badly she under-priced the ball and why she must redeem it quickly.  \n   • She hurriedly begins “making a list of visitors” – a classic deflection by the guilty party.  \n   • Simon remains vague and unconcerned; nothing in his manner hints at secret knowledge.\n\n6. Deduction  \n   The only person with strong motive, certain knowledge of the ball’s value, and a realistic blend of nerve and naiveté to pawn it locally is SUSAN PLYMPTON.  \n</THOUGHT PROCESS>\n\n<SUSPECTS>\nSusan Plympton, Simon Plympton, Nurse Melinda Baker, Dr. Edgar Newton\n</SUSPECTS>\n\n<CULPRIT>\nSusan Plympton\n</CULPRIT>\n\n<EVENT RECONSTRUCTION>\n• During the interviewer’s second visit, Susan sits reading to her grandfather and overhears Crusher Davis tell of the ball’s unique third autograph and its potential $50 000 value.  \n• When Davis leaves, Susan’s mind is made up: the ball could clear the couple’s pressing debts.  \n• At luncheon she arranges for Nurse Baker to fetch Dr Newton, ensuring the sick-room is momentarily unattended.  \n• She slips back upstairs, removes the autographed ball from its plastic case, hides it in her apron pocket, and returns to the dining room before anyone notices.  \n• After Dr Newton pronounces death, the room is sealed; no one realises the trophy is missing.  \n• That same afternoon Susan takes the ball to Al’s Pawn Parlor, accepts $5 000, and receives a pawn ticket, confident that no outsider knows its true worth.  \n• When the reporter later discovers the ball in Al’s shop and begins asking questions, Susan pretends ignorance and even volunteers to “draw up a list of visitors.”  \n• Realising that Al intends to sell the ball if it is not redeemed, she scrapes together funds (possibly from insurance proceeds) and redeems it a few days later, forwarding it to a major auction house where she hopes to obtain its full market value.\n</EVENT RECONSTRUCTION>\n\n<WHY THE OTHER SUSPECTS ARE INNOCENT>\nSimon Plympton – Heard nothing of the ball’s value, shows no initiative or urgency, and Al never mentions seeing him. His vague memory is typical absent-mindedness, not deceit.  \nNurse Melinda Baker – Although she had physical opportunity, a local public pawnshop would be the last place a healthcare professional would risk her career. She truly paid no attention to the conversation about the ball.  \nDr. Edgar Newton – Arrived after the conversation, is “deaf as a post,” had almost no chance to remove the ball, and, as a respected and well-off physician, lacked motive.  \n</WHY THE OTHER SUSPECTS ARE INNOCENT>",
          "length_warning": "",
          "model": "o3",
          "reveal_segment": "Simon and Susan Plympton were concerned about John Plympton’s generosity in giving away his property. They were not dishonest, however, and would certainly not steal from their benefactor. Of the two, Simon was rather vague about material things, which forced Susan to be the practical spouse. And when John Plympton died, she thought it important to realize some money for their debts by pawning the autographed baseball.\nNurse Melinda Baker had the opportunity to hear about the baseball’s real value when she was in the room at her nursing station during Crusher’s conversation with John Plympton. She claimed, however, not to have paid attention to that conversation. Had she stolen the baseball, it is highly unlikely that she would have taken it to the obvious local pawn shop, where tracing by the police would quickly have identified the thief. And Dr. Edgar Newton, the dean of the local medical fraternity and “deaf as a post,” did not hear the conversation that pointed to the baseball’s actual value. As with Nurse Baker, if he had stolen it he would never have pawned it at Al’s Pawn Shop.\nSince no crime was committed, my only sleuthing was for my own curiosity. When Susan Plympton redeemed her own property a few days later it was to place it with a national auction house, such as Sotheby’s or Christie’s, where this rare and valuable autographed baseball would attract bids closer to its real value."
        }
      },
      "doc_id": "The_Jackie_Mitchell_Autographed_Baseball_Mystery"
    }
  ]
}