{
  "metadata": {
    "event_name": "OMIC12",
    "event_description": "Detective story 'The Mysterious Death in Percy Street' by Unknown",
    "model": "o3",
    "story_length": 33212,
    "reveal_length": 5680,
    "border_sentence": "\"How the murder was committed?\" he said eagerly."
  },
  "story": {
    "full_text": "Miss Polly Burton had had many an argument with Mr. Richard Frobisher about that old man in the corner, who seemed far more interesting and deucedly more mysterious than any of the crimes over which he philosophised.\nDick thought, moreover, that Miss Polly spent more of her leisure time now in that A.B.C. shop than she had done in his own company before, and told her so, with that delightful air of sheepish sulkiness which the male creature invariably wears when he feels jealous and won't admit it.\nPolly liked Dick to be jealous, but she liked that old scarecrow in the A.B.C. shop very much too, and though she made sundry vague promises from time to time to Mr. Richard Frobisher, she nevertheless drifted back instinctively day after day to the tea-shop in Norfolk Street, Strand, and stayed there sipping coffee for as long as the man in the corner chose to talk.\nOn this particular afternoon she went to the A.B.C. shop with a fixed purpose, that of making him give her his views of Mrs. Owen's mysterious death in Percy Street.\nThe facts had interested and puzzled her. She had had countless arguments with Mr. Richard Frobisher as to the three great possible solutions of the puzzle—\"Accident, Suicide, Murder?\"\n\"Undoubtedly neither accident nor suicide,\" he said dryly.\nPolly was not aware that she had spoken. What an uncanny habit that creature had of reading her thoughts!\n\"You incline to the idea, then, that Mrs. Owen was murdered. Do you know by whom?\"\nHe laughed, and drew forth the piece of string he always fidgeted with when unravelling some mystery.\n\"You would like to know who murdered that old woman?\" he asked at last.\n\"I would like to hear your views on the subject,\" Polly replied.\n\"I have no views,\" he said dryly. \"No one can know who murdered the woman, since no one ever saw the person who did it. No one can give the faintest description of the mysterious man who alone could have committed that clever deed, and the police are playing a game of blind man's buff.\"\n\"But you must have formed some theory of your own,\" she persisted.\nIt annoyed her that the funny creature was obstinate about this point, and she tried to nettle his vanity.\n\"I suppose that as a matter of fact your original remark that 'there are no such things as mysteries' does not apply universally. There is a mystery—that of the death in Percy Street, and you, like the police, are unable to fathom it.\"\nHe pulled up his eyebrows and looked at her for a minute or two.\n\"Confess that that murder was one of the cleverest bits of work accomplished outside Russian diplomacy,\" he said with a nervous laugh. \"I must say that were I the judge, called upon to pronounce sentence of death on the man who conceived that murder, I could not bring myself to do it. I would politely request the gentleman to enter our Foreign Office—we have need of such men. The whole mise en scène was truly artistic, worthy of its milieu—the Rubens Studios in Percy Street, Tottenham Court Road.\n\"Have you ever noticed them? They are only studios by name, and are merely a set of rooms in a corner house, with the windows slightly enlarged, and the rents charged accordingly in consideration of that additional five inches of smoky daylight, filtering through dusty windows. On the ground floor there is the order office of some stained glass works, with a workshop in the rear, and on the first floor landing a small room allotted to the caretaker, with gas, coal, and fifteen shillings a week, for which princely income she is deputed to keep tidy and clean the general aspect of the house.\n\"Mrs. Owen, who was the caretaker there, was a quiet, respectable woman, who eked out her scanty wages by sundry—mostly very meagre—tips doled out to her by impecunious artists in exchange for promiscuous domestic services in and about the respective studios.\n\"But if Mrs. Owen's earnings were not large, they were very regular, and she had no fastidious tastes. She and her cockatoo lived on her wages; and all the tips added up, and never spent, year after year, went to swell a very comfortable little account at interest in the Birkbeck Bank. This little account had mounted up to a very tidy sum, and the thrifty widow—or old maid—no one ever knew which she was—was generally referred to by the young artists of the Rubens Studios as a 'lady of means.' But this is a digression.\n\"No one slept on the premises except Mrs. Owen and her cockatoo. The rule was that one by one as the tenants left their rooms in the evening they took their respective keys to the caretaker's room. She would then, in the early morning, tidy and dust the studios and the office downstairs, lay the fire and carry up coals.\n\"The foreman of the glass works was the first to arrive in the morning. He had a latch-key, and let himself in, after which it was the custom of the house that he should leave the street door open for the benefit of the other tenants and their visitors.\n\"Usually, when he came at about nine o'clock, he found Mrs. Owen busy about the house doing her work, and he had often a brief chat with her about the weather, but on this particular morning of February 2nd he neither saw nor heard her. However, as the shop had been tidied and the fire laid, he surmised that Mrs. Owen had finished her work earlier than usual, and thought no more about it. One by one the tenants of the studios turned up, and the day sped on without any one's attention being drawn noticeably to the fact that the caretaker had not appeared upon the scene.\n\"It had been a bitterly cold night, and the day was even worse; a cutting north-easterly gale was blowing, there had been a great deal of snow during the night which lay quite thick on the ground, and at five o'clock in the afternoon, when the last glimmer of the pale winter daylight had disappeared, the confraternity of the brush put palette and easel aside and prepared to go home. The first to leave was Mr. Charles Pitt; he locked up his studio and, as usual, took his key into the caretaker's room.\n\"He had just opened the door when an icy blast literally struck him in the face; both the windows were wide open, and the snow and sleet were beating thickly into the room, forming already a white carpet upon the floor.\n\"The room was in semi-obscurity, and at first Mr. Pitt saw nothing, but instinctively realizing that something was wrong, he lit a match, and saw before him the spectacle of that awful and mysterious tragedy which has ever since puzzled both police and public. On the floor, already half covered by the drifting snow, lay the body of Mrs. Owen face downwards, in a nightgown, with feet and ankles bare, and these and her hands were of a deep purple colour; whilst in a corner of the room, huddled up with the cold, the body of the cockatoo lay stark and stiff.\" \n\"At first there was only talk of a terrible accident, the result of some inexplicable carelessness which perhaps the evidence at the inquest would help to elucidate.\n\"Medical assistance came too late; the unfortunate woman was indeed dead, frozen to death, inside her own room. Further examination showed that she had received a severe blow at the back of the head, which must have stunned her and caused her to fall, helpless, beside the open window. Temperature at five degrees below zero had done the rest. Detective Inspector Howell discovered close to the window a wrought-iron gas bracket, the height of which corresponded exactly with the bruise at the back of Mrs. Owen's head.\n\"Hardly however had a couple of days elapsed when public curiosity was whetted by a few startling headlines, such as the halfpenny evening papers alone know how to concoct.\n\"'The mysterious death in Percy Street.' 'Is it Suicide or Murder?' 'Thrilling details—Strange developments.' 'Sensational Arrest.'\n\"What had happened was simply this:\n\"At the inquest a few certainly very curious facts connected with Mrs. Owen's life had come to light, and this had led to the apprehension of a young man of very respectable parentage on a charge of being concerned in the tragic death of the unfortunate caretaker.\n\"To begin with, it happened that her life, which in an ordinary way should have been very monotonous and regular, seemed, at any rate latterly, to have been more than usually chequered and excited. Every witness who had known her in the past concurred in the statement that since October last a great change had come over the worthy and honest woman.\n\"I happen to have a photo of Mrs. Owen as she was before this great change occurred in her quiet and uneventful life, and which led, as far as the poor soul was concerned, to such disastrous results.\n\"Here she is to the life,\" added the funny creature, placing the photo before Polly—\"as respectable, as stodgy, as uninteresting as it is well possible for a member of your charming sex to be; not a face, you will admit, to lead any youngster to temptation or to induce him to commit a crime.\n\"Nevertheless one day all the tenants of the Rubens Studios were surprised and shocked to see Mrs. Owen, quiet, respectable Mrs. Owen, sallying forth at six o'clock in the afternoon, attired in an extravagant bonnet and a cloak trimmed with imitation astrakhan which—slightly open in front—displayed a gold locket and chain of astonishing proportions.\n\"Many were the comments, the hints, the bits of sarcasm levelled at the worthy woman by the frivolous confraternity of the brush.\n\"The plot thickened when from that day forth a complete change came over the worthy caretaker of the Rubens Studios. While she appeared day after day before the astonished gaze of the tenants and the scandalized looks of the neighbours, attired in new and extravagant dresses, her work was hopelessly neglected, and she was always 'out' when wanted.\n\"There was, of course, much talk and comment in various parts of the Rubens Studios on the subject of Mrs. Owen's 'dissipations.' The tenants began to put two and two together, and after a very little while the general consensus of opinion became firmly established that the honest caretaker's demoralisation coincided week for week, almost day for day, with young Greenhill's establishment in No. 8 Studio.\n\"Every one had remarked that he stayed much later in the evening than any one else, and yet no one presumed that he stayed for purposes of work. Suspicions soon rose to certainty when Mrs. Owen and Arthur Greenhill were seen by one of the glass workmen dining together at Gambia's Restaurant in Tottenham Court Road.\n\"The workman, who was having a cup of tea at the counter, noticed particularly that when the bill was paid the money came out of Mrs. Owen's purse. The dinner had been sumptuous—veal cutlets, a cut from the joint, dessert, coffee and liqueurs. Finally the pair left the restaurant apparently very gay, young Greenhill smoking a choice cigar.\n\"Irregularities such as these were bound sooner or later to come to the ears and eyes of Mr. Allman, the landlord of the Rubens Studios; and a month after the New Year, without further warning, he gave her a week's notice to quit his house.\n\"'Mrs. Owen did not seem the least bit upset when I gave her notice,' Mr. Allman declared in his evidence at the inquest; 'on the contrary, she told me that she had ample means, and had only worked latterly for the sake of something to do. She added that she had plenty of friends who would look after her, for she had a nice little pile to leave to any one who would know how \"to get the right side of her.\"'\n\"Nevertheless, in spite of this cheerful interview, Miss Bedford, the tenant of No. 6 Studio, had stated that when she took her key to the caretaker's room at 6.30 that afternoon she found Mrs. Owen in tears. The caretaker refused to be comforted, nor would she speak of her trouble to Miss Bedford.\n\"Twenty-four hours later she was found dead.\n\"The coroner's jury returned an open verdict, and Detective-Inspector Jones was charged by the police to make some inquiries about young Mr. Greenhill, whose intimacy with the unfortunate woman had been universally commented upon.\n\"The detective, however, pushed his investigations as far as the Birkbeck Bank. There he discovered that after her interview with Mr. Allman, Mrs. Owen had withdrawn what money she had on deposit, some £800, the result of twenty-five years' saving and thrift.\n\"But the immediate result of Detective-Inspector Jones's labours was that Mr. Arthur Greenhill, lithographer, was brought before the magistrate at Bow Street on the charge of being concerned in the death of Mrs. Owen, caretaker of the Rubens Studios, Percy Street.\n\"Now that magisterial inquiry is one of the few interesting ones which I had the misfortune to miss,\" continued the man in the corner, with a nervous shake of the shoulders. \"But you know as well as I do how the attitude of the young prisoner impressed the magistrate and police so unfavourably that, with every new witness brought forward, his position became more and more unfortunate.\n\"Yet he was a good-looking, rather coarsely built young fellow, with one of those awful Cockney accents which literally make one jump. But he looked painfully nervous, stammered at every word spoken, and repeatedly gave answers entirely at random.\n\"His father acted as lawyer for him, a rough-looking elderly man, who had the appearance of a common country attorney rather than of a London solicitor.\n\"The police had built up a fairly strong case against the lithographer. Medical evidence revealed nothing new: Mrs. Owen had died from exposure, the blow at the back of the head not being sufficiently serious to cause anything but temporary disablement. When the medical officer had been called in, death had intervened for some time; it was quite impossible to say how long, whether one hour or five or twelve.\n\"The appearance and state of the room, when the unfortunate woman was found by Mr. Charles Pitt, were again gone over in minute detail. Mrs. Owen's clothes, which she had worn during the day, were folded neatly on a chair. The key of her cupboard was in the pocket of her dress. The door had been slightly ajar, but both the windows were wide open; one of them, which had the sash-line broken, had been fastened up most scientifically with a piece of rope.\n\"Mrs. Owen had obviously undressed preparatory to going to bed, and the magistrate very naturally soon made the remark how untenable the theory of an accident must be. No one in their five senses would undress with a temperature at below zero, and the windows wide open.\n\"After these preliminary statements the cashier of the Birkbeck was called and he related the caretaker's visit at the bank.\n\"'It was then about one o'clock,' he stated. 'Mrs. Owen called and presented a cheque to self for £827, the amount of her balance. She seemed exceedingly happy and cheerful, and talked about needing plenty of cash, as she was going abroad to join her nephew, for whom she would in future keep house. I warned her about being sufficiently careful with so large a sum, and parting from it injudiciously, as women of her class are very apt to do. She laughingly declared that not only was she careful of it in the present, but meant to be so for the far-off future, for she intended to go that very day to a lawyer's office and to make a will.'\n\"The cashier's evidence was certainly startling in the extreme, since in the widow's room no trace of any kind was found of any money; against that, two of the notes handed over by the bank to Mrs. Owen on that day were cashed by young Greenhill on the very morning of her mysterious death. One was handed in by him to the West End Clothiers Company, in payment for a suit of clothes, and the other he changed at the Post Office in Oxford Street.\n\"After that all the evidence had of necessity to be gone through again on the subject of young Greenhill's intimacy with Mrs. Owen. He listened to it all with an air of the most painful nervousness, his cheeks were positively green, his lips seemed dry and parched, for he repeatedly passed his tongue over them, and when Constable E 18 deposed that at 2 a.m. on the morning of February 2nd he had seen the accused and spoken to him at the corner of Percy Street and Tottenham Court Road, young Greenhill all but fainted.\n\"The contention of the police was that the caretaker had been murdered and robbed during that night before she went to bed, that young Greenhill had done the murder, seeing that he was the only person known to have been intimate with the woman, and that it was, moreover, proved unquestionably that he was in the immediate neighbourhood of the Rubens Studios at an extraordinarily late hour of the night.\n\"His own account of himself, and of that same night, could certainly not be called very satisfactory. Mrs. Owen was a relative of his late mother's, he declared. He himself was a lithographer by trade, with a good deal of time and leisure on his hands. He certainly had employed some of that time in taking the old woman to various places of amusement. He had on more than one occasion suggested that she should give up menial work, and come and live with him, but, unfortunately, she was a great deal imposed upon by her nephew, a man of the name of Owen, who exploited the good-natured woman in every possible way, and who had on more than one occasion made severe attacks upon her savings at the Birkbeck Bank.\n\"Severely cross-examined by the prosecuting counsel about this supposed relative of Mrs. Owen, Greenhill admitted that he did not know him—had, in fact, never seen him. He knew that his name was Owen and that was all. His chief occupation consisted in sponging on the kind-hearted old woman, but he only went to see her in the evenings, when he presumably knew that she would be alone, and invariably after all the tenants of the Rubens Studios had left for the day.\n\"I don't know whether at this point it strikes you at all, as it did both magistrate and counsel, that there was a direct contradiction in this statement and the one made by the cashier of the Birkbeck on the subject of his last conversation with Mrs. Owen. 'I am going abroad to join my nephew, for whom I am going to keep house,' was what the unfortunate woman had said.\n\"Now Greenhill, in spite of his nervousness and at times contradictory answers, strictly adhered to his point, that there was a nephew in London, who came frequently to see his aunt.\n\"Anyway, the sayings of the murdered woman could not be taken as evidence in law. Mr. Greenhill senior put the objection, adding: 'There may have been two nephews,' which the magistrate and the prosecution were bound to admit.\n\"With regard to the night immediately preceding Mrs. Owen's death, Greenhill stated that he had been with her to the theatre, had seen her home, and had had some supper with her in her room. Before he left her, at 2 a.m., she had of her own accord made him a present of £10, saying: 'I am a sort of aunt to you, Arthur, and if you don't have it, Bill is sure to get it.'\n\"She had seemed rather worried in the early part of the evening, but later on she cheered up.\n\"'Did she speak at all about this nephew of hers or about her money affairs? asked the magistrate.\n\"Again the young man hesitated, but said, 'No! she did not mention either Owen or her money affairs.'\n\"If I remember rightly,\" added the man in the corner, \"for recollect I was not present, the case was here adjourned. But the magistrate would not grant bail. Greenhill was removed looking more dead than alive—though every one remarked that Mr. Greenhill senior looked determined and not the least worried. In the course of his examination on behalf of his son, of the medical officer and one or two other witnesses, he had very ably tried to confuse them on the subject of the hour at which Mrs. Owen was last known to be alive.\n\"He made a very great point of the fact that the usual morning's work was done throughout the house when the inmates arrived. Was it conceivable, he argued, that a woman would do that kind of work overnight, especially as she was going to the theatre, and therefore would wish to dress in her smarter clothes? It certainly was a very nice point levelled against the prosecution, who promptly retorted: Just as conceivable as that a woman in those circumstances of life should, having done her work, undress beside an open window at nine o'clock in the morning with the snow beating into the room.\n\"Now it seems that Mr. Greenhill senior could produce any amount of witnesses who could help to prove a conclusive alibi on behalf of his son, if only some time subsequent to that fatal 2 a.m. the murdered woman had been seen alive by some chance passer-by.\n\"However, he was an able man and an earnest one, and I fancy the magistrate felt some sympathy for his strenuous endeavours on his son's behalf. He granted a week's adjournment, which seemed to satisfy Mr. Greenhill completely.\n\"In the meanwhile the papers had talked of and almost exhausted the subject of the mystery in Percy Street. There had been, as you no doubt know from personal experience, innumerable arguments on the puzzling alternatives:—\n\"Accident?\n\"Suicide?\n\"Murder?\n\"A week went by, and then the case against young Greenhill was resumed. Of course the court was crowded. It needed no great penetration to remark at once that the prisoner looked more hopeful, and his father quite elated.\n\"Again a great deal of minor evidence was taken, and then came the turn of the defence. Mr. Greenhill called Mrs. Hall, confectioner, of Percy Street, opposite the Rubens Studios. She deposed that at 8 o'clock in the morning of February 2nd, while she was tidying her shop window, she saw the caretaker of the Studios opposite, as usual, on her knees, her head and body wrapped in a shawl, cleaning her front steps. Her husband also saw Mrs. Owen, and Mrs. Hall remarked to her husband how thankful she was that her own shop had tiled steps, which did not need scrubbing on so cold a morning.\n\"Mr. Hall, confectioner, of the same address, corroborated this statement, and Mr. Greenhill, with absolute triumph, produced a third witness, Mrs. Martin, of Percy Street, who from her window on the second floor had, at 7.30 a.m., seen the caretaker shaking mats outside her front door. The description this witness gave of Mrs. Owen's get-up, with the shawl round her head, coincided point by point with that given by Mr. and Mrs. Hall.\n\"After that Mr. Greenhill's task became an easy one; his son was at home having his breakfast at 8 o'clock that morning—not only himself, but his servants would testify to that.\n\"The weather had been so bitter that the whole of that day Arthur had not stirred from his own fireside. Mrs. Owen was murdered after 8 a.m. on that day, since she was seen alive by three people at that hour, therefore his son could not have murdered Mrs. Owen. The police must find the criminal elsewhere, or else bow to the opinion originally expressed by the public that Mrs. Owen had met with a terrible untoward accident, or that perhaps she may have wilfully sought her own death in that extraordinary and tragic fashion.\n\"Before young Greenhill was finally discharged one or two witnesses were again examined, chief among these being the foreman of the glassworks. He had turned up at the Rubens Studios at 9 o'clock, and been in business all day. He averred positively that he did not specially notice any suspicious-looking individual crossing the hall that day. 'But,' he remarked with a smile, 'I don't sit and watch every one who goes up and downstairs. I am too busy for that. The street door is always left open; any one can walk in, up or down, who knows the way.'\n\"That there was a mystery in connection with Mrs. Owen's death—of that the police have remained perfectly convinced; whether young Greenhill held the key of that mystery or not they have never found out to this day.\n\"I could enlighten them as to the cause of the young lithographer's anxiety at the magisterial inquiry, but, I assure you, I do not care to do the work of the police for them. Why should I? Greenhill will never suffer from unjust suspicions. He and his father alone—besides myself—know in what a terribly tight corner he all but found himself.\n\"The young man did not reach home till nearly five o'clock that morning. His last train had gone; he had to walk, lost his way, and wandered about Hampstead for hours. Think what his position would have been if the worthy confectioners of Percy Street had not seen Mrs. Owen 'wrapped up in a shawl, on her knees, doing the front steps.'\n\"Moreover, Mr. Greenhill senior is a solicitor, who has a small office in John Street, Bedford Row. The afternoon before her death Mrs. Owen had been to that office and had there made a will by which she left all her savings to young Arthur Greenhill, lithographer. Had that will been in other than paternal hands, it would have been proved, in the natural course of such things, and one other link would have been added to the chain which nearly dragged Arthur Greenhill to the gallows—'the link of a very strong motive.'\n\"Can you wonder that the young man turned livid, until such time as it was proved beyond a doubt that the murdered woman was alive hours after he had reached the safe shelter of his home?\n\"I saw you smile when I used the word 'murdered,'\" continued the man in the corner, growing quite excited now that he was approaching the dénouement of his story. \"I know that the public, after the magistrate had discharged Arthur Greenhill, were quite satisfied to think that the mystery in Percy Street was a case of accident—or suicide.\"\n\"No,\" replied Polly, \"there could be no question of suicide, for two very distinct reasons.\"\nHe looked at her with some degree of astonishment. She supposed that he was amazed at her venturing to form an opinion of her own.\n\"And may I ask what, in your opinion, these reasons are?\" he asked very sarcastically.\n\"To begin with, the question of money,\" she said—\"has any more of it been traced so far?\"\n\"Not another £5 note,\" he said with a chuckle; \"they were all cashed in Paris during the Exhibition, and you have no conception how easy a thing that is to do, at any of the hotels or smaller agents de change.\"\n\"That nephew was a clever blackguard,\" she commented.\n\"You believe, then, in the existence of that nephew?\"\n\"Why should I doubt it? Some one must have existed who was sufficiently familiar with the house to go about in it in the middle of the day without attracting any one's attention.\"\n\"In the middle of the day?\" he said with a chuckle.\n\"Any time after 8.30 in the morning.\"\n\"So you, too, believe in the 'caretaker, wrapped up in a shawl,' cleaning her front steps?\" he queried.\n\"But—\"\n\"It never struck you, in spite of the training your intercourse with me must have given you, that the person who carefully did all the work in the Rubens Studios, laid the fires and carried up the coals, merely did it in order to gain time; in order that the bitter frost might really and effectually do its work, and Mrs. Owen be not missed until she was truly dead.\"\n\"But—\" suggested Polly again.\n\"It never struck you that one of the greatest secrets of successful crime is to lead the police astray with regard to the time when the crime was committed. That was, if you remember, the great point in the Regent's Park murder.\n\"In this case the 'nephew,' since we admit his existence, would—even if he were ever found, which is doubtful—be able to prove as good an alibi as young Greenhill.\"\n\"But I don't understand—\"\n\"How the murder was committed?\" he said eagerly. \"Surely you can see it all for yourself, since you admit the 'nephew'—a scamp, perhaps—who sponges on the good-natured woman. He terrorises and threatens her, so much so that she fancies her money is no longer safe even in the Birkbeck Bank. Women of that class are apt at times to mistrust the Bank of England. Anyway, she withdraws her money. Who knows what she meant to do with it in the immediate future?\n\"In any case, she wishes to secure it after her death to a young man whom she likes, and who has known how to win her good graces. That afternoon the nephew begs, entreats for more money; they have a row; the poor woman is in tears, and is only temporarily consoled by a pleasant visit at the theatre.\n\"At 2 o'clock in the morning young Greenhill parts from her. Two minutes later the nephew knocks at the door. He comes with a plausible tale of having missed his last train, and asks for a 'shake down' somewhere in the house. The good-natured woman suggests a sofa in one of the studios, and then quietly prepares to go to bed. The rest is very simple and elementary. The nephew sneaks into his aunt's room, finds her standing in her nightgown; he demands money with threats of violence; terrified, she staggers, knocks her head against the gas bracket, and falls on the floor stunned, while the nephew seeks for her keys and takes possession of the £800. You will admit that the subsequent mise en scène—is worthy of a genius.\n\"No struggle, not the usual hideous accessories round a crime. Only the open windows, the bitter north-easterly gale, and the heavily falling snow—two silent accomplices, as silent as the dead.\n\"After that the murderer, with perfect presence of mind, busies himself in the house, doing the work which will ensure that Mrs. Owen shall not be missed, at any rate, for some time. He dusts and tidies; some few hours later he even slips on his aunt's skirt and bodice, wraps his head in a shawl, and boldly allows those neighbours who are astir to see what they believe to be Mrs. Owen. Then he goes back to her room, resumes his normal appearance and quietly leaves the house.\"\n\"He may have been seen.\"\n\"He undoubtedly was seen by two or three people, but no one thought anything of seeing a man leave the house at that hour. It was very cold, the snow was falling thickly, and as he wore a muffler round the lower part of his face, those who saw him would not undertake to know him again.\"\n\"That man was never seen nor heard of again?\" Polly asked.\n\"He has disappeared off the face of the earth. The police are searching for him, and perhaps some day they will find him—then society will be rid of one of the most ingenious men of the age.\" \nHe had paused, absorbed in meditation. The young girl also was silent. Some memory too vague as yet to take a definite form was persistently haunting her—one thought was hammering away in her brain, and playing havoc with her nerves. That thought was the inexplicable feeling within her that there was something in connection with that hideous crime which she ought to recollect, something which—if she could only remember what it was—would give her the clue to the tragic mystery, and for once ensure her triumph over this self-conceited and sarcastic scarecrow in the corner.\nHe was watching her through his great bone-rimmed spectacles, and she could see the knuckles of his bony hands, just above the top of the table, fidgeting, fidgeting, fidgeting, till she wondered if there existed another set of fingers in the world which could undo the knots his lean ones made in that tiresome piece of string.\nThen suddenly—á propos of nothing, Polly remembered—the whole thing stood before her, short and clear like a vivid flash of lightning:—Mrs. Owen lying dead in the snow beside her open window; one of them with a broken sash-line, tied up most scientifically with a piece of string. She remembered the talk there had been at the time about this improvised sash-line.\nThat was after young Greenhill had been discharged, and the question of suicide had been voted an impossibility.\nPolly remembered that in the illustrated papers photographs appeared of this wonderfully knotted piece of string, so contrived that the weight of the frame could but tighten the knots, and thus keep the window open. She remembered that people deduced many things from that improvised sash-line, chief among these deductions being that the murderer was a sailor—so wonderful, so complicated, so numerous were the knots which secured that window-frame.\nBut Polly knew better. In her mind's eye she saw those fingers, rendered doubly nervous by the fearful cerebral excitement, grasping at first mechanically, even thoughtlessly, a bit of twine with which to secure the window; then the ruling habit strongest through all, the girl could see it; the lean and ingenious fingers fidgeting, fidgeting with that piece of string, tying knot after knot, more wonderful, more complicated, than any she had yet witnessed.\n\"If I were you,\" she said, without daring to look into that corner where he sat, \"I would break myself of the habit of perpetually making knots in a piece of string.\"\nHe did not reply, and at last Polly ventured to look up—the corner was empty, and through the glass door beyond the desk, where he had just deposited his few coppers, she saw the tails of his tweed coat, his extraordinary hat, his meagre, shrivelled-up personality, fast disappearing down the street.\nMiss Polly Burton (of the Evening Observer) was married the other day to Mr. Richard Frobisher (of the London Mail). She has never set eyes on the man in the corner from that day to this.",
    "reveal_segment": "\"How the murder was committed?\" he said eagerly.  \"Surely you can see it all for yourself, since you admit the 'nephew'—a scamp, perhaps—who sponges on the good-natured woman. He terrorises and threatens her, so much so that she fancies her money is no longer safe even in the Birkbeck Bank. Women of that class are apt at times to mistrust the Bank of England. Anyway, she withdraws her money. Who knows what she meant to do with it in the immediate future?\n\"In any case, she wishes to secure it after her death to a young man whom she likes, and who has known how to win her good graces. That afternoon the nephew begs, entreats for more money; they have a row; the poor woman is in tears, and is only temporarily consoled by a pleasant visit at the theatre.\n\"At 2 o'clock in the morning young Greenhill parts from her. Two minutes later the nephew knocks at the door. He comes with a plausible tale of having missed his last train, and asks for a 'shake down' somewhere in the house. The good-natured woman suggests a sofa in one of the studios, and then quietly prepares to go to bed. The rest is very simple and elementary. The nephew sneaks into his aunt's room, finds her standing in her nightgown; he demands money with threats of violence; terrified, she staggers, knocks her head against the gas bracket, and falls on the floor stunned, while the nephew seeks for her keys and takes possession of the £800. You will admit that the subsequent mise en scène—is worthy of a genius.\n\"No struggle, not the usual hideous accessories round a crime. Only the open windows, the bitter north-easterly gale, and the heavily falling snow—two silent accomplices, as silent as the dead.\n\"After that the murderer, with perfect presence of mind, busies himself in the house, doing the work which will ensure that Mrs. Owen shall not be missed, at any rate, for some time. He dusts and tidies; some few hours later he even slips on his aunt's skirt and bodice, wraps his head in a shawl, and boldly allows those neighbours who are astir to see what they believe to be Mrs. Owen. Then he goes back to her room, resumes his normal appearance and quietly leaves the house.\"\n\"He may have been seen.\"\n\"He undoubtedly was seen by two or three people, but no one thought anything of seeing a man leave the house at that hour. It was very cold, the snow was falling thickly, and as he wore a muffler round the lower part of his face, those who saw him would not undertake to know him again.\"\n\"That man was never seen nor heard of again?\" Polly asked.\n\"He has disappeared off the face of the earth. The police are searching for him, and perhaps some day they will find him—then society will be rid of one of the most ingenious men of the age.\" \nHe had paused, absorbed in meditation. The young girl also was silent. Some memory too vague as yet to take a definite form was persistently haunting her—one thought was hammering away in her brain, and playing havoc with her nerves. That thought was the inexplicable feeling within her that there was something in connection with that hideous crime which she ought to recollect, something which—if she could only remember what it was—would give her the clue to the tragic mystery, and for once ensure her triumph over this self-conceited and sarcastic scarecrow in the corner.\nHe was watching her through his great bone-rimmed spectacles, and she could see the knuckles of his bony hands, just above the top of the table, fidgeting, fidgeting, fidgeting, till she wondered if there existed another set of fingers in the world which could undo the knots his lean ones made in that tiresome piece of string.\nThen suddenly—á propos of nothing, Polly remembered—the whole thing stood before her, short and clear like a vivid flash of lightning:—Mrs. Owen lying dead in the snow beside her open window; one of them with a broken sash-line, tied up most scientifically with a piece of string. She remembered the talk there had been at the time about this improvised sash-line.\nThat was after young Greenhill had been discharged, and the question of suicide had been voted an impossibility.\nPolly remembered that in the illustrated papers photographs appeared of this wonderfully knotted piece of string, so contrived that the weight of the frame could but tighten the knots, and thus keep the window open. She remembered that people deduced many things from that improvised sash-line, chief among these deductions being that the murderer was a sailor—so wonderful, so complicated, so numerous were the knots which secured that window-frame.\nBut Polly knew better. In her mind's eye she saw those fingers, rendered doubly nervous by the fearful cerebral excitement, grasping at first mechanically, even thoughtlessly, a bit of twine with which to secure the window; then the ruling habit strongest through all, the girl could see it; the lean and ingenious fingers fidgeting, fidgeting with that piece of string, tying knot after knot, more wonderful, more complicated, than any she had yet witnessed.\n\"If I were you,\" she said, without daring to look into that corner where he sat, \"I would break myself of the habit of perpetually making knots in a piece of string.\"\nHe did not reply, and at last Polly ventured to look up—the corner was empty, and through the glass door beyond the desk, where he had just deposited his few coppers, she saw the tails of his tweed coat, his extraordinary hat, his meagre, shrivelled-up personality, fast disappearing down the street.\nMiss Polly Burton (of the Evening Observer) was married the other day to Mr. Richard Frobisher (of the London Mail). She has never set eyes on the man in the corner from that day to this.",
    "border_sentence": "\"How the murder was committed?\" he said eagerly."
  },
  "detection": {
    "prompt": "System: You are an ingenious and clever detective who will examine all the clues and reason through all the evidence to solve the crime.\n\nUser: Here is a detective story. Please read the story carefully before you decide who the culprit is.\n\n\nMiss Polly Burton had had many an argument with Mr. Richard Frobisher about that old man in the corner, who seemed far more interesting and deucedly more mysterious than any of the crimes over which he philosophised.\nDick thought, moreover, that Miss Polly spent more of her leisure time now in that A.B.C. shop than she had done in his own company before, and told her so, with that delightful air of sheepish sulkiness which the male creature invariably wears when he feels jealous and won't admit it.\nPolly liked Dick to be jealous, but she liked that old scarecrow in the A.B.C. shop very much too, and though she made sundry vague promises from time to time to Mr. Richard Frobisher, she nevertheless drifted back instinctively day after day to the tea-shop in Norfolk Street, Strand, and stayed there sipping coffee for as long as the man in the corner chose to talk.\nOn this particular afternoon she went to the A.B.C. shop with a fixed purpose, that of making him give her his views of Mrs. Owen's mysterious death in Percy Street.\nThe facts had interested and puzzled her. She had had countless arguments with Mr. Richard Frobisher as to the three great possible solutions of the puzzle—\"Accident, Suicide, Murder?\"\n\"Undoubtedly neither accident nor suicide,\" he said dryly.\nPolly was not aware that she had spoken. What an uncanny habit that creature had of reading her thoughts!\n\"You incline to the idea, then, that Mrs. Owen was murdered. Do you know by whom?\"\nHe laughed, and drew forth the piece of string he always fidgeted with when unravelling some mystery.\n\"You would like to know who murdered that old woman?\" he asked at last.\n\"I would like to hear your views on the subject,\" Polly replied.\n\"I have no views,\" he said dryly. \"No one can know who murdered the woman, since no one ever saw the person who did it. No one can give the faintest description of the mysterious man who alone could have committed that clever deed, and the police are playing a game of blind man's buff.\"\n\"But you must have formed some theory of your own,\" she persisted.\nIt annoyed her that the funny creature was obstinate about this point, and she tried to nettle his vanity.\n\"I suppose that as a matter of fact your original remark that 'there are no such things as mysteries' does not apply universally. There is a mystery—that of the death in Percy Street, and you, like the police, are unable to fathom it.\"\nHe pulled up his eyebrows and looked at her for a minute or two.\n\"Confess that that murder was one of the cleverest bits of work accomplished outside Russian diplomacy,\" he said with a nervous laugh. \"I must say that were I the judge, called upon to pronounce sentence of death on the man who conceived that murder, I could not bring myself to do it. I would politely request the gentleman to enter our Foreign Office—we have need of such men. The whole mise en scène was truly artistic, worthy of its milieu—the Rubens Studios in Percy Street, Tottenham Court Road.\n\"Have you ever noticed them? They are only studios by name, and are merely a set of rooms in a corner house, with the windows slightly enlarged, and the rents charged accordingly in consideration of that additional five inches of smoky daylight, filtering through dusty windows. On the ground floor there is the order office of some stained glass works, with a workshop in the rear, and on the first floor landing a small room allotted to the caretaker, with gas, coal, and fifteen shillings a week, for which princely income she is deputed to keep tidy and clean the general aspect of the house.\n\"Mrs. Owen, who was the caretaker there, was a quiet, respectable woman, who eked out her scanty wages by sundry—mostly very meagre—tips doled out to her by impecunious artists in exchange for promiscuous domestic services in and about the respective studios.\n\"But if Mrs. Owen's earnings were not large, they were very regular, and she had no fastidious tastes. She and her cockatoo lived on her wages; and all the tips added up, and never spent, year after year, went to swell a very comfortable little account at interest in the Birkbeck Bank. This little account had mounted up to a very tidy sum, and the thrifty widow—or old maid—no one ever knew which she was—was generally referred to by the young artists of the Rubens Studios as a 'lady of means.' But this is a digression.\n\"No one slept on the premises except Mrs. Owen and her cockatoo. The rule was that one by one as the tenants left their rooms in the evening they took their respective keys to the caretaker's room. She would then, in the early morning, tidy and dust the studios and the office downstairs, lay the fire and carry up coals.\n\"The foreman of the glass works was the first to arrive in the morning. He had a latch-key, and let himself in, after which it was the custom of the house that he should leave the street door open for the benefit of the other tenants and their visitors.\n\"Usually, when he came at about nine o'clock, he found Mrs. Owen busy about the house doing her work, and he had often a brief chat with her about the weather, but on this particular morning of February 2nd he neither saw nor heard her. However, as the shop had been tidied and the fire laid, he surmised that Mrs. Owen had finished her work earlier than usual, and thought no more about it. One by one the tenants of the studios turned up, and the day sped on without any one's attention being drawn noticeably to the fact that the caretaker had not appeared upon the scene.\n\"It had been a bitterly cold night, and the day was even worse; a cutting north-easterly gale was blowing, there had been a great deal of snow during the night which lay quite thick on the ground, and at five o'clock in the afternoon, when the last glimmer of the pale winter daylight had disappeared, the confraternity of the brush put palette and easel aside and prepared to go home. The first to leave was Mr. Charles Pitt; he locked up his studio and, as usual, took his key into the caretaker's room.\n\"He had just opened the door when an icy blast literally struck him in the face; both the windows were wide open, and the snow and sleet were beating thickly into the room, forming already a white carpet upon the floor.\n\"The room was in semi-obscurity, and at first Mr. Pitt saw nothing, but instinctively realizing that something was wrong, he lit a match, and saw before him the spectacle of that awful and mysterious tragedy which has ever since puzzled both police and public. On the floor, already half covered by the drifting snow, lay the body of Mrs. Owen face downwards, in a nightgown, with feet and ankles bare, and these and her hands were of a deep purple colour; whilst in a corner of the room, huddled up with the cold, the body of the cockatoo lay stark and stiff.\" \n\"At first there was only talk of a terrible accident, the result of some inexplicable carelessness which perhaps the evidence at the inquest would help to elucidate.\n\"Medical assistance came too late; the unfortunate woman was indeed dead, frozen to death, inside her own room. Further examination showed that she had received a severe blow at the back of the head, which must have stunned her and caused her to fall, helpless, beside the open window. Temperature at five degrees below zero had done the rest. Detective Inspector Howell discovered close to the window a wrought-iron gas bracket, the height of which corresponded exactly with the bruise at the back of Mrs. Owen's head.\n\"Hardly however had a couple of days elapsed when public curiosity was whetted by a few startling headlines, such as the halfpenny evening papers alone know how to concoct.\n\"'The mysterious death in Percy Street.' 'Is it Suicide or Murder?' 'Thrilling details—Strange developments.' 'Sensational Arrest.'\n\"What had happened was simply this:\n\"At the inquest a few certainly very curious facts connected with Mrs. Owen's life had come to light, and this had led to the apprehension of a young man of very respectable parentage on a charge of being concerned in the tragic death of the unfortunate caretaker.\n\"To begin with, it happened that her life, which in an ordinary way should have been very monotonous and regular, seemed, at any rate latterly, to have been more than usually chequered and excited. Every witness who had known her in the past concurred in the statement that since October last a great change had come over the worthy and honest woman.\n\"I happen to have a photo of Mrs. Owen as she was before this great change occurred in her quiet and uneventful life, and which led, as far as the poor soul was concerned, to such disastrous results.\n\"Here she is to the life,\" added the funny creature, placing the photo before Polly—\"as respectable, as stodgy, as uninteresting as it is well possible for a member of your charming sex to be; not a face, you will admit, to lead any youngster to temptation or to induce him to commit a crime.\n\"Nevertheless one day all the tenants of the Rubens Studios were surprised and shocked to see Mrs. Owen, quiet, respectable Mrs. Owen, sallying forth at six o'clock in the afternoon, attired in an extravagant bonnet and a cloak trimmed with imitation astrakhan which—slightly open in front—displayed a gold locket and chain of astonishing proportions.\n\"Many were the comments, the hints, the bits of sarcasm levelled at the worthy woman by the frivolous confraternity of the brush.\n\"The plot thickened when from that day forth a complete change came over the worthy caretaker of the Rubens Studios. While she appeared day after day before the astonished gaze of the tenants and the scandalized looks of the neighbours, attired in new and extravagant dresses, her work was hopelessly neglected, and she was always 'out' when wanted.\n\"There was, of course, much talk and comment in various parts of the Rubens Studios on the subject of Mrs. Owen's 'dissipations.' The tenants began to put two and two together, and after a very little while the general consensus of opinion became firmly established that the honest caretaker's demoralisation coincided week for week, almost day for day, with young Greenhill's establishment in No. 8 Studio.\n\"Every one had remarked that he stayed much later in the evening than any one else, and yet no one presumed that he stayed for purposes of work. Suspicions soon rose to certainty when Mrs. Owen and Arthur Greenhill were seen by one of the glass workmen dining together at Gambia's Restaurant in Tottenham Court Road.\n\"The workman, who was having a cup of tea at the counter, noticed particularly that when the bill was paid the money came out of Mrs. Owen's purse. The dinner had been sumptuous—veal cutlets, a cut from the joint, dessert, coffee and liqueurs. Finally the pair left the restaurant apparently very gay, young Greenhill smoking a choice cigar.\n\"Irregularities such as these were bound sooner or later to come to the ears and eyes of Mr. Allman, the landlord of the Rubens Studios; and a month after the New Year, without further warning, he gave her a week's notice to quit his house.\n\"'Mrs. Owen did not seem the least bit upset when I gave her notice,' Mr. Allman declared in his evidence at the inquest; 'on the contrary, she told me that she had ample means, and had only worked latterly for the sake of something to do. She added that she had plenty of friends who would look after her, for she had a nice little pile to leave to any one who would know how \"to get the right side of her.\"'\n\"Nevertheless, in spite of this cheerful interview, Miss Bedford, the tenant of No. 6 Studio, had stated that when she took her key to the caretaker's room at 6.30 that afternoon she found Mrs. Owen in tears. The caretaker refused to be comforted, nor would she speak of her trouble to Miss Bedford.\n\"Twenty-four hours later she was found dead.\n\"The coroner's jury returned an open verdict, and Detective-Inspector Jones was charged by the police to make some inquiries about young Mr. Greenhill, whose intimacy with the unfortunate woman had been universally commented upon.\n\"The detective, however, pushed his investigations as far as the Birkbeck Bank. There he discovered that after her interview with Mr. Allman, Mrs. Owen had withdrawn what money she had on deposit, some £800, the result of twenty-five years' saving and thrift.\n\"But the immediate result of Detective-Inspector Jones's labours was that Mr. Arthur Greenhill, lithographer, was brought before the magistrate at Bow Street on the charge of being concerned in the death of Mrs. Owen, caretaker of the Rubens Studios, Percy Street.\n\"Now that magisterial inquiry is one of the few interesting ones which I had the misfortune to miss,\" continued the man in the corner, with a nervous shake of the shoulders. \"But you know as well as I do how the attitude of the young prisoner impressed the magistrate and police so unfavourably that, with every new witness brought forward, his position became more and more unfortunate.\n\"Yet he was a good-looking, rather coarsely built young fellow, with one of those awful Cockney accents which literally make one jump. But he looked painfully nervous, stammered at every word spoken, and repeatedly gave answers entirely at random.\n\"His father acted as lawyer for him, a rough-looking elderly man, who had the appearance of a common country attorney rather than of a London solicitor.\n\"The police had built up a fairly strong case against the lithographer. Medical evidence revealed nothing new: Mrs. Owen had died from exposure, the blow at the back of the head not being sufficiently serious to cause anything but temporary disablement. When the medical officer had been called in, death had intervened for some time; it was quite impossible to say how long, whether one hour or five or twelve.\n\"The appearance and state of the room, when the unfortunate woman was found by Mr. Charles Pitt, were again gone over in minute detail. Mrs. Owen's clothes, which she had worn during the day, were folded neatly on a chair. The key of her cupboard was in the pocket of her dress. The door had been slightly ajar, but both the windows were wide open; one of them, which had the sash-line broken, had been fastened up most scientifically with a piece of rope.\n\"Mrs. Owen had obviously undressed preparatory to going to bed, and the magistrate very naturally soon made the remark how untenable the theory of an accident must be. No one in their five senses would undress with a temperature at below zero, and the windows wide open.\n\"After these preliminary statements the cashier of the Birkbeck was called and he related the caretaker's visit at the bank.\n\"'It was then about one o'clock,' he stated. 'Mrs. Owen called and presented a cheque to self for £827, the amount of her balance. She seemed exceedingly happy and cheerful, and talked about needing plenty of cash, as she was going abroad to join her nephew, for whom she would in future keep house. I warned her about being sufficiently careful with so large a sum, and parting from it injudiciously, as women of her class are very apt to do. She laughingly declared that not only was she careful of it in the present, but meant to be so for the far-off future, for she intended to go that very day to a lawyer's office and to make a will.'\n\"The cashier's evidence was certainly startling in the extreme, since in the widow's room no trace of any kind was found of any money; against that, two of the notes handed over by the bank to Mrs. Owen on that day were cashed by young Greenhill on the very morning of her mysterious death. One was handed in by him to the West End Clothiers Company, in payment for a suit of clothes, and the other he changed at the Post Office in Oxford Street.\n\"After that all the evidence had of necessity to be gone through again on the subject of young Greenhill's intimacy with Mrs. Owen. He listened to it all with an air of the most painful nervousness, his cheeks were positively green, his lips seemed dry and parched, for he repeatedly passed his tongue over them, and when Constable E 18 deposed that at 2 a.m. on the morning of February 2nd he had seen the accused and spoken to him at the corner of Percy Street and Tottenham Court Road, young Greenhill all but fainted.\n\"The contention of the police was that the caretaker had been murdered and robbed during that night before she went to bed, that young Greenhill had done the murder, seeing that he was the only person known to have been intimate with the woman, and that it was, moreover, proved unquestionably that he was in the immediate neighbourhood of the Rubens Studios at an extraordinarily late hour of the night.\n\"His own account of himself, and of that same night, could certainly not be called very satisfactory. Mrs. Owen was a relative of his late mother's, he declared. He himself was a lithographer by trade, with a good deal of time and leisure on his hands. He certainly had employed some of that time in taking the old woman to various places of amusement. He had on more than one occasion suggested that she should give up menial work, and come and live with him, but, unfortunately, she was a great deal imposed upon by her nephew, a man of the name of Owen, who exploited the good-natured woman in every possible way, and who had on more than one occasion made severe attacks upon her savings at the Birkbeck Bank.\n\"Severely cross-examined by the prosecuting counsel about this supposed relative of Mrs. Owen, Greenhill admitted that he did not know him—had, in fact, never seen him. He knew that his name was Owen and that was all. His chief occupation consisted in sponging on the kind-hearted old woman, but he only went to see her in the evenings, when he presumably knew that she would be alone, and invariably after all the tenants of the Rubens Studios had left for the day.\n\"I don't know whether at this point it strikes you at all, as it did both magistrate and counsel, that there was a direct contradiction in this statement and the one made by the cashier of the Birkbeck on the subject of his last conversation with Mrs. Owen. 'I am going abroad to join my nephew, for whom I am going to keep house,' was what the unfortunate woman had said.\n\"Now Greenhill, in spite of his nervousness and at times contradictory answers, strictly adhered to his point, that there was a nephew in London, who came frequently to see his aunt.\n\"Anyway, the sayings of the murdered woman could not be taken as evidence in law. Mr. Greenhill senior put the objection, adding: 'There may have been two nephews,' which the magistrate and the prosecution were bound to admit.\n\"With regard to the night immediately preceding Mrs. Owen's death, Greenhill stated that he had been with her to the theatre, had seen her home, and had had some supper with her in her room. Before he left her, at 2 a.m., she had of her own accord made him a present of £10, saying: 'I am a sort of aunt to you, Arthur, and if you don't have it, Bill is sure to get it.'\n\"She had seemed rather worried in the early part of the evening, but later on she cheered up.\n\"'Did she speak at all about this nephew of hers or about her money affairs? asked the magistrate.\n\"Again the young man hesitated, but said, 'No! she did not mention either Owen or her money affairs.'\n\"If I remember rightly,\" added the man in the corner, \"for recollect I was not present, the case was here adjourned. But the magistrate would not grant bail. Greenhill was removed looking more dead than alive—though every one remarked that Mr. Greenhill senior looked determined and not the least worried. In the course of his examination on behalf of his son, of the medical officer and one or two other witnesses, he had very ably tried to confuse them on the subject of the hour at which Mrs. Owen was last known to be alive.\n\"He made a very great point of the fact that the usual morning's work was done throughout the house when the inmates arrived. Was it conceivable, he argued, that a woman would do that kind of work overnight, especially as she was going to the theatre, and therefore would wish to dress in her smarter clothes? It certainly was a very nice point levelled against the prosecution, who promptly retorted: Just as conceivable as that a woman in those circumstances of life should, having done her work, undress beside an open window at nine o'clock in the morning with the snow beating into the room.\n\"Now it seems that Mr. Greenhill senior could produce any amount of witnesses who could help to prove a conclusive alibi on behalf of his son, if only some time subsequent to that fatal 2 a.m. the murdered woman had been seen alive by some chance passer-by.\n\"However, he was an able man and an earnest one, and I fancy the magistrate felt some sympathy for his strenuous endeavours on his son's behalf. He granted a week's adjournment, which seemed to satisfy Mr. Greenhill completely.\n\"In the meanwhile the papers had talked of and almost exhausted the subject of the mystery in Percy Street. There had been, as you no doubt know from personal experience, innumerable arguments on the puzzling alternatives:—\n\"Accident?\n\"Suicide?\n\"Murder?\n\"A week went by, and then the case against young Greenhill was resumed. Of course the court was crowded. It needed no great penetration to remark at once that the prisoner looked more hopeful, and his father quite elated.\n\"Again a great deal of minor evidence was taken, and then came the turn of the defence. Mr. Greenhill called Mrs. Hall, confectioner, of Percy Street, opposite the Rubens Studios. She deposed that at 8 o'clock in the morning of February 2nd, while she was tidying her shop window, she saw the caretaker of the Studios opposite, as usual, on her knees, her head and body wrapped in a shawl, cleaning her front steps. Her husband also saw Mrs. Owen, and Mrs. Hall remarked to her husband how thankful she was that her own shop had tiled steps, which did not need scrubbing on so cold a morning.\n\"Mr. Hall, confectioner, of the same address, corroborated this statement, and Mr. Greenhill, with absolute triumph, produced a third witness, Mrs. Martin, of Percy Street, who from her window on the second floor had, at 7.30 a.m., seen the caretaker shaking mats outside her front door. The description this witness gave of Mrs. Owen's get-up, with the shawl round her head, coincided point by point with that given by Mr. and Mrs. Hall.\n\"After that Mr. Greenhill's task became an easy one; his son was at home having his breakfast at 8 o'clock that morning—not only himself, but his servants would testify to that.\n\"The weather had been so bitter that the whole of that day Arthur had not stirred from his own fireside. Mrs. Owen was murdered after 8 a.m. on that day, since she was seen alive by three people at that hour, therefore his son could not have murdered Mrs. Owen. The police must find the criminal elsewhere, or else bow to the opinion originally expressed by the public that Mrs. Owen had met with a terrible untoward accident, or that perhaps she may have wilfully sought her own death in that extraordinary and tragic fashion.\n\"Before young Greenhill was finally discharged one or two witnesses were again examined, chief among these being the foreman of the glassworks. He had turned up at the Rubens Studios at 9 o'clock, and been in business all day. He averred positively that he did not specially notice any suspicious-looking individual crossing the hall that day. 'But,' he remarked with a smile, 'I don't sit and watch every one who goes up and downstairs. I am too busy for that. The street door is always left open; any one can walk in, up or down, who knows the way.'\n\"That there was a mystery in connection with Mrs. Owen's death—of that the police have remained perfectly convinced; whether young Greenhill held the key of that mystery or not they have never found out to this day.\n\"I could enlighten them as to the cause of the young lithographer's anxiety at the magisterial inquiry, but, I assure you, I do not care to do the work of the police for them. Why should I? Greenhill will never suffer from unjust suspicions. He and his father alone—besides myself—know in what a terribly tight corner he all but found himself.\n\"The young man did not reach home till nearly five o'clock that morning. His last train had gone; he had to walk, lost his way, and wandered about Hampstead for hours. Think what his position would have been if the worthy confectioners of Percy Street had not seen Mrs. Owen 'wrapped up in a shawl, on her knees, doing the front steps.'\n\"Moreover, Mr. Greenhill senior is a solicitor, who has a small office in John Street, Bedford Row. The afternoon before her death Mrs. Owen had been to that office and had there made a will by which she left all her savings to young Arthur Greenhill, lithographer. Had that will been in other than paternal hands, it would have been proved, in the natural course of such things, and one other link would have been added to the chain which nearly dragged Arthur Greenhill to the gallows—'the link of a very strong motive.'\n\"Can you wonder that the young man turned livid, until such time as it was proved beyond a doubt that the murdered woman was alive hours after he had reached the safe shelter of his home?\n\"I saw you smile when I used the word 'murdered,'\" continued the man in the corner, growing quite excited now that he was approaching the dénouement of his story. \"I know that the public, after the magistrate had discharged Arthur Greenhill, were quite satisfied to think that the mystery in Percy Street was a case of accident—or suicide.\"\n\"No,\" replied Polly, \"there could be no question of suicide, for two very distinct reasons.\"\nHe looked at her with some degree of astonishment. She supposed that he was amazed at her venturing to form an opinion of her own.\n\"And may I ask what, in your opinion, these reasons are?\" he asked very sarcastically.\n\"To begin with, the question of money,\" she said—\"has any more of it been traced so far?\"\n\"Not another £5 note,\" he said with a chuckle; \"they were all cashed in Paris during the Exhibition, and you have no conception how easy a thing that is to do, at any of the hotels or smaller agents de change.\"\n\"That nephew was a clever blackguard,\" she commented.\n\"You believe, then, in the existence of that nephew?\"\n\"Why should I doubt it? Some one must have existed who was sufficiently familiar with the house to go about in it in the middle of the day without attracting any one's attention.\"\n\"In the middle of the day?\" he said with a chuckle.\n\"Any time after 8.30 in the morning.\"\n\"So you, too, believe in the 'caretaker, wrapped up in a shawl,' cleaning her front steps?\" he queried.\n\"But—\"\n\"It never struck you, in spite of the training your intercourse with me must have given you, that the person who carefully did all the work in the Rubens Studios, laid the fires and carried up the coals, merely did it in order to gain time; in order that the bitter frost might really and effectually do its work, and Mrs. Owen be not missed until she was truly dead.\"\n\"But—\" suggested Polly again.\n\"It never struck you that one of the greatest secrets of successful crime is to lead the police astray with regard to the time when the crime was committed. That was, if you remember, the great point in the Regent's Park murder.\n\"In this case the 'nephew,' since we admit his existence, would—even if he were ever found, which is doubtful—be able to prove as good an alibi as young Greenhill.\"\n\"But I don't understand—\"\n\"How the murder was committed?\" he said eagerly. \"Surely you can see it all for yourself, since you admit the 'nephew'—a scamp, perhaps—who sponges on the good-natured woman. He terrorises and threatens her, so much so that she fancies her money is no longer safe even in the Birkbeck Bank. Women of that class are apt at times to mistrust the Bank of England. Anyway, she withdraws her money. Who knows what she meant to do with it in the immediate future?\n\"In any case, she wishes to secure it after her death to a young man whom she likes, and who has known how to win her good graces. That afternoon the nephew begs, entreats for more money; they have a row; the poor woman is in tears, and is only temporarily consoled by a pleasant visit at the theatre.\n\"At 2 o'clock in the morning young Greenhill parts from her. Two minutes later the nephew knocks at the door. He comes with a plausible tale of having missed his last train, and asks for a 'shake down' somewhere in the house. The good-natured woman suggests a sofa in one of the studios, and then quietly prepares to go to bed. The rest is very simple and elementary. The nephew sneaks into his aunt's room, finds her standing in her nightgown; he demands money with threats of violence; terrified, she staggers, knocks her head against the gas bracket, and falls on the floor stunned, while the nephew seeks for her keys and takes possession of the £800. You will admit that the subsequent mise en scène—is worthy of a genius.\n\"No struggle, not the usual hideous accessories round a crime. Only the open windows, the bitter north-easterly gale, and the heavily falling snow—two silent accomplices, as silent as the dead.\n\"After that the murderer, with perfect presence of mind, busies himself in the house, doing the work which will ensure that Mrs. Owen shall not be missed, at any rate, for some time. He dusts and tidies; some few hours later he even slips on his aunt's skirt and bodice, wraps his head in a shawl, and boldly allows those neighbours who are astir to see what they believe to be Mrs. Owen. Then he goes back to her room, resumes his normal appearance and quietly leaves the house.\"\n\"He may have been seen.\"\n\"He undoubtedly was seen by two or three people, but no one thought anything of seeing a man leave the house at that hour. It was very cold, the snow was falling thickly, and as he wore a muffler round the lower part of his face, those who saw him would not undertake to know him again.\"\n\"That man was never seen nor heard of again?\" Polly asked.\n\"He has disappeared off the face of the earth. The police are searching for him, and perhaps some day they will find him—then society will be rid of one of the most ingenious men of the age.\" \nHe had paused, absorbed in meditation. The young girl also was silent. Some memory too vague as yet to take a definite form was persistently haunting her—one thought was hammering away in her brain, and playing havoc with her nerves. That thought was the inexplicable feeling within her that there was something in connection with that hideous crime which she ought to recollect, something which—if she could only remember what it was—would give her the clue to the tragic mystery, and for once ensure her triumph over this self-conceited and sarcastic scarecrow in the corner.\nHe was watching her through his great bone-rimmed spectacles, and she could see the knuckles of his bony hands, just above the top of the table, fidgeting, fidgeting, fidgeting, till she wondered if there existed another set of fingers in the world which could undo the knots his lean ones made in that tiresome piece of string.\nThen suddenly—á propos of nothing, Polly remembered—the whole thing stood before her, short and clear like a vivid flash of lightning:—Mrs. Owen lying dead in the snow beside her open window; one of them with a broken sash-line, tied up most scientifically with a piece of string. She remembered the talk there had been at the time about this improvised sash-line.\nThat was after young Greenhill had been discharged, and the question of suicide had been voted an impossibility.\nPolly remembered that in the illustrated papers photographs appeared of this wonderfully knotted piece of string, so contrived that the weight of the frame could but tighten the knots, and thus keep the window open. She remembered that people deduced many things from that improvised sash-line, chief among these deductions being that the murderer was a sailor—so wonderful, so complicated, so numerous were the knots which secured that window-frame.\nBut Polly knew better. In her mind's eye she saw those fingers, rendered doubly nervous by the fearful cerebral excitement, grasping at first mechanically, even thoughtlessly, a bit of twine with which to secure the window; then the ruling habit strongest through all, the girl could see it; the lean and ingenious fingers fidgeting, fidgeting with that piece of string, tying knot after knot, more wonderful, more complicated, than any she had yet witnessed.\n\"If I were you,\" she said, without daring to look into that corner where he sat, \"I would break myself of the habit of perpetually making knots in a piece of string.\"\nHe did not reply, and at last Polly ventured to look up—the corner was empty, and through the glass door beyond the desk, where he had just deposited his few coppers, she saw the tails of his tweed coat, his extraordinary hat, his meagre, shrivelled-up personality, fast disappearing down the street.\nMiss Polly Burton (of the Evening Observer) was married the other day to Mr. Richard Frobisher (of the London Mail). She has never set eyes on the man in the corner from that day to this.\n\n\nNote the reveal happens at the end of the story, specifically revealed here:\n\n\"How the murder was committed?\" he said eagerly.  \"Surely you can see it all for yourself, since you admit the 'nephew'—a scamp, perhaps—who sponges on the good-natured woman. He terrorises and threatens her, so much so that she fancies her money is no longer safe even in the Birkbeck Bank. Women of that class are apt at times to mistrust the Bank of England. Anyway, she withdraws her money. Who knows what she meant to do with it in the immediate future?\n\"In any case, she wishes to secure it after her death to a young man whom she likes, and who has known how to win her good graces. That afternoon the nephew begs, entreats for more money; they have a row; the poor woman is in tears, and is only temporarily consoled by a pleasant visit at the theatre.\n\"At 2 o'clock in the morning young Greenhill parts from her. Two minutes later the nephew knocks at the door. He comes with a plausible tale of having missed his last train, and asks for a 'shake down' somewhere in the house. The good-natured woman suggests a sofa in one of the studios, and then quietly prepares to go to bed. The rest is very simple and elementary. The nephew sneaks into his aunt's room, finds her standing in her nightgown; he demands money with threats of violence; terrified, she staggers, knocks her head against the gas bracket, and falls on the floor stunned, while the nephew seeks for her keys and takes possession of the £800. You will admit that the subsequent mise en scène—is worthy of a genius.\n\"No struggle, not the usual hideous accessories round a crime. Only the open windows, the bitter north-easterly gale, and the heavily falling snow—two silent accomplices, as silent as the dead.\n\"After that the murderer, with perfect presence of mind, busies himself in the house, doing the work which will ensure that Mrs. Owen shall not be missed, at any rate, for some time. He dusts and tidies; some few hours later he even slips on his aunt's skirt and bodice, wraps his head in a shawl, and boldly allows those neighbours who are astir to see what they believe to be Mrs. Owen. Then he goes back to her room, resumes his normal appearance and quietly leaves the house.\"\n\"He may have been seen.\"\n\"He undoubtedly was seen by two or three people, but no one thought anything of seeing a man leave the house at that hour. It was very cold, the snow was falling thickly, and as he wore a muffler round the lower part of his face, those who saw him would not undertake to know him again.\"\n\"That man was never seen nor heard of again?\" Polly asked.\n\"He has disappeared off the face of the earth. The police are searching for him, and perhaps some day they will find him—then society will be rid of one of the most ingenious men of the age.\" \nHe had paused, absorbed in meditation. The young girl also was silent. Some memory too vague as yet to take a definite form was persistently haunting her—one thought was hammering away in her brain, and playing havoc with her nerves. That thought was the inexplicable feeling within her that there was something in connection with that hideous crime which she ought to recollect, something which—if she could only remember what it was—would give her the clue to the tragic mystery, and for once ensure her triumph over this self-conceited and sarcastic scarecrow in the corner.\nHe was watching her through his great bone-rimmed spectacles, and she could see the knuckles of his bony hands, just above the top of the table, fidgeting, fidgeting, fidgeting, till she wondered if there existed another set of fingers in the world which could undo the knots his lean ones made in that tiresome piece of string.\nThen suddenly—á propos of nothing, Polly remembered—the whole thing stood before her, short and clear like a vivid flash of lightning:—Mrs. Owen lying dead in the snow beside her open window; one of them with a broken sash-line, tied up most scientifically with a piece of string. She remembered the talk there had been at the time about this improvised sash-line.\nThat was after young Greenhill had been discharged, and the question of suicide had been voted an impossibility.\nPolly remembered that in the illustrated papers photographs appeared of this wonderfully knotted piece of string, so contrived that the weight of the frame could but tighten the knots, and thus keep the window open. She remembered that people deduced many things from that improvised sash-line, chief among these deductions being that the murderer was a sailor—so wonderful, so complicated, so numerous were the knots which secured that window-frame.\nBut Polly knew better. In her mind's eye she saw those fingers, rendered doubly nervous by the fearful cerebral excitement, grasping at first mechanically, even thoughtlessly, a bit of twine with which to secure the window; then the ruling habit strongest through all, the girl could see it; the lean and ingenious fingers fidgeting, fidgeting with that piece of string, tying knot after knot, more wonderful, more complicated, than any she had yet witnessed.\n\"If I were you,\" she said, without daring to look into that corner where he sat, \"I would break myself of the habit of perpetually making knots in a piece of string.\"\nHe did not reply, and at last Polly ventured to look up—the corner was empty, and through the glass door beyond the desk, where he had just deposited his few coppers, she saw the tails of his tweed coat, his extraordinary hat, his meagre, shrivelled-up personality, fast disappearing down the street.\nMiss Polly Burton (of the Evening Observer) was married the other day to Mr. Richard Frobisher (of the London Mail). She has never set eyes on the man in the corner from that day to this.\n\n\nPlease analyze all the clues and evidence presented in the story and identify who the culprit is. Explain your reasoning step by step, considering:\n1. The motives of different characters\n2. The opportunities each character had\n3. Any physical evidence or alibis\n4. (Most Important) The reveal information provided in the final segment\n\nWho is the culprit (or culprits, if more than one) and why? Answer in the form:\nCULPRIT: <name(s) here>\n\nSUSPECTS: <names(s) for all suspects here>\n\nREASON: <reasoning>",
    "solution": "CULPRIT: “The man in the corner” himself – the anonymous, shabby old fellow who sits in the A.B.C. tea-shop (i.e. the self-styled “detective” and narrator of the case).  \n(He is the very “nephew” he pretends to analyse.)\n\nSUSPECTS:  \n• Arthur Greenhill, lithographer (publicly arrested).  \n• Mr Greenhill senior, solicitor.  \n• An unnamed “nephew of Mrs Owen” (invented by the real killer).  \n• Any casual burglar or passer-by (quickly ruled out).  \n• The man in the corner (ultimately the true murderer).\n\nREASON:\n\n1. Motive  \n   – £827 in bank notes withdrawn by Mrs Owen a few hours before her death.  \n   – The old man obviously got that cash; he afterwards spent or changed the notes in Paris (information only the killer could possess).  \n   – He needed to divert suspicion, so he framed an imaginary “nephew” and tried to fasten the main suspicion on young Greenhill.  \n\n2. Opportunity  \n   – Because of his unknown identity he could enter or leave lodging houses without being recognised.  \n   – He knew, and minutely describes, every corner of the Rubens Studios and the caretaker’s habits – knowledge a mere newspaper reader would not possess unless he had been on the spot.  \n   – He is an expert at knot-tying (see below), therefore perfectly able to contrive the sash-cord, prop the window, and do the caretaker’s early-morning work so that she should not be missed for several hours.\n\n3. Physical evidence / the decisive clue  \n   – At the scene a broken sash-line had been re-rigged with a short bit of string full of innumerable, elaborate knots.  \n   – Throughout Baroness Orczy’s stories this old man’s CONSTANT HABIT is to sit in the tea-shop and “fidget, fidget, fidget” with a short length of twine, tying complicated knots in it while he talks.  \n   – Polly suddenly correlates the two: the knotting style at the murder scene and the nervous, incessant knotting fingers before her.  \n   – This is why she says: “If I were you I would break myself of the habit of perpetually making knots in a piece of string.”  \n   – Realising she has spotted his tell-tale signature, the old man slips away and is never seen by her again.\n\n4. Knowledge that only the criminal could have  \n   – He can quote the exact serial numbers’ fate of the missing notes (“all cashed in Paris … you have no conception how easy that is”).  \n   – He knows the precise sequence of events inside the house between 2 a.m. and 8 a.m., although no living witness saw them.  \n   – He declares, with suspicious admiration, that the murderer’s mise-en-scène was “worthy of Russian diplomacy” and that he himself “could not condemn” so brilliant a mind – a revealing piece of self-praise.\n\n5. Elimination of other suspects  \n   • Arthur Greenhill: strong prima-facie case, but three independent witnesses saw Mrs Owen alive at 7.30–8 a.m., while Arthur was demonstrably at home; the money never reached him, and he had no known knot-tying skill.  \n   • Mr Greenhill senior: only interest is saving his son; no access to studio, no need to bustle about at dawn masquerading as the caretaker.  \n   • An unknown real nephew: entirely a fiction planted by the killer; no one except the murderer ever claims to have met him.\n\n6. Final reveal  \n   – The story explicitly closes with Polly’s realisation and the old man’s flight; she never sees him again.  \n   – That is the author’s unobtrusive but unequivocal identification of the murderer.\n\nTherefore, weighing motive, opportunity, physical evidence and, above all, the climactic recognition of the unique knotted string, the only possible conclusion is:\n\nCULPRIT: the nameless “man in the corner,” the very raconteur of the tale, who murdered Mrs Owen, stole her savings, staged the scene and then gleefully analysed his own crime in front of Polly Burton."
  },
  "original_metadata": {
    "story_code": "OMIC12",
    "story_title": "The Mysterious Death in Percy Street",
    "author_name": "Unknown",
    "author_code": "BO",
    "plot_summary": "Erratic behavior, a sudden lover, and an even more sudden suicide; all of these factors point towards unusual circumstances regarding the death of Mrs. Owens and her frozen cockatoo.",
    "text_length": 33212,
    "is_solvable": true,
    "story_annotations": {
      "Story Code": "OMIC12",
      "Annotator #1 Code": "SK",
      "Annotator #2 Code": "MAL",
      "Story Title": "The Mysterious Death in Percy Street",
      "Plot Summary": "Erratic behavior, a sudden lover, and an even more sudden suicide; all of these factors point towards unusual circumstances regarding the death of Mrs. Owens and her frozen cockatoo.",
      "Content warnings": "",
      "Author Code": "BO",
      "Second author code (if applicable)": "",
      "Investigation-reveal order": "Standard",
      "Reveal border sentence": "\"How the murder was committed?\" he said eagerly.",
      "Name of Detective #1": "Bill Owen",
      "Detective #1 Gender": "Male",
      "Detective #1 Role": "Independent amateur",
      "Name of Detective #2": "",
      "Detective #2 Gender": "",
      "Detective #2 Role": "",
      "Number of detectives if more than 2": "",
      "Name of Assistant #1": "Polly Burton",
      "Assistant #1 Gender": "Female",
      "Assistant #1 Role": "Independent amateur",
      "Name of Assistant #2": "",
      "Assistant #2 Gender": "",
      "Assistant #2 Role": "",
      "Number of assistants if more than 2": "",
      "Number of victims of gender Male": "0",
      "Number of victims of gender Female": "1",
      "Number of victims of gender Non-binary": "0",
      "Number of victims of gender Unknown": "0",
      "Number of victims who are corporate entities": "0",
      "Number of culprits of gender Male": "1",
      "Number of culprits of gender Female": "0",
      "Number of culprits of gender Non-binary": "0",
      "Number of culprits of gender Unknown": "0",
      "Culprits introduced during reveal?": "No",
      "Main culprit independence": "Acts alone",
      "Initiator of investigation": "The detective(s) themselves",
      "Role of police": "Police are present but with no role, or only a minor role, in helping solve the crime",
      "Focus on crime or quasi-crime": "Crime",
      "Crime trajectory": "Qrime → same qrime",
      "Occurrence of crime or mystery": "Before the investigation",
      "Types of qrimes": "Murder, Blackmail",
      "Motives": "Greed",
      "Means (murder only)": "Other",
      "Sufficient clues to guess?": "Yes",
      "Sufficient clues to solve?": "Yes",
      "Correct annotator guess?": "Yes",
      "Types of clues": "Usable in real time (usable → usable), Usable only in retrospect (legible → usable), Ex post -- newly usable clue (illegible → usable)",
      "Essential clue": "The window tied with the sash-line string",
      "Type of essential clue": "Physical clue",
      "Most salient clue": "Strained relationship with nephew",
      "Type of most salient clue": "Testimonial clue",
      "Red herring description": "",
      "Type of red herring": "",
      "Presence of planted or fabricated evidence": "",
      "Types of evidence made available": "Testimonial evidence, Physical evidence",
      "Is the crime solved?": "Yes",
      "Decision NOT to alert authorities?": "No",
      "Satisfying narrative account?": "Yes",
      "How satisfying as detective fiction?": "4",
      "Recommend to friend?": "Yes",
      "Date of First Publication (YYYY-MM-DD)": "1908-10-20",
      "Format of First Publication (Journal or Book)": "Book",
      "Name of Journal or Title of Book": "The Old Man in the Corner"
    },
    "author_metadata": {
      "Author Code": "BO",
      "Surname(s)": "Orczy",
      "Given Name(s)": "Emma",
      "Sex": "F",
      "Date of Birth (YYYY-MM-DD)": "1865-09-23",
      "Country of Birth": "Hungary",
      "City/Town of Birth": "Tarnaörs",
      "Date of Death (YYYY-MM-DD)": "1947-11-12",
      "Country of Death": "Henley-on-Thames",
      "City/Town of Death": "England",
      "Nationality/ies": "Hungarian, British",
      "VIAF": "https://viaf.org/viaf/39382131/"
    }
  }
}