{
  "metadata": {
    "event_name": "TEV06",
    "event_description": "Detective story 'The Ghost with the Club-Foot' by Unknown",
    "model": "o3",
    "story_length": 60192,
    "reveal_length": 3631,
    "border_sentence": "'Is that you at last, you beast of a butler? Bring me something to eat, in Heaven's name!'"
  },
  "story": {
    "full_text": "Celebrated critics have written with scorn of what they call 'the long\narm of coincidence' in fiction. Coincidence is supposed to be the\ndevice of a novelist who does not possess ingenuity enough to\nconstruct a book without it. In France our incomparable writers pay no\nattention to this, because they are gifted with a keener insight into\nreal life than is the case with the British. The superb Charles\nDickens, possibly as well known in France as he is wherever the\nEnglish language is read, and who loved French soil and the French\npeople, probably probed deeper into the intricacies of human character\nthan any other novelist of modern times, and if you read his works,\nyou will see that he continually makes use of coincidence. The\nexperience that has come to me throughout my own strange and varied\ncareer convinces me that coincidence happens in real life with\nexceeding frequency, and this fact is especially borne in upon me when\nI set out to relate my conflict with the Rantremly ghost, which\nwrought startling changes upon the lives of two people, one an\nobjectionable, domineering man, and the other a humble and crushed\nwoman. Of course, there was a third person, and the consequences that\ncame to him were the most striking of all, as you will learn if you do\nme the honour to read this account of the episode.\nSo far as coincidence is concerned, there was first the arrival of the\nnewspaper clipping, then the coming of Sophia Brooks, and when that\nmuch-injured woman left my flat I wrote down this sentence on a sheet\nof paper:--\n'Before the week is out, I predict that Lord Rantremly himself will\ncall to see me.'\nNext day my servant brought in the card of Lord Rantremly.\nI must begin with the visit of Sophia Brooks, for though that comes\nsecond, yet I had paid no attention in particular to the newspaper\nclipping until the lady told her story. My man brought me a\ntypewritten sheet of paper on which were inscribed the words:--\n'Sophia Brooks, Typewriting and Translating Office, First Floor, No. 51\nBeaumont Street, Strand, London, W.C.'\nI said to my servant,--\n'Tell the lady as kindly as possible that I have no typewriting work\nto give out, and that, in fact, I keep a stenographer and typewriting\nmachine on the premises.'\nA few moments later my man returned, and said the lady wished to see\nme, not about typewriting, but regarding a case in which she hoped to\ninterest me. I was still in some hesitation about admitting her, for\nmy transactions had now risen to a higher plane than when I was new to\nLondon. My expenses were naturally very heavy, and it was not possible\nfor me, in justice to myself, to waste time in commissions from the\npoor, which even if they resulted successfully meant little money\nadded to my banking account, and often nothing at all, because the\nclient was unable to pay. As I remarked before, I possess a heart the\nmost tender, and therefore must greatly to my grief, steel myself\nagainst the enlisting of my sympathy, which, alas! has frequently led\nto my financial loss. Still, sometimes the apparently poor are\ninvolved in matters of extreme importance, and England is so eccentric\na country that one may find himself at fault if he closes his door too\nharshly. Indeed, ever since my servant, in the utmost good faith,\nthrew downstairs the persistent and tattered beggar-man, who he\nlearned later to his sorrow was actually his Grace the Duke of\nVentnor, I have always cautioned my subordinates not to judge too\nhastily from appearances.\n'Show the lady in,' I said, and there came to me, hesitating,\nbackward, abashed, a middle-aged woman, dressed with distressing\nplainness, when one thinks of the charming costumes to be seen on a\nParisian boulevard. Her subdued manner was that of one to whom the\nworld had been cruel. I rose, bowed profoundly, and placed a chair at\nher disposal, with the air I should have used if my caller had been a\nRoyal Princess. I claim no credit for this; it is of my nature. There\nyou behold Eugène Valmont. My visitor was a woman. _Voilà!_\n'Madam,' I said politely, 'in what may I have the pleasure of serving\nyou?'\nThe poor woman seemed for the moment confused, and was, I feared, on\nthe verge of tears, but at last she spoke, and said,--\n'Perhaps you have read in the newspapers of the tragedy at Rantremly\nCastle?'\n'The name, madam, remains in my memory, associated elusively with some\nhint of seriousness. Will you pardon me a moment?' and a vague thought\nthat I had seen the castle mentioned either in a newspaper, or a\nclipping from one, caused me to pick up the latest bunch which had\ncome from my agent. I am imbued with no vanity at all; still it is\namusing to note what the newspapers say of one, and therefore I have\nsubscribed to a clipping agency. In fact, I indulge in two\nsubscriptions--one personal; the other calling for any pronouncement\npertaining to the differences between England and France; for it is my\ndetermination yet to write a book on the comparative characteristics\nof the two people. I hold a theory that the English people are utterly\nincomprehensible to the rest of humanity, and this will be duly set\nout in my forthcoming volume.\nI speedily found the clipping I was in search of. It proved to be a\nletter to the _Times_, and was headed: 'Proposed Destruction of\nRantremly Castle'. The letter went on to say that this edifice was one\nof the most noted examples of Norman architecture in the north of\nEngland; that Charles II had hidden there for some days after his\ndisastrous defeat at Worcester. Part of the castle had been battered\ndown by Cromwell, and later it again proved the refuge of a Stuart\nwhen the Pretender made it a temporary place of concealment. The new\nLord Rantremly, it seemed, had determined to demolish this ancient\nstronghold, so interesting architecturally and historically, and to\nbuild with its stones a modern residence. Against this act of\nvandalism the writer strongly protested, and suggested that England\nshould acquire the power which France constantly exerts, in making an\nhistorical monument of an edifice so interwoven with the fortunes of\nthe country.\n'Well, madam,' I said, 'all this extract alludes to is the coming\ndemolition of Rantremly Castle. Is that the tragedy of which you\nspeak?'\n'Oh no,' she exclaimed; 'I mean the death of the eleventh Lord\nRantremly about six weeks ago. For ten years Lord Rantremly lived\npractically alone in the castle. Servants would not remain there\nbecause the place was haunted, and well it may be, for a terrible\nfamily the Rantremlys have been, and a cruel, as I shall be able to\ntell you. Up to a month and a half ago Lord Rantremly was waited on by\na butler older than himself, and if possible, more wicked. One morning\nthis old butler came up the stairs from the kitchen, with Lord\nRantremly's breakfast on a silver tray, as was his custom. His\nlordship always partook of breakfast in his own room. It is not known\nhow the accident happened, as the old servant was going up the stairs\ninstead of coming down, but the steps are very smooth and slippery,\nand without a carpet; at any rate, he seems to have fallen from the\ntop to the bottom, and lay there with a broken neck. Lord Rantremly,\nwho was very deaf, seemingly did not hear the crash, and it is\nsupposed that after ringing and ringing in vain, and doubtless working\nhimself into a violent fit of temper--alas! too frequent an\noccurrence--the old nobleman got out of bed, and walked barefooted\ndown the stair, coming at last upon the body of his ancient servant.\nThere the man who arrived every morning to light the fires found them,\nthe servant dead, and Lord Rantremly helpless from an attack of\nparalysis. The physicians say that only his eyes seemed alive, and\nthey were filled with a great fear, and indeed that is not to be\nwondered at, after his wicked, wicked life. His right hand was but\npartially disabled, and with that he tried to scribble something which\nproved indecipherable. And so he died, and those who attended him at\nhis last moments say that if ever a soul had a taste of future\npunishment before it left this earth, it was the soul of Lord\nRantremly as it shone through those terror-stricken eyes.'\nHere the woman stopped, with a catch in her breath, as if the fear of\nthat grim death-bed had communicated itself to her. I interjected\ncalmness into an emotional situation by remarking in a commonplace\ntone,--'And it is the present Lord Rantremly who proposes to destroy\nthe castle, I suppose?'\n'Yes.'\n'Is he the son of the late lord?'\n'No; he is a distant relative. The branch of the family to which he\nbelongs has been engaged in commerce, and, I believe, its members are\nvery wealthy.'\n'Well, madam, no doubt this is all extremely interesting, and rather\ngruesome. In what way are you concerned in these occurrences?'\n'Ten years ago I replied to an advertisement, there being required one\nwho knew shorthand, who possessed a typewriting machine and a\nknowledge of French, to act as secretary to a nobleman. I was at that\ntime twenty-three years old, and for two years had been trying to earn\nmy living in London through the typing of manuscript. But I was making\na hard struggle of it, so I applied for this position and got it.\nThere are in the library of Rantremly Castle many documents relating\nto the Stuart exile in France. His lordship wished these documents\nsorted and catalogued, as well as copies taken of each. Many of the\nletters were in the French language, and these I was required to\ntranslate and type. It was a sombre place of residence, but the salary\nwas good, and I saw before me work enough to keep me busy for years.\nBesides this, the task was extremely congenial, and I became absorbed\nin it, being young and romantically inclined. Here I seemed to live in\nthe midst of these wonderful intrigues of long ago. Documents passed\nthrough my hands whose very possession at one period meant capital\ndanger, bringing up even now visions of block, axe, and masked\nheadsman. It seemed strange to me that so sinister a man as Lord\nRantremly, who, I had heard, cared for nothing but drink and gambling,\nshould have desired to promote this historical research, and, indeed,\nI soon found he felt nothing but contempt for it. However, he had\nundertaken it at the instance of his only son, then a young man of my\nown age, at Oxford University.\n'Lord Rantremly at that time was sixty-five years old. His countenance\nwas dark, harsh, and imperious, and his language brutal. He indulged\nin frightful outbursts of temper, but he paid so well for service that\nthere was no lack of it, as there has been since the ghost appeared\nsome years ago. He was very tall, and of commanding appearance, but\nhad a deformity in the shape of a club-foot, and walked with the\nhalting step of those so afflicted. There were at that time servants\nin plenty at the castle, for although a tradition existed that the\nghost of the founder of the house trod certain rooms, this ghost, it\nwas said, never demonstrated its presence when the living\nrepresentative of the family was a man with a club-foot. Tradition\nfurther affirmed that if this club-footed ghost allowed its halting\nfootsteps to be heard while the reigning lord possessed a similar\ndeformity, the conjunction foreshadowed the passing of title and\nestates to a stranger. The ghost haunted the castle only when it was\noccupied by a descendant whose two feet were normal. It seems that the\nfounder of the house was a club-footed man, and this disagreeable\npeculiarity often missed one generation, and sometimes two, while at\nother times both father and son had club-feet, as was the case with\nthe late Lord Rantremly and the young man at Oxford. I am not a\nbeliever in the supernatural, of course, but nevertheless it is\nstrange that within the past few years everyone residing in the castle\nhas heard the club-footed ghost, and now title and estates descend to\na family that were utter strangers to the Rantremlys.'\n'Well, madam, this also sounds most alluring, and were my time not\ntaken up with affairs more material than those to which you allude, I\nshould be content to listen all day, but as it is--' I spread my hands\nand shrugged my shoulders.\nThe woman with a deep sigh said,--\n'I am sorry to have taken so long, but I wished you to understand the\nsituation, and now I will come direct to the heart of the case. I\nworked alone in the library, as I told you, much interested in what I\nwas doing. The chaplain, a great friend of Lord Rantremly's son, and,\nindeed, a former tutor of his, assisted me with the documents that\nwere in Latin, and a friendship sprang up between us. He was an\nelderly man, and extremely unworldly. Lord Rantremly never concealed\nhis scorn of this clergyman, but did not interfere with him because of\nthe son.\n'My work went on very pleasantly up to the time that Reginald, the\nheir of his lordship, came down from Oxford. Then began the happiest\ndays of a life that has been otherwise full of hardships and distress.\nReginald was as different as possible from his father. In one respect\nonly did he bear any resemblance to that terrible old man, and this\nresemblance was the deformity of a club-foot, a blemish which one soon\nforgot when one came to know the gentle and high-minded nature of the\nyoung man. As I have said, it was at his instance that Lord Rantremly\nhad engaged me to set in order those historical papers. Reginald\nbecame enthusiastic at the progress I had made, and thus the young\nnobleman, the chaplain, and myself continued our work together with\never-increasing enthusiasm.\n'To cut short a recital which must be trying to your patience, but\nwhich is necessary if you are to understand the situation, I may say\nthat our companionship resulted in a proposal of marriage to me, which\nI, foolishly, perhaps, and selfishly, it may be, accepted. Reginald\nknew that his father would never consent, but we enlisted the sympathy\nof the chaplain, and he, mild, unworldly man, married us one day in\nthe consecrated chapel of the castle.\n'As I have told you, the house at that time contained many servants,\nand I think, without being sure, that the butler, whom I feared even\nmore than Lord Rantremly himself, got some inkling of what was going\nforward. But, be that as it may, he and his lordship entered the\nchapel just as the ceremony was finished, and there followed an\nagonising scene. His lordship flung the ancient chaplain from his\nplace, and when Reginald attempted to interfere, the maddened nobleman\nstruck his son full in the face with his clenched fist, and my husband\nlay as one dead on the stone floor of the chapel. By this time the\nbutler had locked the doors, and had rudely torn the vestments from\nthe aged, half-insensible clergyman, and with these tied him hand and\nfoot. All this took place in a very few moments, and I stood there as\none paralysed, unable either to speak or scream, not that screaming\nwould have done me any good in that horrible place of thick walls. The\nbutler produced a key, and unlocked a small, private door at the side\nof the chapel which led from the apartments of his lordship to the\nfamily pew. Then taking my husband by feet and shoulders, Lord\nRantremly and the butler carried him out, locking the door, and\nleaving the clergyman and me prisoners in the chapel. The reverend old\ngentleman took no notice of me. He seemed to be dazed, and when at\nlast I found my voice and addressed him, he merely murmured over and\nover texts of Scripture pertaining to the marriage service.\n'In a short time I heard the key turn again in the lock of the private\ndoor, and the butler entered alone. He unloosened the bands around the\nclergyman's knees, escorted him out, and once more locked the door\nbehind him. A third time that terrible servant came back, grasped me\nroughly by the wrist, and without a word dragged me with him, along a\nnarrow passage, up a stair, and finally to the main hall, and so to my\nlord's private study, which adjoined his bedroom, and there on a table\nI found my typewriting machine brought up from the library.\n'I have but the most confused recollection of what took place. I am\nnot a courageous woman, and was in mortal terror both of Lord\nRantremly and his attendant. His lordship was pacing up and down the\nroom, and, when I came in, used the most unseemly language to me; then\nordered me to write at his dictation, swearing that if I did not do\nexactly as he told me, he would finish his son, as he put it. I sat\ndown at the machine, and he dictated a letter to himself, demanding\ntwo thousand pounds to be paid to me, otherwise I should claim that I\nwas the wife of his son, secretly married. This, placing pen and ink\nbefore me, he compelled me to sign, and when I had done so, pleading\nto be allowed to see my husband, if only for a moment, I thought he\nwas going to strike me, for he shook his fist in my face, and used\nwords which were appalling to hear. That was the last I ever saw of\nLord Rantremly, my husband, the clergyman, or the butler. I was at\nonce sent off to London with my belongings, the butler himself buying\nmy ticket, and flinging a handful of sovereigns into my lap as the\ntrain moved out.'\nHere the woman stopped, buried her face in her hands, and began to\nweep.\n'Have you done nothing about this for the past ten years?'\nShe shook her head.\n'What could I do?' she gasped. 'I had little money, and no friends.\nWho would believe my story? Besides this, Lord Rantremly retained\npossession of a letter, signed by myself, that would convict me of\nattempted blackmail, while the butler would swear to anything against\nme.'\n'You have no marriage certificate, of course?'\n'No.'\n'What has become of the clergyman?'\n'I do not know.'\n'And what of Lord Rantremly's son?'\n'It was announced that he had gone on a voyage to Australia for his\nhealth in a sailing ship, which was wrecked on the African coast, and\neveryone on board lost.'\n'What is your own theory?'\n'Oh, my husband was killed by the blow given him in the chapel.'\n'Madam, that does not seem credible. A blow from the fist seldom\nkills.'\n'But he fell backwards, and his head struck the sharp stone steps at\nthe foot of the altar. I know my husband was dead when the butler and\nhis father carried him out.'\n'You think the clergyman was also murdered?'\n'I am sure of it. Both master and servant were capable of any crime or\ncruelty.'\n'You received no letters from the young man?'\n'No. You see, during our short friendship we were constantly together,\nand there was no need of correspondence.'\n'Well, madam, what do you expect of me?'\n'I hoped you would investigate, and find perhaps where Reginald and\nthe clergyman are buried. I realise that I have no proof, but in that\nway my strange story will be corroborated.'\nI leaned back in my chair and looked at her. Truth to tell, I only\npartially credited her story myself, and yet I was positive she\nbelieved every word of it. Ten years brooding on a fancied injustice\nby a woman living alone, and doubtless often in dire poverty, had\nmixed together the actual and the imaginary until now, what had\npossibly been an aimless flirtation on the part of the young man,\nunexpectedly discovered by the father, had formed itself into the\ntragedy which she had told me.\n'Would it not be well,' I suggested, 'to lay the facts before the\npresent Lord Rantremly?'\n'I have done so,' she answered simply.\n'With what result?'\n'His lordship said my story was preposterous. In examining the late\nlord's private papers, he discovered the letter which I typed and\nsigned. He said very coldly that the fact that I had waited until\neveryone who could corroborate or deny my story was dead, united with\nthe improbability of the narrative itself, would very likely consign\nme to prison if I made public a statement so incredible.'\n'Well, you know, madam, I think his lordship is right.'\n'He offered me an annuity of fifty pounds, which I refused.'\n'In that refusal, madam, I think you are wrong. If you take my advice,\nyou will accept the annuity.'\nThe woman rose slowly to her feet.\n'It is not money I am after,' she said, 'although, God knows, I have\noften been in sore need of it. But I am the Countess of Rantremly, and\nI wish my right to that name acknowledged. My character has been under\nan impalpable shadow for ten years. On several occasions mysterious\nhints have reached me that in some manner I left the castle under a\ncloud. If Lord Rantremly will destroy the letter which I was compelled\nto write under duress, and if he will give me written acknowledgment\nthat there was nothing to be alleged against me during my stay in the\ncastle, he may enjoy his money in peace for all of me. I want none of\nit.'\n'Have you asked him to do this?'\n'Yes. He refuses to give up or destroy the letter, although I told him\nin what circumstances it had been written. But, desiring to be fair,\nhe said he would allow me a pound a week for life, entirely through\nhis own generosity.'\n'And this you refused?'\n'Yes, I refused.'\n'Madam, I regret to say that I cannot see my way to do anything with\nregard to what I admit is very unjust usage. We have absolutely\nnothing to go upon except your unsupported word. Lord Rantremly was\nperfectly right when he said no one would credit your story. I could\nnot go down to Rantremly Castle and make investigations there. I\nshould have no right upon the premises at all, and would get into\ninstant trouble as an interfering trespasser. I beg you to heed my\nadvice, and accept the annuity.'\nSophia Brooks, with that mild obstinacy of which I had received\nindications during her recital, slowly shook her head.\n'You have been very kind to listen for so long,' she said, and then,\nwith a curt 'Good-day!' turned and left the room. On the sheet of\npaper underneath her address, I wrote this prophecy: 'Before the week\nis out, I predict that Lord Rantremly himself will call to see me.'\n       *       *       *       *       *\nNext morning, at almost the same hour that Miss Brooks had arrived the\nday before, the Earl of Rantremly's card was brought in to me.\nHis lordship proved to be an abrupt, ill-mannered, dapper business\nman; purse-proud, I should call him, as there was every reason he\nshould be, for he had earned his own fortune. He was doubtless equally\nproud of his new title, which he was trying to live up to, assuming\nnow and then a haughty, domineering attitude, and again relapsing into\nthe keen, incisive manner of the man of affairs; shrewd financial\nsense waging a constant struggle with the glamour of an ancient name.\nI am sure he would have shone to better advantage either as a\nfinancier or as a nobleman, but the combination was too much for him.\nI formed an instinctive dislike to the man, which probably would not\nhave happened had he been wearing the title for twenty years, or had I\nmet him as a business man, with no thought of the aristocratic honour\nawaiting him. There seemed nothing in common between him and the\nformer holder of the title. He had keen, ferrety eyes, a sharp\nfinancial nose, a thin-lipped line of mouth which indicated little of\nhuman kindness. He was short of stature, but he did not possess the\nclub-foot, which was one advantage. He seated himself before I had\ntime to offer him a chair, and kept on his hat in my presence, which\nhe would not have done if he had either been a genuine nobleman or a\ncourteous business man.\n'I am Lord Rantremly,' he announced pompously, which announcement was\nquite unnecessary, because I held his card in my hand.\n'Quite so, my lord. And you have come to learn whether or no I can lay\nthe ghost in that old castle to the north which bears your name?'\n'Well, I'm blessed!' cried his lordship, agape. 'How could you guess\nthat?'\n'Oh, it is not a guess, but rather a choice of two objects, either of\nwhich might bring you to my rooms. I chose the first motive because I\nthought you might prefer to arrange the second problem with your\nsolicitor, and he doubtless told you that Miss Sophia Brooks's claim\nwas absurd; that you were quite right in refusing to give up or\ndestroy the typewritten letter she had signed ten years ago, and that\nit was weakness on your part, without consulting him, to offer her an\nannuity of fifty-two pounds a year.'\nLong before this harangue was finished, which I uttered in an easy and\nnonchalant tone of voice, as if reciting something that everybody\nknew, his lordship stood on his feet again, staring at me like a man\nthunderstruck. This gave me the opportunity of exercising that\npoliteness which his abrupt entrance and demeanour had forestalled. I\nrose, and bowing, said,--\n'I pray you to be seated, my lord.'\nHe dropped into the chair, rather than sat down in it.\n'And now,' I continued, with the utmost suavity, stretching forth my\nhand, 'may I place your hat on this shelf out of the way, where it\nwill not incommode you during our discourse?'\nLike a man in a dream, he took his hat from his head, and passively\nhanded it to me, and after placing it in safety I resumed my chair\nwith the comfortable feeling that his lordship and I were much nearer\na plane of equality than when he entered the room.\n'How about the ghost with a club-foot, my lord?' said I genially. 'May\nI take it that in the City, that sensible, commercial portion of\nLondon, no spirits are believed in except those sold over the bars?'\n'If you mean,' began his lordship, struggling to reach his dignity\nonce more, 'if you mean to ask if there is any man fool enough to\nplace credit in the story of a ghost, I answer no. I am a practical\nman, sir. I now possess in the north property representing, in farming\nlands, in shooting rights, and what not, a locked-up capital of many\na thousand pounds. As you seem to know everything, sir, perhaps you\nare aware that I propose to build a modern mansion on the estate.'\n'Yes; I saw the letter in the _Times_.'\n'Very well, sir. It has come to a fine pass if, in this country of law\nand the rights of property, a man may not do what he pleases with his\nown.'\n'I think, my lord, cases may be cited where the decisions of your\ncourts have shown a man may not do what he likes with his own.\nNevertheless, I am quite certain that if you level Rantremly Castle\nwith the ground, and build a modern mansion in its place, the law will\nnot hinder you.'\n'I should hope not, sir, I should hope not,' said his lordship\ngruffly. 'Nevertheless, I am not one who wishes to ride roughshod over\npublic opinion.\n'I am chairman of several companies which depend more or less on\npopular favour for success. I deplore unnecessary antagonism.\nTechnically, I might assert my right to destroy this ancient\nstronghold tomorrow if I wished to do so, and if that right were\nseriously disputed, I should, of course, stand firm. But it is not\nseriously disputed. The British nation, sir, is too sensible a people\nto object to the removal of an antiquated structure that has long\noutlived its usefulness, and the erection of a mansion replete with\nall modern improvements would be a distinct addition to the country,\nsir. A few impertinent busybodies protest against the demolition of\nRantremly Castle, but that is all.'\n'Ah, then you _do_ intend to destroy it?' I rejoined, and it is\npossible that a touch of regret was manifest in my tones.\n'Not just at present; not until this vulgar clamour has had time to\nsubside. Nevertheless, as a business man, I am forced to recognise\nthat a large amount of unproductive capital is locked up in that\nproperty.'\n'And why is it locked up?'\n'Because of an absurd belief that the place is haunted. I could let it\ntomorrow at a good figure, if it were not for that rumour.'\n'But surely sensible men do not pay any attention to such a rumour.'\n'Sensible men may not, but sensible men are often married to silly\nwomen, and the women object. It is only the other day that I was in\nnegotiation with Bates, of Bates, Sturgeon and Bates, a very wealthy\nman, quite able and willing to pay the price I demanded. He cared\nnothing about the alleged ghost, but his family absolutely refused to\nhave anything to do with the place, and so the arrangement fell\nthrough.'\n'What is your theory regarding this ghost, my lord?'\nHe answered me with some impatience.\n'How can a sane man hold a theory about a ghost? I can, however,\nadvance a theory regarding the noises heard in the castle. For years\nthat place has been the resort of questionable characters.'\n'I understand the Rantremly family is a very old one,' I commented\ninnocently, but his lordship did not notice the innuendo.\n'Yes, we are an old family,' he went on with great complacency. 'The\ncastle, as perhaps you are aware, is a huge, ramshackle place,\nhoneycombed underneath with cellars. I dare say in the old days some\nof these cellars and caves were the resort of smugglers, and the\nreceptacle of their contraband wares, doubtless with the full\nknowledge of my ancestors, who, I regret to admit, as a business man,\nwere not too particular in their respect for law. I make no doubt that\nthe castle is now the refuge of a number of dangerous characters, who,\nknowing the legends of the place, frighten away fools by impersonating\nghosts.'\n'You wish me to uncover their retreat, then?'\n'Precisely.'\n'Could I get accommodation in the castle itself?'\n'Lord bless you, no! Nor within two miles of it. You might secure bed\nand board at the porter's lodge, perhaps, or in the village, which is\nthree miles distant.'\n'I should prefer to live in the castle night and day, until the\nmystery is solved.'\n'Ah, you are a practical man. That is a very sensible resolution. But\nyou can persuade no one in that neighbourhood to bear you company. You\nwould need to take some person down with you from London, and the\nchances are, that person will not stay long.'\n'Perhaps, my lord, if you used your influence, the chief of police in\nthe village might allow a constable to bear me company. I do not mind\nroughing it in the least, but I should like someone to prepare my\nmeals, and to be on hand in case of a struggle, should your surmise\nconcerning the ghost prove correct.'\n'I regret to inform you,' said his lordship, 'that the police in that\nbarbarous district are as superstitious as the peasantry. I, myself,\ntold the chief constable my theory, and for six weeks he has been\ntrying to run down the miscreants, who, I am sure, are making a\nrendezvous of the castle. Would you believe it, sir, that the\nconstabulary, after a few nights' experience in the castle, threatened\nto resign in a body if they were placed on duty at Rantremly? They\nsaid they heard groans and shrieks, and the measured beat of a\nclub-foot on the oaken floors. Perfectly absurd, of course, but there\nyou are! Why, I cannot even get a charwoman or labourer to clear up\nthe evidences of the tragedy which took place there six weeks ago. The\nbeds are untouched, the broken china and the silver tray lie today at\nthe foot of the stairway, and everything remains just as it was when\nthe inquest took place.'\n'Very well, my lord, the case presents many difficulties, and so,\nspeaking as one business man to another, you will understand that my\ncompensation must be correspondingly great.'\nAll the assumed dignity which straightened up this man whenever I\naddressed him as 'my lord', instantly fell from him when I enunciated\nthe word 'compensation'. His eyes narrowed, and all the native\nshrewdness of an adept skinflint appeared in his face. I shall do him\nthe justice to say that he drove the very best bargain he could with\nme, and I, on my part, very deftly concealed from him the fact that I\nwas so much interested in the affair that I should have gone down to\nRantremly for nothing rather than forgo the privilege of ransacking\nRantremly Castle.\nWhen the new earl had taken his departure, walking to the door with\nthe haughty air of a nobleman, then bowing to me with the affability\nof a business man, I left my flat, took a cab, and speedily found\nmyself climbing the stair to the first floor of 51 Beaumont Street,\nStrand. As I paused at the door on which were painted the words, 'S.\nBrooks, Stenography, Typewriting, Translation', I heard the rapid\nclick-click of a machine inside. Knocking at the door the writing\nceased, and I was bidden to enter. The room was but meagrely\nfurnished, and showed scant signs of prosperity. On a small\nside-table, clean, but uncovered, the breakfast dishes, washed, but\nnot yet put away, stood, and the kettle on the hob by the dying fire\nled me to infer that the typewriting woman was her own cook. I\nsuspected that the awkward-looking sofa which partly occupied one side\nof the room, concealed a bed. By the lone front window stood the\ntypewriting machine on a small stand, and in front of it sat the woman\nwho had visited me the morning before. She was now gazing at me,\nprobably hoping I was a customer, for there was no recognition in her\neyes.\n'Good-morning, Lady Rantremly,' was my greeting, which caused her to\nspring immediately to her feet, with a little exclamation of surprise.\n'Oh,' she said at last, 'you are Monsieur Valmont. Excuse me that I am\nso stupid. Will you take a chair?'\n'Thank you, madam. It is I who should ask to be excused for so\nunceremonious a morning call. I have come to ask you a question. Can\nyou cook?'\nThe lady looked at me with some surprise, mingled perhaps with so much\nof indignation as such a mild person could assume. She did not reply,\nbut, glancing at the kettle, and then turning towards the breakfast\ndishes on the table by the wall, a slow flush of colour suffused her\nwan cheeks.\n'My lady,' I said at last, as the silence became embarrassing, 'you\nmust pardon the impulse of a foreigner who finds himself constantly\nbrought into conflict with prejudices which he fails to understand.\nYou are perhaps offended at my question. The last person of whom I\nmade that inquiry was the young and beautiful Madame la Comtesse de\nValérie-Moberanne, who enthusiastically clapped her hands with delight\nat the compliment, and replied impulsively,--\n'\"Oh, Monsieur Valmont, let me compose for you an omelette which will\nprove a dream,\" and she did. One should not forget that Louis XVIII\nhimself cooked the _truffes à la purée d'ortolans_ that caused the Duc\nd'Escars, who partook of the royal dish, to die of an indigestion.\nCooking is a noble, yes, a regal art. I am a Frenchman, my lady, and,\nlike all my countrymen, regard the occupation of a cuisinière as\ninfinitely superior to the manipulation of that machine, which is your\nprofession, or the science of investigation, which is mine.'\n'Sir,' she said, quite unmollified by my harangue, speaking with a\nlofty pride which somehow seemed much more natural than that so\nintermittently assumed by my recent visitor, 'Sir, have you come to\noffer me a situation as cook?'\n'Yes, madam, at Rantremly Castle.'\n'You are going there?' she demanded, almost breathlessly.\n'Yes, madam, I leave on the ten o'clock train tomorrow morning. I am\ncommissioned by Lord Rantremly to investigate the supposed presence of\nthe ghost in that mouldering dwelling. I am allowed to bring with me\nwhatever assistants I require, and am assured that no one in the\nneighbourhood can be retained who dare sleep in the castle. You know\nthe place very well, having lived there, so I shall be glad of your\nassistance if you will come. If there is any person whom you can\ntrust, and who is not afraid of ghosts, I shall be delighted to escort\nyou both to Rantremly Castle tomorrow.'\n'There is an old woman,' she said, 'who comes here to clear up my\nroom, and do whatever I wish done. She is so deaf that she will hear\nno ghosts, and besides, monsieur, she can cook.'\nI laughed in acknowledgment of this last sly hit at me, as the English\nsay.\n'That will do excellently,' I replied, rising, and placing a ten-pound\nnote before her. 'I suggest, madam, that you purchase with this\nanything you may need. My man has instructions to send by passenger\ntrain a huge case of provisions, which should arrive there before us.\nIf you could make it convenient to meet me at Euston Station about a\nquarter of an hour before the train leaves, we may be able to discover\nall you wish to know regarding the mystery of Rantremly Castle.'\nSophia Brooks accepted the money without demur, and thanked me. I\ncould see that her thin hands were trembling with excitement as she\nput the crackling banknote into her purse.\n       *       *       *       *       *\nDarkness was coming on next evening before we were installed in the\ngrim building, which at first sight seemed more like a fortress than a\nresidence. I had telegraphed from London to order a wagonette for us,\nand in this vehicle we drove to the police station, where I presented\nthe written order from Lord Rantremly for the keys of the castle. The\nchief constable himself, a stolid, taciturn person, exhibited,\nnevertheless, some interest in my mission, and he was good enough to\ntake the fourth seat in the wagonette, and accompany us through the\npark to the castle, returning in that conveyance to the village as\nnightfall approached, and I could not but notice that this grave\nofficial betrayed some uneasiness to get off before dusk had\ncompletely set in. Silent as he was, I soon learned that he entirely\ndisbelieved Lord Rantremly's theory that the castle harboured\ndangerous characters, yet so great was his inherent respect for the\nnobility that I could not induce him to dispute with any decisiveness\nhis lordship's conjecture. It was plain to be seen, however, that the\nchief constable believed implicitly in the club-footed ghost. I asked\nhim to return the next morning, as I should spend the night in\ninvestigation, and might possibly have some questions to ask him,\nquestions which none but the chief constable could answer. The good\nman promised, and left us rather hurriedly, the driver of the\nwagonette galloping his horse down the long, sombre avenue towards the\nvillage outside the gates.\nI found Sophia Brooks but a doleful companion, and of very little\nassistance that evening. She seemed overcome by her remembrances. She\nhad visited the library where her former work was done, doubtless the\nscene of her brief love episode, and she returned with red eyes and\ntrembling chin, telling me haltingly that the great tome from which\nshe was working ten years ago, and which had been left open on the\nsolid library table, was still there exactly as she had placed it\nbefore being forced to abandon her work. For a decade apparently no\none had entered that library. I could not but sympathise with the poor\nlady, thus revisiting, almost herself like a ghost, the haunted arena\nof her short happiness. But though she proved so dismal a companion,\nthe old woman who came with her was a treasure. Having lived all her\nlife in some semi-slum near the Strand, and having rarely experienced\nmore than a summer's-day glimpse of the country, the long journey had\ndelighted her, and now this rambling old castle in the midst of the\nforest seemed to realise all the dreams which a perusal of halfpenny\nfiction had engendered in her imagination. She lit a fire, and cooked\nfor us a very creditable supper, bustling about the place, singing to\nherself in a high key.\nShortly after supper Sophia Brooks, exhausted as much by her emotions\nand memories as by her long journey of that day, retired to rest.\nAfter being left to myself I smoked some cigarettes, and finished a\nbottle of superb claret which stood at my elbow. A few hours before I\nhad undoubtedly fallen in the estimation of the stolid constable when,\ninstead of asking him questions regarding the tragedy, I had inquired\nthe position of the wine cellar, and obtained possession of the key\nthat opened its portal. The sight of bin after bin of dust-laden,\ncobwebbed bottles, did more than anything else to reconcile me to my\nlonely vigil. There were some notable vintages represented in that\ndismal cavern.\nIt was perhaps half-past ten or eleven o'clock when I began my\ninvestigations. I had taken the precaution to provide myself with half\na dozen so-called electric torches before I left London. These give\nillumination for twenty or thirty hours steadily, and much longer if\nthe flash is used only now and then. The torch is a thick tube,\nperhaps a foot and a half long, with a bull's-eye of glass at one end.\nBy pressing a spring the electric rays project like the illumination\nof an engine's headlight. A release of the spring causes instant\ndarkness. I have found this invention useful in that it concentrates\nthe light on any particular spot desired, leaving all the surroundings\nin gloom, so that the mind is not distracted, even unconsciously, by\nthe eye beholding more than is necessary at the moment. One pours a\nwhite light over any particular substance as water is poured from the\nnozzle of a hose.\nThe great house was almost painfully silent. I took one of these\ntorches, and went to the foot of the grand staircase where the wicked\nbutler had met his death. There, as his lordship had said, lay the\nsilver tray, and nearby a silver jug, a pair of spoons, a knife and\nfork, and scattered all around the fragments of broken plates, cups,\nand saucers. With an exclamation of surprise at the stupidity of the\nresearchers who had preceded me, I ran up the stair two steps at a\ntime, turned to the right, and along the corridor until I came to the\nroom occupied by the late earl. The coverings of the bed lay turned\ndown just as they were when his lordship sprang to the floor,\ndoubtless, in spite of his deafness, having heard faintly the fatal\ncrash at the foot of the stairs. A great oaken chest stood at the head\nof the bed, perhaps six inches from the wall. Leaning against this\nchest at the edge of the bed inclined a small, round table, and the\ncover of the table had slipped from its sloping surface until it\npartly concealed the chest lid. I mounted on this carven box of old\nblack oak and directed the rays of electric light into the chasm\nbetween it and the wall. Then I laughed aloud, and was somewhat\nstartled to hear another laugh directly behind me. I jumped down on\nthe floor again, and swung round my torch like a searchlight on a\nbattleship at sea. There was no human presence in that chamber except\nmyself. Of course, after my first moment of surprise, I realised that\nthe laugh was but an echo of my own. The old walls of the old house\nwere like sounding-boards. The place resembled an ancient fiddle,\nstill tremulous with the music that had been played on it. It was easy\nto understand how a superstitious population came to believe in its\nbeing haunted; in fact, I found by experiment that if one trod quickly\nalong the uncovered floor of the corridor, and stopped suddenly, one\nseemed to hear the sound of steps still going on.\nI now returned to the stair head, and examined the bare polished\nboards with most gratifying results. Amazed at having learnt so much\nin such a short time, I took from my pocket the paper on which the\ndying nobleman had attempted to write with his half-paralysed hand.\nThe chief constable had given the document to me, and I sat on the\nstair head, spread it out on the floor and scrutinised it. It was all\nbut meaningless. Apparently two words and the initial letter of a\nthird had been attempted. Now, however grotesque a piece of writing\nmay be, you can sometimes decipher it by holding it at various angles,\nas those puzzles are solved which remain a mystery when gazed at\ndirect. By partially closing the eyes you frequently catch the intent,\nas in those pictures where a human figure is concealed among the\noutlines of trees and leaves. I held the paper at arm's length, and\nwith the electric light gleaming upon it, examined it at all angles,\nwith eyes wide open, and eyes half closed. At last, inclining it away\nfrom me, I saw that the words were intended to mean, 'The Secret'. The\nsecret, of course, was what he was trying to impart, but he had\napparently got no further than the title of it. Deeply absorbed in my\ninvestigation, I was never more startled in my life than to hear in\nthe stillness down the corridor the gasped words, '_Oh, God!_'\nI swept round my light, and saw leaning against the wall, in an almost\nfainting condition, Sophia Brooks, her eyes staring like those of a\ndemented person, and her face white as any ghost's could have been.\nWrapped round her was a dressing-gown. I sprang to my feet.\n'What are you doing there?' I cried.\n'Oh, is that you, Monsieur Valmont? Thank God, thank God! I thought I\nwas going insane. I saw a hand, a bodiless hand, holding a white sheet\nof paper.'\n'The hand was far from bodiless, madam, for it belonged to me. But why\nare you here? It must be near midnight.'\n'It _is_ midnight,' answered the woman; 'I came here because I heard\nmy husband call me three times distinctly, \"Sophia, Sophia, Sophia!\"\njust like that.'\n'Nonsense, madam,' I said, with an asperity I seldom use where the\nfair sex is concerned; but I began to see that this hysterical\ncreature was going to be in the way during a research that called for\ncoolness and calmness. I was sorry I had invited her to come.\n'Nonsense, madam, you have been dreaming.'\n'Indeed, Monsieur Valmont, I have not. I have not even been asleep,\nand I heard the words quite plainly. You must not think I am either\nmad or superstitious.'\nI thought she was both, and next moment she gave further evidence of\nit, running suddenly forward, and clutching me by the arm.\n'Listen! listen!' she whispered. 'You hear nothing?'\n'Nonsense!' I cried again, almost roughly for my patience was at an\nend, and I wished to go on with my inquiry undisturbed.\n'Hist, hist!' she whispered; 'listen!' holding up her finger. We both\nstood like statues, and suddenly I felt that curious creeping of the\nscalp which shows that even the most civilised among us have not yet\neliminated superstitious fear. In the tense silence I heard someone\nslowly coming up the stair; I heard the halting step of a lame man. In\nthe tension of the moment I had allowed the light to go out; now\nrecovering myself, I pressed the spring, and waved its rays backward\nand forward down the stairway. The space was entirely empty, yet the\nhesitating footsteps approached us, up and up. I could almost have\nsworn on which step they last struck. At this interesting moment\nSophia Brooks uttered a piercing shriek and collapsed into my arms,\nsending the electric torch rattling down the steps, and leaving us in\nimpenetrable darkness. Really, I profess myself to be a gallant man,\nbut there are situations which have a tendency to cause annoyance. I\ncarried the limp creature cautiously down the stairs, fearing the fate\nof the butler, and at last got her into the dining-room, where I lit a\ncandle, which gave a light less brilliant, perhaps, but more steady\nthan my torch. I dashed some water in her face, and brought her to her\nsenses, then uncorking another bottle of wine, I bade her drink a\nglassful, which she did.\n'What was it?' she whispered.\n'Madam, I do not know. Very possibly the club-footed ghost of\nRantremly.'\n'Do you believe in ghosts, Monsieur Valmont?'\n'Last night I did not, but at this hour I believe in only one thing,\nwhich is that it is time everyone was asleep.'\nShe rose to her feet at this, and with a tremulous little laugh\napologised for her terror, but I assured her that for the moment there\nwere two panic-stricken persons at the stair head. Taking the candle,\nand recovering my electric torch, which luckily was uninjured by its\nroll down the incline the butler had taken, I escorted the lady to the\ndoor of her room, and bade her good-night, or rather, good-morning.\nThe rising sun dissipated a slight veil of mist which hung over the\npark, and also dissolved, so far as I was concerned, the phantoms\nwhich my imagination had conjured up at midnight. It was about\nhalf-past ten when the chief constable arrived. I flatter myself I put\nsome life into that unimaginative man before I was done with him.\n'What made you think that the butler was mounting the stair when he\nfell?'\n'He was going up with my lord's breakfast,' replied the chief.\n'Then did it not occur to you that if such were the case, the silver\npitcher would not have been empty, and, besides the broken dishes,\nthere would have been the rolls, butter, toast, or what not, strewn\nabout the floor?'\nThe chief constable opened his eyes.\n'There was no one else for him to bring breakfast to,' he objected.\n'That is where you are very much mistaken. Bring me the boots the\nbutler wore.'\n'He did not wear boots, sir. He wore a pair of cloth slippers.'\n'Do you know where they are?'\n'Yes; they are in the boot closet.'\n'Very well, bring them out, examine their soles, and sticking in one\nof them you will find a short sliver of pointed oak.'\nThe constable, looking slightly more stupefied than ever, brought the\nslippers, and I heard him ejaculate: 'Well, I'm blowed!' as he\napproached me. He handed me the slippers soles upward, and there, as I\nhave stated, was the fragment of oak, which I pulled out.\n'Now, if you take this piece of oak to the top of the stair, you will\nsee that it fits exactly a slight interstice at the edge of one of the\nplanks. It is as well to keep one's eyes open, constable, when\ninvestigating a case like this.'\n'Well, I'm blowed!' he said again, as we walked up the stair\ntogether.\nI showed him that the sliver taken from the slipper fitted exactly the\ninterstice I had indicated.\n'Now,' said I to him, 'the butler was not going up the stairs, but was\ncoming down. When he fell headlong he must have made a fearful\nclatter. Shuffling along with his burden, his slipper was impaled by\nthis sliver, and the butler's hands being full, he could not save\nhimself, but went head foremost down the stair. The startling point,\nhowever, is the fact that he was _not_ carrying my lord's breakfast to\nhim, or taking it away from him, but that there is someone else in the\ncastle for whom he was caterer. Who is that person?'\n'I'm blessed if I know,' said the constable, 'but I think you are\nwrong there. He may not have been carrying up the breakfast, but he\ncertainly was taking away the tray, as is shown by the empty dishes,\nwhich you have just a moment ago pointed out.'\n'No, constable; when his lordship heard the crash, and sprang\nimpulsively from his bed, he upset the little table on which had been\nplaced his own tray; it shot over the oaken chest at the head of the\nbed, and if you look between it and the wall you will find tray,\ndishes, and the remnants of a breakfast.'\n'Well, I'm blessed!' exclaimed the chief constable once again.\n'The main point of all this,' I went on calmly, 'is not the disaster\nto the butler, nor even the shock to his lordship, but the fact that\nthe tray the serving man carried brought food to a prisoner, who\nprobably for six weeks has been without anything to eat.'\n'Then,' said the constable, 'he is a dead man.'\n'I find it easier,' said I, 'to believe in a living man than in a dead\nman's ghost. I think I heard his footsteps at midnight, and they\nseemed to me the footsteps of a person very nearly exhausted.\nTherefore, constable, I have awaited your arrival with some\nimpatience. The words his late lordship endeavoured to write on the\npaper were \"The Secret\". I am sure that the hieroglyphics with which\nhe ended his effort stood for the letter \"R\", and if he finished his\nsentence, it would have stood: \"The secret room\". Now, constable, it\nis a matter of legend that a secret room exists in this castle. Do you\nknow where it is?'\n'No one knows where the secret room is, or the way to enter it, except\nthe Lords of Rantremly.'\n'Well, I can assure you that the Lord of Rantremly who lives in London\nknows nothing about it. I have been up and about since daylight,\ntaking some rough measurements by stepping off distances. I surmise\nthat the secret room is to the left of this stairway. Probably a whole\nsuite of rooms exists, for there is certainly a stair coinciding with\nthis one, and up that stair at midnight I heard a club-footed man\nascend. Either that, or the ghost that has frightened you all, and, as\nI have said, I believe in the man.'\nHere the official made the first sensible remark I had yet heard him\nutter:--\n'If the walls are so thick that a prisoner's cry has not been heard,\nhow could you hear his footsteps, which make much less noise?'\n'That is very well put, constable, and when the same thing occurred to\nme earlier this morning, I began to study the architecture of this\ncastle. In the first place, the entrance hall is double as wide at the\nbig doors as it is near the stairway. If you stand with your back to\nthe front door you will at once wonder why the builders made this\ncurious and unnecessary right angle, narrowing the farther part of the\nhall to half its width. Then, as you gaze at the stair, and see that\nmarvellous carved oak newel post standing like a monumental column,\nyou guess, if you have any imagination, that the stairway, like the\nhall, was once double as wide as it is now. We are seeing only half of\nit, and doubtless we shall find a similar newel post within the hidden\nroom. You must remember, constable, that these secret apartments are\nno small added chambers. Twice they have sheltered a king.'\nThe constable's head bent low at the mention of royalty. I saw that\nhis insular prejudice against me and my methods was vanishing, and\nthat he had come to look upon me with greater respect than was shown\nat first.\n'The walls need not be thick to be impenetrable to sound. Two courses\nof brick, and a space between filled with deafening would do it. The\nsecret apartment has been cut off from the rest of the house since the\ncastle was built, and was not designed by the original architect. The\npartition was probably built in a hurry to fulfil a pressing need, and\nit was constructed straight up the middle of the stair, leaving the\nstout planks intact, each step passing thus, as it were, through the\nwall. Now, when a man walks up the secret stairway, his footsteps\nreverberate until one would swear that some unseen person was treading\nthe visible boards on the outside.'\n'By Jove!' said the constable, in an awed tone of voice.\n'Now, officer, I have here a pickaxe and a crowbar. I propose that we\nsettle the question at once.'\nBut to this proposal the constable demurred.\n'You surely would not break the wall without permission from his\nlordship in London?'\n'Constable, I suspect there is no Lord Rantremly in London, and that\nwe will find a very emaciated but genuine Lord Rantremly within ten\nfeet of us. I need not tell you that if you are instrumental in his\nimmediate rescue without the exercise of too much red tape, your\ninterests will not suffer because you the more speedily brought food\nand drink to the lord paramount of your district.'\n'Right you are,' cried the constable, with an enthusiasm for which I\nwas not prepared. 'Where shall we begin?'\n'Oh, anywhere; this wall is all false from the entrance hall to some\npoint up here. Still, as the butler was carrying the meal upstairs I\nthink we shall save time if we begin on the landing.'\nI found the constable's brawn much superior to his brain. He worked\nlike a sansculotte on a barricade. When we had torn down part of the\nold oak panelling, which it seemed such a pity to mutilate with axe\nand crowbar, we came upon a brick wall, that quickly gave way before\nthe strength of the constable. Then we pulled out some substance like\nmatting, and found a second brick wall, beyond which was a further\nshell of panelling. The hole we made revealed nothing but darkness\ninside, and although we shouted, there was no answer. At last, when we\nhad hewn it large enough for a man to enter, I took with me an\nelectric torch, and stepped inside, the constable following, with\ncrowbar still in hand. I learned, as I had surmised, that we were in\nthe upper hall of a staircase nearly as wide as the one on the\noutside. A flash of the light showed a door corresponding with the\nfireplace of the upper landing, and this door not being locked, we\nentered a large room, rather dimly lighted by strongly barred windows\nthat gave into a blind courtyard, of which there had been no\nindication heretofore, either outside or inside the castle. Broken\nglass crunched under our feet, and I saw that the floor was strewn\nwith wine bottles whose necks had been snapped off to save the pulling\nof the cork. On a mattress at the farther end of the room lay a man\nwith gray hair, and shaggy, unkempt iron-gray beard. He seemed either\nasleep or dead, but when I turned my electric light full on his face\nhe proved to be still alive, for he rubbed his eyes languidly, and\ngroaned, rather than spoke:--\n'Is that you at last, you beast of a butler? Bring me something to\neat, in Heaven's name!'\nI shook him wider awake. He seemed to be drowsed with drink, and was\nfearfully emaciated. When I got him on his feet, I noticed then the\ndeformity that characterised one of them. We assisted him through the\naperture, and down into the dining-room, where he cried out\ncontinually for something to eat, but when we placed food before him,\nhe could scarcely touch it. He became more like a human being when he\nhad drunk two glasses of wine, and I saw at once he was not as old as\nhis gray hair seemed to indicate. There was a haunted look in his\neyes, and he watched the door as if apprehensive.\n'Where is that butler?' he asked at last.\n'Dead,' I replied.\n'Did I kill him?'\n'No; he fell down the stairway and broke his neck.'\nThe man laughed harshly.\n'Where is my father?'\n'Who is your father?'\n'Lord Rantremly.'\n'He is dead also.'\n'How came he to die?'\n'He died from a stroke of paralysis on the morning the butler was\nkilled.'\nThe rescued man made no comment on this, but turned and ate a little\nmore of his food. Then he said to me:--\n'Do you know a girl named Sophia Brooks?'\n'Yes. For ten years she thought you dead.'\n'Ten years! Good God, do you mean to say I've been in there only ten\nyears? Why, I'm an old man. I must be sixty at least.'\n'No; you're not much over thirty.'\n'Is Sophia--' He stopped, and the haunted look came into his eyes\nagain.\n'No. She is all right, and she is here.'\n'Here?'\n'Somewhere in the grounds. I sent her and the servant out for a walk,\nand told them not to return till luncheon time, as the constable and I\nhad something to do, and did not wish to be interrupted.'\nThe man ran his hand through his long tangled beard.\n'I should like to be trimmed up a bit before I see Sophia,' he said.\n'I can do that for you, my lord,' cried the constable.\n'My lord?' echoed the man. 'Oh, yes, I understand. You are a\npoliceman, are you not?'\n'Yes, my lord, chief constable.'\n'Then I shall give myself up to you. I killed the butler.'\n'Oh, impossible, my lord!'\n'No, it isn't. The beast, as I called him, was getting old, and one\nmorning he forgot to close the door behind him. I followed him\nstealthily out, and at the head of the stair planted my foot in the\nsmall of his back, which sent him headlong. There was an infernal\ncrash. I did not mean to kill the brute, but merely to escape, and\njust as I was about to run down the stairway, I was appalled to see my\nfather looking like--looking like--well, I won't attempt to say what\nhe looked like; but all my old fear of him returned. As he strode\ntowards me, along the corridor, I was in such terror that I jumped\nthrough the secret door and slammed it shut.'\n'Where is the secret door?' I asked.\n'The secret door is that fireplace. The whole fireplace moves inward\nif you push aside the carved ornament at the left-hand corner.'\n'Is it a dummy fireplace, then?'\n'No, you may build a fire in it, and the smoke will escape up the\nchimney. But I killed the butler, constable, though not intending it,\nI swear.'\nAnd now the constable shone forth like the real rough diamond he was.\n'My lord, we'll say nothing about that. Legally you didn't do it. You\nsee, there's been an inquest on the butler and the jury brought in the\nverdict, \"Death by accident, through stumbling from the top of the\nstair.\" You can't go behind a coroner's inquest, my lord.'\n'Indeed,' said his lordship, with the first laugh in which he had\nindulged for many a year. 'I don't want to go behind anything,\nconstable, I've been behind that accursed chimney too long to wish any\nfurther imprisonment.'",
    "reveal_segment": "'Is that you at last, you beast of a butler? Bring me something to\neat, in Heaven's name!'\nI shook him wider awake. He seemed to be drowsed with drink, and was\nfearfully emaciated. When I got him on his feet, I noticed then the\ndeformity that characterised one of them. We assisted him through the\naperture, and down into the dining-room, where he cried out\ncontinually for something to eat, but when we placed food before him,\nhe could scarcely touch it. He became more like a human being when he\nhad drunk two glasses of wine, and I saw at once he was not as old as\nhis gray hair seemed to indicate. There was a haunted look in his\neyes, and he watched the door as if apprehensive.\n'Where is that butler?' he asked at last.\n'Dead,' I replied.\n'Did I kill him?'\n'No; he fell down the stairway and broke his neck.'\nThe man laughed harshly.\n'Where is my father?'\n'Who is your father?'\n'Lord Rantremly.'\n'He is dead also.'\n'How came he to die?'\n'He died from a stroke of paralysis on the morning the butler was\nkilled.'\nThe rescued man made no comment on this, but turned and ate a little\nmore of his food. Then he said to me:--\n'Do you know a girl named Sophia Brooks?'\n'Yes. For ten years she thought you dead.'\n'Ten years! Good God, do you mean to say I've been in there only ten\nyears? Why, I'm an old man. I must be sixty at least.'\n'No; you're not much over thirty.'\n'Is Sophia--' He stopped, and the haunted look came into his eyes\nagain.\n'No. She is all right, and she is here.'\n'Here?'\n'Somewhere in the grounds. I sent her and the servant out for a walk,\nand told them not to return till luncheon time, as the constable and I\nhad something to do, and did not wish to be interrupted.'\nThe man ran his hand through his long tangled beard.\n'I should like to be trimmed up a bit before I see Sophia,' he said.\n'I can do that for you, my lord,' cried the constable.\n'My lord?' echoed the man. 'Oh, yes, I understand. You are a\npoliceman, are you not?'\n'Yes, my lord, chief constable.'\n'Then I shall give myself up to you. I killed the butler.'\n'Oh, impossible, my lord!'\n'No, it isn't. The beast, as I called him, was getting old, and one\nmorning he forgot to close the door behind him. I followed him\nstealthily out, and at the head of the stair planted my foot in the\nsmall of his back, which sent him headlong. There was an infernal\ncrash. I did not mean to kill the brute, but merely to escape, and\njust as I was about to run down the stairway, I was appalled to see my\nfather looking like--looking like--well, I won't attempt to say what\nhe looked like; but all my old fear of him returned. As he strode\ntowards me, along the corridor, I was in such terror that I jumped\nthrough the secret door and slammed it shut.'\n'Where is the secret door?' I asked.\n'The secret door is that fireplace. The whole fireplace moves inward\nif you push aside the carved ornament at the left-hand corner.'\n'Is it a dummy fireplace, then?'\n'No, you may build a fire in it, and the smoke will escape up the\nchimney. But I killed the butler, constable, though not intending it,\nI swear.'\nAnd now the constable shone forth like the real rough diamond he was.\n'My lord, we'll say nothing about that. Legally you didn't do it. You\nsee, there's been an inquest on the butler and the jury brought in the\nverdict, \"Death by accident, through stumbling from the top of the\nstair.\" You can't go behind a coroner's inquest, my lord.'\n'Indeed,' said his lordship, with the first laugh in which he had\nindulged for many a year. 'I don't want to go behind anything,\nconstable, I've been behind that accursed chimney too long to wish any\nfurther imprisonment.'",
    "border_sentence": "'Is that you at last, you beast of a butler? Bring me something to eat, in Heaven's name!'"
  },
  "detection": {
    "prompt": "System: You are an ingenious and clever detective who will examine all the clues and reason through all the evidence to solve the crime.\n\nUser: Here is a detective story. Please read the story carefully before you decide who the culprit is.\n\n\nCelebrated critics have written with scorn of what they call 'the long\narm of coincidence' in fiction. Coincidence is supposed to be the\ndevice of a novelist who does not possess ingenuity enough to\nconstruct a book without it. In France our incomparable writers pay no\nattention to this, because they are gifted with a keener insight into\nreal life than is the case with the British. The superb Charles\nDickens, possibly as well known in France as he is wherever the\nEnglish language is read, and who loved French soil and the French\npeople, probably probed deeper into the intricacies of human character\nthan any other novelist of modern times, and if you read his works,\nyou will see that he continually makes use of coincidence. The\nexperience that has come to me throughout my own strange and varied\ncareer convinces me that coincidence happens in real life with\nexceeding frequency, and this fact is especially borne in upon me when\nI set out to relate my conflict with the Rantremly ghost, which\nwrought startling changes upon the lives of two people, one an\nobjectionable, domineering man, and the other a humble and crushed\nwoman. Of course, there was a third person, and the consequences that\ncame to him were the most striking of all, as you will learn if you do\nme the honour to read this account of the episode.\nSo far as coincidence is concerned, there was first the arrival of the\nnewspaper clipping, then the coming of Sophia Brooks, and when that\nmuch-injured woman left my flat I wrote down this sentence on a sheet\nof paper:--\n'Before the week is out, I predict that Lord Rantremly himself will\ncall to see me.'\nNext day my servant brought in the card of Lord Rantremly.\nI must begin with the visit of Sophia Brooks, for though that comes\nsecond, yet I had paid no attention in particular to the newspaper\nclipping until the lady told her story. My man brought me a\ntypewritten sheet of paper on which were inscribed the words:--\n'Sophia Brooks, Typewriting and Translating Office, First Floor, No. 51\nBeaumont Street, Strand, London, W.C.'\nI said to my servant,--\n'Tell the lady as kindly as possible that I have no typewriting work\nto give out, and that, in fact, I keep a stenographer and typewriting\nmachine on the premises.'\nA few moments later my man returned, and said the lady wished to see\nme, not about typewriting, but regarding a case in which she hoped to\ninterest me. I was still in some hesitation about admitting her, for\nmy transactions had now risen to a higher plane than when I was new to\nLondon. My expenses were naturally very heavy, and it was not possible\nfor me, in justice to myself, to waste time in commissions from the\npoor, which even if they resulted successfully meant little money\nadded to my banking account, and often nothing at all, because the\nclient was unable to pay. As I remarked before, I possess a heart the\nmost tender, and therefore must greatly to my grief, steel myself\nagainst the enlisting of my sympathy, which, alas! has frequently led\nto my financial loss. Still, sometimes the apparently poor are\ninvolved in matters of extreme importance, and England is so eccentric\na country that one may find himself at fault if he closes his door too\nharshly. Indeed, ever since my servant, in the utmost good faith,\nthrew downstairs the persistent and tattered beggar-man, who he\nlearned later to his sorrow was actually his Grace the Duke of\nVentnor, I have always cautioned my subordinates not to judge too\nhastily from appearances.\n'Show the lady in,' I said, and there came to me, hesitating,\nbackward, abashed, a middle-aged woman, dressed with distressing\nplainness, when one thinks of the charming costumes to be seen on a\nParisian boulevard. Her subdued manner was that of one to whom the\nworld had been cruel. I rose, bowed profoundly, and placed a chair at\nher disposal, with the air I should have used if my caller had been a\nRoyal Princess. I claim no credit for this; it is of my nature. There\nyou behold Eugène Valmont. My visitor was a woman. _Voilà!_\n'Madam,' I said politely, 'in what may I have the pleasure of serving\nyou?'\nThe poor woman seemed for the moment confused, and was, I feared, on\nthe verge of tears, but at last she spoke, and said,--\n'Perhaps you have read in the newspapers of the tragedy at Rantremly\nCastle?'\n'The name, madam, remains in my memory, associated elusively with some\nhint of seriousness. Will you pardon me a moment?' and a vague thought\nthat I had seen the castle mentioned either in a newspaper, or a\nclipping from one, caused me to pick up the latest bunch which had\ncome from my agent. I am imbued with no vanity at all; still it is\namusing to note what the newspapers say of one, and therefore I have\nsubscribed to a clipping agency. In fact, I indulge in two\nsubscriptions--one personal; the other calling for any pronouncement\npertaining to the differences between England and France; for it is my\ndetermination yet to write a book on the comparative characteristics\nof the two people. I hold a theory that the English people are utterly\nincomprehensible to the rest of humanity, and this will be duly set\nout in my forthcoming volume.\nI speedily found the clipping I was in search of. It proved to be a\nletter to the _Times_, and was headed: 'Proposed Destruction of\nRantremly Castle'. The letter went on to say that this edifice was one\nof the most noted examples of Norman architecture in the north of\nEngland; that Charles II had hidden there for some days after his\ndisastrous defeat at Worcester. Part of the castle had been battered\ndown by Cromwell, and later it again proved the refuge of a Stuart\nwhen the Pretender made it a temporary place of concealment. The new\nLord Rantremly, it seemed, had determined to demolish this ancient\nstronghold, so interesting architecturally and historically, and to\nbuild with its stones a modern residence. Against this act of\nvandalism the writer strongly protested, and suggested that England\nshould acquire the power which France constantly exerts, in making an\nhistorical monument of an edifice so interwoven with the fortunes of\nthe country.\n'Well, madam,' I said, 'all this extract alludes to is the coming\ndemolition of Rantremly Castle. Is that the tragedy of which you\nspeak?'\n'Oh no,' she exclaimed; 'I mean the death of the eleventh Lord\nRantremly about six weeks ago. For ten years Lord Rantremly lived\npractically alone in the castle. Servants would not remain there\nbecause the place was haunted, and well it may be, for a terrible\nfamily the Rantremlys have been, and a cruel, as I shall be able to\ntell you. Up to a month and a half ago Lord Rantremly was waited on by\na butler older than himself, and if possible, more wicked. One morning\nthis old butler came up the stairs from the kitchen, with Lord\nRantremly's breakfast on a silver tray, as was his custom. His\nlordship always partook of breakfast in his own room. It is not known\nhow the accident happened, as the old servant was going up the stairs\ninstead of coming down, but the steps are very smooth and slippery,\nand without a carpet; at any rate, he seems to have fallen from the\ntop to the bottom, and lay there with a broken neck. Lord Rantremly,\nwho was very deaf, seemingly did not hear the crash, and it is\nsupposed that after ringing and ringing in vain, and doubtless working\nhimself into a violent fit of temper--alas! too frequent an\noccurrence--the old nobleman got out of bed, and walked barefooted\ndown the stair, coming at last upon the body of his ancient servant.\nThere the man who arrived every morning to light the fires found them,\nthe servant dead, and Lord Rantremly helpless from an attack of\nparalysis. The physicians say that only his eyes seemed alive, and\nthey were filled with a great fear, and indeed that is not to be\nwondered at, after his wicked, wicked life. His right hand was but\npartially disabled, and with that he tried to scribble something which\nproved indecipherable. And so he died, and those who attended him at\nhis last moments say that if ever a soul had a taste of future\npunishment before it left this earth, it was the soul of Lord\nRantremly as it shone through those terror-stricken eyes.'\nHere the woman stopped, with a catch in her breath, as if the fear of\nthat grim death-bed had communicated itself to her. I interjected\ncalmness into an emotional situation by remarking in a commonplace\ntone,--'And it is the present Lord Rantremly who proposes to destroy\nthe castle, I suppose?'\n'Yes.'\n'Is he the son of the late lord?'\n'No; he is a distant relative. The branch of the family to which he\nbelongs has been engaged in commerce, and, I believe, its members are\nvery wealthy.'\n'Well, madam, no doubt this is all extremely interesting, and rather\ngruesome. In what way are you concerned in these occurrences?'\n'Ten years ago I replied to an advertisement, there being required one\nwho knew shorthand, who possessed a typewriting machine and a\nknowledge of French, to act as secretary to a nobleman. I was at that\ntime twenty-three years old, and for two years had been trying to earn\nmy living in London through the typing of manuscript. But I was making\na hard struggle of it, so I applied for this position and got it.\nThere are in the library of Rantremly Castle many documents relating\nto the Stuart exile in France. His lordship wished these documents\nsorted and catalogued, as well as copies taken of each. Many of the\nletters were in the French language, and these I was required to\ntranslate and type. It was a sombre place of residence, but the salary\nwas good, and I saw before me work enough to keep me busy for years.\nBesides this, the task was extremely congenial, and I became absorbed\nin it, being young and romantically inclined. Here I seemed to live in\nthe midst of these wonderful intrigues of long ago. Documents passed\nthrough my hands whose very possession at one period meant capital\ndanger, bringing up even now visions of block, axe, and masked\nheadsman. It seemed strange to me that so sinister a man as Lord\nRantremly, who, I had heard, cared for nothing but drink and gambling,\nshould have desired to promote this historical research, and, indeed,\nI soon found he felt nothing but contempt for it. However, he had\nundertaken it at the instance of his only son, then a young man of my\nown age, at Oxford University.\n'Lord Rantremly at that time was sixty-five years old. His countenance\nwas dark, harsh, and imperious, and his language brutal. He indulged\nin frightful outbursts of temper, but he paid so well for service that\nthere was no lack of it, as there has been since the ghost appeared\nsome years ago. He was very tall, and of commanding appearance, but\nhad a deformity in the shape of a club-foot, and walked with the\nhalting step of those so afflicted. There were at that time servants\nin plenty at the castle, for although a tradition existed that the\nghost of the founder of the house trod certain rooms, this ghost, it\nwas said, never demonstrated its presence when the living\nrepresentative of the family was a man with a club-foot. Tradition\nfurther affirmed that if this club-footed ghost allowed its halting\nfootsteps to be heard while the reigning lord possessed a similar\ndeformity, the conjunction foreshadowed the passing of title and\nestates to a stranger. The ghost haunted the castle only when it was\noccupied by a descendant whose two feet were normal. It seems that the\nfounder of the house was a club-footed man, and this disagreeable\npeculiarity often missed one generation, and sometimes two, while at\nother times both father and son had club-feet, as was the case with\nthe late Lord Rantremly and the young man at Oxford. I am not a\nbeliever in the supernatural, of course, but nevertheless it is\nstrange that within the past few years everyone residing in the castle\nhas heard the club-footed ghost, and now title and estates descend to\na family that were utter strangers to the Rantremlys.'\n'Well, madam, this also sounds most alluring, and were my time not\ntaken up with affairs more material than those to which you allude, I\nshould be content to listen all day, but as it is--' I spread my hands\nand shrugged my shoulders.\nThe woman with a deep sigh said,--\n'I am sorry to have taken so long, but I wished you to understand the\nsituation, and now I will come direct to the heart of the case. I\nworked alone in the library, as I told you, much interested in what I\nwas doing. The chaplain, a great friend of Lord Rantremly's son, and,\nindeed, a former tutor of his, assisted me with the documents that\nwere in Latin, and a friendship sprang up between us. He was an\nelderly man, and extremely unworldly. Lord Rantremly never concealed\nhis scorn of this clergyman, but did not interfere with him because of\nthe son.\n'My work went on very pleasantly up to the time that Reginald, the\nheir of his lordship, came down from Oxford. Then began the happiest\ndays of a life that has been otherwise full of hardships and distress.\nReginald was as different as possible from his father. In one respect\nonly did he bear any resemblance to that terrible old man, and this\nresemblance was the deformity of a club-foot, a blemish which one soon\nforgot when one came to know the gentle and high-minded nature of the\nyoung man. As I have said, it was at his instance that Lord Rantremly\nhad engaged me to set in order those historical papers. Reginald\nbecame enthusiastic at the progress I had made, and thus the young\nnobleman, the chaplain, and myself continued our work together with\never-increasing enthusiasm.\n'To cut short a recital which must be trying to your patience, but\nwhich is necessary if you are to understand the situation, I may say\nthat our companionship resulted in a proposal of marriage to me, which\nI, foolishly, perhaps, and selfishly, it may be, accepted. Reginald\nknew that his father would never consent, but we enlisted the sympathy\nof the chaplain, and he, mild, unworldly man, married us one day in\nthe consecrated chapel of the castle.\n'As I have told you, the house at that time contained many servants,\nand I think, without being sure, that the butler, whom I feared even\nmore than Lord Rantremly himself, got some inkling of what was going\nforward. But, be that as it may, he and his lordship entered the\nchapel just as the ceremony was finished, and there followed an\nagonising scene. His lordship flung the ancient chaplain from his\nplace, and when Reginald attempted to interfere, the maddened nobleman\nstruck his son full in the face with his clenched fist, and my husband\nlay as one dead on the stone floor of the chapel. By this time the\nbutler had locked the doors, and had rudely torn the vestments from\nthe aged, half-insensible clergyman, and with these tied him hand and\nfoot. All this took place in a very few moments, and I stood there as\none paralysed, unable either to speak or scream, not that screaming\nwould have done me any good in that horrible place of thick walls. The\nbutler produced a key, and unlocked a small, private door at the side\nof the chapel which led from the apartments of his lordship to the\nfamily pew. Then taking my husband by feet and shoulders, Lord\nRantremly and the butler carried him out, locking the door, and\nleaving the clergyman and me prisoners in the chapel. The reverend old\ngentleman took no notice of me. He seemed to be dazed, and when at\nlast I found my voice and addressed him, he merely murmured over and\nover texts of Scripture pertaining to the marriage service.\n'In a short time I heard the key turn again in the lock of the private\ndoor, and the butler entered alone. He unloosened the bands around the\nclergyman's knees, escorted him out, and once more locked the door\nbehind him. A third time that terrible servant came back, grasped me\nroughly by the wrist, and without a word dragged me with him, along a\nnarrow passage, up a stair, and finally to the main hall, and so to my\nlord's private study, which adjoined his bedroom, and there on a table\nI found my typewriting machine brought up from the library.\n'I have but the most confused recollection of what took place. I am\nnot a courageous woman, and was in mortal terror both of Lord\nRantremly and his attendant. His lordship was pacing up and down the\nroom, and, when I came in, used the most unseemly language to me; then\nordered me to write at his dictation, swearing that if I did not do\nexactly as he told me, he would finish his son, as he put it. I sat\ndown at the machine, and he dictated a letter to himself, demanding\ntwo thousand pounds to be paid to me, otherwise I should claim that I\nwas the wife of his son, secretly married. This, placing pen and ink\nbefore me, he compelled me to sign, and when I had done so, pleading\nto be allowed to see my husband, if only for a moment, I thought he\nwas going to strike me, for he shook his fist in my face, and used\nwords which were appalling to hear. That was the last I ever saw of\nLord Rantremly, my husband, the clergyman, or the butler. I was at\nonce sent off to London with my belongings, the butler himself buying\nmy ticket, and flinging a handful of sovereigns into my lap as the\ntrain moved out.'\nHere the woman stopped, buried her face in her hands, and began to\nweep.\n'Have you done nothing about this for the past ten years?'\nShe shook her head.\n'What could I do?' she gasped. 'I had little money, and no friends.\nWho would believe my story? Besides this, Lord Rantremly retained\npossession of a letter, signed by myself, that would convict me of\nattempted blackmail, while the butler would swear to anything against\nme.'\n'You have no marriage certificate, of course?'\n'No.'\n'What has become of the clergyman?'\n'I do not know.'\n'And what of Lord Rantremly's son?'\n'It was announced that he had gone on a voyage to Australia for his\nhealth in a sailing ship, which was wrecked on the African coast, and\neveryone on board lost.'\n'What is your own theory?'\n'Oh, my husband was killed by the blow given him in the chapel.'\n'Madam, that does not seem credible. A blow from the fist seldom\nkills.'\n'But he fell backwards, and his head struck the sharp stone steps at\nthe foot of the altar. I know my husband was dead when the butler and\nhis father carried him out.'\n'You think the clergyman was also murdered?'\n'I am sure of it. Both master and servant were capable of any crime or\ncruelty.'\n'You received no letters from the young man?'\n'No. You see, during our short friendship we were constantly together,\nand there was no need of correspondence.'\n'Well, madam, what do you expect of me?'\n'I hoped you would investigate, and find perhaps where Reginald and\nthe clergyman are buried. I realise that I have no proof, but in that\nway my strange story will be corroborated.'\nI leaned back in my chair and looked at her. Truth to tell, I only\npartially credited her story myself, and yet I was positive she\nbelieved every word of it. Ten years brooding on a fancied injustice\nby a woman living alone, and doubtless often in dire poverty, had\nmixed together the actual and the imaginary until now, what had\npossibly been an aimless flirtation on the part of the young man,\nunexpectedly discovered by the father, had formed itself into the\ntragedy which she had told me.\n'Would it not be well,' I suggested, 'to lay the facts before the\npresent Lord Rantremly?'\n'I have done so,' she answered simply.\n'With what result?'\n'His lordship said my story was preposterous. In examining the late\nlord's private papers, he discovered the letter which I typed and\nsigned. He said very coldly that the fact that I had waited until\neveryone who could corroborate or deny my story was dead, united with\nthe improbability of the narrative itself, would very likely consign\nme to prison if I made public a statement so incredible.'\n'Well, you know, madam, I think his lordship is right.'\n'He offered me an annuity of fifty pounds, which I refused.'\n'In that refusal, madam, I think you are wrong. If you take my advice,\nyou will accept the annuity.'\nThe woman rose slowly to her feet.\n'It is not money I am after,' she said, 'although, God knows, I have\noften been in sore need of it. But I am the Countess of Rantremly, and\nI wish my right to that name acknowledged. My character has been under\nan impalpable shadow for ten years. On several occasions mysterious\nhints have reached me that in some manner I left the castle under a\ncloud. If Lord Rantremly will destroy the letter which I was compelled\nto write under duress, and if he will give me written acknowledgment\nthat there was nothing to be alleged against me during my stay in the\ncastle, he may enjoy his money in peace for all of me. I want none of\nit.'\n'Have you asked him to do this?'\n'Yes. He refuses to give up or destroy the letter, although I told him\nin what circumstances it had been written. But, desiring to be fair,\nhe said he would allow me a pound a week for life, entirely through\nhis own generosity.'\n'And this you refused?'\n'Yes, I refused.'\n'Madam, I regret to say that I cannot see my way to do anything with\nregard to what I admit is very unjust usage. We have absolutely\nnothing to go upon except your unsupported word. Lord Rantremly was\nperfectly right when he said no one would credit your story. I could\nnot go down to Rantremly Castle and make investigations there. I\nshould have no right upon the premises at all, and would get into\ninstant trouble as an interfering trespasser. I beg you to heed my\nadvice, and accept the annuity.'\nSophia Brooks, with that mild obstinacy of which I had received\nindications during her recital, slowly shook her head.\n'You have been very kind to listen for so long,' she said, and then,\nwith a curt 'Good-day!' turned and left the room. On the sheet of\npaper underneath her address, I wrote this prophecy: 'Before the week\nis out, I predict that Lord Rantremly himself will call to see me.'\n       *       *       *       *       *\nNext morning, at almost the same hour that Miss Brooks had arrived the\nday before, the Earl of Rantremly's card was brought in to me.\nHis lordship proved to be an abrupt, ill-mannered, dapper business\nman; purse-proud, I should call him, as there was every reason he\nshould be, for he had earned his own fortune. He was doubtless equally\nproud of his new title, which he was trying to live up to, assuming\nnow and then a haughty, domineering attitude, and again relapsing into\nthe keen, incisive manner of the man of affairs; shrewd financial\nsense waging a constant struggle with the glamour of an ancient name.\nI am sure he would have shone to better advantage either as a\nfinancier or as a nobleman, but the combination was too much for him.\nI formed an instinctive dislike to the man, which probably would not\nhave happened had he been wearing the title for twenty years, or had I\nmet him as a business man, with no thought of the aristocratic honour\nawaiting him. There seemed nothing in common between him and the\nformer holder of the title. He had keen, ferrety eyes, a sharp\nfinancial nose, a thin-lipped line of mouth which indicated little of\nhuman kindness. He was short of stature, but he did not possess the\nclub-foot, which was one advantage. He seated himself before I had\ntime to offer him a chair, and kept on his hat in my presence, which\nhe would not have done if he had either been a genuine nobleman or a\ncourteous business man.\n'I am Lord Rantremly,' he announced pompously, which announcement was\nquite unnecessary, because I held his card in my hand.\n'Quite so, my lord. And you have come to learn whether or no I can lay\nthe ghost in that old castle to the north which bears your name?'\n'Well, I'm blessed!' cried his lordship, agape. 'How could you guess\nthat?'\n'Oh, it is not a guess, but rather a choice of two objects, either of\nwhich might bring you to my rooms. I chose the first motive because I\nthought you might prefer to arrange the second problem with your\nsolicitor, and he doubtless told you that Miss Sophia Brooks's claim\nwas absurd; that you were quite right in refusing to give up or\ndestroy the typewritten letter she had signed ten years ago, and that\nit was weakness on your part, without consulting him, to offer her an\nannuity of fifty-two pounds a year.'\nLong before this harangue was finished, which I uttered in an easy and\nnonchalant tone of voice, as if reciting something that everybody\nknew, his lordship stood on his feet again, staring at me like a man\nthunderstruck. This gave me the opportunity of exercising that\npoliteness which his abrupt entrance and demeanour had forestalled. I\nrose, and bowing, said,--\n'I pray you to be seated, my lord.'\nHe dropped into the chair, rather than sat down in it.\n'And now,' I continued, with the utmost suavity, stretching forth my\nhand, 'may I place your hat on this shelf out of the way, where it\nwill not incommode you during our discourse?'\nLike a man in a dream, he took his hat from his head, and passively\nhanded it to me, and after placing it in safety I resumed my chair\nwith the comfortable feeling that his lordship and I were much nearer\na plane of equality than when he entered the room.\n'How about the ghost with a club-foot, my lord?' said I genially. 'May\nI take it that in the City, that sensible, commercial portion of\nLondon, no spirits are believed in except those sold over the bars?'\n'If you mean,' began his lordship, struggling to reach his dignity\nonce more, 'if you mean to ask if there is any man fool enough to\nplace credit in the story of a ghost, I answer no. I am a practical\nman, sir. I now possess in the north property representing, in farming\nlands, in shooting rights, and what not, a locked-up capital of many\na thousand pounds. As you seem to know everything, sir, perhaps you\nare aware that I propose to build a modern mansion on the estate.'\n'Yes; I saw the letter in the _Times_.'\n'Very well, sir. It has come to a fine pass if, in this country of law\nand the rights of property, a man may not do what he pleases with his\nown.'\n'I think, my lord, cases may be cited where the decisions of your\ncourts have shown a man may not do what he likes with his own.\nNevertheless, I am quite certain that if you level Rantremly Castle\nwith the ground, and build a modern mansion in its place, the law will\nnot hinder you.'\n'I should hope not, sir, I should hope not,' said his lordship\ngruffly. 'Nevertheless, I am not one who wishes to ride roughshod over\npublic opinion.\n'I am chairman of several companies which depend more or less on\npopular favour for success. I deplore unnecessary antagonism.\nTechnically, I might assert my right to destroy this ancient\nstronghold tomorrow if I wished to do so, and if that right were\nseriously disputed, I should, of course, stand firm. But it is not\nseriously disputed. The British nation, sir, is too sensible a people\nto object to the removal of an antiquated structure that has long\noutlived its usefulness, and the erection of a mansion replete with\nall modern improvements would be a distinct addition to the country,\nsir. A few impertinent busybodies protest against the demolition of\nRantremly Castle, but that is all.'\n'Ah, then you _do_ intend to destroy it?' I rejoined, and it is\npossible that a touch of regret was manifest in my tones.\n'Not just at present; not until this vulgar clamour has had time to\nsubside. Nevertheless, as a business man, I am forced to recognise\nthat a large amount of unproductive capital is locked up in that\nproperty.'\n'And why is it locked up?'\n'Because of an absurd belief that the place is haunted. I could let it\ntomorrow at a good figure, if it were not for that rumour.'\n'But surely sensible men do not pay any attention to such a rumour.'\n'Sensible men may not, but sensible men are often married to silly\nwomen, and the women object. It is only the other day that I was in\nnegotiation with Bates, of Bates, Sturgeon and Bates, a very wealthy\nman, quite able and willing to pay the price I demanded. He cared\nnothing about the alleged ghost, but his family absolutely refused to\nhave anything to do with the place, and so the arrangement fell\nthrough.'\n'What is your theory regarding this ghost, my lord?'\nHe answered me with some impatience.\n'How can a sane man hold a theory about a ghost? I can, however,\nadvance a theory regarding the noises heard in the castle. For years\nthat place has been the resort of questionable characters.'\n'I understand the Rantremly family is a very old one,' I commented\ninnocently, but his lordship did not notice the innuendo.\n'Yes, we are an old family,' he went on with great complacency. 'The\ncastle, as perhaps you are aware, is a huge, ramshackle place,\nhoneycombed underneath with cellars. I dare say in the old days some\nof these cellars and caves were the resort of smugglers, and the\nreceptacle of their contraband wares, doubtless with the full\nknowledge of my ancestors, who, I regret to admit, as a business man,\nwere not too particular in their respect for law. I make no doubt that\nthe castle is now the refuge of a number of dangerous characters, who,\nknowing the legends of the place, frighten away fools by impersonating\nghosts.'\n'You wish me to uncover their retreat, then?'\n'Precisely.'\n'Could I get accommodation in the castle itself?'\n'Lord bless you, no! Nor within two miles of it. You might secure bed\nand board at the porter's lodge, perhaps, or in the village, which is\nthree miles distant.'\n'I should prefer to live in the castle night and day, until the\nmystery is solved.'\n'Ah, you are a practical man. That is a very sensible resolution. But\nyou can persuade no one in that neighbourhood to bear you company. You\nwould need to take some person down with you from London, and the\nchances are, that person will not stay long.'\n'Perhaps, my lord, if you used your influence, the chief of police in\nthe village might allow a constable to bear me company. I do not mind\nroughing it in the least, but I should like someone to prepare my\nmeals, and to be on hand in case of a struggle, should your surmise\nconcerning the ghost prove correct.'\n'I regret to inform you,' said his lordship, 'that the police in that\nbarbarous district are as superstitious as the peasantry. I, myself,\ntold the chief constable my theory, and for six weeks he has been\ntrying to run down the miscreants, who, I am sure, are making a\nrendezvous of the castle. Would you believe it, sir, that the\nconstabulary, after a few nights' experience in the castle, threatened\nto resign in a body if they were placed on duty at Rantremly? They\nsaid they heard groans and shrieks, and the measured beat of a\nclub-foot on the oaken floors. Perfectly absurd, of course, but there\nyou are! Why, I cannot even get a charwoman or labourer to clear up\nthe evidences of the tragedy which took place there six weeks ago. The\nbeds are untouched, the broken china and the silver tray lie today at\nthe foot of the stairway, and everything remains just as it was when\nthe inquest took place.'\n'Very well, my lord, the case presents many difficulties, and so,\nspeaking as one business man to another, you will understand that my\ncompensation must be correspondingly great.'\nAll the assumed dignity which straightened up this man whenever I\naddressed him as 'my lord', instantly fell from him when I enunciated\nthe word 'compensation'. His eyes narrowed, and all the native\nshrewdness of an adept skinflint appeared in his face. I shall do him\nthe justice to say that he drove the very best bargain he could with\nme, and I, on my part, very deftly concealed from him the fact that I\nwas so much interested in the affair that I should have gone down to\nRantremly for nothing rather than forgo the privilege of ransacking\nRantremly Castle.\nWhen the new earl had taken his departure, walking to the door with\nthe haughty air of a nobleman, then bowing to me with the affability\nof a business man, I left my flat, took a cab, and speedily found\nmyself climbing the stair to the first floor of 51 Beaumont Street,\nStrand. As I paused at the door on which were painted the words, 'S.\nBrooks, Stenography, Typewriting, Translation', I heard the rapid\nclick-click of a machine inside. Knocking at the door the writing\nceased, and I was bidden to enter. The room was but meagrely\nfurnished, and showed scant signs of prosperity. On a small\nside-table, clean, but uncovered, the breakfast dishes, washed, but\nnot yet put away, stood, and the kettle on the hob by the dying fire\nled me to infer that the typewriting woman was her own cook. I\nsuspected that the awkward-looking sofa which partly occupied one side\nof the room, concealed a bed. By the lone front window stood the\ntypewriting machine on a small stand, and in front of it sat the woman\nwho had visited me the morning before. She was now gazing at me,\nprobably hoping I was a customer, for there was no recognition in her\neyes.\n'Good-morning, Lady Rantremly,' was my greeting, which caused her to\nspring immediately to her feet, with a little exclamation of surprise.\n'Oh,' she said at last, 'you are Monsieur Valmont. Excuse me that I am\nso stupid. Will you take a chair?'\n'Thank you, madam. It is I who should ask to be excused for so\nunceremonious a morning call. I have come to ask you a question. Can\nyou cook?'\nThe lady looked at me with some surprise, mingled perhaps with so much\nof indignation as such a mild person could assume. She did not reply,\nbut, glancing at the kettle, and then turning towards the breakfast\ndishes on the table by the wall, a slow flush of colour suffused her\nwan cheeks.\n'My lady,' I said at last, as the silence became embarrassing, 'you\nmust pardon the impulse of a foreigner who finds himself constantly\nbrought into conflict with prejudices which he fails to understand.\nYou are perhaps offended at my question. The last person of whom I\nmade that inquiry was the young and beautiful Madame la Comtesse de\nValérie-Moberanne, who enthusiastically clapped her hands with delight\nat the compliment, and replied impulsively,--\n'\"Oh, Monsieur Valmont, let me compose for you an omelette which will\nprove a dream,\" and she did. One should not forget that Louis XVIII\nhimself cooked the _truffes à la purée d'ortolans_ that caused the Duc\nd'Escars, who partook of the royal dish, to die of an indigestion.\nCooking is a noble, yes, a regal art. I am a Frenchman, my lady, and,\nlike all my countrymen, regard the occupation of a cuisinière as\ninfinitely superior to the manipulation of that machine, which is your\nprofession, or the science of investigation, which is mine.'\n'Sir,' she said, quite unmollified by my harangue, speaking with a\nlofty pride which somehow seemed much more natural than that so\nintermittently assumed by my recent visitor, 'Sir, have you come to\noffer me a situation as cook?'\n'Yes, madam, at Rantremly Castle.'\n'You are going there?' she demanded, almost breathlessly.\n'Yes, madam, I leave on the ten o'clock train tomorrow morning. I am\ncommissioned by Lord Rantremly to investigate the supposed presence of\nthe ghost in that mouldering dwelling. I am allowed to bring with me\nwhatever assistants I require, and am assured that no one in the\nneighbourhood can be retained who dare sleep in the castle. You know\nthe place very well, having lived there, so I shall be glad of your\nassistance if you will come. If there is any person whom you can\ntrust, and who is not afraid of ghosts, I shall be delighted to escort\nyou both to Rantremly Castle tomorrow.'\n'There is an old woman,' she said, 'who comes here to clear up my\nroom, and do whatever I wish done. She is so deaf that she will hear\nno ghosts, and besides, monsieur, she can cook.'\nI laughed in acknowledgment of this last sly hit at me, as the English\nsay.\n'That will do excellently,' I replied, rising, and placing a ten-pound\nnote before her. 'I suggest, madam, that you purchase with this\nanything you may need. My man has instructions to send by passenger\ntrain a huge case of provisions, which should arrive there before us.\nIf you could make it convenient to meet me at Euston Station about a\nquarter of an hour before the train leaves, we may be able to discover\nall you wish to know regarding the mystery of Rantremly Castle.'\nSophia Brooks accepted the money without demur, and thanked me. I\ncould see that her thin hands were trembling with excitement as she\nput the crackling banknote into her purse.\n       *       *       *       *       *\nDarkness was coming on next evening before we were installed in the\ngrim building, which at first sight seemed more like a fortress than a\nresidence. I had telegraphed from London to order a wagonette for us,\nand in this vehicle we drove to the police station, where I presented\nthe written order from Lord Rantremly for the keys of the castle. The\nchief constable himself, a stolid, taciturn person, exhibited,\nnevertheless, some interest in my mission, and he was good enough to\ntake the fourth seat in the wagonette, and accompany us through the\npark to the castle, returning in that conveyance to the village as\nnightfall approached, and I could not but notice that this grave\nofficial betrayed some uneasiness to get off before dusk had\ncompletely set in. Silent as he was, I soon learned that he entirely\ndisbelieved Lord Rantremly's theory that the castle harboured\ndangerous characters, yet so great was his inherent respect for the\nnobility that I could not induce him to dispute with any decisiveness\nhis lordship's conjecture. It was plain to be seen, however, that the\nchief constable believed implicitly in the club-footed ghost. I asked\nhim to return the next morning, as I should spend the night in\ninvestigation, and might possibly have some questions to ask him,\nquestions which none but the chief constable could answer. The good\nman promised, and left us rather hurriedly, the driver of the\nwagonette galloping his horse down the long, sombre avenue towards the\nvillage outside the gates.\nI found Sophia Brooks but a doleful companion, and of very little\nassistance that evening. She seemed overcome by her remembrances. She\nhad visited the library where her former work was done, doubtless the\nscene of her brief love episode, and she returned with red eyes and\ntrembling chin, telling me haltingly that the great tome from which\nshe was working ten years ago, and which had been left open on the\nsolid library table, was still there exactly as she had placed it\nbefore being forced to abandon her work. For a decade apparently no\none had entered that library. I could not but sympathise with the poor\nlady, thus revisiting, almost herself like a ghost, the haunted arena\nof her short happiness. But though she proved so dismal a companion,\nthe old woman who came with her was a treasure. Having lived all her\nlife in some semi-slum near the Strand, and having rarely experienced\nmore than a summer's-day glimpse of the country, the long journey had\ndelighted her, and now this rambling old castle in the midst of the\nforest seemed to realise all the dreams which a perusal of halfpenny\nfiction had engendered in her imagination. She lit a fire, and cooked\nfor us a very creditable supper, bustling about the place, singing to\nherself in a high key.\nShortly after supper Sophia Brooks, exhausted as much by her emotions\nand memories as by her long journey of that day, retired to rest.\nAfter being left to myself I smoked some cigarettes, and finished a\nbottle of superb claret which stood at my elbow. A few hours before I\nhad undoubtedly fallen in the estimation of the stolid constable when,\ninstead of asking him questions regarding the tragedy, I had inquired\nthe position of the wine cellar, and obtained possession of the key\nthat opened its portal. The sight of bin after bin of dust-laden,\ncobwebbed bottles, did more than anything else to reconcile me to my\nlonely vigil. There were some notable vintages represented in that\ndismal cavern.\nIt was perhaps half-past ten or eleven o'clock when I began my\ninvestigations. I had taken the precaution to provide myself with half\na dozen so-called electric torches before I left London. These give\nillumination for twenty or thirty hours steadily, and much longer if\nthe flash is used only now and then. The torch is a thick tube,\nperhaps a foot and a half long, with a bull's-eye of glass at one end.\nBy pressing a spring the electric rays project like the illumination\nof an engine's headlight. A release of the spring causes instant\ndarkness. I have found this invention useful in that it concentrates\nthe light on any particular spot desired, leaving all the surroundings\nin gloom, so that the mind is not distracted, even unconsciously, by\nthe eye beholding more than is necessary at the moment. One pours a\nwhite light over any particular substance as water is poured from the\nnozzle of a hose.\nThe great house was almost painfully silent. I took one of these\ntorches, and went to the foot of the grand staircase where the wicked\nbutler had met his death. There, as his lordship had said, lay the\nsilver tray, and nearby a silver jug, a pair of spoons, a knife and\nfork, and scattered all around the fragments of broken plates, cups,\nand saucers. With an exclamation of surprise at the stupidity of the\nresearchers who had preceded me, I ran up the stair two steps at a\ntime, turned to the right, and along the corridor until I came to the\nroom occupied by the late earl. The coverings of the bed lay turned\ndown just as they were when his lordship sprang to the floor,\ndoubtless, in spite of his deafness, having heard faintly the fatal\ncrash at the foot of the stairs. A great oaken chest stood at the head\nof the bed, perhaps six inches from the wall. Leaning against this\nchest at the edge of the bed inclined a small, round table, and the\ncover of the table had slipped from its sloping surface until it\npartly concealed the chest lid. I mounted on this carven box of old\nblack oak and directed the rays of electric light into the chasm\nbetween it and the wall. Then I laughed aloud, and was somewhat\nstartled to hear another laugh directly behind me. I jumped down on\nthe floor again, and swung round my torch like a searchlight on a\nbattleship at sea. There was no human presence in that chamber except\nmyself. Of course, after my first moment of surprise, I realised that\nthe laugh was but an echo of my own. The old walls of the old house\nwere like sounding-boards. The place resembled an ancient fiddle,\nstill tremulous with the music that had been played on it. It was easy\nto understand how a superstitious population came to believe in its\nbeing haunted; in fact, I found by experiment that if one trod quickly\nalong the uncovered floor of the corridor, and stopped suddenly, one\nseemed to hear the sound of steps still going on.\nI now returned to the stair head, and examined the bare polished\nboards with most gratifying results. Amazed at having learnt so much\nin such a short time, I took from my pocket the paper on which the\ndying nobleman had attempted to write with his half-paralysed hand.\nThe chief constable had given the document to me, and I sat on the\nstair head, spread it out on the floor and scrutinised it. It was all\nbut meaningless. Apparently two words and the initial letter of a\nthird had been attempted. Now, however grotesque a piece of writing\nmay be, you can sometimes decipher it by holding it at various angles,\nas those puzzles are solved which remain a mystery when gazed at\ndirect. By partially closing the eyes you frequently catch the intent,\nas in those pictures where a human figure is concealed among the\noutlines of trees and leaves. I held the paper at arm's length, and\nwith the electric light gleaming upon it, examined it at all angles,\nwith eyes wide open, and eyes half closed. At last, inclining it away\nfrom me, I saw that the words were intended to mean, 'The Secret'. The\nsecret, of course, was what he was trying to impart, but he had\napparently got no further than the title of it. Deeply absorbed in my\ninvestigation, I was never more startled in my life than to hear in\nthe stillness down the corridor the gasped words, '_Oh, God!_'\nI swept round my light, and saw leaning against the wall, in an almost\nfainting condition, Sophia Brooks, her eyes staring like those of a\ndemented person, and her face white as any ghost's could have been.\nWrapped round her was a dressing-gown. I sprang to my feet.\n'What are you doing there?' I cried.\n'Oh, is that you, Monsieur Valmont? Thank God, thank God! I thought I\nwas going insane. I saw a hand, a bodiless hand, holding a white sheet\nof paper.'\n'The hand was far from bodiless, madam, for it belonged to me. But why\nare you here? It must be near midnight.'\n'It _is_ midnight,' answered the woman; 'I came here because I heard\nmy husband call me three times distinctly, \"Sophia, Sophia, Sophia!\"\njust like that.'\n'Nonsense, madam,' I said, with an asperity I seldom use where the\nfair sex is concerned; but I began to see that this hysterical\ncreature was going to be in the way during a research that called for\ncoolness and calmness. I was sorry I had invited her to come.\n'Nonsense, madam, you have been dreaming.'\n'Indeed, Monsieur Valmont, I have not. I have not even been asleep,\nand I heard the words quite plainly. You must not think I am either\nmad or superstitious.'\nI thought she was both, and next moment she gave further evidence of\nit, running suddenly forward, and clutching me by the arm.\n'Listen! listen!' she whispered. 'You hear nothing?'\n'Nonsense!' I cried again, almost roughly for my patience was at an\nend, and I wished to go on with my inquiry undisturbed.\n'Hist, hist!' she whispered; 'listen!' holding up her finger. We both\nstood like statues, and suddenly I felt that curious creeping of the\nscalp which shows that even the most civilised among us have not yet\neliminated superstitious fear. In the tense silence I heard someone\nslowly coming up the stair; I heard the halting step of a lame man. In\nthe tension of the moment I had allowed the light to go out; now\nrecovering myself, I pressed the spring, and waved its rays backward\nand forward down the stairway. The space was entirely empty, yet the\nhesitating footsteps approached us, up and up. I could almost have\nsworn on which step they last struck. At this interesting moment\nSophia Brooks uttered a piercing shriek and collapsed into my arms,\nsending the electric torch rattling down the steps, and leaving us in\nimpenetrable darkness. Really, I profess myself to be a gallant man,\nbut there are situations which have a tendency to cause annoyance. I\ncarried the limp creature cautiously down the stairs, fearing the fate\nof the butler, and at last got her into the dining-room, where I lit a\ncandle, which gave a light less brilliant, perhaps, but more steady\nthan my torch. I dashed some water in her face, and brought her to her\nsenses, then uncorking another bottle of wine, I bade her drink a\nglassful, which she did.\n'What was it?' she whispered.\n'Madam, I do not know. Very possibly the club-footed ghost of\nRantremly.'\n'Do you believe in ghosts, Monsieur Valmont?'\n'Last night I did not, but at this hour I believe in only one thing,\nwhich is that it is time everyone was asleep.'\nShe rose to her feet at this, and with a tremulous little laugh\napologised for her terror, but I assured her that for the moment there\nwere two panic-stricken persons at the stair head. Taking the candle,\nand recovering my electric torch, which luckily was uninjured by its\nroll down the incline the butler had taken, I escorted the lady to the\ndoor of her room, and bade her good-night, or rather, good-morning.\nThe rising sun dissipated a slight veil of mist which hung over the\npark, and also dissolved, so far as I was concerned, the phantoms\nwhich my imagination had conjured up at midnight. It was about\nhalf-past ten when the chief constable arrived. I flatter myself I put\nsome life into that unimaginative man before I was done with him.\n'What made you think that the butler was mounting the stair when he\nfell?'\n'He was going up with my lord's breakfast,' replied the chief.\n'Then did it not occur to you that if such were the case, the silver\npitcher would not have been empty, and, besides the broken dishes,\nthere would have been the rolls, butter, toast, or what not, strewn\nabout the floor?'\nThe chief constable opened his eyes.\n'There was no one else for him to bring breakfast to,' he objected.\n'That is where you are very much mistaken. Bring me the boots the\nbutler wore.'\n'He did not wear boots, sir. He wore a pair of cloth slippers.'\n'Do you know where they are?'\n'Yes; they are in the boot closet.'\n'Very well, bring them out, examine their soles, and sticking in one\nof them you will find a short sliver of pointed oak.'\nThe constable, looking slightly more stupefied than ever, brought the\nslippers, and I heard him ejaculate: 'Well, I'm blowed!' as he\napproached me. He handed me the slippers soles upward, and there, as I\nhave stated, was the fragment of oak, which I pulled out.\n'Now, if you take this piece of oak to the top of the stair, you will\nsee that it fits exactly a slight interstice at the edge of one of the\nplanks. It is as well to keep one's eyes open, constable, when\ninvestigating a case like this.'\n'Well, I'm blowed!' he said again, as we walked up the stair\ntogether.\nI showed him that the sliver taken from the slipper fitted exactly the\ninterstice I had indicated.\n'Now,' said I to him, 'the butler was not going up the stairs, but was\ncoming down. When he fell headlong he must have made a fearful\nclatter. Shuffling along with his burden, his slipper was impaled by\nthis sliver, and the butler's hands being full, he could not save\nhimself, but went head foremost down the stair. The startling point,\nhowever, is the fact that he was _not_ carrying my lord's breakfast to\nhim, or taking it away from him, but that there is someone else in the\ncastle for whom he was caterer. Who is that person?'\n'I'm blessed if I know,' said the constable, 'but I think you are\nwrong there. He may not have been carrying up the breakfast, but he\ncertainly was taking away the tray, as is shown by the empty dishes,\nwhich you have just a moment ago pointed out.'\n'No, constable; when his lordship heard the crash, and sprang\nimpulsively from his bed, he upset the little table on which had been\nplaced his own tray; it shot over the oaken chest at the head of the\nbed, and if you look between it and the wall you will find tray,\ndishes, and the remnants of a breakfast.'\n'Well, I'm blessed!' exclaimed the chief constable once again.\n'The main point of all this,' I went on calmly, 'is not the disaster\nto the butler, nor even the shock to his lordship, but the fact that\nthe tray the serving man carried brought food to a prisoner, who\nprobably for six weeks has been without anything to eat.'\n'Then,' said the constable, 'he is a dead man.'\n'I find it easier,' said I, 'to believe in a living man than in a dead\nman's ghost. I think I heard his footsteps at midnight, and they\nseemed to me the footsteps of a person very nearly exhausted.\nTherefore, constable, I have awaited your arrival with some\nimpatience. The words his late lordship endeavoured to write on the\npaper were \"The Secret\". I am sure that the hieroglyphics with which\nhe ended his effort stood for the letter \"R\", and if he finished his\nsentence, it would have stood: \"The secret room\". Now, constable, it\nis a matter of legend that a secret room exists in this castle. Do you\nknow where it is?'\n'No one knows where the secret room is, or the way to enter it, except\nthe Lords of Rantremly.'\n'Well, I can assure you that the Lord of Rantremly who lives in London\nknows nothing about it. I have been up and about since daylight,\ntaking some rough measurements by stepping off distances. I surmise\nthat the secret room is to the left of this stairway. Probably a whole\nsuite of rooms exists, for there is certainly a stair coinciding with\nthis one, and up that stair at midnight I heard a club-footed man\nascend. Either that, or the ghost that has frightened you all, and, as\nI have said, I believe in the man.'\nHere the official made the first sensible remark I had yet heard him\nutter:--\n'If the walls are so thick that a prisoner's cry has not been heard,\nhow could you hear his footsteps, which make much less noise?'\n'That is very well put, constable, and when the same thing occurred to\nme earlier this morning, I began to study the architecture of this\ncastle. In the first place, the entrance hall is double as wide at the\nbig doors as it is near the stairway. If you stand with your back to\nthe front door you will at once wonder why the builders made this\ncurious and unnecessary right angle, narrowing the farther part of the\nhall to half its width. Then, as you gaze at the stair, and see that\nmarvellous carved oak newel post standing like a monumental column,\nyou guess, if you have any imagination, that the stairway, like the\nhall, was once double as wide as it is now. We are seeing only half of\nit, and doubtless we shall find a similar newel post within the hidden\nroom. You must remember, constable, that these secret apartments are\nno small added chambers. Twice they have sheltered a king.'\nThe constable's head bent low at the mention of royalty. I saw that\nhis insular prejudice against me and my methods was vanishing, and\nthat he had come to look upon me with greater respect than was shown\nat first.\n'The walls need not be thick to be impenetrable to sound. Two courses\nof brick, and a space between filled with deafening would do it. The\nsecret apartment has been cut off from the rest of the house since the\ncastle was built, and was not designed by the original architect. The\npartition was probably built in a hurry to fulfil a pressing need, and\nit was constructed straight up the middle of the stair, leaving the\nstout planks intact, each step passing thus, as it were, through the\nwall. Now, when a man walks up the secret stairway, his footsteps\nreverberate until one would swear that some unseen person was treading\nthe visible boards on the outside.'\n'By Jove!' said the constable, in an awed tone of voice.\n'Now, officer, I have here a pickaxe and a crowbar. I propose that we\nsettle the question at once.'\nBut to this proposal the constable demurred.\n'You surely would not break the wall without permission from his\nlordship in London?'\n'Constable, I suspect there is no Lord Rantremly in London, and that\nwe will find a very emaciated but genuine Lord Rantremly within ten\nfeet of us. I need not tell you that if you are instrumental in his\nimmediate rescue without the exercise of too much red tape, your\ninterests will not suffer because you the more speedily brought food\nand drink to the lord paramount of your district.'\n'Right you are,' cried the constable, with an enthusiasm for which I\nwas not prepared. 'Where shall we begin?'\n'Oh, anywhere; this wall is all false from the entrance hall to some\npoint up here. Still, as the butler was carrying the meal upstairs I\nthink we shall save time if we begin on the landing.'\nI found the constable's brawn much superior to his brain. He worked\nlike a sansculotte on a barricade. When we had torn down part of the\nold oak panelling, which it seemed such a pity to mutilate with axe\nand crowbar, we came upon a brick wall, that quickly gave way before\nthe strength of the constable. Then we pulled out some substance like\nmatting, and found a second brick wall, beyond which was a further\nshell of panelling. The hole we made revealed nothing but darkness\ninside, and although we shouted, there was no answer. At last, when we\nhad hewn it large enough for a man to enter, I took with me an\nelectric torch, and stepped inside, the constable following, with\ncrowbar still in hand. I learned, as I had surmised, that we were in\nthe upper hall of a staircase nearly as wide as the one on the\noutside. A flash of the light showed a door corresponding with the\nfireplace of the upper landing, and this door not being locked, we\nentered a large room, rather dimly lighted by strongly barred windows\nthat gave into a blind courtyard, of which there had been no\nindication heretofore, either outside or inside the castle. Broken\nglass crunched under our feet, and I saw that the floor was strewn\nwith wine bottles whose necks had been snapped off to save the pulling\nof the cork. On a mattress at the farther end of the room lay a man\nwith gray hair, and shaggy, unkempt iron-gray beard. He seemed either\nasleep or dead, but when I turned my electric light full on his face\nhe proved to be still alive, for he rubbed his eyes languidly, and\ngroaned, rather than spoke:--\n'Is that you at last, you beast of a butler? Bring me something to\neat, in Heaven's name!'\nI shook him wider awake. He seemed to be drowsed with drink, and was\nfearfully emaciated. When I got him on his feet, I noticed then the\ndeformity that characterised one of them. We assisted him through the\naperture, and down into the dining-room, where he cried out\ncontinually for something to eat, but when we placed food before him,\nhe could scarcely touch it. He became more like a human being when he\nhad drunk two glasses of wine, and I saw at once he was not as old as\nhis gray hair seemed to indicate. There was a haunted look in his\neyes, and he watched the door as if apprehensive.\n'Where is that butler?' he asked at last.\n'Dead,' I replied.\n'Did I kill him?'\n'No; he fell down the stairway and broke his neck.'\nThe man laughed harshly.\n'Where is my father?'\n'Who is your father?'\n'Lord Rantremly.'\n'He is dead also.'\n'How came he to die?'\n'He died from a stroke of paralysis on the morning the butler was\nkilled.'\nThe rescued man made no comment on this, but turned and ate a little\nmore of his food. Then he said to me:--\n'Do you know a girl named Sophia Brooks?'\n'Yes. For ten years she thought you dead.'\n'Ten years! Good God, do you mean to say I've been in there only ten\nyears? Why, I'm an old man. I must be sixty at least.'\n'No; you're not much over thirty.'\n'Is Sophia--' He stopped, and the haunted look came into his eyes\nagain.\n'No. She is all right, and she is here.'\n'Here?'\n'Somewhere in the grounds. I sent her and the servant out for a walk,\nand told them not to return till luncheon time, as the constable and I\nhad something to do, and did not wish to be interrupted.'\nThe man ran his hand through his long tangled beard.\n'I should like to be trimmed up a bit before I see Sophia,' he said.\n'I can do that for you, my lord,' cried the constable.\n'My lord?' echoed the man. 'Oh, yes, I understand. You are a\npoliceman, are you not?'\n'Yes, my lord, chief constable.'\n'Then I shall give myself up to you. I killed the butler.'\n'Oh, impossible, my lord!'\n'No, it isn't. The beast, as I called him, was getting old, and one\nmorning he forgot to close the door behind him. I followed him\nstealthily out, and at the head of the stair planted my foot in the\nsmall of his back, which sent him headlong. There was an infernal\ncrash. I did not mean to kill the brute, but merely to escape, and\njust as I was about to run down the stairway, I was appalled to see my\nfather looking like--looking like--well, I won't attempt to say what\nhe looked like; but all my old fear of him returned. As he strode\ntowards me, along the corridor, I was in such terror that I jumped\nthrough the secret door and slammed it shut.'\n'Where is the secret door?' I asked.\n'The secret door is that fireplace. The whole fireplace moves inward\nif you push aside the carved ornament at the left-hand corner.'\n'Is it a dummy fireplace, then?'\n'No, you may build a fire in it, and the smoke will escape up the\nchimney. But I killed the butler, constable, though not intending it,\nI swear.'\nAnd now the constable shone forth like the real rough diamond he was.\n'My lord, we'll say nothing about that. Legally you didn't do it. You\nsee, there's been an inquest on the butler and the jury brought in the\nverdict, \"Death by accident, through stumbling from the top of the\nstair.\" You can't go behind a coroner's inquest, my lord.'\n'Indeed,' said his lordship, with the first laugh in which he had\nindulged for many a year. 'I don't want to go behind anything,\nconstable, I've been behind that accursed chimney too long to wish any\nfurther imprisonment.'\n\n\nNote the reveal happens at the end of the story, specifically revealed here:\n\ns that you at last, you beast of a butler? Bring me something to\neat, in Heaven's name!'\nI shook him wider awake. He seemed to be drowsed with drink, and was\nfearfully emaciated. When I got him on his feet, I noticed then the\ndeformity that characterised one of them. We assisted him through the\naperture, and down into the dining-room, where he cried out\ncontinually for something to eat, but when we placed food before him,\nhe could scarcely touch it. He became more like a human being when he\nhad drunk two glasses of wine, and I saw at once he was not as old as\nhis gray hair seemed to indicate. There was a haunted look in his\neyes, and he watched the door as if apprehensive.\n'Where is that butler?' he asked at last.\n'Dead,' I replied.\n'Did I kill him?'\n'No; he fell down the stairway and broke his neck.'\nThe man laughed harshly.\n'Where is my father?'\n'Who is your father?'\n'Lord Rantremly.'\n'He is dead also.'\n'How came he to die?'\n'He died from a stroke of paralysis on the morning the butler was\nkilled.'\nThe rescued man made no comment on this, but turned and ate a little\nmore of his food. Then he said to me:--\n'Do you know a girl named Sophia Brooks?'\n'Yes. For ten years she thought you dead.'\n'Ten years! Good God, do you mean to say I've been in there only ten\nyears? Why, I'm an old man. I must be sixty at least.'\n'No; you're not much over thirty.'\n'Is Sophia--' He stopped, and the haunted look came into his eyes\nagain.\n'No. She is all right, and she is here.'\n'Here?'\n'Somewhere in the grounds. I sent her and the servant out for a walk,\nand told them not to return till luncheon time, as the constable and I\nhad something to do, and did not wish to be interrupted.'\nThe man ran his hand through his long tangled beard.\n'I should like to be trimmed up a bit before I see Sophia,' he said.\n'I can do that for you, my lord,' cried the constable.\n'My lord?' echoed the man. 'Oh, yes, I understand. You are a\npoliceman, are you not?'\n'Yes, my lord, chief constable.'\n'Then I shall give myself up to you. I killed the butler.'\n'Oh, impossible, my lord!'\n'No, it isn't. The beast, as I called him, was getting old, and one\nmorning he forgot to close the door behind him. I followed him\nstealthily out, and at the head of the stair planted my foot in the\nsmall of his back, which sent him headlong. There was an infernal\ncrash. I did not mean to kill the brute, but merely to escape, and\njust as I was about to run down the stairway, I was appalled to see my\nfather looking like--looking like--well, I won't attempt to say what\nhe looked like; but all my old fear of him returned. As he strode\ntowards me, along the corridor, I was in such terror that I jumped\nthrough the secret door and slammed it shut.'\n'Where is the secret door?' I asked.\n'The secret door is that fireplace. The whole fireplace moves inward\nif you push aside the carved ornament at the left-hand corner.'\n'Is it a dummy fireplace, then?'\n'No, you may build a fire in it, and the smoke will escape up the\nchimney. But I killed the butler, constable, though not intending it,\nI swear.'\nAnd now the constable shone forth like the real rough diamond he was.\n'My lord, we'll say nothing about that. Legally you didn't do it. You\nsee, there's been an inquest on the butler and the jury brought in the\nverdict, \"Death by accident, through stumbling from the top of the\nstair.\" You can't go behind a coroner's inquest, my lord.'\n'Indeed,' said his lordship, with the first laugh in which he had\nindulged for many a year. 'I don't want to go behind anything,\nconstable, I've been behind that accursed chimney too long to wish any\nfurther imprisonment.'\n\n\nPlease analyze all the clues and evidence presented in the story and identify who the culprit is. Explain your reasoning step by step, considering:\n1. The motives of different characters\n2. The opportunities each character had\n3. Any physical evidence or alibis\n4. (Most Important) The reveal information provided in the final segment\n\nWho is the culprit (or culprits, if more than one) and why? Answer in the form:\nCULPRIT: <name(s) here>\n\nSUSPECTS: <names(s) for all suspects here>\n\nREASON: <reasoning>",
    "solution": "CULPRIT:  \n– The Eleventh Lord Rantremly and his aged butler, for the original crime (secretly seizing and imprisoning Reginald and suppressing his marriage).  \n– Reginald Rantremly (the true heir), for the subsequent, unintended killing of the butler.\n\nSUSPECTS:  \n1  Eleventh Lord Rantremly (the father)  \n2  The old butler  \n3  Reginald Rantremly (the imprisoned son, afterwards the real Lord)  \n4  The new “Lord” Rantremly (the distant cousin in London)  \n5  Sophia Brooks  \n6  The chaplain\n\nREASON:\n\nStep-by-step analysis of clues and evidence  \n\n1. Motives  \n   • Eleventh Lord Rantremly: stop his son’s socially “unfit” marriage; keep the title, fortune and documents under his sole control.  \n   • Butler: slavishly loyal to his master; helps carry out the plot and gains power in the empty castle.  \n   • Reginald: only motive is escape; no reason to kill except to get away from his gaoler.\n\n2. Opportunity  \n   • Father and butler alone ran the castle; no other servants would stay because of the “ghost.” They therefore had both privacy and time to brick off a whole stair and hide the prisoner.  \n   • The butler alone took food to the secret room each morning (the tray found at foot of stairs).  \n   • Reginald, once the door was left ajar, had the single instant of opportunity to push his captor.\n\n3. Physical evidence / deductions  \n   • Sliver of oak stuck in the butler’s slipper proves he was coming down the stair, not going up; therefore he had just left a person above him.  \n   • Lord Rantremly’s own tray, still lying behind the overturned table, shows the butler had not been serving HIM.  \n   • The dying earl’s scrawl “THE SECRET R…” points to “The Secret Room.”  \n   • Crumpled wine-bottles, mattress, and the emaciated, lame man found behind the false wall confirm long imprisonment and explain the “club-footed ghost.”  \n   • Reginald’s confession matches the physical facts: butler forgot to shut the panel; Reginald kicked him; crash; father, paralysed by the shock, dies.\n\n4. Corroboration from the reveal  \n   • Reginald explicitly admits the push.  \n   • He confirms the butler and father had locked him up for the ten years since the chapel incident with Sophia.  \n   • He explains the mechanism of the secret door (the moving fireplace) exactly where Valmont predicted.\n\nTherefore:\n\n• Primary crime (kidnap, false imprisonment, suppression of the marriage): committed jointly by the Eleventh Lord Rantremly and his butler.  \n• Secondary death (the butler’s fall): caused—though unintentionally—by Reginald Rantremly when he kicked the man down the stairs. The coroner’s jury has already called it an accident, but in strict fact Reginald’s act precipitated the fatal fall.\n\nHence the late earl and his butler are the chief culprits; Reginald is technically culpable only for the butler’s accidental death."
  },
  "original_metadata": {
    "story_code": "TEV06",
    "story_title": "The Ghost with the Club-Foot",
    "author_name": "Unknown",
    "author_code": "RB",
    "plot_summary": "When a distraught woman recounts the blackmail and loss of her husband at the hands of his upper-class family, Eugène Valmont suspects there are more than ghosts haunting the former estate. Will Valmont exorcise this ghost? What other crimes haunt this place?",
    "text_length": 60192,
    "is_solvable": true,
    "story_annotations": {
      "Story Code": "TEV06",
      "Annotator #1 Code": "SO",
      "Annotator #2 Code": "MAL",
      "Story Title": "The Ghost with the Club-Foot",
      "Plot Summary": "When a distraught woman recounts the blackmail and loss of her husband at the hands of his upper-class family, Eugène Valmont suspects there are more than ghosts haunting the former estate. Will Valmont exorcise this ghost? What other crimes haunt this place?",
      "Content warnings": "",
      "Author Code": "RB",
      "Second author code (if applicable)": "",
      "Investigation-reveal order": "Standard",
      "Reveal border sentence": "'Is that you at last, you beast of a butler? Bring me something to eat, in Heaven's name!'",
      "Name of Detective #1": "Eugène Valmont",
      "Detective #1 Gender": "Male",
      "Detective #1 Role": "Independent professional (solo)",
      "Name of Detective #2": "",
      "Detective #2 Gender": "",
      "Detective #2 Role": "",
      "Number of detectives if more than 2": "",
      "Name of Assistant #1": "",
      "Assistant #1 Gender": "",
      "Assistant #1 Role": "",
      "Name of Assistant #2": "",
      "Assistant #2 Gender": "",
      "Assistant #2 Role": "",
      "Number of assistants if more than 2": "",
      "Number of victims of gender Male": "4",
      "Number of victims of gender Female": "1",
      "Number of victims of gender Non-binary": "0",
      "Number of victims of gender Unknown": "0",
      "Number of victims who are corporate entities": "0",
      "Number of culprits of gender Male": "3",
      "Number of culprits of gender Female": "0",
      "Number of culprits of gender Non-binary": "0",
      "Number of culprits of gender Unknown": "0",
      "Culprits introduced during reveal?": "No",
      "Main culprit independence": "Acts mostly alone with some assistance",
      "Initiator of investigation": "A private client",
      "Role of police": "Police are present but with no role, or only a minor role, in helping solve the crime",
      "Focus on crime or quasi-crime": "Crime",
      "Crime trajectory": "Qrime → same qrime",
      "Occurrence of crime or mystery": "Before the investigation, During the investigation",
      "Types of qrimes": "Murder, Blackmail, Assault, Kidnapping",
      "Motives": "Pride, Self-defence",
      "Means (murder only)": "Natural causes, Accident, Blunt force trauma",
      "Sufficient clues to guess?": "Yes",
      "Sufficient clues to solve?": "Yes",
      "Correct annotator guess?": "No",
      "Types of clues": "Usable in real time (usable → usable), Usable only in retrospect (legible → usable), Ex post -- new clue (not mentioned → usable), Ex post -- newly usable clue (illegible → usable)",
      "Essential clue": "The Butler wearing slippers that fit the stairs",
      "Type of essential clue": "Physical clue",
      "Most salient clue": "Noises from the 'ghost' and him calling his wife",
      "Type of most salient clue": "Testimonial clue",
      "Red herring description": "",
      "Type of red herring": "",
      "Presence of planted or fabricated evidence": "",
      "Types of evidence made available": "Testimonial evidence, Physical evidence",
      "Is the crime solved?": "Yes",
      "Decision NOT to alert authorities?": "Yes",
      "Satisfying narrative account?": "Yes",
      "How satisfying as detective fiction?": "4",
      "Recommend to friend?": "Yes",
      "Date of First Publication (YYYY-MM-DD)": "1906",
      "Format of First Publication (Journal or Book)": "Book",
      "Name of Journal or Title of Book": "Triumphs of Eugene Valmont"
    },
    "author_metadata": {
      "Author Code": "RB",
      "Surname(s)": "Barr",
      "Given Name(s)": "Robert",
      "Sex": "M",
      "Date of Birth (YYYY-MM-DD)": "1849-09-16",
      "Country of Birth": "Scotland",
      "City/Town of Birth": "Glasgow",
      "Date of Death (YYYY-MM-DD)": "1912-10-21",
      "Country of Death": "England",
      "City/Town of Death": "Woldingham, Surrey",
      "Nationality/ies": "British, Scottish",
      "VIAF": "https://viaf.org/viaf/122140022/"
    }
  }
}
