{
  "item_metadata": {
    "item_id": "PB01",
    "num_documents": 1
  },
  "documents": [
    {
      "content": "SHE was as bright as a butterfly in a flower garden, and as restless, quivering down to her finger-tips with impatient excitement. That big room in the big house in Upper Belgrave Street was no bad notion of the flower garden.\nThere were just a few square yards of clear space where she sat alone—on a couch made for two—patting the soft carpet with a restless little foot. The rest of the room was filled with long tables, and oval tables, and round tables, all crowded with the pretty trifles and trinkets that ladies love. It seemed as if half a dozen of the smartest jewellers and fancy shops of Regent Street had emptied their show windows into the room. The tables were all aglow with the gleam of gold and silver and the glitter of jewels, and the bright tints of rich silk and painted fans, and rare and dainty porcelain.\nFor Lilian Ray was to marry Sydney Harcourt in a week, and there was not a more popular couple in London. Her sweet face and winning ways had taken the heart of society by storm; and all the world knew that warm-hearted, hot-headed Harcourt was going hop, step, and jump to the devil when she caught and held him. So everybody was pleased, and said it was a perfect match, and for the last three weeks the wedding presents came pouring into the big house in Upper Belgrave Street, and flooded the front drawing-room. Lilian was impatient, but it was the impatience of delight, the trouble of the crumpled rose-leaf that helps to keep one’s enjoyment awake.\nNo wonder she was excited, for her lover was coming, and with him were coming the famous Harcourt diamonds, which had been the delight and admiration and envy of fashionable London for half a century. The jewels had gone from the bank, where they had lain in darkness and safety for a dozen years, to the glittering shop of Mr. Ophir, of Bond Street. For the setting was very old, and the vigilance of the tiny silver points that guarded the priceless morsels of bright stone had to be looked to, and a brand-new case was ordered to set the precious sparklers off to the best advantage.\nA sudden knock at the door starts her again to the window, the cobweb silk flying behind. But she turns away petulantly like a spoiled child.\n“Only another travelling bag,” she says; “that makes seven—two with gold fittings. I wonder if this has gold fittings. I have set them all there in a row with their mouths open, and their gold or silver teeth grinning. There is not room for another one. I wonder do people think that——”\nThe sentence was never finished, for at this moment a hansom cab came sharply round the corner in full view of the window. She caught one glimpse of an eager, young face and a flat parcel, then she dropped back into her couch, panting a little. There came a second knock, and a foot on the stairs mounting four steps at a spring. She heard it, and knew it, but sat quite still. Another moment and he was in the room. Her eyes welcomed him, though her lips still pouted.\n“You are ten minutes before your time, sir,” she said, “and I am terribly busy. What have you got there?”\n“Oh! you little sly boots. You know you have been longing for me and the diamonds, especially the diamonds, for the last hour. I’ve a great mind to carry them off again.”\nHe dropped into the seat beside her and his right arm stole round her waist, while he held the jewel-case away in his left hand. She blushed and laughed, and slipping from his encircling arm, made a dash for the diamonds. But he was too quick for her. He leaped to his feet and held the case aloft, eight feet in the air. Straining to the utmost of her tip-toes she could just reach one hand to his elbow; she placed the other amongst his brown curls, making ready for a leap. Her face was close to his and quite undefended. What happened was, under the circumstances, inevitable.\n“Oh!” she exclaimed, in quite a natural tone of surprise, “how dare you, sir!”\n“Payment in advance,” he retorted, as the precious case came down to her desiring hands; “over-payment, I confess, but then I am ready to give change to any amount.”\nBut she fled from him, with her treasure, to the couch. “Now do be sensible for one short moment, if you can, and hand me the scissors out of that lady’s companion there beside the photograph frame on the table.”\nThe jewel-case was done up in whitey-brown paper with strong cord and sealed with broad patches of red sealing-wax. Quite excitedly she cut through the string, leaving the seals unbroken, and let paper and twine and wax go down in a heap on the carpet together.\nThere emerged from the inner wrapping of soft, white tissue-paper the jewel-case in its new coat of light brown morocco with the monogram L. H. in neat gold letters on it. She gave a little cry of pleasure as her eyes fell on the lettering which proclaimed the jewels her very own, and he, sitting close beside, watching lovingly as one watches a pretty child at play, made believe to snatch it from her fingers. But she held it tight. Like a bather on the water’s brim, she paused for one tantalising moment, drew a deep breath to make ready for the coming cry of rapture, and opened the case.\nIt was empty!\nThe slope of the raised centre of violet velvet was just ruffled a little, like a bed that had been slept in. That was all.\nShe looked suddenly in his eyes, half amused, half accusingly, for she thought he had played her some trick. His face was grave and startled.\n“What does it mean, Syd? are you playing with me?”\nBut she knew from his face he was quite serious even while she asked.\n“I cannot make it out, Lil,” he said, in an altered voice. “I cannot make it out at all. I brought the case just as it was from Mr. Ophir’s. He told me he had put the diamonds in and sealed it up with his own hands. See, you have not even broken the seals,” and he mechanically picked up the litter of paper and twine from the floor. “No one touched it since except myself and you, and the diamonds are gone. Old Ophir would no more dream of playing such a trick than an archbishop. Still it must be either that or—— But that is too absurd. He’s as respectable as the Bank of England and nearly as rich. It beats me, Lily. Why, the old boy warned me as he gave me the precious parcel. ‘We cannot be too careful, Mr. Harcourt,’ he said. ‘There is twenty thousand pounds in that little parcel, let no hand touch it except your own.’ And I did not, of course; yet the diamonds have vanished, through case and paper and seals, into space.”\nHe stared ruefully at the expanse of violet velvet.\n“The first thing is to see Mr. Ophir,” he said.\n“Oh, don’t leave me, Syd.”\n“Well, to write to him then. There must be some ridiculous mistake somewhere. Perhaps he gave me the wrong case. He would never—— No, that’s too absurd. Perhaps some one substituted the empty case when he looked aside for a moment. It may be necessary to employ a detective. I’ll tell him so at once. Can I write a line anywhere?”\n“There are half a dozen writing-cases there in a row on that table.”\nShe sat him down to a pretty mother-of-pearl and tortoise-shell affair, with violet scented ink in the silver-mounted bottles.\nThen Harcourt showed a quick impatience, quite unlike his usual sunny manner, which Lilian thought nothing could disturb.\n“Do get a fellow some decent ink, Lil,” he said pettishly. “I cannot write to an old don like Ophir with this stuff.”\nShe slipped from the room like a shadow and was back again almost in a moment. When she returned she found him on the couch nervously fingering the fragments of paper, twine, and sealing-wax.\n“I cannot make it out at all,” he muttered. “They seem to have vanished into thin air. However, old Ophir will be able to help us if any one can.”\nHe growled a bit at the dainty feminine pen and paper and began:—\n“DEAR MR. OPHIR,—A most extraordinary thing has happened. I took the case you gave me, as you gave it to me, straight to Miss Ray, Belgrave Street, and opened it without breaking the seals, by cutting the strings in her presence. The diamonds were gone. There must be some mistake somewhere. Perhaps you may be able to clear up the mystery. If you suspect dishonesty, engage a detective at once. The driver will wait for a reply.\n“Yours in haste,\n“SYDNEY HARCOURT.”\nHe ran downstairs himself to hail a cab to take the note. A smart hansom with a smart driver on the box was crawling up the street. He dashed across with sudden alacrity like a startled trout in a stream, when Harcourt raised his hand, almost taking the feet off a sturdy mendicant who was standing in front of the door dangerously near the kerbstone.\n“Here, my man. Take this to Mr. Ophir’s, in Bond Street. The address is on the envelope. Wait for an answer, double fare if you look sharp.”\nThe driver took the letter, touched his hat, and was off like a shot.\nHarcourt threw the grumbling beggar a shilling and slammed the door. If he had waited just one second he would have seen the beggar go off almost as quickly as the hansom and disappear round the corner.\n“Oh, Sydney, do cheer up a little,” pleaded Lily, transformed from tease to comforter; “they will come all right. If they don’t, I won’t mind in the least, and your father is too fond of you, and of me, I think, too, to be really angry. It wasn’t your fault, anyway.”\n“Well, you see how it is, Lil; the infernal things—I beg your pardon. Don’t mind me; I am terribly put out—you see, they were lost out of my hands. They were a mighty big prize for any one to get hold of, and I have been going the pace a bit before I met you, my darling, and many people think I have outrun the bailiff. So there is sure to be malicious whispering and tattling, and people may say—no, I cannot tell you what they may say, and what is more, I don’t care a—dash. You can never say or think or look anything but what’s kind, and I would not have a pucker in that pretty brow or a tear in your blue eyes for all the diamonds that ever came out of Golconda. The diamonds may go hang. ‘Here’s metal more attractive.’”\nWonderful is Love’s Lethe. In five minutes the diamonds had vanished from their memory as completely as they had vanished from the case. The sound and sight of a cab whirling to the door brought them suddenly back to the work-a-day world. A footman entered, bearing in the very centre of a silver salver a visiting card slightly soiled. Harcourt took it, and Lilian, peering over his shoulder, read the inscription:—\n“MR. PAUL BECK,\nPrivate Detective.”\n“What is he like, Tomlinson?”\n“Stout party in grey, sir. Don’t seem particular bright.”\n“Well, show him up.”\n“Who can he be? What can he want?” muttered Harcourt to himself uneasily when the footman disappeared. “There was no time to get to Ophir and back, much less to find a detective. I cannot make it out.”\n“Oh, he came to the door like a whirlwind, and you know we never know how time goes when we are talking of——”\n“Mr. Paul Beck,” cried the discreet footman, opening the door with a flourish.\nMr. Paul Beck did not require much showing up apparently. He slipped furtively into the room, keeping his back as much as possible to the light as if secrecy had grown a habit with him. He was a stout, strongly built man in dark grey tweed, suggesting rather the notion of a respectable retired milkman than a detective. His face was ruddy, and fringed with reddish brown whiskers, and his light brown hair curled like a water dog’s. There was a chronic look of mild surprise in his wide-open blue eyes, and his smile was innocent as a child’s.\nJust as he entered Lilian thought she noticed one quick, keen glance at where the empty jewel-case lay on the table and the tangle of paper and twine under it. But before she could be sure the expression vanished from his eyes like a transparency when the light goes out.\nHarcourt knew the man by reputation as one of the cleverest detectives in London—a man who had puzzled out mysteries where even the famous Mr. Murdock Rose had failed—but looking at him now he could hardly believe the reputation deserved.\n“Mr. Beck,” he said, “will you take a chair? You come, I presume, about——”\n“About those diamonds,” said Mr. Beck abruptly, without making any motion to sit down. “I was fortunately with Mr. Ophir when your note came. He asked me to take charge of the case. Your cabman lost no time, and here I am.”\n“He told you the facts.”\n“Very briefly.”\n“And you think——”\n“I don’t think. I am quite sure I know where and how to lay my hand on the diamonds.”\nHe spoke confidently. Lilian thought she saw the trace of a smile on the innocent-looking mouth, and a futile attempt to wink one of the wide-open eyes.\n“I am delighted you think so,” said Harcourt; “I am exceedingly anxious about the matter. Did Mr. Ophir suggest——”\n“Nothing,” broke in Mr. Beck again. “I didn’t want his suggestions. Time is of importance, not talk. We are running on a hot scent; we must not give it time to cool. Is that the jewel-case?”\n“Yes,” said Harcourt, taking it up and opening it; “just as it came, empty.”\nMr. Beck abruptly closed it again and put it in his pocket.\n“That’s the paper and twine that was around it, I suppose?”\nHarcourt nodded. Mr. Beck picked it up carefully and put it in the other pocket.\n“You will observe,” said Harcourt, “that the seal is not broken. The string was cut by Miss Ray. But when——”\n“I must wish you good-day, Mr. Harcourt,” said the unceremonious detective. “Good-day, miss.”\n“Have you finished your investigations already?” said Harcourt in surprise. “Surely you cannot have already found a clue?”\n“I have found all I wanted and expected. I see my way pretty plainly to lay my hands on the thief. When I have more news to tell I’ll write. Good-day for the present.”\nHe was manifestly eager to be off on his mission. Almost before Harcourt could reply he was out of the room and down the stairs. He opened the door for himself, and the hansom which he had kept waiting whirled him away at headlong speed.\nHe had not disappeared five minutes down one side of the street when another hansom, driven at the same rapid pace, came tearing up the other. Lilian and Sydney had not got well over their surprise at his abrupt departure when a second knock came to the door, and Tomlinson entered again with a salver and a card—a clean one this time—\n“MR. PAUL BECK,\nPrivate Detective.”\nHarcourt started, and Lilian uttered a little cry, half surprise, half amusement at the sight of it.\n“The same man, Tomlinson?”\n“The same, sir; leastways he seems a very absentminded gentleman. ‘Any one been here for the last ten minutes?’ he said, breathless-like, when I opened the door. ‘You was, sir,’ I said, ‘not five minutes ago.’ ‘Oh, was I?’ says he, with a queer kind of a laugh, ‘that’s quick and no mistake. Am I here now?’ ‘Of course you are, sir,’ I said, looking at him hard, but he seemed no way in liquor; ‘there you are and there you stand.’ ‘Oh, I mean did I go away at all?’ ‘Fast as a hansom could carry you, sir,’ I said, humouring him, for he was as serious as a judge, and seemed quite put out to hear he had gone away in a hansom. ‘That’s bad, that’s bad,’ he said; ‘ten minutes late. Well, young man, there is no help for it. Take this card to Mr. Harcourt.’ Shall I show him up, sir?”\n“Of course.”\n“What can it mean?” cried Lilian. “Surely he cannot have found them in five minutes?”\n“Perhaps so,” said Harcourt. “He has probably found some clue, anyhow. His sober chaff of poor Tomlinson in the hall looks as if he were in good-humour about something. Gad, I didn’t think the old chap had so much fun in him!”\n“Mr. Paul Beck, sir.”\nThere was a slight, indescribable change in the manner of Mr. Beck as he now entered the room. He was less furtive and less abrupt in his movements, and he seemed no longer anxious, as before, to keep his back to the light.\n“You are back again very soon, Mr. Beck,” said Harcourt; “have you got a clue?”\n“I wish I had come five minutes sooner,” said Mr. Beck, his voice quite changed. “I’m afraid I have lost a clue. I have lost the clue, in fact, and I must set about finding it. Where is the jewel-case?”\n“Why, I gave it to you not ten minutes ago.”\n“To me?” began Mr. Beck, and then stopped himself with a queer smile that was half a grimace. “Oh yes, you gave it to me. Well, and what did I do with it?”\n“I don’t understand you in the very least.”\n“Well, you need not understand me. But you can answer me.”\n“Mr. Beck, you will excuse me, but this is no time for bad jokes, and I am in no humour for them.”\n“Mr. Harcourt, you will learn later on that the joke in this business is not of my making, and I hope to make the joker pay for it. Meanwhile, I come from Mr. Ophir.”\n“You said that before.”\n“Did I? Well, I say it again. I come from Mr. Ophir commissioned to find those diamonds, and I ask you, as civilly as may be, what has been done with the case?”\n“What you yourself have done with it?”\n“Well, what I myself have done with it, if you like.”\nHarcourt reddened with anger at this cool audacity, and Lilian suddenly interposed.\n“You put it in your pocket, Mr. Beck, and carried it away.”\n“Was I in a hurry, miss?”\n“You were in a great hurry.”\n“Was I dressed as I am now?”\n“Exactly.”\n“And looked the same?”\n“Precisely.”\n“Figure and face the same?”\n“Well, yes. I thought you were more made up than you are now.”\n“Made up! What do you mean, miss?”\n“Well, Mr. Beck, I thought you had been beautifying yourself. There was a trace of rouge on your cheeks.”\n“And I kept my back to the light, I warrant.”\n“Your memory is wonderful.”\nMr. Beck chuckled, and Harcourt broke in angrily—\n“Don’t you think we’ve had enough of this foolery, sir?”\n“More than enough,” said Mr. Beck calmly. “I have the honour to wish you a very good morning, Mr. Harcourt, and to you, miss.” There was a touch of admiration in his voice as he addressed Miss Lilian.\n“Oh, Syd!” she cried, as the door closed behind him, “isn’t it just thrilling! There never was such a mixed-up mystery. I do wonder which is the right Mr. Beck.”\n“Which! What in the world do you mean? I was dizzy enough without that. Of course they are both the right Mr. Beck, or the wrong Mr. Beck, whichever you please. They are both the same Mr. Beck anyhow.”\nMeanwhile Mr. Beck is driving as fast as a hansom can carry him back to Mr. Ophir’s, in Bond Street.\nHe found the eminent jeweller in his little glass citadel at the back of his glittering warehouse. A thrill of excitement disturbed his usual stately dignity.\n“Well?” he said, when Mr. Beck stepped into the little glass room, closing the door carefully behind him.\n“Well,” responded the detective, “I think I have got a clue. I can make a fair guess who has the diamonds.”\n“Mr. Harcourt was rather a wild young man before this engagement,” said Mr. Ophir, smiling an embarrassed tentative smile.\n“Who made the new case for you?” said Mr. Beck, changing the subject with unceremonious abruptness.\n“Hem—ah—Mr. Smithson, one of the most competent and reliable men in the trade. He has done all our work for the last twenty years. It was a very finely finished case indeed.”\n“Who brought it here?”\n“One of Mr. Smithson’s workmen.”\n“I think you told me this man saw you put the diamonds into the case, and seal them up for Mr. Harcourt?”\n“Yes. He was standing only a few yards off at the time. There were two of my own men standing close by also, if you would care to examine them. Brown, will you kindly tell Mr. Carton and Mr. Cuison to step this way for a moment?”\n“Never mind,” said Mr. Beck, with sharp authority in his voice. “Thank you, Mr. Ophir, I don’t want to see them just yet. But I will trouble you for Mr. Smithson’s address, if you please. I have an idea his man would be useful, if we could lay our hands on him.”\n“I don’t think so, Mr. Beck; I don’t think so at all. He was quite a common person. My own men will be much more satisfactory witnesses. Besides, you may have some trouble in finding him. Though of that, of course, I know nothing whatever.”\nThe detective looked at him curiously for a moment. He had grown quite flushed and excited.\n“Many thanks for your advice, Mr. Ophir,” he said quietly; “but I think I will take my own way, if you please.”\nTwenty minutes afterwards the indefatigable Mr. Beck was at Mr. Smithson’s workshop cross-examining the proprietor; but nothing came of it. The man who brought the case to Mr. Ophir’s establishment was the man who made it. He was the best workman that Mr. Smithson ever had, though he only had him for ten days. His name was Mulligan. It sounded Irish, Mr. Smithson imagined, and he spoke like the man in Mr. Boucicault’s play The Shaughraun. But whether he was Irish or Dutch, he was a right good workman. Of that Mr. Smithson was quite certain. He seemed hard up, and offered himself for very moderate wages. But before he was half an hour in the place he showed what he could do. So when the order came in for a case for the Harcourt diamonds Mr. Smithson set him on the job. He worked all day, took the case home with him, and brought it back the next morning, finished.\n“I never saw a job done so well or so quick before,” concluded Mr. Smithson out of breath.\n“But how did he manage at home. You surely did not let him take the diamonds home with him?\n“Bless you,” cried Mr. Smithson briskly, with a look of surprise at the great detective’s innocent, imperturbable face, “he never saw the diamonds, and never will.”\n“Then how did he make the case to fit them?”\n“We had a model—the old case.”\n“Have you got it still?”\nFor the first time there was a gleam of interest on Mr. Beck’s face as he asked the question.\n“Yes, I think it is somewhere about. Excuse me for a moment.”\nHe returned with a rubbed and faded jewel-case covered with what had once been dark green morocco. Inside, the white velvet had grown yellow with age.\n“That was our model, Mr. Beck. You see in the raised centre a place for the great star. The necklet ran round this slope.”\n“I see,” said Mr. Beck, and for a quiet man he managed to get a lot of meaning into those two simple words. Then, after a pause: “You can let me have this old case, I suppose?”\n“Certainly. Mr. Ophir’s instructions are sufficient.”\n“By the way, Mr. Smithson,” he said carelessly, “did Mr. Mulligan—I think you said that was his name—say anything about Mr. Ophir?”\n“Well, now, Mr. Beck, now that you mention it, he did. When he came first he asked me did I not do work for Mr. Ophir, and seemed anxious about it, I thought. He was very strong in his praise of Mr. Ophir. He said he thought he could get a recommendation from him if I wanted it, but I didn’t. His work was recommendation enough for me. That’s my way of doing business.”\nMr. Beck put the case in his coat tail pocket, and moved towards the door. He paused on the threshold.\n“Good-day, Mr. Smithson,” said Mr. Beck. “Mr. Mulligan did not turn up in the afternoon, I suppose?”\n“Now how did you guess that, Mr. Beck. He did not. I gave him something extra for the way the thing was done and I fear he may have been indulging. Irishmen do sometimes, you know, Mr. Beck. But how did you guess it?”\n“From something Mr. Ophir said to me,” replied Mr. Beck.\n“But he is coming back in the morning. I have promised him double wages. You see I took him as it were on trial first. He will be here at eight o’clock to-morrow. I can give you his address if you want him meanwhile.”\n“Thanks. I fear it would not be of much use to me. I fancy I will find him when I want him, perhaps before you do. Good-day again, Mr. Smithson. By the way, I would not advise you to count too securely on Mr. Mulligan’s return to-morrow morning.”\nMr. Beck had dismissed his hansom when he went into Mr. Smithson’s. He was only a few streets from the Strand, and he now walked very slowly in that direction, almost getting run over at the crossing between New Oxford Street and Tottenham Court Road, so absorbed was he in a brown study.\n“He’s my man,” he said to himself. “He must help whether he likes it or not. It won’t be the first time he has given me a lift, though never before in such a big thing as this. By George, he is a clever one! The devil himself is a dunce in comparison. What a success he would be if he had joined our profession, though I suppose he thinks he is better off as he is. I doubt it though. He would be the first detective of the century. Well, no one can say I’m jealous. If he helps me to unravel this business I’ll take care he gets his share of the credit.”\nMr. Beck laughed to himself as if he had made rather a good joke, and stopped abruptly as he glanced at a church clock.\n“Four o’clock,” he muttered. “How fast the day has gone by! Four is his hour, and I have no time to lose. I suppose I’ll find him at the old spot,” and he set off at a double-quick pace, five miles an hour at least, without appearance of effort, in the direction of Simpson’s restaurant in the Strand.\nJust a word about the man he was going to meet. M. Grabeau was at this time the cleverest and most popular drawing-room entertainer in London. He was a somewhat shy man, and could neither sing nor talk much in public. But for all that he was a veritable variety show in himself. He was a marvellous mimic and ventriloquist, a quick change artist, but above all and beyond all, a conjuror. He could manoeuvre a pack of cards as a captain his company. They were animated and intelligent beings in his hands, obedient to his word of command.\nIn the construction and manufacture of mechanical tricks and toys he was possessed of a skill and ingenuity almost beyond belief. He had himself devised and constructed, with Mr. Edison’s permission, a doll, with a phonograph in her interior, which imitated nature with almost absolute perfection, and sang “Home, Sweet Home,” not merely with the voice, but with the manner and gesture of one of the most popular singers on the concert stage. Indeed, there were malicious persons (rivals, for the most part) who insisted that the voice and gestures of the imitation singer were less wooden than the real.\nMr. Beck had met M. Grabeau at some of those social functions where the introduction of a detective, either as a footman or a musician, had been thought a prudent precaution, and the acquaintance between them had ripened into companionship, if not friendship. Mr. Beck’s profession had an intense attraction for the Frenchman, who knew all Gaboriau’s novels by heart.\n“They are so clevaire,” he would say, with much gesticulation, to the stolid Mr. Beck; “they are too clevaire. The tangle in the commencement is superb. But what you call the unravel is not so good; the knots do not come undone so——”\nThen he would hold up a string tied in a very kink of hard knots, and show it a moment later clean and smooth. It was one of his tricks.\n“But the life of the detective, the real detective you will observe, it is charming. It is beyond the hunt of the fox. It is the hunt of the man. The clevaire man who runs, and what you call doubles, and hides and fights too, sometime. It is glorious; it is life.”\n“Going to waste,” Mr. Beck would mutter disconsolately after one of these interviews, when the Frenchman would spy out and pick up an almost invisible clue. “Going to waste. He would make one of the best detectives in the service, and he fiddles away his time at play-acting and trinket-selling and money-making.” So Mr. Beck would shake his head over this melancholy instance of misplaced genius.\nNaturally, when Mr. Beck got tangled over the vanishing diamond puzzle, he was anxious to consult his friend, M. Grabeau.\n“I hope he’s here,” said Mr. Beck to himself, as he entered Simpson’s restaurant.\nOne look round relieved his mind on that score. M. Grabeau was there at his accustomed place at a corner table, at his accustomed dinner—a plate of roast beef underdone. For M. Grabeau affected English dishes and English cookery, and liked the honest, substantial fare of Simpson’s.\nA stout, good-humoured man was M. Grabeau, with a quick eye, a close-cropped, shiny black head, blue eyes, and a smooth, cream-coloured face.\nHe noticed Mr. Beck the moment he entered the room, and put down the pale green evening paper on which a moment before he was intent.\n“Hullo!” he cried out pleasantly, “that is you? Bonsoir, Monsieur Beck. I hope that you carry yourself well?”\nIt was noticeable about M. Grabeau, that though he could mimic any voice perfectly, when he spoke as M. Grabeau he spoke with a strong French accent, and interlarded his sentences with scraps of French.\nMr. Beck nodded, hung up his hat, and seated himself at the opposite side of the table.\n“Boiled mutton,” he said to the waiter, “and a pint of stout.”\n“The fact is, monsieur,” he went on in much the same tone, when the waiter whisked away to execute his order, “I wanted to have a word with you.”\n“Ah-hah! I know,” said the other vivaciously. “It’s the Harcourt diamonds that have come to you, is it not? The wonderful diamonds of which one talked all the evening at the Harcourt reception. They have disappeared, and his lordship has employed M. Beck, de great detective. I thought you would come to me. It’s all here,” and he handed him across the table the Westminster, with his finger on a prominent paragraph headed in big, black letters:—\n“THE VANISHING DIAMONDS.”\nMr. Beck read it through carefully.\nQuite a sensation has been created in fashionable London by the sudden disappearance—it would perhaps be premature to say robbery—of the famous “Harcourt Heirloom,” perhaps, after the Crown Jewels, the most famous and valuable diamonds in London. Our representative learned from the eminent jeweller, Mr. Ophir, of Bond Street, that he had with his own hands this morning put the jewels into a case, sealed up the parcel and handed it to the Hon. Mr. Sydney Harcourt. Mr. Harcourt, on the other hand, states that when the case was opened in his presence by his fiancée, Miss Ray—for whom the jewels were meant as a wedding present—it was empty. If Mr. Ophir and the Hon. Sydney Harcourt both speak the truth—and we have no reason to doubt either, or both—the diamonds must have vanished through the case and brown paper in the hansom cab en route between Bond Street and Upper Belgrave Street. We need not say that in position and respectability Mr. Ophir stands at the very head of his business, and the Hon. Sydney Harcourt, though he ran loose for a while on the racecourse, contracted no serious pecuniary obligations of which the world knows; and his rank, character, and position should protect him from even the smallest taint of suspicion. All these circumstances, of course, heighten the mystery. We understand that the famous detective, Mr. Beck, at the instance of Mr. Ophir, called later on at Upper Belgrave Street. He has a clue as a matter of course. A clue is one of those things that no well-regulated detective is ever without.\nM. Grabeau watched Mr. Beck eagerly, reading his face as he read the paper.\n“Well,” he asked impatiently, when Mr. Beck at length came to an end, “it is all right there?”\n“Pretty accurate for a newspaper reporter!”\n“And you have got the clue—you, the famous detective.”\nThere was sometimes the faintest suggestion of contempt, a vague hint at a sneer, in M. Grabeau’s tone as he talked to Mr. Beck, which Mr. Beck never appeared to resent or even notice in the least.\n“Well, yes, monsieur, I think I have a bit of a clue. But I came to hear your notion of the business. I have an idea that you are the man to put me on the right track. It would not be the first time, you know.”\nMonsieur beamed at the rough compliment. “You must first tell me all—everything.”\nMr. Beck told him all—everything—with admirable candour, not forgetting the doubling of his own character at Belgrave Street.\n“Well,” he said at last, “what do you think, monsieur?”\n“M. Ophir,” said M. Grabeau shortly, and closed his mouth sharply with a snap like a trap.\n“No,” cried Mr. Beck, in a tone of surprise and admiration. “You don’t say so! You don’t think then there is any truth in the hint in the paper that young Harcourt himself made away with the stones to pay some gambling debts?”\n“No, my friend, believe me. He of them knows nothing more than he has said. It was not what you call the worth of his while. His father, he is rich; his lady, she is beautiful. I have seen her. Respectable Mr. Ophir gives to him the jewels. The risk is too great, even if he have debts, which is not proved.”\n“But how did Mr. Ophir get them out of the case?”\n“He did not ever put them in, my friend.”\n“I thought I told you that three people saw him put them in—two of his own men and the messenger, a Mr. Mulligan, who came from the case-maker.”\n“That messenger—you have seen him then?”\n“Well no. He had not come back to his place of employment when I called.”\n“And he will never come. He has vanished. M. Ophir perhaps could tell where he has vanished, but he will not tell you, believe it well.”\n“But the other two men saw the jewels packed. There were two others besides the messenger.”\n“Hélas! my great detective, are you not a little—I will not say stupid—a Little innocent to-day? You will not think harm of M. Ophir. Très bien. But that which you object, it is so simple. Give me for a moment your watch and chain.”\nHe leant across the table, and as if by magic Mr. Beck’s watch and chain was clean in his hands. A heavy gold watch with a heavy gold curb chain that fitted to the waistcoat buttonhole with a gold bar.\n“Now observe; this will be our case.” With rapid, dexterous fingers he fashioned the copy of the Westminster Gazette into the semblance of a jewel-case with a closely fitting lid. He opened the box wide, put the watch and chain in, so that Mr. Beck could see it plainly inside, and closed the lid with two fingers only.\n“There was no deception.”\nHe pushed the box across the tablecloth to Mr. Beck, who opened it and found it empty. The wide eyes and bland smile of the detective expressed his astonishment.\n“But where has it gone to?” he cried.\n“Behold, it is there,” said M. Grabeau, tapping him on the capacious waistcoat.\nThe watch was comfortably back in Mr. Beck’s waistcoat pocket, for which, by the way, it was a pretty tight fit, and the gold bar of the chain was again securely fastened in his waistcoat buttonhole.\n“I could have sworn I saw you put it into the case and leave it there.”\n“Eh bien! So could the men of this M. Ophir of whom you speak. I put it in your pocket, he put it in his own. Behold all the difference. His plan was, oh! so much easier.”\n“But, monsieur, M. Ophir has the name of a most decent and respectable man.”\nM. Grabeau snapped his fingers in contemptuous anger. “This man,” he said, “I know him, I have had what you call shufflings—dealings—with him. He is cold, but he is cunning. He called me—me, Alphonse Grabeau, one cheat. Now I, Alphonse Grabeau, call him, M. Ophir, one thief, and I will prove it. He has stolen the diamonds. I will help you, my friend, to run him up.”\n“I am much obliged, monsieur. I rather thought from the first you could give me a lift in this case. Where can I see you to-morrow if I have anything to say to you?”\n“I will be in my leetle establishment until two hours of the afternoon. At four I will be here at my dinner. In the evening Iwill be in the saloon of the Duke of Doubleditch. At any time I will be glad to talk to you of this case—of this M. Ophir, the thief. But you must be punctual, for I am a man of the minute.”\n“Quite sure you are going to the Duke’s in the evening?”\n“It is equally certain as a musket.”\n“Oh, very well, if I don’t see you at the shop I will see you at dinner.”\nM. Grabeau drained the last drops of his glass of whisky and water cold, picked up his cane and hat and gloves, took a cigarette from his neat little silver case, and stuck it in his mouth unlighted.\nMr. Beck rose at the same moment.\n“Good evening, monsieur,” he said admiringly, “I must shake hands with you if it was to be the last time. I always thought you were almighty clever, but I never rightly knew how clever you are until to-night. It is a thundering pity that——”\n“What?” asked M. Grabeau sharply, for Mr. Beck paused in the very middle of his sentence.\n“That—that you are not one of us; that your talents didn’t get fair play and full scope in the right direction.”\nM. Grabeau beamed at the compliment, and went out beaming.\nMr. Beck called for a second helping of boiled mutton, and ate it slowly. His face and manner were more vacuous than ever.\nSomething of special importance must plainly have detained Mr. Beck, for it was a quarter past two next day when he walked with a quick, slinging step up to the “leetle establishment” of M. Grabeau, in Wardour Street. He paused for one moment before the window where all sorts of ingenious and precious knick-knacks and trifles were temptingly arranged, then walked into the shop.\nThere was a young man of about nineteen years alone behind the counter; a young man with a long nose, very fleshy at the top, and an unwholesome complexion, and a pair of beady black eyes of preternatural brightness.\n“Good-day, Jacob,” said Mr. Beck. “Master out?”\n“Just gone a quarter of an hour ago.”\n“Coming back?”\n“Not this evening.”\n“Oh, well, I’ll see him later on. By the way, Jacob, that’s a new thing you have got. The coral necklet and brooch there in the window. Will you let me have a peep at it?”\nJacob took the case from the window and set it on the counter. The set was a fine specimen of carved coral linked with fine gold, in a case of faded brown morocco and dingy white velvet that looked as old as themselves.\nMr. Beck inspected the trinkets carefully for full five minutes with intent admiration, turning the case round several times to get a better view. He seemed much interested in a smear of what looked like damp gum on the edge of the leather.\n“What’s, the damage, Jacob?” he asked at last.\n“Not for sale, sir. Master cautioned me four different times—not for sale, no matter what price I might be offered. Not likely to be tempted much, I should say; there is not half a sovereign’s worth of gold in the lot.”\n“Ah!” said Mr. Beck meditatively. Then persuasively: “Well, it is not so much the red affairs I want as the box they are in. My aunt desired me to get her one for a brooch and necklace she picked up cheap at a sale, and this would about do. You were not forbidden to sell the box, were you, Jacob? It doesn’t seem to fit these things as if it were made for them, does it?”\n“It fits them most beautifully, Mr. Beck. But there, don’t go. I don’t say I won’t sell it to oblige a friend of the master, if I get a fair price for it.”\n“What do you call a fair price?”\n“What would you say to a sovereign now?”\nMr. Beck said nothing to a sovereign. He said nothing at all. But he produced the coin in question from his waistcoat pocket and placed it on the counter, turned the contents of the case out in a jingling heap, put the case itself in his pocket, and walked out of the shop.\nThe smart-looking assistant gazed blankly at the stout figure moving rapidly down the street.\n“Holy Moses!” he exclaimed, his triumph tinged with disappointment, “I am sorry I didn’t ask more. He’d ha’ given thirty bob like winking for the old case, and a misfit at that. The Gov. can make a new one in an hour. He’ll be pleased, anyhow.”\nWhether the “Gov.” would be pleased or not was a matter of which the sharp-looking shopboy was (perhaps) the best judge. But somebody else was plainly well pleased. Mr. Beck’s placid face wore a look of innocent contentment. He whistled softly to himself as he walked, and presented all the outward and visible signs of a respectable tradesman whose week’s takings had been well above the average. Mr. Beck let himself in with a latchkey, and walked noiselessly upstairs to his own pretty little sitting-room on the drawing-room floor. He took the old case from his pocket and set it beside another old case—the one he got from Mr. Smithson—on the round table in the centre of the room. There were flowers on the table, and Mr. Beck sniffed their fragrance approvingly; he seemed on this particular afternoon to be pleased with everything.\nThe two cases were alike, though not identical in form; he opened them. Inside the shape was almost precisely the same. Mr. Beck gave a short assenting nod at them, as if he was nodding approval of something he had just said himself. Then he walked to the door, closed it softly, and turned the key in the lock. Any one with an eye to the keyhole—such an eye as Sam Weller graphically described in the witness-box—might have seen Mr. Beck drop into an easy-chair with one of the two cases in his hand, turning it slowly round and round with that look, puzzled yet confident, which so many people wore when that delightful problem “Pigs in Clover” was the rage.\nA little later any one with an ear to the keyhole might have heard Mr. Beck draw a deep breath of relief, and chuckle quietly to himself; then, if the ear was preternaturally acute, might have heard him lock something in his own pet patent safe which stood in a neat overcoat of mahogany in a corner of the room.\n* * *\n“Oh! how can people be so mean?” cried Lilian Ray, in a voice that quivered with indignation.\nShe was standing in the middle of her own drawing-room, and the tattered fragments of the “extra special” edition of the Evening Talebearer fluttered round her like a pink snowstorm. She stamped on the bits of paper with angry little feet.\n“Easy, Lil, easy!” cried Harcourt from the sofa where he sat, a gloomy look on his handsome face. “Take it quietly, my pet. It’s the nature of the beasts. Besides it’s true enough—most of it. I have been as they say, ‘a wild young scamp.’ ‘No one knows the amount of my debts’—because there aren’t any. ‘Mr. Ophir is a gentleman of unimpeachable respectability.’ ‘This is a most unpleasant mystery for the Hon. Sydney Harcourt.’ There’s no denying that’s true, anyway.”\n“I wonder at you, Syd—you, a great strong man, to sit there quietly and hear such things said!” She turned on him sharply, her blue eyes very bright behind the unshed tears.\n“But I haven’t heard them, Lil.”\n“Oh, well, you know what I mean. Why don’t you stamp this thing out, and teach those vile slanderers a lesson they would never forget? Why don’t you go straight to their low den, wherever it is, and—and—oh, how I wish I was a man, for their sake!”\n“Glad you’re not, Lil, for my sake,” he answered, in a tone that brought the quick blood to her cheek. “It’s because you are a woman, and the dearest little woman in the world, that you flare up like this. But you must not think I’m not riled by the half-lies of those cads, though I try to grin and bear it. There are lots of people will take the lies for gospel truth. I’m so thankful that you——”\n“Is it me? How dare you dream of such a thing, sir? The notion that I’d——”\nShe ran to him impetuously, and played with his curls as she bent caressingly over him. “My poor boy, I am so sorry to see you worried. If there was anything in the world that I could do! Now, now, don’t take an unfair advantage because I was good to you. I would much rather sit on the sofa, please.”\nA sharp knock came to the door, and Lilian was certainly sitting on the sofa, and at the extreme end of it, panting a little, when the footman entered.\n“Mr. Beck, sir,” said the footman.\n“Show him up. ‘What does the fellow want now, I wonder?”\n“I won’t detain you a moment, Mr. Harcourt,” said the imperturbable Mr. Beck, walking quietly into the room.\n“Oh, I beg your pardon, Mr. Beck,” stammered Harcourt, “I did not know; that is to say, I was engaged.”\n“So I see, sir,” said Mr. Beck drily, with a look at Lilian that sent the blood in a sudden flame to her cheek. “But I think the young lady will spare a moment or two from other business for what I have to say and to show.”\n“You have got a clue, then?”\n“Well, yes, I think I may say I have got a clue.”\nHe took from his coat-tail pocket the old jewel-case which he had purchased for a sovereign, and set it on the table, pushing aside some costly trifles to make place for it, in the full gleam of the electric light.\n“You see this, miss. Is it at all like the case that came with the diamonds?”\n“The case that came without the diamonds you mean, Mr. Beck,” said Lilian smiling. “It is just like it in shape, but the other was quite new and shining.”\n“That is a detail, miss. A clever hand could make that little change of new to old in half an hour. Now will you kindly open it?”\nAs Lilian opened it she thrilled with the sudden unreasonable notion that the diamonds might be inside. But it was quite empty; faded and empty.\n“The inside is just the same, too,” she said, “only this is so faded. Anything else, Mr. Beck?”\n“Would you oblige me by taking the case in your hands for one moment. No, don’t close it. Now will you kindly put your thumb here, and your other thumb here on the opposite side?”\nMr. Beck guided the slender little thumbs to their places while Harcourt looked on in amazement.\n“Now, miss, kindly squeeze both together.”\nLilian gave a quick, sharp gasp of delight and surprise. For suddenly, as if by magic, there blazed on the slope of faded velvet a great circle of flashing diamonds with a star of surpassing splendour in the centre.\n“Oh! oh! oh!” she cried breathlessly. “They are too beautiful for any one. Oh, Syd,” turning to her lover with eyes brighter than the jewels, “did you ever see anything so beautiful? They dazzle my eyes and my mind together. I cannot look at them any longer,” and she closed the case with a snap, and turning to the placid detective: “Oh, how clever you were to find them, Mr. Beck; wasn’t he, Syd? Do tell us how and where and when you managed?”\nShe so bubbled over with delight and admiration and gratitude that even the detective was captivated. He beamed like a full moon and bowed with the easy grace of a grizzly bear.",
      "metadata": {
        "original_metadata": {
          "story_code": "PB01",
          "story_title": "The Vanishing Diamonds",
          "author_name": "Unknown",
          "author_code": "MMB",
          "plot_summary": "When a man brings home priceless diamonds for his wife, he is shocked to see the case empty! The trusted jeweler obviously could not have stolen this prized possession, so who is to blame? Does it have anything to do with the detective appearing twice in a row? ",
          "text_length": 48200,
          "is_solvable": true,
          "story_annotations": {
            "Story Code": "PB01",
            "Annotator #1 Code": "WW",
            "Annotator #2 Code": "CC",
            "Story Title": "The Vanishing Diamonds",
            "Plot Summary": "When a man brings home priceless diamonds for his wife, he is shocked to see the case empty! The trusted jeweler obviously could not have stolen this prized possession, so who is to blame? Does it have anything to do with the detective appearing twice in a row? ",
            "Content warnings": "",
            "Author Code": "MMB",
            "Second author code (if applicable)": "",
            "Investigation-reveal order": "Standard",
            "Reveal border sentence": "“Will you open the case again, miss,” was all he said. She raised the lid and was struck dumb with blank amazement.",
            "Name of Detective #1": "Paul Beck",
            "Detective #1 Gender": "Male",
            "Detective #1 Role": "Independent amateur",
            "Name of Detective #2": "",
            "Detective #2 Gender": "",
            "Detective #2 Role": "",
            "Number of detectives if more than 2": "",
            "Name of Assistant #1": "",
            "Assistant #1 Gender": "",
            "Assistant #1 Role": "",
            "Name of Assistant #2": "",
            "Assistant #2 Gender": "",
            "Assistant #2 Role": "",
            "Number of assistants if more than 2": "",
            "Number of victims of gender Male": "1",
            "Number of victims of gender Female": "1",
            "Number of victims of gender Non-binary": "0",
            "Number of victims of gender Unknown": "0",
            "Number of victims who are corporate entities": "0",
            "Number of culprits of gender Male": "1",
            "Number of culprits of gender Female": "0",
            "Number of culprits of gender Non-binary": "0",
            "Number of culprits of gender Unknown": "0",
            "Culprits introduced during reveal?": "No",
            "Main culprit independence": "Acts alone",
            "Initiator of investigation": "A private client",
            "Role of police": "Police are not present",
            "Focus on crime or quasi-crime": "Crime",
            "Crime trajectory": "Qrime → same qrime",
            "Occurrence of crime or mystery": "Before the investigation",
            "Types of qrimes": "Theft, Fraud",
            "Motives": "Greed",
            "Means (murder only)": "",
            "Sufficient clues to guess?": "Yes",
            "Sufficient clues to solve?": "Yes",
            "Correct annotator guess?": "No",
            "Types of clues": "Legible but not usable (legible → not usable), Usable in real time (usable → usable), Usable only in retrospect (legible → usable)",
            "Essential clue": "The jewelry box being stolen by the false Paul Beck",
            "Type of essential clue": "Testimonial clue",
            "Most salient clue": "M. Grabeau's skill for imitation and his familiarity with Paul Beck.",
            "Type of most salient clue": "Testimonial clue",
            "Red herring description": "",
            "Type of red herring": "",
            "Presence of planted or fabricated evidence": "",
            "Types of evidence made available": "Testimonial evidence, Physical evidence",
            "Is the crime solved?": "Yes",
            "Decision NOT to alert authorities?": "No",
            "Satisfying narrative account?": "Yes",
            "How satisfying as detective fiction?": "3",
            "Recommend to friend?": "No",
            "Date of First Publication (YYYY-MM-DD)": "1898",
            "Format of First Publication (Journal or Book)": "Book",
            "Name of Journal or Title of Book": "Paul Beck, The Rule of Thumb Detectiv"
          }
        },
        "culprit(s), human annotated": "",
        "accomplice(s), human annotated": "",
        "detection": {
          "prompt": "System: You are an ingenious and clever detective who will examine all the clues and reason through all the evidence to solve the crime.\n\nUser: Here is a detective story. Please read the story carefully before you decide who the culprit is.\n\n\nSHE was as bright as a butterfly in a flower garden, and as restless, quivering down to her finger-tips with impatient excitement. That big room in the big house in Upper Belgrave Street was no bad notion of the flower garden.\nThere were just a few square yards of clear space where she sat alone—on a couch made for two—patting the soft carpet with a restless little foot. The rest of the room was filled with long tables, and oval tables, and round tables, all crowded with the pretty trifles and trinkets that ladies love. It seemed as if half a dozen of the smartest jewellers and fancy shops of Regent Street had emptied their show windows into the room. The tables were all aglow with the gleam of gold and silver and the glitter of jewels, and the bright tints of rich silk and painted fans, and rare and dainty porcelain.\nFor Lilian Ray was to marry Sydney Harcourt in a week, and there was not a more popular couple in London. Her sweet face and winning ways had taken the heart of society by storm; and all the world knew that warm-hearted, hot-headed Harcourt was going hop, step, and jump to the devil when she caught and held him. So everybody was pleased, and said it was a perfect match, and for the last three weeks the wedding presents came pouring into the big house in Upper Belgrave Street, and flooded the front drawing-room. Lilian was impatient, but it was the impatience of delight, the trouble of the crumpled rose-leaf that helps to keep one’s enjoyment awake.\nNo wonder she was excited, for her lover was coming, and with him were coming the famous Harcourt diamonds, which had been the delight and admiration and envy of fashionable London for half a century. The jewels had gone from the bank, where they had lain in darkness and safety for a dozen years, to the glittering shop of Mr. Ophir, of Bond Street. For the setting was very old, and the vigilance of the tiny silver points that guarded the priceless morsels of bright stone had to be looked to, and a brand-new case was ordered to set the precious sparklers off to the best advantage.\nA sudden knock at the door starts her again to the window, the cobweb silk flying behind. But she turns away petulantly like a spoiled child.\n“Only another travelling bag,” she says; “that makes seven—two with gold fittings. I wonder if this has gold fittings. I have set them all there in a row with their mouths open, and their gold or silver teeth grinning. There is not room for another one. I wonder do people think that——”\nThe sentence was never finished, for at this moment a hansom cab came sharply round the corner in full view of the window. She caught one glimpse of an eager, young face and a flat parcel, then she dropped back into her couch, panting a little. There came a second knock, and a foot on the stairs mounting four steps at a spring. She heard it, and knew it, but sat quite still. Another moment and he was in the room. Her eyes welcomed him, though her lips still pouted.\n“You are ten minutes before your time, sir,” she said, “and I am terribly busy. What have you got there?”\n“Oh! you little sly boots. You know you have been longing for me and the diamonds, especially the diamonds, for the last hour. I’ve a great mind to carry them off again.”\nHe dropped into the seat beside her and his right arm stole round her waist, while he held the jewel-case away in his left hand. She blushed and laughed, and slipping from his encircling arm, made a dash for the diamonds. But he was too quick for her. He leaped to his feet and held the case aloft, eight feet in the air. Straining to the utmost of her tip-toes she could just reach one hand to his elbow; she placed the other amongst his brown curls, making ready for a leap. Her face was close to his and quite undefended. What happened was, under the circumstances, inevitable.\n“Oh!” she exclaimed, in quite a natural tone of surprise, “how dare you, sir!”\n“Payment in advance,” he retorted, as the precious case came down to her desiring hands; “over-payment, I confess, but then I am ready to give change to any amount.”\nBut she fled from him, with her treasure, to the couch. “Now do be sensible for one short moment, if you can, and hand me the scissors out of that lady’s companion there beside the photograph frame on the table.”\nThe jewel-case was done up in whitey-brown paper with strong cord and sealed with broad patches of red sealing-wax. Quite excitedly she cut through the string, leaving the seals unbroken, and let paper and twine and wax go down in a heap on the carpet together.\nThere emerged from the inner wrapping of soft, white tissue-paper the jewel-case in its new coat of light brown morocco with the monogram L. H. in neat gold letters on it. She gave a little cry of pleasure as her eyes fell on the lettering which proclaimed the jewels her very own, and he, sitting close beside, watching lovingly as one watches a pretty child at play, made believe to snatch it from her fingers. But she held it tight. Like a bather on the water’s brim, she paused for one tantalising moment, drew a deep breath to make ready for the coming cry of rapture, and opened the case.\nIt was empty!\nThe slope of the raised centre of violet velvet was just ruffled a little, like a bed that had been slept in. That was all.\nShe looked suddenly in his eyes, half amused, half accusingly, for she thought he had played her some trick. His face was grave and startled.\n“What does it mean, Syd? are you playing with me?”\nBut she knew from his face he was quite serious even while she asked.\n“I cannot make it out, Lil,” he said, in an altered voice. “I cannot make it out at all. I brought the case just as it was from Mr. Ophir’s. He told me he had put the diamonds in and sealed it up with his own hands. See, you have not even broken the seals,” and he mechanically picked up the litter of paper and twine from the floor. “No one touched it since except myself and you, and the diamonds are gone. Old Ophir would no more dream of playing such a trick than an archbishop. Still it must be either that or—— But that is too absurd. He’s as respectable as the Bank of England and nearly as rich. It beats me, Lily. Why, the old boy warned me as he gave me the precious parcel. ‘We cannot be too careful, Mr. Harcourt,’ he said. ‘There is twenty thousand pounds in that little parcel, let no hand touch it except your own.’ And I did not, of course; yet the diamonds have vanished, through case and paper and seals, into space.”\nHe stared ruefully at the expanse of violet velvet.\n“The first thing is to see Mr. Ophir,” he said.\n“Oh, don’t leave me, Syd.”\n“Well, to write to him then. There must be some ridiculous mistake somewhere. Perhaps he gave me the wrong case. He would never—— No, that’s too absurd. Perhaps some one substituted the empty case when he looked aside for a moment. It may be necessary to employ a detective. I’ll tell him so at once. Can I write a line anywhere?”\n“There are half a dozen writing-cases there in a row on that table.”\nShe sat him down to a pretty mother-of-pearl and tortoise-shell affair, with violet scented ink in the silver-mounted bottles.\nThen Harcourt showed a quick impatience, quite unlike his usual sunny manner, which Lilian thought nothing could disturb.\n“Do get a fellow some decent ink, Lil,” he said pettishly. “I cannot write to an old don like Ophir with this stuff.”\nShe slipped from the room like a shadow and was back again almost in a moment. When she returned she found him on the couch nervously fingering the fragments of paper, twine, and sealing-wax.\n“I cannot make it out at all,” he muttered. “They seem to have vanished into thin air. However, old Ophir will be able to help us if any one can.”\nHe growled a bit at the dainty feminine pen and paper and began:—\n“DEAR MR. OPHIR,—A most extraordinary thing has happened. I took the case you gave me, as you gave it to me, straight to Miss Ray, Belgrave Street, and opened it without breaking the seals, by cutting the strings in her presence. The diamonds were gone. There must be some mistake somewhere. Perhaps you may be able to clear up the mystery. If you suspect dishonesty, engage a detective at once. The driver will wait for a reply.\n“Yours in haste,\n“SYDNEY HARCOURT.”\nHe ran downstairs himself to hail a cab to take the note. A smart hansom with a smart driver on the box was crawling up the street. He dashed across with sudden alacrity like a startled trout in a stream, when Harcourt raised his hand, almost taking the feet off a sturdy mendicant who was standing in front of the door dangerously near the kerbstone.\n“Here, my man. Take this to Mr. Ophir’s, in Bond Street. The address is on the envelope. Wait for an answer, double fare if you look sharp.”\nThe driver took the letter, touched his hat, and was off like a shot.\nHarcourt threw the grumbling beggar a shilling and slammed the door. If he had waited just one second he would have seen the beggar go off almost as quickly as the hansom and disappear round the corner.\n“Oh, Sydney, do cheer up a little,” pleaded Lily, transformed from tease to comforter; “they will come all right. If they don’t, I won’t mind in the least, and your father is too fond of you, and of me, I think, too, to be really angry. It wasn’t your fault, anyway.”\n“Well, you see how it is, Lil; the infernal things—I beg your pardon. Don’t mind me; I am terribly put out—you see, they were lost out of my hands. They were a mighty big prize for any one to get hold of, and I have been going the pace a bit before I met you, my darling, and many people think I have outrun the bailiff. So there is sure to be malicious whispering and tattling, and people may say—no, I cannot tell you what they may say, and what is more, I don’t care a—dash. You can never say or think or look anything but what’s kind, and I would not have a pucker in that pretty brow or a tear in your blue eyes for all the diamonds that ever came out of Golconda. The diamonds may go hang. ‘Here’s metal more attractive.’”\nWonderful is Love’s Lethe. In five minutes the diamonds had vanished from their memory as completely as they had vanished from the case. The sound and sight of a cab whirling to the door brought them suddenly back to the work-a-day world. A footman entered, bearing in the very centre of a silver salver a visiting card slightly soiled. Harcourt took it, and Lilian, peering over his shoulder, read the inscription:—\n“MR. PAUL BECK,\nPrivate Detective.”\n“What is he like, Tomlinson?”\n“Stout party in grey, sir. Don’t seem particular bright.”\n“Well, show him up.”\n“Who can he be? What can he want?” muttered Harcourt to himself uneasily when the footman disappeared. “There was no time to get to Ophir and back, much less to find a detective. I cannot make it out.”\n“Oh, he came to the door like a whirlwind, and you know we never know how time goes when we are talking of——”\n“Mr. Paul Beck,” cried the discreet footman, opening the door with a flourish.\nMr. Paul Beck did not require much showing up apparently. He slipped furtively into the room, keeping his back as much as possible to the light as if secrecy had grown a habit with him. He was a stout, strongly built man in dark grey tweed, suggesting rather the notion of a respectable retired milkman than a detective. His face was ruddy, and fringed with reddish brown whiskers, and his light brown hair curled like a water dog’s. There was a chronic look of mild surprise in his wide-open blue eyes, and his smile was innocent as a child’s.\nJust as he entered Lilian thought she noticed one quick, keen glance at where the empty jewel-case lay on the table and the tangle of paper and twine under it. But before she could be sure the expression vanished from his eyes like a transparency when the light goes out.\nHarcourt knew the man by reputation as one of the cleverest detectives in London—a man who had puzzled out mysteries where even the famous Mr. Murdock Rose had failed—but looking at him now he could hardly believe the reputation deserved.\n“Mr. Beck,” he said, “will you take a chair? You come, I presume, about——”\n“About those diamonds,” said Mr. Beck abruptly, without making any motion to sit down. “I was fortunately with Mr. Ophir when your note came. He asked me to take charge of the case. Your cabman lost no time, and here I am.”\n“He told you the facts.”\n“Very briefly.”\n“And you think——”\n“I don’t think. I am quite sure I know where and how to lay my hand on the diamonds.”\nHe spoke confidently. Lilian thought she saw the trace of a smile on the innocent-looking mouth, and a futile attempt to wink one of the wide-open eyes.\n“I am delighted you think so,” said Harcourt; “I am exceedingly anxious about the matter. Did Mr. Ophir suggest——”\n“Nothing,” broke in Mr. Beck again. “I didn’t want his suggestions. Time is of importance, not talk. We are running on a hot scent; we must not give it time to cool. Is that the jewel-case?”\n“Yes,” said Harcourt, taking it up and opening it; “just as it came, empty.”\nMr. Beck abruptly closed it again and put it in his pocket.\n“That’s the paper and twine that was around it, I suppose?”\nHarcourt nodded. Mr. Beck picked it up carefully and put it in the other pocket.\n“You will observe,” said Harcourt, “that the seal is not broken. The string was cut by Miss Ray. But when——”\n“I must wish you good-day, Mr. Harcourt,” said the unceremonious detective. “Good-day, miss.”\n“Have you finished your investigations already?” said Harcourt in surprise. “Surely you cannot have already found a clue?”\n“I have found all I wanted and expected. I see my way pretty plainly to lay my hands on the thief. When I have more news to tell I’ll write. Good-day for the present.”\nHe was manifestly eager to be off on his mission. Almost before Harcourt could reply he was out of the room and down the stairs. He opened the door for himself, and the hansom which he had kept waiting whirled him away at headlong speed.\nHe had not disappeared five minutes down one side of the street when another hansom, driven at the same rapid pace, came tearing up the other. Lilian and Sydney had not got well over their surprise at his abrupt departure when a second knock came to the door, and Tomlinson entered again with a salver and a card—a clean one this time—\n“MR. PAUL BECK,\nPrivate Detective.”\nHarcourt started, and Lilian uttered a little cry, half surprise, half amusement at the sight of it.\n“The same man, Tomlinson?”\n“The same, sir; leastways he seems a very absentminded gentleman. ‘Any one been here for the last ten minutes?’ he said, breathless-like, when I opened the door. ‘You was, sir,’ I said, ‘not five minutes ago.’ ‘Oh, was I?’ says he, with a queer kind of a laugh, ‘that’s quick and no mistake. Am I here now?’ ‘Of course you are, sir,’ I said, looking at him hard, but he seemed no way in liquor; ‘there you are and there you stand.’ ‘Oh, I mean did I go away at all?’ ‘Fast as a hansom could carry you, sir,’ I said, humouring him, for he was as serious as a judge, and seemed quite put out to hear he had gone away in a hansom. ‘That’s bad, that’s bad,’ he said; ‘ten minutes late. Well, young man, there is no help for it. Take this card to Mr. Harcourt.’ Shall I show him up, sir?”\n“Of course.”\n“What can it mean?” cried Lilian. “Surely he cannot have found them in five minutes?”\n“Perhaps so,” said Harcourt. “He has probably found some clue, anyhow. His sober chaff of poor Tomlinson in the hall looks as if he were in good-humour about something. Gad, I didn’t think the old chap had so much fun in him!”\n“Mr. Paul Beck, sir.”\nThere was a slight, indescribable change in the manner of Mr. Beck as he now entered the room. He was less furtive and less abrupt in his movements, and he seemed no longer anxious, as before, to keep his back to the light.\n“You are back again very soon, Mr. Beck,” said Harcourt; “have you got a clue?”\n“I wish I had come five minutes sooner,” said Mr. Beck, his voice quite changed. “I’m afraid I have lost a clue. I have lost the clue, in fact, and I must set about finding it. Where is the jewel-case?”\n“Why, I gave it to you not ten minutes ago.”\n“To me?” began Mr. Beck, and then stopped himself with a queer smile that was half a grimace. “Oh yes, you gave it to me. Well, and what did I do with it?”\n“I don’t understand you in the very least.”\n“Well, you need not understand me. But you can answer me.”\n“Mr. Beck, you will excuse me, but this is no time for bad jokes, and I am in no humour for them.”\n“Mr. Harcourt, you will learn later on that the joke in this business is not of my making, and I hope to make the joker pay for it. Meanwhile, I come from Mr. Ophir.”\n“You said that before.”\n“Did I? Well, I say it again. I come from Mr. Ophir commissioned to find those diamonds, and I ask you, as civilly as may be, what has been done with the case?”\n“What you yourself have done with it?”\n“Well, what I myself have done with it, if you like.”\nHarcourt reddened with anger at this cool audacity, and Lilian suddenly interposed.\n“You put it in your pocket, Mr. Beck, and carried it away.”\n“Was I in a hurry, miss?”\n“You were in a great hurry.”\n“Was I dressed as I am now?”\n“Exactly.”\n“And looked the same?”\n“Precisely.”\n“Figure and face the same?”\n“Well, yes. I thought you were more made up than you are now.”\n“Made up! What do you mean, miss?”\n“Well, Mr. Beck, I thought you had been beautifying yourself. There was a trace of rouge on your cheeks.”\n“And I kept my back to the light, I warrant.”\n“Your memory is wonderful.”\nMr. Beck chuckled, and Harcourt broke in angrily—\n“Don’t you think we’ve had enough of this foolery, sir?”\n“More than enough,” said Mr. Beck calmly. “I have the honour to wish you a very good morning, Mr. Harcourt, and to you, miss.” There was a touch of admiration in his voice as he addressed Miss Lilian.\n“Oh, Syd!” she cried, as the door closed behind him, “isn’t it just thrilling! There never was such a mixed-up mystery. I do wonder which is the right Mr. Beck.”\n“Which! What in the world do you mean? I was dizzy enough without that. Of course they are both the right Mr. Beck, or the wrong Mr. Beck, whichever you please. They are both the same Mr. Beck anyhow.”\nMeanwhile Mr. Beck is driving as fast as a hansom can carry him back to Mr. Ophir’s, in Bond Street.\nHe found the eminent jeweller in his little glass citadel at the back of his glittering warehouse. A thrill of excitement disturbed his usual stately dignity.\n“Well?” he said, when Mr. Beck stepped into the little glass room, closing the door carefully behind him.\n“Well,” responded the detective, “I think I have got a clue. I can make a fair guess who has the diamonds.”\n“Mr. Harcourt was rather a wild young man before this engagement,” said Mr. Ophir, smiling an embarrassed tentative smile.\n“Who made the new case for you?” said Mr. Beck, changing the subject with unceremonious abruptness.\n“Hem—ah—Mr. Smithson, one of the most competent and reliable men in the trade. He has done all our work for the last twenty years. It was a very finely finished case indeed.”\n“Who brought it here?”\n“One of Mr. Smithson’s workmen.”\n“I think you told me this man saw you put the diamonds into the case, and seal them up for Mr. Harcourt?”\n“Yes. He was standing only a few yards off at the time. There were two of my own men standing close by also, if you would care to examine them. Brown, will you kindly tell Mr. Carton and Mr. Cuison to step this way for a moment?”\n“Never mind,” said Mr. Beck, with sharp authority in his voice. “Thank you, Mr. Ophir, I don’t want to see them just yet. But I will trouble you for Mr. Smithson’s address, if you please. I have an idea his man would be useful, if we could lay our hands on him.”\n“I don’t think so, Mr. Beck; I don’t think so at all. He was quite a common person. My own men will be much more satisfactory witnesses. Besides, you may have some trouble in finding him. Though of that, of course, I know nothing whatever.”\nThe detective looked at him curiously for a moment. He had grown quite flushed and excited.\n“Many thanks for your advice, Mr. Ophir,” he said quietly; “but I think I will take my own way, if you please.”\nTwenty minutes afterwards the indefatigable Mr. Beck was at Mr. Smithson’s workshop cross-examining the proprietor; but nothing came of it. The man who brought the case to Mr. Ophir’s establishment was the man who made it. He was the best workman that Mr. Smithson ever had, though he only had him for ten days. His name was Mulligan. It sounded Irish, Mr. Smithson imagined, and he spoke like the man in Mr. Boucicault’s play The Shaughraun. But whether he was Irish or Dutch, he was a right good workman. Of that Mr. Smithson was quite certain. He seemed hard up, and offered himself for very moderate wages. But before he was half an hour in the place he showed what he could do. So when the order came in for a case for the Harcourt diamonds Mr. Smithson set him on the job. He worked all day, took the case home with him, and brought it back the next morning, finished.\n“I never saw a job done so well or so quick before,” concluded Mr. Smithson out of breath.\n“But how did he manage at home. You surely did not let him take the diamonds home with him?\n“Bless you,” cried Mr. Smithson briskly, with a look of surprise at the great detective’s innocent, imperturbable face, “he never saw the diamonds, and never will.”\n“Then how did he make the case to fit them?”\n“We had a model—the old case.”\n“Have you got it still?”\nFor the first time there was a gleam of interest on Mr. Beck’s face as he asked the question.\n“Yes, I think it is somewhere about. Excuse me for a moment.”\nHe returned with a rubbed and faded jewel-case covered with what had once been dark green morocco. Inside, the white velvet had grown yellow with age.\n“That was our model, Mr. Beck. You see in the raised centre a place for the great star. The necklet ran round this slope.”\n“I see,” said Mr. Beck, and for a quiet man he managed to get a lot of meaning into those two simple words. Then, after a pause: “You can let me have this old case, I suppose?”\n“Certainly. Mr. Ophir’s instructions are sufficient.”\n“By the way, Mr. Smithson,” he said carelessly, “did Mr. Mulligan—I think you said that was his name—say anything about Mr. Ophir?”\n“Well, now, Mr. Beck, now that you mention it, he did. When he came first he asked me did I not do work for Mr. Ophir, and seemed anxious about it, I thought. He was very strong in his praise of Mr. Ophir. He said he thought he could get a recommendation from him if I wanted it, but I didn’t. His work was recommendation enough for me. That’s my way of doing business.”\nMr. Beck put the case in his coat tail pocket, and moved towards the door. He paused on the threshold.\n“Good-day, Mr. Smithson,” said Mr. Beck. “Mr. Mulligan did not turn up in the afternoon, I suppose?”\n“Now how did you guess that, Mr. Beck. He did not. I gave him something extra for the way the thing was done and I fear he may have been indulging. Irishmen do sometimes, you know, Mr. Beck. But how did you guess it?”\n“From something Mr. Ophir said to me,” replied Mr. Beck.\n“But he is coming back in the morning. I have promised him double wages. You see I took him as it were on trial first. He will be here at eight o’clock to-morrow. I can give you his address if you want him meanwhile.”\n“Thanks. I fear it would not be of much use to me. I fancy I will find him when I want him, perhaps before you do. Good-day again, Mr. Smithson. By the way, I would not advise you to count too securely on Mr. Mulligan’s return to-morrow morning.”\nMr. Beck had dismissed his hansom when he went into Mr. Smithson’s. He was only a few streets from the Strand, and he now walked very slowly in that direction, almost getting run over at the crossing between New Oxford Street and Tottenham Court Road, so absorbed was he in a brown study.\n“He’s my man,” he said to himself. “He must help whether he likes it or not. It won’t be the first time he has given me a lift, though never before in such a big thing as this. By George, he is a clever one! The devil himself is a dunce in comparison. What a success he would be if he had joined our profession, though I suppose he thinks he is better off as he is. I doubt it though. He would be the first detective of the century. Well, no one can say I’m jealous. If he helps me to unravel this business I’ll take care he gets his share of the credit.”\nMr. Beck laughed to himself as if he had made rather a good joke, and stopped abruptly as he glanced at a church clock.\n“Four o’clock,” he muttered. “How fast the day has gone by! Four is his hour, and I have no time to lose. I suppose I’ll find him at the old spot,” and he set off at a double-quick pace, five miles an hour at least, without appearance of effort, in the direction of Simpson’s restaurant in the Strand.\nJust a word about the man he was going to meet. M. Grabeau was at this time the cleverest and most popular drawing-room entertainer in London. He was a somewhat shy man, and could neither sing nor talk much in public. But for all that he was a veritable variety show in himself. He was a marvellous mimic and ventriloquist, a quick change artist, but above all and beyond all, a conjuror. He could manoeuvre a pack of cards as a captain his company. They were animated and intelligent beings in his hands, obedient to his word of command.\nIn the construction and manufacture of mechanical tricks and toys he was possessed of a skill and ingenuity almost beyond belief. He had himself devised and constructed, with Mr. Edison’s permission, a doll, with a phonograph in her interior, which imitated nature with almost absolute perfection, and sang “Home, Sweet Home,” not merely with the voice, but with the manner and gesture of one of the most popular singers on the concert stage. Indeed, there were malicious persons (rivals, for the most part) who insisted that the voice and gestures of the imitation singer were less wooden than the real.\nMr. Beck had met M. Grabeau at some of those social functions where the introduction of a detective, either as a footman or a musician, had been thought a prudent precaution, and the acquaintance between them had ripened into companionship, if not friendship. Mr. Beck’s profession had an intense attraction for the Frenchman, who knew all Gaboriau’s novels by heart.\n“They are so clevaire,” he would say, with much gesticulation, to the stolid Mr. Beck; “they are too clevaire. The tangle in the commencement is superb. But what you call the unravel is not so good; the knots do not come undone so——”\nThen he would hold up a string tied in a very kink of hard knots, and show it a moment later clean and smooth. It was one of his tricks.\n“But the life of the detective, the real detective you will observe, it is charming. It is beyond the hunt of the fox. It is the hunt of the man. The clevaire man who runs, and what you call doubles, and hides and fights too, sometime. It is glorious; it is life.”\n“Going to waste,” Mr. Beck would mutter disconsolately after one of these interviews, when the Frenchman would spy out and pick up an almost invisible clue. “Going to waste. He would make one of the best detectives in the service, and he fiddles away his time at play-acting and trinket-selling and money-making.” So Mr. Beck would shake his head over this melancholy instance of misplaced genius.\nNaturally, when Mr. Beck got tangled over the vanishing diamond puzzle, he was anxious to consult his friend, M. Grabeau.\n“I hope he’s here,” said Mr. Beck to himself, as he entered Simpson’s restaurant.\nOne look round relieved his mind on that score. M. Grabeau was there at his accustomed place at a corner table, at his accustomed dinner—a plate of roast beef underdone. For M. Grabeau affected English dishes and English cookery, and liked the honest, substantial fare of Simpson’s.\nA stout, good-humoured man was M. Grabeau, with a quick eye, a close-cropped, shiny black head, blue eyes, and a smooth, cream-coloured face.\nHe noticed Mr. Beck the moment he entered the room, and put down the pale green evening paper on which a moment before he was intent.\n“Hullo!” he cried out pleasantly, “that is you? Bonsoir, Monsieur Beck. I hope that you carry yourself well?”\nIt was noticeable about M. Grabeau, that though he could mimic any voice perfectly, when he spoke as M. Grabeau he spoke with a strong French accent, and interlarded his sentences with scraps of French.\nMr. Beck nodded, hung up his hat, and seated himself at the opposite side of the table.\n“Boiled mutton,” he said to the waiter, “and a pint of stout.”\n“The fact is, monsieur,” he went on in much the same tone, when the waiter whisked away to execute his order, “I wanted to have a word with you.”\n“Ah-hah! I know,” said the other vivaciously. “It’s the Harcourt diamonds that have come to you, is it not? The wonderful diamonds of which one talked all the evening at the Harcourt reception. They have disappeared, and his lordship has employed M. Beck, de great detective. I thought you would come to me. It’s all here,” and he handed him across the table the Westminster, with his finger on a prominent paragraph headed in big, black letters:—\n“THE VANISHING DIAMONDS.”\nMr. Beck read it through carefully.\nQuite a sensation has been created in fashionable London by the sudden disappearance—it would perhaps be premature to say robbery—of the famous “Harcourt Heirloom,” perhaps, after the Crown Jewels, the most famous and valuable diamonds in London. Our representative learned from the eminent jeweller, Mr. Ophir, of Bond Street, that he had with his own hands this morning put the jewels into a case, sealed up the parcel and handed it to the Hon. Mr. Sydney Harcourt. Mr. Harcourt, on the other hand, states that when the case was opened in his presence by his fiancée, Miss Ray—for whom the jewels were meant as a wedding present—it was empty. If Mr. Ophir and the Hon. Sydney Harcourt both speak the truth—and we have no reason to doubt either, or both—the diamonds must have vanished through the case and brown paper in the hansom cab en route between Bond Street and Upper Belgrave Street. We need not say that in position and respectability Mr. Ophir stands at the very head of his business, and the Hon. Sydney Harcourt, though he ran loose for a while on the racecourse, contracted no serious pecuniary obligations of which the world knows; and his rank, character, and position should protect him from even the smallest taint of suspicion. All these circumstances, of course, heighten the mystery. We understand that the famous detective, Mr. Beck, at the instance of Mr. Ophir, called later on at Upper Belgrave Street. He has a clue as a matter of course. A clue is one of those things that no well-regulated detective is ever without.\nM. Grabeau watched Mr. Beck eagerly, reading his face as he read the paper.\n“Well,” he asked impatiently, when Mr. Beck at length came to an end, “it is all right there?”\n“Pretty accurate for a newspaper reporter!”\n“And you have got the clue—you, the famous detective.”\nThere was sometimes the faintest suggestion of contempt, a vague hint at a sneer, in M. Grabeau’s tone as he talked to Mr. Beck, which Mr. Beck never appeared to resent or even notice in the least.\n“Well, yes, monsieur, I think I have a bit of a clue. But I came to hear your notion of the business. I have an idea that you are the man to put me on the right track. It would not be the first time, you know.”\nMonsieur beamed at the rough compliment. “You must first tell me all—everything.”\nMr. Beck told him all—everything—with admirable candour, not forgetting the doubling of his own character at Belgrave Street.\n“Well,” he said at last, “what do you think, monsieur?”\n“M. Ophir,” said M. Grabeau shortly, and closed his mouth sharply with a snap like a trap.\n“No,” cried Mr. Beck, in a tone of surprise and admiration. “You don’t say so! You don’t think then there is any truth in the hint in the paper that young Harcourt himself made away with the stones to pay some gambling debts?”\n“No, my friend, believe me. He of them knows nothing more than he has said. It was not what you call the worth of his while. His father, he is rich; his lady, she is beautiful. I have seen her. Respectable Mr. Ophir gives to him the jewels. The risk is too great, even if he have debts, which is not proved.”\n“But how did Mr. Ophir get them out of the case?”\n“He did not ever put them in, my friend.”\n“I thought I told you that three people saw him put them in—two of his own men and the messenger, a Mr. Mulligan, who came from the case-maker.”\n“That messenger—you have seen him then?”\n“Well no. He had not come back to his place of employment when I called.”\n“And he will never come. He has vanished. M. Ophir perhaps could tell where he has vanished, but he will not tell you, believe it well.”\n“But the other two men saw the jewels packed. There were two others besides the messenger.”\n“Hélas! my great detective, are you not a little—I will not say stupid—a Little innocent to-day? You will not think harm of M. Ophir. Très bien. But that which you object, it is so simple. Give me for a moment your watch and chain.”\nHe leant across the table, and as if by magic Mr. Beck’s watch and chain was clean in his hands. A heavy gold watch with a heavy gold curb chain that fitted to the waistcoat buttonhole with a gold bar.\n“Now observe; this will be our case.” With rapid, dexterous fingers he fashioned the copy of the Westminster Gazette into the semblance of a jewel-case with a closely fitting lid. He opened the box wide, put the watch and chain in, so that Mr. Beck could see it plainly inside, and closed the lid with two fingers only.\n“There was no deception.”\nHe pushed the box across the tablecloth to Mr. Beck, who opened it and found it empty. The wide eyes and bland smile of the detective expressed his astonishment.\n“But where has it gone to?” he cried.\n“Behold, it is there,” said M. Grabeau, tapping him on the capacious waistcoat.\nThe watch was comfortably back in Mr. Beck’s waistcoat pocket, for which, by the way, it was a pretty tight fit, and the gold bar of the chain was again securely fastened in his waistcoat buttonhole.\n“I could have sworn I saw you put it into the case and leave it there.”\n“Eh bien! So could the men of this M. Ophir of whom you speak. I put it in your pocket, he put it in his own. Behold all the difference. His plan was, oh! so much easier.”\n“But, monsieur, M. Ophir has the name of a most decent and respectable man.”\nM. Grabeau snapped his fingers in contemptuous anger. “This man,” he said, “I know him, I have had what you call shufflings—dealings—with him. He is cold, but he is cunning. He called me—me, Alphonse Grabeau, one cheat. Now I, Alphonse Grabeau, call him, M. Ophir, one thief, and I will prove it. He has stolen the diamonds. I will help you, my friend, to run him up.”\n“I am much obliged, monsieur. I rather thought from the first you could give me a lift in this case. Where can I see you to-morrow if I have anything to say to you?”\n“I will be in my leetle establishment until two hours of the afternoon. At four I will be here at my dinner. In the evening Iwill be in the saloon of the Duke of Doubleditch. At any time I will be glad to talk to you of this case—of this M. Ophir, the thief. But you must be punctual, for I am a man of the minute.”\n“Quite sure you are going to the Duke’s in the evening?”\n“It is equally certain as a musket.”\n“Oh, very well, if I don’t see you at the shop I will see you at dinner.”\nM. Grabeau drained the last drops of his glass of whisky and water cold, picked up his cane and hat and gloves, took a cigarette from his neat little silver case, and stuck it in his mouth unlighted.\nMr. Beck rose at the same moment.\n“Good evening, monsieur,” he said admiringly, “I must shake hands with you if it was to be the last time. I always thought you were almighty clever, but I never rightly knew how clever you are until to-night. It is a thundering pity that——”\n“What?” asked M. Grabeau sharply, for Mr. Beck paused in the very middle of his sentence.\n“That—that you are not one of us; that your talents didn’t get fair play and full scope in the right direction.”\nM. Grabeau beamed at the compliment, and went out beaming.\nMr. Beck called for a second helping of boiled mutton, and ate it slowly. His face and manner were more vacuous than ever.\nSomething of special importance must plainly have detained Mr. Beck, for it was a quarter past two next day when he walked with a quick, slinging step up to the “leetle establishment” of M. Grabeau, in Wardour Street. He paused for one moment before the window where all sorts of ingenious and precious knick-knacks and trifles were temptingly arranged, then walked into the shop.\nThere was a young man of about nineteen years alone behind the counter; a young man with a long nose, very fleshy at the top, and an unwholesome complexion, and a pair of beady black eyes of preternatural brightness.\n“Good-day, Jacob,” said Mr. Beck. “Master out?”\n“Just gone a quarter of an hour ago.”\n“Coming back?”\n“Not this evening.”\n“Oh, well, I’ll see him later on. By the way, Jacob, that’s a new thing you have got. The coral necklet and brooch there in the window. Will you let me have a peep at it?”\nJacob took the case from the window and set it on the counter. The set was a fine specimen of carved coral linked with fine gold, in a case of faded brown morocco and dingy white velvet that looked as old as themselves.\nMr. Beck inspected the trinkets carefully for full five minutes with intent admiration, turning the case round several times to get a better view. He seemed much interested in a smear of what looked like damp gum on the edge of the leather.\n“What’s, the damage, Jacob?” he asked at last.\n“Not for sale, sir. Master cautioned me four different times—not for sale, no matter what price I might be offered. Not likely to be tempted much, I should say; there is not half a sovereign’s worth of gold in the lot.”\n“Ah!” said Mr. Beck meditatively. Then persuasively: “Well, it is not so much the red affairs I want as the box they are in. My aunt desired me to get her one for a brooch and necklace she picked up cheap at a sale, and this would about do. You were not forbidden to sell the box, were you, Jacob? It doesn’t seem to fit these things as if it were made for them, does it?”\n“It fits them most beautifully, Mr. Beck. But there, don’t go. I don’t say I won’t sell it to oblige a friend of the master, if I get a fair price for it.”\n“What do you call a fair price?”\n“What would you say to a sovereign now?”\nMr. Beck said nothing to a sovereign. He said nothing at all. But he produced the coin in question from his waistcoat pocket and placed it on the counter, turned the contents of the case out in a jingling heap, put the case itself in his pocket, and walked out of the shop.\nThe smart-looking assistant gazed blankly at the stout figure moving rapidly down the street.\n“Holy Moses!” he exclaimed, his triumph tinged with disappointment, “I am sorry I didn’t ask more. He’d ha’ given thirty bob like winking for the old case, and a misfit at that. The Gov. can make a new one in an hour. He’ll be pleased, anyhow.”\nWhether the “Gov.” would be pleased or not was a matter of which the sharp-looking shopboy was (perhaps) the best judge. But somebody else was plainly well pleased. Mr. Beck’s placid face wore a look of innocent contentment. He whistled softly to himself as he walked, and presented all the outward and visible signs of a respectable tradesman whose week’s takings had been well above the average. Mr. Beck let himself in with a latchkey, and walked noiselessly upstairs to his own pretty little sitting-room on the drawing-room floor. He took the old case from his pocket and set it beside another old case—the one he got from Mr. Smithson—on the round table in the centre of the room. There were flowers on the table, and Mr. Beck sniffed their fragrance approvingly; he seemed on this particular afternoon to be pleased with everything.\nThe two cases were alike, though not identical in form; he opened them. Inside the shape was almost precisely the same. Mr. Beck gave a short assenting nod at them, as if he was nodding approval of something he had just said himself. Then he walked to the door, closed it softly, and turned the key in the lock. Any one with an eye to the keyhole—such an eye as Sam Weller graphically described in the witness-box—might have seen Mr. Beck drop into an easy-chair with one of the two cases in his hand, turning it slowly round and round with that look, puzzled yet confident, which so many people wore when that delightful problem “Pigs in Clover” was the rage.\nA little later any one with an ear to the keyhole might have heard Mr. Beck draw a deep breath of relief, and chuckle quietly to himself; then, if the ear was preternaturally acute, might have heard him lock something in his own pet patent safe which stood in a neat overcoat of mahogany in a corner of the room.\n* * *\n“Oh! how can people be so mean?” cried Lilian Ray, in a voice that quivered with indignation.\nShe was standing in the middle of her own drawing-room, and the tattered fragments of the “extra special” edition of the Evening Talebearer fluttered round her like a pink snowstorm. She stamped on the bits of paper with angry little feet.\n“Easy, Lil, easy!” cried Harcourt from the sofa where he sat, a gloomy look on his handsome face. “Take it quietly, my pet. It’s the nature of the beasts. Besides it’s true enough—most of it. I have been as they say, ‘a wild young scamp.’ ‘No one knows the amount of my debts’—because there aren’t any. ‘Mr. Ophir is a gentleman of unimpeachable respectability.’ ‘This is a most unpleasant mystery for the Hon. Sydney Harcourt.’ There’s no denying that’s true, anyway.”\n“I wonder at you, Syd—you, a great strong man, to sit there quietly and hear such things said!” She turned on him sharply, her blue eyes very bright behind the unshed tears.\n“But I haven’t heard them, Lil.”\n“Oh, well, you know what I mean. Why don’t you stamp this thing out, and teach those vile slanderers a lesson they would never forget? Why don’t you go straight to their low den, wherever it is, and—and—oh, how I wish I was a man, for their sake!”\n“Glad you’re not, Lil, for my sake,” he answered, in a tone that brought the quick blood to her cheek. “It’s because you are a woman, and the dearest little woman in the world, that you flare up like this. But you must not think I’m not riled by the half-lies of those cads, though I try to grin and bear it. There are lots of people will take the lies for gospel truth. I’m so thankful that you——”\n“Is it me? How dare you dream of such a thing, sir? The notion that I’d——”\nShe ran to him impetuously, and played with his curls as she bent caressingly over him. “My poor boy, I am so sorry to see you worried. If there was anything in the world that I could do! Now, now, don’t take an unfair advantage because I was good to you. I would much rather sit on the sofa, please.”\nA sharp knock came to the door, and Lilian was certainly sitting on the sofa, and at the extreme end of it, panting a little, when the footman entered.\n“Mr. Beck, sir,” said the footman.\n“Show him up. ‘What does the fellow want now, I wonder?”\n“I won’t detain you a moment, Mr. Harcourt,” said the imperturbable Mr. Beck, walking quietly into the room.\n“Oh, I beg your pardon, Mr. Beck,” stammered Harcourt, “I did not know; that is to say, I was engaged.”\n“So I see, sir,” said Mr. Beck drily, with a look at Lilian that sent the blood in a sudden flame to her cheek. “But I think the young lady will spare a moment or two from other business for what I have to say and to show.”\n“You have got a clue, then?”\n“Well, yes, I think I may say I have got a clue.”\nHe took from his coat-tail pocket the old jewel-case which he had purchased for a sovereign, and set it on the table, pushing aside some costly trifles to make place for it, in the full gleam of the electric light.\n“You see this, miss. Is it at all like the case that came with the diamonds?”\n“The case that came without the diamonds you mean, Mr. Beck,” said Lilian smiling. “It is just like it in shape, but the other was quite new and shining.”\n“That is a detail, miss. A clever hand could make that little change of new to old in half an hour. Now will you kindly open it?”\nAs Lilian opened it she thrilled with the sudden unreasonable notion that the diamonds might be inside. But it was quite empty; faded and empty.\n“The inside is just the same, too,” she said, “only this is so faded. Anything else, Mr. Beck?”\n“Would you oblige me by taking the case in your hands for one moment. No, don’t close it. Now will you kindly put your thumb here, and your other thumb here on the opposite side?”\nMr. Beck guided the slender little thumbs to their places while Harcourt looked on in amazement.\n“Now, miss, kindly squeeze both together.”\nLilian gave a quick, sharp gasp of delight and surprise. For suddenly, as if by magic, there blazed on the slope of faded velvet a great circle of flashing diamonds with a star of surpassing splendour in the centre.\n“Oh! oh! oh!” she cried breathlessly. “They are too beautiful for any one. Oh, Syd,” turning to her lover with eyes brighter than the jewels, “did you ever see anything so beautiful? They dazzle my eyes and my mind together. I cannot look at them any longer,” and she closed the case with a snap, and turning to the placid detective: “Oh, how clever you were to find them, Mr. Beck; wasn’t he, Syd? Do tell us how and where and when you managed?”\nShe so bubbled over with delight and admiration and gratitude that even the detective was captivated. He beamed like a full moon and bowed with the easy grace of a grizzly bear.\n“Will you open the case again, miss,” was all he said. She raised the lid and was struck dumb with blank amazement.\nThe case was empty.\n“A trick case,” said Harcourt, after a pause.\n“Just so, sir, that’s the whole story in three words. About as neat a bit of work as ever came out of hands. No wonder. Twenty thousand pounds, more or less, was the price the maker wanted for it. The closing of the case works the spring, as you see, sir. That’s the notion of it, and not a bad notion either.”\n“And the diamonds are safe inside,” cried Lilian; “they were there all the time, and I have only to squeeze with my thumbs and they will come out again. It’s wonderful! wonderful! I declare I like the case as much as the jewels. I hope the maker will be well paid, Mr. Beck.”\n“He’ll be well paid, miss, never you fear,” said Mr. Beck, a little grimly, “though not perhaps in the coin he expected.”\n“But however did you find it out? You must be most wonderfully clever. I suppose you have worked up some marvellous system that nobody can understand but yourself.”\nMr. Beck actually blushed under this shower of compliments.\n“A little common sense, miss, that’s all. I have no more system than the hound that gets on the fox’s scent and keeps on it. I just go by the rule of thumb, and muddle and puzzle out my cases as best I can.”\n“‘When did you guess the diamonds were in the case?” said Harcourt.\n“I guessed it, sir, when I saw Mr. Ophir, and I was sure of it when I saw you. You see how it is, sir; if Mr. Ophir put the diamonds into the case and no one took them out, it stood to reason they were still there, whatever might be the appearance to the contrary.”\n“It sounds quite simple,” murmured Lilian:—“when you are told it.”\n“Of course, when I found my double had been for the case, it made certainty doubly certain.”\n“Your double! Then you were right, Lilian; there were two Mr. Becks.”\n“Of course; I am always light.”\n“Might I ask, sir,” continued Harcourt, “which you are?”\nHe’s the second Mr. Beck, of course, Syd. How can you be so silly? But I want to know where is the first Mr. Beck, the man with the beautiful hands?”\n“The first Mr. Beck, miss, otherwise Mulligan, otherwise Monsieur Grabeau, is in gaol at present, awaiting his trial. He was arrested this afternoon by appointment at Simpson’s restaurant by the second Mr. Beck.”\n\n\nNote the reveal happens at the end of the story, specifically revealed here:\n\n“Will you open the case again, miss,” was all he said. She raised the lid and was struck dumb with blank amazement. \nThe case was empty.\n“A trick case,” said Harcourt, after a pause.\n“Just so, sir, that’s the whole story in three words. About as neat a bit of work as ever came out of hands. No wonder. Twenty thousand pounds, more or less, was the price the maker wanted for it. The closing of the case works the spring, as you see, sir. That’s the notion of it, and not a bad notion either.”\n“And the diamonds are safe inside,” cried Lilian; “they were there all the time, and I have only to squeeze with my thumbs and they will come out again. It’s wonderful! wonderful! I declare I like the case as much as the jewels. I hope the maker will be well paid, Mr. Beck.”\n“He’ll be well paid, miss, never you fear,” said Mr. Beck, a little grimly, “though not perhaps in the coin he expected.”\n“But however did you find it out? You must be most wonderfully clever. I suppose you have worked up some marvellous system that nobody can understand but yourself.”\nMr. Beck actually blushed under this shower of compliments.\n“A little common sense, miss, that’s all. I have no more system than the hound that gets on the fox’s scent and keeps on it. I just go by the rule of thumb, and muddle and puzzle out my cases as best I can.”\n“‘When did you guess the diamonds were in the case?” said Harcourt.\n“I guessed it, sir, when I saw Mr. Ophir, and I was sure of it when I saw you. You see how it is, sir; if Mr. Ophir put the diamonds into the case and no one took them out, it stood to reason they were still there, whatever might be the appearance to the contrary.”\n“It sounds quite simple,” murmured Lilian:—“when you are told it.”\n“Of course, when I found my double had been for the case, it made certainty doubly certain.”\n“Your double! Then you were right, Lilian; there were two Mr. Becks.”\n“Of course; I am always light.”\n“Might I ask, sir,” continued Harcourt, “which you are?”\nHe’s the second Mr. Beck, of course, Syd. How can you be so silly? But I want to know where is the first Mr. Beck, the man with the beautiful hands?”\n“The first Mr. Beck, miss, otherwise Mulligan, otherwise Monsieur Grabeau, is in gaol at present, awaiting his trial. He was arrested this afternoon by appointment at Simpson’s restaurant by the second Mr. Beck.”\n\n\nPlease analyze all the clues and evidence presented in the story and identify who the culprit is. Explain your reasoning step by step, considering:\n1. The motives of different characters\n2. The opportunities each character had\n3. Any physical evidence or alibis\n4. (Most Important) The reveal information provided in the final segment\n\nWho is the culprit (or culprits, if more than one) and why? Answer in the form:\nCULPRIT: <name(s) here>\n\nSUSPECTS: <names(s) for all suspects here>\n\nREASON: <reasoning>",
          "solution": "CULPRIT:  \nAlphonse Grabeau – professional conjuror and “quick-change” artist – acting under two other aliases:  \n• “Mulligan”, the workman who made and delivered the new jewel–case  \n• the first, bogus “Mr. Paul Beck” who called for the case in Belgrave Street.\n\nSUSPECTS CONSIDERED:  \nAlphonse Grabeau/Mulligan/fake Beck; Mr. Ophir (the jeweller); the Hon. Sydney Harcourt; Miss Lilian Ray; Mr. Smithson (the case-maker); the genuine Mr. Paul Beck (detective).\n\nREASON:\n\n1. Motive  \n   – £20,000 worth of Harcourt diamonds. Grabeau’s whole plan is shaped round securing them.\n\n2. Opportunity  \n   (a) As “Mulligan” he talks his way into Smithson’s shop, volunteers to make the new case, takes it home overnight, and builds into it a conjuror’s spring panel.  \n   (b) Next morning he delivers the apparently perfect case to Mr. Ophir and remains in the shop while the jeweller fills and seals it, so he knows the diamonds are really inside and that no one will suspect the case itself.  \n   (c) Later, disguised as a stout, red-cheeked “Mr. Paul Beck”, he hurries to Belgrave Street, asks for the box, pockets both case and wrapping and escapes in a hansom before the genuine detective can arrive.\n\n3. Physical evidence and behaviour  \n   • Two different “Mr. Becks” arrive ten minutes apart. The first keeps his back to the light, wears rouge, and bolts as soon as he has the case – classic quick-change tactics.  \n   • “Mulligan” never returns to Smithson’s after pay-time – he has vanished.  \n   • Grabeau is known for exactly the sort of mechanical trick the empty jewel-case proves to be: a squeeze on opposite sides causes a secret compartment to open or close.  \n   • The real Detective Beck secures an old case from Grabeau’s own shop, discovers the spring, duplicates the squeeze in Lilian’s presence, and the diamonds flash into view – proof they never left the case at all.  \n   • Finally, Detective Beck arrests Grabeau “by appointment” at Simpson’s; the story ends with the announcement that “the first Mr. Beck, otherwise Mulligan, otherwise Monsieur Grabeau, is in gaol.”\n\n4. Consequences  \n   Mr. Ophir, Sydney Harcourt and everyone else are cleared; the only person who both engineered the hiding-place and tried to carry it off is Grabeau.\n\nTherefore the sole offender is the quick-change artist:\n\nCULPRIT: Alphonse Grabeau (alias Mulligan, alias the false “Mr. Paul Beck”).",
          "length_warning": "",
          "model": "o3",
          "border_sentence": "“Will you open the case again, miss,” was all he said. She raised the lid and was struck dumb with blank amazement.",
          "reveal_segment": "“Will you open the case again, miss,” was all he said. She raised the lid and was struck dumb with blank amazement. \nThe case was empty.\n“A trick case,” said Harcourt, after a pause.\n“Just so, sir, that’s the whole story in three words. About as neat a bit of work as ever came out of hands. No wonder. Twenty thousand pounds, more or less, was the price the maker wanted for it. The closing of the case works the spring, as you see, sir. That’s the notion of it, and not a bad notion either.”\n“And the diamonds are safe inside,” cried Lilian; “they were there all the time, and I have only to squeeze with my thumbs and they will come out again. It’s wonderful! wonderful! I declare I like the case as much as the jewels. I hope the maker will be well paid, Mr. Beck.”\n“He’ll be well paid, miss, never you fear,” said Mr. Beck, a little grimly, “though not perhaps in the coin he expected.”\n“But however did you find it out? You must be most wonderfully clever. I suppose you have worked up some marvellous system that nobody can understand but yourself.”\nMr. Beck actually blushed under this shower of compliments.\n“A little common sense, miss, that’s all. I have no more system than the hound that gets on the fox’s scent and keeps on it. I just go by the rule of thumb, and muddle and puzzle out my cases as best I can.”\n“‘When did you guess the diamonds were in the case?” said Harcourt.\n“I guessed it, sir, when I saw Mr. Ophir, and I was sure of it when I saw you. You see how it is, sir; if Mr. Ophir put the diamonds into the case and no one took them out, it stood to reason they were still there, whatever might be the appearance to the contrary.”\n“It sounds quite simple,” murmured Lilian:—“when you are told it.”\n“Of course, when I found my double had been for the case, it made certainty doubly certain.”\n“Your double! Then you were right, Lilian; there were two Mr. Becks.”\n“Of course; I am always light.”\n“Might I ask, sir,” continued Harcourt, “which you are?”\nHe’s the second Mr. Beck, of course, Syd. How can you be so silly? But I want to know where is the first Mr. Beck, the man with the beautiful hands?”\n“The first Mr. Beck, miss, otherwise Mulligan, otherwise Monsieur Grabeau, is in gaol at present, awaiting his trial. He was arrested this afternoon by appointment at Simpson’s restaurant by the second Mr. Beck.”"
        }
      }
    }
  ]
}